[
    {
        "Title": "birders mexico louise lindsey merrick natural environment series",
        "description": "Over the past 35 years, hundreds of thousands of readers have agreed: This is the classic guide to \"living, traveling, and taking things as they come\" in Mexico. Now in its updated 14th edition, The People's Guide to Mexico still offers the ideal combination of basic travel information, entertaining stories, and friendly guidance about everything from driving in Mexico City to hanging a hammock to bartering at the local mercado. Features include: -> Advice on planning your trip, where to go, and how to get around once you're there -> Practical tips to help you stay healthy and safe, deal with red tape, change money, send email, letters and packages, use the telephone, do laundry, order food, speak like a local, and more -> Well-informed insight into Mexican culture, and hints for enjoying traditional fiestas and celebrations -> The most complete information available on Mexican Internet resources, book and map reviews, and other info sources for travelers",
        "authors": "['Carl Franz', 'Lorena Havens']",
        "infoLink": "https://play.google.com/store/books/details?id=I2YZgJJXj1YC&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This classic is a &quot;must&quot; for any birder studying for a Mexico trip. Species, tips on finding them, and areas of interest are wonderfully described. Details on plants and trees are a big plus as these are hard to come by elsewhere. After looking in vain for Wauer's book, I'm delighted it's back in print. A good companion to Howell's Finding Birds in Mexico.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a pleasant, well-written book, that transported me throughout some of Mexico's natural regions from my armchair. Those with experience searching for birds in Mexico will find that this book awakens charming memories. Others may long wistfully to explore the beautiful and unusual habitats found south of the border. I particularly liked chapter 12 - &quot;Place of the Tufted Jay&quot;, which included a photo of the Hotel Villa Blanca, where I have also stayed while pursuing the local endemic, the Tufted Jay. The author watched Swifts from the roof of the hotel.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "I would assume that if you are interested in this book it is because of a future or past birding or natural history tour of Mexico. This book is a great trip and will tantilize you with the biological treasures of places that you dream about or rekindle the memories of places you have visited. If you are familiar with birding trip reports such as found in Blake Maybank's site, this is similar but with a more literary touch. These are stories of great places told by a very well informed naturalist.This is not a site guide like Howell's or Wheatly & Brewer's books. There are no detailed directions or maps here and some places, even the very well birded San Blas area, are not included in the book. It is still a pleasure to read and will give you some practice on what to expect in the deserts, thorn scrub, cloud forests, and tropical lowlands of Mexico. There are good references to other natural history studies of the country and excellent sections on practical travel information. A very worthwhile read.Also for readers that enjoy this book Roland Wauer has also written an excellent guide in \"A Birder's West Indies\" for all the islands of the Caribbean Sea.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "skye the island its legends",
        "description": "Features tales of monsters who dwell in lakes, of small people who trap humans in earthen mounds where time stands still; of dark, shape- shifting spirits whose cloak of human form is betrayed by the sand and shells which fall from their hair. This work takes us far beyond Christian times to the edge of the Iron Age.",
        "authors": "['Otta F. Swire']",
        "infoLink": "http://books.google.com/books?id=C49LuAEACAAJ&dq=Skye%3B:+The+island&hl=&source=gbs_api",
        "categories": "['Legends']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The late Mrs Swire writes passionately about the place she loved. Locations are described clearly, enabling anyone but the very worst navigators to find what she describes. She also gives background information for most of the places she lists, along with appropriate legends and histories. No corner of the island is ignored in her writings. Many of the sites she discusses are illustrated with photographs and/or maps. In short, this is an essential guide when visiting Skye.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I loved the language and stories in this book. It was delightful to be reading history one second and then jumping into a faerie tale. Skye is imbued with the magic of storytelling, which is what we humans seem to do best.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "mexico health and safety travel guide",
        "description": "A directory of more than 225 English-speaking physicians and 50 of the best hospitals in more than 40 popular vacation spots in Mexico, this guide is suitable for the travellers who fall ill while on vacation there. It includes hospital listings, services and specialities available, English-speaking administrative and medical liaisons, and more.",
        "authors": "['Curtis P. Page', 'Robert H. Page']",
        "infoLink": "http://books.google.com/books?id=TmFnu8eEyUAC&dq=Mexico:+Health+and+Safety+Travel+Guide&hl=&source=gbs_api",
        "categories": "['Health & Fitness']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Finally, an authoritative response for anyone who has suffered Montezuma's Revenge+ by two highly-respected medical doctors who have probably treated more of it than most.Dr.'s Page have undertaken an English language medical tour for those of us who have encountered the nightmare of too many tacos and other ills South of the Border. In what normally can be a maze of medical horrors for us gringos on vacation, they have investigated and simplified with easy instructions and directions good,safe medical help. This book is as necessary as packing your toothbrush for a trip. I would hope they eventually get to do a book for other countries for us Americanos.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is a very thorough, well-researched guide to Mexico-specific travel. I frequently travel to Baja California with church missions teams, and knowing how to get to the best hospitals and clinics (not to mention being able to identify the good v. bad ones) is a tremendous resource. Also serves as a medical field guide, should there be an absence of clinics in your immediate area (or if you need to act before emergency services would arrive...which you would have called in the numbers found through this book!). Very helpful resource.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The expert and collaborative work of physicians Robert and Curtis Page, Mexico: Health And Safety Travel Guide is thoroughly \"user friendly\" guide to English-speaking physicians and hospitals accessible to forty of the most popular vacation spots in Mexico. Enhanced with 106 maps, 60 reference charts, a symptom index, and more than 235 b/w photographs, the Mexico: Health And Safety Travel Guide also includes easy-to use indexes for pharmaceuticals and medical translations. This highly portable specialized travel guide includes invaluable tips suggestions how to carry additional medication in case of loss, avoiding and treating diarrhea, malaria prevention, wound and skin care, insect repellents, pain management, motion sickness, even a favorite cold remedy. If you are planning a vacation or business trip to Mexico, then begin your travel preparations by securing a copy of the Mexico: Health And Safety Travel Guide.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "If it is true that over fifty percent of travelers become ill while on vacation, then this is a guide you may want to take on your next vacation. The Mexico Health and Safety Travel Guide also includes 106 maps, 60 reference charts and 235 photographs (physicians and locations). The main chapters include:Before You Go - Medical history and emergency information as well as information on immunizationsSafety and Security - Covers information on pharmacies and prescription drugsTravel Health Special Needs and Concerns - traveling while pregnant or with small childrenInfectious Diseases - helpful advice on avoiding tick bitesThe doctors listed speak English and can be found near the top 40 popular vacation spots. Each listing states the price for an office consultations, office hours, address, work and mobile numbers, pager number and whether or not they do house calls in the local area.This book will be helpful for travelers, but could also be helpful for retirees, business travelers and cruise ship passengers. Travel tips throughout explain why you should not drink the local water or how you can avoid illness by peeling raw fruits and vegetables yourself.Mexico Health and Safety Travel Guide is an essential guide you will want to take with you when traveling in Mexico, especially if you travel there often or stay for over a week.~The Rebecca Review",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "lonely planet argentina uruguay paraguay 2nd ed",
        "description": "This revised edition includes increased coverage of Buenos Aires, information on national parks, background on politics and culture, accommodation options for a range of budgets and a new section on outdoor activities in Patagonia. It also features coverage of the Falkland Islands.",
        "authors": "['Wayne Bernhardson']",
        "infoLink": "http://books.google.nl/books?id=U5JjaSt5NZQC&dq=Lonely+Planet+Argentina,+Uruguay&hl=&source=gbs_api",
        "categories": "['Argentina']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This guide badly needs updating! I found that a lot of addresses for museums and tourist information have changed (I visited Argentina in October-December 1999). Though the included local maps are usually very good and easy to read a first stop should always be the tourist office (ask locals for present address) for more up to date information. Background information on history is excellent. Generally I found the guide very helpful but it lacks enthusiasm for this beautiful country and does not really entice one to go. More descriptions about the essential character of individual towns would help.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "It is certainly a useful book to have with you when travelling in these places, but I was a bit disappointed on the &quot;opinion&quot; side of it. I.e. it's a very useful reference resource in your backpack, but it's rather hard to plan a trip relying on it. In city desctiptions, the author tends to get carried away by colonial history and gives hardly any insight at all WHY would someone want to go to these places. So: have one with you when you leave home, but get some others to back you up before you decide where to go.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "The information on anything but the major cities was fairly skimpy. It was organized reasonably well by geographic location, but within a location was difficult to use. The maps were decent and conveniently placed. Recommendations on restaurants were sparse and inaccurate.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the siberian bam guide rail rivers road northeast russias siberian bam railway lena river kolyma highway trailblazer guides",
        "description": "Expanded from the first edition (Siberian BAM Railway Guide) this book now also includes other forms of transport in this fascinating but rarely-visited north-eastern corner of Russia, the Siberian BAM region. Note: this book covers a different area from the Trans-Siberian Handbook (also from Trailblazer). * Practical information - full details of how to get to the region, where to stay, what to see and how to get around; plus 30 maps * City guides and maps - Taishet, Bratsk, Zheleznogorsk-Ilimski, Ust-Kut, Lena, Severobaikalsk, Nizhneangarsk, Taksimo, Kuanda, Novaya Chara, Tynda, Novy Urgal, Komsomolsk-na-Amure, Amursk, Vanino, Sovetskaya Gavan, Khabarovsk, Kirensk, Magadan, Aldan & Yakutsk * BAM Railway route guide - covering the 3400km of mountain railway, closed until 1991, from north of Lake Baikal to the Pacific, with detailed information on how to take the train and what to see * Lena River route guide - the entire river from source to Arctic Ocean, including the 1988km served by steam-driven passenger boats * Kolyma Highway route guide - the rugged land route from Yakutsk to Magadan, built by Stalin's political prisoners",
        "authors": "['Athol Yates', 'Nicholas Zvegintzov']",
        "infoLink": "http://books.google.com/books?id=oq8EAAAACAAJ&dq=The+Siberian+BAM+Guide:+Rail,+Rivers&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book contains very concise information about the route, cities and history. Such information is difficult to obtain in other books, and so very precious.The book is also fun for train lovers to read.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "A great travel guide to a part of the world that is not often covered in such detail. The book is eight years old (as of 2009) and so not much good any more for prices and hotel recommendations, but this it is such a wonderful resource for planning a route and planning where to make stops on a BAM voyage.The book also includes some great coverage of places north of the railway, including route planning information for a trip all the way to the Arctic Ocean.Good stuff here.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the connecticut guide state guide travel series",
        "description": "\"Comprehensive . . .well organized . . . should be carried in every glove compartment of every car that traverses Connecticut highways.\"-Journal Inquirer, Manchester, Connecticut Welcomed and praised by newspapers across the state, Explorer's Guide Connecticut gives visitors and residents alike detailed descriptions of attractions and little-known tips about the Nutmeg State. Veteran travel writers Barnett Laschever and Andi Marie Cantele again bring you authoritative advice on what to see, where to eat, and where to stay in the new edition of this trusted guide. Covering the state from the mountains in the north to the long and varied coastline in the south, from cities to backroads, this revised and expanded edition features extensive descriptions and detailed maps to guide readers effortlessly along many pleasant journeys for individual travelers and families. Historic and exciting Mystic Seaport, the rich collections of the Yale University museums, beach and skiing trips, and the many state forests and parks of Connecticut are just a handful of the attractions covered. Regional and downtown maps feature helpful icons and indicate places that are wheelchair-accessible, pet- and family-friendly, and of other special value. Features include: an alphabetical \"What's Where\" subject guide to aid in trip plan; regional and downtown maps; handy icons that point out family-friendly attractions, wheelchair access, special value, and lodgings that accept pets.",
        "authors": "['Andi Marie Cantele']",
        "infoLink": "http://books.google.com/books?id=OYJJvjuG7SsC&dq=The+Connecticut+Guide+(State+Guide+Travel+Series)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is one of the most painstakingly well-done travel guides you'll find on any region anywhere, let alone CT. The book intelligently divides the state into seven regions: Far Northwest (Litchfield Hills), Central Valley, Far Northeast, Seafaring Southeast, Lower CT River Valley, Southwest Coast, and the Housatonic and Naugatuck River Valleys. Each section starts with a clear map showing the towns and major roads in detail, along with an inset showing how that section fits into the state. The text is filled with wonderfully researched stories of local history, interspersed with logically laid out descriptions of local events, attractions, seasonal activities, and places to stay and eat. If you're serious about touring Connecticut and you want to carry along just one book, this is the one!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "For full coverage of any travel destination, it often takes two different kinds of travel book. First, there are the books on the history, social and cultural highlights of an area. Many of these books have glossy pictures. Second, there are books with maps, directions, up-to-date information on prices and hours and a quality rating system.This book has both. Ziffer gives full and interesting details on each of the different regions of Connecticut. Her history starts with geologic origins of the region, extends through Native American and Colonial times and continues up to the present. This alone is fascinating reading. She also gives good information on cultural, artistic and historic places of interest. Like a Mobil Travel Guide, she includes listings for various restaurants with indications of how expensive your meal will be. You can probably find the right hotel for you using this book.However, this book is not a substitute for a Mobil Travel Guide-type book in a strictly practical sense. The maps are not detailed or particularly helpful for navigation. Restaurants, hotels and B&amp;B's are reviewed, but there is no overall rating system. Unlike a Mobil Travel Guide, this book has many black and white pictures. And, the detail provided about each town provides a good sense of just what kind of place you will find. Ziffer gives many suggestions for interesting things to do, including various festivals and events throughout the year.I highly recommend this book for anyone planning travel to or through Connecticut. It is a particular aid to anyone who likes to scratch below the surface of a place. I would also recommend a Mobil Travel Guide or Fodor's to bring along in the car for the nitty gritty details of the trip. But, I would start my trip planning here.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "lonely planet eastern caribbean 2nd ed",
        "description": "First edition of a guide to the Eastern Caribbean including Trinidad and Tobago, Barbados and Martinique. Provides cultural and historical background, information on accommodation, getting around and between the islands, outdoor activities and local customs and events. Includes 80 maps, language section, a glossary and an index.",
        "authors": "['Glenda Bendure', 'Ned Friary']",
        "infoLink": "http://books.google.com/books?id=FLMfAQAAMAAJ&dq=Lonely+Planet+Eastern+Caribbean+(2nd+ed)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book covers an array of destinations in the caribbean and does this concisely and informatively without taking away the expectation of when you go. It allows you to plan your trip on it's content and also use it when you are there as a guide. It does not overload you with information, which is great, good to read cover and cover and then skim when needed. great for what it is!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "For a long time, I had been trying to figure out how exactly the Caribbean is 'laid out'. There are so many different independent nations, as well as colonial entities, overseas departments of France, etc. etc., all with their own character, different cultures and mentalities, different things to be discovered... But it was altogether to figure it all out, and even to clearly list down the various separate entities to be visited and discovered. Finally, with the aid of this wonderful Lonely Planet guidebook, I am able to establish that the Caribbean's small islands (i.e. excluding Cuba, Jamaica, Purto Rico, Haiti and Dominican Republic) include a total of 9 independent nations and 10 colonial entities. This guidebook covers most of them, namely those in the Eastern part of the Caribbean, and provides wonderful insights into the culture, history and attractions of each. As always, excellent travel advice is provided, ranging from what to do locally for having a great holiday (regardless of what you are looking for), to the also important issue of how to move around in this wonderful region. This guidebook is a tool everyone should pack in their luggage.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "explore costa rica",
        "description": "Insight Explore Guides: pocket-sized books to inspire your on-foot exploration of top international destinations. Experience the best of Costa Rica with this indispensably practical Insight Explore Guide. From making sure you don't miss out on must-see attractions like the Arenal Volcano, to discovering hidden gems, including the remote Osa Peninsula, the easy-to-follow, ready-made walking routes will help you plan your trip, save you time, and enhance your exploration of this fascinating country. Practical, pocket-sized and packed with inspirational insider information, this will make the ideal on-the-move companion to your trip to Costa Rica Enjoy 12 irresistible Best Routes to walk, from the capital San Jos to the cloud forest of Monteverde Features concise insider information about landscape, history, food and drink, and entertainment options Invaluable maps: each Best Route is accompanied by a detailed full-colour map, while the large pull-out map provides an essential overview of the area Discover your destination's must-see sights and hand-picked hidden gems Directory section provides invaluable insight into top accommodation, restaurant and nightlife options by area, along with an overview of language, books and films About Insight Guides: Insight Guides is a pioneer of full-colour guide books, with almost 50 years' experience of publishing high-quality, visual travel guides with user-friendly, modern design. We produce around 400 full-colour print guide books and maps as well as phrasebooks, picture-packed eBooks and apps to meet different travellers' needs. Insight Guides' unique combination of beautiful travel photography and focus on history and culture create a unique visual reference and planning tool to inspire your next adventure.",
        "authors": "['Rough Guides']",
        "infoLink": "https://play.google.com/store/books/details?id=c-ycDwAAQBAJ&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If I'd wanted a lecture on an author's opinions of ecology, I'd have been better off buying a textbook. The nuts and bolts of what a guidebook should provide -- descriptions and details of hotels, restaurants, and tourist attractions are presented in a shopping list style that is less useful than the yellow pages.I want my money back!",
                "review/helpfulness": "12/18",
                "num_reviews": 18
            },
            {
                "review/text": "Having lived in Costa Rica for nearly two years and traveled extensively throughout the country, Explore Costa Rica is the ultimate travel guide to have on hand. The book has excellent maps and time saving tips that I wish I had known about prior to my travels. I have used Pariser's books on many occasions and believe they are the best resource on the market. Most importantly, Explore Costa Rica provides the traveler with information that goes well beyond which hotels to avoid and which bus to catch. It provides a fresh perspective that many travellers seek: an historical, social, cultural, and environmental understanding of the places they visit and grow to love.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "The focus of this book underlines Costa Rica's status as the ecotourism capital of Latin America, and almost a quarter of the main introduction is devoted to the country's flora and fauna. Pariser is of the school that believes that selling the environment as a tourist attraction will contribute to its preservation in a commercial world. Minimum impact is an obvious consideration as he guides visitors gently through the rainforests or along the coral reefs. However, conventional city trippers won't be disappointed by Harry's 21 pages of detailed accommodations listings for San Jose, and it's significant that pricewise he starts at the top and works down. Smaller numbers of upscale visitors will leave fewer footprints than backpacking masses from Lonely Planet. Harry's eco-friendly values are also reflected in his detailed six-page chart of public bus services. Sightseeing from behind the wheel of a polluting vehicle is not his way. The food, festivals, and sports and recreation sections of this book are also very good, and you'll even find a precise guide to the local radio stations and detailed tips on volunteering. This book has an individual flair but it's as professional as they come. It's a welcome change from the stale consumerism of Frommer and Fodor. END",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "I just went to Costa Rica a few months ago and found this guide above the rest in depth and eco-friendly suggestions. Mr. Praiser is a great travel writer and it is little surprise that he won the &quot;Lowell Thomas&quot; award for best travel book.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "I found the organization of this book rather good. Particularly useful is the itinerary list on the publisher's website which helps you to select among the many options available, and there are updates available there as well. There are many good suggestions for choosing a nature tour, and the coverage of national parks is outstanding.I went on a great hike which I found detailed in this guide book. The background information on society, culture, as well as other information on the country of Costa Rica, I found very valuable. It put the country in perspective for me. He obviously cares about environmental issues and this is different from other guide books I have read.I found the photos top notch, and was drawn to the book first by the cover photo of the volcano. In all, I had a great trip, helped by following the author's suggestions for things to do, and places to stay.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "In \"Explore Costa Rica\", Harry Pariser draws upon his considerable experience and expertise as a travel guide writer to compile one of the best and most 'user friendly' guides to what Costa Rica has to offer the business traveler and vacationer. Now in a newly expanded and updated fifth edition, \"Explore Costa Rica\" is a 668 information packed compendium that is enhanced with the inclusion of 38 maps, 30 color photos, and 80 black-and-white images. All types and price ranges of accommodations also include some of the best nature lodges to be found anywhere in Central America. Recreational resources and recommendations ranges from whitewater rafting, surfing, horseback riding, snorkeling, and scuba diving, to birdwatching, hiking, whale watching, canopy climbing, and ballooning. Complete and 'visitor friendly' background information is provided for Costa Rican animals, rainforests, history, and culture. In addition to travel basics for neighboring nations, \"Explore Costa Rica\" also features volunteer opportunities, language schools, environmental organizations, and covers transportation by car, bus, plane, and ferry. Enhanced with the addition of thousands of thematically appropriate websites, phone and fax numbers, and access to internet updates, \"Explore Costa Rica\" is an invaluable and superbly organized resource for planning any sort of trip to or within one of the true gems of Central America.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I recently obtained a copy of Harry Pariser's guide to Costa Rica. I was very excited about reading his book. A couple of years ago I spent over six months travelling through Costa Rica and had happened upon an earlier guidebook by Mr. Pariser at a hotel I stayed at in the Osa Peninsula. I enjoyed it immensely. So, as I opened my copy of 'Costa Rica Complete', I anticipated thorough research and genuine enthusiasm to be displayed in the book. I was not in the least disappointed. It is refreshing to feel the writer's personality shine through the text and he does a thorough job of detailing the information a fellow traveller needs to make his or her trip a fantastic one. I highly recommend this book!",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a wonderful introduction to Costa Rica. My girlfriend and I journeyed there and, with the help of this book, had a wonderful time. It has a lot of information on the less-frequented spots of the many beautiful national parks, good maps, and the way it is organized and indexed really makes things easy as you move from town to town (and beach to beach!). Recommended.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "As the President and Founder of the B &amp; B association, I have visited more than 300 of our B &amp; B's . I highly recommend Harry S. Pariser's &quot;Explore Costa Rica&quot;. Mr. Pariser travels frequently to Costa Rica and his book is attractively designed and well written and updated. He also supplies information on more of the out-of-the-way places wich other guides fail to mention.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Harry Pariser's &quot;Explore Costa Rica&quot; is the best coverage of Costa Rica that I've seen--with much detail on rainforest tours, kayaking, biking and diving excursions, remote lodges, large and small hotels inland and on the Caribbean and Pacific Coasts. Whether you want to trek through the jungle, watch thousands of wading birds, frolic with the monkeys or relax on a gorgeous beach, this book is a valuable planning tool.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "travelers tales grand canyon true stories",
        "description": "A compelling collection of stories of the Grand Canyon includes selections from David Brower, Barry Lopez, Colin Fletcher, Edward Abbey, Page Stegner, Terry Tempest Williams, and others. Original.",
        "authors": "[\"James O'Reilly\", \"Sean O'Reilly\", 'Larry Habegger']",
        "infoLink": "http://books.google.com/books?id=WZTcAAAACAAJ&dq=Travelers%27+Tales+Grand+Canyon:+True+Stories&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a marvelous book, and why didn't someone think of it before? One of the very premier places in the world - an essential place of pilgrimage for so many non-Americans who visit the country for the first time. For all Americans it is a \"at least once in a life\" place to visit.The essence of this guide is the 32 short stories - different perspectives on the Grand Canyon experience, written by almost that many different authors. There are the famous authors: Edward Abbey, Colin Fletcher, Page Stegner. There is the \"close call\" told by Stewart Udall, environmentalist and former Secretary of the Interior. There is the political advocacy of David Brower, long time Executive Director of the Sierra Club, who admits that he was partially responsible for the death of Glen Canyon, and now advocates the tearing down of dams. And there are the many other stories, some harrowing, some delightful, which should increase the reader's respect for one of earth's \"sacred places.\" Not all the stories obviously are of equal impact or quality, but that issue is unintentionally covered in a story by Barry Lopez, who quotes Thoreau: \"The woods would be very silent if no birds sang except those that sang best.\"The book also contains some excellent maps, and a chart on the geological cross-sections. There is a brief introduction; the five sections of the book are preceded by black and white \"wood block\" drawings of the canyon, and there is a practical guide at the end, including a vital bibliography.It was virtually impossible to pick a favorite story, far better to identify three: Stegner's lyrical and philosophical \"Revelation\"; Janecek's cautionary \"Flash Flood\"; and Abbey's very own \"close call,\" entitled \"Havasu.\"For anyone considering a Grand Canyon visit, this is a wonderful guide for both the body and spirit.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have read many books on the Grand Canyon, including ones by the authors selected for this book (i.e. Ghiglieri, Abbey, Fletcher), so a lot of the material was already known to me. However, as an overview for someone who has not read a lot about the Canyon it would be a good start. I like Travelers' Tales books and have several, I think they are doing a great job providing a insights not available in \"regular\" travel books.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "hungarian lonely planet phrasebook",
        "description": "Lonely Planet Hungarian Phrasebook & Dictionary is your handy passport to culturally enriching travels with the most relevant and useful Hungarian phrases and vocabulary for all your travel needs. Get local recommendations for thermal baths and the best wine -all with your trusted travel companion. With language tools in your back pocket, you can truly get to the heart of wherever you go, so begin your journey now! Get More From Your Trip with Easy-to-Find Phrases for Every Travel Situation! Order with confidence, explain food allergies, and try new foods with the menu decoder Save time and hassles with vital phrases at your fingertips Never get stuck for words with the 3500-word two-way, quick-reference dictionary Be prepared for both common and emergency travel situations with practical phrases and terminology Meet friends with conversation starter phrases Get your message across with easy-to-use pronunciation guides Inside Lonely Planet Hungarian Phrasebook & Dictionary Full-colour throughout User-friendly layout organised by travel scenario categories Survival phrases inside front cover for at-a-glance on-the-fly cues Covers Basics - time, dates, numbers, amounts, pronunciation, reading tips, grammar rules Practical - travel with kids, disabled travellers, senior travellers, sightseeing, business, banking, post office, internet, phones, repairs, shopping, bargaining, accommodations, directions, border crossing, transport Social - meeting people, interests, feelings, opinions, going out, romance, culture, activities, weather Safe Travel - emergencies, police, doctor, chemist, dentist, symptoms, conditions Food - ordering, at the market, at the bar, dishes, ingredients The Perfect Choice: Lonely Planet Hungarian Phrasebook & Dictionary, a pocket-sized comprehensive language guide, provides on-the-go language assistance. Great for language students and travellers looking to interact with locals and immerse themselves in local culture. About Lonely Planet: Started in 1973, Lonely Planet is the world's leading travel guide publisher with guidebooks to every destination on the planet. Check out our Fast Talk Phrasebook mobile app for on-the-go language needs. (Available languages: German, Latin Spanish, European Spanish, French, and Italian.)",
        "authors": "['Lonely Planet']",
        "infoLink": "http://books.google.nl/books?id=jBcnyQEACAAJ&dq=Hungarian:+Lonely+Planet+Phrasebook&hl=&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Well, I am a native speaker of Hungarian myself, so I was quite curious to see this book.For the most part, I found it very good.The main part of the book, the phrases are quite good and natural - it really shows that they had native speakers check it.The phrases cover all sorts of issues from shopping to visiting a doctor or even dating and having sex!The boxed texts on culture are also quite good and often amusing.It has only 12 pages on grammar, but that's quite spot on.It does include a box on present tense verb conjugation (taking vowel harmony into account!), and has even devoted a whole page to conjugating four common, but irregular verbs (come, go, eat, drink). Another box conjugates \"to be\" and yet another shows the suffixes for possessions. I guess it's quite OK for the space.The 2000 word dictionary at the back is quite comprehensive.A weaker point is the \"phonetical transliteration\" system used - Hungarian is written fully phonetically in its original form (thankfully also presented here), but the phonetical transliteration provided here for English-speakers may result in blank looks in many cases - you could always choose to ignore it.The intro contains useful facts about the history and roots of the language, though the map showing where Hungarian is supposedly spoken might raise some eyebrows in neighbouring countries! ;-)The layout is attractive, with color illustrations.I even like the cover (different from what is shown on Amazon)- certainly better than a kitshy horseman or traditionally clad dancer could have been! ;-)Overall: RECOMMENDED.If you are planning to spend any time away from the major cities and tourist areas, you will find it VERY useful!",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "With help from this guidebook I was able to pronounce words off of menus well enough to where servers were pleased with me and eager to help me out. My last phrasebook left people in Poland laughing at me as the phonetic guides led me astray. The problem with this guide is that it was not correct with some of the basic words a traveller would want. Our hotel staff told us that we were using antiquated, formal versions for certain greetings and interactive words, and gave a lesson on what to say (and when) instead. We also found that we got blank stares when we asked about dinner at a resturant. We pointed out the word in the book and the server looked very confused. I guess this book fails to even provide a correct translation for \"dinner\"...and who knows what else? I was glad to have this book along -- it is basically useful -- but I've got to assume other guides do a better job with getting some of the basics right. If you book at a big hotel you can save a few dollars by getting a free, accurate lesson from the staffers, and forgetting this guide.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "I took one term of Hungarian in college, and I've been to Hungary a few times (but only for a few days each time). So I tried getting this book to relearn some of the language before going back to Hungary this year. It helped me do just that, and I was able to converse with plenty of non-English speaking Hungarians. This is a well-written book.But how much will this book help you if you don't know Hungarian at all? I'm not so sure. To communicate in a language, I think you really need to hear it spoken and painstakingly learn a bunch of vocabulary words (I like using flashcards to do this). I think it will be more of a help to those who already know something about the language, or at least have access to someone who can help them practice it.I'm glad I got this book. I recommend it.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This phrasebook is filled with loads of well-organized information and superb vocab words - I thouroughly enjoyed reading it from cover to cover while on the plane to Budapest. However, once I arrived in Hungary I was a bit disappointed to find that everyone spoke English (at least in the Budapest area). The phrases I tried got a few smiles, but the only truly useful part of the book was the dictionary. It was quite helpful in reading signs, ads, posters, menus etc.In spite of the little use I got out of it, I would still recommend taking this phrasebook to Hungary. It provides a bit of security for the short-term traveler and would become more useful the longer you stayed (especially for those who can speak a bit of Hungarian already or those who are studying the language).",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This pocket book is a must-have for anyone who, like me, has an interest in learning Hungarian or who plans to visit Hungary. Concise & comprehensive, it's a winner. The only drawback is that the 'pronunciation' provided seems to be geared to travelers from the UK &, as such, can cause difficulties for No. Americans. This ancient, beautifully soft, & richly vocalic language is certainly complicated for an English speaker. Along with a T&ouml;rkenczy grammar any traveler should be speedily humming along in party town Budapest. These people are warm, friendly, & openly admire most anyone willing to tackle their tongue, not to mention the cuisine & the wines!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book. It's small enough to just throw in your bag and go when you are exploring a new city. Since moving to Budapest, it has come in handy several times over - and the pronunciation is superb! It has every helpful phrase you need when traveling abroad!I think this book could be used for travelers of any age - though the \"romance\" section may be limited to the younger population.One thing I would like to see in future publications though is maybe a map of the city - or at least a map of the metro.I would buy this book - and others from the series - without hesitation in the future. I am a huge fan of Lonely Planet products so having this book in my library is just the icing on the cake!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I purchased this before a recent trip to Hungary and was pleasantly surprised. It is pocket sized and easy to carry (which wasn't clear to me from the other info on Amazon). It has all the necessary basic phrases divided into useful categories, and a nice little glossary in back. It doesn't offer an extensive vocabulary, but for me it was the right amount and the limit was worth keeping the book small and easy to carry. I would say it is perfect for someone with no or almost no experience with Hungarian who needs just the basics for a trip.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "diving snorkeling cuba lonely planet diving snorkeling great barrier reef",
        "description": "The earth's oceans hold many wondrous surprises-be they the small, colorful \"critters\" off the coast of Papua New Guinea, opportunistic red demon squids in the Sea of Cortes, or naval wrecks in the lagoon of Bikini Atoll. In Fifty Places to Dive Before You Die Chris Santella has invited diving experts from around the world to share some of their favorite destinations, so ardent divers can experience these underwater wonders for themselves-either on location in their SCUBA gear, or at home in their armchair. The fifth in Santella's bestselling \"Fifty Places\" series, the book takes divers from hot-spot destinations like Raja Ampat (off the coast of West Guinea) to old Caribbean favorites like Grand Cayman Isles. Readers will swim among whale sharks off Myanmar, befriend wolf eels off the coast of Maine, and marvel at the giant mola mola of Lembognan, Indonesia. These wonderful creatures-plus the brilliant coral reefs that often provide their backdrop-are captured in 40 gorgeous color photos from the world's greatest underwater photographers. And for readers who want to travel to these breathtaking locales, Santella provides complete \"If You Go\" suggestions to help you plan your trip.",
        "authors": "['Chris Santella']",
        "infoLink": "http://books.google.com/books?id=aK67LQAACAAJ&dq=Diving&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I agree with NM's review. This book is a complete waste of time and money. You can get more useful information talking to your local diveshop or dive travel agent. Over a third of the book gives very general tourist information that you can get from any guide to Cuba. At the back, there are the usual pages of Carribean Fish ID and some more padding.I expected a thorough guide to most if not all, diving sites in Cuba. I have bought other books in this series (Thailand &amp; Belize) and have found them extremely helpful and informative. This book on Cuba is severely lacking in any useful diving information.For example under the Cayo Largo section, the author writes &quot;Cayo Largo has around 30 sites. 3 described below....&quot; What about the rest? The state-owned Puerto Sol diving centers around Cuba are extremely friendly &amp; helpful and each one has a huge board with a geograpically correct map showing all the dive sites in the surrounding area. Would it be that much effort to even photograph those maps and add them to the book?",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "The first thing that struck me when a copy of this book arrived through my letterbox was how thin it was. This is a paper-back book measuring 9\" x 6\" (23cm x 15 cm) containing 92 pages. With 20 of those pages taken up with such information as; Title of the book (again), publisher's information, contents, acknowledgements, how to use the book, overview (history) of Cuba, geography, transportation, sightseeing, entertainment, index, etc, etc, there is precious little room left for the diving information - for which we purchased the book in the first place.For much of the content we are then treated to one specific dive site per page each of which is headed with the following information; Typical depth range, Typical current condition, Expertise required, Access, Site No. After this we are treated to a short dialogue which, in many cases, fails to describe the site adequately and in some cases is exceedingly short. And the shorter the dialogue, the bigger the picture which takes up the rest of the page.Of course the underwater pictures are all of typical Caribbean flora and fauna and the many species of available are almost all mentioned (somewhere!) in order to pad out the text.In short, could have done much better!NM",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "servants of the map stories",
        "description": "\"Luminous....Each [story] is rich and independent and beautiful and should draw Barrett many new admirers.\"-Publishers Weekly, starred review Ranging across two centuries, and from the western Himalaya to an Adirondack village, these wonderfully imagined stories and novellas travel the territories of yearning and awakening, of loss and unexpected discovery. A mapper of the highest mountain peaks realizes his true obsession. A young woman afire with scientific curiosity must come to terms with a romantic fantasy. Brothers and sisters, torn apart at an early age, are beset by dreams of reunion. Throughout, Barrett's most characteristic theme-the happenings in that borderland between science and desire-unfolds in the diverse lives of unforgettable human beings. Although each richly layered tale stands independently, readers of Ship Fever (National Book Award winner) and Barrett's extraordinary novel The Voyage of the Narwhal, will discover subtle links both among these new stories and to characters in the earlier works.",
        "authors": "['Andrea Barrett']",
        "infoLink": "https://play.google.com/store/books/details?id=fM2LFja-oEIC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 9.0,
        "review": [
            {
                "review/text": "Andrea Barrett has done it again. This collection of short stories has all the characteristics that placed Ship Fever and Voyage of the Narwhale among the most accomplished fictions of our time. The lucid and lovely prose, the ruthless honesty, the shocking psychological insight, compassion and deep research of the earlier works is here, but Ms Barrett continues to grow as a writer. These new stories are her most assured, most daring and most wonderfully realized yet. I have followed Ms Barrett's fiction from Lucid Stars, her first novel, to Servants of the Map with growing admiration and wonder. She is a major talent and this is a lovely book.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "I discovered Andrea Barrett when I read Voyage of the Narwhal, an epic story of courage, devotion, and the struggle with the northern latitudes that captured so many imaginations during the 19th century. I enjoyed that book tremendously. I wasn't disappointed in this collection of short stories.Andrea Barrett has a great ability when it comes to developing characters. From Max Vigne, a hard working member of a mapping expedition in the area of Northern India in the title story, Servant of the Map\" to his wife Clara that makes a major appearance in the final story \"The Cure\", all her characters are real. Almost real enough, it seems, to reach out and touch.Each story stands on its own. But the way Ms Barrett weaves the stories together if fabulous. The final story, by the way, is connected to her book, Voyage of the Narwhal. Ned Kynd, an inn keeper in the \"The Cure\" played a major role in the novel.I think readers appreciate these connections with past reads. It shows that the author respects the intelligence of the reader and isn't afraid to say that perhaps that story wasn't quite finished.Finally, Barrett is a wonderful story teller. One can read along in any of these stories and almost take for granted what one is reading. Then all of a sudden a major twist in the story, or some new development with the character, or a connection with something you've read before.Read this book.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a brilliantly written collection of stories that seamlessly meshes fact with fiction, science with love and faith, and the pursuit of exploration and discovery with the satisfaction of the simpler life. There are so many interesting insights into the emotions of her created characters that we wonder if there is any parallel with the lives of real adventurers.The opening title story of SERVANTS OF THE MAP starts us off well. The Great Trigonometrical Survey of India begun in the mid 19th century was a grand exercise of mapping the sub-continent. The map contours of interest were the peaks and valleys of the &quot;still to be named&quot; mountains of northern India. We meet Max Vignes, a draughtsman who when not sketching the details of what would later be the Himalayas, was looking down and passionately observing plants, leaves, and lichen. Max is obsessed with botany and the real mapping done by Barrett is of the contours of Max's heart. We see him torn between his love for his wife Clare and his two daughters and his all consuming scientific enthrallment with plants.This is just the first story and yet Barrett's technique of interweaving the real and the imagined, and her theme of scientific enquiry juxtaposed against the demands of the human heart, are both already fully developed and flowering. She goes on to explore this some more with &quot;Two Rivers&quot; where academically inclined Samuel seeks to disprove all non-theological explanations for fossils. We are transported to the world of emerging Darwinism and Barrett uses Samuel to investigate the inner difficulty of reconciling oneself to change and adapting to a new world-view. It's an issue that has as much resonance today as it did in Samuel's world of 100 years ago.Other stories where this inner geography is explored are &quot;Theories of Rain&quot; and &quot;The Forest&quot; and some of the colorful characters are Aunt's Daphne and Jane, Bianca Marburg, and Nora Kynd who appears in the last story &quot;The Cure&quot;. Max, Clare and their daughter Elizabeth also make a return. In a fitting summation to the book Clare shows her ambivalence to Max's return. It's a perfect illustration of the truth that with the human heart there will always be undiscovered territory. &quot;I do love him,&quot; she says. &quot;Or I did - how can I know what I feel anymore...&quot;This is my first book by Barrett but I've already begun what I can only hope is an equally enjoyable journey with another one.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Sometimes there are different degrees of good. For Servants of the Map, five stars doesn't seem to do it justice. In fact, using any sort of rating system doesn't feel right. This collection of stories is as fresh and clean as the outdoor worlds it so amazingly describes. Often, I found my mind wandering off the page, and rather than stop myself and turn back to the book, I let my thoughts linger on. The book is nostalgic in this way. It reads quietly and naturally. I felt myself living in Andrea Barrett's vivid landscapes, and communicating with her eccentrically human characters. How rarley in a book do you find two characters, both very likeable, dislike each other? Yet, how often do we find this in real life?In the second story, The Forest, as well as its companion, The Mysteries of Ubiquitin, opposing characters are quietly clashing almost all the time. Imagine two people, polar opposites, totally disgrunteled with each other, sitting comfortably on a patio near a swimming pool.I can not recommend this book more emphatically. For those of you who are scared of short stories... stop, and read this book. In those blank spaces between the stories, a larger more wonderous world is created than in most novels I've recently read, including those busting over the 1000 page barrier. This one, you'll want to reread simply to give your imagination another Andrea Barret boost!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "SERVANTS OF THE MAP is a unique collection of short stories by the redoubtable Andrea Barrett. While most of us felt she needed the space and stretched-canvas-epic-form to weave her magic, in this collection of six shortish stories she proves she is as adept at relating her tales woven equally with Apollonian/scientific and Dionysian/sensual facets in tight, capsular fashion. She still manages to create vistas rather than views and lineages rather than one dimensional lifetimes. Now and then I find it necessary to break out of her luxuriously poetic language and take a laudatory appraisal of this women's depth of scientific information. The research for such diverse stories pays off by giving the reader the pleasure of discovery of cartography, botany, medical diseases etc in a flowing, painless entry to the richly detailed minds of her characters. This is nothing short of a wondrous book, on to be revisited often - one story at a time - like a treasured scrapbook travelogue!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Andrea Barrett's Servants of the Map is a wonderful story collection, a collection with tremendous depth and imagination. Barrett's stories are all richly told and engrossing, each giving us their own world. What is remarkable about her stories, and what sets this collection off from most others out today is her focus on the scientific world. This focus adds an additional layer to the stories and makes them somehow richer. The stories involve a 19th century map-maker, a 21st century science professor and early 20th century tuberculosis sufferers. Barrett does not shy away from the scientific nature of her characters and their stories and because of this, these stories have additional layers of meaning. These are terrific stories. Pick them up.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Spanning 200 years, the stories of Servants of the Map, address issues of personal discovery against a backdrop of the scientific and natural world. Barrett is strongest with her historical settings, where time moves more slowly and there is more solitary introspection. We can better hear the poetic expression of quietly falling snow or the wind in the trees. Yet the strongest statement the book makes, including the contemporary stories, is the almost invisible thread that binds the characters to each other and to history. Diaries, letters, old notebooks, and old memories amplify the connections. Whether it is Max , the 1861 surveyor of the Himalayas or his wife Clara many years later in another story in America, two sisters with two different lives in two different stories, and the same for a separated brother and sister, the search for identity and the yearning for a life that matters and that is authentic is universal. Nor does Barrett stop there. For example, the last story, The Cure, brings back Nora from the haunting title story of her last collection, Ship Fever, and also refers obliquely to characters from her novel, The Voyage of the Narwhal. This new collection is an eloquent companion to those earlier works. After reading the stories, you feel like you have shared in a personal meditation with these characters.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "No doubt, these finely crafted, interwoven stories will delight many readers, but.... If you're considering this collection because you loved the adventure and danger of Voyage of the Narwhal, reconsider. These stories are as quiet and subtle as Voyage is exciting.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "If you plan to read only one book by Andrea Barrett, let it be this one. Most of the main characters in these stories are related by blood or marriage to those in some of her other works: The Air We Breathe \"TAWB\" (read it first if you think you might have time for more), Ship Fever, and Voyage of the Narwhal. The first story, Servants of the Map, is about a Civil Junior Sub Assistant in the Himalayan Service during the early 1860s, and is told primarily in the form of letters from Max Vigne, born in 1835, to his wife, with whom he shares his experiences in the Himalayas: surveying, mapping, collecting and writing about the local fauna, and dealing with some pretty colorful fellow HS workers. Some of his descendants show up in TAWB as well as in the last story of this collection, The Cure, about the life of homeopath Nora Kynd, born in 1825 (who appears in Ship Fever and TAWB), another Kynd family member, and Max Vigne's wife and children.Both The Forest and The Mysteries of Ubiquitin are about the Marburg sisters, born in the mid-1950s, whose father, Leo, is a major character in TAWB. The setting of The Forest is a party, during which the younger, less successful sister prodigy finds herself stuck with an elderly, visiting professor. He suffers a mishap when, on a whim, she takes him on a little adventure. In The Mysteries of Ubiquitin, she appears again, this time as a successful, thirty-year-old biochemist en route to an enzymology meeting who encounters the man who, years earlier during her childhood and his young adulthood, was her first crush. A relationship ensues during which she learns more than she wanted to about certain relatives.Theories of Rain and Two Rivers are also related. The first concerns a girl, Lavinia, born in 1790, who spends a lot of time thinking about her long lost brother, who she has not seen since she was a child. The siblings become separated when she is spirited away by two \"aunts\" after disease decimates her family, orphaning the two. She is infatuated by a neighbor, but is courted by another. Two Rivers follows her brother, Caleb, born in 1788, who is taken in by a theology teacher with an interest in paleontology. He becomes a schoolteacher, and meets an intriguing young woman on a solitary paleontology expedition.Summary: Barretts' phenomenally written short stories will leave you wanting more, which, fortunately, there is. The family tree at the back of TAWB entitled \"The Families\" is indispensable in keeping track of the characters in this and the other books. These stories deserve at least four stars as a stand-alone book, five stars in combination with The Air We Breathe and Ship Fever.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I thought that I would like this book of short stories better than I did. The subject matter, natural history, is one of great interest to me, however I found the stories a bit dry. The 19th century views of science that she portrayed were quite entertaining, and the prose gave me the feel of walking though a Victorian museum filled with curio cabinets containing jars of esoterica with handwritten paper labels.Many people who gave this book high reviews were entertained by the fact that these stories were populated with characters from some of her novels - perhaps if I had read the novels first, I would have been more engaged in the characters.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "guia roji mexico tourist road atlas",
        "description": "Over the past 35 years, hundreds of thousands of readers have agreed: This is the classic guide to \"living, traveling, and taking things as they come\" in Mexico. Now in its updated 14th edition, The People's Guide to Mexico still offers the ideal combination of basic travel information, entertaining stories, and friendly guidance about everything from driving in Mexico City to hanging a hammock to bartering at the local mercado. Features include: -> Advice on planning your trip, where to go, and how to get around once you're there -> Practical tips to help you stay healthy and safe, deal with red tape, change money, send email, letters and packages, use the telephone, do laundry, order food, speak like a local, and more -> Well-informed insight into Mexican culture, and hints for enjoying traditional fiestas and celebrations -> The most complete information available on Mexican Internet resources, book and map reviews, and other info sources for travelers",
        "authors": "['Carl Franz', 'Lorena Havens']",
        "infoLink": "https://play.google.com/store/books/details?id=XaI5DgAAQBAJ&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "When traveling by car in Mexico, especially off the major highways, you can never trust maps. It's always best to be sure you have sufficient time to backtrack and try another route if things don't appear as you expect from your map. Roads aren't always where the maps indicate and towns sometimes have more than one name. With that said the Guia Roji is the best I've found and the most reliable. I wouldn't drive in Mexico without it.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "I've had the Guia Roji Atlas once and found it fairly good, but expensive.Then I found Quimera's Road Guide at about half the price at scale 1:1,750,000. First I thought this one wouldn't do it for me, but I was surprised that in many areas it is even more detailed and reliable than GR and their infamous inaccuracies (that's why you have to drive back ;-) ). Guia Roji doesn't offer gas stations, there's virtually no sight (archeology, nature, colonial) shown, and Quimera's design is just clearer and easier legible.And than there's the price...",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "the mini rough guide to edinburgh 2nd edition",
        "description": "This pocket-sized guide is a convenient, quick-reference companion to discovering what to do, what to see and how to get around Edinburgh. It covers top attractions like Arthur's Seat, Scottish National Gallery and Castle Hill, as well as hidden gems, including the Museum of Childhood and Gladstone's Land. This will save you time, and enhance your exploration of this fascinating city. This Mini Rough Guide to Edinburgh covers: The Old Town, The New Town, Edinburgh's villages and Excursions In this travel guide you will find: RECOMMENDATIONS FOR EVERY TYPE OF TRAVELLER Experiences selected for every kind of trip to Edinburgh, from cultural explorations in the New Town to family activities in child-friendly places, like Edinburgh Castle or or chilled-out breaks in popular tourist areas, like the Royal Mile. TOP TEN ATTRACTIONS Covers the destination's top ten attractions not to miss, including Holyrood House, Edinburgh Festival and The Old Town and a Perfect Day itinerary suggestions COMPACT FORMAT Compact, concise, and packed with essential information, with a sharp design and colour-coded sections, this is the perfect on-the-move companion when you're exploring Edinburgh HISTORICAL AND CULTURAL INSIGHTS Includes an insightful overview of landscape, history and culture WHAT TO DO Detailed description of entertainment, shopping, nightlife, festivals and events, and children's activities PRACTICAL MAPS Handy colour maps on the inside cover flaps will help you find your way around PRACTICAL TRAVEL INFORMATION Practical information on Eating Out, including a handy glossary and detailed restaurant listings, as well as a comprehensive A-Z of travel tips on everything from getting around to health and tourist information. STRIKING PICTURES Inspirational colour photography throughout",
        "authors": "['Rough Guides']",
        "infoLink": "https://play.google.com/store/books/details?id=RzyAEAAAQBAJ&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "We used this little book all the time on our trip to Edinburgh. We had a great trip, it sure is a beautiful city and nice people too. We found the restaurants and hotels recommended were good. We would recommend this book to anyone going to Edinburgh. We hope to go back for the festival one day.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "Even though you won't find pictures inside this little book, that problem can be easily solved bringing a camera to your trip to Edinburgh, and/or buying some postcards. Inside this guide you will find a lot of useful information (anything you could need to know). The maps are very clear; it gives you some good advises about when to go to the Scottish Capital; and the prices you will find here are essential (specially if you want to find cheaper places to sleep). I enjoyed my stay there, and without any doubts I would like to visit this beautiful city again. You will be impressed with your first sight of the Edinburgh Castle, and believe me, you would like to read this guide from the start until the end.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the celestial omnibus and other stories by e m forster",
        "description": "The Machine Stops, The Celestial Omnibus, and Other Stories is a collection of short stories from E. M. Forster, who is perhaps best known for his novels Howards End and A Room with a View. Included in the collection is The Machine Stops, a science fiction story that predicted the internet, video conferencing, and instant messaging. Forster, who deplored science fiction, wrote the story in response to an optimistic depiction of the future by H. G. Wells. The story is one of the earliest examples of dystopian science fiction. Also included is The Story of a Panic, the first story Forster ever wrote.",
        "authors": "['E. M. Forster']",
        "infoLink": "http://books.google.nl/books?id=odq7ngEACAAJ&dq=The+Celestial+Omnibus+and+Other+Stories+by+E.+M.+Forster&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The other reviewer of this book completely missed the point of the story. THE CELESTIAL OMNIBUS is about the liberation of the Soul through Art, and is not meant to be a religious text at all. A young boy in a prosaic middle class suburb catches a glimpse of something otherworldly in an alley--an omnibus that travels 'To Heaven'. This is not the religious Heaven but the infinite world of the imagination. Great literature literally provides an escape for the boy, who has a poet's soul and is ridiculed for it by his family and their friends. In their view, Literature and Poetry exist only on library shelves, bound in red leather. It is the neighbor, who only concentrates on the physical manifestation of the writings, who 'dies on the earth' since he confuses the end with the means. It is more important to feel the spirit of a great writer than to worry about the binding on their books, while never understanding their meaning. The other stories in this collection are also memorable and deal with living the quiet life and leaving the rat race--in one case, literally. This is one of the most inspirational collections of short stories ever written and it is a shame that it is out of print.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "Quite possibly the best collection of short stories published in the Twentieth Century, so minimalist that they're metaphysical. Each demonstrates that the meaning of meaning is the creation of meaning, that people exist to create meaning, whether they know it or not, and what it means to create meaning, or fail. Images become symbols, symbols become allegories. High bourgeois culture, at its best, accessible at many levels to anyone.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The Celestial Omnibus and Other Stories was written in 1911 by Edward Morgan Forster (1879 - 1970), an English novelist, short story writer, essayist and librettist.The best way to enjoy these stories is like that of an experienced traveler to foreign lands. The mature wanderer knows that you cannot demand the country change itself for you, but that one must adapt to the country to discover its riches and wonders. True enjoyment takes work.There truly are riches and wonders in this collection of six short stories, but to appreciate their essence, one is going to have to give up the hard boiled cynicism of the 21st century and embrace the romance, mystery, and pure wonder of fin de si&egrave;cle Great Britain. The mature reader who will let Forster speak for himself is surely in for a treat. In these tales you will meet a spoiled young man whose life is changed by a visit from an ancient god (The Story of a Panic), question whether life is a rat race or maybe something more (The Other Side of the Hedge). If you are willing to pay for the ticket, you'll visit a land where the works of great authors (if not the authors themselves) have a Heaven all their own (The Celestial Omnibus) and that classic myths can be repeated again and again (Other Kingdom) to great tragic effect. You'll also meet an irreverent faun who becomes the best friend of a reverent clergyman (The Curate's Friend) and discover that the call to wonder can be found in the strangest places (The Road from Colonus) as well as the price that must be paid to ignore it.So pack your bags and get ready for a trip. The ticket is free, but if you truly have a soul that is sensitive to what C. S. Lewis called the numinous, like all good travelers, you may bring back more from the trip than what you left with.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "eyewitness travel guide to new england",
        "description": "An unbeatable, pocket-sized guide to New England, packed with insider tips and ideas, colour maps, top 10 lists and a laminated pull-out map - all designed to help you see the very best of New England. Explore historic Boston, visit the iconic Hyannis, relax on a cruise around picturesque Newport, hit the slopes in New Hampshire's scenic White Mountains or enjoy a canoe ride surrounded by Vermont's majestic Green Mountains. From Top 10 festivals and events to Top 10 outdoor activities - discover the best of New England with this easy-to-use travel guide. Inside Top 10 New England- - Eight easy-to-follow itineraries, perfect for a day trip, a weekend or a week - Top 10 listsshowcase the best attractions in New England, covering Boston, Cape Cod, Newport, Lakes Region, Berkshires and more - Free laminated pull-out map of New England, plus six full-colour area maps - In-depth area guidesexplore New England's most interesting neighbourhoods, with the best places for shopping, going out and sightseeing - Colour-coded chaptersdivided by area make it easy to find information quickly and plan your day - Essential travel tipsincluding our expert choices of where to stay, eat, shop and sightsee, plus useful transport, visa and health information - Colour mapshelp you navigate with ease - CoversBoston, Massachusetts, Rhode Island, Connecticut, Vermont, New Hampshire and Maine Staying for longer and looking for a more comprehensive guide to New England? Try our DK Eyewitness Travel Guide New England. About DK Eyewitness Travel-DK is the world's leading illustrated reference publisher, producing beautifully designed books for adults and children in over 120 countries.",
        "authors": "['DK Travel']",
        "infoLink": "http://books.google.com/books?id=s3qFvQEACAAJ&dq=Eyewitness+Travel+Guide+to+New+England&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The DK series of travel guides are great as a starting point in planning any trip. The books are easy to read and great to look at. It is the one series of guide books that I would recommend buying and keeping.The New England guide has a great deal of information. The primary focus of this book is on places to see, art, and architecture.A quarter of the book deals with the Boston area. The information provided is fairly comprehensive. The pictures, maps, and descriptions are informative.Outside the section on Boston, the information is less comprehensive. Some areas could have been expanded and had more details. There are only three pages on the Berkshires. They could have included more of the mansions in Newport RI. I would definately start with this book as an overview. Then I would use other guides or the state or local travel bureaus for more localized information. Once on your trip to New England there are plenty of free brochures and guides that will help enrich your experience plus giving you more places to see, shop, and eat.When your done with your trip, keep your DK guide for future reference.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Once you buy your first DK Guide, you will seek them out anytime you are getting ready for a trip. My husband and I had not traveled to Massachusetts or Rhode Island previously and used the guide for much of our trip. We found it extremely helpful for the Boston Area-for the sites to see and the handy map of the &quot;T&quot;, which is their subway system. I also recommend purchasing the compact fold-out DK street maps of Boston, that can be purchased separately at most book stores. We used the guide throughout our stay in Plymouth, our day trips to Cape Cod, Martha's Vineyard and Rhode Island. As always, I love the full color pictures and descriptions of the sites. We felt that we were able to make informed decisions about the places to visit that would interest us the most. Also helpful is the Survival Section in the back that gives you much of the information that you need to know when traveling to a new area. We used the guide also for restaurant recommendations, while out driving, and were not disappointed with any of the stops we made. I plan to use the guide the next time we go back and would highly recommend it to those thinking about a trip to this beautiful area of the country.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I live in New England and this is one of my favorite books on this region of the country. DK has always published quality books in their Eyewitness Travel Guides. They seem to have done an even better job with the crafting of this book. The colorful layout of this book with maps, illustrations, photographs and text really captures the spirit of New England past and present. This is a very dear and heartening book because it genuinely captures a sense of the people and the land. I think it is also very informative, not only from a historical perspective, but as a point of reference for sightseeing, travel and enjoyment.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book was fine for touring around Boston. It was very informative. As far as the rest of New England, there must be something better. We found ourselves in the middle of some great towns with nothing more than a couple of sentences, if that, about the area. After getting out of the car and exploring, we found many interesting sites and attractions. If we made our decisions based completely on the book we would have passed up many interesting stops. Next time we travel in New England, we will buy a different book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "lighthousekeeping",
        "description": "Taken in by the enigmatic blind keeper of the Cape Wrath lighthouse, an orphaned Silver listens as the aged man recounts stories that center around a nineteenth-century clergyman who lived a paradoxical life while experiencing unfulfilled passions, displacement, and betrayal. Reader's Guide available. Reprint. 50,000 first printing.",
        "authors": "['Jeanette Winterson']",
        "infoLink": "http://books.google.nl/books?id=FLpTvgAACAAJ&dq=Lighthousekeeping&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Jeanette Winterson's magnificently descriptive, impressionistic novel tells two interconnected stories, each of them asking who we are as humans, how we connect to the past, and what makes our lives worth living. Its modern story focuses on Silver, born in 1959, \"part precious metal, part pirate.\" A young girl without a father, Silver is orphaned at ten and moves into the local lighthouse with Pew, the aged and blind lighthousekeeper, whose family has tended the light in northwest Scotland since 1828. There, she polishes the brasswork, makes the tea, and listens to Pew's stories, some of them historical and some more fanciful, but all of them filled with wisdom and lessons from the past.The lighthouse, we learn through Pew's stories, was built by the father of Robert Louis Stevenson. In 1878, R. L. Stevenson comes to the lighthouse for a visit and is fascinated by the story of Babel Dark, a local preacher, who becomes the inspiration for Mr. Hyde in Dr. Jekyll and Mr. Hyde. Dark, we learn through stories, falls in love with beautiful Molly in the early 1850s, then sees her embracing another man, becomes overcome with jealousy, and rejects her. Taking the symbolic name of Lux (meaning \"light\") when he is with Molly, Dark is unable to control his emotions and becomes a Hyde-like abuser. \"He was dark...the light in him never lit.\"As the stories of Silver (which reflects light) and Babel Dark develop in tandem, the novel takes on operatic qualities, with the two stories often sounding like duets, one voice light and one dark, singing in counterpoint to each other. As each person seeks fulfillment through love and connection, the cadence of Winterson's writing rises and falls, swirls, and turns in upon itself, with the same themes of creation, connection, and the continuity of life echoing throughout. Winterson's incorporation of the Tristan and Isolde story, along with the visit of Charles Darwin to the lighthouse, expands and further emphasizes the themes.Both romantic and philosophical, Winterson offers much unique imagery. Pew, for example, is a \"silent, taciturn clamp of a man.\" An Albanian family was \"vacuum-packed into a ship,\" the grandmother, \"all sun-dried tomato, tough, chewy, skin split with the heat.\" Her narrative tempo is flawless, the language elegant, and the characterization consistent with the themes. The end of the book harks back to the beginning, completing a circle and granting new insights into her meanings. A rich novel which the reader will want to read slowly and savor. Mary Whipple",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "Silver is a girl born completely by chance. Her mother had a brief encounter with a sailor, leaving the penniless woman to raise the baby girl in a crooked house tipping into the sea. The house was so slanted that the family dog's legs grew irregularly and they couldn't eat any food that would roll away. Eventually Silver is taken by a hilariously prudish woman named Miss Pinch (a curiously Dickensian touch from an author who has spoken so condescendingly about the work of Sarah Waters) to live with a lighthouse keeper named Pew. From Pew she learns the art of story telling and consequently a way of finding value in her life. Because of her origins and social status Silver is viewed by people like Miss Pinch as worthless or an accident. Through the medium of story telling Silver is able to forge for herself an identity more true than any documented reality.Interwoven with the tale of the novel's central character Silver, is the story of a priest named Babel Dark. He is a fascinatingly divided character, something Winterson has Robert Louise Stevenson cement in English literature. As always, the author's surreal nature of story telling melds with philosophical insights which have the ability to really turn our world upside down. Stunningly beautiful passages add depth to wonderfully quirky tales. Winterson always holds up the importance of storytelling in a way that is ceaselessly inventive and inspiring and makes you want to read on.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "In the bitter northern Scottish town of Salts, a young orphaned girl named Silver is thrust into the care of the hateful Miss Pinch. Silver is eventually taken in by Pew, a blind, yarn-spinning lighthouse keeper who regales her with never-ending stories about the tortured life of a nineteenth-century clergyman - Babel Dark, formerly a minister in Salts, and son of the Dark who built the lighthouse. As Silver matures and moves on, she takes the gift of storytelling with her to life in Bristol, in Europe, and finally in love ... Winterson's eighth novel is a departure from the cycle of fiction she's been steadily pursuing since the 1980s. Many readers will be surprised by its apparent simplicity, but behind the whimsy there is serious intent. Winterson's concern here is the power of storytelling. For her, there seems to be a certain strata of truth that transcends time and culture, a bedrock of human experiences - breaking away, first love, loss - that are best communicable through storytelling. Stories are how we make sense of our own lives, and the life of the species. Stories (art in general, even) form the authentic record of human experience, far more so than factual history. Fiction is truth in its most accessible form. \"Lighthousekeeping\" will quite likely appeal to students of literary studies, who will most appreciate the cunning interweaving of Jekyll and Hyde, Tristan and Isolde, ponderings on the Grand Narratives of Christianity and Darwinism, and Winterson's bold poetics and narrative structure. But general readers might find the insistent discussion of storytelling a little tedious, and wish that Winterson had simply told rather than self-consciously reflected so often on the telling. But through it all, there's still the thing that Winterson can always be relied on to give us: a powerful and shameless celebration of the agonies and ecstasies of romantic love.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Words. I kind of like them. Big, small--expressive, retentive--words build a story, one by one. And when the words are masterfully manipulated by a writer with a keen, lyrical style, the story becomes even more of a treat to enjoy, to savor. Such is the case with author Jeanette Winterson; her novel, LIGHTHOUSEKEEPING, ebbs and flows in abstract, poetic prose (Did you like the rhyme?) that is hypnotically appealing as it is beautiful.This is a short novel overflowing with metaphors. Case in point: 'He wondered how many days he had in his life--in his whole life--and when they had fallen one by one, and him naked again, time's covering gone, would the leaves be heaped up, the rotting pile of his days, or would he recognise them still--those different-edged days he had called his life?'Discuss.This is a story about telling stories. It is a story about Silver, a young orphan, who goes to live in a lighthouse with kind, blind Pew, the lighthousekeeper. Pew is a cornucopia of stories--in particular, stories about the reverend Babel Dark, a tormented man who lived in the area a century before. Like his name, Babel has a dark side, very much in contrast to his public persona. The two stories--Babel Dark's torment, and Silver's interactions with Pew, with herself--become lyrically intertwined, feeding and nourishing each other, until both come full circle in a burst of poetic metaphor.LIGHTHOUSEKEEPING is a poem that reads like a novel. Or vice versa. Winterson is a gifted writer; her book is as powerful as it is beautiful. Highly recommended.--D. Mikels, Author, WALK-ON",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This small novel is a journey of shared illusions, melding the past with myth, overflowing with images: the moodiness of the distant moon, the leaden weight of night, the soft damp mist that fills every crevice of this sea-swept land, a place of dreams and stories on the Scottish coast of the Atlantic Ocean. All is image, blurred pictures of people long dead, a reminder that the past is not so far away.Silver is the narrator of Lighthousekeeping, her early life anchored to a seaward listing home that finally swallows her mother whole, a father never known. From the drab abode of Miss Pinch in the town of Salt, Silver is sent to live with old blind Pew, the lighthouse keeper of Cape Wrath, \"home to gulls and dreams\". Pew is a storyteller who teaches her the language of the sea and the soul, relating the tale of Babel Dark, a haunted figure, \"not a man for good mornings and good nights\", married to a woman devoid of curiosity, his wife nonetheless.Silver's life is part mistake, part madness, a m&eacute;lange of stories and impressions, anchored only by her affection for Pew and her security in the lighthouse. The pages are awash with vivid imagination, flying on the wings of language, the magic of myth, weaving stories like webs around the characters. Stories hover like shadows, shifting within the narrative, connected by a filament of truth, Silver's voice, Pew's memory, Dark's anguish and yearning for a life unlived, for years squandered.Like a dark prince, Babel Dark, he who lived a century or more before, wanders the cliffs in Pew's telling, galloping over the rugged terrain, his heart as wild as the countryside, unredeemed. Like the heroes of myth, Dark's passion is romantic, if embittered, just as Pew's tales are true, though impossible. And Silver takes it all in until the stories course through her body like blood and she cannot live without this precious fluid that rushes through her veins. Even when she must reinvent herself again and again, Silver is buoyed by Pew's \"lighthousekeeping\" lessons, the stories that sustain the heart.There are so many remarkable phrases, astute observations and insights that I read slowly, savoring the language, the ideas, evocative seafaring lore and doomed love, all reminders of the heart and its penchant for illogical attachments, for personalization. I gladly follow as Silver navigates through her days, from the mother swept away in the wind, the bed made of chairs at Miss Pinch's, the enchanted years at the lighthouse with blind Pew, Babel Dark's sad saga of unrequited love and sailors lost to a howling sea.Myth, memory and language combine, orchestrated into a symphony on the edge of the world, where life and death coexist, entwined for eternity. This prose/poetry holds a wealth of images, the warmth of infinite tenderness, bright splashes of sunlight, quiet interludes of thoughtful introspection. Lighthousekeeping is a lesson in reinvention, subtle directions in living the story, listening to the past and welcoming the unknown, the future. Luan Gaines/2005.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Jeanette Winterson never ceases to speak to the very core of me. Lighthousekeeping is a novel that reminds me of her first, Oranges Are Not the Only Fruit, but completely unique in its own way.Lighthousekeeping follows the story of orphan Silver as she moves from place to place, first to a lighthouse after her mother dies, from the lighthouse to a hotel, from the hotel to Capri, and from there to places that might only exist in her imagination. Silver is mentored by Pew, the old lighthousekeeper who tells her that stories are light and the only way to make sense of the world, to truly see. The notion of storytelling is at the center of this sweet, moving, and poetic novel.Jeanette Winterson uses Lighthousekeeping as a playground for the notions of storytelling, light and dark, of personal history and factual history, of the way humans view themselves and their pasts, of the way others view them, of the way others perceive history, fictional and factual, and by the end of the book, she has even included the reader in her journey as a lover of stories. It is a beautiful and engaging and quite simply moved me to tears.If you are looking for a linear, plot-driven novel, you may be disappointed. The beauty of this novel is in the patterning, the attention to language and theme and the notion of storytelling as a story in itself.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "LIGHTHOUSEKEEPING by Jeanette Winterson is a saga of dualities, of dark and light, wind and sea, an old man leading a double life, a young girl having to start life over. I really like the book's beginning, at a cold lighthouse in northern Scotland with a swirling storm of images that duplicate the wind and sea and give us a definite sense of place. It's set in the late 20th century, but seems out of time -- it always seems ancient.When the narrator, Silver, is orphaned, a family takes her in to teach her lighthousekeeping. Everything's dark except the lighthouse light, and all energy goes toward it. \"Our business was light, but we lived in darkness,\" she says. Every lighthouse has a story, she's told, and as part of her training she has to learn them all. This is a story about storytelling, bringing light to illuminate the darkness, and names continue the metaphor: Silver reflects everything around her; one of the characters is named Dark, and when he takes on an alias, he names himself Lux or light.Naturally, I identified with Silver's love for books. One of my favorite moments was her trip to the library, where an unfriendly librarian wouldn't let her take out books already reserved for other customers. Her clever solution: \"I have a list of titles that I leave at the desk, because they are bound to be written some day, and it's best to be ahead of the queue.\"The best way to describe the -- let me call it \"structure,\" rather than \"plot\" -- is probably to use the narrator's own words: \"This is not a love story, but love is in it. That is, love is just outside it, looking for a way to break in.\" She warns us that \"a beginning, a middle and an end is the proper way to tell a story. But I have difficulty with that method.\" Several times the structure had me scratching my head, and I don't mind admitting that I was a little confused by the insertion of the story of Tristan and Isolde and the tale of a talking bird, seemingly thrown in like snapshots from a totally different book.But it's good, and good literature reminds its readers of other important reads. The author admits that Virginia Woolf's \"To the Lighthouse\" resonates in her book. And parts of LIGHTHOUSEKEEPING, especially in the beginning, remind me of \"Ahab's Wife\" by Sena Jeter Naslund. I loved that one and strongly recommend it -- especially the first half, in which I was totally absorbed in her adventures at the lighthouse and riding high in the lookout perch of a whaling ship.Winterson's writing is sensual and extraordinary, and it's absolute poetry. Here's an excerpt, with Silver thinking about Captain Scott in the Antarctic: \"Not earth-bound any more, he could wing the dogs in a wind-ruff of fur, husky-haloed through two miles or so of gravity, then out, free, barking at the moon, half-wolf, half-tame, going home to the white planet he had seen shining in their orange eyes, paws hock-deep in snow.\" Holy cow, is that beautiful. Try reading it out loud.The narrator explains, \"The true things are too big or too small, or in any case always the wrong size to fit the template called language. I know that. But I know something else too, because I was brought up to Lighthousekeeping. Turn down the daily noise and at first there is the relief of silence. And then, very quietly, as quiet as light, meaning returns.\" Lovely.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Jeannette Winterson's Lighthousekeeping interlaces several stories, that of Silver, blind Pew and Babel Dark as well as several historical figures in a tale that is much more then a story with a beginning, middle and end, but a tale that deals with the essence of story telling. Winterson weaves webs of stories within stories and several of her characters like that of Pew and Babel Dark are highly addictive. These webs of stories give the reader a chance to question the nature of love, life and what makes a story. This is not a typical read, this is a novel that steps beyond plot conventions.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "With LIGHTHOUSEKEEPING, Jeannette Winterson has written another wonderful love story, woven among historical possibilities in the lives of such as Charles Darwin, Robert Louis Stephenson, Richard Wagner, among other historical figures. The integrity of the story is held together with nautical themes, the greatest being the lighthouse.What I have long been interested with Winterson's work is her beautiful prose that has been delicately transplanted to a contemporary format. Her imagery and diction generally stopped being produced with the literary masters from the nineteenth century, and this may be why her plots often return to those days, yet Winterson's style is not in the least antiquated.If you are a fan of Winterson's body of work then you will surely enjoy LIGHTHOUSEKEEPING, as it is a striking variation of previous efforts, but Winterson through and through. To anyone unfamiliar with Winterson, and interested in a highly polished hybridization of romance and soft-eroticism, I highly recommend LIGHTHOUSEKEEPING as a first soir&eacute;e.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "When thoughtful, quiet Silver's mother dies, the girl must rely on the kindness of strangers, no easy thing to find in the rugged coastal town of Salts. The only one who will have pity on her is blind Mr. Pew, the keeper of the lighthouse perched at Cape Wrath.Soon enough, Silver has settled into life at the lighthouse, caring for the aging man and listening to his stories. For, it turns out, there's much more to tending a lighthouse than simply keeping the light burning, at least according to Pew. Pew tells Silver that in order to keep the light, she must learn all his stories, \"The ones I know and the ones I don't know.\" When Silver asks how she can possibly do such a thing, Pew advises her to tell them herself.It will be a long time before Silver can tell her own stories, but in the meantime she is awash in the stories of Mr. Pew, in particular the stories of the mysterious preacher Josiah Dark, a long-ago resident of Salts, and his dark dual life, which served as the inspiration for Robert Louis Stevenson, himself a former resident of Salts.Caught up in Dark's story, threatened with the automation of the Cape Wrath light, and ready for Silver to take up his mantle, Pew disappears, leaving Silver to follow him and start to construct her own stories. Soon she has found her own life, her own love, and her own voice that she can use to tell stories to the one she loves.Like Jeanette Winterson's previous novels, LIGHTHOUSEKEEPING is both startlingly lyrical and deeply literary. Containing allusions to Darwin, Greek mythology, the story of Tristan and Isolde, the novels of E. M. Forster and Virginia Woolf, and even Winterson's own earlier work, LIGHTHOUSEKEEPING offers numerous rewards to readers familiar with her literary sources.That is not to say, though, that LIGHTHOUSEKEEPING cannot be enjoyed on its own merits. Its language, particularly in its meditations on love, verges on poetry: \"The world is nothing. Love formed it. The world vanishes without trace. What is left is love.\" Winterson's small, deceptively simple novel is actually quite challenging, as she plays with narrative structures and narrative voices, resulting in a work that can be enjoyed by many different readers on endlessly different levels.--- Reviewed by Norah Piehl",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "sacred places north america 108 destinations sacred places 108 destinations series",
        "description": "This revised and updated comprehensive travel guide examines North America's most sacred sites for spiritually attuned explorers. It includes detailed maps, drawings, and travel directions to important archaeological, geological, and historical destinations from coast to coast.",
        "authors": "['Brad Olsen']",
        "infoLink": "https://play.google.com/store/books/details?id=wH1UAgAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Divided into 10 geographical sections (Southwest, West Coast, Alaska and Hawai'i, Western Canada, Rocky Mountains, Central Plains, Great Lakes Region, Eastern Canada, New England, and The South), &quot;Sacred Places North America&quot; is the ultimate travel guide for anyone seeking out places of great historical or religious significance. The guide is thorough, covering things as diverse as Anasazi dwellings, Area 51, medicine wheels, Indian mounds, petroglyphs, Walden Pond, and even Graceland. Each entry has a basic history of the place plus a description of how to get there. A true travel guide for those interested in these places it is a real treasure trove of information. If you are planning to travel this summer, pick up a copy and make sure to visit some of the most interesting places in North America. &quot;Sacred Places North America&quot; is a highly recommended purchase.",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "Instead of just blandly heading off into picture postcard America, consider traveling with a purpose -- to experience the intense energy boosts of sacred sites, modern &amp; ancient.To that end Rebeccasreads recommends you take along Brad Olsen's SACRED PLACES NORTH AMERICA. While the writing is utilitarian, the maps busy &amp; the b&amp;w photos a bit shabby, the information offered will certainly get more bang out of your buck in the sites you visit -- such as Graceland, Crater Lake &amp; 106 other more &amp; less known places in the length &amp; breath of this continent.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "Brad Olsen has come up with yet another special book. Sacred places covers a large number of sites and other attractions you won't read about elsewhere. Some (such as Elvis Presley's Graceland) are unexpected; others are natural areas such as Joshua Tree and Denali; still others are Native American religious landmarks such as Chaco Canyon. Even if you aren't the least bit &quot;New Age&quot; or &quot;spiritual;&quot; but just someone who appreciates nature and unusual places, you'll find Brad's book to be a great compendium. And directions are included!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Compiled and written by Brad Olsen (Editor, World Explorer), Sacred Places: North America offers the reader 108 spiritual destinations throughout North America, ranging from the Salt Lake Temple of Utah, to the Ellis Medicine Wheel of Alberta in Canada, to the Garden of the Gods in Hawaii, to the birthplace of Martin Luther King. Black-and-white photographs, succinct descriptions, advice for traveling, combine to make Sacred Places: North America a revealing, useful, and enthusiastically recommended guide for the vacationer seeking to fulfill their spiritual as well as their recreational yearnings.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is great. It is not only a source of information, but it is also a great place for inspiration. I have been using it in my travels. The places I have visited in the book have been amazing. Also, the people are great. I encourage you to look at the publishing website. They stand for great things and are very easy to work with.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Thanks for the autograph. Brad Olsen has written a journal type book with detailed hand drawings of different places considered Sacred. Not only does he investigate the actual background on these sites but he also adds his personal experience visiting these places. Sadly there may not be many photographs, but as a document I find it very interesting. Travel guides are not much help when you wish to find these special places, but this book is something you will definitely like to put in your backpack before you go.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "2008 riviera maya guide map by cando",
        "description": "Completely updated, this insider's guide veers off the tourist trail for intrepid travelers to experience the local color, intrigue and charm of the Riviera Maya. For travelers in the know, Playa del Carmen is the little gem with all the beauty of white sand beaches that has drawn crowds from around the world to Cancun, with none of the high-rise overdevelopment. Playa remains a wonderful, sleepy town on a human scale, yet its discovery has resulted in a wide range of lodging and dining options. For families and adventurous travelers alike, there's something for everyone in this Mexican Riviera, known as the \"Riviera Maya.\" You can explore the fascinating Mayan ruins on the beach at Tulum, shop and have a fabulous lunch on the pedestrian area in Playa, stay in a full-service resort along Playacar, and go for some of the best fishing in the world near the famous Sian Ka'an biosphere in Punta Allen. The Riviera Maya is one of the true travel hot spots in the world today. Includes detailed info for eco-travelers, Maya culture buffs, anglers, foodies, and anyone needing respite on a sleepy beach. This is the definitive guidebook on Playa del Carmen. Distinctive for their accuracy, simplicity, and conversational tone, the diverse travel guides in our Explorer's Great Destinations series meet the conflicting demands of the modern traveler. They're packed full of up-to-date information to help plan the perfect getaway. And they're compact and light enough to come along for the ride. A tool you'll turn to before, during, and after your trip, these guides include chapters on lodging, dining, transportation, history, shopping, recreation, and more; a section packed with practical information, such as lists of banks, hospitals, post offices, laundromats, numbers for police, fire, and rescue, and other relevant information; maps of regions and locales, and more.",
        "authors": "['Joshua Eden Hinsdale']",
        "infoLink": "http://books.google.nl/books?id=qUqda1qrWOIC&dq=2008+Riviera+Maya+Guide&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Even after several trips to the area we still rely on our Can Do map. This is the best resource for the area from Cancun to Tulum that we have seen. It lists just about every hotel, condo, villa, restaurant, market, shop, bank and service available. Laura and Perry also give lots of good advise on places to visit and they include information about the various attractions such as hours of operation, admission prices, etc. Don't leave home without it!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I ordered the Riviera Maya guide/map for our first trip in July. It answered all our questions we had as to where certain destanations were from where we are staying and so forth. It showed how far south of Cancun we will be staying. All kinds of restaurants to try and shops to visit. I was certainly interested in the ruins but always heard it was quite a trip from Cancun. We will be staying in Playa Del Carmen and that seemed a little more centrally located on the map.This will be the first thing I pack for the trip! Thanks to Laura and Perry for such a great map.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I have been to the Cancun~Tulum Corridor now refered to as Riviera Maya on 5 different occasions since 1995 and find this Travel Book Map to show me places that I have driven by for the last 4 years. I would say that the detail of Hotels, Restaurants, Condominiums, Bungalows, Cabanas, Grocery Stores, Tourist Playgrounds, Mayan Ruins and other facts are just not available in any other source. I would not leave for the Riviera Maya without it! I would recommend this Travel Book Map to anyone without hesitation. The cost of the Map will be returned to the user over and over again on just one trip to the Riviera Maya. Thanks to Laura and Perry McFarlin. Bill in Tulsa.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "The Maya Riviera map by Laura McFarlin is a marvel of information design! It's clear and concise illustrations pin-point almost every building and attraction along this coast and is informed by the use of geo-positioning technology. And, unlike many other travel guide books, it is very compact and easily packs along with you in a pocket or your purse. It is also the most up-to-date source of information for the area available today! The author and her husband travel frequently through-out the year to the Maya Riviera to revise and update the superb guide.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This information packed guide, printed in the form of a fold-up map, is loaded with detailed information and suggestions that made our trip to the area a magical time. Incredible detail down to the smallest unpaved road accessing beautiful deserted beaches, restaurant and hotel information, car rental locations, parking,jungle tours... this has it all.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "We purchased this map for our honeymoon trip to the Mayan Rivera. It was an excellent investment. It tells you the approximate price of various cab fares to different locations. It even provides you with a list of alternative transportation services. All activities of the area are listed and even most all resturants. The best part is they offer their own reviews of the resturants and give good adivce on where to go. I highly reccommend this map if you are planning a trip. Even if you set everything up through a travel agent, this has tons of listings for things you may not hear about and may enjoy doing.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have purchased two of these. The last one was updated in 2000. They are very detailed, and extremely well done. I applaud Perry and Laura for their excellent job! You can't go wrong with these map guides.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "If you are going to the Maya Riviera.....BUY THIS MAP! I agree with the comments made by everyone else here....this map is INVALUABLE! So much detail and a very conversational style that is enjoyable and easy to follow. Also, lots of photos which really make a difference in deciding where to go and what to do. You really could bring this map alone and it would be all you would need as a travel guide. HOWEVER, I would also highly recommend their book &quot;Adventure Guide to the Yucatan&quot; to bring along with the map. Extremely useful book! Read it before you go and you will have the best trip possible. Well worth the money!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "maine an explorers guide tenth edition explorers guides",
        "description": "Some of the greatest vacation delights in the U.S. are waiting for you on the Cape. Whether you're looking for a quiet retreat or boisterous nightlife, bird-watching or whale-watching, ocean beaches or kettle ponds, drive-ins or professional theater, Cape Cod and the islands offer all that and more. The very best resource available to guide you through the riches of this fabled place is the tried-and-true Explorer's Guide Cape Cod, Martha's Vineyard & Nantucket, now in its 10th edition.",
        "authors": "['Kim Grant']",
        "infoLink": "http://books.google.com/books?id=ccVbAwAAQBAJ&dq=Maine:+An+Explorer%27s+Guide,+Tenth+Edition+(Explorer%27s+Guides)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I travel a lot -- both nationally and internationally and I use travel books often. I took my first trip to Maine this summer and was excited to see that a book so highly rated was coming out with a new edition shortly before my trip. Unfortunately I found this book disappointing time and time again. If you like the way that Lonely Planet presents information (town maps, opinionated recommendations, and historical information) then stay away from this guide book. It offers very few of any of those things. It is more of a guide to available restaurants and lodgings with little or no real concrete information or opinions about those places.For example, we traveled to Campobello and needed to stop for dinner. One of the restaurants they listed was &quot;known for its fish and chips&quot;. Such a description doesn't reveal whether their fish and chips are actually worth the stop. We did stop and found the fish and chips to be VERY average and the microwaved fish chowder to be very bland. A B&amp;B we stayed at was described as having &quot;furnishings reminiscent of a simpler time&quot;. What does that mean? We found out but that description told us very little. The vague descriptions were frustrating when we were calling from one area of Maine to make reservations in another. We weren't sure what we were going to find. One more example: We were in Acadia driving the park loop and I reached for the book in hopes that it would give a brief description of the different sites on the tour. There was a sign for Bubble Rock and I wanted to know what that was in reference to. The book was of no help.The book is also awkward to use. The key to their symbols are buried in the book. Their reference section is also awkward and lacks a &quot;when to go&quot; section among other useful information. Considering the fact that much of Maine consists of small towns whose streets are too small to show up on maps of Maine, it would have been such a help to have had small town maps in the book. I think there were a couple but nothing near what there should have been. This may be the best that is out there but if that is the case, then there is room for some one else to write a much more comprehensive and useful guide to Maine.",
                "review/helpfulness": "49/53",
                "num_reviews": 53
            },
            {
                "review/text": "This is a terrific guide, detailed accurate,judgemental when called for, funny and user friendly. The author clearly spends a lot of time traveling around Maine keeping in touch with changes and updating information. A new addition is virtually another, better book. So,I'm surprised that Amazon.Com listed the new 10th edition as No.3, behind two earlier editions.The two older editions certainly contain useful information and are more deeply discounted.However, when you're spending a lot of money on a trip or vacation it makes sense to have an up-to-date guidebook.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the rough guide to alaska",
        "description": "The Rough Guide to Alaska provides extensive and insightful information on the US's premier adventure destination.",
        "authors": "['Paul Whitfield']",
        "infoLink": "http://books.google.com/books?id=0Q1pmwh8lu8C&dq=The+Rough+Guide+to+Alaska&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is a good rough guide for anyone interested in visiting Alaska. While it does not get enough into many specifics notable attractions, it does often include sufficient references and resources to find what you want. While the author and editors may not agree, it does not adequately cover the topic of fishing opportunity in Alaska. It could include better references for those opportunities. The author has a decidedly European take on travel. For example, critiques of eating and drinking are given in comparison to the more liberal views on alcohol consumption typical of European norms. A good range of necessary topics is covered to allow a first-timer to plan his trip.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "The Rough Guide To Alaska is the most complete and superbly organized of the travel guides to the northernmost American state. Along with comprehensive information on the vast Alaskan wilderness, there are reports on events and sights of Alaska's major cities and tourist destinations, as well as reliable recommendations for dining, lodging, and travel. Enhanced with more than 60 maps and full color photography, The Rough Guide To Alaska is the perfect trip planning resource.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I used the \"Rough Guide\" on a recent visit to Southeastern Alaska. I found the recommendations regarding hotels and restaurants in Juneau, Ketchikan, and other cities to be accurate, useful, and up to date. The guide is well-illustrated and mapped and provides brief detail on places of interest and things to do.One of the best features of the \"Rough Guide\" are the abundant sidebars which offer the reader interesting tidbits of history, folklore, and Alaskan people. Also very good is the annotated reading list at the end of the book which recommends a large number of additional books to read. You will find just about everything you need to know in this guide to plan your trip and to learn what you should about Alaska. My only criticism is that it may be a bit skimpy on information for the fisherman and hunter -- both major attractions in Alaska.Smallchief",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the decapitated chicken and other stories texas pan american series",
        "description": "Tales of horror, madness, and death, tales of fantasy and morality: these are the works of South American master storyteller Horacio Quiroga. Author of some 200 pieces of fiction that have been compared to the works of Poe, Kipling, and Jack London, Quiroga experienced a life that surpassed in morbidity and horror many of the inventions of his fevered mind. As a young man, he suffered his father's accidental death and the suicide of his beloved stepfather. As a teenager, he shot and accidentally killed one of his closest friends. Seemingly cursed in love, he lost his first wife to suicide by poison. In the end, Quiroga himself downed cyanide to end his own life when he learned he was suffering from an incurable cancer. In life Quiroga was obsessed with death, a legacy of the violence he had experienced. His stories are infused with death, too, but they span a wide range of short fiction genres: jungle tale, Gothic horror story, morality tale, psychological study. Many of his stories are set in the steaming jungle of the Misiones district of northern Argentina, where he spent much of his life, but his tales possess a universality that elevates them far above the work of a regional writer. The first representative collection of his work in English, The Decapitated Chicken and Other Stories provides a valuable overview of the scope of Quiroga's fiction and the versatility and skill that have made him a classic Latin American writer.",
        "authors": "['Horacio Quiroga']",
        "infoLink": "https://play.google.com/store/books/details?id=rYWyRufNC6oC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "For those of you curious about which stories this book includes:The Feather Pillow, Sunstroke, The Pursued, The Decapitated Chicken, Drifting, A Slap in the Face, In the Middle of the Night, Juan Darien, The Dead Man, Anaconda, The Incense Tree Roof, & The Son",
                "review/helpfulness": "23/27",
                "num_reviews": 27
            },
            {
                "review/text": "&quot;The Decapitated Chicken &amp; Other Stories,&quot; by Horacio Quiroga, is a remarkable collection of short stories. Quiroga (1878-1937) was born in Uruguay and ended his life in Argentina. The stories have been translated into English by Margaret Sayers Peden.These are stories of death, violence, horror, adventure, talking animals, and magical transformation. There are a number of grotesque flourishes, especially in the disturbing title story. As a storyteller, Quiroga is comparable to Edgar Allan Poe of the U.S., although I believe his nearest Latin American soulmate is Virgilio Pinera of Cuba.Some of the best tales in this collection include with the already mentioned title story; &quot;Juan Darien,&quot; a magical story which begins &quot;Herein is the tale of a tiger who was raised and educated among men. . .&quot;; and &quot;The Incense Tree Roof,&quot; an ironic tale about a beleaguered civil servant. Essential reading for those with a serious interest in Latin American fiction.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Horacio Quiroga wrote like no other. His use of words is phenomenal, and the way he describes the things and people and places in his stories is almost like being there. You can actually SEE the action develop and unfold before your eyes. He has the ability to literally write the reader into his stories. It gives me the impression of being one of the characters the action happens to during the story. After reading these, the stories are not easily forgotten. A classic for all time.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "While I'm still waiting for Quiroga's individual collections to be published, this anthology offers a stunning sample of the author's work. Peden's translation keeps intact Quiroga's clear and subtle writing about everything from the power of nature to the casuality and subtlety of death. Quiroga is a lesser known influence than he should be, always overshadowed by writers like Borges, Cortazar and even Edgar Allan Poe (whom he admired). This collection--and any collection of this author's works--should be required reading for anyone who thinks about the fine line between life and death.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Belatedly acknowledged as a masterful storyteller, Horacio Quiroga lived a life not a whit less tragical and colorful than those of his characters. From the beginning, his life was punctuated by tragedy and death, culminating in his suicide (he took cyanide). When still a teenager, he accidentally shot his best friend while showing him how to clean a gun. As an adult, he settled in the Misiones jungle, where he built a house with his own hands and tried to wring a living out of a farm. The life of hardship he endured there is masterfully reflected in some of his short stories, as are his lifelong obsessions, death and frustrated love. Quiroga was an admirer of Poe, and some of his early stories try to emulate the writer from Baltimore, but eventually he developed his own style, which is, I believe, even more accomplished than Poe's. In Quiroga's case, as has happened with many other writers, the life has obscured the works. Whenever he is mentioned, most people will tell you &quot;ah, yes, poor guy - everybody in his family killed themselves&quot;. But his short stories, with the exception of a few very famous ones that are taught in high school, are not so widely read. As you will find when reading this collection, he has an unique way of creating oppressive scenarios, charged with fear, tension, and the unseen presence of evil, which eventually leads to unexpected and fearsome climaxes. Yes, he is macabre, and yes, there is a very nasty streak running through some of these stories - but he is also a highly intelligent, resourceful and accomplished writer, and one you shouldn't miss for the world.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is an excellent rendering of some of Quiroga's best short stories. Not only does the translation capture the menace and tension of Quiroga's narrative technique, but also his stunningly vivid descriptions of nature. Blood-sucking spiders, poisonous snakes and insane children make victims of unsuspecting human beings in macabre and morbid ways. Gripping stuff.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "indonesian new guinea west papuairian jaya periplus adventure guides",
        "description": "Journey to the Stone Age In one of the last untamed places on Earth, Indonesian New Guinea's snowcapped peaks tower above steaming rainforests and huge crocodiles stalk in thick mangroves ringing the island. Whether you lounge on the white beaches of Biak, or trek around Wamena, Indonesian New Guinea offers the adventure of a lifetime. The ultimate adventure guide This is the most complete guide to Indonesian New Guinea ever produced. Hundreds of pages of travel tips and dozens of lively articles cover every aspect of the island's history and geography, taking you to lots of rarely- visited places. The nitty-gritty, from A to Z Detailed maps of every town and region of Indonesian New Guinea are included, along with personal recommendations from our expert authors on how to get around, where to stay and eat, and how to get the best value for money.",
        "authors": "['David Pickell']",
        "infoLink": "https://play.google.com/store/books/details?id=9prTAgAAQBAJ&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Having Just returned from Western Papua I can say this is a really good guide. It was well researched, informative and definitely added to my enjoyment. A few of the points/suggestions seemed a bit out of date but aside from that I heartily recommend this book as a smart, sober, interesting guide. A must buy for anyone travelling to the Asmat.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Being the only guidebook to West Papua/Irian Jaya alone is a major merit of it. It also has well-researched background information and decent practical details on the major tourist attractions of this area.However, ONLY the major tourist attractions (Jayapura/Baliem/Biak/Manokwari/Asmat) are covered in any detail, and even many of those descriptions are simply accounts of the author's own travels there, which seem to have taken place many, many years ago.There is no description of plenty of other, relatively accessible and increasingly popular parts of Papua, some of which are actually covered in the Rough Guide to Indonesia.But with coverage of this region in general guidebooks to Indonesia invariably limited in length, this book is certainly still worth buying by anyone who wants to spend more than just a week there.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the night comes on",
        "description": "Longlisted for the prestigious Miles Franklin Award, this \"moving account of the depth of ordinary lives\" (Library Journal, starred review) tells the story of a young Tasmanian girl and a Danish sailor and the brief encounter that leaves a lasting impact on both. Isla is a lonely girl who moves to Hobart with her mother and brother to try to better their lives. It's not really working until they meet Bo, a crewman on an Antarctic supply ship, the Nella Dan, who shares stories about his adventures with them-his travels, bird watching, his home in Denmark, and life on board the ship. Isla is struggling to learn what truly matters and who to trust, while this modern Viking is searching to understand his past and to find a place in this world for himself. Though their time together is short, it is enough to change the course of both their lives. Praised for writing that is \"vivid and distinct\" (Library Journal, starred review) and \"exquisite in its simplicity and eloquence\" (Kirkus Reviews), Favel Parrett delivers a stunningly beautiful novel-\"spare but memorable\" (Booklist)-about the remarkable and unexpected bond forged between strangers.",
        "authors": "['Favel Parrett']",
        "infoLink": "https://play.google.com/store/books/details?id=d6qSBAAAQBAJ&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 6.0,
        "review": [
            {
                "review/text": "Steve Duffy has done a brilliant job of producing stories that have the genuine atmosphere and &quot;feel&quot; of the classic English ghost stories from the late 19th and early 20th centuries. If you're a fan of the classic tales of M.R. James, and feel pangs that there are not *more* stories by Monty, Duffy offers delightful consolation. Duffy (as he explains in fascinating notes on the stories at the end of the volume) works hard to maintain the subtlety and refinement of the classic ghost story (some readers may feel that some of the tales might be a bit *too* restrained). But he can also let the spectres rip, as a story like &quot;Figures on a Hillside&quot; shows. For my money, Duffy is right to aim for restraint: his stories put a premium on atmosphere and the careful, subtle build-up of dread and suspense. I've read all of them more than once, and I know this is a book I'll enjoy throughout my life. And, as virtually all of the Ash-Tree limited edition books are, this is a beautiful and beautifully-made book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "First let me state my \"position\" with respect to this book: IT IS A COLLECTION OF THE MOST HORRIFYING \"Jamesian\" STORIES THAT I HAVE EVER READ. Whenever we talk or think about pastiches, esp. those written in the style of M.R. James, we tend to think that the 'pleasing' terrors would be just that: 'pleasing'. But these stories overcome that limitation with their tightness of plot, superb characterization, and some of the most terrifying supernaturally villainous elements in my knowledge. Although it may do the author a great disservice, yet I am tempted to provide a story-by-story list of contents by lifting it from the exceptional Supernatural Fiction Database provided by Tartarus Press(maybe simply to rub the point vengefully to those who can not get hold of a copy of this book, since it has gone out-of-print):The Night Comes On: about a grand design of a Crowly-type person to reanimate Mummies, and the inevitable consequences of it in London;Out Of The Water, Out Of The Earth: Man holidaying on a remote Italian island stumbles upon something nasty and inadvertently lets it loose;The Close At Chadminster: Antiquarian menaced by Thing long dead-and-buried while advising on cathedral renovations;The Last Of The Scarisfields: Scholar unearths the truth behind a long-ago crime in the grounds of a Lake District stately home;The Hunter And His Quarry: Englishman ignores local advice and visits small Baltic island, and something starts chasing him, with what intent?;The Ossuary: If there's one thing worse than visiting remote islands, it's poking around ossuaries, Especially on Good Friday, when the Dance of the Dead is about to begin...;Running Dogs: Isolated village in East Anglia has a strange railway station, and even stranger inhabitants;One Over: Elsewhere in East Anglia, the sea-buried dead do not lie still;Figures On A Hillside: Man carries out research into chalk giants: finds more than he bargained for;Ex Libris: Or, why it's not always best to return books to their rightful owners...;The Story Of A Malediction: Weird travelling folk - not the sort of people you want to cross;The Vicar Of Wryde St Luke: Or, why it's always best to return books to their rightful owners;The Marsh Warden: Traveller puts up at shunned inn in the Essex marshes and finds out soon enough why it's shunned;The Return Journey: Rip-snorting Victorian melodrama set in and around Highgate cemetery;Nigredo: An antiquarian on the trail of alchemists in Holland runs into trouble when unearthing their industrial waste;Tidesend: recollections of a childhood by the Thames, and the strange little girls next door.If you can get hold of this collection, irrespective of the price that the book-seller may quote, accompanied by evil smirk, buy it and read it keeping the lights on, otherwise you might regret reading the book. Honestly!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the monkeys and the mango tree teaching stories of the saints and sadhus of india",
        "description": "These twenty-five beautifully illustrated tales capture the mystery, the enchantment, and the profound spiritual learning that is India. Drawn from the great Indian epics the Puranas, the Upanishads, and the Mahabharata, these tales put ageless Indian wisdom into the form of stories to delight young and old alike.",
        "authors": "['Harish Johari']",
        "infoLink": "http://books.google.com/books?id=-QjnthRMW6UC&dq=The+Monkeys+and+the+Mango+Tree:+Teaching+Stories+of+the+Saints+and+Sadhus+of+India&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "&quot;The Monkeys and the Mango Tree&quot; is a special book for people of all ages and religions. This large collection of Hindu wisdom tales, retold by Johari, are classic stories that still apply in the modern age. The stories are short but leave the reader thinking. A truly lovely book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The selection of tales in this volume is acceptable - if you've read little of this type of literature, you will probably be positively impressed with the variety of stories and with the fact that few of the stories are blatantly diadactic. If you have read much similar material, the stories will strike you as satisfactory in their retelling but you will have seen much of the material before, often with much more sparkle to the story.The Bird of Prosperity tells of a poor family whose concern for each other gains them wealth and conpares their plight with the plight of a greedy family.The Butter in the Milk is primarily an analogy of God in the universe compared to butter in the milk.The Saint and the Scorpion is a story of the value in following your dharma.The Merchant Who Would Not Go to Heaven is a story of a Merchant who has to many responsibilities to accept an offer to go to heaven.Siva and the Demon, and Narada's Infatuation come from Hindu mythology.The book contains about 25 such stories alone with etching style illustrations; the foreward is best left unread.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "The book comprises of 25 short stories from India. These stories are developed in the context of the saints and sadhus of this land of ancient religions. Each story has a clear moral message to the young people for whom these are targeted. The simplicity of the style and the language makes it easy for everyone to follow the events even if one is uninitiated in the cultural and religious complexity of India.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "georgia",
        "description": "Winner of the Prestigious Andre Simon Award explores Georgias culinary traditions. Nestled between the Caucasus Mountains and the Black Sea, and with a climate similar to the Mediterraneans, Georgia has colorful, delicious food. Vegetables blended with walnuts and vibrant herbs, subtly spiced meat stews and home-baked pies like the irresistible cheese-filled khachapuri are served at generous tables all over the country. Georgia is also one of the worlds oldest winemaking areas, with wines traditionally made in qvevri: large clay jars buried in the ground. Award-winning food writer and photographer Capalbo has traveled around Georgia collecting recipes and gathering stories from food and winemakers in this stunning but little-known country. The beautifully illustrated book is both a cookbook and a cultural guide to the personal, artisan-made foods and wines that make Georgia such a special place on the worlds gastronomic map.",
        "authors": "['Carla Capalbo']",
        "infoLink": "http://books.google.nl/books?id=YdMijwEACAAJ&dq=Georgia&hl=&source=gbs_api",
        "categories": "['COOKING']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Bradt Travel Guide is the best guide to Transcaucasia currently available. The Guide is comprehensive in its scope of coverage of Georgia, with reliable details on sights, lodging, restaurants, etc. -- but the book is most notable for its outstanding background information regarding this little-known region. The history and development of the region, the present political situation, the ecological state of affairs, as well as cultural, religious and culinary background are well covered. Almost as a bonus, the book contains a good chapter for a short visit to neighboring Armenia. The author is an experienced travel writer (see also his &quot;Rough Guide to Romania&quot;) and it shows. You really can't go wrong with this book if you find yourself travelling to this fascinating, off-the-beaten-path part of the world.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Like all the Brandt guides I've used, this one provides a wealth of background and planning information for a country with few other comprehensive resources for travelers. Tim Burford writes with clarity and color, making the text a pleasure to read. While no guide can capture every point of interest for every traveler, the Brandt guides always help me find the path to discovering my special places and moments, and the guide to Georgia is no exception.As with any guide, travelers need to remember that conditions can alter radically in developing countries between the time information for the guide is collected and the time of one's visit.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I just purchased this book for trip to Georgia and have to say it hardly helped me at all. It is laid out ok, but the issue that the country is changing so quickly, a 5 year revision turnaround on this book simply doesn't work. Almost all of the practical information is incorrect about transportation, museums, roadways, etc...If you are planning a trip to Georgia, this may be slightly useful for one or two sites, but you really need to consult the internet for trip reviews from other sites like Trip Advisor or Virtual Tourist.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have just returned a month's teaching in Georgia and found the Bradt guide amazingly accurate, current and very helpful. The author knows culture, birds, history and politics. Can highly recommend if you plan to visit.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is the most detailed travel guide I've found so far on Georgia and for that I am eternally grateful. However, I only give it four stars because some of its directions are inaccurate (in one case, a road was washed out and impassable without a 4WD, though that may have occured post-publication). Double check with maps and the locals before attempting any serious cross-country journeys.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "During my journey through the Caucasus, I bought the Bradt guide Georgia, trusting the Bradt guides \"reputation\".I should not have.This guide is too verbose and not clear enough, the search for the required information is not easy because buried in long paragraphs.The detail that I was confirmed in my poor opinion of this guide: a guesthouse in Kutaisi was warmly recommended and of course I've gone there...but I quickly realized that it was a brothel (!)At the end of my trip, I made the comment to the editor. I never received any response. This means that the entire editorial policy is very doubtful. They could at least answer me with a kind of automatical polite message ... But no, nothing.In short, do not rely on a reputation, you may be very disappointed.For my next trip I would defitively avoid the Bradt guides.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "costa rica eyewitness travel guides",
        "description": "Your journey starts here. We've reimagined and updated our iconic DK Eyewitness travel guides. This brand new Costa Rica guide, now in a lightweight format, has been expertly curated with all new photography plus DK's much-loved illustrations and maps. - Gorgeous, all-new colour photography so you can imagine yourself there - Reasons to love Costa Rica- amazing wildlife, natural wonders, breathtaking beaches - what will yours be? - See Costa Rica from a different angle- lots of fresh ideas for exploring this spectacular country - A fully illustrated and detailed field guide to Costa Rica's incredible flora and fauna - A year-long calendar of events in Costa Rica gives a selection of local events and festivals for all seasons - Expert advice covers the practical stuff- get ready, get around and stay safe - Detailed, colour maps help you navigate the country with ease - Expert tips to make memories that last - where to snap and share the perfect photo, take in stunning views and escape the crowds - The most authentic places to stay, eat, drink and shop - Easy-to-follow walks and itineraries take you on a tour of each area, with plenty of food and drink stops en route - Hand-drawn illustrations show the inside of the must-see attractions, including San Jose's Teatro Nacional and Centro Costarricense de Ciencias y Cultura, and Cartago's Basilica de Nuestra Senora de los ngeles - Covers San Jose, the Central Highlands, the Central Pacific and Southern Nicoya, Guanacaste and Northern Nicoya, the Northern Zone, the Caribbean and the Southern Zone About DK Eyewitness Travel- For 25 years, DK's beautifully practical Eyewitness guides have been combining inspiring ideas and expert advice with easy-to-read maps and vivid photography to inform and enrich your holiday. In 2018 the Eyewitness series was relaunched with a stunning new look that you will love even more. DK is the world's leading illustrated reference publisher, producing beautifully designed books for adults and children in over 120 countries.",
        "authors": "['Dk Travel']",
        "infoLink": "http://books.google.com/books?id=UvcEwQEACAAJ&dq=Costa+Rica+(Eyewitness+Travel+Guides)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "We used this guide in our recent trip to Costa Rica. In this review I will tell you the benefits of the formatting style of this guide; the strengths of the guide, and then a few weaknesses where more information would have been helpful. I will end the review by relaying my assessment of the finest resource in Costa Rica and recommendations regarding use of the guide for travel in Costa Rica.The guide is formatted very well, as are all the Eyewitness Travel Guides. They give you basic cultural, historic and political background. They then give detailed section by section analysis of geographic areas where they identify the major points of interest and then show you a small photograph related to the item with a short basic informative description. The guide also gives more detailed two page essays with drawings and photos for major points of interest. The guide ends with traveler information on hotels, restaurants, transportation and safety.Now I would like to tell you about the strengths of the guide in describing Costa Rica. We were interested in spending time on the Pacific beaches and visiting the lowland rainforrests. However we also wanted to spend time seeing the volcanoes in the center of the country and visiting the high mountain cloud forests.We drove from San Jose to Manuel Antonio National Park and resort area. We stayed 3 nights in a beach hotel which was very basic but within a 5 minute walk of the beautiful Manuel Antonio beaches. These beaches have a mixed very fine sand of white silica and black volcanic pumice that is perfect for walking, relaxing, and playing. The Manuel Antonio Park is a must see attraction if you are visiting the Pacific coast. Giant varied bromeliads weight down vines and trees. Giant trees rise above the jungle to the light, buttressed by high bladed roots.The beaches within the park are excellent and the hikes to Punta Cathedral and other lookouts are worth the climb. Only 600 people are allowed to visit every day so go early. Wear or carry your bathing suit. To get to the park entrance you may have to wade through a creek in dry season. We saw spider monkeys and a family of Capuchin monkeys. The Capuchins are amazing with their pink faces trimmed with white fur and their agile black bodies and tails. We saw iguanas of every size as well as two sloths hanging from vines. We were warned not to drink local water but we drank it for 8 days while in Costa Rica without problems. To get to the park you have drive for 3.5 hours from San Jose through the mountains on twisting roads. You then drive on a long road that parallels the beach through the towns of Jaco, Puntarenas, and Quepos. The evenings cooled down to around 69 degrees, which were perfect for sleeping under a ceiling fan. The beach and park warmed up to 86 at mid-day. Driving along the beach roads you see African oil palms growing in fields that once held bananas before the Sigatoka fungus wiped them all out. One day we explored Playa Seca. We found 10 miles of undeveloped totally beautiful beaches surrounded by jungle and a few beach homes.We then spent 3 days in a bed & breakfast in Heredia, a town north of San Jose founded in 1706 with a charming central square, cathedral and central market. From here we went on two long day trips. On the first trip we wanted to see the Poas and Barva volcanoes and the La Paz waterfall. Because of the twisty roads, expect to take far longer to visit a site that you may initially estimate. We arrived at Poas at 10:30 am and the clouds had already gathered so much that we had to wait between clouds to see the crater and its lake. We hiked to a hearby crater lake but by then the clouds were so heavy we couldn't see anything. However the hike was great with big navy blue-green hummingbirds swooping in and out of the cloud forest flowers. The La Paz waterfall was next on the list and it is very impressive. You can park your car and walk under. Then we tried to get to the top of the Barva Volcanoe. Along the way you will pass charming mountain villages and cool highland coffee plantations. Whereas on the beach you see Brahmin cattle bred to live in bright sunlight, in the mountain villages around the volcanoes you see dairy cows that provide the dairy products for the country. We finally reached the end of the road on the way to the Barva Volcanoe but found that we had to leave our car and hike 6 kms. or else try to drive over incredibly rocky dangerous roads. Our car would have been vulnerable if we left it to hike to the top whereas if we took the car, we could have easily broken an axle. Then next day we decided to try the Irazu Volcanoe and the Guayabo archeological site. Irazu was beautiful even if it took 3.5 hours to find the top. You are above the cloud line so the craters and the lake inside the principal crater were very dramatic. It took us hours to find the entrance to the Guayabo site only to discover that the road ran out and we would have to take our car over 10 kms. of the most pot hole infested dirt road I have ever seen. Again we couldn't abandon our car for several hours to walk 10 kms. into the site and 10 kms. out and yet we feared breaking an axle on the road. We then had to return to Heredia after 7.5 hours on the road to see one volcano.So what were the weaknesses in the guide? First, because there are so few road signs in Costa Rica, a more detailed map with a few more minor roads and small village benchmarkes would have been helpful. Second, it would have been nice to be warned about the difficulty in reaching both Barva and Guayabo. Third, we tried to visit the Rainmaker Private Conservatory forest but found that there were only two tours a day with the bilingual tour at 1:00 pm for a cost of $65 per person. You could not explore except as part of the tour. I wish we had been prepared by the guide for the tour schedule and the cost. We heard that Rainmaker uses high suspension bridges rather than zip lines for tree top exploration and thus we were disappointed. Fourth, and this is the most irritating issue, is the issue of rental car insurance. We selected the lowest rate weekly car rental which was around $150 from a Coasta Rican company. We found out at 11 pm as we were picking up our car that whereas our credit card covered collision insurance, the cost of Costa Rican liability was $250 for the week, pushing the cost to $400. When shopping for the best rental car rate, make sure you explore whether Costa Rican liability insurance is included in the price quote or extra. Also, the car we rented had very little tread on the back wheels and we had a flat tire. The rental company told us it was our responsibility to pay for the tire repair which turned out to be on $3 at a filling station.Let me end by saying that the Costa Rican people are beautiful and warm hearted. The country is full of incredibly stunning young women and model-handsome young men. The children are so beautiful they are angelic. Because we got lost 100 times, we frequently had to ask people walking along country roads for directions. I was continually amazed by the hospitality and warmth of the beautiful people of Costa Rica. This guide was very useful for exploring this fantastic country.",
                "review/helpfulness": "64/72",
                "num_reviews": 72
            },
            {
                "review/text": "This Eyewitness Guide is devoted to Costa Rica and is a pretty typical entry in the series. It opens with a discussion of the history and culture of the country as well as an overview of some of its more prominent characteristics such as beaches, weather, and wildlife. Next, there are a number of sections detailing geographic regions such as San Jose, Central Highlands, Central Pacific, Guanacaste & Northern Nicoya, the Northern Zone, the Caribbean, and the Southern Zone. Each area gets 13 pages or so of descriptions and photographs. Listings for hotels, restaurants, shopping, entertainment, and outdoor activities are presented in the back of the book rather than with the geographic region they pertain to. Finally, there is a section discussing practical information of various kinds for travelers.The great thing about this Eyewitness Guide to Costa Rica is that it offers over 650 photographs to help bring a gorgeous country to life. Rather than picking which places you most want to visit based on imagining them from descriptions, you can see them for yourself here. The problem with this guide is that its 288 pages are dominated by those photographs rather than detailed descriptions of hotels, restaurants, activities, etc. It simply isn't possible to put comprehensive detail into a few hundred pages when you already have more than 2 photos on average for each and every page.I would recommend buying this guide, but I would also recommend purchasing theFrommer's Costa Rica 2008 (Frommer's Complete)to help plan the details of your trip. This is a great starting point, but you'll definitely want a resource with more information before you're done.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I used this guide in conjunction with the Lonely Planet guide. The Eyewitness Guide shows the reader a great deal more. While Lonely Planet provides a lot more detail, but this one doesn't leave it to your imagination since they have lots and lots of pictures. Also, this one is smaller and easier to carry.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a college student studying abroad in Costa Rica for the semester. So far, I've been pretty disappointed with the Eyewitness travel guide. Other students and I travel to different parts of CR about every other weekend, but this guide is painfully lacking in writing on the logistics of traveling. (I.e. bus services to use, hostel recommendations, hostel contact information, etc.) The small traveler's needs section that is present is very general and the few hotels that are offered are geared toward a traveler with money to spare. I also found that, despite having many beautiful pictures, there aren't many details about places of interest or special events in CR.If you're a college student, or a traveler on a budget who needs information about places to stay, I would go for Lonely Planet or the Rough Guide to Costa Rica (A few of my friends here have lonely planet and that's the guidebook we use most to plan our trips; I rented the Rough guide from the library before my trip and thought it was pretty helpful.)",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "frommers nova scotia new brunswick prince edward island frommers complete guides",
        "description": "Frommer's Nova Scotia, New Brunswick & Prince Edward Island is packed with all the facts, tips, and descriptions you need to have perfect vacation: Our author has written about Atlantic Canada for years, so he's able to provide valuable insights and advice. He'll steer you away from the touristy and the inauthentic and show you the real heart of the Provinces. Follow his picks for the best travel experiences -- including sea-kayaking Nova Scotia, biking the Cabot Trail, hiking Gros Morne National Park, driving along the Viking Trail in Newfoundland, walking through Annapolis Royal in Nova Scotia, and feasting on fresh lobster and Digby scallops -- and you're sure to have a fantastic trip. A guide to the flora and fauna of the Atlantic Provinces means you won't miss a moose or loon; just keep your binoculars handy. Also included are accurate regional and town maps, up-to-date advice on finding the best package deals, and an online directory that makes trip-planning a snap.",
        "authors": "['Paul Karr']",
        "infoLink": "http://books.google.com/books?id=5k9UmQEACAAJ&dq=Frommer%27s+Nova+Scotia,+New+Brunswick&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "very limited information about Nova Scotia. I have used many guide books in the past and this one was a real disappointment ! In some regards actually found the AAA guide to be more useful,,,",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "Unfortunately, Frommer's NS, NB, & PEI Tour Book lacks some top attractions. For example, it is unforgivable that it does not mention Founder's Hall (one of the best museums, if not the best, devoted to the history of Canada)on PEI. Another example is its failure to mention Woodleigh (recently out of business due to the illness of the owner, but in operation when the book was published), also on PEI.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I usually like the Frommer guides, but felt that this guide was really lacking in many respects. Both the Moon Atlantic Canada and Lonely Planet guides provide more detailed information. We are going to Nova Scotia and PEI for our second visit and wanted more information on the specific sites, accomodations, and restaurants. This guide doesn't list as many towns in the regions and therefore lacks associated info. While I purchased this guide for the previous trip, I will purchase the Moon guide for this trip.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "new zealand eyewitness travel guides",
        "description": "Discover New Zealand with this essential travel guide, designed to help you create your own unique trip and to transport you to this beautiful country before you've even packed your case. Hike up mountains and glaciers, taste world-class wines, go whale-watching or enjoy spectacular coastal drives - DK Eyewitness Travel Guide New Zealand covers the must-see sights and the hidden corners, so you won't miss a thing. - Gorgeous, all-new colour photography so you can imagine yourself there - Reasons to love New Zealand- Maori culture, geysers and mud pools, pristine beaches - what will yours be? - See New Zealand from a different angle- 24 pages of fresh ideas for exploring the country's landscape and culture - A year-long calendar of events in New Zealand gives a selection of sporting occasions, celebrations and festivals for all seasons - Expert advice covers the practical stuff- get ready, get around and stay safe - Detailed, colour maps help you navigate the country with ease - Expert tips to make memories that last - where to snap and share the perfect photo, take in stunning views and escape the crowds - The most authentic places to stay, eat, drink and shop - Easy-to-follow walks and itineraries cover the whole country, with plenty of food and drink stops en route - Hand-drawn illustrations show the must-see attractions, including Auckland's Skytower, Olveston Historic Home and Fiordland National Park - Covers The North Island- Auckland, Northland, The Central North Island, Wellington and the South; The South Island- Marlborough and Nelson, Canterbury; and the West Coast, Otago and Southland. About DK Eyewitness Travel- For 25 years, DK's beautifully practical Eyewitness guides have been combining inspiring ideas and expert advice with easy-to-read maps and vivid photography to inform and enrich your holiday. This year they have been given a stunning new look that you will love even more. DK is the world's leading illustrated reference publisher, producing beautifully designed books for adults and children in over 120 countries.",
        "authors": "['Dk Travel']",
        "infoLink": "http://books.google.com/books?id=Gu2cvQEACAAJ&dq=New+Zealand+(Eyewitness+Travel+Guides)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I usually love the Eyewitness guides - they're a consistently high standard, and beautifully presented. Full-colour photos on glossy pages, jam-packed with information on places to visit, images that leap off the page to tempt you: this is the guidebook that will really get your feet itching to go (if they're not already, of course!)I was so tempted to give this five stars, but I really think it's lacking when it comes to information on getting around, accommodation, and eating places. Sure, there's a fair bit, but nowhere near as much as you'd get in Lonely Planet, for example. I found this was especially the case for budget travellers like myself. Eyewitness lists only three hostel/backpacker places out of the two dozen or so that are in Auckland's city centre; the ratio is about the same for other locations throughout New Zealand. The same applies to eating places, where the researchers of the book seem to have a very different idea as to what constitutes 'cheap' - up to $25 for one meal (the '$' category) is more than what most backpackers would allow for food for an entire day! There are also very few prices listed throughout for things like entrance fees to attractions and activities. I realise that these things change often, but it would be nice to have at least some idea.These are small criticisms, really, in what is an otherwise excellent travel guide. I read most of the section on the North Island before I went, and frequently referred to it during my trip as well. This one is definitely worth a look if you're heading to New Zealand, but bear in mind that it doesn't really cater to budget travellers. Those needing to watch their spending will probably need to supplement this book with Lonely Planet, Rough Guide, or similar to make their dollar go further.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "North island on one side, South Island on the other, in scale of 1:1,000,000. Elevations are color coded and roads clearly indicated as expressways, highways or major roads. There are enlarged inserts of Aukland, Wellington, and Christchurch. I haven't used it yet because we take our trip later this year. However, I have inspected it and it appears to have everything I consider useful in a map.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Hi all -I note that people have mentioned this guide is short on accomodation listings. The New Zealand Automobile Association (AA) and a company called Jasons both provide very detailed accomodation guides which you can pick up in NZ when you arrive. I think both of these are actually free too.Hopefully useful information from a resident Kiwi ... enjoy your travels!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a beautifully produced book, full of photographs on quality paper. (As a result, it is a surprisingly heavy book at 1 1/2 lb.; those who like to travel light may prefer a different book.) It is very comprehensive, listing most cities and sights, and has a color-coded organization that's easy to use. Its weakness is that it lists fewer accommodations and restaurants than a mostly-text guide such as Lonely Planet would give. We used this book on our 5-week trip and it was a pleasure to use, and is now a great reminder since it has photos of virtually everyplace we went.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Overall the Eyewitness series is the best travel guide collection being published, not only for the fact that it is fun to look through and read in its own right, because of the way it shows the sites in beautiful color illustrations, but also because of the wealth of information and the well-thought-out selections its editors include. These books are comprehensive and interesting and great to own, whether one is planning a trip abroad or simply wants to see the sites in foreign places. This '03 edition has been a big help to me in planning my trip to New Zealand, and the '06 edition, due in August, is something I can't wait to get.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This guide was recommended by friends with family now living in NZ.I am interested in facts, not scenic views and this one seems to be a good compromise.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "On an August trip to see family in NZ's Northland, I brought this along and was glad I did. The trouble with visiting Kiwi relatives (and with the Kiwi husband) is that they don't always think of the \"attraction\" things that are between two points, and this helped break up some of the driving with good side trips and information.Light enough to carry along, detailed enough, good pictures and format. I liked it a lot and will take it down on the next trip!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "longstreet highroad guide to the chesapeake bay longstreet highroad coastal guides",
        "description": "An astonishing amount of geological information -- as well as excellent information on historic sites, beaches, places to stay, and places to eat -- abounds in this series of coastal guides. The books feature the best each coast has to offer in a comprehensive and concise format. More than twenty maps guide readers in an easy-to-follow design. Nature lovers will have fun learning about the flora and fauna of the coast, as well as the geology and natural history of each area. Illustrations, sidebars of unique information, and photographs make this a very pleasing book to look through and read.",
        "authors": "['Deane Winegar', 'Garvey Winegar']",
        "infoLink": "http://books.google.com/books?id=lfCkAAAACAAJ&dq=Longstreet+Highroad+Guide+to+the+Chesapeake+Bay+(Longstreet+Highroad+Coastal+Guides)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a very comprehensive guide to enjoying the natural beauty of the Chesapeake Bay and its surrounding rivers and parks. I have on several occasions used the phone numbers on the book to contact fishing holes and parks, and they all have been reliable and true to their descriptions on my visits.The book gives ample attention to the lesser known regions of the area, and spends equal amounts of time exploring Maryland, Virginia and the Delmarva penninsula. In each geographical section, the authors describe the natural and historic draws, as well as give directions, cite a few restaurants and hotels (with prices). Very helpful for someone who is not very familiar with the area.The thing I really liked about this book was it explained wildlife and history of the Bay region well, as well as explain the delicate environmental state of the Bay in the last 100 years. This book is a must have for those exploring the Bay region.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is the same book that was formerly stocked by Amazon as the Longstreet Highroad Guide to the Chesapeake Bay - I think it's being printed by a different publisher now. It's an excellent guide, particularly if you are interested in nature. It includes a nice overview of the natural history of the Bay and then goes on to list attractions around the Bay, divided up into different regions. Each section includes maps, general attractions, parks, natural areas, fishing and boating opportunities, restaurants, driving directions, lodging and campground information.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book povides a lot more then visitor information. I've read several guides to the Chesapeake Bay region and this is the only one that gives the reader a real feel for the area. Places an emphasis on the natural environment. Some guide books spend a lot of time on things around the Bay and ignore the BAY itself. This one has it all. I find myself going back to it often.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    }
]