[
    {
        "Title": "painting with stitches creating freestyle embroidery by hand",
        "description": "For novices and seasoned needleworkers alike, this book guides crafters through the process of creating stunning works of art using a needle as a paintbrush and a vibrant collection of threads as a palette. Needleworkers are shown how to achieve the visual effects that combine the rich texture of tapestry with the dynamic color and composition of paintings. Step-by-step instructions for performing a simple satin stitch are provided, followed by advice for using hand drawings and a collage technique to develop ideas into finished embroidered pieces that retain the spontaneity of the original concepts. A gallery includes examples of portraits, creatures, landscapes, flowers, and abstract designs, all accompanied by line drawing patterns so needleworkers can try their hands at re-creating them as projects or samplers.",
        "authors": "['Sue Dove']",
        "infoLink": "http://books.google.com/books?id=i0deAAAACAAJ&dq=Painting+with+Stitches:+Creating+Freestyle+Embroidery+by+Hand&hl=&source=gbs_api",
        "categories": "['Embroidery']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I love the author's loose free style and the photography of the embroidery is excellent, with many, many full-sized photos. The cover photo of the multi-colored dog is representational of the work on the inside. Nice section on inspiration. My main quibble is that there is very, very little instruction for the actual stitching: five pages (mostly pictures) are it. Too much space is wasted on line drawings of the author's own work. Rather thin for the price, but beautifully executed.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Painting With Stitches: Creating Freestyle Embroidery By Hand is a guide deftly prepared by Sue Dove for advanced embroiderers seeking to create a needlecraft project unrestricted by rigid motifs. A bold, colorful yet somewhat abstract flavor pervades the example embroidered creations, which adapt original artwork to fabric and are displayed with appealing photography. The &quot;materials and techniques&quot; tutorial is informative but brief, with most of Painting With Stitches being devoted to the sample vivid art creations and diagrams that captivate the imagination. A superb guide and a highly recommended source of inspiration for any experienced embroiderer who is looking to create something daring and different.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Lovely photos of a very knowledgeable artist's embroidery techniques. Inspiration galore. Glad to add this book to my library.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "shay pendrays inventive needlework",
        "description": "Create Heirloom-Quality Needlework Noted needlework author and designer Shay Pendray shares her secrets for unique, inventive stitchery. From years of study in Japan and around the world, Shay has learned stitching techniques that will help you create one-of-a-kind works of art. From the basics of framing up, starting and stopping threads, and laying multi-standard threads, to embellishing, combining stitches, and couching techniques, you will be inspired to create needlework you never dreamed possible. Suitable for needlepoint stitchers of all levels, this reference combines illustrations and full-color photographs to demonstrate each technique. -> Gold Work - Stunning projects using metallic threads on silk ground fabric with a variety of couching techniques (Shippo, maze, back and fourth, raised, and cloud filling) -> Painted Canvas - Tips for selecting the stitches and threads most suitable for each area of the design -> Shading - Methods to blend thread colors for lovely realism",
        "authors": "['Shay Pendray']",
        "infoLink": "https://play.google.com/store/books/details?id=0hJjDwAAQBAJ&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book does offer insight into shading and goldwork techniques, but has few, if any, practice projects. The pictures are very lovely, but I was led to believe that there would be more patterns to practice on.If you are looking for a book with projects, minimally practice projects, this book is not the one to buy. No projects, thus no materials and fibers listed, no patterns.As a non professional needlework enthusiast, I need a head start on any project, because I don't have time to design a project from start to finish; books with projects offer the headstart I think most people in my position need: the hard work is done (which is why we pay for the book) and it is left to the individual needlework enthusiast to tweek it here and there to fit his or her decor/color favorites/personalization, etc. This book does not save any time or give any headstart to any project, which is the reason people pay money to the professional needleworker for their efforts. These efforts have not been made in this book.I would say a person looking for a book in goldwork or embroidery (shading, with silk or wool) would be much better off buying \"A Victorian Floral Alphabet\" \"Redoutes Finest Flowers in Embroidery\"; \"The Art of Painting with a Needle\"; these books make beautiful, individualized embroidery projects a possibility for those of us who don't have the time to start from scratch.This book is the equivalent to buying a pair of stamped pillow cases or a tablecloth to embroider, but when you get the pillowcases or tablecloth, they are blank, there is no design stamped on them, and the manufacturer includes instructions on how to embroider them.",
                "review/helpfulness": "47/56",
                "num_reviews": 56
            },
            {
                "review/text": "For the serious needleworker, Shay Pendray's Inventive Needlework is a must-have book. Included are discussions on materials and on techniques, clearly drawn diagrams, and excellent color photographs. Examples of various techniques are drawn from both the author's own teaching pieces and from other pieces which have been exhibited at ANG National Seminars. I was particularly excited by the close-up photographs, which show stitching details clearly. (Many of the goldwork photographs were stitched on a black ground) Note that this book is about techniques, and is not a catalog of diagrams for specific stitches - there are many other reference books which fill that purpose.For needleworkers who are interested in advancing their skills, or who have wished for opportunities to examine advanced-level stitching in detail, the excellent photographs and elaborating text of this book offer a great deal of inspiration.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "This is \"the\" book for the serious needleworker. It has the most comprehensive technique instructions of any book, ever, for gold work, painted canvas, and shading; it isn't a cutesy book of simple projects. The illustrations are excellent. The color photos are to die for: closeups of step-by-step work in progress and examples of finished work will enable you to strive for excellence in your own work. This is a teaching book with important information about threads, fabrics, frames, tools, framing up, tips ... the list goes on and on. I can't recommend this book any higher.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "For people who have watched her Needlearts show on PBS, Shay and her wonderful way with all forms of needlework needs no introduction. For those who haven't let's just say that Shay is one of the nicest and most innovative needleworkers around.This beautiful book distills much of Shay's wisdom covering Goldwork, painted canvas and shading. Each section is lavishly illustrated with detailed explanations of techniques. I'm not very familiar with Goldwork, stil I found Shay's explanations clear enough so that I would feel confident tackling a beginner's project. There is a charming one, a dove, in the book.The section on painted canvas has a good overview of threads andtechniques. It includes detailed instructions on techniques whichoften aren't covered, stripped threads, using a laying tool, andproperly starting and ending threads. A wonderful part of thissection talks about choosing the right canvas. Further informationcovers how to change colors on a painted canvas as well as severaltechniques for optically mixing colors.Following this chapter about painted canvas is a chapter which goesinto depth discussing how three different painted canvas Christmasstockings were stitched. Several pages are devoted to each canvaswith a picture of the entire canvas as well as close-up pictures ofthe details. Even if these three Tapestry Tent designs aren't yourcup of tea, you will find many ideas for using on your own canvases.The section on shading covers two different techniques to createrealistic shading. While the techniques were developed for surfaceembroidery, a part of this section shows how they can be applied tocanvas. In fact, the shaded canvas piece is photographed on thecover of the book.The book ends with a gallery of designs. Each of the pieces in thegallery shows Shay's consummate skill as a designer and stitcher.They provide much food for inspiration.While this book is not a book for beginners. Every stitcher willlearn useful information and find plenty of inspiration in thiswonderful book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "creative hand embroidery",
        "description": "Illustrated with over 40 embroideries, this book is specially designed to encourage beginners to explore the creative possibilities of hand embroidery. It begins with the basic know-how, and shows how to use silk threads and simple stitches to create original embroidered countryside scenes. techniques. This is followed by imaginative ideas developing this theme by improving the design and colour scheme, plus advice on how to add applique and fabric painting techniques to achieve maximum effect. The final and more advanced section shows how to incorporate textured items such as miniature padded flowers and animals and wooden gates, and how to achieve extra tone and perspective.",
        "authors": "['Sue Newhouse']",
        "infoLink": "http://books.google.com/books?id=PY8BAAAACAAJ&dq=Creative+Hand+Embroidery&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is an absolutely amazing book. As a moderately experienced embroiderer and fiber arts person, I mostly drew inspiration and instruction from the many color pictures, not just of the author's embroideries, but those of her students! The embroideries pictured are just stunning. What is truly impressive is just how technically simple this embroidery style is. She does provide very complete instructions on the stitches (straight stitches, french knots, and lazy daisies are about as complicated as it gets) but mostly this book is about ideas and artistry. She provides complete directions on one example, but then clearly she wants you to branch out and embroider your own gardens and landscapes. And I was able to! I'm not the greatest artist, but using this book I've been able to create original embroidery designs that look almost as good as those in the book! If you are getting a little tired of cross-stitch or following other people's designs, this is the book for you!",
                "review/helpfulness": "49/49",
                "num_reviews": 49
            },
            {
                "review/text": "I've been waiting for this book on back order and it was worth the wait! The scenery pictures in the book which have been embroidered (very well) by Sue's students, present a real variety of scenes and what interests me the most is some of them have other skills besides embroidery used, for example, you can create a realistic stone wall - and a gate! I love that kind of creativity because it adds to the picture you are creating and means you can embroider anything at all, not just landscapes. Each secne in the book has information on stitches used, and preparation, eg, some have painted sky or background which adds to the realisticness of the scenes. The scenes are English in case you are Australian or American/Canadian, but the majority just need local flowers added to make it fit your country. Excellent book, can't wait for her other book to arrive!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was ready to go a step higher in my embroidery work, and this is it! I have both of Sue's books, and pour over them looking at the lovely photos of work the ladies have done, getting inspiration for my own. I have already, since Christmas, completed three projects of this type and have more in my head. You don't have to have alot of experience, she has all the needed stitches shown right there, and you can complete them with little cost for materials (also listed in the book.)",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "nail artthe nail design pa",
        "description": "Say hello to fabulous nail art designs you can create! It's time to get your nails noticed! Catherine Rodgers, the creator of the popular nail art YouTube Channel Totally Cool Nails, shows you how to paint one-of-a-kind nail art designs right in your own home. With her guidance and helpful tips, you'll create 50 super-stylish nail art designs like Starfish, Rainbow Wave, Candy Heart, and Watermelon Nails. She also shares her secrets for giving yourself the perfect manicure, including how to prep your nails, use popular nail art tools, and personalize the designs. Whether you're looking for a super-stylish pattern or a fun holiday nail art design, this guide has a fantastic option for every occasion and mood. Complete with step-by-step instructions and full-color photographs of each project, Totally Cool Nails gives you awesome nails--every time!",
        "authors": "['Catherine Rodgers']",
        "infoLink": "http://books.google.com/books?id=vxNkuQEACAAJ&dq=Nail+Art:The+Nail+Design+Pa&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is a very good little book. We have had a high demand for this book. It is small enough to carry around with you. The pictures are very clear and colourful. A must buy!!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Uses lots of nail transfers that I have not found locally (the author lists resources, but mostly in London.) Most designs are very easy to duplicate. Would have prefered buying just the book, without all the polish and extras.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the art and craft of wooden toys",
        "description": "Learn to handcraft colorful and original wooden toys, from an off-road vehicle complete with working crane to classic folk toys.",
        "authors": "['Ron Fuller', 'Cathy Meeus']",
        "infoLink": "http://books.google.com/books?id=ThnIPAAACAAJ&dq=The+Art+and+Craft+of+Wooden+Toys&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Most of the toys in here are not for the novice craftsman. If you are serious about toymaking this is a great book to use to take the next step both in terms of toy complexity and intended age group. Most of the toys are not for the toddler as they involve mechanisms and small parts that are not well suited for unsupervised use by the younger set.Beautiful book with lots of color pictures. The motion mechanisms used by the author are a great idea resource",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "An excellent book for those interested in the magical art of toymaking! The 19 toy designs presented in this book range from a simple jigsaw puzzle to a more complex automated design with a turn-crank. Introductory sections cover equipment, materials, and basic techniques. All of the toys are presented with lovely and colorful painted finishes. This collection got my creative juices flowing, and I even came up with some spin-off designs of my own. Worth finding a copy!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "creative collage techniques",
        "description": "Get ready to make great art! New Creative Collage Techniques is filled with the guidance you need to make striking collages with a range of materials and mediums. It's fun and easy to jump right in, whether you're an experienced artist looking for something new or a new artist looking to make something unique. From basic methods to the latest innovations, this guide illustrates more than 60 exciting collage projects complete with detailed instruction, quick tips, charts and glossaries. In addition, seven start-to-finish demonstrations show you how to use these techniques to create your own stunning work. You'll create: -> Fantastic found-paper collages formed from items right within your reach -> Compelling collage designs using decorative and ready-made papers -> Mixed-media collages combining acrylics, watercolor, rice paper and more -> Compositions featuring textured backgrounds made from paper, paint, natural materials and other collage materials -> Original paper (hand made by you) artfully arranged to form collages that are uniquely yours -> Collage that stands the test of time through the use of archival materials and techniques You'll also be inspired to push the potential of this limitless art form by studying the diverse work of 60 featured artists. As author Nita Leland says, \"Experiment. Be Creative. Have fun. You're a collage artist!\" With this guide, you've got what you need to get started today.",
        "authors": "['Nita Leland']",
        "infoLink": "http://books.google.com/books?id=-qpPEAAAQBAJ&dq=CREATIVE+COLLAGE+TECHNIQUES.&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "There is not much about collage that is not contained in this book. The authors begin with a short history of collage and how to make or find materials to make your own. Later in the book, they even explain how to make your own paper for collage and making collage &quot;supports&quot; or backgrounds using mediums, papers, and natural or found materials.In an early part of the book, the authors delve into the collage process and give the reader eight projects (of varying difficulty)to try on their own. The directions and illustrations are VERY complete.The next section deals with collage design, both planning and creating, along with nine projects that are, once again, carefully explained.The section on mixed-media collage was very good but more for a person who has both artistic AND design ability. NOT ME!!!Even though many of these projects were beyond my limited capability, I still enjoyed reading about them and looking at the beautiful illustrations. I got lots of ideas from this lovely book.",
                "review/helpfulness": "113/115",
                "num_reviews": 115
            },
            {
                "review/text": "Absolutely the only book you'll ever need to start creating collages. Filled with a wide variety of techniques from the very simple to the very sophisticated it teaches you everything from how to get started to how to frame your finished piece. An invaluable reference book in any art library.",
                "review/helpfulness": "55/57",
                "num_reviews": 57
            },
            {
                "review/text": "I orginally found this book at the library and had to have it. I am not a beginner artist but it would be excellent for any beginner. It dicusses design, materials, and concepts. It would be great for teachers as the projects can be easy or advanced depending on the instructor. For the more experianced artist it offers inspiration and nuggets of information. Full color pictures too!",
                "review/helpfulness": "54/54",
                "num_reviews": 54
            },
            {
                "review/text": "Thoroughly enjoyed this easy-to-understand book. I liked the projects, and especially the making your own specialty paper out of tissue. Good examples of collages, and idea-starters. Used many of the techniques successfully the first time.",
                "review/helpfulness": "35/39",
                "num_reviews": 39
            },
            {
                "review/text": "*****I have been reading collage books in order to get ready for a collage class I'm taking next month; while all the ones I've read have their strong points, this book is truly the \"Bible\" of collage---it contains the widest and most in-depth information of all of the books I've read. It covers so many topics, and for a beginner, enables me to see just what can be done with collage. As I become more experienced, though, I am certain that I will refer to it again and again.Ever type of collage conceivable to me is covered here, with step by step instruction. It is written in an instructional (as opposed to entertaining) style, and is definitely a reference book, but one that I think every collage artist should have.If you are wanting to learn more about collage and can only afford one book, this one is it. It covers many different styles, so unlike other books, if your style is not the same as the author's, you might be left out---no chance of that with this book.Highly recommended.*****",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "I don\"t ususally critique books, but I think that \"Creative Collage Techniques\" is a book that contains the essentials of collage making and much more. It would present a challenge for beginners, but has so much information, wonderful graphics and diverse projects that it will provide a reference for the experienced collage artist as well. I especially enjoy the artist's use of \"theme collages\", from magazine clippings, photographs, printed words, which can incorporate the readers own unique style in multi-media using watercolors, oil paints, or whatever one wishes. The artist also shows the reader how to create crystalline papers,(not difficult), make a collage mosaic, use torn papers, rice paper overlays, and marbling paper. In other words, it motivates the reader to CREATE. I have only skimmed the surface of this book's contents, there is so much more! I continuously use it as a reference. If you are in a creative \"low\", buy this book, it will inspire you!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I have dabbled with collage and assemblage and want to do more. What I mainly want is info on supplies and technique, rather than an overview of what other artists are doing in the field, or a history of the art, or coaching to overcome fear of doing art. I took six collage and altered book books out of the library. This one worked best for me. The information about what supplies, adhesives, and papers/boards to use was well organized, clear and simple. Each technique was presented in a straightforward, step by step way accompanied by examples. This book had more techniques in it that seemed like ones I would want to work with than some of the other books - I'm not at a stage where I want to build a complicated studio setup or use photocopiers and photography a whole lot in my artwork, but I appreciate knowing about techniques that are a little more advanced than gluing paper down.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is the Collage Bible! It covers everything from surfaces to (a complete index of) adhesive mediums, paints, inks, papers, color, composition etc.This is a library must have for the beginner and the practicing artist. It really is a type of encyclopedia, and genuine \"HOW TO\" guide. Not sure which paints to use: acrylic v. watercolor v. oils? This book covers the full range of collage possibilities with clear and very detailed instructions on the \"how.\" Where to begin? At the beginning. The photos are excellent: both gallery and instructional.Buy this first and keep it. This is a wonderful foundation to build from.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I had been making collages for eight or nine years when I stumbled on this book in a secondhand book store. Paging through it, I was amazed and fascinated by its clear, practical, thoroughgoing presentation of contemporary collage fundamentals, illustrated by clear and appropriate photos which complemented and enriched the text. As noted elsewhere, the book showcases the work of a number of different artists, with each finished collage illustrating the particular technique or materials being discussed. It also features numerous photos of the steps involved in specific types of collage. As promised on the cover, the book is \"a step-by-step guide including 52 demonstrations and the work of over 60 artists.\"This book gets the reader started almost immediately on several highly doable beginning-level projects: initiating a \"treasure hunt\" for materials you are likely to have around your house or apartment, making rubbings from readily available textured materials, using simple colored shapes to produce \"your own Matisse.\" Its tone is lively and encouraging: \"Collage can be as simple or as complicated as you like. Anyone can do it. Take this fascinating medium as far as you want to go with it. Reach for the stars from the top of the Ferris wheel! It won't cost much if you start with simple, discarded materials. Don't think about making art...play for a while.\"Even while nudging the reader into hands-on collage-making, authors Nita Leland and Virginia Lee Williams manage to slip in a succinct and informative history of collage. On page 2, they also provide a handy boxed summary of major collage terms, with the phonetic pronunciation of each term in parentheses. I loved this feature because, for all the time I had been actively and enjoyably making all kinds of collages, I had no idea I was engaged in \"bricolage\" \"froissage,\" or even \"frottage\"-- and I had just begun to branch out into mixed-media assemblage, but without knowing I was grossly mispronouncing the word \"assemblage\"!Besides my failure to sign up for French 101 when I had the chance, I failed to consider going to art school during my prime-time years. So in the area of collage and the \"paper arts\" in general, I suppose I could describe myself as self-taught -- meaning I bumbled around with my papers and paints for some time, quizzing art store employees about basic supplies, producing a series of disastrous messes interspersed by a few really gratifying creations, devouring every vaguely relevant book or magazine I could find. I now think I might have gotten a better grip on the fundamentals from the outset, and maybe made faster and steadier progress, if only I had known about this book.*Creative Collage Techniques* may technically be classifiable as a textbook -- and both authors, besides being working artists themselves, are clearly experienced workshop instructors -- but please don't interpret this to mean that the book is in any way dry, \"academic,\" or overly theoretical. From start to finish, it is great fun. It keeps on grabbing your interest with new ideas and techniques that build on the basics the authors have already taught you while communicating their personal enthusiasm and joy in creating. I went back to some of the things I was already doing myself and tried \"doing it their way\" instead, since they offered so many helpful new tips I had not found elsewhere. These covered essentials (protecting non-archival papers) as well as electives (speeding up drying time by hanging two hair dryers above your work table). I also picked up some new information about working with acrylic paints and mediums, which is covered in some detail. Refreshingly, however -- unlike the growing number of acrylics books with barely concealed corporate sponsorship -- Leland and Williams do NOT use this as an opportunity to promote a particular line or to urge purchase of specialized and costly products such as specific unusual hues or \"gourmet\" gel mediums (e.g., self-leveling, resinous and stringy, pumice-containing). Under \"Acknowledgments,\" they thank personnel at multiple companies, including Liquitex, Golden, and Dr. Ph. Martin.No other collage resource, to my knowledge, covers such a wide range of topics in such clear and complete detail -- everything from principles of color selection and design to multiple ways of creating customized collage papers. Regarding the many collages presented as examples, I personally did not find these all that intimidating -- possibly because I had already perused so much other intimidating art in other books! In this regard, the book that comes most readily to mind is *Collage Sourcebook: Exploring the Art and Techniques of Collage*, which to me is a portable paperback gallery of gorgeous and often wildly unattainable creations, some of which took months if not years to complete. Realistically, I am just not going to be whipping up complex fabric collages incorporating vintage materials and lots of fancy machine-stitching any time soon; nor am I likely to invest in a printing press for a little avocational collography. I am much more likely to try the majority of the many interesting and far more accessible methods presented in *Creative Collage Techniques*. (Some of the collages in the Leland and Williams book do show a high level of drawing ability which not all of us have yet attained -- but one of the big pluses of collage, for many of us, is that skill and experience in representational drawing are purely optional.)Admittedly -- though this is not a deficit at all from my perspective -- the Leland and Williams book is light on some of the trendiest current topics: complex (and sometimes costly) methods of image transfer, advanced manipulation of photographs using $300 professional software, etc. Information on such topics is readily available elsewhere. Also look elsewhere for the particulars of scrapbooking, book arts and altered-book \"journaling,\" or any method that relies heavily on what Gwen Diehn calls highly determined materials: other artists' prefab rubber stamp images, manufactured stickers or stencils, fancy die-cutting machines, and the like. In the spirit of the most timeless and classic principles of making purely original art, these authors describe a large variety of strictly DIY methods for creative transformation of the most basic generic materials -- everything from distressing collage supports to embedding your own leaves and grasses in your own rice paper. When they do suggest a slightly more exotic material, they always describe just what it is and provide the name of a source.The one project I found a tiny bit far-out -- albeit very attractive and intriguing -- involved \"peeled paper.\" I wish the authors had suggested one or two alternatives to the kind of paper they advocate using for the technique, which they describe as \"300 lb. rough Indian handmade paper.\" But this is really the most minuscule of gripes, as well as being my sole criticism of an otherwise wonderful book.In all the ways that matter most, *Creative Collage Techniques* is the most practical and purely delightful guide to collage I have ever encountered anywhere. It offers endless learning and something for everyone, from the tentative beginner to the seasoned pro. Assuming you love making collages or would love to start, please do yourself a tremendous favor and get your hands on a copy of this book. If you are like me, you will soon be wondering what you ever did without it.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book was actually a text book for a college class. As a not very artistic person, I found some of the projects to be a bit intimidating. However, the explanations were very helpful. The pictures are beautiful. I found the descriptions of the elements of design very helpful.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "the lamp shade book 80 traditional innovative projects to create exciting lighting effects",
        "description": "Bring the distinction of a stylish, finely crafted lamp into your home or office. The more than 80 lampshades featured here will inspire you to experiment. Whether you want to create from scratch or transform an old favorite into something new and beautiful, here is all the information you need. Start with assessing your dcor, then follow the tips for selecting materials, construction techniques, and finishing touches. If you want to carry through a specific room design, make custom fabric shades for a unified motif. If you want to create special nighttime moods through lighting, try designs with interior shapes that are invisible during the day. Today's top interior accessory designers are showcased in a comprehensive four-color gallery, while 15 projects show you how to adapt the basics in imaginative ways. Choose from exotic origami shades, elegant Victorian styles, painted silk, raffia, crochet, and painted-glass lampshades; paper mch and stained-glass wall lights; mosaic bases; and dozens of other fabulous styles. 128 pages (all in color), 8 1/2 x 10.",
        "authors": "['Dawn Cusick']",
        "infoLink": "http://books.google.com/books?id=Yj0KAAAACAAJ&dq=The+Lamp+Shade+Book:+80+Traditional&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought this book hoping to find inspiration and instructions on how to create a lampshade, but now I'm returnitg it. There is no instructions what so ever and most of the designs I found to be not useful if you want to decorate your house simple but tastefull. I was very dissapointed!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm returning this book. The book doesn't contain any instructions not even for basic fabric or paper lampshade. At first I thought that maybe I can get a good design idea for a lampshade I want to make, but there is no good ideas in the book if you are like me looking for simle or classic look. I don't see any reasons for me to keep this book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "laminated designs in wood techniques patterns projects",
        "description": "Discusses procedures, tools, and techniques for working with laminated wood, including a variety of designs",
        "authors": "['Clarence Rannefeld']",
        "infoLink": "http://books.google.com/books?id=M0wOAAAACAAJ&dq=Laminated+Designs+in+Wood:+Techniques,+Patterns,+Projects&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book gives information about a beautiful form of woodworking, complete with many colorful pictures and explanations of how to do it yourself. Mr. Rannefeld has developed wood laminating into an art form and his work is inspiring. He shows hundreds of different cutting patterns, gives details on building his special jig for the table saw, and includes some projects that anyone would be proud to make and own. Note that this is not a beginner's woodworking book. The technique and the projects require some skill. However, once you master it, the variety of objects this technique can be applied to is endless. Turned bowls, trays, tables, clocks, and more. All can be enhanced and beautified with this method. This is not simple surface lamination, but rather it goes throughout the wood. So once it has been created, the wood can be cut and shaped and the laminated design remains intact. An exellent book for a woodworker with the desire and dedication to create not just woodworking projects, but woodworking art.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book should have been entitled, \"Advanced Laminated Designs in Wood.\" This is no easy book, but that is not the fault of the author- the subject matter itself is difficult. However, the author spared no effort to convey this method of woodworking, and if the reader is willing to take the time needed to grasp it, he/she will reap considerable rewards. I love the book, and I highly recommend it.All the methodology is clearly layed out, with numerous pictures and illustrations of how to create these designs. The designs themselves are beautiful and so variable, you could make them for years without ever repeating the same pattern.I should note that this method results in considerable amounts of wood turned into dust and scrap. You will also have to construct an elaborate (though very useful) cutting sled for your table saw. And at times the book reads like a college text, although the author is a very capable writer.That being said, I still highly recommend the book to serious artists and woodworkers who use inlay, intarsia, marquetry, or do segmented turning.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is so complete with jigs that are necessary to do the exact cutting required for good results that some woodworkers may not appreciate it. It has all the formulae to calculate the amount of lumber required for a project. If the woodworker has the patience to read this book and follow the design instruction, then experiment with different widths and numbers of the laminates, the possibilities are unending. Clarence Rannefeld, the author, has tried to introduce us to a whole new field in woodworking. Use your scientific calculator for the formulae, then cut and glue, and cut and glue some more and beauty will jump out at you. Above all, be patient. This type of woodworking is an art. Intarsia enthusiasts will love it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree with the first reviewer in most respects. The book is an awesome resource on how to make solid laminates. However, it could be greatly improved if the author would give more details on how to make the jig. There are good pictures and sketchy details but no measurements or helpful details. This book is definitely for the experienced woodworker. A little experience is good, but expect to struggle. Of course, that's what some of us like about woodworking -- the struggle, then the beautiful finished product when we're done.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "simple painted furniture",
        "description": "Decorative paint is the perfect way to give new life to old furniture, and 200 full-color and two-color illustrations can teach the reader everything from graining to trompe l'oeil. It is the ideal introduction to a versatile decorating technique.",
        "authors": "['Annie Sloan']",
        "infoLink": "http://books.google.nl/books?id=E5SCAAAACAAJ&dq=Simple+Painted+Furniture&hl=&source=gbs_api",
        "categories": "['Furniture painting']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Excellant photography. Simple instuctions and good tips. Addresses most paint and design techniques needed. Gives good ideas to create painted furniture with a personal touch. Well done.",
                "review/helpfulness": "33/40",
                "num_reviews": 40
            },
            {
                "review/text": "Annie Sloan is well known for her chalk paint which requires no prep work. This book is from 1989 and deals with the stripping and scraping and sanding preparation for painting furniture. Way fussier than chalk paint. Nice but dated techniques, like sponge painting.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the threads crafts book of ribbon embroidery and stumpwork threads crafts",
        "description": "\"After several months living out in the world with her birth family, Ariana Brenneman is back living in the Old Amish community that she grew up in. The shock of discovering she and Skylar Nash were switched at birth has not worn off but both young women are regaining their footing and trying to determine what lies ahead--the Amish life or an Englischer one?\"--",
        "authors": "['Cindy Woodsmall']",
        "infoLink": "http://books.google.com/books?id=tuAsDwAAQBAJ&dq=The+Threads&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Not your traditional stumpwork book and not for the beginner. It is a wonderful combination of two of my favourite forms. The cover details the entire book. It's one project - which can be ordered seperately as a kit from South Africa or use the diagrams contained in the back of the book. There are great instructions and different methods on how to reproduce the picture and transfer it to fabric. The photos and colours are very clear and they even give you photos of the threads used so you can match them to colours you can get although I understand that her hand painted threads and ribbons are marketed worldwide.The techniques detailed are different from ones I have been taught before and so it offers a new aspect to learning stumpwork. I just love the marriage of these two forms in this book. I would definitely recommend this for someone who wants a challenging new project that will take them a while!",
                "review/helpfulness": "37/39",
                "num_reviews": 39
            },
            {
                "review/text": "I am a beginner at stumpwork and fancy stitches but not at ribbon embroidery or ribbon flowers. I wanted a book with more than just ribbon embroidery so I bought this one. To my disappointment, the instructions consist of pictures of different stitches with no explanations. And then later in the book some basic instructions on how to do those stitches in little projects. So ok, I'm supposed to look at the pictures in the beginning of the book and figure out how to do those stitches without any written instructions (some are very easy, but several of the hard ones left me stumped and very frustrated.) And if I only have pictures to work with then how about enough pictures so I can see which step comes first! How about some lessons in technique! So then after the stitches part now you do the projects except well those are hard to figure out too because of the bare minimum instructions given or none at all. Like where it says: Covering a bead with thread. Yep that's it just look at the picture and figure it out. Ok so what's the technique? Do I wrap the string around and around through the hole until the bead is completely covered? Or through the hole and then diagonal? And how is it finished off when you've covered the bead? And how is it attached to your project? What is the best technique? Well I still don't know because there are no instructions. That's just a small example of how annoying this book is. So if I want to do a lot of the things in this book then I'll need to buy another book to explain how to figure out this book. So It's not for beginners because it's too confusing but I know it's also not for experts because this stuff is too basic. Yes well needless to say this book is going back to where it came from. I need an aspirin for this seventeen dollar headache...",
                "review/helpfulness": "18/28",
                "num_reviews": 28
            },
            {
                "review/text": "This book has plenty of full colour photos (and some coloured drawings) of surface embroidery stitching for floral sprays and designs.There is a up-to-date introductory section on methods and available materials: colour transfer techniques, fabrics, ribbons, threads, needles,etc. This is followed by a pictoral section on stitch glossary (for ribbon embroidery stitches) and a more detailed section on stumpwork stitching techniques, with text explanation and close-up photos.The main content of the book presents the stitching of the 12 panels of floral design by the author (shown partly on the book cover), and depicted in both water colour painting and black & white line drawing at the end of the book. For each of the panel, the recommended material list (including colour scheme) and stitching techniques are given, illustrated side by side with close-up photos.Overall, this is a neat stitchery book, and a feast to the eye for those reading the book for floral design and stitching ideas.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "This book was \"hot\" on the silk ribbon embroidery list I subscribe to. Individual directions, with explicit color pictures, give instructions for each design. These designs can be used exactly as the author has pictured them or for more experienced stitchers, incorporated into one's own design. Beautiful book for beginner or experienced ribbon embroiderer.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is a good resource for the beginner in silk ribbon embroidery. There is not much of value for the experienced stitcher. And there is very little stumpwork. I think it is misleading to give stumpwork equal weight in the title.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book is a wonderful guide for the beginner such as myself to ribbon embroidery and stumpwork. Along with lovely ideas for ribbon embroidery, it taught me the stumpwork basics such as making wired stems, that are raised and attached to the design, and it shows how to make stumpwork leaves and petals, such as Fuchsia leaves and the Pansy petals. Little insect wings like the butterfly and dragonfly have detached wired wings that are made separately and then stitched to the design. Other stumpwork techniques are shown, such as how to work over beads, and how to make padded shapes (the little basket for the orange tree for instance). The stumpwork slips for the hydrangeas are super for forming round, raised flowers. This book teaches one how to combine easy stumpwork techniques with beautiful ribbon embroidered flowers and I recommend it for the beginner to both ribbon embroidery and stumpwork.It has been quite some time since I was last so inspired by a book of this nature.I loved every page!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "After spending time in Cape Town, and visiting the Crafters' Market at the V&A; Waterfront, where this talented artist has a storefront, I could not believe the absolutely beautiful pieces of \"art work\", that one could create using ribbon embroidery and stumpwork! Upon my arrival back home, I obtained a copy of this wonderful book, and began my \"adventure\" into the world of ribbon embroidery! As a beginnner embroiderer, I was doubtful of my ability to produce such \"masterpieces\", but after sitting down with Ms. Van Niekerk's book, my worries were cast aside! Not only has this talented artist provided a wonderful pictorial \"Stitch Glossary\" for the crafter, but she has also given the reader very clear and exact instructions to create these beautiful stitches!!After reading some of the reviews left by other readers, I have to admit to being \"puzzled\" by the review left by \"Anonymous\". Apparently this reader did not go further than the \"Stitch Gossary\", and must have missed the explanations of \"how-to\" create the stitches, because I had absolutely no problem following the written instructions provided by Ms. Van Niekerk for the completion of the various stitches.In conclusion, RUN, DON'T WALK, to purchase your own copy of \"Ribbon Embroidery and Stumpwork\"! You will not be disappointed, and you will be creating your own visual masterpiece!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "In addition to beautiful color illustrations, the instructions were comprehensive and easy to follow.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "If I could have only one book in my library on embroidery, this would be it.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Many of the previous reviews complained that you needed to buy the kit from South Africa, in order to perform the work. Or that there wasn't enough detail and how to.I have never done this kind of work before and I found it easy as pie! And fun!The biggest point that might need to be stressed are that the image, which you transfer on to your cloth, needs a transfer. Simply buy transfer sheets (like you would for a T-shirt), then use the \"mirror\" image on your copy machine; poof! It's ready to go on your cloth and when you iron it on, the words will be facing the right direction instead of accidently inverted.But talk about opening up a wide, wide world of three dimensional work 3-D. We always think people from the previous centuries just weren't as smart as us, but they were AMAZING to come up with something that is so much fun!Try it once and enjoy it for years!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "fabric art journals making sewing and embellishing journals from cloth and fibers quarry book",
        "description": "This is the first comprehensive book that offers complete step-by-step instruction and patterns for creating unique book structures from cloth. Fabric Art Journals offers vital information on getting started, from choosing fabrics and creating patterns through basic sewing techniques. After learning how to make various styles of fabric books, readers will learn embellishment techniques that include painting, writing, decorative stitching, machine and hand embroidery, print and transfer techniques, and quilting techniques. An inspirational gallery is also included, providing a brilliant collection of artists' work in this medium. This book not only teaches, but also inspires. It is a must-have for anyone interested in book making and fabric art. It is packed with colourful photography and step-by-step illustrations.",
        "authors": "['Pam Sussman']",
        "infoLink": "http://books.google.com/books?id=l20aAAAACAAJ&dq=Fabric+Art+Journals:+Making,+Sewing,+and+Embellishing+Journals+from+Cloth+and+Fibers+(Quarry+Book)&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book has instructions for actually constructing books from fabric, which is exactly what I wanted. I have made quilts and altered books, but have not done any book construction. This book has the detailed instructions and plenty of inspiration for making personalized fabric art! I ordered the book from Amazon, got it in two days, and the next day had made a basic little fabric book ready for embellishment!!! Easy enough for a beginner, or a great start for someone familar with fabric! This craft is one that is destined to be customized according to the skills and views of the artist!",
                "review/helpfulness": "64/64",
                "num_reviews": 64
            },
            {
                "review/text": "This is a beautiful book covering a wide range of topics, including various ways to bind fabric books. The photographs are clear and appealing (but the book offers much more than just \"eye candy\"). The extensive diagrams and patterns for the binding techniques described make this book well worth the price. The sections discussing the differences between paper and fabric books are quite useful. This is a top notch book if you're interested in making books and journals from fabric. Highly recommended!",
                "review/helpfulness": "60/62",
                "num_reviews": 62
            },
            {
                "review/text": "I have ordered and read tons of books from both Amazon and my local library and I've never been inclined to write a review on any of them before this one. This book is terrific - the photographs are clear & sharp and the detailed stepped out instructions are easy to follow and understand and give the artist plenty of \"jumping off\" room. Pam had a nice easy writing style and the book offers a lot of visual eye candy with tons of color and inspiration to be found. Buy this book, you won't be dissapointed.",
                "review/helpfulness": "42/43",
                "num_reviews": 43
            },
            {
                "review/text": "I read this book cover-to-cover and was so enthralled by the illustrations and color photos of finished products that I had to start over again and try to focus on one project at a time. The How-Tos are presented in enough detail to help beginners through a myriad of strange and wonderful terms and tricks.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is an exceptionally well written and designed book. I'm impressed with the detailed instructions and accompanying illustrations, the photographs, and the layout. The author even anticipates questions that could come up for the reader/crafter during fabric book construction. I really appreciate this helpful style of writing. The fantastic photographs make it possible to see exactly what is being described. Even the order in which the chapters and sections are presented is well thought out.This is destined to be one of my most treasured AND used books! In fact, I was inspired to get started as soon as I opened the book for the first time and saw the writer's/artist's work!",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I almost didn't purchase this book because I have several others on fabric books. Boy, would I have missed out! This books not only has beautiful photography but the examples are unique and the instructions flawless. One of my favorite sections is CHAPTER FOUR: THE GALLERY which shows so many examples of fabric books created by other artists for inspiration. In fact, I was so inspired that I couldn't wait to make a book for a dear friend's birthday using a combination of several different designs. This is not one of those books that you read and then put away. It stays on my studio table and I am already starting my next book. My fabric art library is pretty extensive but this book is by far the best when it comes to creating and embellishing fabric journals and books. I love it!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I borrowed this book from our library, and renewed it as many times as they would let me! I wanted to make everything in the book, but ran out of time, so I had to get my own copy. The photos of each project just beg you to make them, and the instructions are very detailed.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the art of silk ribbon embroidery",
        "description": "Well organized and filled with provocative examples, this lavishly illustrated guide explores silk ribbon embroidery, an element of crazy quilting, offering detailed explanations of 42 different stitches. 70 photos. 70 illustrations.",
        "authors": "['Judith Baker Montano']",
        "infoLink": "http://books.google.nl/books?id=AuDENwAACAAJ&dq=The+Art+of+Silk+Ribbon+Embroidery&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Surely the best book on Silk Ribbon Embroidery available. The materials needed, each embroidery knot shown with a line drawing, projects galore, including brooches, ring bearers pillow, heart picture frame, heart pendents,beautiful sewing cases bedecked with silken roses, and more. Judith visits with well known silk ribbon embroiderers in New Zealand, Australia and South Africa, each tells their design secrets.A wonderful section on the Australian photo transfer process for putting your favorite photos on fabric so you can embroider a garden around them",
                "review/helpfulness": "57/58",
                "num_reviews": 58
            },
            {
                "review/text": "I loved this book because it included ideas on how to use silk embroidery in a modern way rather the victorian way. The works &quot;Zane Gray Trail&quot; and &quot;The Desert Garden&quot; are not in that fussy Victorian tradition.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I really like this book, it does what the author says she is intending to do, which is give ideas for her projects or your own. If you are looking for extensive stitches in regular embroidery, this is not the book but if you are looking for silk ribbon stitches she gives the basics and a few more. The pictures help stimulate ideas and although she has a different style than I do with the other women in the book who have their own styles, you're almost sure to identify with at least one of them. Lovely silk ribbon work and some good ideas.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I loved this book because it included ideas on how to use silk embroidery in a modern way rather the victorian way. The works &quot;Zane Gray Trail&quot; and &quot;The Desert Garden&quot; are not in that fussy Victorian tradition.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is not only exceptional in explaining the technique,it also contains beautiful color pictures of finished projects. Each stitch description is accompanied by a very clear, close up picture of the stitch.A valuable addition to the library of both the beginner or the moreexperienced artist. This book is definitely a great value and a must havefor all ribbon embroidery enthusiasts!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the best of wood boxes",
        "description": "This craftsman's companion celebrates the woodturners, furniture artists, and elite craftsmen from around the world who have taken box-making to a higher level of aesthetic form. Little Book of Wooden Boxes features 31 of today's finest woodworkers and artisans--such as Michael Hosaluk, Steven Kennard, Richard Raffin, Jacques Vesery, Bonnie Klein, and Hans Weissflog--who share their amazing techniques, their inventive talents, and the inspiration that fuels their distinctive designs. Each artist's profile includes full-color, studio-quality photographs of their most spectacular work, including jewelry boxes, desk boxes, reliquaries, keepsake boxes and more, along with insights on their design ideas and objectives. Curated by nationally known historian and author Oscar P. Fitzgerald, this attractive hardcover book makes a wonderful gift for any woodworker.",
        "authors": "['Oscar P. Fitzgerald', 'Peter Korn']",
        "infoLink": "http://books.google.com/books?id=l7FouQEACAAJ&dq=The+Best+of+Wood+Boxes&hl=&source=gbs_api",
        "categories": "['Wooden boxes']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The book presents attractive photographs of a number of boxes that will stimulate aspiring beginning and intermediate box builders.Though offered to suggest &quot;how to&quot; construction guidance, especially with plans, the book has only the most meager detail of construction and nothing that can truly be called plans. The introduction warns readers that the boxes presented ought not be copied and if they are legal action is a possibility. The result is a book more bent on preventing copies of the displayed boxes than providing useful information for the box building reader.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "The other reviewer is correct. Certainly the title promises plans for these boxes. The plans are just one drawing of the box with a list of materials. So if you want to make these boxes, you'll have to do some figuring out. However, if you want to be inspired, check out this book. Even non-woodworkers will page through this book and find the boxes shown to be beautiful and neat. Boxes as objets d'art... who knew?",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I bought this book thinking that it contain info on tips &amp; techniques, as well as detailed plans; I was wrong.The 127 pages are filled with color photos of interesting boxes, but not much else. There is a materials list for each piece, but no plans or instructions beyond a stylized isometric sketch.If you are looking for a book on boxes to decorate your coffee table, this is the one. If you are looking for a practicle guide to box construction, look elsewhere.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the art of mehndi",
        "description": "A beautifully illustrated exploration of the history and symbolism of the ancient Indian art of henna design discusses how this form of body painting has recently become fashionable, giving step-by-step instructions on making and using henna paste. 20,000 first printing.",
        "authors": "['Sumita Batra', 'Liz Wilde']",
        "infoLink": "http://books.google.com/books?id=XY4XAQAAMAAJ&dq=The+Art+of+Mehndi&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Pros: This book is beautifully constructed and will impress anyone interested in mehndi, especially those looking for images of famous current personas who currently adorn the work of prolific artists like Batra. Furthermore, Ms. Batra gives detailed step-by-step instructions in drawing a variety of different mehndi designs - you don't find this step by step stuff in too many books.Cons: While this books works well on the coffee table and for the ineperienced artist who wants to learn how to draw henna and understand the technique of application, it doesn't give you too many historical details about henna or insight into the symbolism. The book falls into the trap of being too modern, too sugar-coated, and too Hollywood-oriented -- beautiful stars sport henna in all of its pictures, as if the author wants you to notice the people than the art they are wearing.Despite these shortcomings, this book has a distinct purpose to cater to people interested in mehndi in its popular form, and it succeeds quite well. As I mentioned before, the pictures and the construction are both beautiful. Also, Sumitra's designs gave me ideas for my own.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "I have purchased nearly every book in English on the subject of mehndi and found this book to be the best for &quot;showing&quot; actual mehndi which anyone can produce given a little effort. The Art of Mehndi is very short on history. It makes a transition into the &quot;modern&quot; infatuation with it and bindis and other Indian cultural signafiers. Though the text may be limited at times and information just as limited, it does present incredible pictures of mehndi on numerous models and numerous styles. The best book for seeing actual designs on people and not flat 2-D designs. Well worth the money compared to other mehndi books on the market. If you want history in depth grab a copy of &quot;Mehndi : The Timeless Art of Henna Painting&quot; by Loretta Roome it contains all the indepth history of mehndi and a good chapter on symbolism.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "Oh, yeah! Don't let too many of your friends look at this book or it might mysteriously dissappear! For those wanting henna designs for personal use or business, this book is ALWAYS the one people are drawn to. If you take it with you on too many henna appointments, it WILL get worn out. The photos are fabulous, and the designs are neat and clean. Not to say that they are all simple, NO! There are some really frilly Indian hardcore designs, that if you are a beginner, will look like an impossibility. BUT, the methods and techniques described in this book give anyone a clear knowledge of the application of henna, it's only the practice you need to do the really crazy designs! Many celebrity and model photos, as well as some great ideas for using mehndi designs with body paint for more instant gratification.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is the best book on the art of mehndi I have found. It is packed with color photo examples including many of stars such as Madonna &amp; Gwen Stefani. The featured designs are both beautiful &amp; unique.The author starts out with a brief history including the wedding customs &amp; symbolism of the designs in India, North Africa, the Middle East, &amp; Asia. She also covers the trend as it has developed in the western world.Next there are clear step-by-step instructions for preparing your skin, wrapping the cone, making the paste, &amp; applying the henna. Even using stencils, applying transfers &amp; painting freehand are expertly explained.Numerous design illustrations follow including tips, tricks &amp; techniques for decorating all parts of the body. I especially liked the floral necklace with bindis &amp; vine belt designs. A resource list for both the US and UK is a nice bonus.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book is full of beautiful designs and step-by-step instructions. Whether it's your first encounter with the art of mehndi, or you're a pro in the field, this book will inspire you to make your own designs. It also explains all the traditions and concepts behind mehndis, and has VERY good instuctions on using and creating henna.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Ms. Batra knows what she's talking about. I tried her Mehndi recipe and it has worked the best. The mehndi turns out to be a nice rich red colour. Very traditional of Indian Mehndi. Her designs and patterns are amazing. A lot of thought went into this book. I strongly recommend it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a great book. There are plenty of illustrations to copy or practice with. She mentions celebrities that have had mehndi, and provides pictures of them. The recipes are good. We use the &quot;quickie&quot; recipe, and my tattoos come out rich and dark. Give it a try if you want to add to your design collection. (My book has a different cover.)",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I was literally blown away with the fabulouos artwork, designs, and presentation of Sumita's talent in this book. She takes traditional Indian/Arabic designs, and &quot;modernizes&quot; them for the the western world. Great instructions and tips. Fabulous pictures...the art is amazing. I like the way she incorporates the elements of culture (bindi, traditional indian dress)...and she gives a wonderful overview of the different symbolic meanings of designs. This is definately my favorite book yet!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Excellent. A must own for every Mehndi Artist, beginner or Professional. I have been in the Beauty business for the past 18 years and my third year doing Mehndi. This is the book that I have been waiting for. It contains everything from recipes to traditions throughout the ages, even giving you lists of wholesellers in your area. If this does not explain it~Then you should just give it up! But with this guide, you will be in absolute Mehndi Heaven-PEACE. James D. Lamberth Jr. San Diego, CAJLamberthj@aol.com",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "silk ribbon embroidery bible the essential illustrated reference to designs and techniques",
        "description": "Gorgeous silk ribbon designs, from the simplest single rose to the sweetest spring posy, can be easily created with this unique new guide! This book features more than 100 ribbon designs using 50 different stitches. Designed with easy-to-follow, step-by-step instructions, as well as charts and embroidered samples, even novice embroiderers can easily create each beautiful design. A simple key explains the order of work, and each design offers plenty of ideas for how and where to apply it. The book also features a hidden spiral binding for easy-lay-flat use.",
        "authors": "['Joan Gordon']",
        "infoLink": "http://books.google.com/books?id=CQNVuQEACAAJ&dq=Silk+Ribbon+Embroidery+Bible:+The+Essential+Illustrated+Reference+to+Designs+and+Techniques&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I teach Silk Ribbon Embroidery classes. I found this book to be very helpful to my students. It has easy directions to follow on colorful pages.There are many books out there, but this one is very good.",
                "review/helpfulness": "44/45",
                "num_reviews": 45
            },
            {
                "review/text": "It is a beautiful book , fotographs are very nice and clear . The explanations are very clear , also for beginners. The ring-binder is very handy when you are stitching. I would recommand this book to every one who likes ribbon embroidery.Jeanne",
                "review/helpfulness": "40/42",
                "num_reviews": 42
            },
            {
                "review/text": "Beginners as well as advanced embroiderers will find the Silk Ribbon Embroidery Bible outstanding: it covers all details needed to work with ribbon embellishments, from instructions on over sixty ribbon embroidery stitches and patterns for motifs to color illustrations of each completed project, pattern guides and order of work charts, fabric and thread details, and more. A 'must' for any who would work silk ribbon embroidery projects successfully.",
                "review/helpfulness": "38/38",
                "num_reviews": 38
            },
            {
                "review/text": "This is an essential reference for Victorian Crazy Quilters as well as silk ribbon embroidery enthusiasts. The instructions are clearly written with excellent illustrations of the results with different widths of silk ribbon. There are wonderful projects that can be done by anyone from the beginner to the experienced embroiderer. I recommend this book to all new members of my Quilting Bee.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "Great pictures, concise directions and suggestions. I have been using this book with every project.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I honestly think that if I could only keep 1 of my silk ribbon books it would be this one!It really is the \"Bible\"Great- Especially the layout.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "The most informative, understandable directions for a new or experienced silk ribbon art enthusiast. The book is just beautiful and when you create its projects they will be beautiful also.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is one of the best books ever for Ribbon Embroidery! I keep it on my coffee table so it's handy! Very detailed and simple explanations.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "A positively \"must have\" if you love silk embroidery. Shows stitches,and diagrams of \"how to\".",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "Anyone who works with ribbons has to have this book.I love mine.Everything you need to know...clear instructions on every page.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "tiffanystyle stained glass lampshades with fullsize templates for 11 designs dover stained glass instruction",
        "description": "Even beginners can create beautiful Tiffany-style stained glass lampshades with this easy-to-follow guide. Included are full-size templates on sturdy stock for 11 lampshade designs: poppy, magnolia, floral repeat, woodbine, dragonfly, wisteria, grape, landscape, and 3 more. Complete step-by-step instructions.",
        "authors": "['Connie Eaton']",
        "infoLink": "http://books.google.com/books?id=-HijNwAACAAJ&dq=Tiffany-Style+Stained+Glass+Lampshades:+With+Full-Size+Templates+for+11+Designs+(Dover+Stained+Glass+Instruction)&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "It is a good idea to have elaborate panel lamp patterns for the expert glass crafter. However, it is disappointing to see that the authors did not even bother to make the lamps themselves, or to at least give a pictorial representation of what the 3D project would look like once finished with proper perspective. I would not dare begin such elaborate projects without the certainty that the lamps would have a pleasing, harmonious shape.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Tiffany made some of the most complicated lamps ever produced, a lot of the design was created with his choice of the individual pieces of glass he used. I used these images for computer application, so the complexity was welcome. It would require the skill level of an experienced glass artist to reproduce Tiffany-like lamps; the representations of which are widely available on the Internet. I would suggest anyone considering making a lamp with actual glass, copy the tiny image (the line quality of the images is very good) and taping it together if it is necessary to have a visual image of the shape of the completed lamp.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "woodturning with ray allen a masters designs techniques for segmented bowls vessels",
        "description": "Move beyond basic woodturning with the creative approach to \"segmented\" woodturning, popularised by master woodturner, Ray Allen. Inside you will find more than just basic methods and tools, you will discover a whole new approach to turning wood.",
        "authors": "['Dale L. Nish', 'Ray Allen']",
        "infoLink": "http://books.google.com/books?id=go4zHAAACAAJ&dq=Woodturning+with+Ray+Allen:+A+Master%27s+Designs&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is arguably the best book on segmented turning that has been published. It far surpassed my expectations, even though I expected a lot. The book has three major parts: First comes a detailed, step-by-step guide with 95 color photographs that carefully walks the turner through the complete sequence needed to make one of Ray Allen's designs. This is certainly not for the novice turner, and a sound understanding of woodturning techniques and general woodworking skills would be necessary to follow this part. But for the intermediate to advanced turner wanting to try out segmented work, this book is the best introduction one could imagine. Even the experienced segmented turner will find a tip or two that will be of interest. The second part of the book is the gallery section, which is outstanding, and consists of no less than 55 pages with several full color photographs on each page. It features a large part of Ray Allen's work, and it is a wonderful source of inspiration. The gallery section alone would have been worth more than the price of the book to me. The last part of the book contains blueprints and assembly sequences for many of the vessels and patterns in the book. While this is not nearly as detailed as the first part, it is still an excellent resource, and will help the reader to come up with his or her own designs and ways to build them. All in all, a must have for segmented turners of all skill levels, as well as for anybody wishing to give segmented turning a try but wasn't quite sure how to start.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "If you are interested in segmented woodturning it is pretty hard to go past this book. It was written on behalf Ray Allen by long time friend Dale Nish, and it's a sad fact to learn that Ray didn't live to see his book published. Ray should feel very proud wherever he is for this work, a full colour book all the way through with clear diagrams and pictures to assist you with that segmented woodturning challenge.The first and second chapters are brief and consist of showing you Ray's commonly used tools and some explanations on segmented blueprints.The third chapter gets into the meat of the subject with 29 pages showing a step by step, blow by blow process for cutting, sanding, gluing, shaping, turning and finally finishing a segmented bowl. Loads of pictures on every page will give a great idea of how to approach each step.Chapter four has a beautiful gallery of over 50 full colour pages often with multiple bowls on each page that showcases Ray's art.The fifth chapter has 11 projects of segmented bowls for you to try along with complete cutting lists of every ring.And lastly the sixth chapter treats you to some of the more complex segmenting to achieve different patterns, such as bricks, spirals, flags and moreIf you are looking to try segmented woodturning and need a place to start for instruction AND inspiration then you can't go wrong with this book. Good on you, Ray, and I hope you are enjoying yourself on the big lathe up in the sky.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is very inspirational. Although Mr. Allen was very focused on Native American motifs, the help he gives transcends that and seems applicable to any segmented work. There are some helpful jig ideas, too. The gallery is stunning and the step-by-step help is thorough. If I have one disappointment it would be that there are few design ideas outside of the Native American motifs. But that does not diminish the book in any way. I'm glad I bought this book, though I would not consider it a stand-alone volume. It needs some help to more fully equip the novice turner (like me!). The perfect companion for that would be \"The Art of Segmented Wood Turning\" by Malcolm Tibbetts. I think both books are needed to get the fullest understanding.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I have scanned the book again and again. It is hard to leave an object for the next one, the art work is so perfect.It is an endless source of inspiration",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is worthwhile if you are learning about how to do segmented turning or if the designs interest you. The instructions are clear but brief and show one master's methods.The photos and designs are excellent making this not only a how-to book, but a nice photo book for the coffee table.Not quite as in depth as the Malcolm Tibbetts book on segmented turning.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "creative stamping with mixed media techniques",
        "description": "Take your rubber stamp art to a whole new level! Think you've explored all the possibilities of rubber stamping? Think again! Sherrill Kahn shows you how to create dazzling new effects that make your rubber stamp art more colorful, unique and full of pizzazz. Inside you'll discover 20 creative recipes that combine sponging, glazing and masking techniques with colorful stamped patterns. Try them out on the 12 step-by-step projects, including a fabric wall hanging, wooden tray, terra-cotta flowerpot, paper lantern, journals, boxes and more. You'll also learn how to make decorative beads out of shrink plastic and air-dry clay, add magical metallic highlights to any project, and stamp with foam plates, rubber bands and Rollagraphs. The creative possibilities are endless! By using colors that pop, layering techniques that add depth, and dynamic patterns that catch the eye, you'll make stamping more fun, more creative and full of wonderful surprises!",
        "authors": "['Sherrill Kahn']",
        "infoLink": "http://books.google.com/books?id=VIo1uQEACAAJ&dq=Creative+Stamping+with+Mixed+Media+Techniques&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Again, Sherrill has produced a book worth examining for wonderful pictures, and step-by-step techniques. My greatest concern is once again finding the trademarked material TYVEK utilized in craft work. The makers of TYVEK specifically have stated it is never to be heated or used other than for what it is specifically designed for. Deathly toxic, once more it is appalling to find it used with a 'heat outdoors' statement attached. Does the company know this material is being used this way??? As an art educator I must not only be aware of this safety info for myself but for my students. Poor editing let this one slip by.",
                "review/helpfulness": "75/86",
                "num_reviews": 86
            },
            {
                "review/text": "If you love rubber stamping and painting on fabric, you need just two books: this one and the author's first, Creating with Paint. I have both books and love them equally-and, more importantly--I USE them extensively in my own artwork.I have also taken two workshops with the author, Sherrill Kahn, and highly recommend them. Take a workshop with Sherrill if you can! She's a very encouraging, supportive and inspiring teacher, and all of these qualities come across in her two books.One of my favorite aspects of Creative Stamping is that Sherrill shows you in step-by-step photos how she layers dyes, paint and stamping techniques to arrive at her highly complex fabrics. It's easy once you see how she does it, and that's why Creative Stamping is a must-have for any fabric painters library.Lots of information, inspiration, and some great how-to projects make Creative Stamping well worth the investment.Check out Sherrill's web site: www.impressmenow.com.",
                "review/helpfulness": "34/36",
                "num_reviews": 36
            },
            {
                "review/text": "Creative Stamping with Mixed Media Techniques is another valuable resource and creative inspiration book from Sherrill Kahn. Both books by Ms. Kahn are full of outstanding photographs to inspired dozens of mixed media adventures. Her work is bold and colorful, and incorporates numerous mixed media techniques that are easily accessible to all readers. There are dozens of project ideas in the book that will satisfy crafters, and even more valuable are the demonstrations of painting and stamping techniques that readers can explore and adapt to their own artwork and projects.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            }
        ]
    },
    {
        "Title": "shibori the inventive art of japanese shaped resist dyeing tradition techniques innovation",
        "description": "Potential for creating designs in textiles can be seen even in the physical properties of cloth. The simple fact that cloth tightly compressed into wrinkles or folds resists the penetration of dye is an opportunity-an opportunity to let the pliancy of textiles speak in making designs and patterns. People around the world have recognized this opportunity, producing resist designs in textiles by shaping and then securing cloth in various ways before dyeing. Yet in no other country has the creative potential of this basic principle been understood and applied as it has in Japan. Here, in fact, it has been expanded into a whole family of traditional resist techniques, involving first shaping the cloth by plucking, pinching, twisting, stitching, folding, pleating, and wrapping it, and then securing the shapes thus made by binding, looping, knotting, clamping, and the like. This entire family of techniques is called shibori. Designs created with shibori processes all share a softness of outline and spontaneity of effect. Spontaneity is shibori's special magic, made possible by exploiting the beauty of the fortuitous things that happen when dye enters shaped cloth. Usually it is in response to the fact that a craft is being lost that the need for preserving and documenting it arises. The motivation behind this book is no exception, but the authors have gone far beyond simple documentation. Extensive research and experimentation have led to the revival here of shibori techniques that were once well known but have now been largely forgotten in Japan. In addition to more conventional techniques, the work of contemporary fiber artists in Japan and abroad in shibori textile art and wearable art is presented, to suggest the extent of the creative innovation possible. The 104 color and 298 black-and-white plates include a photographic Gallery of Shibori Examples, based on Japan's largest collection of traditional shibori fabrics. Included also are a detailed guide to basic natural dyes used in Japan, the making and care of an indigo vat, and a list of suppliers in North America, as well as a glossary and bibliography. Now available in paperback, this full documentation of one of the world's most inventive and exciting dyeing techniques continues as a classic in the textile field.",
        "authors": "['Yoshiko Iwamoto Wada', 'Mary Kellogg Rice', 'Jane Barton']",
        "infoLink": "http://books.google.com/books?id=x51NEAAAQBAJ&dq=Shibori:+The+Inventive+Art+of+Japanese+Shaped+Resist+Dyeing+:+Tradition+Techniques+Innovation&hl=&source=gbs_api",
        "categories": "['Design']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you have one book on Shibori, this should be the one (reviewers opinion)! Yoshiko Wada covers the scope of Shibori, its history, artists and techniques with expertise and beautiful photos. There are only a handful of books on traditional shibori in English. Here you will find an easy to read, well laid out format. Techniques are covered with clear, detailed instructions and diagrams. This is most helpful for beginners yet allows the advanced to become more proficient and precise. Complimenting the above are excellent color photos; close-ups of patterns (a vast selection), garments, ancient, traditional and contemporary artists and their works. Yoshiko's book takes the reader from the historical through creating a completed piece of art. Fact: This reviewer was introduced to this book in an art class. Five years later, now a shibori artist, I still use Yoshiko's book on an almost daily basis. The wealth of information she provides is invaluable as both guide and reference. Thank you Yoshiko and Amazon for offering this book.",
                "review/helpfulness": "113/113",
                "num_reviews": 113
            },
            {
                "review/text": "This book must be The Definitive volume on Shibori. It contains a wealth of information on the creation and development of the art, background information on the culture which nourished it, and biographical information on some of the principle artists responsible for its evolution. The illustrations are at least as impressive as the text. The book contains hundreds of photographs, both of completed garments and of swatches created through the use of the various techniques detailed in the book. The instructions for re-creating those patterns are clearly explained and easy to follow. Most remarkably, this book would serve equally well as a reference work or even a &quot;coffee-table&quot; book for those with an interest in textile art or art history, or as a manual for the textile artist. Although it is costly, the book represents an excellent value since it would take a lifetime (literally) to begin to exhaust the creative possiblities presented in it. It is a most worthwhile investment.",
                "review/helpfulness": "52/52",
                "num_reviews": 52
            },
            {
                "review/text": "This book is a thorough and exhaustive study of the art and techniques of shibori, the Japanese style of what is popularly known as tie dye. What this book will show you, however, goes far beyond the simple craft we associate with T shirts. In Japan techniques of stitching, tying, or clamping fabric produce designs of enormous complexity and beauty. The descriptions are detailed and accompanied by photographs and drawings that clearly show both the pattern and the technique used to achieve it. In addition color illustrations show completed pieces, both traditional and modern. Whether you want to try this craft or simply enjoy the art of beautiful textiles, this book is the one to get. It is unfortunate that it has never been published in a less expensive edition, but there is no other book on shibori that is even faintly equivalent.",
                "review/helpfulness": "42/42",
                "num_reviews": 42
            },
            {
                "review/text": "I love this book, it is a great inspiration! Each time I pick it up, I see something new and artistic in the techniques. The illustrations, photos, examples, and steps are wonderfully laid out. It is well worth the cost, as one can tell there was much passion put into completing the book. It is a favorite!",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "In the spring or early summer of 2003 the Surface Design Conference was held in Kansas City sponsored by the KC Art Institute. This conference is an association of mostly fiber or fabric artists that is held periodically for the membership. It was attended by artists from throughout the US and several overseas countries.Yoshiko Wada attended and spoke to the conferees. Special sessions were set aside for her to autograph the book, &quot;Shibori.&quot; The reception given by the artists attending is recommendation enough.I second the comments of the other reviewers about the quality of the writing and illustrations. Yoshiko Wada is a vibrant and astute advocate for fabric arts and shibori techniques. The text serves as a wookbook for designers, artists, teachers and collector/buyers.Among the dozens of exhibitions of fabric art throughout the city was one by Cara Boelts, a 2003 graduate of the KC Art Institute and chosen by the faculty as one of the students worthy to be featured during the Conference. She has developed an innovation in shibori dying that includes not only patina but burn out. Her exhibition of approximately a dozen wall hangings was visited by 100s of conferees and drew praise almost universally. The ultimate compliment, major Kansas City artists and many conferees bought half or more of the pieces exhibited.Yoshiko Wada found it to be a new technique in shibori and said she would include a description of it in any future editions of 'Shibori.'During the conference the book was sold at the KC Art Institute, but also at the Nelson-Atkins Museum of Art, whic has one of the world class collections of oriental art. 'Shibori' is still available in its bookstore/gift shop.An excellent book.Paul Williams, North Kansas City MO",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is an invaluable resource for any textile arts student. Or any shibori enthusiast. Detailed illustrations and exceptional photos help define and identify ancient techniques and MAY encourage elbow-deep participation among the adventurous. Gambatte!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I knew this was \"THE\" book to have for shibori technique instructions. However, the very pleasant surprise was all the history of shibori! It would be fascinating even if I wasn't intending to learn the technique. The instructions are very clearly presented. I have already tried a couple of the techniques with very good results and I'm only a beginner!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Being a member of the Seattle Weavers' Guild, I've been lucky enough to have friends teach Shibori and other resist dyeing in our group. This book is terrific and details the 'how to' very well. I'm very pleased to have this book in my library and I have to say the price was excellent.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Shibori is a wonderful craft and this book gives an excellent history of it. Many wonderful historical and contemporary examples are shown. Techniques are given as well, and are for the most part usable. If you do shibori work, this book is essential for your library.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book covers a wide variety of ways in which cloth can be bound - stitching, clamping and tying - and explains regional variations appearing in the result.Note that this is NOT primarily a dyeing book. In just a few pages, it explains techniques using natural dyes that would require a separate text to do justice. Also, because traditional Japanese kimono fabrics are very narrow, the results I've achieved in the short space of time since getting the book reflect the difference in using 40+\" wide fabrics.Great photographs in both black and white and not enough in color are a good source of inspiration; there's enough material in this book to keep me busy experimenting for years.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "offtheshelf fabric painting 30 simple recipes for gourmet results",
        "description": "A fabric and design picture book for grown-ups! Create one-of-a-kind painted fabrics right in your own kitchen! Fiber artist Sue Beevers shows you the way and makes it fun and easy, too. Techniques rely on water-based paints used with convenient tools and supplies, such as oatmeal, yogurt containers, and file folders. Soon you'll be sponging, stenciling, and brush-wiping like a pro! 30 step-by-step recipes. 15 painting techniques. Learn to create everything from simple lines and splatters to salting, sun-printing, and resist. Sue's hands-on approach covers practical color theory, troubleshooting, even paint brand comparisons. Color photography highlights over 150 painted fabrics and 20 quilts. Ideal for: Quilters and fiber artists eager to create their own fabrics; Painters and crafters who want to try painting on fabric; Experienced fabric dyers and painters looking to expand their skills and try new techniques.",
        "authors": "['Sue Beevers']",
        "infoLink": "http://books.google.nl/books?id=9VVje_pOOq8C&dq=Off-The-Shelf+Fabric+Painting:+30+Simple+Recipes+for+Gourmet+Results&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Expand your fabric \"stash\" and create your own beautiful, easy to do hand painted delights. Sue Beevers's recipes are easy to follow & all the paints & suppiles are easy to find around your home & the local craft store. As a quilter I found this book to not only get my \"juices flowing\" painting delicious fabrics, but to also nudge me back to the design wall! This is an excellent addition to any fabric artist's library. Even if your time is limited, you can create beautiful fabrics very easily. Once you do one recipe you'll want to do them all! Wonderful book!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "This is a delight. The recipes for different effects are so clear, and the demonstration pieces show exactly what will (should) happen if you have more or less paint, do it in a different order, etc. I can't wait to make some sample pieces. It could have been even better with photos of the jobs being done, or stages and tools in the process. Very inspirational.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Great book, too bad its out of print. Seller did everything they said they would and book was in the condition seller said",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Great information with step by step instructions. Sue makes it so easy to understand the different types of paints available on the market and which brands are the easiest to work with. The instruction is detailed and even a beginner can do it. I'm looking forward to making more of my own hand painted fabrics!!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the weekend crafter paper quilling stylish designs and practical projects to make in a weekend",
        "description": "Includes detailed patterns and step-by-step instructions for over 30 stunning projects.",
        "authors": "['Malinda Johnston']",
        "infoLink": "http://books.google.com/books?id=zvQSbK2THJIC&dq=The+Weekend+Crafter:+Paper+Quilling:+Stylish+Designs+and+Practical+Projects+to+Make+in+a+Weekend&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I LOVE this book. It has clear directions and beautiful pictures for a large variety of projects you'd be proud to own or give, as well as a gallery to offer inspiration. My copy is studded with bookmarks for all kinds of things, from cookie jars to tree ornaments, framed wedding invitations, borders for favorite quotes, foreign alphabets (such as the Hebrew letters shown), etc. Although I own every quilling book published in the USA in the last 40 years and most of those from overseas, this remains my very favorite ... It just seems to offer the most beautiful projects and the most variety.",
                "review/helpfulness": "47/47",
                "num_reviews": 47
            },
            {
                "review/text": "I love this book! Quilling (paper filigree) is a breathtakingly beautiful art dating back many centuries, which nuns used to use to make exquisite reliquiries (sp?). Some of the work can be found in museums. Best of all, it is easy to master and unbelievably low cost ... Although it won't be archival, many people cut their own strips by putting recycled paper (including flyers and other paper with printing on one side) through a standard paper shredder. You can quill using only your fingers, a corsage pin, a toothpick, a purchased tool, or one you make yourself by gluing the pointed end of a sewing needle into the eraser end of a pencil (pushing it in, then letting it dry) and then cutting off the tip of the hole, leaving a wonderful slot that won't leave a mark. What other art is low cost, portable, easy, gorgeous, etc.?This book features a gallery (with such gorgeous work as a lion), plus photos and directions for all kinds of quilled projects. My personal favorite is Bobbye Singer's swans (with their necks forming a heart). On the quick-but-beautiful scale is a lady's quilling of the word shalom, with a dove of peace over one end.The directions are clear to get you started in no time. Just remember that the book was written by a lady who sells quilling paper, patterns, and tools, and thus doesn't stress how to inexpensively make your own. But that certainly doesn't mean that you can't.Although I own almost every quilling book, booklet, video, and pattern available, this is my personal favorite. VERY highly recommended.",
                "review/helpfulness": "42/42",
                "num_reviews": 42
            },
            {
                "review/text": "This book seemed similar to Melinda Johnston's other quilling book. It had basically all large projects in it - which is not very helpful for the modern quillist. For someone who wants to quill more modern pieces and cards, I would recommend Mickey Baskett's book.",
                "review/helpfulness": "30/33",
                "num_reviews": 33
            },
            {
                "review/text": "The first part of the book gives a nice overview of the basics (similar and includes directions for folded roses and how to make curled flowers with paper rectangles (which is not in most beginner quilling books).The book offers a variety of projects that are definitely doable by any one who has a basic knowledge and a little practice in making the basic shapes. It starts with lovely flower-based designs and includes a lot more variety. I especially liked the Fall Harvest Design (I think it would make a lovely design for a serving tray during the fall season - covered with glass of course.) There is a cute teddy bear waving from behind a flowered fence, a quilt-block design (I am definitely making this one), a smiling tiger, some jewelry pieces, and an antique car, and several others. I really like the pattern for the free standing angels and plan to make these.The gallery at the end of the book is truly inspiring and shows you just how awesome art work in quilling can be with large colorful photographs (some are museum quality pieces).If you are serious about developing your quilling skills beyond scrapbooking,looking for some ideas for your home or to give as gifts, then I would recommend adding this book to your quilling library.Happy Quilling, Lady Rose, Quilling Garden blog",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I am fairly new to quilling - this is my second book on quilling and I have done about 4 projects - and this book a tremendous inspiration. The gallery of projects is breathtaking and shows images I could have never imagined to be possible with quilling. The explanations are clear, and the project have different level of complexity, so I can start with something at my current level and improve as I get more practice.The first 14 pages of this book cover basic techniques, with clear words and detailed photos. Pages 16 through 66 are projects, which include explanation, templates, photos, and tips. The projects cover not only cards and wall hanging, but earrings, brooches and necklaces. Pages 68 through 77 are gallery photos of completed projects. The last two pages are bibliography of contributing artists.Quilling is easy to learn and does not require a large investment in specialized tools. I started by using paper I use my ink jet printer and cut into thin strips manually with scissors. Then used the tip from the first quilling book I readThe New Paper Quilling: Creative Techniques for Scrapbooks, Cards, Home Accents & Moreto use my paper shredder to generate paper strips faster.To twirl the paper I used a big eye needle I use for sewing. I first started with using the needle as is and just twirling it in my hand. Then looking at the photos in the book the book I made an improve and snipped of the eye tip with wire cutters so it was easier to disengage the needle from paper. Then I added a handle to my tool by sticking a needle into a small dowel and giving it a couple of light taps so was well embedded in the wood. If ou prefer you can buy a tool like that in a craft store, but I really enjoyed being able to create my own tools out of what I already have on hand.It takes just a bit of practice to get nice scrolls going. The book gave me a lot of nice idea of shapes and projects to try, starting with easier and then getting more intricate. Malinda Johnston has a lot of experience quilling and a way of sharing her experience in an easy to understand way.Between the two quilling books I read so far, this one has more projects that excited me. I really enjoyed Paper Quilling by Malinda Johnston and looking forward to making a number of projects from this book.Ali Julia review",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "contemporary embroidery exciting and innovative textile art",
        "description": "A showcase of contemporary embroidery from a collection of international textile artists. There is a wide representation of styles, some artists preferring to work within established embroidery traditions, others going beyond the standard definition of their craft.",
        "authors": "['Anne Morrell']",
        "infoLink": "http://books.google.com/books?id=-tSMHAAACAAJ&dq=Contemporary+Embroidery:+Exciting+and+Innovative+Textile+Art&hl=&source=gbs_api",
        "categories": "['Art, Modern']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "A showcase of contemporary embroidery , with a wide representation of styles, some artists preferring to work within established embroidery traditions, others going beyond the standard definition of their craft.",
                "review/helpfulness": "52/52",
                "num_reviews": 52
            },
            {
                "review/text": "This book is not a how-to, but interviews of thirty-eight embroiderers and examples of their art. Feast your eyes on some of the best in international embroidery... fire your imagination with the work and words of artists pushing the limits of stitch and fabric... freshen your spirit with page after page of innovative textile art... and learn that some of those who have 'made it' have the same kinds of problems you do",
                "review/helpfulness": "50/50",
                "num_reviews": 50
            },
            {
                "review/text": "Contributions from thirty-eight textile artists, each providing a piece of work and describing their inspiration and techniques.",
                "review/helpfulness": "48/48",
                "num_reviews": 48
            },
            {
                "review/text": "Recommended highly for anyone interested in textiles",
                "review/helpfulness": "43/43",
                "num_reviews": 43
            },
            {
                "review/text": "The photographs in this book will open minds to the creative possibilities of embroidery &amp; provide endless inspiration for all enthusiasts.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book, a dazzling display of some of the very best in international embroidery, demonstrates convincingly that this form of needlework is capable of taking its place among the fine arts. Depicting the work of thirty-eight artists from Britain, the European continent, North America, and Australia, the photographs in this book will open minds to the creative possibilities of embroidery and provide endless inspiration for all enthusiasts. The range of work covers abstract, realistic and geometric modes of expression. Accompanied by statements by each of the artists about their influences, personal approaches and techniques, the vivid illustrations reflect a broad and colourful diversity in their international flavour and in the individual motivations and personal strengths that lie behind these glorious creations. The works display a variety of techniques, from hand stitching to machine embroidery, quilting, appliqu&eacute;, canvas work (needlepoint), assemblage, dye and paint techniques and printing, in the service of an equally wide range of decorative and expressive purposes. For example, in the abstract linear structures of Emilia Bohdziewicz or the illustrative hand-stitched pieces of Helen Daniel, in Tom Lundberg's use of symbolism and dream imagery as well as Tilleke Schwarz's affinity for simple, strong folk art, the embroidery works shown here represent, collectively, the most exciting and innovative ideas in the field today - seasoned by a willingness to incorporate in new ways some of the methods and media of other crafts and disciplines. This exquisite volume will delight and absorb all lovers of form and colour and those who revel in the possibilities of stitch and fabric manipulation, and will serve as a guide to some of the newest and freshest embroidery art from around the world. Anne Morrell is a Professor of Textiles and former Head of Embroidery at the Manchester Metropolitan University. In addition to her research interests in historic and ethnic textiles, particularly of the Indian sub-continent, she has taught for more than thirty years and has published extensively in the field of embroidery and craft textiles. Her own embroidery work has been exhibited in various museums and in touring shows on four continents.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is not a how-to, but consists of interviews with thirty-eight embroiderers and examples of their art. Feast your eyes on some of the best in international embroidery... fire your imagination with the work and words of artists pushing the limits of stitch and fabric... freshen your spirit with page after page of innovative textile art... and learn that some of those who have 'made it' have the same kinds of problems you do.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is an incredible showcase of contemporary embroidery, with a wide representation of styles. Some of the artists have preferred to work within established embroidery traditions, and others have gone beyond the standard definition of their craft. The photographs in this book will open minds to the creative possibilities of embroidery &amp; provide endless inspiration for all enthusiasts. It's a great book which I recommend.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This dazzling display of some of the very best in international embroidery demonstrates convincingly that this form of needlework is capable of taking its place among the fine arts. Depicting the work of 38 artists from Britain, the European continent, North America, and Australia, the photographs in this book will open minds to the creative possibilities of embroidery and provide endless inspiration for all enthusiasts. The range of work covers abstract, realistic and geometric modes of expression. Accompanied by statements by each of the artists about their influences, personal approaches and techniques, the vivid illustrations reflect a broad and colourful diversity in their international flavour and in the individual motivations and personal strengths that lie behind these glorious creations. The works display a variety of techniques, from hand stitching to machine embroidery, quilting, appliqu&eacute;, canvas work (needlepoint), assemblage, dye and paint techniques and printing, in the service of an equally wide range of decorative and expressive purposes. For example, in the abstract linear structures of Emilia Bohdziewicz or the illustrative hand-stitched pieces of Helen Daniel, in Tom Lundberg's use of symbolism and dream imagery as well as Tilleke Schwarz's affinity for simple, strong folk art, the embroidery works shown here represent, collectively, the most exciting and innovative ideas in the field today - seasoned by a willingness to incorporate in new ways some of the methods and media of other crafts and disciplines. This exquisite volume will delight and absorb all lovers of form and colour and those who revel in the possibilities of stitch and fabric manipulation, and will serve as a guide to some of the newest and freshest embroidery art from around the world. Anne Morrell is a Professor of Textiles and former Head of Embroidery at the Manchester Metropolitan University. In addition to her research interests in historic and ethnic textiles, particularly of the Indian sub-continent, she has taught for more than thirty years and has published extensively in the field of embroidery and craft textiles. Her own embroidery work has been exhibited in various museums and in touring shows on four continents.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "magic of doubleweave",
        "description": "Loom-controlled doubleweave is explored in depth in this handbook of out-of-print articles from textile innovators Weaver's and Prairie Wool Companion. Detailed instructions and gorgeous photographs illustrate how to design and weave 30 different projects including placemats, coverlets, jackets, bags, wall hangings, and throws using four- to sixteen-shaft looms. Instructions on the various ways to produce multiple layers with a loom-block-double weaves, stitched double cloths, and double-layered color effects-are provided alongside basic and intermediate-level drafting illustrations.",
        "authors": "['Madelyn Van der Hoogt', 'Alexis Xenakis']",
        "infoLink": "http://books.google.com/books?id=QLkzOQAACAAJ&dq=MAGIC+OF+DOUBLEWEAVE&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Although the ideas look really neat, there are not many uses for someone with a 4 shaft loom (like me). More stuff for 8 shaft owners. I think some of the ideas could be adapted, if one were an experienced weaver. Certainly doubleweave is a technique that some might like to attempt, but this is not the book to start with.",
                "review/helpfulness": "33/37",
                "num_reviews": 37
            },
            {
                "review/text": "I have found all the Best of Weavers books to be extremely thorough and easy to follow in the instructions. The photograghy is wonderful. There are very creative projects that are inspirations in themselves and great for stepping stones to one's own creativity. These are probably the books I refer to the most for my weaving designs.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "A good book with a lot of ideas . More useful for who ownes more than 8 shaft looms",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "400 polymer clay designs a collection of dynamic colorful contemporary work 500 series",
        "description": "Unique creations by top artists such as Nan Roche, Cynthia Toops, Barbara McGuire, and Gwen Gibson make this the best showcase of polymer clay work ever assembled. With everything from jewelry and vessels to art dolls and sculptures displayed in superb color photos, the versatility and beauty of the medium is exquisitely evident. Mosaics, millefiori, canework, and molded, stamped, and embossed pieces: there's a little bit of everthing to please the eye. Dayle Dorowshaw's magical Egyptian Spell Book features carvings and image transfers that blend seamlessly with gold leaf, candles, branches, and silver. Luann Udell's faux-ivory artifacts take their inspiration from the prehistoric art in France's Lascaux Caves. It's the largest-and finest-book of contemporary polymer art available anywhere.",
        "authors": "['Suzanne J. E. Tourtillott']",
        "infoLink": "http://books.google.com/books?id=hbUW7zn5O0kC&dq=400+Polymer+Clay+Designs:+A+Collection+of+Dynamic&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "This book has nice photos of great creations by polymer clay artist. The photos are not small with only one or two items on each page. It gives the name of the artist, and some of the materials used. It has no instructions for any projects or techniques, so if that's what you want don't buy this. If you are already a great polymer clay artist, you will find inspiration looking at the pictures. Most are very complicated and are not for beginners. It's a great price for so many pages of photos.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "The pictures in this book are beautiful, but I will probably be reselling it on Amazon because it is just like looking at a coffee table book. Once through, and you're done. There are so few really good polymer clay books (The Art of Polymer Clay being one of them), and this one is not one of them. The photography is impressive, the designs are beautiful and innovative, but if you're looking for a book that teaches you something - forget it. This isn't it!",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book is a stunning gallery of what all is possible in polymer clay. I do have two of my own pieces on this book, and it is a huge thrill to be included in this book.This is a must have book for anyone who loves creating stuff from polymerclay. There are jewelry pieces, sculptures, wallpieces... Items vary from usefull to art pieces. This book probably has examples of any techniques that have so far been used with polymerclay. Really interesting, highly entertaining and very inspiring book.",
                "review/helpfulness": "20/23",
                "num_reviews": 23
            },
            {
                "review/text": "This was a book of brilliant, professional, and beautiful polymer clay designs and product. Unfortunately, I wanted to know how the designers made these pieces (at least a short synopsis) and there was not a hint of that in any one of the pieces that I liked. So if you want a book of designs and creations only of very, very talented artists -- this is the book for you.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "Within its 352 pages you will find unlimited inspiration and ideas for new and varied clay projects. Even if you are not an accomplished polymer clay artist, this book will inspire you to explore the wonderful, varied world of polymer clay.From cover to cover, feast your eyes on 400 breathtaking photographs, each one more stunning than the last. Every aspect of polymer clay design is explored in the pages of this book. If you need inspiration to start a new craft or if you are a seasoned polymer artist, the techniques and designs will definitely spark your creativity.Every technique is represented with close up, clear and colorful photographs. The exquisitely detailed photographs exemplify the works of many talented well-known clay artists with materials used and different techniques. Each and every page glorifies the experience of polymer clay design.It should definitely be in every polymer clay enthusiast's library.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "A friend of mine lent me this book she called it a \"cofee table book.\" I think this a very appropriate title. I found this book not only interesting but inspirational, there are a wide range of artists inside who use a large variety of different types of art using polymer clay. This book would be appropriate for someone who is fascinated by what is possible with polymer clay. Well worth a look.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "The book was surprisingly thick for the small cost it's being sold for. All the pictures are full color. No black and white photos. Images are large enough to see detail so you can learn new techniques and get ideas for your own projects. Overall, I'd say this book is a winner!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "All of Larks 400 and 500 series books are not instructional: they are inspirational. This book showcases some of the best polymer work being done. I have pored over and over it for the past year and I never tire of looking at it!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is not instructional. It's inspirational. The pictures are wonderful!If you need something to get you through those dry spells, this is the book for you. Just flip through the pages and get inspiration from the designs of these multitalented artists.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I really like the book and find it very inspiring. I am very disappointed in the quality of the book itself, many of the pages were torn at the edges and several were not cut apart.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "origami ornaments the ultimate kusudama book",
        "description": "Based on the design of traditional Japanese Kusudama ceremonial spheres, Origami Ornaments offers step-by-step instructions on how to create colorful paper folding decorations--from disco balls and unique cubes to lovely globe and lantern shapes--while remaining true to origami purist standards. Featuring four basic model designs--base, joiner, clip, and hinge--that can create limitless, unique ornaments, this orgiami book offers do-it-yourself designs small enough to hang on a Christmas tree or large enough to hold aromatic potpourri. As the ornaments rest they will open gently, like flowers, but still not come apart. Additional instructions for incorporating strings and tassels, as well as suggestions for utilizing different wrapping paper colors and patterns, will make these original ornaments dazzle. Origami Ornaments is the perfect book for holiday crafters and origami enthusiasts alike.",
        "authors": "['Lew Rozelle']",
        "infoLink": "https://play.google.com/store/books/details?id=k-P6chfMSqoC&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book has very clear explanations, and nice designs. No actual photographs of the projects, except the ones in the cover, which is why I rated it 4 stars. Having photos of the actual projects would have helped a lot in the construction of these models.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I don't agree with the review saying there were problems. I have made the Lantern and many others without any problems. The instructions are very clear and the results are great looking! I especially like the fact that they are &quot;pure&quot; origami (no glue or cutting required).However, it definately would have been nice to have actual photographs of the finished products. But this is still the best book I have found for making ornaments and/or balls. It is a lot better than &quot;Kusudama : Ball Origami&quot; which required glue and/or string for several of the models.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Kusudams without glue: a pleasure! I made the Two-Dimesional icon ,Three-Dimensional icon, Where's up? (i very love this last) (7 squares for all). The Cube (20 squares) is wonderful because it have something as wings.The Magic cube (14 squares) look good too. The Tristar (6 squares) need a pair of tweezers but his form is very pleasant (triangle). But i had some problems with others. The Lantern and the Lightstar lantern didn't need squares the same size! This book haven't pictures inside. When i'll made others kusudamas i'll write to tell what i think of the rest.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the contemporary flower arranger",
        "description": "Flowers can bring a room to life. Lynda Owen has created a variety of arrangements and displays that concentrate on associating flowers and foliage with unusual yet appropriate materials, in order to produce stylish and modern designs that can be used and adapted for every setting. There is guidance on the finest quality flowers and foliage and practical advice on proportion and colour. Step-by-step projects appear in every chapter, with flower-arranging techniques and equipment, and there are suggestions for unusual yet striking containers.",
        "authors": "['Lynda Owen']",
        "infoLink": "http://books.google.nl/books?id=hrEHAgAACAAJ&dq=The+Contemporary+Flower+Arranger&hl=&source=gbs_api",
        "categories": "['Flower arrangement']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As a professional floral designer I'm always on the look out for great ideas. So it was with high anticipation I waited for this book to arrive. One look and I understood I'd been duped. The ideas are homey, rather than contemporary. Usually I'd find something to keep me interested, but in this case it was a complete bust! I'd recommend some of the other authors who do very daring and interesting work like Pryke, Turner, etc. Forget this. Its going back.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I just grabbed this book off the shelf without really looking at it. I am an avid flower arranger, been to school to learn all I can about the subject. WOW! Yesterday, when I sat down to look through this book I was amazed. I have NEVER seen such beautiful arrangements, and so clearly and beautifully described with instructions for making every single one. Buy it. You won't be sorry.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "fabulous felt hats",
        "description": "Internationally-known felt artist Chad Hagen shows just how simple, good-looking, and varied feltmaking can be, as she guides you through the basics of making more than a dozen spectacular hand-sculpted hats. Here are 15 patterns with endless variations, all in classic shapes, and transformed into unique fashion statements with fanciful touches and exquisite embellishments. Berets have 'wings,' snoods come with long tails just right for scrunching up, and caps feature soft felt spikes or long \"dreadlocks\" to tie in knots. Even the most traditional designs, such as pillboxes and brimmed hats, sport whimsical tiny safety pins or beads and buttons. For those who prefer not to start from scratch, there's even advice on jazzing up store-bought hats.",
        "authors": "['Chad Alice Hagen']",
        "infoLink": "http://books.google.com/books?id=c5ysqGN5qv8C&dq=Fabulous+Felt+Hats&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Beautiful photographs in a quality book. This book was purchased as a gift for an experienced felter and was well received.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is another well illustrated book that is well worth the investment.The instructions are very clear, comprehensive and thorough.Methodical application by the reader/ crafts person would enable persons of all level of experience to succesfully utilise the text.The projects in this book are excellent in themselves. However they also provide the reader with tools to develop and express themselves further as their confidence develops. Make sure you have at least a small space at home to do the projects. Suggestions are made for alternative hat blocks (although plastic blocks are available in the US that is perfect for this kind of felt hat making). Experiment!This book is also good for milliners. As it teaches you how to make a hat from scratch and encourages the crafter to express themselves without the stress of damaging an expensive pre-made felt hood or capeline.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "My experience felting was a 1 hour class to get my hands wet...my kids each picked out a hat from the book to make and with more adult help our hats turned out great!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book has clear, simple instructions for someone looking to learn the basics, and those with more experience will be inspired by the supplementary illustrations showing work by some of the best in the world. There is nothing hokey here- Ms. Hagen has very good taste.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book gives a really good basic knowledge how to start felting a hat. Without any experience I could follow the clear instructions and make a fabulous hat myself. Clear pictures and enough examples to get started and create your own design.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a very inspiring book for aspiring hat makers and has some creative ideas and \"how-to's\" on how to create them. Has lots of great color photos of a variety of unique hand-felted hats. Great project to do in cold weather to keep your head warm!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "painting sunlit still lifes in watercolor",
        "description": "33 step-by-step demonstrations show how to capture the sunlit textures and colors of a variety of popular still life subjects.",
        "authors": "['Liz Donovan']",
        "infoLink": "http://books.google.com/books?id=1EcsAAAACAAJ&dq=Painting+Sunlit+Still+Lifes+in+Watercolor&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a wonderful book. After discussing the materials and some basic watercolor techniques the following chapters provide demonstration projects to apply the techniques. Ms. Donovan's paintings are a nice balance between washy-style watercolors and hyper-realistic.She really shines on the demonstrations of painting reflective surfaces such as silver, glass or brass and also woodgrain and marble (which was a wonderful surprise since I'd never seen marble discussed before in any other watercolor book I own).She also discusses composition, the effect of lighting and set up of your own still lifes for maximum impact.I have done several of the projects and plan to do all of them. My own paintings have improved since applying the concepts and techniques the book demonstrates.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "Liz Donovin is not only a beautiful artist, she's an excellent teacher. I study watercolors exclusively, and mostly from books. Her examples and color diagrams are truly worth a thousand words each, and her text is tightly knit into lines of priceless information, insight and instruction. Liz generously shares her secrets of mastering light, texture, and color. That's just for starters. I could go on and on. My husband ordered the book as a gift for me, under the condition I take my twice borrowed, overdue copy back to the library before I put us into hock! I did return it...but it was a long farewell! Thanks Liz, and BRAVA!",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "pattern and embroidery",
        "description": "A hand embroidery pattern book featuring over 50 patterns inspired by gardens and nature. There is a nice variety of easy border patterns to embroider on kitchen towels, pillow cases, quilts, purses, and more. There are floral patterns for each month of the year, hearts and Scottie Dogs for Valentine's Day, whimsical Jack-O-Lanterns for Halloween, harvest vegetables for Autumn, and a nice selection of Christmas patterns to make ornaments and other holiday gifts. It's easy to use tracing paper to trace the pattern in the book you want to use and then transfer the pattern onto your chosen fabric. The patterns in this book are hand drawn and are from my collection of patterns that I've designed over the years for my online shop Country Garden Stitchery. A nice collection of patterns for your inspiration and creative projects! You can see many of the finished embroidery designs in my Etsy shop at www.countrygarden.etsy.com",
        "authors": "['Cathie Richardson']",
        "infoLink": "http://books.google.nl/books?id=pZjDvQEACAAJ&dq=Pattern+and+embroidery&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Embroidery, like crochet, patchwork and rug making, has made an enormous comeback. There is, however, a vast difference between the embroidery of today and some of the rather insipid type of work that was found in so many Victorian households. Because machines can do so much in the way of stitchery these days, hand embroidery has to be completely individual in design and full of character in order to compete. Gratifyingly, a return is evident to many of the stitches used in the Seventeenth century and earlier, and these are sometimes combined most effectively with modernistic designs. Moreover, much of the handwork done nowadays is used for interior decoration, rather than for small items such as traycloths, or on clothes. For those who are skilful with the needle and interested in this kind of work, this book is full of ideas to stimulate the imagination, and the basic kind of instruction which a beginner needs. It contains a collection of pictures of different pieces of work, some ancient, some modern. The chapter on patchwork, an old art now very mod, suggests varying ways of joining pieces of material to achieve variety in the appearance of the work. For instance, attractive pictures can be made merely by using different shaped patches- another idea for interior decorating. The section on raised surface, quilting in particular, is unusual. In case you think quilting is only for making quilts, or possibly skirts, try this: When embroidering a figure, pad the face, hands and feet. the resulting picture looks very different from that with a flat surface. The book contains on applique; the effects achieved by using grainy fabrics on a smooth background; drawn thread and cut fabrics work: net darning; needle and felt weaving (working over the warp threads of a fabric to create a new surface texture) and blackwork, one of the most effective types of embroidery.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "This is a beautifully produced book of particular interest to the advanced student of embroidery, studying this subject on an intellectual level. But it is a stimulating ideas source for anyone. There is a minimum of text and an abundance of excellent, beautiful photographs.",
                "review/helpfulness": "44/45",
                "num_reviews": 45
            },
            {
                "review/text": "This book explores the amazing variety of ways in which embroidery can be used, not for merely decorative effect but to create genuine works of art. It is a book for the serious seamstress, who has already mastered the elements of embroidery and now wants to go on to something more imaginative that will tax her skill. It is sure to provide a source of stimulating ideas, as well as expert advice on technique. The book is divided into three sections, the first dealing with the nature of fabrics, and the suitability of various kinds when used in applique, patchwork raised surfaces, and hand and machine embroidery. The second is on threads- the many different kinds, and their many different uses. The third deals with the mixed techniques of print embroidery. The illustrations are superbly reproduced, and show the smallest detail with great clarity. They are drawn from both historic and modern sources, ranging from a seventeenth-century night-shirt, through Victorian Samplers to wonderfully imaginative modern abstracts and clever 'free needleweaving' by schoolgirls.",
                "review/helpfulness": "43/43",
                "num_reviews": 43
            },
            {
                "review/text": "The book will be useful for students in colleges of education and those studying for examinations, and also for teachers since it explains the effects which can be achieved by the use of different techniques. It points out that techniques are chosen for a particular purpose and are not purely accidental. The reader is helped thereby to look more critically at finished work. The inclusion of comparable techniques in both historic and present-day embroidery is very valuable, making students aware that many so-called 'new ideas' can be found in historic work, thus making museum study more interesting and profitable. The problems of printed fabrics with embroidery are explained with sound advice and some stimulating experimental ideas.",
                "review/helpfulness": "41/41",
                "num_reviews": 41
            },
            {
                "review/text": "This book is a caption-and-picture introduction to the subject. The book is split into three sections- the nature of fabrics, threads and embroidery with printed patterns.",
                "review/helpfulness": "39/41",
                "num_reviews": 41
            },
            {
                "review/text": "I only indulge in embroidering every now and then, but when I do I have found this book a really useful start to get ideas",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "While this book is of special interest to embroiderers, the ideas here relating to pattern encapsulate ideas that are applicable to all art media. A very useful book for painters, too!",
                "review/helpfulness": "36/37",
                "num_reviews": 37
            },
            {
                "review/text": "This is one of the best books I have found to use in my embroidery work",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            }
        ]
    },
    {
        "Title": "annie sloan decorative stenciling and stamping a practical guide",
        "description": "Decorative Stenciling and Stamping teaches you how to cut pre-designed stencils and how to design your own. It shows how you can use brushes, sponges, and rollers to impart a variety of finishes and textures. You'll also find tips on the best ways to make repeatable patterns and how to create reverse stencils. The author shares the secrets of crafting decorative stamps simply and inexpensively by using everyday objects you can find at home. She shows how to use paper cups to make semicircles and corrugated cardboard for stripes. You'll learn how to cut designs into sponges, potatoes, and polystyrene to produce your own personal stamp. Every project in Decorative Stenciling and Stamping includes a list of the tools and materials you'll need, easy-to-understand step-by-step instructions, and practical tips on what to do if anything should go wrong. All the techniques are demonstrated on a wide variety of surfaces: from fireplaces, cupboards, and storage chests, to smaller items such as candleholders, flowerpots, and more.",
        "authors": "['Annie Sloan']",
        "infoLink": "http://books.google.com/books?id=2x5ZgyxauiMC&dq=Annie+Sloan+Decorative+Stenciling+and+Stamping:+A+Practical+Guide&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Wonderful book for a stenciler who would like to learn all the different ways to stencil as well as stamping. Well written with lots of clear pictures and instructions. Highly recommended to the beginer as well as those who are tired of dry brush stenciling. All the techniques give wonderful results. I have tried every single technique in the book with great success the first time around.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "Anne Sloan has surely done well with this book. Definitely a &quot;practical guide&quot;. I have loads of these kind of books, but this is the first one to show so many ideas in easy to understand directions. Great techniques not seen in other books. And great suggestions for tools.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            }
        ]
    }
]