[
    {
        "Title": "fearless girls wise women and beloved sisters heroines in folktales from around the world",
        "description": "One hundred great folk tales and fairy tales from all over the world about strong, smart, brave heroines. Dismayed by the predominance of male protagonists in her daughters' books, Kathleen Ragan set out to collect the stories of our forgotten heroines. Gathered from around the world, from regions as diverse as sub-Saharan Africa and Western Europe, from North and South American Indian cultures and New World settlers, from Asia and the Middle East, these 100 folktales celebrate strong female heroines. Fearless Girls, Wise Women, and Beloved Sisters is for all women who are searching to define who they are, to redefine the world and shape their collective sensibility. It is for men who want to know more about what it means to be a woman. It is for our daughters and our sons, so that they can learn to value all kinds of courage, courage in battle and the courage of love. It is for all of us to help build a more just vision of woman.",
        "authors": "['Kathleen Ragan']",
        "infoLink": "https://play.google.com/store/books/details?id=F7bdCQAAQBAJ&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Compared to other anthologies of fairy tales depicting women in a more liberated light, this book is extremely disappointing. The stories themselves have little to recommend them and, although they are folktales and so less sophisticated than postmodern fiction, they seem to have been chosen not to entertain but purely to demostrate the worth of women. I have nothing against that (hey, I'm female too) but it could be done with infinitely greater skill. The main problem with this book is the way women are depicted (yes, you read that bit right). Ragan understandably aims to challenge the myth of the representation of women in folk tales but her representation is as much a myth and one-sided as traditional patriarchal propaganda. Ragan's portrayal of women constructs them as extraordinary in strength, intelligence, principles and beauty. To me, the whole point of feminist literature is the issue of equality, not superiority. If Ragan's aims spring from such a source, women should be acknowledged in a more realistic light - some are good, some are bad and most of us are somewhere in between. They have shortcomings and flaws but dignity and worth too. A woman's place in the world does not have to be on a pedestal or in a gutter. I think Ragan also unconsciously reinforces the values regarding women in a patriarchal society. In each story, her summary comment at the end attempts to magnify the significance of the actions of the women in the story (and so reflect on all women) but she disregards any of the failings that they have. In a lot of the stories, an extremely important trait in the woman was her beauty and her skill or intelligence were used to secure herself a place in society designated to her on the grounds of her sex eg. advantageous marriage or the wellbeing of children. Also, in many instances, a woman's use of her skills is purely selfish in intent. By not acknowledging this, Ragan gives the impression that it is acceptable and, through her commentary, even admirable for a woman to use her talents in that way. This reduces women to the role of self interested child-bearing entities valued only for the services they perform for others. Such a portrayal only emphasises the limited and confining identity that is constructed for women in patriarchy but is infinitely more dangerous because it comes, presumably, from a person who is supposed to recognise the emptiness and uselessness of having exclusively such an identity.. I think for this book to be truly valuable as a comment on society, it should acknowledge that women are not merely chattels or possessions but neither are they without flaw and perfect. Women, like all people, are just that - people, and as such are capable of great wisdom and great foolishness. THAT is our worth and contribution to society - in the end, that is everyone's regardless of gender.",
                "review/helpfulness": "107/136",
                "num_reviews": 136
            },
            {
                "review/text": "I imagine it would be somewhat difficult to find folktales that did not depict someone with extraordinary abilities/attributes or at least in extraordinary circumstances - that is the very point of folktales to begin with. Most characters are allegories, and most stories have some kind of moral. If you are in the mood for an in-depth character study, read a good fictional novel, or the like. You are right-a woman's place should not be on a pedestal or in a gutter. But much is black and white in folktales, and much is black and white in female history-think of the Virgin and the [prostitute] constructs that are so prevalent in analysis. The point of folktales, is again, conveyed through allegory more than a study of the nitty-gritty of real life. They are used for lessons-not as individual stories about people so much as stories that everyone might fit into at one point of their lives or another.Also, it would likely have been difficult to find folktales that ignore the value of women's places as wives and mothers-but do read Tatterhood, a favourite of mine as a child. Women have long, and in many cultures, been associated with motherHOOD (the biological fact is that women have the babies), and in most with motherING-the practice of the cultural values and characteristics of \"mother\" being attributed to, and inextricably linked with the concept of \"woman.\" Also, `traditional patriarchal propaganda' is not a myth, unfortunately, it is a reality-even if what it promotes is mythical. There is no culture on earth right now that is matriarchal-and there very likely never has been. Traditionally, women very rarely are granted any kind of authority within culture, but what they do have (and what has been overlooked by anthropologists for years) is informal power-often seen as manipulative and illegitimate. It seems to me that a good feminist analysis would acknowledge and value this as evidence of the courage and ingenuity of women, without abandoning aims for gaining authority for women.Why is it not okay for women to be ambitious (traditionally a male trait) and use what attributes, skills and talents they have for securing their place in society-it is clear no one will do it for them. Women wouldn't be allowed to vote in the US if it weren't for the first wave of feminists. And I don't know about you, but I plan to have two children, and I know I want to be able to give them everything they deserve-which means securing a place for myself first. I want to be independent enough that I will survive if everyone I depend on is stripped away from me. Is that entirely selfish? unreasonable?\"This reduces women to the role of self interested child-bearing entities valued only for the services they perform for others.\" - isn't this a bit contradictory? If women are concerned with doing things for others, then how are they self-interested any more than anyone else? One works, and receives payment/goods/favors of some kind for the work. This is the basis for most societies-reciprocal altruism, formal or informal.Admittedly, there should be as much equality between the sexes as possible, and there should be egalitarian relations. However, due to biology and psychology, I imagine the best it will get to is a `separate but equal' arrangement. But focusing on women, on the stories containing female protagonists, does not mean Ragan is promoting feminine superiority-Ragan did not write the folktales, and to a certain extent did not even control the content of the folktales-only which ones she chose to use. She is also not simply reinforcing patriarchal ideals-and if she does that, it can hardly be avoided by the most stringent feminist using the chosen material-but trying to highlight the feminine roles (existance!) in folktales, and in society. Perhaps reclaiming that which has been used derogatorily and oppressively previously is not a horrible, terrible thing. Perhaps it can be admitted to have some purpose.I think for the most partyour objection was to the genre, and less the fault of the author. Sorry for the bit of the rant-hope you find it coherent and to some extent valuable. I just love debates like this and couldn't pass up the opportunity.",
                "review/helpfulness": "30/47",
                "num_reviews": 47
            },
            {
                "review/text": "What a feat--to have ferreted out these wonderfully rich stories from around the world! These tales, left in their own cultural idioms, invited me to transcend ages-old boundaries and to explore life in other lands and eras. The introduction, coming from a mother who was concerned about her daughters' literary role models, didn't fully prepare me for what I had in store, though: don't go looking for a &quot;book of virtues&quot;-type anthology with clear object lessons or easy reading for your kids. Heroism comes in many different guises throughout these tales, in ways that chivalry and good manners might not ordinarily accept. Because these heroines are not readily categorized as the feminine archetype, they may not be obvious role models for women (and girls), but they do create much more interest and discussion than the Cinderella-type stories which women can't even begin to emulate. For some of the protagonists, their heroism lies in their ability to break out of the mold that their societies gave them--or at least, to stretch them so that their feats are unexpected by those surrounding them. That's a refreshing lesson in any culture. I very much hope, in any case, that Ms. Ragan will reach back into those 30,000 surveyed stories and, with her daughters once again in mind, come out with a collection of stories edited for our children. We wait with bated breath....",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "This book is terrific - the stories I read in &quot;Fearless Girls, Wise Women &amp; Beloved Sisters&quot; has completely changed the way I view the portrayal of women in folktales. When I was a kid, many of the books I read had male protagonists, and early on I realized that in the stories and plays I was reading the males got all the good parts. They went off and did the courageous things while the female characters tittered, blushed and occassionally fainted in safety. The women in this book do brave things the men can't (or aren't smart enough) to do. They fight monsters, outwit giants and save lives, yet they they have traditional feminine qualities such as patience, devotion and compassion, and a soft spot for babies. The tales in this anthology are as diverse and varied as the women they represent. They come from all around the world and cross all cultural lines. To help readers understand the cultural context, the author has included her notes at the end of each tale expressing her personal reactions and the cultural background. I liked reading her remarks, and enjoyed the way they helped put the tales in context. I highly recommend this book - it is really refreshing to find out that women's empowerment is not something new! [D.A. age 14]",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "The collection is nice. It introduced me to folktales I've never read anywhere else. The &quot;precious&quot; little commentaries made by the author after each piece are irritating and pc-preachy. I can come up with my own interpretation of a tale without her telling me what to think, thank you very much.",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "I find the stories in this book to be a highly entertaining read and am excited to have it as a resource for any possible future daughters of my own. When I was a girl, I often sought stories that depicted female heroines (Scout from to Kill a Mockingbird, Joan of Arc, Marie Curie, Eleanore of Aquitane, Queen Elizabeth, Athena, Isis) and it is fantastic to have a compendium of world myths and stories that reflect admiration for females.As an anthropologist, I would like to respond to the comment below that \"there is no culture on earth right now that is matriarchal-and there very likely never has been.\" That is untrue. Many cultures are and were of various matriarchal forms. Currently, the Mosuo, Minangkabau, Hopi, Iroquois, Navajo and Cherokee for instance, are matriarchal. So were the Arkadians (ancient Greek culture), the Nair(India) and many more throughout the world and throughout history than I care to write here.I highly recommend this book.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book is a much needed addition to the world of multicultural and feminist stories. Because the author has broadened her definition of heroine to include qualities traditionally attributed to women and subsequently denigrated by the society, the book succeeds in bringing us new definitions of what it means to be a successful human being. Honoring qualities like creating a &quot;hearth&quot; for a family, kindness, perseverance and cleverness rather than physical strength (though delightful tales featuring female strength are included too!),Ragan brings to our attention stories that celebrate feminine qualities. As a storyteller, I have found stories that I can use immediately to build my repertoire of performance pieces. The care with which Ragan has sought out those sources closest to the oral tradition makes the storyteller's job of &quot;translating&quot; written text to oral performance much easier. I highly recommend this book to educators, librarians and storytellers. It also makes a great resource collection for parents who want to expand the kinds of stories they offer to their children, both male and female!",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "The tales are magical, but Ragan's dry and insipid commentary at the end of each story are a definite anti-climax. The best way to read it is to completely ignore the final paragraph in italics and just enjoy the feeling the story leaves you with.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "Positive, strong female role models are of course extremely important for girls, more so than for boys, who can find them everywhere. So I had high hopes for this book when I bought it for my 4 1/2-year-old daughter, who devours books. But I found that for each story that shows a strong and capable girl thinking for herself and achieving for herself, there are 2 or 3 more stories that are about death, killing, kidnapping, treachery, deceit, physical danger, slavery, and that sort of thing. There's just too much of it in too many of the stories. Each time we sat down to read from the book, I had to look and look, previewing each story to find one that wouldn't be too scary for my daughter. The ones we found without all the scary stuff were captivating, though, and she wants me to read them again and again, so....it's six of one, a half dozen of the other.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "Great short stories! It is a wonderful read for myself, my daughter(8) and my son(4). Both children enjoy the colorful idioms and the tales!",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "night whispers bedtime bible stories for women",
        "description": "Reintroduces ten Bible stories to today's women in an evening devotional format, with dramatic retellings and suggested life-changing applications.",
        "authors": "['Jennie Afman Dimkoff']",
        "infoLink": "http://books.google.com/books?id=CjWEHUT99X0C&dq=Night+Whispers:+Bedtime+Bible+Stories+for+Women&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Remember when you were a kid? The best part of a book was its pictures-the more the better! Pictures tantalized the imagination as we plunged into the stories.In the same way, Jennie Afman Dimkoff's storytelling is absolute artistry. With words she paints biblical stories more vividly than cinema. With strings of thought she weaves connections between that world and ours. As an adult, it's wonderful to rekindle the biblical imagination of my youth all over again. As a seminary student, this one book has enhanced my education--adding living color.As a man, yes a man, \"Night Whispers\" is more than a book for women. Though written for a female audience, Jennie Dimkoff's biblical narratives contain both a balance of male and female characters and, more importantly, themes that transcend gender. Additionally, its immediate connections to women helped me to better understand women's spiritual struggles. No man lives in a world without women, making it a valuable-read for any man who wants to grow in faith with the women he loves.Regardless of your gender or experience with the Bible, \"Night Whispers\" will luminously enhance your interaction with the Bible, its stories, and, most importantly, its main character: God.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am not easily impressed by most books, but Night Whispers is an absolute treat.It's hard to believe this is Jennie's first book because the writing is so accomplished and inviting. The book's concept is equally compelling. Jennie obviously knows and loves God's word and her desire to share her experiences with other women shines right through.I love the way she introduces modern day stories as she leads back to the bible and shares observations that are as relevant today as they were thousands of years ago. The other wonderful thing she does is to give \"homework\" in such a gentle yet inviting way we want to read and learn more.Thank you, Jeannie for your lovely book.. From the cover to the layout to everything else this is a must read and reread book for women of all ages.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "nine women portraits from the american radical tradition",
        "description": "Historian Judith Nies highlights the lives of nine women who worked effectively to give women equal rights and access to public life in the U.S., and she writes of women whose environmental activism has been crucial in the ongoing effort to preserve biological diversity on our earth.",
        "authors": "['Judith Nies']",
        "infoLink": "http://books.google.com/books?id=w4FapbOGKuoC&dq=Nine+Women:+Portraits+from+the+American+Radical+Tradition&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I absolutely loved this book. It was inspiring and moving and informative and beautifully written. I read every word, and was moved to tears several times. One of the true revelations was the piece about Bella Abzug, as I'd fallen prey to the media's image of her as a crazy broad with a hat! It was great to learn about the 'whole' Bella. The Charlotte Perkins Gilman chapter was also highly educational, as I'd only known her through The Yellow Wallpaper. But every chapter was fascinating, from the one on Mother Jones to the heart-wrenching story of Fannie Lou Hamer. I found myself reading passages aloud to my husband frequently, and he was equally moved and impressed.Thanks to Judith Nies for writing it, and for so beautifully telling the moving stories of these heroic women. Bravo, bravo, bravo....",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Were you, like me, alwaays vaguely aware of Mother Jones, but ignorant of exactly who she was and what she did? This book filled some important gaps in my general knowledge, and inspired me with the stories of women who were able to see through the injustices of their time (slavery, unfair labor practices, denying women the vote, polluting, etc.) and work toward a boader view of justice and dignity, often at great personal cost. Nies is a thoughtful and measured writer, letting her own anger at injustice shine through these women's stories rather than using her subjects to advance her own agenda. Highly recommended.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "women in the trees us womens short stories about battering and resistance 18392000 american womens stories project",
        "description": "Formed in 1960 in Raleigh, North Carolina, the Student Non-violent Coordinating Committee (SNCC) was a high-profile civil rights collective led by young people. For Howard Zinn in 1964, SNCC members were \"new abolitionists,\" but SNCC pursued radical initiatives and Black Power politics in addition to reform. It was committed to grassroots organizing in towns and rural communities, facilitating voter registration and direct action through \"projects\" embedded in Freedom Houses, especially in the South: the setting for most of SNCC's stories. Over time, it changed from a tight cadre into a disparate group of many constellations but stood out among civil rights organizations for its participatory democracy and emphasis on local people deciding the terms of their battle for social change. Organizers debated their role and grappled with SNCC's responsibility to communities, to the \"walking wounded\" damaged by racial terrorism, and to individuals who died pursuing racial justice. SNCC's Stories examines the organization's print and publishing culture, uncovering how fundamental self- and group narration is for the undersung heroes of social movements. The organizer may be SNCC's dramatis persona, but its writers have been overlooked. In the 1960s it was assumed established literary figures would write about civil rights, and until now, critical attention has centered on the Black Arts Movement, neglecting what SNCC's writers contributed. Sharon Monteith gathers hard-to-find literature where the freedom movement in the civil rights South is analyzed as subjective history and explored imaginatively. SNCC's print culture consists of field reports, pamphlets, newsletters, fiction, essays, poetry, and plays, which serve as intimate and illuminative sources for understanding political action. SNCC's literary history contributes to the organization's legacy.",
        "authors": "['Sharon Monteith']",
        "infoLink": "https://play.google.com/store/books/details?id=DWr9DwAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "And I'll tell it and think it and speak it and breathe itAnd reflect it from the mountain so all souls can see it--Robert Zimmerman, \"A Hard Rain's A-Gonna Fall\"Saying that Susan Koppelman is an expert on the women's short story in the United States is like saying that Bob Dylan is a well-known songwriter. Both statements are true; neither is adequate to its task.Koppelman edited the first-ever anthology of feminist literary criticism (Images of Women in Fiction: Feminist Perspectives, 1972). She has since gone on to publish ten anthologies of women's short stories. Today, she is not only an expert but, in fact, the preeminent expert on the women's short story in the United States. She knows her song well, and she is determined to sing it, for the benefit of women and readers everywhere.Women in the Trees is an anthology subtitled, \"U.S. Women's Short Stories About Battering and Resistance, 1839 - 2000.\" The title story, by Pat Murphy, a science and science fiction writer from San Francisco, dates from 1990 and describes the plight of a woman trapped in an old farmhouse with a battering husband. The story ends with the woman discovering what she must do to escape. In other stories in the anthology, battered women not only make empowering discoveries but in some cases kill their batterer.In a beautiful foreword, Alix Kates Shulman, author of the novel Memoirs of An Ex-Prom Queen and the memoirs A Good Enough Daughter and Drinking the Rain, characterizes the stories as \"alternately, and sometimes simultaneously, gripping, poignant, sly, funny, disturbing, surprising, brave, and always illuminating.\"Koppelman provides a comprehensive introduction that draws connections between the social and political history of the United States since 1839 and the prevalence, during that same period, of stories about battering and resistance. She analyzes the achievements of the authors and of the individual stories, and she offers the hope that the anthology will enable women to feel less isolated and more capable of getting out of bad situations sooner.She also provides an extensive collection of epigraphs that frame the stories in the larger context of women's rights and feminist principles. One example: \"Not until the women's liberation movement of the 1970s was it recognized that the most common post-traumatic disorders are those not of men in war but of women in civilian life. -- Judith Lewis Herman, Trauma and Recovery.\"Readers who know the look and feel of a well-made book will appreciate the quality of this one. Koppelman devotes four full pages to thanking the vast network of writers, scholars, and women's advocates that she consulted in preparing it for publication. As you might expect of someone whose concerns are as scholarly as they are literary, she lists complete credits and sources at the back of the book. In a powerful afterword, she describes her work on the book and ends with this impassioned call for action: \"WE MUST INTERVENE! WE CAN MAKE IT STOP.\"",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Story-telling has always been one of the best ways to transmit knowledge, and this book illustrates that concept. The stories show the dynamics of battering and resistance in a way hundreds of pages of statistics couldn't possibly match. They engage the reader, and make the reader feel a connection with the women in the book. Reading this book gilves not only an intellectual understanding, but an emotional connection: not ust the head, but the heart and the gut.Each story is carefully chosen and the book as a whole is worth reading for itself. It also makes an excellent textbook, but I'd say \"get this book, read this book, tell others to read this book.\"Wo;men in the Trees will make you think, make you feel, and make you take action. Get one for yourself, and get one for your local library today.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "let me tell you where ive been new writing by women of the iranian diaspora",
        "description": "Until recently, Iranian literature has overwhelmingly been the domain of men. But the new hybrid culture of diaspora Iranians has produced a prolific literature by women that reflects a unique perspective and voice. Let Me Tell You Where I've Been is an extensive collection of poetry, fiction, and nonfiction by women whose lives have been shaped and influenced by Iran's recent history, exile, immigration and the formation of new cultural identities in the United States and Europe. These writings represent an emerging and multi-cultural female sensibility. Unlike many flat media portrayals of Iranian women-as veiled, silenced-these writers offer a complex literary view of Iranian culture and its influences. These writers interrogate, challenge, and re-define notions of home and language and their work offers readers an experience of Iranian diaspora culture. Featuring over one hundred selections (two-thirds of which have never been published before) by more than fifty contributors--including such well-known writers as Gelareh Asayesh, Tara Bahrampour, Firoozeh Dumas, Roya Hakakian and Mimi Khalvati--the collection represents a substantial diversity of voices in this multicultural community. Divided into six sections, the book's themes of exile, family, culture resistance, and love, create a rich and textured view of the Iranian diaspora. The poems, short stories, and essays are suggestive of an important conversation about Iran, Iranian culture, the Persian and English languages, and the dual identities of many of its authors. This powerful collection is a tribute to the wisdom, insight, and sensitivity of women attempting to invent and articulate a literature of in-betweenness.",
        "authors": "['Persis M. Karim']",
        "infoLink": "http://books.google.com/books?id=wTv6wAEACAAJ&dq=Let+Me+Tell+You+Where+I%27ve+Been:+New+Writing+by+Women+of+the+Iranian+Diaspora&hl=&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Persis Karim has embraced a remarkable collection of work by mostly recreational writers and new poets in this book that is significant in a number of aspects. It is a testimony to the incredible spirit of all women, by exploring the journey most of these authors have taken while their immediate surrounding was experiencing significant turmoil and destruction. A voyage that was carried despite significant prejudice and eradication of an assortment of their basic rights. It is also a narrative of the immigration experience, being subjected to intolerance and narrow-mindedness on a different level and yet succeeding despite the odds. These incredible women are telling their story and the story of all of us who experience conflict, affection, separation, contradictions and intolerance, while struggling to maintain a conventional existence. A lesson for all of us in improved comprehension of one-another and recognizing the value of our differences. Highly recommended!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "\"Let Me Tell You Where I've Been: Let Me Tell You Where I've Been: New Writing By Women of the Iranian Diaspora\" is a totally new first anthology of writing by women of the Iranian diaspora. Revealing unique outlooks in a formerly male dominated, patriarchal literary tradition, these vivid works of poetry, fiction and nonfiction give authentic artistic voice to the silence of the veil stereotype frequently perceived by the West. Over one hundred selections are presented by more than fifty authors, some famous and some unknown. Two thirds of the works are previously unpublished. The authors selected are a diverse group who represent a cross section, or a complex community of intelligent, sensitive, articulate women in a rapidly changing world. The voices of these writers have been named \"Allegories of our enriched nation... the real thing,\" by Zohreh T. Sullivan, author of \"Exiled Memories: Stories of the Iranian Diaspora.\" A list of the contributors include Tara Bahrampour, Susan Atefat-Peckham, Firoozeh Dumas, Farnoosh Moshiri, Azadeh Moaveni, and other less familiar writers such as Leyla Momeny, Gelareh Asayesh, Niloofar Kalaam, and Farnaz Fatemi. Certainly many kudos are owed to Professor Persis Karim, teacher of English and comparative literature at San Jose State University, for amassing this wondrous, stunning collection. The selections are organized by theme into six different main areas: Home Stories, For Tradition, Woman's Duty, Axis of Evil, Beyond, and Tales Left Untold Subjects include differentiating dual and multi-cultural identities, sexuality, love, traditional expectation and its failure, politics, gender, blood and suffering, and the desperate poignancy of silence. There is so much to absorb in this collection, it is so very rich. It is certainly a fragrant beginning to enable Western to grasp the barest outlines of the complexity and courage of these women and their worlds and cultures. It is impossible to read any part of this book and come away unchanged. \"But she wants to step into/the whiteness of this inferno/and search Madison/for someone in his life/with the power to change him:/daughter, father, wife./She would become that person/undress him in the daytime/stand naked in front of him./say, look at what we've wrapped in./See this soft scraped creamy dark thing? It/s life.\" Farnaz Fatemi (p. 240)",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is a wonderful collection of poems and short stories by Iranian women. The variety of authors makes this an interesting collection and it is also enjoyable to read the short biographies of the authors. This is a book you can easily read from cover to cover or pick up and read a few selections at a time from anywhere in the book. This isn't a book only for Iranians, it is for anyone wanting to be immersed in well-told stories and conveyance of emotions and life's happenings.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "helpmates harlots and heroes womens stories in the hebrew bible",
        "description": "This best-selling book, now revised and updated, shares the work of many feminist biblical scholars who have examined women's stories for several years. These stories are powerful accounts of women in the Old Testament--stories that have profoundly affected how women understand themselves as well as men's perception of them. Here, Alice Bellis shares the research of feminist biblical scholarship during a quarter of a century, which renders a vast amount of refreshing, exciting, sometimes disturbing material.",
        "authors": "['Alice Ogden Bellis']",
        "infoLink": "http://books.google.com/books?id=XMfowAEACAAJ&dq=Helpmates,+Harlots,+and+Heroes:+Women%27s+Stories+in+the+Hebrew+Bible&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "This book offers a comprehensive look at various modern interpretations of familiar biblical stories about women in the Old Testament. The distinguished author provides a helpful orientation to the diverstiy of methods of feminist interpretations applied to each biblical story. These interpretations directly oppose many of the standard explanation of these stories, so the insights gained by the reader are many and fresh. The book is excellent for lay readers wanting a feminist approach to the biblical stories of the Old Testament and for college and seminary students who need scholarly details. The book uses a balanced mix of a conversational style and scholarly methods to make it equally accessible to students, teachers, and general readers. I highly recommend it",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book was invaluable as a guide and resource for conducting the Women in the Bible Study group I'm currently leading. While somewhat academic, it provides various opinions and indepth information on the Women in the Hebrew Bible. I am indebted to Alice Ogden Bellis' fine work and applaud her effort to reclaim what we can about our foremothers. The bibliography is an additional treasure!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "\"Feminism\" and its sister philosophy \"womanism\" are the main subjects of this new book by Alice Bellis. Not so oddly, it is an excellent critique of the problems that faced women of yesteryear. Better yet, it addresses the adjustments, both good and bad, that challenged women in the early days of seeking for equal rights and the challenges facing women tomorrow as they now find a world that has embraced many, but not all of the indictments that feminism avowed.It is these adjustments that the author speaks of in her piercing analysis of the woman's movement.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "ripe fruit erotica for wellseasoned lovers",
        "description": "Sex often grows hotter for women over 50, as life-experience and self-awareness triumph over youthful inhibitions, but though 78 million baby-boomers are now turning 50, there are no other erotic fiction collections written by and for mature women. In 'Ripe Fruit', 20 steamy stories celebrate mature women's sexuality in all its fullness and variety. Among the pieces are stories about a mother who sleeps with her daughter's young lover; a three-way as a 30th anniversary gift; and a long-term black lesbian couple rediscovering their youth through sex.",
        "authors": "['Marcy Sheiner']",
        "infoLink": "http://books.google.com/books?id=dO5ZAAAAMAAJ&dq=Ripe+Fruit:+Erotica+for+Well-Seasoned+Lovers&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Some of us are tired of women the age of Britney Spears and Jennifer Love Hewitt being epitomized as the ideal for female sexuality. Wait until you meet the women in this collection, then it's \"Britney who?\" Whether you're an older women; in love with an older women; want to be an older woman; or are dying to have an older woman, there's a story in this collection for you--salacious, emotional, funny. The table of contents reads like a whose-who in erotica: rising talents and established favorites. Anything Marcy Sheiner puts together is top notch. KUDOS!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This erotica was just ok. I was expecting more stories of well-seasoned lovers of the opposite sex not same sex stories. There are some good one's in the book but not enough to really call this book great. I was disappointed.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "best womens erotica 2006",
        "description": "Sexy, smart and literate... Best Women's Erotica 2006 delivers the year's hottest bedside reading. Under the stylish editorship of Violet Blue, Best Women's Erotica 2006 offers risky, authentic stories that linger in memory like slippery, hot afternoon sex. Sydney Beier's \"\"Reading to Horst\"\" is a paean to possibility: an American woman living in Germany has a languorous encounter with a tourist who asks her to read aloud to him from Anas Nin's Little Birds. In Alison Tyler's \"\"Four on the Floor,\"\" a pair of lovers hunt for and conquer other couples. And Elizabeth Coldwell's \"\"Heat\"\" describes the fierce affair between a barmaid and her brutish temporary boss: a man she doesn't even like but who sets her heart pounding.",
        "authors": "['Violet Blue']",
        "infoLink": "http://books.google.com/books?id=L00otfBRga4C&dq=Best+Women%27s+Erotica+2006&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Normally when I find erotica \"by women for women\" I find it to be a bit cheesy, but this collection is superb. This book does not depict its heroines as meek women who want a lovey dovey relationship with their sexual partners. Rather, the stories in this collection depict women as ravenous sexual beasts, intent on devouring her lust interest du jour. These heroines are real, these heroines are hungry, and these heroines are horny. A perfect read for sexually hungry veterans or beginners testing the waters of literotica.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "Is it hot in here, or what?? Loved this collection of naughty provocative stories. When does the next one come out?",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "The writing is excellent. This is not a substandard book intended strictly to make a lot of money off people looking for cheap thrills while shopping at the grocery store. The variety of stories is also good.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Best Women's Erotica 2006 is enjoyable - it has a nice variety of scenarios and nothing too freaky.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "The book is by women and for women and it opens with editor Violet Blue's admonition for it \"to be read nice and slow, like a slippery hot afternoon f--\" well you get the picture. That's a magnificently straightforward intro, honest, and to the point, with no euphemism or hollow propriety. I, as a 40-something guy who enjoys the occasional collection of adult fiction, found it fun, most definitely coming from a female point of view. I had to wonder if this content was providing what was expected, or if this is really how women think. In the end, I really have no idea.As a guy, I expected stories of female power and strength, of tables turned on traditional sexual roles and expectations, featuring empowered and deliberate women. I expected the women to be demanding and straightforward, completely in control, knowing what they wanted, when and how they wanted it, with no vacillation. I didn't expect raging butch--well, I did expect some, and you get enough--but I was surprised by what to my reading was a preponderance of women sure of what they wanted but not spelling it out, willing to be the bottom, willing to give up control and direction for the sake of becoming a sexual object. I guess one could argue that behind this is a true position of power, realizing one's value and power in the sexual context, deciding to be taken and then allowing it to take place. Being conscious of this as I read, I really didn't see this come out in most of the stories. I saw women who like it hard and rough, who are just as randy and ready as men; maybe in the end this really is the attitude I expected, just presented in an unexpected manner.So, if you like stories of the torrid takeover, the struggle and surrender, the drippy-quiet longing at last requited fast and hard, then many of these stories will work for you.Coffee figures often, as does leather, and spices. Clothing gets a lot of descriptive attention, as do interiors. There's a lot of sensuousness in these stories, attention to tactile and other sensory experiences. Scent plays a major role, with characters remembering smells distinctly, or being immediately drawn in by a scent. This seems to me to be a uniquely feminine perspective, and for the men reading and paying attention, is highly instructive.One can't help but notice that most of the adult fiction in the US comes out of San Francisco, and this Cleis Press release is no different. The author bios at the back show a range of author locations, from Canada to Maryland, Seattle and the UK. But, it struck me that a great many of these stories are set in the UK, and are written using British English. The use of \"arse\" and \"wanking\" are dead giveaways, as well as references to UK locations, motorways, etc. I tip my brimming pint of Guinness to Elizabeth Coldwell and her story \"Heat\" for including a line about a new boyfriend, who is \"a burly prop forward for the local rugby team.\" Good on ya, Lizzie; every woman should date a rugby player. I have to interpret these British settings as a deliberate editorial decision. Maybe I'm reading too much into this, but it strikes me these settings are--yes, this is sexist--an unfortunately stereotypically female contrivance to situate the action in a place exotic yet still familiar and therefore safe. There are no stories featuring Macao or Sao Paolo; everyone speaks English, and I'm hearing most of it with delightfully sexy British accents.Ah, yes, \"wanking.\" This seemed to be a favourite term of many of the authors, with one story in particular featuring it on almost every page and even three times in the space of two paragraphs. In my mind, I conjure this term as a distinctly male undertaking, if anything for its onomatopoeic qualities. Maybe this is part of the authors' plan, reclaiming the term for ladies as well, as the stories more than amply demonstrate.The stories are all enjoyable. I enjoyed the opener, a story of an artist's model asked and then forced to do quite a bit for the sake of the \"art,\" and who takes it all and wants more. There is more than enough power play, some light femdom, a threesome or two, and a few interesting stories which take full advantage of the myriad erotic opportunities afforded by today's instant communications and the Internet. Good stuff, all.Thankfully, and wonderfully different than most of the adult fiction I've read lately, I noticed only a few editorial oversights, most of them in technical edit and not content. There was a line about walking \"in synchronicity,\" of which I'm sure Jung would be proud, but which doesn't describe walking in step. There was a line about fixing drinks with \"Kettle One,\" when it's Ketel One which is the trendy alcohol. There is a line about \"serpentine black leather pants,\" which conjured an interesting mental picture of black leather pants that just went on and on, twisting and curving and undulating, when I think the author was trying to communicate that the pants either fit like a serpent's skin, or that they were embellished with a serpent design. I'm just niggling here; given the horrible technical and content editing I've seen in other books, this was truly minor stuff.All in all, the 20 stories go quickly, all of them thoroughly enjoyable. None are bad or were a turn-off. All were entertaining, some much more than others; that's owing to personal taste, really. It's a well done book, worth the purchase price and worth the time to read, singly or with an acquaintance you might want to get to know a little better.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "what happened to you writing by disabled women",
        "description": "A collection of fiction, essays, and poetry by physically handicapped women relates their varied experiences and struggle to overcome prejudice and achieve independence",
        "authors": "['Lois Keith']",
        "infoLink": "http://books.google.com/books?id=zYFWHQAACAAJ&dq=%27What+Happened+to+You%3F%27:+Writing+by+Disabled+Women&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you are a woman with a disability, know a woman with a disability, or care about women with disabilities, this is a must read. Out of all of the anthologies written by women, this is the most accessible. If you are looking for a gift for someone you love, don't pass it up.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I loved this book so much. I thought it was so wonderful that it was inclusive of women from many different cultural backgrounds and with many different disabilities. I was especially appreciative that they included mental illness in this book &quot;Agorophobia:letting go,&quot; by Pam Mason, because so many times it is brushed off and blamed on the victim. I would highly recommend this book to any woman who knows what its like to go through lifes ups and downs.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "woman hollering creek and other stories",
        "description": "A collection of stories by Sandra Cisneros, the winner of the 2019 PEN/Nabokov Award for Achievement in International Literature. The lovingly drawn characters of these stories give voice to the vibrant and varied life on both sides of the Mexican border with tales of pure discovery, filled with moments of infinite and intimate wisdom.",
        "authors": "['Sandra Cisneros']",
        "infoLink": "https://play.google.com/store/books/details?id=UqSZrvPL1DQC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Sandra Cisneros, the author of &quot;Woman Hollering Creek&quot; gives us a vibrant variety of stories which reveals some of the strength, true love, and wisdom within women. Cisneros, as a gifted writer and a storyteller, shares stories filled with moments of pain and joy. Women Hollering Creek, offers the life experiences of women who have lived both the Mexican and American life. These delicious, poetic stories bring alive beautiful characters (multifaceted women) who experience true life situations. Each character portrayed in this book, go throughout a catharsis full of pain, anguish, love, hope, and ecstasy. Cisneros is a brave author who shows a unique vision of a women's heart. Her wise work constructed by her poetic style, shows her power as a woman and a writer. In this book, she takes you down a river of sadness, with a long ribbon of laughter. An example of her style is this passage that captivated me, &quot;Your eyes are beautiful, you said. You said they were the darkest eyes you'd ever seen and kissed each one as if they were capable of miracles. And after you left, I wanted to scoop them out with a spoon, place them on a plate under these blue blue skies, food for the blackbirds.&quot; It is very fortunate that I read this book, because it has given me so much inspiration. Cisneros as a Latina women, has inspired me (another Latino) to continue on my long journey of becoming a writer. Her beautiful prose gives the reader a sense of the world she brings alive. For example, &quot;The laughing sound of the river and canals, and the high melancholy voice of the wind and the branches of the tall pine.&quot; I suggest that every writer should read this book. Another reason why I recommend this book is because it has shown me the astonishing perspective of a woman which no matter what, a man can not have. Me, as a man, would never experience what a women experiences. This book is very valuable to me, since it provides the opportunity to see the inner beauty and strength of a Latina women. A third reason why I recommend this book, is because it invites you to imagine and taste the Mexican culture through a woman's eyes. Woman Hollering Creek, served me especially and can be a great resource for others to learn about Mexican lifestyle. This book informed me more about that romantic, joyful, and traditional Mexican life. The rating I give this book is a ten, because it has helped me understand where women are coming from a little better. I have gained more respect for women who are writers because she gives her heart to her readers.",
                "review/helpfulness": "40/43",
                "num_reviews": 43
            },
            {
                "review/text": "This is the book which made me a feminist during my undergraduate years, and on which I subsequently wrote my senior English thesis. No author of short stories can turn a phrase the way Cisneros can, and her poetic evocations of different stages of life from young girl to mature young woman shed a multi-faceted light on Hispanic women's experiences in which every paragraph becomes thought-provoking.In addition, read as a whole thematically, this anthology can be seen as similar to the sort of artistic coming-of-age novels such as Hermann Hesse's Peter Camenzind. The key turning point in this development may be the story &quot;Little Miracles, Kept Promises,&quot; which is a series of letters left at the shrine of La Virgin de Guadelupe. This reveals the many layers of the shrine, which is the site of an old Aztec goddess with whom Cisneros identified, and who allows for a new revelation of feminine power in the Mexican heritage which comes out for the rest of the work.However you choose to read it, this is a collection which will both delight and challenge all who come prepared.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Women Hollering Creek and other stories by author Sandra Cisneros, is written into different perpectives of everything that happens in life. Perspectives such as love, sex, adultry, abuse, forced marraige and war,etc. All the perpectives are told in a most honest and relistic tone making you want to read more. The most interesting thing about is that it's not just written with one woman's perpective like most books, but through many women young and old. I've read others an so far to me this is the best. I would request this book to anyone who likes to read women's persective in life.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "It was in 7th grade when I was first introduced to the House on Mango Street. Thanks to my teacher Ms. Henning, I have become an avid reader of Ms. Cisneros and other great writers such as Elena Poniatowska (one of Sandra's favorites), Julia &Aacute;lvarez, and Gabriel Garc&iacute;a M&aacute;rquez.When I was a freshman in high school, Caramelo had been released and I read it in a matter of three days. The only book left to read of Cisneros was Woman Hollering Creek.This year, things changed. I spent my summer at Harvard University where I took two courses. Mexican Literature and Fiction Writing. While at Harvard, one of my favorite things to do was to walk into the Harvard Book Store, go downstairs to the USED book section and search through the bookshelves. Eventually, that day I purchased the House of Spirits by Isabel Allende (because no one can believe that I haven't read it), Go Tell it to the Mountain by James Baldwin, Sula by Toni Morrison, and last but not least, Woman Hollering Creek by Sandra Cisneros.Since the East Coast consists of very small states, I visited a couple of schools including Boston U., Tufts, Brown, Amherst, Dartmouth, NYU, and Columbia. My trip to Columbia had to be the most fun of all. Me, and two friends, one from L.A. and the other from Chicago all took books for the bus trip. I remember my friend from L.A. was reading Beloved by Toni Morrison, the other was reading a book that was assigned by her Psychology professor (BORING), and I was reading Woman Hollering Creek. By the time we got to New York City I was finished with the book. I liked it so much that when I went back to Harvard I requested my favorite story \"Mericans\" to be read in class and afterwards we had a discussion.Because of Sandra, I am now a writer and I admire her for getting so far. If you have read The House on Mango Street, you have an idea of the type of neighborhood Sandra lived in. Well that's the exact same neighborhood in which I have been living all my life. Most of the adolescents living in this neighborhood are seen as students who are incapable of having a good future, but Sandra has proved that wrong. Now, she is internationally well known and has been my motivation throughout the past years.Earlier this year, I had to opportunity to meet her in person, and said that she was working on a book right now. I have no other option than to wait.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "Woman Hollering Creek is a powerful collection of short stories from Sandra Cisneros. One of the main strengths of her writing is her ability to make her characters (especially her first person narrators) very accessable. She is able to get into the minds of, and portray, many of her characters in a very lifelike way. She seems especially adept at dealing with the children in her stories. For instance, the story &quot;Eleven&quot; (one of the many gems in this collection) is the account of a little girl on her eleventh birthday. It deals with helplessness of a child in the face of an authoritive adult. It also looks at a childs preoccupation with the opinion of his/her peers. Cisneros manages the tale in such a way that it seems inevitable that the reader will identify with the girl. That, in itself, is a sort of mastery of craft.These stories range from impressionistic, two-page shorts that read like poems, to longer, more detailed accounts of relationships. As with any collection of short stories, there are those that are more successful than others (in other words those that you'll relate to better than others). However, all of the tales have a sort of vivid life to them; and, in all, I think that this is a very well rounded collection.Perhaps the only real point of difficulty that readers may face in this collection is Cisneros' use of spanish phrases throughout the book. However, don't let such things discourage you. Many of these phrases can be understood within the context in which they are written (so they aren't too much of a stumbling block). Also, these stories are too good to let a few words discourage you from reading this book. I would recomend this book to anybody who is interested in the struggles of childhood (especially that of minority children), as well as the pains and pleasures of intimate relationships. I would also recomend this book to lovers of good, colorful short stories.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I'll echo other Amazon reviewers in saying that Cisneros has a truly unique voice. Even when her ultimate point is to say things that we've heard over and over again (and often need to hear even more), she conveys her message by saying old things in unique, truly striking ways. Cisneros actually finds images that have never been used before (\"houses the color of bad weather\"), and even in in the weaker stories, there is always this pure voice that is a constant joy to encounter.The stories themselves vary widely in style. There are the short, impressionistic, plotless, poetic ones (that are sometimes my favorites) like \"Eleven,\" \"Salvador Late or Early,\" and \"Tin Tan Tan.\" Then, there are the longer ones that draw so strongly on the author's heritage. The title story and in \"Little Miracles, Kept Promises\" are particularly strong.Overall, this is well worth a read. As the other reviewers suggest, it may be of most interest to those drawn to feminist writing and to Chicana writings, but those readers are, by no means, the only ones who can enjoy this. The stories of Woman Hollering Creek should also be of interest to those who simply love good writing.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Este libro is something that I could personally relate to. Me gusto como mensionaba las telenovelas, los artists latinos, the saints and religion, y todo de la vida Mexicana. Even though the book got a bit disturbing and graphic at times, es unos de los mejores libros que e leido. Sandra Cisneros ase un gran trabajo in this book, it is so much fun to read y dificil to put down. Se lo recomiendo a todo mundo! Tan tan!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "As usual, great, great work from Sandra Cisneros. She has such a unique voice and style and through her myriad narrators, this short story collection lays bare the realities of those who are oppressed and victimized. Many of the narrators are double minorities and the issues span from identity crises and gender bias, to patriarchal violence and class stratification. Cisneros has a way of using a conversational and seemingly simplistic (and often times childlike) voice to expose the very troubling and complex issues that occur to those who are caught between a rock and a hard place.Cisneros is among the very best in Chicana/o literature. She is brutally honest and not afraid to deal with the ugly side of stark reality. Often times funny, and always moving, this collection is highly recommended to all.Also recommended: The House On Mango Street",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Cisneros brilliantly explores the longings of girls and women in this deeply compassionate work. Each story gives the reader an opportunity to explore her experience of womanhood as well as insight into the experiences we all share. Her poetic and richly flavorful style reads like a song. -Kaya McLaren, author of Church of the Dog",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I attended a literature class during the spring semester of 2005. Two short stories from this book were included in my class. Sandra Cisneros writes from the heart. She addresses the issue of domestic violence in the short story, \"Woman Hollering Creek.\" The short story, \"Eleven,\" is about a young girl on her 11th birthday, and how this young girl remembers what it was like to experience behaviors from most of those 11 years.We live in a country that contains a richness of cultural diversity, and has been built on that concept. I'm seriously concerned about the comments of the previous reviewer,\"alphazion.\" I'm also concerned about the user name as it appears to be racist in nature. The quote selected by this individual, could imply that Ms. Cisneros approves of terrorism!I throughly enjoy the literature of Ms. Cisneros. She also is the reader for her audiobooks, and to experience being read to by her is something that will remain with the listener for a very long time. I applaud her contributions to the literary field. In addition to her wonderful writing, she is also an excellent teacher and lecturer.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "women who run with the wolves myths and stories of the wild woman archetype",
        "description": "A Jungian analyst explores the feminine psyche through stories of \"wild women\"--the mythological archetype of the strong, primitive woman",
        "authors": "['Clarissa Pinkola Estés']",
        "infoLink": "http://books.google.nl/books?id=TwrR-BPlfekC&dq=Women+Who+Run+With+the+Wolves:+Myths+and+Stories+of+the+Wild+Woman+Archetype&hl=&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": 38.0,
        "review": [
            {
                "review/text": "Reading the other customer reviews, I find it very interesting to see how different they are, and how different many of them are from my experience.I was surprised to read the review on this page by the woman who believes we ought to read Jung first (or instead). My experience is the opposite; when I've picked up Jung's original works I've found them tough to follow, but this book I found very accessible and useful. I don't think the comparison between the Bible and a tv evangelist is at all fair. It's more like the difference between Strunk &amp; White and the Oxford English Dictionary. The OED is wonderful, but Strunk &amp; White is the one that is most likely to help you become a better writer.Although I think of myself as a creative person, I tend to downplay that part of myself and to lead with my left brain, as it were. Reading this book I felt like I was being given a path to my inner wellspring. I felt that I had at last found water for a thirst I hadn't quite been able to identify until now.This book is about one's inner life. It is not a how-to book, it's not political (except in the sense that the personal is political), and I didn't feel that it over-emphasized &quot;what's wrong with you,&quot; as another reader put it. It does continually nudge one to think about what might be wrong: many many women are cut off from their own preferences, their own inner selves, because they feel pressured to conform with societal norms. Many societal norms are, in my opinion, quite damaging and inappropriate. It is very easy in American society to get the impression that women should be seen and not heard. Women are still encouraged to focus on how we look, to be compliant, to act ladylike and be nice even when we are being denigrated, and to stand by our man no matter what. We are encouraged to help others at the expense of our own happiness, and many many of us fall into this trap without even realizing it. We think it is normal to put ourselves last, and we lose touch with the shames and the fears that keep us from being happy, wiping the subject of happiness off the table with a dismissive hand as something that is too indulgent or not important.This book helped me realize the ways in which I stand in my own way, and it gave me courage and inspiration.The author is not only a Jungian analyst, but a storyteller. She is steeped in the traditions of storytelling from both the Latin and the Hungarian sides of her family, and I very much enjoyed the ways in which she uses this legacy of the storyteller as healer to make her points. I never thought of storytelling in this way before, but reading this book I found it to be true. (I feel that her stories have helped heal me.) I am a storyteller myself, of a sort, so for me the book was a kind of homecoming. If you have ever wondered why fairy tales seem so cruel and peculiar, you will find the answers in this book. Fairy tales have been mangled in the translation, but this author shows you where they came from and what they are really about.While I am a huge believer in free-market capitalism, growth, business, and civilization (as opposed to back-to-nature Green-ery), I have tremendous concerns about the increasingly violent and impersonal nature of our society. This book shows you how to cultivate a healing, loving attitude toward the world without becoming a doormat--quite the contrary, it shows how love can give you more strength and power than you'll ever find in a boardroom.Another review on this page criticized the book for not putting these issues into a broader context of one's life. It took twenty years for this author to distill her wisdom of storytelling and her knowledge of Jungian archetypes into this lovely, readable book. For me, that's quite an accomplishment. I'm more than willing to take it the rest of the way myself.",
                "review/helpfulness": "380/389",
                "num_reviews": 389
            },
            {
                "review/text": "I read this book hoping to gain some new insights on gender study. I can only say I see clearly now where feminism went bad.I will not deny that there may indeed be a Wild Woman in every female, but to dedicate one's mental health to that one archetype would be akin to saying that in every man is solely a Warrior archetype. Such a theory followed through would result in very one-sided males, brutish and without self-control. The same is true of a Wild Woman without acknowledgement of the other aspects of herself in balance to guide the Wild Woman's energies. This is not addressed in Estes' book. According to Estes, a woman's highest obligation is to paying homage to the Wild Woman within. She holds that a woman has no responsibility to anyone else, to her community, to her family, and certainly none to men. It is the quintessential &quot;me generation&quot; book for women. I read this directly after reading &quot;Iron John&quot; by Robert Bly. In contrast, Bly integrates the mental health of the individual, even paying homage to the &quot;Wild Man&quot; within, while still promoting responsibility to others.In short, if you want a book that idealizes women and disavows them of any self-control, this for you. If you want something that will empower women in the modern world, search elsewhere. At the very least, if you *must* read this book, be familiar with the concept of archetypes as presented by CG Jung, who Estes is basing her theories on...Like reading the Bible before you listen to the speech of an evangelical TV minister, it helps to know the original to understand how it is being twisted for personal gain.",
                "review/helpfulness": "69/111",
                "num_reviews": 111
            },
            {
                "review/text": "Since this book was first published in 1992, I have made it my New Year's resolution to re-read Women Who Run with the Wolves every year. I have given more copies of this book away than I can remember - and I am thrilled to do so. I begin again in 2006 for the 15th full reading (though I pick a page throughout the year to journal with and 'wake me up'.)To begin the wondrous journey of discovery to my wild and intutive self is a gift and a new journey to uncovering the jewel within. New depths of power are accessed with every reading and I am bathed in feminine myth and mystery. This book has inspired me to design, write, accomplish and accept fulfillment at so many levels. Please read this book. Women Who Run with the Wolves is a MUST tool for every female. It's a treasure. Elaine Maginn Sonne, PhD, Author Legends of the Stones.",
                "review/helpfulness": "83/87",
                "num_reviews": 87
            },
            {
                "review/text": "Ancient cultures the world over have all had oral traditions as the roots of their literature, both for the purposes of education and entertainment.In the darkness by the fireside, story-tellers enthralled their fellow tribesmen with tales handed down through countless generations and centuries.What determines which stories are told and re-told on through the ages? Usually, they are tales which illustrate a moral value, a particular quality or a lesson that a particular society deems important. Whether it be a cautionary tale or a legend demonstrating a virtue, we get great insights into what is valued by examining the old, old stories.Until recent years with the advent of Women's Studies on university campuses, the teachings imparted to one's daughters and grandaughters were often overlooked. That glaring omission has been rectified through Clarissa Pinkola Estes' incredible book.&quot;Women Who Run With the Wolves&quot; is not light reading by any means, but is a scholarly exploration of the feminine character. Has civilization tried to strangle our basic &quot;Wild Woman&quot; inner natures? And, if so, at what cost has the shrew been tamed?&quot;Women Who Run With the Wolves&quot; contains some familiar stories from our collective childhoods: The Little Match Girl and Bluebeard. But these are not the soothing, toned-down versions to read by your toddlers' bedsides. Instead, they are terrifying and real.Estes, who is both a Jungian analyst/psychologist and professional storyteller, vividly recounts the visceral details of often violent folklore.Not only are European nursery tales included, but the book is global in scope. Estes also weaves in less familiar traditions, such as stories from the Lakota Indians. The one element running through all the stories is how they relate to women's lives and spirits.In each section, the author gives a scholarly overview of why the tale was told, what values it imparted, and why the story still speaks to us today. She also recounts the story with great dramatic narrative, and it is easy to imagine oneself listening to the tale around a flickering campfire late at night.Ancient wisdom coupled with modern psychological insights make reading this book a mind-expanding experience.",
                "review/helpfulness": "63/67",
                "num_reviews": 67
            },
            {
                "review/text": "This book is so different, so astounding, that it defies catagorization. The concept of analyzing ancient legends and folk tales to reveal the inner nature of women and the patterns in womens' lives felt revolutionary to me when I first sat down with this book. But then, as I read each segment and digested the author's analysis and correlation with typical life patterns experienced by women, I realized that she tapped into truths which are as ancient as the folk tales and legends themselves. Besides that, she is one of the most ELOQUENT writers I've ever had the pleasure to read. Her observations and their resulting lessons are so profound, so insightful they take my breath away at times. I just have to sit back, take a deep breath, shake my head and reread the section that just overwhelmed me.My favorites are \"Skeleton Woman\" and \"Baubo the Belly Goddess\". I don't want to give away any surprises... so just get this wonderful book and read these chapters for yourself! I've read it straight through, and then gone back to re-experience my favorite chapters. This book can be enjoyed either way! I would so love to meet this woman at a booksigning.",
                "review/helpfulness": "45/47",
                "num_reviews": 47
            },
            {
                "review/text": "When I see young women who don't trust their gut feelings, who don't envision their full potential, who allow abuse, who lack self-confidence, I WISH THEY WOULD READ \"Women Who Run With Wolves.\" This is not an \"easy read,\" but DO READ IT and become a powerful woman on the inside -- a woman whose soul is steady and strong -- a \"Wild Woman.\" The author of this book taught me the wisdom and lessons of ancient \"fairy tales.\" This author taught me to strengthen my core, my soul, trust my own wisdom, listen to myself and stand tall and firm and strong.This book helped me get over mistakes of the past, and prevent many future mistakes. Re-reading it always gives me strength and courage and builds my self-confidence.Also, today, as an \"Old Woman\" I cannot stand by and quietly watch young women lose their souls. I must \"teach\" in a quiet, kind, gentle way. And, recommend this book !! I hope you love it, as I did and do.",
                "review/helpfulness": "34/36",
                "num_reviews": 36
            },
            {
                "review/text": "I agree with the reviewer who said the book lacks practical advice, real applications to everyday life. I find Estes' connection of fairytales to the psyche intriguing and powerful, but something is lacking.An example: There is the story of the seal woman who skin is &quot;captured&quot; by a man, who is forced to marry him, and then eventually escapes back to the sea.Estes connects this story to loss of one's true self, and equates this with clients she's had who have experienced a major sense of theft in their lives, as in theft of opportunity, for example. She talks about visiting a prison and finding that nearly every woman she worked with had experienced a soul theft and was in the processing of reclaiming her true self. Powerful stuff.She promises through the subsequent tales to show how a woman can &quot;come home&quot;. I eagerly read through, but was disappointed to find that the advice boiled down to: read a favorite poem, sit in a favorite rocking chair. Advice that would work for healing everyday stress, but not for the kinds of &quot;soul-thefts&quot; she originally discussed. In other words, no meat.There is another problem as well, and that is the lack of feminist analysis of fairytales, which were often coded stories of oppression. The seal woman's marriage is a good example. She interprets this as the marriage of the soul to the practical everyday world. However, it also obviously speaks to another, more painful reality of women's lives: forced and/or abusive marriage. And the child who results, the &quot;soul-child&quot; is also the child who helps his mother escape and return to freedom. This consciousness is entirely lacking in her analysis, and helps crystalize what I feel is lacking in the book.",
                "review/helpfulness": "27/35",
                "num_reviews": 35
            },
            {
                "review/text": "Clarissa Pinkola Estes is a gifted storyteller--one who does not just love stories, but also recognizes their ability to stir the soul. She sees each story she shares as a cure for a spiritual deprivation, and so retells each one in her rich, soulful style, adding Latino ethnic twists to increase the illumination. Then, sounding like a village wise woman, she explains the effects of each type of deprivation in the souls and bodies of women. For instance, she interprets \"The Little Match Girl\" as a story about the necessity of putting one's creativity (represented by the matches) to good use: the failure to do so makes one freeze to death.Certainly, women need the sort of healing that stories can give them--but so does everyone in the world, male or female. Men just didn't happen to be part of Estes' \"target audience\" when she wrote \"Women Who Run with the Wolves\", I suppose. Yet it is precisely this book that encouraged me to read \"Jack and the Beanstalk\" and \"The Selfish Giant\" to my little brothers.The wondrous thing about this book is that it is only one person's opinion about the power of certain myths. Anyone is free to agree or disagree with Estes . . . to take or reject her advice . . . to give her chosen stories different meanings . . . to apply her meanings to different stories. For example, Estes used \"The Ugly Duckling\" to lament how a rigid, uncompromising society can oppress mothers into abandoning \"unconventional\" children. To that I add that if the ducklings had had a father duck around, then the ugly duckling would have had proper protection from the pond bullies and a lot more backbone.It is also delightful to recognize the archetypes playing hide-and-seek in the fairytales and myths of many cultures. Russia's \"Vasalisa\" is uncannily like \"Snow White\", except that the cottage in the woods houses a witch (Baba Yaga), rather than seven dwarves. Also, the colors white, red and ebony/black are not found in the features of the story's heroine, but are sewn into the dress of her doll. Then there are the striking similarities between \"Bluebeard\" and the Greek myth of Eros and Psyche. (Of course, the difference is that one ends happily and the other does not.)Finally, I love the way almost every sentence here rings with the kind of beauty and passion I have come to expect only in poetry, never in prose. For this reason, I can sit with this book and just dip into the paragraphs to be refreshed.The most potentially disturbing element in \"Women Who Run with the Wolves\" is Estes' firm faith in the Life/Death/Life cycle--something very pagan. If readers miss the point early in the book, all the references to long-gone goddess-based religions of the ancient world will certainly drive home the fact. Personally, I thought it less bothersome than all the psychological concepts she used--half of which I don't buy at all. I've found that it helps to remind oneself all throughout the story that even though Estes writes of something true and deep, it doesn't follow that all women must identify with wolves (I happen to relate to mice), or feel like wild women, in order to be healthy in spirit.",
                "review/helpfulness": "24/30",
                "num_reviews": 30
            },
            {
                "review/text": "Clarissa Pinkola Estes searched out the scorched and fragmented land of our psyches. She brought back the lost parts which would make us whole. This book will make you dream, and I mean dream! Men, women, gay, lesbian, married/single read then re-read this book. It's an oracle, a history/her-story book, and a manual for inter-personal relationship, among other things. Ms. Estes successfully wrote down the bones. The soul's infra-structure is found in this book. This book is a defragmentation device for your psyche. Each person I give this book to, starts to change--immediately. They spark up a new dialogue. Something wonderful and authentic happens all at once--and they grow. Join me in the inner adventure and trust that there is something wonderful inside of you waiting to be re-cog-nized and re-mem-bered. Clarissa will guide you as storyteller, cantadora, into the archetypes, and your soul may learn a new song. Mine did.",
                "review/helpfulness": "23/28",
                "num_reviews": 28
            },
            {
                "review/text": "This is one of my all time favorite books. I have underlined parts that made me say &quot;A-ha!&quot; out loud and the parts that made me question...parts that helped me work through things. There are also numerous notes in the margins. To say it's dog-eared would be an understatement...If you love myths and folklore this book is for you.If you feel lost this book is for you. If you are suffering from the too-nice syndrome this book is for you.This book will challenge you to let out the fierce creature that is inside. Do you dare?",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            }
        ]
    },
    {
        "Title": "crazy woman creek women rewrite the american west",
        "description": "A \"blessedly unromantic\" portrait of real women's lives in the contemporary American West (Kathleen Norris). This wide-ranging collection of essays and poetry reveals the day-to-day lives and experiences of a diverse collection of women in the western United States, from Buddhists in Nebraska to Hutterites in South Dakota to \"rodeo moms.\" A woman chooses horse work over housework; neighbors pull together to fight a raging wildfire; a woman rides a donkey across Colorado to raise money after the tragedy at Columbine. Women recall harmony found at a drugstore, at a powwow, in a sewing circle. Lively, heartfelt, urgent, enduring, Crazy Woman Creek celebrates community-connections built or strengthened by women that unveil a new West.",
        "authors": "['Linda M. Hasselstrom', 'Gaydell Collier', 'Nancy Curtis']",
        "infoLink": "https://play.google.com/store/books/details?id=INvgdK1Y3kwC&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "To be quite honest, the only reason I bought this book was because my friend's essay was in it. Wow! now I want to buy all of the books in this series of anthologies.These are true stories by our friends, neighbors, and people we probably don't much care for who live down the lane. And because these women so fearlessly let us into their lives, we are able to be part of that circle of comapssion and understanding that is what I believe is the true nature of humanity.Yeah I know, I'm making it sound like it's a bluepprint for world peace--but maybe it is!Anyway, these are stories(and poems) that will make you weep and laugh out loud --I would recommend it to any type ofwomen studies groups.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This anthology is a collection of essays and poems by women who live (or lived) in the American West, on their idea of what community means to them.Some of these women are professional writers, and some are previously unpublished writers, but some simply have a story to tell.And what stories! These women write in a straightforward and unpretentious manner about the women (and men) who lift them up, aggravate them, support them, teach them, and, more often than not, need their help in return. We hear stories of Native American healers, church groups serving funeral lunches, firefighters, book clubs, families, snow-shovel posses, and politics in the West.I feel like I want to give this book to all of my close women friends, whether they physically live in my community or not.The essays in this book will definitely make you think about your own connections to others, no matter what size town you call home. I highly recommend it, and cannot wait to get my hands on the other anthologies by these editors (Leaning into the Wind, and Woven on the Wind).",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "chocolate for a womans spirit 77 stories of inspiration to life your heart and sooth your soul",
        "description": "Take A Chocolate Break! Chocolate -- sweet, delectable, and rich -- is a feast for our senses and a treat for our souls. Now, indulge yourself in 77 brand-new \"chocolate stories,\" from the creator of the national bestsellers Chocolate for a Woman's Soul and Chocolate for a Woman's Heart. Kay Allenbaugh has gathered together a luscious mix of real-life stories by and for women that will inspire, delight, and empower you. Savor the everyday experiences and momentous adventures of women who tap into their intuition, listen to life's wake-up calls, overcome old fears, and discover the courage to start over. Like you, they juggle the roles of worker, wife, sister, mother, and friend. And like you, they face life's challenges and rejoice in its blessings as only women can -- with a sense of wonder, a sense of humor, and a sense of spirit!",
        "authors": "['Kay Allenbaugh']",
        "infoLink": "https://play.google.com/store/books/details?id=eTFzDtuVsigC&source=gbs_api",
        "categories": "['Self-Help']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Perhaps I was expecting too much, but I was disappointed in this book. There were definitely a few excellent stories in it, but it contained too many that seemed to be written by women who had messed up their lives and were trying to sugar -coat (or chocolate-coat) their mistakes, rather than amend them. Perhaps I was comparing it too much to an incredible book I finished recently, &quot;Small Miracles&quot; by Yitta Halberstam and Judith Leventhal. In that book, practically every story moved me deeply. However, much as I love chocolate, the &quot;Chocolate&quot; stories were a disappointment.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "The &quot;Chocolate&quot; books continue to be a delicious way to sit back and fill up with stories that delight and fulfill. I recognize myself and the women in my life in each of these delightful stories. What a treat to invite these wonderful women into my home like a cherished group of old friends! Like their namesake indulgence, these stories might not be the most &quot;sensible&quot; reading a girl could do, but they are certainly some of the most satisfying . . .Adrienne Wiley, editor of the upcoming book &quot;For This I Am Grateful&quot; from Everyday Wisdom Press.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "lesbian nuns breaking silence",
        "description": "Out of print for two decades, Lesbian Nuns: Breaking Silence, the explosive international best-seller, is back with a new foreword analyzing the unprecedented impact it had on the lesbian community and mainstream culture. In new afterwords, the co-editors reveal how the book came to be and what happened to their lives when, for the first time in history, a lesbian book from a small publisher went mainstream. Each nun in these stories describes her individual and searing path in, or out of, the convent to discover and face the truth of herself. Still myth-shattering, the stories remind us of the courage required to live-and love-in congruence with our authentic selves. \"Oblivious to the controversies that surrounded the initial publication of Lesbian Nuns: Breaking Silence, whether they originated within the Catholic Church or the lesbian feminist movement, thousands of readers across the decades have embraced the book and found their lives changed by its message of empowerment.\" - Joanne E. Passet, Ph.D., Professor of History, Indiana University East",
        "authors": "['Nancy Manahan', 'Rosemary Keefer Curb']",
        "infoLink": "http://books.google.nl/books?id=6fNYnQEACAAJ&dq=Lesbian+Nuns:+Breaking+Silence&hl=&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I have seen this book on countless discount tables. I finally bought it and read it. This is not a tell all for lesbian nuns who reveal their sexual escapades while cloistered in a convent. This is a collection of stories told by ex nuns about their short stay in convents all across America. It is their story. Their life. Each of these women left for various reasons and all are now fullfilled in their life on the outside as out lesbians. There is nothing cheekie about this book. It is well written and well told. I am glad I finally picked it up and actually read it.",
                "review/helpfulness": "48/55",
                "num_reviews": 55
            },
            {
                "review/text": "In this book we encounter the biographies and personal photos of numerous nuns or ex-nuns who have \"come out\" as lesbians. they talk about how they came into convent life, how they discovered their sexuality, and how that altered their religious life. Very fascinating study.David Rehakauthor of \"A Young Girl's Crimes\"",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "I felt compelled to write a review, especially after reading the review by [...]. I was shocked and horrified that she wrote the these women entered religious life for romantic reasons. If you read this book, you will realize the love and commitment these women carried in their hearts for God as they entered their vocations. I think it is sad that just because [...] didn't experience her religious experience like they did, she can't believe their stories. There are too many stories in this book to just write these women off. If anything I think it is a sad but accurate portrayal of how often institionalized religion hurts and controls the people it is called to love. I never aspired to be a nun, but I have experienced both goodness and harm done in the name of religion. This is a must read for critics of the Church who have issue with the religious right as well as the Catholic church. This is also a must read for women everywhere in regards to the effects of patriarchy in society.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is a stunning collection of beautifully written stories, of how women came to be themselves. Each of these women's journeys was at times painful, always heart wrenching, and always written in her individual voice. This anthology is not to be taken lightly. It is not filled with the lascivious sex that a teenage boy might think, but it is dozens of true stories of evolving women who come to learn who they are, and how they fit with their definition of God. An amazing collection of stories.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "hysterectomy the best or worst thing that ever happened to me a collection of womens personal experiences",
        "description": "\"This powerful, insightful book offers in-depth information about the benefits and risks of hysterectomies through the personal accounts of women who have undergone the procedure. Every year, one million women face the decision of whether to have a hysterectomy. Two-thirds of the women who elect to have the procedure are glad that they did. The other third, however, experience unexpected consequences, including changes in sexual desire. This book reveals the real stories behind what most physicians and their patients consider a simple surgical procedure. Women whose lives and families have been affected share their heartfelt stories so that other women facing similar decisions have all the facts they need.\"",
        "authors": "['Elizabeth L. Plourde']",
        "infoLink": "http://books.google.com/books?id=-wR2uFGcUb4C&dq=Hysterectomy%3F+The+Best+or+Worst+Thing+That+Ever+Happened+to+Me%3F:+A+Collection+of+Women%27s+Personal+Experiences&hl=&source=gbs_api",
        "categories": "['Health & Fitness']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Two years ago, I did not read hysterectomy stories. Friends told me not to read &quot;that stuff&quot;, since I was so strong, and mine would be a breeze. Much of medical literature even suggests that women who have problems post surgery are just &quot;problem women.&quot;Unfortunately, my surgery was not a breeze. Turns out a hysterectomy was actually counterindicated for my problems, the surgeon did not have the proper skills, and I am now faced with years of diminished quality of life and possible delicate restorative surgery which may or may not work.I don't think information or stories in this book are meant to &quot;scare&quot;, but to help women ask the right questions, demand proper care and assessment and make an informed decision. Good doctors welcome informed and inquisitive patients. I highly recommend this book to anyone contemplating hysterectomy.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I really liked this book. It was very interesting to read the different experiences of women who have had hysterectomies. It was great to see both sides of the coin and all those inbetween. I would urge anyone considering a hystectomy to read this book so you can see what some of the consequences might be and you can make an informed decision.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Useful information and a balance of opinions. This book contains more than women's emotional reactions to hysterectomy. Useful information about various methods of hysterectomy, including little-publicized side effects and risks, is contained in the stories. To get the full picture, you need to read all the stories. This book helped me come up with a list of questions for the doctor, and helped me decide on which type of hysterectomy. This book had little or no information about the newer all-laproscopic option for hysterectomy surgery.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "fearless women midlife portraits",
        "description": "Offers photographic portraits of fifty middle-aged female celebrities, musicians, and athletes, who discuss their experiences of aging and the increasing empowerment they have felt in their lives.",
        "authors": "['Nancy Alspaugh', 'Marilyn Kentz', 'Mary Ann Halpin']",
        "infoLink": "http://books.google.nl/books?id=qgYqPAAACAAJ&dq=Fearless+Women:+Midlife+Portraits&hl=&source=gbs_api",
        "categories": "['Body, Mind & Spirit']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "After looking at three of the photographs and reading the first page of the introduction, I immediately purchased three copies of this book - one for myself, and one for each of my sisters. Now halfway through looking at these amazing women and reading their inspiriational stories, I am empowered and inspired. Life is long, and the middle of it is fabulous! My first book was published when I was 53 and my next one is due out when, God willing, I will be 57. So take heart all you \"women of an age.\" The best is yet to come, as the authors of this book and the women in its pages will show you. You, too, can join this company in making this the most delightful time of your life! Give this book to every \"Boomer Babe\" you know.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "I purchased two copies of this book. The photographs are strong and captivating, followed by awe inspiring stories from a variety of backgrounds. It is a perfect gift for any woman in your life.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Wow! I just got it and this book is beautiful and what amazing women. I am so excited to buy this as gifts for my friends who are in that age range but also just my female friends who are making it up in this world like some of the women in the book. The photos are awesome and it is also inspirational to read each of their stories. Definitely one to keep out on the coffee table for when guests come over.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "This review comes from a post I made on 21 July 2005 on an actors' forum, in honor of one of the amazing, fearless women profiled in the book.I have a story to share.Yesterday, my husband came home with a stack of mail from our post office box. As usual, the stack was pretty thick and was mainly headshot submissions, postcards from actors, invitations to shows, and a few bills. :\\ At the bottom of the stack, however, there was a very thick express mail package. Heavy. Large. I know that Keith had to wait in a line to pick it up, as the post office would have put a yellow slip into our box so that we'd know we had something waiting.Filled with curiousity, I began opening the package. Inside the first envelope, there was a second. Inside the second, there was a third. My excitement was building. \"What *is* this?!?\" Couldn't wait to find out!Imagine my delight when I saw the gorgeous photograph on the cover of this book, immediately alerting me to the fact that the amazing Pamela Jansen had sent me a copy of \"Fearless Women: Midlife Portraits\" by Nancy Alspaugh and Marilyn Kentz, with photos by Mary Ann Halpin.First, the book is simply gorgeous. These women are, in fact, fearless and their portraits are breathtaking, their stories inspiring, and their courage outstanding. But what touched me the most is the letter Pamela wrote. I won't share it here, as it was personal and beautiful, but I have to let you know... I cried.I read the letter, I turned to Pamela's chapter, I read the inscription, and I cried some more.Keith said to me, \"I want you to keep that letter out. Anytime you need to be reminded of the beauty that is GRACE, you read that letter and continue on.\"Pamela, after reading the letter again and placing it into the book for safekeeping, I pulled out your headshot, held it up, and said, \"I WILL find a way to cast you someday.\"And that is for sure. It is probably the only gift I could give back to you, for having shared so beautifully with the WORLD by being profiled in this wonderful book. I am humbled and honored that you sent this book to me. I am forever on your side and will be sure that others know what a gift LIFE is, as evidenced by your amazing story.Everyone... GET your hands on this book. You will be blown away, inspired, delighted, and motivated to live your dreams like only you can.I hope you don't mind the plug, Pamela. I just had to share my thoughts. Much love,-Bon.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "Babyboomers are not the only ones who will identify with the stories of the famous and \"not-as-famous\" FEARLESS WOMEN in this book. Included along with short bios of fifty incredible women are beautifully done black and white photos showing them in their \"hayday\" as well as now. Not just a coffee table book, but one which gives interesting stories of accomplished, humanitarian, courageous people. This is an inspiring book which leaves the reader wanting to know more about these \"fearless women.\"",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the womens great lakes reader",
        "description": "A collection of writings chronicles women's role in the cultures, development, and history of the Great Lakes region, including Native American stories and myths as well as writings by women pioneers and travelers.",
        "authors": "['Victoria Brehm']",
        "infoLink": "http://books.google.com/books?id=B6ThAAAAMAAJ&dq=The+Women%27s+Great+Lakes+Reader&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As opportunities for woman waxed and waned on the frontier of the Great Lakes of the 1800s, those few who performed jobs restricted to men were forced back into a patriarchal society that determined their roles more suited to hearth and home, \"quelled by the anti-feminist rhetoric of the 1920s and the diminished opportunities of the 1930s\". Harriet Colfax, a thirty-seven-year old lighthouse keeper of the Michigan City, Indiana, lighthouse in 1861 shined more than a figurative beacon on the wilderness landscape. In the late nineteenth century, gender roles were fluid in the Great Lakes region, allowing women to assume occupations formerly reserved for men. For a time, the frontier gave women access to well-paying positions as fur traders, cooks on lake's ships and travel writers. East Coaster's were avid readers of \"local color\", post-Civil War tales of wilderness travels by women who returned from their adventures to write of their exploits, delicious escapist reading for those concerned with urban sprawl, immigration and the inexorable advance of the Industrial Revolution.Industrialization and the changes it wrought altered the landscape of women's opportunity, bringing with it restrictions of class and gender long familiar to \"cultured\" society, but in these tales, albeit briefly, women are the putative masters of their own fates. The Women's Great Lakes Reader honors those women who took the risk and journeyed into the unknown, achieving in this vast wilderness what they were denied in professions at home, an escape from the domesticity assigned to them, relying on their wits for survival in a genderless landscape. These narratives avoid the stereotypical stories of nation-building and development, the standards of a male perspective, written from the female point of view, \"they tell us less about mastering a landscape and more about adjusting to it\", perhaps the most important lesson in preparing for the future.From \"The First People on the Lakes\", \"Women Pioneers on the Frontier\", \"Women Travelers on the Lakes\", \"Women's Work\" and \"Women's Lives, Women's Lakes\", these selections range from the Indian settlers of the early 1800s to a spiritual midlife journey in the 1990s. Here the voices rise from a distant past to join with the present in profiles, narratives, essays, stories and poetry that emerges from the common experience of a life-changing region, women in communication with nature, forging unique identities in a wilderness that refuses to be tamed. Luan Gaines/ 2006.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Lighthouse keepers, fur traders, cooks, wives and mothers - women from all walks of life have traveled to the Great Lakes region over the past 200 years.Some stayed only a short time, others made interesting and often challenging lives. Their stories, collected by Grand Valley State University Professor Victoria Brehm in The Women's Great Lakes Reader, reveal a wide range of voices and experiences, from the poetry and travelogues to letters and diary entries about life in mining camps and homesteads around the shores of these vast bodies of water.Among several dozen chapters are the polished words of novelist Constance Fenimore Wilson, who committed suicide at age 54, after becoming a popular and successful author. Weaving narrative into rich and vivid scenic detail, Wilson puts herself in the shoes of Roxana, who follows her husband into the west.Brehm also includes brief but fascinating Chippewa tales penned in English by Jane Johnston Schoolcraft, daughter of a fur trader and a Native American woman who married explorer Henry Schoolcraft.Written from 1789 to present day, each of the stories in this collection holds a unique place in women's history. Best of all, The Women's Great Lakes Reader reflects a diversity of women's voices and reinforces the timeless notion that no one voice speaks for us all.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I found this book to be extremely informative and entertaining. It enlightened me about the history and culture of the region, and looked at both aspects from a more feminist point of view. An excellent read for pleasure or education. I will definitely read it again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "no more masks an anthology of twentiethcentury american women poets",
        "description": "Collection of twentieth century American poetry by women.",
        "authors": "['Florence Howe']",
        "infoLink": "http://books.google.com/books?id=fnuDzQEACAAJ&dq=No+More+Masks:+An+Anthology+of+Twentieth-Century+American+Women+Poets&hl=&source=gbs_api",
        "categories": "['American poetry']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "This is an excellent collection of women poets in America. From classic feminist poets like Anne Sexton to beat poet Diane di Prima, this collection covers almost everyone who's anyone in 20th century women's poetry. One of the things I wish of this collection, however, is more late 20th century poets. While many of the poems included are from the latter part of the century, there are no poets featured who were born after 1960. As a young woman poet, I find it difficult to find women similar to myself in such an all-encompassing collection of women's poetry. I'd like to know who's publishing poetry now.I think my favorite poem in this collection is \"Why, Some of My Best Friends are Women\" by Phyllis McGinley. It's a wonderful study of what women are versus what they are percieved to be by society.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm a college student at Hollins University and this was one of my English books. I have never read an anthology that varied so much in subject and style. The compilation is truly magical and it represents a wide range of readers. Any woman can find something to relate to in it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is an excellent collection of women's poetry. The topics are diverse, and the styles offer a nice variety. Some are written in a witty tone, and some are very serious. I use this collection in the classroom (college freshman and sophomores), but I think many of the pieces would be great for high school use as well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the norton book of womens lives",
        "description": "\"This remarkable and wide-ranging collection, full of surprises, shouldencourage any woman who is trying to survive in a man's world, andenlighten any man who sincerely wants to understand contemporarywomen.\" --Alison Lurie",
        "authors": "['Phyllis Rose']",
        "infoLink": "http://books.google.com/books?id=itwCHQAACAAJ&dq=The+Norton+Book+of+Women%27s+Lives&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is by far the best book I've read in the last few years. I picked it at random from the library, but I didn't want to take it back when I was finished with it. As an aspiring anthropologist, being put smack in the middle of so many different women's lives from all over the world at all time periods of the twentieth century was absolutely fascinating. I've made a list of all the selections that have inspired me enough to make me want to read the book it was taken from, and the list is two pages long! The book is an excellent montage of so many different walks of life, I think it should win some kind of award for it's superb editing. I would recommend this book to anybody interested in other women's lives, and to any men wondering how we really think and feel.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I received this book as part of the Wellesley Book Award, and to be honest, I wasn't expecting much. Most of my friends who had received book awards had gotten dictionaries or other books that looked wonderfully useful if one wanted to fall asleep quickly and on the outside this one seemed to be no exception.But then I started reading. The introduction itself is so well written, it could stand alone as an essay on women's writing. And then the selections, oh the selections. The choice and editing of the selections are of such a high quality that you never feel as if you are reading only a selection; each piece is long enough to feel complete. And despite the textbook look, it is engrossing in its diversity and quality of writing.I would recommend this book not only as reading in itself, but also as a jumping-off point. I have marked so many selections that I would like to read in their entirety.Definitely worth the money.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I love anthologies because they are so rich and various. This one, edited by a woman with a clear, strong ear for women's voices, has plenty to offer: 61 substantial selections from the twentieth-century literature of women's autobiographies, journals, and memoirs.\"I didn't want to do my duty,\" Phyllis Rose says of herself growing up. (She wanted to be a cowgirl.) \"Nor did I want models...of noble self-sacrifice and altruism. I wanted wild women, women who broke loose, women who lived life to the full, whatever that meant. What did it mean to live life to the full? How fully could a woman live?\" In this collection, we hear a chorus of \"wild women\" who show us in many ways how fully we might live. What stories these are, what fascinating lives, lived on the edge of pain, perception, and truth. These are lives that liberate and enlarge the rest of us. Read them, retell them, and use them as models for telling your own story.by Susan Wittig Albertfor Story Circle Book Reviewswww.storycirclebookreviews.orgreviewing books by, for, and about women",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "hillbilly women",
        "description": "\"This book tells what it means to be a woman when you are poor, when you are proud, and when you are a hillbilly.\" First published in 1973, Skye Moody's Hillbilly Women shares the stunning and raw oral histories of nineteen women in twentieth-century Southern Appalachia, from their day-to-day struggles for survival to the personal triumphs of their hardscrabble existence. They are wives, widows, and daughters of coal miners; factory hands, tobacco graders, cotton mill workers, and farmers; and women who value honest labor, self-esteem, and dignity. Shining a much-needed light into a misunderstood culture and identity, the stories within reflect the universally human struggle to live meaningful and dignified lives. Updated with a new introduction and material from the author.",
        "authors": "['Skye Moody']",
        "infoLink": "https://play.google.com/store/books/details?id=oRjSAgAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I found this to be an incredible armchair journey into the lives of hillbilly women in the 1970's. I am searching for a follow up report...what came of these women, how their lives continued to change. Thank you Kathy Kahn for your efforts!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a great book to read and to learn how the &quot;hillbilly&quot; women grew up. My mother Marie Chandler, and grandmothers Wyoming Wilson and Artie Chandler has their stories told, their chapter is titled Blue Ridge Mountain Refugees. I have only read their story so far, but plan to read the others. I learned a lot about my family through reading this book, and I really enjoyed it. I recommend that anyone who was a hillbilly or a woman should read this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "It is a shame that this book has been out of print for so long and people are not reading and keeping in mind that there is a huge population of white people who are just as ignorant and oppressed and kept as a permanent serf class, just like the blacks, the Mexicans, and the Chinese railroad workers were.It is a raw, unfiltered oral history collection where different women tell it like it is, seemingly in stream of consciousness mode, not in response to specific questions. Because it is entertaining and a joy to read (even when someone is telling the most depressing story about young hope cut short by unwanted pregnancy, spousal abandonment, etc.), I suspect that there was good editing done, but in the most unobtrusive way.I will never use the term Hillbilly lightly again.Good to read in conjunction with Warmth of Other Suns; that way I got the deep sense that there is \"immigration\" within America, between the states. Backwards blacks and whites had to escape from their backgrounds to the cities to improve themselves. Just because someone is a poor white doesn't mean they had it easier. Life is deadly cruel to everyone poor.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "wanderground",
        "description": "Back in print, this is the fantastic story of a group of women who have designed a world of peace and preserved a rich heritage of memory that ultimately changes the world they live in.",
        "authors": "['Sally Miller Gearhart']",
        "infoLink": "http://books.google.com/books?id=TLpaAAAAMAAJ&dq=Wanderground&hl=&source=gbs_api",
        "categories": "['American fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "A co-worker loaned me her copy of Wanderground over a year ago. After reading a chapter or two it was layed aside. Apparently I wasn't ready to read it at that point in my life. Last month I found the book's purple and lavender cover winking at me from a pile of books. This time I was ready. I devored the stories.I found Wanderground to be a fascinating vision of what women could be. Although there is a great deal of underlying justified anger in many of the stories, the loving environment in which the characters enfold themselves and each other demonstrate the potential for women that our cultural myths deny them.Sally Gearhart touches not only on what women could be, but predates Danial Quinn's &quot;Ismael&quot; by twenty years in calling attention to western culture's wasteful and destructive use of the earth's resourses.I found the respect for life, plant and animal, to be very compelling. It is too easy to forget in our pre-packaged shrink-wrapped consumer lives where our food comes from -- that a spirit was deprived of its host so that we may continue to live, for now.For me, the most moving chapter was the last one, where an elderly woman and her goat prepare to pass on. I found myself in tears at the end of the book.Thank you Sally, for sharing your vision.-- Pat Henderson",
                "review/helpfulness": "17/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is a book for all women and all men who are willing to expand their viewpoints of the world around them. These loosely linked stories follow a path towards realization reuniting men and women in one world of understanding. Well written and thought provoking.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "A beautiful book in many regards, a portrait of feminist utopia. The Wanderground did for me what many traditional philosophical writings on gender relations couldn't, that is, make real the struggles of women forced to live in a society created forcefully by men.Having recently experienced an unexpected death, I was put at ease reading the natural outlook Gearhart's characters have towards the passing of life. As a man I can see how some might take offense, and perceive this book to be male-bashing, but this book is a great philosophical work of art, that transcends stereotypical genderization.Jason M. Tribolini",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the black lace book of womens sexual fantasies",
        "description": "The Black Lace Book of Women's Sexual Fantasies reveals the most private thoughts of hundreds of women. Here are sexual fantasies which on first sight appear shocking or bizarre - such as the bank clerk who wants to be a vampire and the nanny with a passion for Darth Vader. Kerri Sharp investigates the recurrent themes in female fantasies and the cultural influences that have determined them: from fairy stories to cult TV; from fetish fashion to historical novels.",
        "authors": "['Kerri Sharp']",
        "infoLink": "https://play.google.com/store/books/details?id=9xGdjyN_LOMC&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "It is a huge turn on to read what other women are thinking and fantasizing about. I found that my sexual fantasies weren't so outrageous after all and discovered quite a few new ones that were very arousing. Open any page to find a vivid vignette of sex and seduction...delicious!I will be keeping this book next to the bed for easy access! It's just the thing to get your motor running.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "I was expecting a blow-the-door revelation on fantasies. But it seems nothing has changed in the years. Nevertheless, the content and the depth of these women's fantasies were widely varied.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "This isn't fiction, but a series of fantasies by women divided into different subjects, such as &quot;women with women&quot; or &quot;women with multiple partners.&quot; Highly erotic like all Black Lace books, I recommend this. However, I had to buy it from Amazon.uk.com. Still, it's worth the wait.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book touches on aspects that I found more of the socio typical men would enjoy. As I am not into women on women or multiple partners at once I was not enticed by the \"erotic\" stories within the book.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "herland the yellow wallpaper and selected writings penguin twentiethcentury classics",
        "description": "Charlotte Perkins Gilman (1860-1935) penned this sardonic remark in her autobiography, encapsulating a lifetime of frustration with the gender-based double standard that prevailed in turn-of-the-century America. With her slyly humorous novel, Herland (1915), she created a fictional utopia where not only is face powder obsolete, but an all-female population has created a peaceful, progressive, environmentally-conscious country from which men have been absent for two thousand years. Gilman was enormously prolific, publishing five hundred poems, two hundred short stories, hundreds of essays, eight novels, and seven years' worth of her monthly magazine, The Forerunner. She emerged as one of the key figures in the women's movement of her day, advocating equality of the sexes, the right of women to work, and socialized child care, among other issues. Today Gilman is perhaps best known for the chilling depiction of a woman's mental breakdown in her unforgettable short story, \"The Yellow Wall-Paper\". This Penguin Twentieth-Century Classics edition includes both this landmark work and Herland, together with a selection of Gilman's major short stories and her poems.",
        "authors": "['Charlotte Perkins Gilman']",
        "infoLink": "http://books.google.com/books?id=k1PiLNEZ6bUC&dq=Herland,+The+Yellow+Wall-Paper,+and+Selected+Writings+(Penguin+Twentieth-Century+Classics)&hl=&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "A generally overlooked gem of a utopian novella that makes for a pleasant experience. The treatment is calmer and more down to earth than A Brave New World, and is more thoughtful and meditative than Looking Backward. Gilman's feminism celebrates motherhood above all, and embraces Christianity. In a time when we're reconsidering gender roles and marriage in society, Herland is particularly relevant and insightful.Highly recommended for the fan of utopian literature and early feminist thought.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Herland is one of my favorite stories. If you enjoy feminist publications this is one to read. It sometimes makes me laugh and other times makes you really think about how American Society works.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book for a class in college and enjoyed all of the readings we did for the class. If you are interested in fictional feminism writing then this is the book for you!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "women invent two centuries of discoveries that have shaped our world",
        "description": "These inspiring stories of women inventors take the reader through the process of inventing--from coming up with an idea to having it manufactured and sold.",
        "authors": "['Susan Casey']",
        "infoLink": "https://play.google.com/store/books/details?id=2hvzQ92AETsC&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought this book for my daughters, because I like them to read about strong women. However, I ended up reading Women Invent! myself and enjoyed it very much! My daughters also enjoyed the book and it has gotten the both of them interested in inventing things themselves. This would be an excellent book to give to any young girls and it's one that teachers ought to use frequently. A very good book!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Women Invent! is a cool book and there should be more like it. Women often don't get the credit they deserve &amp; people think that we men invented everything. Read Women Invent! and you'll learn otherwise. A fun read and highly informative. I'd recommend this book to all teachers and parents.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book &quot;Women Invent!&quot; was one of the best books I have read. I'm an avid reader of any book I can get my hands on but this book was exceptional. It is factual yet very interesting. It is written very well and keeps your attention focused. As soon as I read it I felt like going out and inventing something on my own.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "When I was a girl the age this book was written for -- between ages 9 and 12 -- I devoured every book that existed about the lives of curious girls and powerful women...and then re-read them, because it seemed there were no more than five interesting females in all of history. Where was WOMEN INVENT! then? Susan Casey lets young girls know that women have been asking important questions and inventing revolutionary solutions for centuries! And not just a handful, but a multitude. Thank you, Ms. Casey, for broadening the minds of today's children AND their parents. Thank you for introducing and re-introducing these fascinating stories to a new generation of inventors.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Susan Casey's book &quot;Women Invent!&quot; is a lively parade of women and girls who solved problems and shared those solutions. Besides the stories behind many inventions, the book explains the process of patenting an invention and includes a dandy resource guide. I found the book to be entertaining reading as well as inspirational, causing me to think about ways to make life easier and to wonder if I have an invention to share. Best of all, I enjoyed reading &quot;Women Invent!&quot; Although aimed a young readers, it kept me turning pages. It is great to know the stories of so many inventions. Ordinary objects have come to life. I'll never look at a paper bag or a baby backpack the same way again.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I'm midway through Susan Casey's book, \"Women Invent!\" and I just love it. It's very inspiring to read these tales of how many cool and practical inventions were brought to us by women. The book has loads of info. and a great, accessible writing style that doesn't talk down to the reader. As a smart adult, I found myself really enjoying it--and my husband's been reading it too, and really loving it. It's definitely not just for kids, although kids would find it super-inspiring. Honestly, I wish I'd been exposed to this material as a student myself. It would have given me a lot more vision for how women have contributed to society in a field (science and things mechanical) which we don't traditionally associate with women's accomplishments. Great book; I hope there'll be others by the same author.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "women without superstition no gods no masters",
        "description": "The collected writings of women freethinkers of the nineteenth & twentieth centuries",
        "authors": "['Annie Laurie Gaylor']",
        "infoLink": "http://books.google.com/books?id=OqrXAAAAMAAJ&dq=Women+Without+Superstition+:+No+Gods+-+No+Masters&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "&quot;Women Without Superstition&quot; is a compilation of short biographies with sample writings of some of the more well known mostly North American and English freethinking women. Beginning with Mary Wollstonecraft, and ending with Taslima Narsin, The editor A. L Gaylor does an admirable job connecting a large cast of women together including Elizabeth Cady Stanton, Susan B. Anthony, Voltairine de Cleyre, Margaret Sanger, and Dora Russell and painting a vivid picture of the incredible struggle they endured simply trying to enfranchise women especially during the first two centuries of American independence. The fact that their struggle incorporated the rational position against slavery helps validates their underlying premises. Presented are beautiful thinkers mostly struggling alone. An understandable bias toward feminism is notable, perhaps explainable due to the repressive forces continually confronting these women freethinkers. These are stories about women and their struggle to promote women rights. Women working with women. A slight bias underlines some of the biographies written by the editor. The most glaring instance occurs in the biography of Margaret Sanger. Gaylor's description of her father as &quot;better at stirring up controversy than providing for his family&quot; cast her father in less than an admirable light and doesn't coincide with Sanger's remembrances. He had a difficult life offering his position to the community as well as the women freethinkers. The sub-title, &quot;No Gods, No Masters&quot;, attributable to M. Sanger, accurately conveys the critical stance most of these women offer of religions, mostly judaeo-christianity. Repetition of critiques of biblical errancy, brutality, irrationality and chauvinism abound. The excellent exposition and brilliant articulation of their position make these women persons who should be emulated. Most of them possess powerful intellects and strong oratorical skills; necessary equipment to confront the tidal waves of irrationality assaulting them. The general analysis that religion represses women's rights and non-theistic positions is convincingly argued. The last women presented, Taslima Nasrin, writes of Islamic fundamentalism from an insider's position. Like Rushdie, simply for expressing her thoughts, Nasrin must hide for her life. For this reader, her analysis of Islamic Fundamentalism was especially interesting. HIGHLY RECOMMENDED. Great reference on development of feminist thought. Inspirational biographies. Flip Webster psmith@sol.racsa.co.cr",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "I wish I had been given the chance to study this stuff in school. I spent a long time struggling with these ideas. If only I had access to this book at an earlier age. Great book, wonderful works by highly intelligent authors. Helped me to cast off my old doubts.",
                "review/helpfulness": "34/37",
                "num_reviews": 37
            },
            {
                "review/text": "I first checked this book out of the library. I wasn't sure about it as I have had to really wade through quite a few books recently and didn't want to buy something that would put me to sleep. But I hadn't finished the introduction yet, and I knew I would be buying it. It's a fascinating book, and way overdue to be published! I wish everybody, but especially every woman, could read this book! There are so many interesting things in here, and no matter how much you think you know about feminism, freethought, etc, there is something new for you in this book. I have recommended it over and over again to my friends.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "A great collection of writing from woman of the nineteenth and twentieth centuries. Any woman who is enjoying todays freedom (still a way to go) should read this book and appreciate the efforts of these writers and to the ridicule, insults, threats etc. they weathered. As a man, I'm thankful to them.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "I enjoyed this book. Not only is the story of atheism (and antitheism) difficult to find info on, but the story of female humans in atheism and science is also difficult to find info in.This is one of the only books I have found that tells the stories of women in atheism. I would enjoy seeing a video on atheism, and also female humans in atheism and science. I would enjoy seeing, hearing and reading stories of humans that spoke out against religion and promoted science.Finding images of these female humans is also difficult to do. This book includes humans I had never heard of, but also any body that did any thing for female human equality. For example, I was very glad to see a photo and data on Matilda Joslyn Gage, a person usually left out of women's history because of her anger with religion, and perhaps because of her sexuality.My one criticism of this book is that the people are kind of tame (although being atheist is shocking for most humans). Where are the female humans in science...? Still, for one of the only books (or videos for that matter) on free thinking women (or women without superstition and substition!) I was glad and enjoyed every story!Stop Violence, Teach Science!Ted Huntington",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "As I first read this book, I was constantly amazed at the insight and reasoning power of these women. I was also angry that I had never been exposed to these texts. The only thing that baffles me is that Ayn Rand is not mentioned more. Perhaps it has something to do with the fact that she was a capitalist? I haven't found any evidence that the FFRF (the author's group) is philosophically socialist, which would explain her Rand's warranting only a footnote. Rand is surely one of the most famous atheist women of our day. Nevertheless, the book is an absolute treasure to anyone interested in enjoying life and my thanks go out to Ms. Gaylor for writing it.",
                "review/helpfulness": "22/25",
                "num_reviews": 25
            },
            {
                "review/text": "This is a phenominal, rich text that stirs the mind & imagination & creates a whole new sense of power & self-determination. It is also useful in the sense that it validates so many women who might feel marginalized by society. I love it!",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "These women and their contribution to the history of the world ought to be in every school library and within the reach of inquiring minds everywhere. Their experiences and insights on the negative impact of reliance upon some fairy tale concocted to put the human race down is invaluable. The human mind is a powerful tool and needs only to be used with skepticism and a vision on reality",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Annie Laurie Gaylor's new book on Women Without Superstition is an outstanding contribution to Freethought literature. Most Freethought anthologies include selections from the famous male freethinkers of history, and except for a few outstanding individuals, female writers have been ignored. Ms. Gaylor corrects this imbalance with her new book. For each woman freethinker, she has written a short historical introduction that places each author in her time and culture. Simply as a historical resource, this book would be valuable. But the selections from each author that Annie Laurie includes are rich and rewarding. Imagine the courage and confidence each woman had to have to live a life based on reason, evidence, and honesty--and then speak openly about her heretical beliefs--in a disapproving society. Such courage is still required today, which makes this book inspiring reading.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This thought provoking book is a compilation of views and lectures of historic, prominent and free thinking women. It is highly recommended for any open-minded person searching for answers free from the dogmas of the various religions. It is worth reading, even if not agreeing with authors' philosophies.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "all of the women of the bible",
        "description": "All the women of the Bible offers a rich biographical perspective on evey female figure in scripture -- including the famous, the little-known, and even the unnamed. In more that 300 engaging and insightful portraits, Edith Deen brings alive the saints and sorceresses, queens and servants, mothers and daughters, wives and widows whose profound influence is felt through-out the Bible. \"You can almost trace light and darkness in the Bible by the women themselves,\"she writes. \"Hannah, praying mother of Samuel, gave birth to a son who became the first great Hebrew prophet. And, of course, there was the mother of Jesus. On the other hand, Jezebel and Herodias were vile influences, the first tearing apart the northern kingdom of Israel, the second causing John the Baptist to be beheaded.\" Combining thorough detail with a lively and dramatic narrative, All of the Women of the Bible portrays the real women behind the Biblical stories and shows how, in their human struggles and triumphs, they are very much like the women of today. With each major biography identified by Bible chapter and verse and prefaced by a key passage of scripture, this is an ideal resources for teachers, Bible students, preachers, and writers, as well as anyone who wants to learn what it was really like to be a woman in Biblical times.",
        "authors": "['Edith Deen']",
        "infoLink": "http://books.google.com/books?id=9zVDeI50QHIC&dq=All+of+the+Women+of+the+Bible&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Perhaps it is due to the age and place in which I was raised--the 70s and 80s in Europe and Washington DC--or perhaps it is simply who I am, but my interest in the Catholic Church and the Bible itself has had its ups and downs. Whenever my interest in the Church and the Bible was awakened, however, it was due to interest in the writings of the Bible.Whatever the initial reason that my interest in the Bible was inspired, however, I always read about the same topic: women and, in particular, the heroic women who were respected and revered by their husbands, families, and/or nations. I wanted to find women to emulate.This book is the best I have read on the subject of women in the Bible. Deen's work remains concise, while she makes you feel as if you know each character as a woman and as a part her place in history. Then, after writing these evocative passages, she has useful appendices such as an alphabetical listing of each woman who is named in the Bible and a brief description of each, a listing of women according to their station in life, a bibliography, and an incredibly in-depth index. This is a book that you will refer to throughout your life, whether you are looking for an interesting story, you want to learn about the age these women lived in, or you simply need inspiration. No matter your need, this book can fulfill it.",
                "review/helpfulness": "81/83",
                "num_reviews": 83
            },
            {
                "review/text": "This exhaustive work is invaluable to anyone who wants to know the stories of Biblical women better. I'm doing research on Biblical widows, and this book is the most accessibly organized sourced I've found. It was written in 1955, so don't be surprised if it's a bit dated stylistically &amp; theologically. Still, it's valuable as a reference tool that may lead to you to deepened encounter with women of faith.",
                "review/helpfulness": "45/47",
                "num_reviews": 47
            },
            {
                "review/text": "One of my sons, when he was about four, ran to the front of me, his mother, on a narrow sidewalk with the statement: &quot;Men are leaders in front; women are leaders behind.&quot; This was the politically correct point of view in less enlightened times - especially in biblical times. Or was it? Edith Deen has compiled all the data necessary to answer that question. She has reviewed every woman mentioned in the Bible, those whose names were given, and those who were unnamed. She has pointed out those who were &quot;leaders in front&quot; and those who were &quot;leaders behind.&quot;She has also listed them according to their roles in the family: daughters, wives, mothers, widows. There is an excellent index to help you further find them by their roles (e.g, &quot;Warfare, women taking action in&quot;). This is a delightful book, whether you are wanting to discover what roles women played in ancient Israel, or whether you just want a book that has sections that you can read quickly for a short moment's diversion.",
                "review/helpfulness": "41/43",
                "num_reviews": 43
            },
            {
                "review/text": "Women in the bible are often not a topic discussed in church or elsewhere. This book is a wonderful look at the ignored parts of the bible, (and I don't mean every book after Exodus). Women did participate in the bible and this book celebrates their accomplishments and gives them long overdue praise.",
                "review/helpfulness": "36/41",
                "num_reviews": 41
            },
            {
                "review/text": "This book is a must for all women wanting to know more about the great women of the Bible. In this book you will learn all about the cultural heritage of the women of the Bible, all about the struggles these great women faced in their lives, and a true behind- the-scenes look into their lives. We have used this book in our home to teach our children what the lives of Bible Figures were really like! I have used this book to better understand the Bible. In this book, Edith Deen did extensive research all over the world in order to make this book accurate. This book is great for all wanting to know more about the Bible...for all who would like to know more about the cultures shaping the saints from the Bible...for Christians seeking to learn more about being godly in our world today! This book is a must for every home! A true classic!",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "The books came in good condition and arrived sooner than promised. We are using it as a group study, and though it was published years ago the contents do not get outdated, any more than the Bible. It makes these women come alive for us as real people.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is an excellent reference book for all Christian women who really want to know about women who blazed the trail for us. Not only do you study the women in the Old Testament, but the New Testament as well. This book is used as a textbook in our Church Leadership School. Wonderful gift for a Christian sister. Of all the books cooncerning the women in the bible that I have read, this one is by far the best.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was written before computers, so the author knew the material intimately as she categorized and collected details. Very reliable source for Bible study.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Impressive, well written and researched material. I first read this book having found it in the local public library. I liked it so much that I ordered a copy via Amazon so that I might read it at any time again and again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "five women",
        "description": "Five stories from five unforgettable characters, brought to life by an author the Washington Post hailed as \"contemporary...rewarding...masterful.\" Five friends meet weekly at a restaurant called Yellowbird on New York's Upper East Side, revealing the long-hidden secrets of their pasts and how each, in her fashion, has become a survivor beyond all expectations. The women are Gara, a divorced psychologist and cancer survivor; Felicity, a beautiful attorney married to a rich but controlling man; Kathryn, who is haunted by the brutality of her parents' marriage; Eve, an unabashedly narcissistic actress; and Billie, a former rock star, now owner of Yellowbird. Told with Jaffe's signature liveliness and uncanny understanding of female friendship, Five Women invites us to the table to hear stories both familiar and unthinkable, stories of struggle, heartbreak, survival and redemption. PRAISE FOR RONA JAFFE \"Reading Rona Jaffe is like being presented with a Cartier watch: you know exactly what you're getting and it's exactly what you want.\"-Cosmopolitan \"Vivid and trenchant...Wry and very readable...A minor genius.\"-New York Times Book Review \"Jaffe has not lost her wit, her keen eye for human frailties and her ear for the small but telling remark.\"-Publishers Weekly",
        "authors": "['Rona Jaffe']",
        "infoLink": "https://play.google.com/store/books/details?id=YaF_AQAAQBAJ&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Robert Musil is not read much anymore; if he is known at all, it is usually through his monumental work, &quot;The Man Without Qualities&quot; - a piece comparable to both Joyce's &quot;Ulysses&quot; and Mann's &quot;The Magic Mountain&quot; in its complexity and elusiveness. Among the modernists, Musil is noted for his attempt to bring a sort of &quot;mysticism&quot; to the problems and philosophies of society; he was interested in the cacaphony of ideas which littered the modern world, drowning out the order of the past. This new collection of his short stories, previously published separately as &quot;Unions&quot; (1911) and &quot;Three Women&quot; (1924), provides an introduction to Musil for the uninitiated. As one reads these five stories (the &quot;women&quot;), one cannot help but notice the low hum of disorder welling beneath the surface - whether in &quot;Grigia&quot; with it's Poe-like ending, the retro-fairy tale of &quot;The Lady From Portugal&quot; or the seductive hopelessness inherent in &quot;Tonka.&quot; These stories are set in a time and place not our own, but the reader is presented with the universal themes of love, death, and power - indeed, the very nature of our being. These works are challenging, they require effort, but ultimately they are rewarding and necessary. Musil once wrote of the &quot;union of soul and economics&quot; - the combination through literature of the ethereal and the real, the past and the present, the timeless and the mortal. This impressive collection is an entrance to Musil's world, to his ideas, and to a better understanding of our own condition.",
                "review/helpfulness": "37/37",
                "num_reviews": 37
            },
            {
                "review/text": "Musil's great gift as a writer was to be scientifically precise about ineffable states of mind, and the stories in Three Women (1924) display his talent for creating an atmosphere of metaphysical tension or 'float' out of unremarkable situations with little inherent drama. Not much happens on the surface in these stories, but Musil infuses the not-happening with so much significance that the meaning of humanity's life on earth seems to hang in the balance.All three involve prosperous, powerful men attached to women they scarcely understand who, in the process of trying to account for that attachment, come to peace with the fact of death. Musil's interests are those of a philosopher or psychologist who's chosen art as his instrument for dissecting the human soul. The metaphors aren't as sharp and memorable as they are in The Man Without Qualities, and the irony's considerably turned down. This lets you see Musil's mystical side a little more clearly, but it also threw my picture of him out of balance--I missed his tart, satirical sense of humor.The two stories that round out the collection are from Union (1911) and show a younger Musil working up his chops.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Some of the stories are a bit long and not so engaging but there are a few that are really brilliant. One in particular is quite haunting. This is super high end, high brow literature, but it's the real deal. I will definitely read it again.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I couldn't wait to be finished with this book. I only continued after the 18th chapter because of the time invested; and there's 44 of them! What a waste of time. The story moves quickly enough; for some characters their lives moved within a matter of sentences, others times you are dragged through the emotional pathos and dysfunction for pages. Every character in the book has had or is having some crisis that steers the course of their lives. These women are all looking for 'love', but will take shallow, self-serving, non-committal sex in it's place, and places the reader in a postion to pity them when it doesn't work out. The weekly 'pity party' these characters have lures you into thinking there is a true commaraderie; only to discover it's pathetic agenda.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "For a story with five main characters, I was glad that it was fast paced. I like Jaffe's writing style and even as a twenty year old, I can still relate to one character in this story. At first, I was put off because the main characters were middle aged. I just didn't want to read about the sex life of a fifty year old. But as I read on, I became open minded and went through this book like a breeze. It was like Waiting to Exhale meeting a drug free Valley of the Dolls.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was a book about five middle-aged women friends. It goes back into each of their pasts. I liked this because it added dimension to the characters and you then understood why they behaved the way they did in life and love. This is not a feel-good book. The characters all have tragic and depressing issues in their lives, which made it kind of a downer to read. But it also made it real. I was engrossed in this book and was surprised to see so many negative reviews. The author tied up the story nicely in the end as well. I would recommend this book to anyone, especially middle-aged women.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "What I liked about this book: the characters were not young, nubile women only... they were multi-faceted over 30's types with lots of history behind them.What I didn't like: the history was primarily struggle filled and very loosely wrapped. Because there were five different women involved, I didn't feel very deeply involved with any of them.Two I liked and two annoyed the heck out of me for the most part.... and the fifth? She was ok... I think? I really didn't get to know her very well.I also wished there was a straight, normal man we could all appreciate.I captured several really good lines from Jaffe, but that was not worth the more than 400 page read. On the other hand, I did keep reading so there must be something redeeming about the story.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Well, after 7 Rona Jaffe books, I've finally reached one that was a disappointment. I just didn't feel as much for the women of this book as I did for characters in the other 6 books I've read.This is the story of five very different women in their 30's and 40's who meet up weekly at a New York City bar/restaurant, and dish about life, love, and their pasts. Of the five women, one was incredibly annoying, another was very annoying, two were just so-so, and the fifth, probably the most interesting of the bunch, we never really get to learn much about.There's Eve...whom I hated...whose a struggling actress, a despicable mother and a questionable friend. She's so pushy and rude, and some of the things that come out of her mouth just make you cringe at how immature and inappropriate they are. There's Felicity...whom I wanted to smack...who's in a somewhat abusive marriage, and all she does is complain about how much she hates her husband, and wants to leave him, and how she can't live without her lover Jason. Her constant weakness and complaining got on my nerves real quick.Then there's Gara, and Katherine...Gara's a psychologist whose husband of 20 years just left her for a younger woman, and she's struggling to pick up the pieces; and Katherine, who comes from a very bad childhood, and a few failed marriages, is determined to have fun in her later years, and make up for lost time. Both these women were ok...but not much more. And finally there's Billie...the owner of the Yellowbird (the place where the women meet). I liked her the best. She had a normal childhood, a short stint with fame and fortune, and then (after much drama) settled into her gig as owner of a NYC restaurant, and mom to her young son.Overall, this was most definitely not my favorite Rona Jaffe book. I felt it went on about 100 pages too long, and the majority of the characters were just not likeable. I'm just really glad that this was not the first book of hers that I picked up. If your thinking about reading this, skip it...she has so many other great books out there...and I still look forward to all the ones I haven't read yet.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I enjoyed this story about five friends - It was a fast read, but nonetheless, a good story.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "living with cannibals and other womens adventures adventure press",
        "description": "Drawn from more than one hundred years of first-person narratives from the collection of the National Geographic Society, a collection of firsthand accounts documents the accomplishments of women explorers who ventured into the unknown, featuring contributions from astronaut Shannon Lucid, arctic explorer Helen Thayer, Victorian world traveler Isabella Bird Bishop, and others.",
        "authors": "['Michele B. Slung']",
        "infoLink": "http://books.google.com/books?id=y_8OAQAAMAAJ&dq=Living+with+Cannibals+and+Other+Women%27s+Adventures+(Adventure+Press)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Pairing well known adventuresses with lesser known heroines makes this book a great read for those with various levels of familiarity with the history of women explorers. Delightful anecdotes are coupled with high adventure which kept me saying, &quot;I will just read one more story...&quot; until I found myself half way through the book in one sitting. This is a great book to read to your daughter.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is a collection of short true stories of women travelers and adventurers. (Some are modern and some are from previous centuries.) Many threw convention to the side to follow their dreams. I enjoyed it!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "The picture on the cover and the title made me think that this was going to be &quot;A short superficial collection of stories about women adventurers,&quot; and probably adventures that wouldn't be worth mentioning were the people male. I was pleasantly surprised. Common themes are, &quot;Ms. X from a very early age indicated that she wanted to travel&quot; and &quot;After living a conventional, homemaker life, at age 30+ Ms. X started traveling.&quot; The stories are written so that that one can readily identify with the adventurers, perhaps precisely because up until the time they start traveling their lives are so similar to people like me who are not. Like a prior reviewer, once I started the book I was hooked.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a pretty quick read and very enjoyable. What I liked so much about this book is that while all these women have one thing in common -- adventure -- they all have their very own and very different approaches to it. From a single mom who takes her daughter through a foreign country, to women kayakers, to mountain climbers. All these women have found the one or two things they really loved (one lady loved India and also loved riding her bike so she rode her bike through India) and pursued it.Basically this book teaches you to find your thing, be proud of what it is you like to do as an individual - and go for it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "men without women",
        "description": "NATIONAL BESTSELLER -> Including the story \"Drive My Car\"-now an Academy Award-nominated film-this collection from the internationally acclaimed author \"examines what happens to characters without important women in their lives; it'll move you and confuse you and sometimes leave you with more questions than answers\" (Barack Obama). Across seven tales, Haruki Murakami brings his powers of observation to bear on the lives of men who, in their own ways, find themselves alone. Here are lovesick doctors, students, ex-boyfriends, actors, bartenders, and even Kafka's Gregor Samsa, brought together to tell stories that speak to us all. In Men Without Women Murakami has crafted another contemporary classic, marked by the same wry humor and pathos that have defined his entire body of work.",
        "authors": "['Haruki Murakami']",
        "infoLink": "https://play.google.com/store/books/details?id=mSrWDAAAQBAJ&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 15.0,
        "review": [
            {
                "review/text": "These are some the best stories I have ever read. When I was in high school, my class was asked to read In Another Country for discussion. It was my first Hemingway short story, and an introduction to the novels we would be reading. I almost cried. His writing is just so gut-wrenchingly honest and raw. No overwrought explanations of emotion. You know how these characters are feeling simply because of how the speak and act. Hemingway is the master of context. The Killers is almost like a mystery story that never gets solved. Why doesn't he run out of town? What's going to happen to the big guy? I love this stuff and can't get enough of it.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "&quot;Men Without Women&quot; by Ernest Hemingway features a glimpse into the genius that is Hemingway. I found it to be a great read during a summer weekend. I especially enjoyed the Nick Adams stories and the story about the matador fighting one last glorious bullfight (one of Hemingway's favoright subjects). &quot;Men Without Women&quot; deals with subjects both everyday and serious such as love and abortion. This short read by Hemingway makes a great introduction for anyone wanting to begin reading Hemingway. I highly recomend it.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Hemingway's short stories have always been hit &amp; miss with me. Some of them don't really do anything for me, none are among my very favorite short stories, but most of them are well-written and thought provoking. Such is the case with this set.Hemingway offers us an assortment of masculine characters, mostly picked from his favorite types of male personas: soldiers, bullfighters, mobsters and prizefighters. Despite the title of the book, there are a smattering of female characters in some of the tales. They rank with the standard fare of impetuous women that Hemingway likes to write about.The scope of the stories is quite broad, featuring painful topics such as abortion, breakup, heartbreak and being past ones prime. The latter theme is taken up in THE UNDEFEATED, THE KILLERS and FIFTY GRAND and later on re-appears in Hemingway's THE OLD MAN AND THE SEA. FIFTY GRAND, which details the demise of a washed-up boxer, is my favorite short story in this collection.Stories such as IN ANOTHER COUNTRY, and NOW I LAY ME introduce motifs that are echoed in A FAREWELL TO ARMS, which was published just a few years after MWW.Tho I've never been enamoured with the short story genre, Hemingway does rank as one of the best in the business - particularly in the American literary canon. Hence, followers of Hemingway as well as people who greatly enjoy short stories would likely appreciate this book.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Not all short story anthologies are created equal. I have found a number of the short stories by Hemingway here in other anthologies. The premise here seems to be to highlight some of Hemingway's central writing themes- man and sport and manliness in general. No question that Hemingway is a man's writer. The subject matter of interest-bullfighting, gangsters, bicycle racing, boxing and the effects of the ravages of war on the male psyche bear this out.In some of the short stories like A Canary For One where he introduces a forlorn woman and thus strays from the theme he is on less firm ground. And that kind of sums up the problem of the whole conception behind this compilation. Unlike Scott Fitzgerald, his contemporary and friend, who was very comfortable writing about women Hemingway does not show that same talent. The sparse, to the point dialogue we have come to expect from Hemingway gets its ususal full workout here but not a nuanced view of a two-gendered world. Still The Undefeated and The Killers ( a very, very short story that formed the basis of a movie by that same name starring Ava Gardner and Burt Lancaster) are worth reading in any anthology.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Reading this reminded me why, though I admire Hemingway greatly as a writer, I am not really a fan. Men Without Women is a collection of 14 (often quite short) short stories. His stories are often powerful, occasionally very moving, but the subject matter simply does not speak to me strongly.The two longest stories here are variation on a theme: a matador's last fight (\"The Undefeated\") and a boxer's last fight (\"Fifty Grand\"). Though both stories have a brutal honesty that I admire, neither the world of bullfighting (which comes up again in \"Banal Story\") nor the world of boxing is particularly interesting to me. Others, of course, who find these subjects more appealing than I would find more enjoyment here.Hemingway is often considered a writer for men (as even the title of this collection implies), and there is some truth to that. Not only is the subject matter more likely to appeal to men, but the characters about which he write are predominantly men. Sometimes, even so, this leads to some universally appealing results, like his hitmen story \"The Killers\" and his brush with homosexuality in war, \"A Simple Enquiry\". Ironically, however, the best of his stories are those that feature women: the abortion conversation in \"Hills Like White Elephants\", the veteran who loses his wife in \"In Another Country\", and the young man betrayed by his girlfriend in \"Ten Indians\". These are the stories I will remember from this collection.There is so much about Hemingway to like. His spare writing style and his ability to end a story quietly is wonderful. His willingness to tackle subjects like abortion, drug abuse, homosexuality, and the horrors of war is admirable. Without a doubt, some of the stories in this collection rise to the truly magnificent. To some, I'm sure, Hemingway is a perfect writer and I can see the appeal. I just wish the topic he chose to write about were more interesting to me.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a visit from the footbinder",
        "description": "Offbeat stories of women trying to transcend limitations imposed on them because of their sex and of men confused as a result focus on innocent depravity, absurd rituals, escapes from constraining lifestyles, and life's pleasures and fun",
        "authors": "['Emily Prager']",
        "infoLink": "http://books.google.nl/books?id=xNf8s0NbsgUC&dq=A+Visit+From+the+Footbinder&hl=&source=gbs_api",
        "categories": "['Manners and customs']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I enjoyed Prager's collection of short stories, which is well worth buying for the cover art alone: a woman's foot molded into the shape of a heel is juxtaposed with a picture of a Chinese woman with \"beautiful\" bound feet. Prager writes on a variety of subjects, from a group of women who get together and read their alumni bulletins to the title story in which young Pleasure Mouse anxiously awaits the visit from the footbinder, who will lead her into the exciting adult world that every older female she knows inhabits. Prager's plotlines and characters stay with you when the book is closed. I'm hunting the used bookstores for her other books.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is one of the most creative selection of short stories I've ever read. She takes current attitudes and stands them on their head. You'll find yourself laughing hilariously and at the same time wiping away a tear.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    }
]