[
    {
        "Title": "collected poems new directions books",
        "description": "This volume contains all of Owen's best known work, only four of which were published in his lifetime. His war poems were based on his acute observations of the soldiers with whom he served on the Western front, and reflect the horror and waste of World War One.",
        "authors": "['Wilfred Owen']",
        "infoLink": "http://books.google.com/books?id=qO350DeGItwC&dq=Collected+Poems+(New+Directions+Books)&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Kenneth Patchen, 1911-1972, was born in Ohio, fought in WWII, and spent the rest of his life invalided by spinal disease. His was a powerful, angry voice that could sing some of the most beautiful love poems of the past century. His art was violent and primitive; usually he incorporated poetry into his painting. His strongest influence was William Blake, e.e. cummings was a mentor. He moved easily among the San Francisco poets, a contemporary of Lawrence Ferlinghetti of the famed City Lights Book Store. He was truly a poet's poet and never compromised his art.I don't know if was influential; he certainly didn't care. His public, his peers sought him; never the other way around. I read once that he wrote \"naked poetry.\" The following poem is an excellent example of his wondrous way with words, the beauty, the anger and the savagery all in a few short stanzas.The dove walks with sticky feetUpon the green crowns of the almond tree,Its feathers smeared over with warmthLike honeyThat drips lazily down into the shadow...Anyone standing in that orchard,So filled with peace and sleep,Would hardly have noticed the hillNearbyWith its three strange wooden armsLifted above a throng of motionless people---Above the helmets of Pilate's soldiersFlashing like silver teeth in the sun.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "Kenneth Patchen is by far my favorite poet. This is a brave statement coming from a reader/literature buff who prefers poems that are far more traditional in form and meter. While I respect and admire all creative forms of poetry (I myself shamelessly admit to being a lousy poet, which is probably why I read more of the stuff than I write), I have always had a higher interest in poets who follow rhyme-schemes because I always figured that this type of poem was more difficult to write. To follow a certain pattern and meter throughout a poem, and yet to still successfully make your statement and evoke emotion is a powerful example of creativity and ingenuity. Give me Yeats and Donne over blank-verse any day.Having said that, I must confess that Patchen was a poet who always wrote to the beat of his own drum. He rarely used traditional form or meter, yet in steering away from traditional schemes, he managed to create his own rhyme and forms in brilliant wordplay that have since been copied by never replicated. Plus, the raw, honest emotion (often rage) and powerful, offbeat images that Patchen constantly creates only get better with each read. It is difficult for me to describe the man's work except for the title I have given this review. Do not expect traditional poetry in any shape of the imagination. But do expect beauty and honesty in all the themes that Patchen explores, whether he is describing life for all of its beauty, darkness, or sadness.In other reviews I have written for this site, I have felt the need to expand into lengthy prose in order to promote to work I was writing about. I do not feel the need to do that here, as Patchen is better known than the previous writers and artists who I have reviewed (indeed, if you are reading this, it probably means that you're a fan of Patchen's anyway). Having said that, it is a pity that he is not included in more anthologies and that he is not studied more in English classes. There is something here for everyone, and the questions and comments that he evokes about life and society are not to be missed.I shall conclude with one of my favorite poems by Patchen, to demonstrate the raw emotion and themes that he creates with his unusual form and dynamic images. Thankfully, this volume includes this particular poem and others like it with similar haunting beauty.&quot;If We Are To Know Where We Live&quot;&quot;I came to the house. It was dark.It was hell standing there.No one answered my knock.WHAT ARE THEY DOING IN MY HOUSEI tapped on the window. I banged on the door.They pulled the shades. They threw the heavy bolt.But I knew that they wantedAnd I saw what I was not to seeAnd I heard what I was not to hear.They wanted to murder the thing within the house.I saw my own face with the knives about it.I heard my own screams as they tortured me.And I was everyone. We all stood there.&quot;Hopefully, this poem has proven any point that I've tried to make. If you love poetry or are just beginning to dive into the world of literature, Patchen is an important, often overlooked writer who you simply should not miss.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Kenneth Patchen is a one of a kind poet. He wrote two or three poems worth all the musty little university poetry journals put together. His sincerity is brutally sweet when he's sweet, and brutally cruel when he's angry. Every word shivers with ethical and political commitment but without sentimentality and cheap moralism. He makes Ginsberg's howls look like squeaks, and the university poets look like conmen. He makes Bukowski seem flower-scented. He's unlike anything else. That he's forgotten proves that the contemporary world of poetry is a sham and a crime.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "selected poetry of william wordsworth modern library",
        "description": "Selected Poetry of William Wordsworth represents Wordsworth's prolific output, from the poems first published in Lyrical Ballads in 1798 that changed the face of English poetry to the late \"Yarrow Revisited.\" Wordsworth's poetry is celebrated for its deep feeling, its use of ordinary speech, the love of nature it expresses, and its representation of commonplace things and events. As Matthew Arnold notes, \"[Wordsworth's poetry] is great because of the extraordinary power with which [he] feels the joy offered to us in nature, the joy offered to us in the simple elementary affections and duties.\"",
        "authors": "['William Wordsworth']",
        "infoLink": "http://books.google.com/books?id=C7RDDwAAQBAJ&dq=Selected+Poetry+of+William+Wordsworth+(Modern+Library)&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "To me, poetry is like a swimming pool into which I have to dip my toe to test the temperature of the water before I jump in. I have to take it just a little bit at a time and allow myself to absorb it as well as enjoy it, and this volume of Wordsworth is something I find accessible and welcoming but challenging enough to engage my interest. Unlike his contemporaries of the Romantic movement like Blake and Byron who immersed themselves in wild fantasy and dark mythology, Wordsworth writes about things just about everybody can relate to -- nature, neighbors, family, nation, self-realization, glow-worms -- using direct language that avoids obscure metaphors. Granted, not many of us these days find the opportunity to observe a shepherd at work or hike over the Alps, but Wordsworth did, and tells us about it with imagination and exuberance.The characters in Wordsworth's poems are vagrants, wanderers, beggars, figures from local legends, generally people who live outside of the mainstream or are forgotten by society, the humblest of the humble. There is Johnny the errant Idiot Boy, who is sent off on a horse to fetch a doctor for his mother's ailing friend but instead takes a personal journey governed by his limited imagination. There is the isolated Lucy, &quot;a violet by a mossy stone&quot; who &quot;dwelt among the untrodden ways.&quot; There is old Timothy the Childless Father, who tries sorrowfully to maintain his spirits by continuing his hunting excursions after a period of mourning for the death of his last daughter.The central piece in this collection is &quot;The Prelude,&quot; Wordsworth's autobiographical poem. After explaining his desire to look beyond traditional poetical subjects like history and chivalry, he proceeds to document the development of his aesthetic, noting the importance of solitude to a budding poet, discussing his years at Cambridge and his undistinguished academic performance, his walking tour through Europe at the time of the French Revolution, and his sympathies for the common man arising from his love of nature. Several sonnets written around 1803 show him turning his attention to national matters, such as lamentations for England's lack of current literary figures as great as Milton and calls for defense against Napoleonic invasion (&quot;To the Men of Kent,&quot; &quot;In the Pass of Killicranky&quot;).Adoration of nature is Wordworth's most salient attribute, and, having found his pictorial voice from an early age (&quot;An Evening Walk&quot; is astonishingly sophisticated verse for a seventeen-year-old to have written), he devotes the lion's share of his poetry to idylls, pastorals, dithyrambic odes to the beauty of the the landscapes around his boyhood home in Grasmere. With the exception of some London street scenes in &quot;The Prelude&quot; and elsewhere, there are very few references in his poetry to urbanization and industrialization; reading it, one would think England a permanently medieval country of quiet rustic villages and sparsely populated woodlands. It would seem that materialism and the chaos of living in an increasingly technological society mattered not at all to Wordsworth, and his poetry has all the more longevity because of it.",
                "review/helpfulness": "34/35",
                "num_reviews": 35
            },
            {
                "review/text": "From time to time I return to reread Wordsworth. There is a spirit of calm and consolation, which combines with the sublime that makes his poetry especially soothing and uplifting. His poetry is sympathetic and understandable but also deeply reflective. The great odes 'Tintern Abbey' and 'Intimations of Immortality' seem truly to provide a sense of something 'more deeply interfused, a power whose dwelling is the light and living air'Wordsworth is not doctrinal but he is a profoundly religious poet. And he gives a sense of the natural world as awe - inspiring in itself and suggestive of something greater and more meaningful.I love many of his shorter poems, some of the sonnets especially. The lines, the great great lines stay in the mind and are a help and a hope.No wonder so many people have found in reading him as John Stuart Mill reports in his 'Autobiography' a way out of despair.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "Wordsworth's descriptions and comparisons are so vivid that you feel like you're in the setting to poem is striving to create. This is a truly remarkable example of fine poetry. Wordsworth commonly uses the rhyme scheme ABAB in his quatrains and AABCCB for his sestets. He writes quite a few of his poems in pastoral form, which a focus on nature, but not devoid of a rhyme scheme. The length of his poems vary greatly, ranging from 2-214 pages long! His one 214 page long poem is obviously the highlight of the book: \"The Prelude, or Growth, of a Poet's Mind\". It's an autobiographical poem divided into sections due to it's longevity. A few of his poems are controversial (\"The Idiot Boy\"?!), the vast majority are fantastic. The mere fact that he was able to write a 214 page autobiographical poem shows what a great poet he was. It's great to read such a fine example of poetry. Highly recommended.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "collected poems",
        "description": "Pulitzer Prize winner Sylvia Plath's complete poetic works, edited and introduced by Ted Hughes. By the time of her death on 11, February 1963, Sylvia Plath had written a large bulk of poetry. To my knowledge, she never scrapped any of her poetic efforts. With one or two exceptions, she brought every piece she worked on to some final form acceptable to her, rejecting at most the odd verse, or a false head or a false tail. Her attitude to her verse was artisan-like: if she couldn't get a table out of the material, she was quite happy to get a chair, or even a toy. The end product for her was not so much a successful poem, as something that had temporarily exhausted her ingenuity. So this book contains not merely what verse she saved, but-after 1956-all she wrote. - Ted Hughes, from the Introduction",
        "authors": "['Sylvia Plath']",
        "infoLink": "https://play.google.com/store/books/details?id=49_hDAAAQBAJ&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have always been transfixed by this man's poetry. Roethke possessed a way of speaking in his poetry that was both confessional and deeply spiritual. He was beyond doubt one of the greatest American poets of the 20th Century. Some of his poems, like Journey to the Interior, The Far Field, The Lost Son, and so many others create an almost religious experience in the reader.Roethke suffered from bipolar disorder throughout most of his life, and this experience (extreme emotional ups and downs) colored his vision of the world around him. But there is no trace of self-pity, and no great emphasis on depression or death. Instead, love, time, age, and the mystery of life are the themes of his poetry. He saw life as a religious experience, and was essentially a pantheist at heart.This is a book to give as a gift to some Seeker, if you are lucky enough to know someone who fits into that category. It's a book to guide, inform, and heal a life.",
                "review/helpfulness": "44/44",
                "num_reviews": 44
            },
            {
                "review/text": "Gosh, I love Sylvia Plath's prose and poetry. I could read and reread some of her poems again and again. This is a great collection of her poems. I keep this book loose on my bookshelf when I feel like getting shivers up my spine before I go to sleep. There are some poems that I can just read and reread over and over again that make me feel... oh, mysterious, anxious, happy, perplexed... and Sylvia Plath is one of the poets who has written multiple poems that give me those feelings. Most people who like poetry are familiar with Mirror or Daddy, but there are other poems that people don't know about. I loved the sonnet &quot;To Time&quot; and the poem &quot;Mystic.&quot; It is interesting to read her poems knowing what she was going through... reading the poems that coincide with certain events in her life, like her marriage to Ted Hughes, and poems that she wrote about her attempted suicides. I suggest this collection to anyone who is interested in this woman... and I also recommend that you read The Bell Jar as you read her poems, or maybe a few of her journal entries. Sylvia Plath is one of those poets that writes about herself, and knowing background on her life is crucial in understanding these poems. Well, you can decide for yourself.",
                "review/helpfulness": "28/34",
                "num_reviews": 34
            },
            {
                "review/text": "It doesn't matter what you think about Sylvia Plath; her suicides, dependence on Ted Hughes, the relationship she had with her mother, her poems about \"Daddy, the very depth of the darkness she held inside. It doesn't matter a damn. What matters is the writing, the beauty of the words, the music in her voice.\"The Collected Poems\" won the Pulitzer. Some may disagree with this choice, but what do they know. Sylvia was a genius.The poems are from 1956-1963...\"Southern Sunrise\" 1956SP uses the imagery of color- lemon,mango, peach, pinapple barked, green crescent of palms, quartz clear, blue drench, red watermelon sun. One can see she was happy when she wrote this poem. (Probably just met Ted)\"Fiesta Melons\" 1956Bright green and thumpable/Laced over With stripes/Of turtle-dark green/Choose an egg shape/ a world shape/Bowl one homeward to taste/ in the whitehot noonI find it interesting how much SP's poems reveal about her state of mind as she wrote them. One can observe the progression of depression, her troubled marriage and lonliness, especially in the later poems 1960-63...\"Tulips\" 1961I am nobody/I have nothing to do with explosions.I didn't want any flowers/I only wanted/to lie with my hands turned up and be utterly empty.\"The Rival\" 1961(About Ted??)I wake to a mausoleum; you are here/Ticking your fingers on the marble table/looking for cigarettes/Spiteful as a woman, but not so nervous/ And dying to say something unanswerable.The Moon and the Yew Tree\" 1961Separated from my house by a row of headstones/ I simply cannot see where there is to get to.\"A Birthday Present\" 1962 (SP's struggle w/depression)I would have killed myself gladly that time any possible way/Now there are these veils, shimmering like curtains./The diaphanous satins of a January window/White as babies' bedding and glittering with dead breath. O ivory!\"Lesbos\" 1962 (SP's experimentation w/ lesbianism??)You say your husband is just no good to you/His Jew Mama guards his sweet sex like a pearl/You have one baby, I have two/I should sit on a rock off Cornwall and comb my hair./ I should wear tiger pants, /I should have an affair/ We should meet in another life,/ we should meet in air/ Me and you.People are fascinated w/ SP, her confessional poetry, giving us a glimse into her world. We feel as if we know her. And even though she appears strong and nasty at times, we see the sweetness behind it all, the lonliness, and somehow, like Marilyn Monroe, we would have liked to be her friend.1962-63 were Sylvia's darkest days and it shows in her poetry...\"Sheep in Fog\"The hills step off into whiteness/People or stars/Regard me sadly,/ I disapoint them.All morning the / Morning has been blackening.\"Daddy\"If I've killed one man, I've killed two/The vampire who said he was you/ (ted hughes)Who drank my blood for a seven years,/ if you want to know/ Daddy you can lie back now./There's a stake in your fat black heart/ And the villagers never liked you/They are dancing and stamping on you/They always knew it was you/ daddy, you bastard,/ I'm through.Sylvia Plath is somebody we want to know better, this is why we read her poetry. Although much of it is dark, the music of her voice still crys out with such precision and brilliance that we listen, we learn, and we continue reading the words she left behind.\"Death & Co.\"I do not stir.The frost makes a flower,The dew makes a star,The dead bell,The dead bell.Someboy's done for.",
                "review/helpfulness": "26/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book is the most complete collection of Sylvia Plath's poetry assembled in one volume. It is for this reason that it belongs almost as required reading, not just in American english programs, but in secondary schools everywhere. It's value lies in it's progression of a female poet and her journey towards finding her true voice. We see the early poems, methodically and skillfully written, shedding style after style of obvious influences through excercises of observation and perserverance. Through these verses, she explores and develops an intricate mythology; by the end, however, she has not lost us in her private world of symbolism and imagery, but enthralls us, heartbreakingly, through the mastery of her words. These last poems, that made up her final manuscript, are undisputedly some of the most moving and beautifully executed compositions of this past century. It is a wonderful book, one that forever changes the way the reader interprets art and the world around him that inspires it.",
                "review/helpfulness": "29/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book of collected poems is the most treasured book that I own. My copy is absolutely falling apart - I have to keep it in its own special box.",
                "review/helpfulness": "22/25",
                "num_reviews": 25
            },
            {
                "review/text": "\"A late rose ravages the casual eye,\" writes Roethke in A Walk in Late Summer, \"a blaze of being on a central stem.\" In such images we see the symbols of nature fully tapped in modern poetry -- and tapped in American English, in fresh, vivid language that overpowers the reader with its grace and presence. The poetry of Theodore Roethke is written by a man profoundly alive -- skirting the edge of suicide, losing his voice in the awe of love, reeling wildly in the throes of \"the pure fury,\" and looking at last with calm eyes into infinity and his own undoing in the Far Field. Roethke was a true descendent of Whitman where the latter wrote \"This is no book / Who touches this touches a man.\" But Roethke's poetry moves us as much by its lyrical language as by the power and wisdom of its experience. Roethke himself was, as represented by his art alone, a \"blaze of being.\"Among Roethke's contributions to literature are his poems that treat depression. Far from letting his manic episodes paralyze him, he used them to write some his most intense poetry. \"In a Dark Time\" is one of the immortal poems of the 20th century, worthy to be set aside a Van Gogh painting. Roethke was not alone in treating these subjects: two other Pulitzer Prize-winning poets of his time, Sylvia Plath and Anne Sexton, learned from him and wrote about similar themes. But Roethke's writing stands out in two ways from these poets and other poets the 50's and 60's.One is the unity of his work and vision -- this Collected Poems traces a single spiritual journey beginning with his childhood memories of the greenhouse, and ending somewhere among \"the windy cliffs of forever\", last visions tragically cut short by his early death. Between those points are rendered all of the experiences of his life -- as he wrote in his first poem, \"my heart keeps open-house.\" But he never fails to interpret these experiences and understand their significance in the larger picture of his life and poetry. Unlike so much of the poetry of Sylvia Plath and other Confessional poets, Roethke never demands that you read his biography to understand his symbolism. Rather, his symbols develop among his poems to form a kind of mythology: his recurring symbols include stones, fire, light, \"the small,\" and the spirit.The other difference between Roethke and other poets of his time is his technique. Roethke is never obscure; he always writes in fresh language, avoiding cliches, although his symbols are indeed personal and take time to understand. Roethke's craft is \"strict and pure,\" such that even the staunchest defenders of Sylvia Plath have confessed that Roethke's writing is more disciplined. The Deep Image movement of poets like Robert Bly and James Wright is influenced by the kind of symbolism found throughout Roethke's poetry, and those writers have acknowledged their debt to him. Roethke retained rhyme and meter in a time when all the conventions of poetry were being ripped apart; and he did so with a consummate technical skill not to be found in the Beatniks or in the Black Mountain poets. Roethke's ear for poetry is much more sensitive than that of other poets of his time. We are gagged by the lyricism in lines like\"She came toward me in the flowing air,A shape of change, encircled by its fire.\"(\"The Dream\")\"When allMy waterfallFancies sway awayFrom me, in the sea's silence...\"(\"Her Time\")\"O love, you who hearThe slow tick of timeIn your sea-buried ear...\"(\"Song\")The most exhilarating of all these are Roethke's love poems in \"Words for the Wind\", which justly won the Bollingen Prize and the National Book Award. These poems are unmatched for eloquence and spiritual intensity -- and it's a damn shame that modern anthologies do not reprint them, aside from the famous \"I Knew a Woman.\" For it is in these love poems that Roethke's soul soars, and his poetic power is fully realized.\"She knew the grammar of least motion.\"(\"The Dream\")\"Light listened when she sang.\"(\"Light Listened\")\"I measure time by how a body sways.\"(\"I Knew a Woman\").Theodore Roethke achieved greatness in art by having the courage to confront the most intense human experiences and the skill to craft them into some of the most eloquent poems of his time. If there is ONE modern poet you will read, let it be Roethke. His \"Collected Poems\" is a must for every poet and every lover of poetry.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I was eagerly expecting this book.The poetry of Plath does not need any more praises, for her name and fame already bring with themselves all the admiration from the critics and the public alike, amassed in time with sustained ardour.But what did negatively surprised me for a book of collected poems from such a renowned author was the overall quality of the volume's presentation. The paper severely lacks in quality. It's of course darker than the usual good quality paper and it is a bit coarse. I would've probably suggested a laminated book cover, rather than the plain and frail paperback, which can easily get stained (and you couldn't clean it as efficiently as a laminated one), if not a hardback.My opinion always was that the presentation of a book should at least try to come close to the art of an author's creation. But this certainly isn't the case here. I'm disappointed.I give with all one's heart 5 stars to the poetry of Sylvia Plath, and also to the introduction and notes, and 1 star to the quality of the book. If it would be possible to Amazon to introduce two kind of item rates: one for the writer's efficacy as a literary craftsman and another one for the book's presentation.",
                "review/helpfulness": "18/23",
                "num_reviews": 23
            },
            {
                "review/text": "ROBERT HAYDEN (1913-1980) was the first African-American to be appointed Consultant in Poetry to the Library of Congress, a position now titled the U.S. Poet Laureate. He won numerous prizes and awards during the last decade of his life, including the 1975 Fellowship from the Academy of American Poets for \"distinguished poetic achievement.\" Hayden stands out among Twentieth Century American, poets not just for his many literary accomplishments, but for the strong vision of faith that illuminates so much of his work.In addition to well known poems such as \"Those Winter Sundays\" and \"The Whipping,\" this anthology contains other equally stirring poems including \"Aunt Jemima Of The Ocean Waves\" which depicts a conversation with the fat woman from a Coney Island side-show and \"Belsen, Day Of Liberation\" dedicated to Rosey Pool, the Dutch teacher of Anne Frank and first translator of her famous diary.While Hayden writes much about African-American history and culture, his poems do not tell the reader what to think or feel. Instead, his carefully crafted verse weaves images that allow the careful reader to move around in some very unusual territory, some beautiful, some uncomfortable. Hayden puts us in the mind of the oppressor in poems like \"Middle Passage\" about the famous Amistad incident, and \"Night, Death, Mississippi\" where we eavesdrop on an old Klan member too frail to attend a lynching with his son, of whom he is proud. \"Be there with Boy and the rest / if I was well again. / Time was. Time was. / White robes like moonlight / In the sweetgum dark.\"Hayden can also be wickedly funny. In \"American Journal\" written a few years before his death, his narrator is a spy from a distant planet in the galaxy who reports back to his fellow superiors about \"this baffling multi people extremes and variegations their noise restlessness their almost frightening energy.\"In addition to poems about childhood, society, and race, Hayden also writes about the history and central figures of his religion, the Bah&aacute;'&iacute; Faith. In \"Baha' u'llah In The Garden Of Ridwan\" he compares the founder of Bah&aacute;'&iacute; at an important juncture to Christ the night before being crucified w ho prayed to be relieved of his great destiny. In \"Dawnbreaker\" Hayden describes the torture of one early Bah&aacute;'&iacute; put to death by having candles of oil and wick lit within his skin. \"Ablaze / with candles sconced / in weeping eyes / of wounds.\"Despite his numerous awards, Hayden was not well known to many poetry readers until the end of his life. Fortunately, his reputation has increased since Collected Poems was published posthumously. If you are interested in rich, well crafted poetry which explores what it means to be human, try Hayden. As Aunt Jemima says in the above mentioned poem, \"And that's the beauty part, I mean, ain't that the beauty part.\"",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "I love Roethke and I can't stop loving him. His words, phrases, rhythms, thoughts, feelings and meditations stick with me. I will go a year or two without reading his work, but he is still there shaping the way I see the world. His poetry occupies the same space in my mind as Brian Eno's transcendent work On Land. It's meditative, quiet, and joyful and yet, sweaty, ominous, and alarming, all at the same time.The Far Field (North American Sequence) incarnates this feeling for me. Roethke meditates on his own mortality (don't all poets?) and finds a vast encompassing love for life. A love not only for the &quot;growing rose,&quot; but also, seemingly for the summer heat and the stench of dead buffalo, &quot;their damp fur drying in the sun.&quot; He sees beauty in nature but also &quot;redolent disorder&quot; and he calls life &quot;This ambush, this silence.&quot;I agree with him.Roethke proclaims a love for life which is similar to Nietzsche's concept of the Eternal Recurring. That is, he has learned to love life, the good and the evil, to such an extent that he would have it recur again and again, eternally. This kind of love is not a love for evil, rather it is a willingness to sit behind the window of one's pain and still look out and see the beauty. This takes great courage.Roethke's influences are obvious. What American poet could escape Whitman and his lineage, Thoreau, Henry Miller, etc.? I'm sure he read his fair share of Nietzsche. I also note, Roethke's style seems to have changed drastically towards the end of his life. I believe this was probably partly in reaction to the Beats. However, in my opinion he swallows the Beats whole and makes something new of them. Roethke's verse also periodically has the ring of Wallace Stevens, and sometimes Robert Frost. Some of his verses sound like bad seventies self-help schtick; &quot;I long for the imperishable quiet at the heart of form,&quot; etc.I only go into these criticisms so I can make a larger point. Roethke's metaphors are sometimes, seemingly, larger than their implication, sometimes they are derivative, sometimes clunky. But, his work, for me, has an almost Biblical air to it. By this I mean his work resonates on a mythological level. His ideas are broad and go to the heart without ignoring the blood and stench of life. At the same time, yes, his ideas are broad, however, his details, while often being merely enumerative, are true. By this I mean, they come from a real eye roving across a real landscape. He is, at once, strange and familiar.I would hope that Academia would catch up with Roethke. It seems that he is being unfairly ignored.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I thought I owned all the poems she had because I had \"Crossing the Water\", \"The Colossus\", and \"Ariel\". But this book has a large number of unpublished poems, and poems that were published but not selected for those collections. In addition, the footnotes and commentary by her husband Ted Hughes are invaluable and fascinating. A must for Plath scholars and fans.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "ariel",
        "description": "\"Part post-apocalypse, part road-trip, part sword-and-sorcery . . . One of my favorite adventure novels of all time.\" -Cory Doctorow At four-thirty one Saturday afternoon the laws of physics as we know them underwent a change. Electronic devices, cars, industries stopped. The lights went out. Any technology more complicated than a lever or pulley simply wouldn't work. A new set of rules took its place-laws that could only be called magic. Ninety-nine percent of humanity has simply vanished. Cities lie abandoned. Supernatural creatures wander the silenced achievements of a halted civilization. Pete Garey has survived the Change and its ensuing chaos. He wanders the southeastern United States, scavenging, lying low. Learning. One day he makes an unexpected friend: a smartassed unicorn with serious attitude. Pete names her Ariel and teaches her how to talk, how to read, and how to survive in a world in which a unicorn horn has become a highly prized commodity. When they learn that there is a price quite literally on Ariel's head, the two unlikely companions set out from Atlanta to Manhattan to confront the sorcerer who wants her horn. And so begins a haunting, epic, and surprisingly funny journey through the remnants of a halted civilization in a desolated world.",
        "authors": "['Steven R. Boyett']",
        "infoLink": "https://play.google.com/store/books/details?id=y2MkAwAAQBAJ&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 17.0,
        "review": [
            {
                "review/text": "Now at long last, we get the \"Ariel\" we deserve. Plath's admirers have been waiting a long time, since at least the early 1980s when Ted Hughes first revealed that he had changed the order of the poems in his wife's final manuscript. He had added some poems--the final, freezingly depressing ones--and then re-arranaged the bulk of the book to leave an impression of a woman gone over the brink into a chilling fugue state. Now Frieda Hughes, Plath's daughter, 2 when her mother killed herself, has performed a ritual act of atonement to her mother's memory, and given us the original, \"happy\" (relatively speaking) ARIEL which we have never been able to see.At $24,95, the book's a little expensive, but it feels as though money had been spent on its planning and execution, so you don't feel rooked. In one section, the gray paper on which the facsimile materials are printed is easy on the eyes, aiding the eye as it struggles with Plath's numerous emendations. We get the notes Plath wrote for her own use when she had to do that reading at the BBC towards the end, the more-British-than-thou reading we have grown to love and hate at the same time. Frieda Hughes contributes an interesting and contextualizing introduction in which she seeks to reconcile the differing viewpoints of her mother and father--a challenging task, but she's up to it. The book ends up with four of the bee-keeping poems--and another in the appendix, \"The Swarm,\" which Sylvia kept changing her mind about including. Should she leave it in? Take it out? The title is in brackets. Thus the book ends with a hopeful note, with the freshness of Devon instead of the bleak London winter. It ends, pleasantly enough, with the words, \"They taste the spring.\"",
                "review/helpfulness": "62/69",
                "num_reviews": 69
            },
            {
                "review/text": "When Sylvia Plath stuck her head in an oven in 1963, she left behind a series of uniquely vicious, angry, cathartic poetry. One bundle was written between her separation from her husband Ted Hughes and her death in February 1963. The poems were entitled \"Ariel\" and she stopped working on them around November 1963. She wrote some more poems, the last ones days before her death, but they were not included in the original \"Ariel\" manuscript. After her death, Ted Hughes rearranged Ariel, taking out some of the original poems and inserting some of her last poems. Now, for the first time, we have the original Ariel manuscript, with all the excised poems reinserted and all the inserted poems excised.The differences between the two \"Ariels\" are a study in psychology. Hughes' editted \"Ariel\" is tragic: the last poem, \"Edge\", was also the last poem Plath ever wrote, and is obviously a poem about death:The woman is perfected.Her deadBody wears the smile of accomplishment,The illusion of a Greek necessityFlows in the scrolls of her toga,Her bareFeet seem to be saying:We have come so far, it is over.For Hughes, \"Ariel\" was a tragedy, with an angry and perhaps unbalanced woman fighting her internal demons until they ate her up \"like air,\" as Plath would say in one of her most famous poems, \"Lady Lazarus.\" Hughes' Ariel ends with Plath's figurative suicide. The guilt Hughes felt about his wife's death (he had an affair, and that set her off on her final manic depressive tailspin) was something he apparently never got over according to his family and friends. Before his death, he published a series of poems devoted to Plath called \"Birthday Letters,\" and they are very touching -- a man facing death, still longing for a woman who died over 30 years ago. In \"The Offers,\" (not in Birthday Letters), Hughes, Aeneas-like, meets Plath in the otherworld, and she sternly tells him, \"This time, don't fail me.\"Plath's \"Ariel,\" however, is quite different. Yes, \"Daddy\" is there, as is \"Lady Lazarus,\" and now also a scathing poem called \"The Rabbit Catcher\" in which Plath describes her bond with Hughes thus:And we, too, had a relationship --Tight wires between us,Pegs too deep to unroot, and a mind like a ringSliding shut on some quick thingThe constriction killing me also.Not exactly \"feel good\" poetry. However, Plath's \"Ariel\" is far from a poetic suicide note -- it is angry, it is vicious, but it is cathartic. The first word in the series of poems is \"Love\" and the final word is \"spring.\" Reading Plath's \"Ariel,\" one senses a woman excising her personal demons with words, stamping out her enemies (her husband, father, mother, romantic rivals) with poetic vitriol. The final poem included in Plath's manuscript is called \"Wintering,\" but ends with the upbeat, life-affirming line: \"The bees are flying. They taste the spring.\"This edition of \"Ariel\" has a foreward by Plaths daughter, Frieda Hughes, in which she tries both to defend her father against his critics and to understand her mother's inner demons. She sums it up like this: \"Representing my mother's vision and experience at a particular time in her life during great emotional turmoil, these Ariel poems -- this harnessing of her own inner forces by my mother herself -- speak for themselves.\" There's also replicas of Plath's original typewritten Ariel poems, and an interview with Hughes at the end of the book.Hughes' \"Ariel\" is about a woman whose fury and anguish drives her to her grave. It perhaps reflects his own grief and guilt. Plath's \"Ariel\" is about a woman (perhaps Lady Lazarus) eviscerating her enemies, Medea-like, and then ready to live life again. That she ultimately failed to conquer her own demons does not diminish the revelation that is Plath's \"Ariel.\" All her poems are collected chronologically in \"Collected Poems\". But this \"Ariel\" is a must for anyone interested in Sylvia Plath, her life, and most of all, her poetry.",
                "review/helpfulness": "60/62",
                "num_reviews": 62
            },
            {
                "review/text": "Sylvia Plath and Denise Lermontov were the two most powerful female American poets of the 20th century. When I was in my teens and a &quot;would-be&quot; poet, I had a copy of Ariel that I rarely let out of my sight. She is the queen of angst. I greedily drank the concoction she distilled out of her anger, disillusionment and loathing. I felt the same way towards my parents as she did towards hers. Those who try to soft-pedal these poems and claim they're somehow life-affirming are deluding themselves. These are poems of despair, anguish and hopelesness, probably the most evocative expressions of those sentiments ever recorded. They will not put you in a good mood. These come from the dark night of utter isolation, written by a young, beautiful wife and mother who will soon stick her head in an oven and turn on the gas. They are about as pretty as Auschwitz. If you are looking for poetry that is morally uplifting, look elsewhere. If the paintings of Bosch and Breughel hold some fascination for you and you don't flinch from visions of the damned, then this work will appeal to you. For some reason, I think of Sylvia Plath and Diane Arbus as artistic sisters. Both show us things we probably didn't really want to see, but it's impossible to look away when confronted with the images they depicted. Art is sometimes disturbing. This is one unsettling volume of poetry.",
                "review/helpfulness": "39/50",
                "num_reviews": 50
            },
            {
                "review/text": "Ariel is a collection of the last poems Sylvia Plath ever wrote. Furthermore, the poems were written during the last months of her life, which were very bleak months indeed. Plath's husband, Ted Hughes, had just left her for another woman, and she was left to watch over her two young children in the middle of a freezing cold winter in a small apartment that was not heated. Because of these circumstances, a lot of the poems included in &quot;Ariel&quot; are depressing; however, the poems are also strikingly beautiful. They show the human condition at its absolute lowest point: hopeless, stark, terrifying.Plath eventually ends her life by commiting suicide in a dramatic way: sticking her head in an oven and leaving it there. It was her third suicide attempt, and the other two were pretty dramatic as well. Plath addresses these suicide attempts, and how it felt to survive the other two, in one of her most famous poems from Ariel, &quot;Lady Lazarus&quot;: &quot;I have done it again./ One year in every ten/ I manage it-/ A sort of walking miracle/ my skin Bright as a Nazi lampshade.../ And I a smiling woman/ am only thirty./ And like the cat I have nine times to die./ This is Number Three./ What a trash/ To annihilate each decade.../ Dying Is an art,/ like everything else/I do it exceptionally well./ Herr God, Herr Lucifer Beware/ Beware./ Out of the ash/ I rise with my red hair/ And I eat men like air.&quot;The Nazi theme continues in Plath's poem &quot;Daddy&quot;, in which she accuses her father of being similar to Hitler, and compares her husband to her father as well, writing about how they both had negative influences in her life. &quot;I have always been sacred of you,/ With your Luftwaffe, your gobbledygoo./ And your neat mustache/ And your Aryan eye, bright blue./ Panzer-man, panzer-man, O You-/ Not God but a swastika/ So black no sky could squeak through./ Every woman adores a Fascist,/ The boot in the face, the brute/ Brute heart of a brute like you..../ I was ten when they buried you./ At twenty I tried to die/ And get back, back, back to you./ I thought even the bones would do./ But they pulled me out of the sack, And they stuck me together with glue./ And then I knew what to do./ I made a model of you, A man in black with a Meinkampf look/ And a love of the rack and the screw./ And I said I do, I do./ So daddy, I'm finally through./ If I've killed one man, I've killed two-/ The vampire who said he was you/ And drank my blood for a year,/ Seven years, if you want to know./ Daddy, you can lie back now.&quot;These are two of the most well-known examples of the bleakness but truthfulness in Plath's poetry. They reach toward the human emotions everyone knows- pain, sorrow, bitterness, lonliness. However, Plath also wrote some humourous and sweet poems which are included in Ariel, including poems about her children and good memories. These poems add a lightness to the book which is otherwise dark and dreary. Although the reader is tempted to hate a book filled with such depressing poetry, no one can resist loving it. This book is, in my opinion, one of the best poetry volumes of Twentieth Century American Literature, and it will find a place in your heart. If you have not read Ariel, I greatly recommend it. Through the autobiographical poems found within it you will connect with Plath's disillusionment and also come to know a great deal about the poetic genius' troubled life and last days.",
                "review/helpfulness": "37/40",
                "num_reviews": 40
            },
            {
                "review/text": "as the publisher's weekly blurb states, these are not new poems, so don't get swept up in the \"what plath fans have all been waiting for...\". all of the poems shown here were published in the 1981 edition of Plath's Collected Poems by the devilish Ted Hughes.So, why this edition? It's interesting to see someone's own manuscripts -- but interesting to whom? Plath fans. people mildly interested in Plath or new to her may feel a strain in deciding which version to read much like a confused customer i helped at a book store once displayed when I tried to explain that there are multiple versions of Leaves of Grass...But which one should a reader new to Plath read? her version or Hughes's version? A purist (like me) would argue that her version is what to read. But someone interested in Ariel in an academic setting would be best served picking up the Hughes' version.It is important for readers (academic or not) to realize that editors have often been the unseen geniuses (and villains) behind great works. I'm not calling Hughes a genius -- I'm just suggesting that perhaps both versions can teach us something about Plath -- regardless of our interest level.",
                "review/helpfulness": "27/34",
                "num_reviews": 34
            },
            {
                "review/text": "These poems are scathing and beautiful. It is not a long work, but it requires multiple readings to break into its core. A greatly UNDERrated work that should have won the Pulitzer, I think &quot;Ariel&quot; stands alone much stronger than her Collected Poems, which actually DID win the Pulitzer. The emotions are huge and fiery, and the language is second to none. Plath has an ear for music in language, and shows it wonderfully in &quot;Lady Lazarus,&quot; &quot;Daddy,&quot; &quot;Fever 103,&quot; and &quot;Ariel,&quot; where she rides her horse into &quot;the red eye, the cauldren of morning.&quot; Brilliant work by a sometimes misinterpreted and mis-categorized writer. Don't read it to wallow in depression-- read it to hear a unique and truly gifted voice. Brava, Sylvia Plath! Your time came too soon.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "\"I am writing the best poems of my life... They will make my name.\" --Sylvia Plath, on the Ariel poemsIt is a pity that Sylvia Plath is so underestimated--most people I know have never heard of her, and those who have dismiss her as an angry feminist who committed suicide. It is a sacrilege to sum up her person so: Plath is one of the most important poets of our century, and Ariel her most important work.In it one can find the famous poems \"Daddy\", in which Plath shakes loose her restraints on her resentment for her father, who died when she was young: \"At twenty I tried to die/ And get back, back, back to you... But they pulled me out of the sack / And they stuck me together with glue.\" ; \"Lady Lazarus\", a commentary of death and disappointment, which reflects her situation with terrible lyricism; and \"Fever 103\", which, to me, is almost mocking; and \"Ariel\", after which the collection is named.Ariel is fascinating--her skill with words, her wit, her self-control (for she obviously reigns herself in from being too emotional, too confessional, and yet one feels the pain and torment all the same, perhaps even more sharply), her ability to find Just the Right Words, is vivid and brilliant. When I finished Ariel, I was left with a feeling of vulnerability, pain, and enlightenment, as though I had seen what I had been missing all along and felt the absence of self-delusion deeply.I have always been disturbed by the idea that Plath's creative energy seemed to stream from the destructive void that she felt inside of her soul and shared with the world, with skill and admirable lyricism... and yet I think that this is what made her such a *different*, unique poet. \"Dying / Is an art, like everything else.\" She did it exceptionally well. -- K. Rivera",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "Ariel by Sylvia Plath is my favorite volume of poetry, so when I heard Frieda Hughes was editing a restored edition of her mother's second full-length collection, I was thrilled. However, upon reading the book in Plath's own layout, I was not as enraptured with the work. As much as it pains me to admit it, Ted Hughes did an excellent job in editing the version of Ariel that was published in 1965.In the 1965 version, the heart of the manuscript was--as literary critics have called--\"The Bee Sequence.\" Originally, Plath chose to end her manuscript with the sequence, leaving out the poem \"The Swarm,\" which leaves the sequence less developed. While Plath ended with the Bee Poems, Hughes ended the book with the more forceful poems \"Contusion,\" \"Edge,\" and \"Words.\"Also, one of Plath's more overlooked poems \"The Munich Mannequins\" was also left out in Plath's original layout. Considering that one of the driving forces of the book is the World War II allusions, Hughes's choice in including it in the 1965 edition was sound.In addition to the less developed and complex version of Ariel, Frieda Hughes does include a facsimile of the original manuscript, which is really what saves this edition. Any Plath enthusiast would be happy with this book, if only for the facsimile. But then Frieda Hughes couldn't have made the book as thick as it was; therefore, she would make less money.To be honest, it is really only a book for people who are already Plath fans. If you're interested in her work, check out the 1965 edition.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "To say that ARIEL is a stunning book of poetry does not seem adequate. Reading ARIEL is like opening a Pandora's box of strange beauties, nightmares, furies, sorrows, and surreal sweetnesses, as in &quot;Morning Song&quot;, in which the poet whispers to her sleeping child: &quot;All night your moth-breath/Flickers among the flat pink roses. I wake to listen:/A far sea moves in my ear.&quot; Unlike Pandora's box, there is no hope at the end of Ariel, only &quot;fixed stars&quot; and the moon &quot;staring from her hood of bone&quot;.In ARIEL, Plath seemed to almost shamanistically reach into realities just beneath the surface of everyday life, hauling them to consciousness with a skill almost unequaled in contemporary poetry. ARIEL stands as an unrivaled poetic achievement, written in a mesmerising and indelibly haunting voice.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Some of the poems are difficult to understand the first time, others are like a window where you can watch life. But in the end, all of them come to an understanding of simple things, like a finger cut, and complex ones, like dying. The intensity that run free from the pages, the fire that try to burn your fingertips with every word, and the truth that pierce your hearth, is what it makes this book a jewel.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "fearful symmetry a study of william blake",
        "description": "This brilliant outline of Blake's thought and commentary on his poetry comes on the crest of the current interest in Blake, and carries us further towards an understanding of his work than any previous study. Here is a dear and complete solution to the riddles of the longer poems, the so-called \"Prophecies,\" and a demonstration of Blake's insight that will amaze the modern reader. The first section of the book shows how Blake arrived at a theory of knowledge that was also, for him, a theory of religion, of human life and of art, and how this rigorously defined system of ideas found expression in the complicated but consistent symbolism of his poetry. The second and third parts, after indicating the relation of Blake to English literature and the intellectual atmosphere of his own time, explain the meaning of Blake's poems and the significance of their characters.",
        "authors": "['Northrop Frye']",
        "infoLink": "https://play.google.com/store/books/details?id=4cOcHsKhzrgC&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "One disadvantage of browsing online bookstores is that you can't simply skim the cover blurbs; sometimes you just have to settle for the opinions of strangers like me. So it may be helpful to read the quotes on the back cover of my copy of 'Fearful Symmetry.'&quot;To say it is a magnificent, extraordinary book is to praise it as it should be praised, but in doing so one gives little idea of the huge scope of the book and of its fiery understanding . Several great poets have written of Blake, but this book, I believe, is the first to show the full magnitude of Blake's mind, its vast creative thought.&quot; -- Edith Sitwell, 'The Spectator'&quot;According as we agree or disagree with Mr. Frye's contention we shall decide finally on the supremacy of his book. In following the structure of Blake's total vision and relating it to the thought of his age he has triumphantly carried out a task which, given the giant shape of the material, cannot help being immense. His cadences, by sheer explanatory devotion, approach the sonorities of Blake's own.&quot; -- 'Times Literary Supplement'&quot;Frye conducts his ambitious study with unflagging energy, great enthusiasm, and immense erudition.&quot; -- 'Poetry'&quot;An intelligent and beautifully written critical interpretation of the poetry and symbolic thought of William Blake...&quot; -- 'New Yorker'My opinion: Northrop Frye's literary criticism manages to shift the ground underfoot in the same rare way Blake's poetry does. Frye was the first to crack Blake's code, remove from him the labels of Mystic and Nutcase, and reveal him as a poet who systematically recreates the world. Frye taught Blake to Jesuits, Communist organizers, deans of women, and angry young poets. He was continually pleased to encounter doctors, housewives, clergymen, teachers, blue-collar workers, and shopkeepers, all with a great and deep appreciation of Blake.Frye's deep appreciation and admiration for Blake comes through on every page, six times over. I reread this book about every five years, each time coming away seeing the world upside down, inside out, and worth renovating.",
                "review/helpfulness": "93/98",
                "num_reviews": 98
            },
            {
                "review/text": "Blake sets us in the middle of a rich mythological structure. This is the best book for explaining what that structure is and how Blake will come to an element and illuminate sometimes inconsistent characteristics of that element if viewed in a limited selection. And yet when Blake's work is examined as a whole an encompassing structure is revealed where each part has been carefully delineated and accurately described throughout. Since Blake's collected works are rather massive it is very helpful to have an overview of Blake's view of man when examining how any one particular image is dealt with in a poem. Else, one might think that Blake's portrayals are incongruent from poem to poem, while his vision is actually quite cohesive. Frye wrote another excellent essay on Blake, the title has something to do with the Fourfold Key. It shows the structural similarity between Blake, Marx and Freud.",
                "review/helpfulness": "37/44",
                "num_reviews": 44
            },
            {
                "review/text": "I have a much clearer sense of Blake's writings now that I've read this book. I took a long time in finishing it, reading some major poems by W.B. at the same time. This is really an exciting book; it brings to life a whole universe - that lived in the poet's imagination. Blake is alive today (in the spirit of his artistic creations) I am convinced. William Blake had a great gift for describing aspects of real life in a way that was inspired by the Bible, and some other imaginative or visionary artists and poets; he was also highly opinionated. It's impressive how well Frye understood Blake's gift, and his personal life, which also makes a strand of this effort, which is a literary effort in it's own right. Anyone with an interest in Blake ought to read this book. It's a tool that allows one to approach Blake's creations of writing and visual artistry with an active (as well as open) mind.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Some time ago I reread Northrop Frye's Fearful Symmetry before having another read through of the poems of William Blake including the longer poems The Four Zoas, Milton and Jerusalem. Despite my appreciation of Frye's book I was struck by the disconnect between many of Frye's well-expressed and coherent ideas and the poems themselves. I noticed also that Frye barely quoted from any of the poems or analyzed any passage specifically. At that point I started to look around for other texts which offered a different viewpoint from Frye to see if my dissatisfaction was justified or not. The more I read the alternative views the more convinced I became that Frye's account was seriously deficient. I do not think he is entirely wrong or that there is nothing of value in his book. However, I strongly recommend that readers interested in Blake's poetry read alternative views. The ones I have found most useful and interesting include the following: The Four Zoas (Photographic Facsimile (Magno & Erdman), Narrative Unbound (Donald Ault), The Dialectic of Vision (Fred Dortort), Dark Figures in the Desired Country (Gerda Norvig), The Traveler in the Evening (Morton Paley), Rethinking Blake's Textuality (Molly Rothenberg),Blake's Critique of Transcendence (Peter Otto) and some of the articles in Blake's Sublime Allegory (Curran & Wittreich Eds.) I might note that after doing all this reading of the poems and about Blake I am convinced that the unpublished The Four Zoas is the central and most significant poem Blake wrote and that both Milton and Jerusalem suffer in comparison with it. The problem that Blake may have realized with the Four Zoas was that it could never be published in its authentic form due to the graphic (for the time) psychosexual content of the illustrations (the subtitle of the poem is The Torments of Love and Jealousy).",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Northrop Frye manages to convey in sweeping master strokes the brilliance of William Blakes poetry and unlocks the mysteries of Blakes symbols. More importantly, Frye engages the reader in learning a new way to look at literature in general and open up his eyes to a deeper world.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "complete poems",
        "description": "\"Teems with sharp observation, profound moral insight, high satiric wit, and all manner of aesthetic delight.\" -The New York Times Book Review A Penguin Classic This definitive edition brings together all the works that Pulitzer Prize-winning Marianne Moore wished to preserve, covering more than sixty years of writing, and incorporating the final revisions she made to the texts. The poems demonstrate Moore's wide range of interests, moving from witty images of animals, sporting events, and social institutions, to thoughtful meditations on human nature. In entertaining informative notes, Moore reveals the inspiration for complete poems and individual lines within them. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "authors": "['Marianne Moore']",
        "infoLink": "http://books.google.nl/books?id=GfHkBy5MB6EC&dq=Complete+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "There are two editions of Keats's Complete Poems which Iadmire very much. This one edited by Jack Stillingerand published by The Belknap Press of Harvard University(ISBN: 0674154312) and the Penguin Classics, 3rdedition, edited by John Barnard (ISBN: 0140422102).I very much like the fuller notes and 6 Appendicesand the blunt, full, but suggestive chronology inthe Penguin, along with the complete writing andpublishing information fully written out ratherthan abbreviated into initials one might have tolook up.The importance of Jack Stillinger to Keats studies is citedby both John Barnard (Penguin classics edition of -TheComplete Poems-) and Elizabeth Cook (Oxford World'sClassics edition of -The Major Poems-, ISBN:0192840630). John Barnard says in his \"Introduction\":\"Jack Stillinger's -The Poems of John Keats- (Cambridge,Mass., 1978) and his -The Text of John Keats- (Cambridge,Mass., 1974) now give the fullest available account ofKeats's text, and are based on a comparision of theprinted texts with the wealth of manuscript material,now mainly in American libraries.\"And this edition compiled and edited by JackStillinger has it glories, too. The first of theseis the excellent \"Introduction,\" which has meaningfulinsights in it concerning Keats, but which can alsobe related to one's own experiences in life, thoughStillinger does not himself so relate them. A fewof these I like very much are: \"Obviously Keats hadan exceptionally keen sensitivity to the minuteparticulars of objects, sounds (as well as variousshades of silence), and motions in the world aroundhim.\" *** \"He nursed his brother Tom in a lengthyillness that ended in death on December 1st of thisyear [1818], and as an added complication he met andfell in love with Fanny Brawne. More than anythingelse, I think, it is this combined experience ofsuffering, death, and love all at once, against abackground of serious conversation, reading, andthinking, that accounts for Keats's sudden rise toexcellence in his poetry.\"There is no way, of course, to share Keats'spoetry in a review of this sort. To read it,experience it, think about it, and realizethe Beauty -- and also the Truth -- in itis the reward.-- Robert Kilgore.",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "It is often said prophets are never appreciated in their own land, and in the case of Basil Bunting this adage seems particularly apt. Praised by Ezra Pound, whose disciple he was, and feted by the likes of luminaries William Butler Yeats and TS Eliot, his work remained virtually unknown to the outside world until 1966, when the (North of England based) Fulcrum Press brought out Briggflatts, an epic poem drawing on elements of inner autobiography and Northumbrian folklore. Then his career kicked off in earnest, with the result that we are now able to see Bunting for what he is; a great Modernist poet whose work will undoubtedly last.This edition brings together the majority of Bunting's work he and his executors saw fit to preserve and is definitive. In it you can treat yourself to the First Book of Odes with its brief verses originally published in various magazines and pamphlets that published the work of poets prepared to make poetry count after the foggy Neo-Romanticism of the Georgians had all but rendered it irrelevant. Alongside is the Second Book of Odes, mainly assembled in 1965 after Bunting, neglected and working on a newspaper in Newcastle England had been rediscovered by counterculture poet Tom Pickard. These poems are brief and lyrical, reinforcing Bunting's belief that &quot;poetry is to be heard&quot;, and are sometimes hard to get into. However, they repay a certain amount of rereading and rapidly become memorable. The same can be said for the &quot;Overdrafts&quot; - free verse versions of poets as diverse as Horace, Virgil, Firdosi and Rudaki. Bunting spoke Persian fluently (he worked in Iran for part of his life) and his translations are highly accessible.The highpoint of the book, however, must be &quot;Briggflatts&quot;. &quot;Brag, sweet tenor bull/Descant on Rawthey's madrigal&quot;. It is described by the poet as &quot;an autobiography&quot;, but it communicates on a far deeper level than simply that. Items of myth, music and art are fused ably together, and the effect is of an English Modernist masterpiece rivalling Eliot's &quot;The Waste Land&quot; and Hart Crane's &quot;The Bridge&quot;. The poem experiments with sonata form, as do &quot;Villon&quot; and &quot;The Spoils&quot; among others.Bunting was Pound's follower, but he avoided his political excesses and linguistic boasting. He also perhaps managed a higher level of originality, for whilst like Pound and Eliot he was happy to draw on sources, Bunting seems to have weaved his heritage into his work in a way in which the joins are less obvious. His concern was primarily with music, and he had, whilst making it new, to make connections with sound in the manner of the Troubadours or wandering minstrels. His work deserves every new reader it gets.Enjoy",
                "review/helpfulness": "35/35",
                "num_reviews": 35
            },
            {
                "review/text": "Jack Stillinger devoted much of his professional life to establishing the definitive texts of Keats's poems. This painstaking work has resulted in a number of changes to the poems. As to the quality of the poetry itself, at his best Keats approaches Shakespeare, as in the Odes. Stillinger is also an excellent teacher; I had his course on Keats 26 years ago, and it was fascinating. While the other reviewers have done a very good job of describing the beauty of Keats's poetry, one point Stillinger made about Keats as a person is worth repeating: Keats was the one English romantic poet that you would want to ask for advice about a personal problem you had. All the rest, Blake, Wordsworth, Shelley (especially!), and Byron would have given you advice that, if followed, would have been wildly impractical. Keats, as shown by his letters, was not pretentious and had a large degree of human decency and common sense. While these characteristics are not one usually associated with romantic poets, I think that they contribute to the strength of his poetry.",
                "review/helpfulness": "30/33",
                "num_reviews": 33
            },
            {
                "review/text": "I believe that it was Robert Frost who commented with regards to modern poetry, that it was like playing tennis without a net. Marianne Moore created her own net - her poetry is built upon strict syllabic counts she imposed upon herself. The result is finely crafted poetry that is never self-indulgent.I have found her syllabic count to be a good way to introduce structure into student's poetry. I have found it to be a good writing exercise. And in using the structure in these ways, I have become ever more impressed with the quality of work she achieved. But more than the technical quality, I enjoy the humor and just plain fun of her animal poems.",
                "review/helpfulness": "26/31",
                "num_reviews": 31
            },
            {
                "review/text": "If you're sitting on a ledge overlooking a lush green valley on a gorgeous spring day, and you're reading Endymion, or Ode to a Nightingale, or The Eve of St Agnes, you could very well be so overwhelmed by the magnificence of creation that, without giving it a moment's thought, you would consign yourself to the breathtaking blue, to try to be one with it all, and because you've reached the absolute pinnacle of existence. How could you possibly top that?*ahem*This edition isn't annotated as well as it might be, but who cares? The poems are all there, and they're as heartbreakingly beautiful as ever. How can you--in all honesty--claim to have lived without having read Keats?",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "Marianne Moore's poetry is perceptive and unassuming. She often writes with a dry sense of humor. Her interest in sports, especially baseball, is also expressed in her poetry. She enjoys odd behavior in animals and writes about them just as they are. &quot;An Octopus&quot; is one of her longer poems and needs several readings to be appreciated. Moore creates poems that are filled with intuitive insight and beauty.",
                "review/helpfulness": "17/21",
                "num_reviews": 21
            },
            {
                "review/text": "I don't know upon what planet this poet was born, but it certainly wasn't earth. Blake is the ultimate Gnostic, the ascendent correspondent, the bringer of truth from regions we have no knowledge of. The core of his philosophy can be summed up in his assertion in &quot;The Marriage of Heaven and Hell:&quot; Thus men forgot that All deities reside in the human breast...Isaiah answer'd. I saw no God, nor heard any, in a finite organical perception; but my senses discover'd the infinite in every thing, and as I was then perswaded, &amp; remain confirm'd; that the voice of honest indignation is the voice of God.&quot;Blake is the poet of true revolution, true Romanticism and true spirit. This is the definitive volume of his life-work, without, it is true, the illustrations that augmented his genius. Yet there is no real necessity for etchings here, as the genius of his poetry will etch its own image in your mind if you are receptive to his universal symbolism. Blake was the first truly modern poet, prefiguring Mallarme, D.H. Lawrence, Baudelaire, in particular. He was also a great mythologyzer, the precursor of Campbell, Frazier, and even Alan Watts in many respects. The Penguin Edition is not illustrated, it's true, but there is so much to be mined here that one can easily lose oneself in the labyrinth of Blake's excavations.Recommended without reservations. A truly paradigm shifting poet and artist. Seek out his illustrative, divinely inspired watercolors, as well. A true visionary, if there ever was one!!BEK",
                "review/helpfulness": "17/20",
                "num_reviews": 20
            },
            {
                "review/text": "No personal library can be complete without at least a sampling of Keats, and this is the book that everyone should get. All the poems -- even the fragments -- are here, with line numbers included. The several appendices and letter excerpts make the collection even more valuable. If you are trying to decide which Keats collection to get, you have found the best.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "While I love Marianne Moore's poetry, I wish I could return my Kindle edition of her collected poems. First, as a sidebar, this collected version only contains the three line version of 'Poetry,' which was Moore's final version of the poem; however, in many anthologies, the considerably longer, original version of the poem is printed, and this is the source of the discrepancy at least one other person noted.Second, my issue with this edition seems to be the mantra of most poetry readers who buy Kindle versions of poems: the formatting stinks. While this edition is not nearly as bad as Kindle's free version of Blake's Songs of Innocence and Experience (which is formatted completely in prose), it does not preserve the formatting of the poetry as originally created by Moore. Moore makes considerable use of indentation, a matter of form which is vital to the function of her poems, and this version does not preserve it - every line is left-aligned. So while this is better than some other poetry collections for Kindle, I would highly suggest purchasing the print version in order to attain the complete experience of Moore's poetry.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "*** REVISED 5/12/12 ***Like the other reviewers here, I love Blake's poetry. From the short poems to the long, I think they're all great and among the best things ever printed in English.If you're looking for a scholarly edition of Blake, this might be the edition for you. Blake created a complex mythology filled with gods and worlds of his own invention, and that Alicia Ostriker's notes actually help make sense of that mythology is a true feat of scholarship.But if you're like most readers of Penguin Classics, you're looking for something you can read for enjoyment, and some of the editor's decisions have made enjoyment difficult.Though beloved shorter poems like the Songs of Innocence and Songs of Experience are just fine, many pages of the longer poems like \"America\" are marred by extra text in italics and brackets which are supposed to be variants from different versions of the poems. I could see putting these sorts of things in footnotes or endnotes, but they are actually right there in the text itself! You'll be given a stanza of a poem, and then the same stanza in brackets or italics with only minor variations. Here's an example from the beginning of \"Four Zoas\":\"Lost! Lost! Lost! are my Emanations Enion [come forth]O Enion[I am] We are become a Victim to the Living [I] Wehide in secretI have hidden [thee Enion in Jealous Despair] Jerusalemin Silent Contrition\" etc.This leaves you wondering which lines you should be reading and which you should be skipping, which occasionally detracts from the poetic experience, or at the very least forces your eye to be darting all over the page. I've never seen this in another Penguin book; I think it was a poor choice here.Finally, thank you so much to James M. Rawley and Chris for their reasonable and helpful objections to the previous wording of my review. The internet really can be a place for respectful, productive conversation.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "view with a grain of sand selected poems",
        "description": "A collection by the Nobel Prize winner reflects on the wonders of life in poems featuring a sister's postcard, the discovery of a new star, the ruins of Greece, and a bodybuilding contest",
        "authors": "['Wisława Szymborska', 'Stanisaw Baranczak']",
        "infoLink": "http://books.google.com/books?id=sQ_DXzm3TW4C&dq=View+with+a+Grain+of+Sand:+Selected+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Ahh... where do I begin to explain why I admire, adore, and revel in Szymborska's poetry? It all began in roughly 1996-97 when I learned that this Polish poet, previously unbeknown to me, had been awarded the Nobel Prize. While I don't consider the Swedish Academy to be the ultimate authority on good literature and count only several of the previous prize winners among my favorite authors (Solzhenitsyn, Pasternak, O'Neill to name a few), I anticipated that an encounter with her poetry is bound to be special. The brief biographical sketches I then read and her photograph emitted wisdom, modesty, and wit. Or at least that what I think I must have sensed at the moment. In any case, after reading several of Szymborska's poems on-line (at a wonderful site called 'Poems from the Planet Earth') I was irrevocably enamored with her verses. Since then I have read and reread them on occasions too numerous to be counted, and I've read them to friends and strangers.I find that Szymborska writes with great clarity, never failing to gracefully walk the fine line between excessive (hmm..) eloquence and ascetic laconism. Her metaphors and characterizations are incredibly precise, and her poetry is rich with aphorisms. At the same time, it has somewhat of a haiku-like quality. Whether writing of grand and global matters or of minute things and creatures she is critical yet humane, and -- very genuine. The poems are sharp and witty but never cynical. Simply put, Szymborska's work is sheer brilliance from a poet with love for the human and the inanimate.I wonder whether the paperback scheduled for release this autumn will contain new poems... On a final note -- all translations I have had the privelege to read (Maguire, Baranczak, Cavanagh) are marvelous -- an occurence that is very unusual, and, hence, very precious.",
                "review/helpfulness": "27/29",
                "num_reviews": 29
            },
            {
                "review/text": "This book was and still is my first poetry book; not because I haven't read anyone else's, but it's the first compilation that I was really willing to pay the often outrageous prices for. (LOL) I am not an avid poetry reader, nor am I familiar with the current favorite contemporary poets, but I find that she really does succinctly portray &quot;life's improbability as well as its transient beauty&quot; quite well.As a younger reader , I do have a bit of a problem identifying with the poetry that she writes pre-1972 (that is, the first few sections before the 'Could Have' section), because I don't really know much about it. As a note though, I probably should say that 'Nothing Twice,' which is about the probabilities of chance, from the pre-1972 section has been a real gem. Anyhow, the travelogues, the places, the books are things that frankly, I'd ask my parents and they probably wouldn't know either, or know very little about. I suppose if I researched enough, I would have no trouble understanding her message, but the stuff I really bought this book for was the pro-1972 sections. I can identify the issues because they're fairly general knowledge and have a certain mocking humor to some of them, but the words do just pull you in. The poems are addressed to one, and to all, and you feel like you're part of the whole. There are instances in which you feel like she's writing about you and the instances you've gone through, and that's what makes you feel amazed at the depth of understanding she has on these matters.I first discovered her poetry in my high school English class and was surprised to find this book as the only book available in my favorite bookstore (and costing almost triple the cost of a volume of poetry that must have been 600 pages long, with of course long-dead, long-cherished poets). Oh, wait--I did find another book containing her work (that I don't remember the name of) but I bought this one because there were simply more poems that I liked. After a month or two of muddling around and waiting for the price drop (which it didn't), I just gave up and bought it. I can't say that I've regretted that decision.And...if you still have trouble deciding, the Nobel Prize for Literature she won should be more than enough of a pull to help you decide. It wasn't as much of a deciding factor for me, but it's always nice to know that somewhere in the depths of the blackhole that is my room, I actually have nobel prize literature that I understand and can recommend to others...My favorite poems from her have been 'Could Have,' 'The Onion,' 'Discovery,' 'True love,' 'Under One Small Star,' 'Pi,' of course 'View with a grain of Sand' because of wordplay, but I find that every time I re-read it, I uncover more about the poems and so that favorites list keeps on getting longer and longer.It may sound a little strange, but I keep it with me when I travel for long periods of time away from home and turn to it when I have that rare solitary moment to really think about life and what its inner workings are because it just gives such a realistic criticism that you sort of go...wow. Never really thought about it like that before.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "I never cared much for poetry, but this book has changed my mind. I - who some might consider uneducated - am curious about what is experienced, within us and without us, in life. Still, I find a lot of poetry difficult to understand since an education from Oxford or Harvard seems a requirment to get through it. This wasn't the case with the poems in this book. I'm able to digest much of the words and pharses in Szymborska's poetry which evoke different images, feelings and thoughts as easily as reading fictional prose. I even had shivers sent through my body reading a poem in this book. This existential jolt happens only rarely and only when I listen to music which affects me deeply. This is poetry I can appreciate.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is what we read poetry for, for the sudden explosion of emotion that hits you when you least expect. One of the greatest writers of our time.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "For those of you who have never had the taste or temperament for a book of poetry, View With A Grain Of Sand is the book that just might change you forever. These remarkably readable poems by the 1996 winner of the Nobel Prize for Poetry, Wislawa Szymborska, gives the perfect voice to ideas that have been quietly alive within us since we were first able to personalize a thought. Our most grandiose moments - birth, death, love - are placed in a common perspective with words of such simplicity as to make the message even more profound. Indeed, it is the very use of this everyday language that makes these poems so powerful.Ms. Szymborska eases humanity off its pedestal. The stars, the sun, the passing of time, and even a grain of sand will continue to go on very well without us, and will do quite well, thank you. Is it new when we are told that we are not the center of the universe - not the most important creation? Surely, by now, many of us accept this. What makes these poems so poignant is that they bring this realization to a deeper level.From the title poem View With A Grain Of Sand,&quot;We call it a grain of sand,but it calls itself neither grain nor sand.It does just fine without a name, ...&quot;Or, from True Love,&quot;True love. Is it normal?is it serious, is it practical?What does the world get from two peoplewho exist in a world of their own?&quot;What makes Ms. Szymborska such a wonderful poet is that her poetry is so enjoyable to read. At first, revelations appear through no great intellectual effort on the part of the reader. They are discovered through the poet's beautiful use of language and our personal identification with her themes. Second and third readings lead to an even deeper personal involvement.These are poems you want to share with others. This is the greatest praise.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "The Nobel Laureate in Literature of 1996 was proudly bestowed on Wislawa Szymborska, the first Polish woman to receive the prize for literature. While they are other Polish recipients like poet Czeslaw Milosz, Wladyslaw Reymont, and Henry Sienkiewicz to have received the honor, Wislawa is the first woman. While she writes poetry mostly, she has written prose. My biggest problem with poetry is that when it's written in another language, I believe it gets lost in translation but rather the meaning is not lost among its readers. The translators have the arduous task of translating from Polish to English. If you anything about Polish, it's not an easy language to translate from especially to English. But Wislawa is worthy of receiving such top honors because she is now well-known, highly regarded and respected. She has not changed much since she was awarded the NObel prize. She still lives in the same three room apartment in Cracow, she still smokes, and she is still the same humble person who despite her own feelings is quite worthy of such a prize.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "At first I thought Wislawa Szymborska took the mundane and made it magical. Then I realized it was exactly the opposite that she did with her poetry. Her poems start grand and end small, rather than the more typical inflation of something minute into a Truth. Take, for example, her poem Nothing Twice, a poem about how feelings and life can be so different from one day to the next: No day copies yesterday, / no two nights teach what bliss is / in precisely the same way, / with exactly the same kisses. Szymborska is one of the great explainers of the Truths; she can explain Honor to a dunce and Love to a child. She uses the analogy of a resume to show what is most important in life: Concise, well-chosen facts are de riguer. / Landscapes are replaced by addresses, / shaky memories give way to unshakable dates. / Of all your loves, mention only the marriage; / of all your children, only those who were born. In the presence of her work, I feel like a child, but one who is sitting raptly at his mentors feet, eyes wide, as the teacher reduces Concepts and other such mouthfuls to bite-size morsels. And this is why her poetry amazes and, ultimately, works.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Truly a masterpiece of original poetry and its excellent translation. Szymborska speaks with the language of the soul. She ponders simple things as miracles, sees beyond the surface. Filled with irony, beauty, depth, and thought, this book is the true triumph of modern poetry.Being a poet myself, I found myself in this book.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Some of us like it rough. This dame plays the way we used to play in the streets of Philly. There is elegance, there is subtle intelligence, yes, all that, but the best part is that when the ball hits you, it stings like hell. She writes of life and living, but also of eternity and death. She is somber, but never depressing. The language itself is encouraging, even when her message is not. This is a 20th century poet who has seen it all and isn't afraid to remind us of what man is capable of. The techniques are modern, too, but the love of language surely belongs to the old world. This is the kind of poetry we all used to love to read. She plays hard ball.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Wisala Szymborska's poetry passes the test of intelligibility which is important to me. Virtually all of her poems are self contained in that they do not make arcane literary allusions. In other words, her poetry can be appreciated by the average reader which I consider myself to be. She does not limit herself in subject matter so her poetry contains something for everyone, and also with a subtle humor and an obvious understanding of the human condition. She does not require a lot of words or a lengthy poem to share her own unique insights. Reading this Nobel laureate one thinks how nice it wold be to meet this great lady. Although I devoured this collection the day I received this book, it is one which I will certainly read again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "three books body rags mortal acts mortal words the past",
        "description": "This volume brings together BODY RAGS and MORTAL ACTS, MORTAL WORDS and THE PAST, three books that are central to the life's work of one of the masters of contemporary poetry. Included here are many of Galway Kinnell's best-loved and most anthologized poems. Kinnell has revised some of the poems for this new edition, and comments on his working method in a prefatory note.",
        "authors": "['Galway Kinnell']",
        "infoLink": "http://books.google.com/books?id=laWM4GlA5EoC&dq=Three+Books:+Body+Rags%3B+Mortal+Acts,+Mortal+Words%3B+The+Past&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Galway Kinnell's poetry exudes the confidence of a master poet and his words drip with meaning. These are poems which you can sink your teeth into, reveling in their introspection and beauty. Kinnell is one of the most influential poets of this generation and continues to produce a substantial bulk of work. As a wannabe poet myself, I read the poetry in a very envious manner. The ability to produce images and meaning in the way Kinnell does, denotes a certain amount of power I hope to possess. The 3 books in question are earlier works which established Mr. Kinnell as a &quot;well-known&quot; poet. The compilation effectively showcases the breadth and depth of his power. You will not be disappointed with this work.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "With all respect to \"TTaylor\" in the other review, \"The Past\" is hardly an earlier work, as Kinnell was near 60 when he wrote it. I am not sure these books belong together, but I believe \"The Past\" to be at least as good as Kinnell's most famous book, \"The Book of Nightmares.\" I also think, like the latter, it's his most consistent book. And, in my opinion, it is a mature work. His work since has been mixed with occasional masterpieces, which is quite allowable for a poet (not every poem must be a masterpiece). Still, I enjoy the consistency of \"The Past\" over the 90's poems which so often seem to be following Sharon Olds' prosaic confessionalism too closely. In any case, do not limit yourself to \"Nightmares\" or \"Selected Poetry.\" This book is one of the finest in late 20th century American poetry.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "risking everything 110 poems of love and revelation",
        "description": "\"Listen, are you breathing just a little, and calling it a life?\" -Mary Oliver This luminous anthology brings together great poets from around the world whose work transcends culture and time. Their words reach past the outer divisions to the universal currents of love and revelation that move and inspire us all. These poems urge us to wake up and love. They also call on us to relinquish our grip on ideas and opinions that confine us and, instead, to risk moving forward into the life that is truly ours. In his selection, Roger Housden has placed strong emphasis on contemporary voices such as the American poet laureate Billy Collins and the Nobel Prize-winners Czeslaw Milosz and Seamus Heaney, but the collection also includes some timeless echoes of the past in the form of work by masters such as Goethe, Wordsworth, and Emily Dickinson. The tens of thousands of readers of Roger Housden's \"Ten Poems\" series will welcome this beautiful harvest of poems that both open the mind and heal the heart.",
        "authors": "['Roger Housden']",
        "infoLink": "https://play.google.com/store/books/details?id=Y_Bodu4ki3EC&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "Writer and editor Roger Housden's luminous and inspirational compilation of poetry \"Risking Everything: 110 Poems of Love and Revelation,\" is one of the best anthologies of this type I have read or seen. This is Housden's fourth volume of a series that began with \"Ten Poems To Change Your Life.\"In \"Risking Everything: 110 Poems of Love and Revelation,\" Housden selected 110 poems from around the world, whose poets' lives and works span the centuries. I frequently open the book at random and never fail to be moved. Housden has written: \"Great poetry happens when the mind is looking the other way and words fall from the sky to shape a moment that would normally be untranslatable.\" Carl Sandburg wrote: \"Poetry is the journal of the sea animal living on land, wanting to fly in the air. Poetry is a search for syllables to shoot at the barriers of the unknown and the unknowable. Poetry is a phantom script telling how rainbows are made and why they go away.\" And from Emily Dickenson: \"To see the Summer Sky / Is Poetry though never in a Book it lie / True Poems flee.\" Whatever poetry is, some of the best can be found here.Included in this volume are: \"Poetry\" by Pablo Neruda, \"On Angels\" \"Eyes\" by Czeslaw Milosz, \"Today Like Every Other Day\" by Rumi, \"That Day\" by Denise Levertov, \"Milkweed\" by James Wright, \"My Fiftieth Year\" by W. B. Yeats, \"Sunset,\" and \"The Swan\" by Ranier Marie Rilke, \"The Wind One Brilliant Day\" by Antonio Machado, \"Everything Is Plundered\" by Anna Akhmatova, \"Lines Composed A Few Miles Above Tintern Abbey\" (excerpt) by William Wordsworth, \"A Homecoming\" by Wendell Berry, \"The Third Body\" by Robert Bly, \"To have without holding\" by Marge Piercy, \"Deeper Than Love\" by D. H. Lawrence, \"The Peace of Wild Things\" by Wendell Berry,\" \"Soul At The White Heat\" and \"Wild Nights\" by Emily Dickenson, \"I Thank You\" by E.E. Cummings, \"Postscript\" by Seamus Heaney, \"The Road Not Taken\" Robert Frost.Roger Housdan is the author of numerous books on cultural and spiritual themes, including the bestselling Ten Poems series.JANA",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "A few days ago I picked up a copy of Roger Housden's anthology Risking Everything: 110 Poems of Love and Revelation. Today I opened it at a random page, and suddenly felt compelled to start reading the poem out loud. It was D. H. Lawrence's Deeper Than Love, and I found myself reading it slowly, lingering over the words, tasting them, feeling their weight on my tongue.Love, like the flowers, is life, growing.But underneath are the deep rocks, the living rock that lives aloneand deeper still the unknown fire, unknown and heavy, heavy and alone.The noise of the air conditioner in the kitchen drowned my speech (it's a miserable night, dew point around 75, no central air) which was good: I was only reading for myself. I finished the Lawrence, and opened again at random: Billy Collins' This Much I Do Remember. Not a poem to read out loud, this one, but one to close your eyes and see what the poet had seen:that I could feel it being painted within mebrushed on the wall of my skullAnd of course all of Housden's favourites are here, like old familiar friends: Rumi, Bly, and above all Mary Oliver. What a glorious collection.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Roger Housden made his name with his series of \"Ten Poems\" books, featuring ten poems with his remarks. In Risking Everything he tries a slightly different format: a hundred and ten poems, sans commentary.His selections run the gamut. Naturally, no one will be pleased with every choice, but everyone ought to like some choice: poets range from the ancient ChineseChuang-tzuto modern American writers likeRobert BlyandBilly Collins; themes include everything from Parkinson's Disease to the Buddha.Although the book is, of course, suitable for browsing, Housden has obviously put careful thought into the order of the poems. For example, a poem about the perfect life may be adjacent to Robert Bly's \"The Resemblance Between Your Life and a Dog\"; D.H. Lawrence's meditation \"Snake\" is right next to Wendell Barry's \"The Peace of Wild Things.\" Housden has arranged the selections so that they make a coherent and meaningful whole when taken together, meandering from subject to subject.Housden has primarily chosen accessible poems, which makes Risking Everything appropriate for readers who still hold that numinous fear of poetry that plagues many of us; at the same time, his selections and arrangement are sophisticated enough to sate experienced poetry readers as well.~",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The topic of this anthology of poetry, \"risking everything,\" is perfect for anyone needing or starting a new venture in life. These poems encourage us to throw open the doors and try again. What is not risky is the quality of the work. Some of the genre's most beloved and accomplished poets are represented: Mary Oliver, Rumi, Derek Walcott, Emily Dickinson, Rilke, Hafiz, and so many more. Well-done translations, too. Whether you attempt or only dream of change, the introductory chapter will set you up for whatever comes next in your life, and the poems will follow through with a one-two punch to your soul.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Already a fan of Frost, Cummings, Dickinson, Eliot, Kunitz, and Rilke, I began with James Wright: \"Today I Was Happy, So I Made This Poem.\" Then I discovered, \"We Shall Not Cease,\" by Eliot, the \"Holy Spirit\" by Hildegard and \"Sunset\" of Rilke! Quickly as carried back into that, never-never Land of youthful days, I settled into early favorites of Robert Frost and ee Cummings!In addition to these favorites by Wright, Eliot, Hildegard, Rilke, I have come to a renewed reverence for Goethe, Wordsworth and Robert Bly!Back to days spent singing with Robert Shaw and Frostiana Pieces like, \"The Road Not Taken and \"I Thank You God for this amazing day.\" These stand alongside the 99 year-old Stanley Kunitz, \"The Long Boat!\"FROM one who tends toward nostalgia, Retired Chaplain, Fred W Hood, \"barbara377\" (Fayetteville Georgia United States)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have been carrying this book around with me since I purchased it at the beginning of the year. It has helped carrying me through a pretty rough personal time. As usual, Housden is spot on with his choices; in terms of nourishing the spirit, there's a range of choice, and there isn't a bad poem in the lot. In fact, some of the best poems ever written are collected here. This book has become so meaningful for me that I'm requiring it for my new poetry students next semester. I've also given copies as gifts. Don't miss it!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the selected poetry of robinson jeffers",
        "description": "This new Jeffers Selected Poetry includes poems from the last quarter century of his life (the previous Selected Poetry included poems only through 1937). It derives from the monumental five-volume The Collected Poetry of Robinson Jeffers (Stanford, 1988-2000), edited by Tim Hunt, and includes a sampling of the poems Jeffers left unpublished, along with several prose pieces in which he reflects on his poetry and poetics.",
        "authors": "['Robinson Jeffers']",
        "infoLink": "http://books.google.com/books?id=D81ltAEACAAJ&dq=The+Selected+Poetry+of+Robinson+Jeffers&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Who was Robinson Jeffers? - A high priest of Nature? A proto-ecologist visionary? A lyric expounder of Fascism? An enemy of civilisation? An implacable misanthrope who spent his last years in his secluded lodging overlooking the Pacific, shunning what Edgar Allan Poe aptly referred to as \"the tyranny of the human face\"? His celebrations of war, his reverence for transhuman beauty, his dismissal of human egocentricity, and his pursuit of detachment and objectivity all suggest that he was either a befuddled hermit or an arch-hater of civilisation. Moreover, his fierce opposition to fanaticism and unfounded millennial hopes, his sanctification of greatness and his yearning to eradicate falsehoods and superstitions, - (such as human solipsism and anthropocentricsm) - and his registering of the urgings of religious awe tempt one to explain him away as a misanthrope. Both interpretations are wrong. Jeffers, a direct heir of the Transcendentalists Emerson, Thoreau and Whitman (he borrowed Whitman's long line, though failed to produce his sonic effects) stands as one of the finest poetic figures in neo-Romantic Modernism. His radical philosophy, which he called Inhumanism, is actually an attempt to totally think anew human conceptions regarding the nature and humanity, and is far too selective, complex, affirmative and far-reaching to be dismissed as simple misanthropy. It is for this reason that Jeffers's work has generated a vortex of academic dissent. The adage that \"all great religions began as heresies\" may receive sufficient demonstration in Jeffers' future critical reception. In this connection, it may be tempting to see Jeffers as another Prometheus, a seeker and bringer of Truth and Fire. His Inhumanism is a bold and powerful attempt to ennoble humanity through greater knowledge and self-scrutiny.",
                "review/helpfulness": "44/54",
                "num_reviews": 54
            },
            {
                "review/text": "Robinson Jeffers is most often considered a minor figure in the twentieth century American literature canon. Countless instructors haven't even heard of him, but that is a shame. Some professors even skip the Jeffers section in American literature anthologies. With the publication of this long-awaited anthology (in paperback), there is plenty of evidence here to suggest that Jeffers is a major figure of influence.Jeffers had a transcendental vision. He built a poet's niche in Carmel, where he commented on nature's cosmic cycles, its beauty and violence, which he saw as expressions of God's character. Jeffers was a poet of the Carmel landscape--weather worn granite, tumultous surf, birds of prey, twisted coastal cypress--he also approached descriptions of humanity's arrogance and weakness in light of its fascination with war, violence, and self-inscribed bloodshed. Jeffers espoused a poetic doctrine of Inhumanism, which was perhaps a reflection of his own personal misanthropy: humans are atoms to be split.Some of my favorite poems are here: &quot;Shine, Perishing Republic,&quot; &quot;Boats in a Fog,&quot; &quot;Carmel Point,&quot; &quot;Divine Superfluous Beauty,&quot; &quot;Tower Beyond Tragedy,&quot; &quot;Bed by the Window,&quot; &quot;Una,&quot; &quot;The Deer Lay Down Their Bones,&quot; and even some of his last writing. I remember a certain Shakespeare class in which I read &quot;Shine, Perishing Republic&quot; on the day after the LA riots.Robert Hass (UC Berkeley), C. Milosz (Emeritus, UC Berkeley), and William Everson have been poet champions of Jeffers' work. But one scholar, in particular, has dedicated his academic life to understanding that creative pulse, which inspired Jeffers to his pen. That notable scholar is Robert J. Brophy.I highly recommend this anthology. I also recommend the scholarship of Robert Brophy. I can say with pleasure and esteem that I have benefited from his scholarship and literature courses at Cal State U., Long Beach. Bob Brophy introduced me to Jeffers (via a Jeffers course and a Tor House tour, 10/91); I have introduced Jeffers and his work to my own students, and I will forever be touched by his gentle, guiding hand.",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "The 2007 Quinn Press \"Selected Poetry of Robinson Jeffers\" is NOT a new selection but a reproduction published by an on-demand printing company of the 1938 \"Selected Poetry\" that Random House originally published. That means it does not contain anything from the final 22 years of the poet's life -- nothing from \"Be Angry at the Sun,\" \"The Double Axe,\" \"Hungerfield,\" \"The Beginning and the End\" or from his later uncollected poetry. If you want to buy the Random House 1938 selected, this new version by Quinn Press will do just fine, as long as you know what it is you're buying. It is valuable not just for the poems but for Jeffers' superb foreword in which he says, among many other things, that \"I decided not to tell lies in verse. Not to feign any emotion that I did not feel.\" For a selection from the poet's complete work try the \"Selected Poetry of Robinson Jeffers\" edited by Tim Hunt and published by Stanford University Press in 2001. \"Robinson Jeffers: Selected Poems\" is a small but useful selection of the shorter poems published as a Vintage Book (Random House) in 1963. \"Rock and Hawk\" is a longer selection of Jeffers' shorter poems edited and with a superb introduction by Robert Hass. I recommend it highly. Another fine brief compilation is \"Robinson Jeffers: Selected Poems\" edited by Colin Falck for Carcanet Press in 1987. Tim Hunt has edited the first three volumes of Jeffers' \"Collected Poetry\" with the fourth volume slated for publication late in 2008.",
                "review/helpfulness": "17/22",
                "num_reviews": 22
            },
            {
                "review/text": "Jeffers would not be surprised by the timeliness of his poetry as issues of globalization, war, terror, environmental carelessness, and hubris once again flood our daily lives. His poetry resonates with a distaste for the very \"inhumanities\"--though he would consider them wholly human--that have brought us to this state of the world. The endless cycle which he mentions so many time is repeating itself once again, and his wisdoms and voice are gathered into a wonderful collection of his finest poetry.One reading Jeffers in search of hope for humanity will be sorely disappointed, as his inhumanism is present on every page. It is not hopeless, however; the beauty of nature and the wild god of the world persist despite man's best efforts to tame and abolish them. Poems like \"Vulture\" are the only glimmer of hope that Jeffers has for mankind: recognize our place in the world and embrace it. That is the ultimate existence.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I was first introduced to Jeffers in college. I was no fan of poetry then, and was intimidated by his style of writing. I recently picked it up out of curiosity, and have since been a convert. His writing has awakened my own interest in his work, and poetry in general.From one casual reader to another, consider adding a little poetry to your reading list - and if you do, check out Robinson Jeffers. As another reviewer pointed out, this might be an under-represented collection of his works, so you may want to look around for a different volume. Better yet, look up some on the internet - he's dead, so its not like you are not stealing royalties from him.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ten poems to set you free",
        "description": "Ten Poems to Set You Free inspires you to claim the life that is truly yours. In today's world it is deceptively easy to lose sight of our direction and the things that matter and give us joy. How quickly the days can slip by, the years all gone, and we, at the end of our lives, mourning the life we dreamed of but never lived. These ten poems, and Roger Housden's reflections on them, urge us to stand once and for all, and now, in the heart of our own life. This volume brings together the voices of Thomas Merton, David Whyte, the Basque poet Miguel de Unamuno, Anna Swir from Poland, Stanley Kunitz, the Greek poet C. P. Cavafy, and Jane Hirshfield, as well as three of Housden's favorites, Rumi, Mary Oliver, and Naomi Shihab Nye. His luminous essays on the poems show us how to integrate the poets' truth into our own lives. Roger Housden's love of poetry and life leaps from every page-so much so that his readers feel they have found a guide and mentor through the extraordinary Ten Poems series. He has opened the eyes and hearts of many, not just to the power of poetry, but to the truth and beauty of the life of the soul. What more can one ask?",
        "authors": "['Roger Housden']",
        "infoLink": "https://play.google.com/store/books/details?id=jm0uNy9qNqkC&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "This compilation of poems with commentary by the author is stirring. I take this volume to work to remind me to hold onto my soul; it serves as a defense against the pummeling of the world. This book needs to be read slowly and thoughtfully, allowing time to digest the deep meanings. David Whyte's poem in particular captures the essence of what it means to be an individual with a soul. Outstanding!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "If you allow it, the sheer beauty of these ten poems will inspire you toward your own unique life and free you from the clutter of the everyday mind. The author's commentaries are as profound as the selected poems themselves.Get this book,read it-no,live it , and allow its poetry to enrich your soul!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Roger Housden has written a series of books about poems, all with the theme of reading and using poems to help a person change themselves for the better. Housden writes with energy and sincerity and he picks great poems by good poets. Unfortunately,Ten Poems to Set You Free reads too much like a self-help book and contains too little of what Housden does best, which is give us one man's personal experience with poetry. Mary Oliver, Stanley Kunitz, and Miguel de Unamuno are poets I've read for a long time with joy and pleasure and I will be sure to read Jane Hirshfield now that Housden has introduced her work to me.As much as I believe that great good comes from reading great books, and of course this includes great poetry, I have trouble with the self-help and self-knowledge and self-focusing that Housden uses in discussing the works of the ten poets he chooses. He knows poetry well; he discusses and uses many more poems and poets than just the ones listed in his table of contents. He is also well-versed in religious traditions, particularly eastern ones and seems very comfortable aligning those philosophies with the dictates he finds in the ten poems he's chosen to \"set you free.\"Poetry and prose inevitably have at least two meanings: there will always be what the author meant to say and convey, and what the reader gets out of the words. The more readers, the more meanings. It is not fair really to say a reader did not \"get\" a certain writer; every reader is free to interpret as he/she wishes. But in making an argument for the meaning of a poem, a reader has to be able to support his/her argument. I was not convinced by Housden's rather literal undertakings of the poems, nor was I comfortable with his generalizing application of the words. One person's interpretation of a text is interesting to me, and especially when that one person is thoughtful and intense. Housden makes good and sound arguments for himself; he deeply feels the poetry that he reads and is genuine in his essays about them. But when he strays from himself and starts giving general advice to the reader, he loses me completely. I just am not convinced by the language of self-awareness and self-knowledge: too much generic \"self\" and too little that is interesting or unique.Poetry is great for how it brings you out of yourself and to someplace new. Even when you recognize where you are (in a place of love or despair or obsession or loss) it is the new - and shared with the poet -- experience of it that changes you forever. Sometimes poetry is just about the beauty of a line, the way one line can resonate with you and make your heart actually vibrate with understanding. That is where poetry sets you free (to use Housden's title), by taking you out of yourself and bringing you to someone else's private outlook, like going to a tree house with its new special view over the yard you may have known (and mowed) for years. Because you are seeing everything from a new and different angle, you are freed from old interpretations of life and love, goodness and strength, what is worth it and what is not. It is the same with great works of art: seeing a painting can change the whole way you look at, for example, nighttime, after looking at the night paintings of Van Gogh.Housden has chosen great poems for delivering the message of joy and the mandate of getting up and doing whatever it is that you need to do or want to do. Live authentically, as told in David Whyte's poem: \"you can look back with firm eyes saying this is where I stand.\" Live with commitment to your living, from Unamuno: \"to live is to work, and the only thing which lasts is the work; start then, turn to the work.\"But I disagree with Housden that Unamuno is talking about one's life work. Housden says a lot in this book about how important it is to find out what our work is meant to be and to discard the easy or stable job and go for the gusto. But I think Unamuno's point is that whatever the job you get paid for is, the only important job is the actual act of living; what is important is to live fully committed, no matter what our job or our labor is, and our reason for living is the living itself. Get out there and live, throw the seed of active, engaged, committed living everywhere you go, in everything you do: \"the man who wants to live is the man in whom life is abundant.\" Many of us will live with jobs that are just jobs but our lives are full and rich because we are committed to fully living (appreciating) the moments of each day. Our life is abundant when within ourselves we see the abundance of life.As Mary Oliver asks, in the poem used by Housden: \"Listen, are you breathing just a little and calling it life?\" This is an amazing line and I appreciate Housden sharing it with me; I appreciate him sounding the warning bell of half-lived lives and using the beauty of poetry to ring the message home. I just wish that he would stick to his own personal experiences in bringing us this wonderful poetry and leave the jargon of self-help to the preachers.Read more at ww.readallday.org",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This intimate volume features a selection of ten poems, a guide to redeeming the spiritual hearts of our own lives. Through the voices of David Whyte, Jane Hirschfield, Miguel de Unamuno, Rumi, Thomas Merton, Jane Oliver and more, Housden offers his own reflections on the interpretation of these poems in chapters immediately following each work. For those who need a guide to navigate the phrases of some of the world's great poets, the author illustrates each example with contemporary application, text and subtext, the poet's words reflecting the meaning for individual lives. Moreover, Housden delves into the other writings of the chosen poets, discussing the themes of their work and why these particular poems are definitive, that we may \"integrate the poet's truths into our own lives\".Following David Whyte's \"Self-Portrait\", Housden's \"Look in the Mirror\" suggests that Whyte's poem is a personal wake-up call. Like most of his writing, Whyte \"champions the truth of the soul over the clamor of the social personality\". Miguel de Unamuno's \"Throw Yourself Like a Seed\" precedes the author's chapter titled \"Recover Your Spirit\". The poet, who died shortly after the outbreak of the Spanish Civil War, firmly believed that \"at times to be silent is to lie\". An enemy of Franco and his fascism, the poet spoke to the great themes of the human spirit, a call to courage and integrity, even against the most disheartening odds. The author lifts Unamuno's words, his incredible bravery at a time of great turmoil, and brings them to the fertile ground of our more modern concerns, the small decisions that move us away from our finest selves and the need for personal commitment.Many of these works are familiar, certainly Rumi, Merton and Mary Oliver, but each has a powerful message on the evolution of the spirit. Combining the fluidity of chosen poems and his own considered comments, the author calls us to attend to personal potential, the daily opportunities for growth and the evolution of the soul that is a by-product of self-reflection. Not everyone wants, or needs, a guide through these works, but for those who are overwhelmed and cannot apply them in an individual context, Housden's Ten Poems to Set You Free is a first step into a rewarding future, where personality, sense of purpose and soul are fully integrated: \"We are able to be the one we do not know. This is the greatest freedom available to us as human beings.\" Luan Gaines/ 2005.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "selfportrait in a convex mirror",
        "description": "John Ashbery's most renowned collection of poetry -- Winner of The Pulitzer Prize, the National Book Award, and the National Book Critics Circle Award First released in 1975, Self-Portrait in a Convex Mirror is today regarded as one of the most important collections of poetry published in the last fifty years. Not only in the title poem, which the critic John Russell called \"one of the finest long poems of our period,\" but throughout the entire volume, Ashbery reaffirms the poetic power that made him an outstanding figure in contemporary literature. These are poems \"of breathtaking freshness and adventure in which dazzling orchestrations of language open up whole areas of consciousness no other American poet as ever begun to explore\" (The New York Times).",
        "authors": "['John Ashbery']",
        "infoLink": "http://books.google.com/books?id=k62KDQAAQBAJ&dq=Self-Portrait+in+a+Convex+Mirror&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "John Ashbery is probably the most famous and most productive of the Post-Modernists & the New York School of poets. His career has been long and productive. He remains to this day very visible, frequently publishing his poems in the New Yorker. It was, in fact, within the pages of the New Yorker that I first encountered Ashbery in my youth. I hated his work immediately. In fact, it took years for me to discover the incredible beauty and intellectual stimulation within Ashbery's poetry. Over the years I have come to appreciate Ashbery's more recent, or later work most of all. Although I appreciate the greater simplicity of his earlier work, and the great, convoluted anguish of his middle work, it is the vision of his later work that engages me most.Self-Portrait in a Convex Mirror belongs primarily to his middle period. It, of course, famously won many awards, including the Pulitzer Prize for Poetry. I own this edition of the work and it has held up well with multiple readings, both the actual paperback, and the text. When I initially read this volume I found it strangely troubling and thought-provoking. I felt almost physically anguished as I read it over and over again. When I first encountered it I surrendered nearly a complete month to repeatedly devouring Self-Portrait in a Convex Mirror. However, in the end I found that it is still not my favorite of his works. Also, I must confess that I found the short poems in the volume much more engaging than the long, title poem.As a poet, myself, for years I have found endless inspiration within Ashbery's writing (as well as the writing of many others, including the particularly noteworthy Charles Simic). I think for those first approaching Ashbery's work, this is probably the best place to start. I believe you will find that you either love or hate his work. If you discover that you love it, move on to other works such as The Mooring of Starting Out - a 1 volume edition of his first 4 volumes of poetry, or Where Shall I Wander - one of his latest works...or, there are so many others to choose from, all good, solid works of poetry. If you've already read other works by Ashbery, but have not read this work, you need to get yourself a copy and get to it. I am convinced that it would be a mistake to overlook this very important and engaging work.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "John Ashbery with &quot;Self-Portrait in a Convex Mirror&quot; redefines American poetry by shattering syntax and &quot;meaning&quot; into a million facets. Even cliches and conversational speech take on the tone of epic poetry in Ashbery's gaze. His indirect mannerism leaves the reader haunted by images that are unique in American writing. Though drawing heavily from modern French poetic technique, Ashbery lives up to Pound's dictum, &quot;...make it new&quot; and Rimbaud's decree that &quot;...one must be absolutely modern.&quot; Above all, his portraits of stream-of-consciousness always surprise with their cinematic, sleight-of-hand, air of freshness. Along with Kenneth Koch, and Frank O'Hara, Ashbery remains the ringleader of the New York School of poetry.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "This collection of poems, especially the title poem, is jarring and bewildering in its swiftness and complexity, and in the crossed-paths of struggle, you will encounter spectacular images and conclusions. The images like &quot;now from the unbuttoned corner moving out&quot; and &quot;recurring wave of arrival&quot; are vividly childlike and nostalgic but also remind me of nothing I have encountered before. Ashberry's images sometimes bang against each other like the organized chaos of bumper cars. If you find yourself lost, keep reading and re-reading, no one needs to point out subtlety. Stick around, the confusion and overlapping delay the release at the end of his movements, which rival T.S. Eliot, in their polite, mythic send-offs.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Ashberry has claimed several times that his poetry shares a particular way of expression with painting and music, in the sense that both of them can tell many things to anybody, it is not necessary for the viewer or listener to understand the meaning, but the feeling. This book is just like that.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "The American poet John Ashbery's (b. 1927) book \"Self-Portrait in a Convex Mirror\" received extraordinary accolades upon its publication in 1975. The book won the Pulitzer Prize, the National Book Award, and the National Critics Circle Award. The book, especially the lengthy concluding poem for which it is named, solidified Ashbery's reputation as a major American poet and remains his most widely-read work. The book consists of 35 poems, including the title poem. I am in the midst of reading the Library of America's collection of Ashbery's poems from 1956-1987 and wanted to pause to try to take stock through this important collection.Ashbery's poetry and this volume resist paraphrase. Each poem includes lines and figures which are indivually striking and often beautiful; but the poems cannot be read discursively. The diction shifts markedly in the poems from the solemn to the profane. There are sudden shifts in person and in tenses. Frequently, lines or sections are clear enough, but a poem as a whole will appear opaque. There is a sense in Ashbery's work of cutting through the tendency to rationalize and to focus on the joy of experience in its diversity. The concreteness and detail of the poem show a love of things in their variety and keen emotional responses. The poems frequently have the sense of an interior monologue or a discussion among friends. For all their difficulty, the poems have a certain lightness of touch. The poetry is urbane and shows great knowledge of art, music, literature, movies, and popular culture. And with reading, some sense of what Ashbery is about becommes clear.\"Self-Portrait in a Convex Mirror\" was a watershed book for Ashbery because it is somewhat more accessible than his earlier avant-garde books. Yet the difficulties remain. The title poem, Ashbery's masterpiece, is, on one level accessible to read. It moves in a narrative reflection, and can be followed, up to a point. This is still a difficult poem which will bear close and repeated readings.The title poem is based on a painting of 1524 of the same name by Parmigianino that now is in the Kunsthistoriche Museum, Vienna. The painting shows a reflection of the artist on a convex mirror. It is marked by a seemingly distorted and large right hand, and the somewhat feminine yet intense face of the artist staring at the viewer. In his poem, Ashbery addresses the artist, discusses and questions him about his painting, and quotes commenters on the painting contemporary and modern. He describes the work and his reaction to it, e.g.\"That is the tune but there are no wordsThe words are only speculation(From the Latin speculum, mirror):They seek and cannot find the meaning of the music.\"The suggestion is that words are inadequate to capture reality, which must be conceived imaginatively. As the poem progresses, it discusses tradition and interpretation and perspectivism in understanding reality. The artist's vision is brought forward as Ashbery meditates on modern life and its cacophony. The poem becomes its own reflection of Ashbery's understanding of the creative endeavor.The short poems in this volume are overshadowed by the Self-Portrait. These poems tend to be even more elliptical than this major poem of the volume. In my reading, I tried to identify the works that I could respond to while passing over, for the present, others that seemed to me obscure. This might be a good way for other readers to approach the book.The poems I enjoyed include the first poem, \"As One Put Drunk into the Packet-Boat, the title of which is based on a poem called \"Tom May's Death\" by Andrew Marvell. (1621 --1678). Ashbery begins with the words \"I tried each thing, only some were immortal and free\" which in the context of the poem seems to speak of the renewal of the creative endeavor. The \"Poem in Three Parts\" begins with a startling phrase (\"Once I let a guy blow me\") but proceeds to an exploration of how one responds to experience: \"Who goes to bed with what/ is unimportant. Feelings are important./ Mostly I think of feelings, they fill up my life/ Like the wind, like tumbling clouds/ In a sky full of clouds, clouds upon clouds.\"\"There is a charm and a picture of adolescent sexuality in \"Mixed Feelings\". The poem \"The One Thing that can Save America\" with its sense of nostalgia as Ashbery describes the \"timeless\" truths of warding off danger \"Now and in the future, in cool yards,/In quiet small houses in the country,/Our country, in fenced areas, in cool shady streets.\" The poems \"Tenth Symphony\", \"Fear of Death\" and \"City Afternoon\" are among others that I enjoyed.This book is difficult, modern poetry that may not appeal to all readers. The poems in this book are evocative and I think a sense of them can be got from sympathetic reading. This book deserves its reputation as a major work of American literature.Robin Friedman",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the collected poems of a e housman",
        "description": "This volume constitutes the authorized canon of A.E. Housman's verse as it was established in 1939, three years after his death. In contains A Shropshire Lad, Last Poems, More Poems, the Additional Poems, and the three translations from A.W. Pollard's anthology, Odes from the Greek Dramatists.",
        "authors": "['A. E. Housman']",
        "infoLink": "http://books.google.nl/books?id=4gY3BhMRG38C&dq=The+Collected+Poems+of+A.+E.+Housman&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Housman is a wonderful, lyrical poet. I bought this collection after having seen The Invention of Love on the London stage.Most beautiful of all, to my mind, is the poem entitled &quot;To an Athlete Dying Young&quot;. This was the eulogy read by Isak Dinesen at Denys Finch-Hatton's funeral in the movie &quot;Out of Africa&quot;. The poem, which was originally included in &quot;A Shropshire Lad&quot; (1896) begins:&quot;The time you won your town the race, We chaired you through the market place. Man and boy stood cheering by and home we brought you shoulder high. Today the road all runners come, Shoulder-high we bring you home. And set you at your threshold down, Townsman of a stiller town. Smart lad! to slip betimes away from fields where glory does not stay And early though the laurel grows It withers quicker than the rose... And round that early laurelled head Will flock to gaze the strengthless dead, And find, unwithered on its curls, A garland. Briefer than a girl's.&quot;A very moving and sad poem. Many of Housman's other poems are of a similar, outstanding quality. He was not a prolific poet, but he was certainly a great one. Great pleasure will be found in this collection.",
                "review/helpfulness": "28/34",
                "num_reviews": 34
            },
            {
                "review/text": "Unrequited love and youthful death are the author's recurrent themes. Always forthright and devoid of the esoteric and modernistic qualities of more revered poets, Housman's work, though imbued with a pronounced melancholy, is never strident or sanctimonious. It is through the symmetry of theme that Housman achieves the solemnity which lends these justly celebrated poems their stature.I feel that any discussion of A. E. Housman's poetry should first acknowledge that he was never a poet in the same sense as Whitman, Auden or Ginsberg. he was first, and foremost, a scholar, the Chair of Latin at Cambridge and an academic legend. Thus it seems churlish for his detractors to take the rather meagre amount of poetry he produced and deride it for it's lack of thematic multiplicity.A closeted homosexual, Housman's poetry is perhaps most distinctive for it allusive qualities. One revels in the allegorical poem XVIII from Additional Poems: \"Oh they're taking him to prison for the colour of his hair.\" Perhaps my favorite in this collection full of favorites is XXXI from More Poems:\"Because I liked you betterThan suits a man to say,It irked you, and I promisedTo throw the thought away.To put the world between usWe parted, stiff and dry;'Good-bye', said you, 'forget me.''I will, no fear' said I.If here, where clover whitensThe dead man's knoll, you pass,And no tall flower to meet youStarts in the trefoiled grass,Halt by the headstone namingThe heart no longer stirred,And say the lad that loved youWas one that kept his word.\"Haunting. First rate. A masterful collection.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "I don't know what I'd do without this book. I stumbled on Housman more or less by accident in an anthology and just fell in love -- so much emotion so perfectly crystallized in such lovely little lyrics, beautiful regardless of what connection you make to it. I can't recommend this highly enough; somehow, despite the melancholy, Housman's verse retains a power to comfort and assure in even the most dire of situations. That, I suppose, is why it was written years ago &quot;for those unhappy fellows, unborn and unbegot, for them to read when they're in trouble and I am not.&quot;",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "Absolutely necessary reading for any poetry lover. If by some terrible mistake you have so far missed Housman, you should make up for it immediately. Don't waste your time reading reviews, just get the book asap!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "A.E. Housman is sometimes spoken of as one of the \"war poets,\" of the same period as Sassoon, Wilfred Owen, Joyce Kilmer and others who wrote of the First World War. In point of fact, he was of the previous generation and published his most famous work, A Shropshire Lad, in 1896. Subsequent smaller volumes of his work, Last Poems, More Poems and Additional Poems, were published decades later, the latter two posthumously. All four sets of poems are contained in this volume.Housman led a rather reclusive life, active in scholarly pursuits and teaching at several universities. Despite being known by close associates to have a sense of humor and being a skilled raconteur, he was considered even by his family to be rather stoic and cold. When Shropshire Lad first appeared, many were astounded by the passion with which he wrote of the seeming futility of life, the hearbreak of love and loss, and the utterly senseless waste of countless young lives lost in wars of empire.Housman is, in this writer's opinion, one of the greatest of lyric poets writing in English. The rythms, alliteration, mythological allusions and romantic imagey that elicit an almost painful pathos, are rarely equaled.If you're not familiar with Housman's work, this book is as good as it gets, including as it does all of his published work, with helpful introductory notes and indexing at the back. If you enjoy lyric poetry, don't miss this one.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the palm at the end of the mind selected poems and a play",
        "description": "This selection of works by Wallace Stevens--the man Harold Bloom has called \"the best and most representative American poet\"--was first published in 1967. Edited by the poet's daughter Holly Stevens, it contains all the major long poems and sequences, and every shorter poem of lasting value in Stevens' career, including some not printed in his earlier Collected Works. Included also is a short play by Stevens, \"Bowl, Cat and Broomstick.\"",
        "authors": "['Wallace Stevens']",
        "infoLink": "https://play.google.com/store/books/details?id=3TZ-FO48hZMC&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I was totally ignorant of Wallace Stevens until I came to Yale and took Professor Harold Bloom's course \"How to Read a Poem.\" American poetry, as I, a Chinese student of a non-English major, understood it, is Walt Whitman, T.S. Eliot and Ezra Pound. In contrast, Wallace Stevens's name was strange to most Chinese intellectuals till recently. Even in his native country his rise to a canonical status was not immediate. Eliot's The Waste Land and Stevens' Harmonium debuted around the same time, but the former took all the spotlight. A mysterious \"X\" recurs in some of Stevens's letters and poems. This \"X\" refers to no other than Eliot, which may reflect a degree of frustration on the part of Stevens. Not until his late years did Stevens slowly but surely receive the recognition he deserved. A lagging effect in cross-lingual translation and interpretation may explain Stevens's relative invisibility to the Chinese audience. In addition, Stevens, especially in his later years, was highly meditative and philosophical, at times difficult and obscure, which also affected his accessibility to foreign readers.Professor Bloom's class first initiated me into the force and beauty of Stevens's poetry. What intrigues me is that Stevens lived a double life. He was an insurance lawyer in profession and a poet in private, and seemed to have no difficulty alternating between the two seemingly incompatible roles. Just like his work is so original that they defy any easy label, Stevens's life is so eccentric that he contradicts the stereotype of what a poet is supposed to be like. This is particularly astonishing in the eyes of the Chinese, for in our tradition commerce and poetry have very little in common. Chinese poets are easily associated with scholars, officials, hermits, monks, artists, but it is hard to think of any example of successful poet-businessmen.I especially love \"The Poems of Our Climate,\" a short piece written in 1938, when the poet was 59 years old. It was a number of years on from \"The Idea of Order in the Key West.\" For Stevens, it was a central poem. Stevens's poetic odyssey spanning over half a century was punctuated by two puzzling breaks: in 1898-1900, Stevens, a Harvard student poet, contributed regularly to Harvard Advocate. After he left Cambridge for New York, his poetry writing stopped short. After a complete silence of seven years when Stevens was struggling with his business career, in 1907 he began to present love songs to his muse Elsie Moll, and his creative faculty seemed to return. In 1923, Stevens, at the age of 44, finally published his first volume of poems, Harmonium. The book's poor reception and its author's growing domestic and corporate responsibilities almost led him to abandon poetry again. For four years Stevens published little. Not until 1929 did Stevens resume poetry writing. Like the Irish poet W.B.Yeats and the Chinese poet Du Fu, the bulk of Stevens's best work was not done until his late years. Interestingly, these three literary lions unanimously fall in love with the fall season: Yeats admires the trees in their autumn beauty in \"The Wild Swans at Coole\"; Du Fu composed a cycle of regulated poems under the general title of \"Autumn Meditations\"; Stevens' last major poetic endeavor is no other than \"The Auroras of Autumn.\" These pieces actually reflect the poets' \"autumnal personality.\" As they are approaching that season of their life, their works become increasingly sophisticated, retrospective and sublime. The following lines from John Keats' \"Ode to Autumn\" might be particularly pertinent to their situations:Where are the songs of Spring? Ay, where are they?Think not of them, thou hast thy music too,\"The Poems of Our Climate\" was written in this \"autumnal period\" of the poet's life, thus belonging to the poetry of maturity. It is in three numbered sections. There is a break between each of the sections.IClear water in a brilliant bowl,Pink and white carnations. The lightIn the room more like a snowy air,Reflecting snow. A newly-fallen snowAt the end of winter when afternoons return.Pink and white carnations - one desiresSo much more than that. The day itselfIs simplified: a bowl of white,Cold, a cold porcelain, low and round,With nothing more than the carnations there.Stevens's difficulty often lies in referentiality. The first section seems to have nothing to do with the title. There is no direct reference whatsoever to either \"poems\" or \"our climate.\" Ostensibly the poet-persona is watching a Japanese flower arrangement. Stevens had a passion for oriental arts and philosophies. He was a close reader of Okakura Kakuzo (1862-1913), and his library was full of all kinds of books about Japanese flower arrangement. He was not only deeply read in this subject, but also had a habit of ordering fresh flowers from shops. The opening sentence introduces the image of flower arrangement by creating a pleasing word picture of balance, harmony and form. \"Clear water\" seems to be redundant, yet this rhetorical excess emphasizes the crystalline transparency of water. \"Brilliant\" etymologically means \"to emit light, to reflect light,\" thus accentuating the shiny surface of the container. The combination of \"pink and white carnations\" brings a festival of inviting colors and textures that are traditionally associated with feminine innocence, charm and gentility. The origin of the word \"carnation\" in Latin confirms the connection between the flower and human flesh. Behind this image of sexual provocation is a male observer's voyeuristic and fetishistic desire. The first sentence sketches the key components of a flower arrangement (through three nouns: water, bowl and carnations), with an emphasis on their optical and chromatic effects in the eyes of a spectator (through four adjectives: clear, brilliant, pink and white), and thus anticipates the \"light\" in the following sentence. \"[...]. The light / in the room more like a snowy air, / Reflecting snow\" embraces and extends the aura around the flower arrangement: the interior light is not like snow falling, but rather like air reflecting fallen snow. The observer is so subtle that he cannot help but elaborating the snow image: during the winter the afternoons have been very brief; but now, with afternoons elongating, winter is near the end and somehow meets early spring, and a fresh snow lies immaculate on the ground, like a breathtaking artwork of Nature, which gives a pure, refreshing and ethereal tone to the air reflecting snow. This late-winter scene suggests that the observer, like \"the snowman,\" wants \"a mind of winter,\" but not a mind of deep winter. The light that gives luster to the flower arrangement, like the rainwater that glazes a red wheelbarrow (William Carlos Williams, \"A Red Wheelbarrow\"), works beautifully on both formal and metaphorical levels. It represents a natural light, but as part of an art world it also becomes an aesthetic light.So far the language is very pictorial, in the manner of a still life. When Stevens portrays an object, he often builds a simple yet powerful image, omitting all insignificant details. Therefore, his image is at once concrete and abstract, familiar and unfamiliar, and appropriately distances itself from reality. In the first stanza of \"The Poems of Our Climate,\" the image is very concrete and real: this is about a Japanese flower arrangement. Meanwhile, there is no extravagant description of the object, but a word picture almost in the style of a Chinese xieyi (\"to convey the spirit\") painting. It highlights the principal components of the flower arrangement (water, bowl and carnations), and throws away lesser details (such as the spatial disposition of flowers, the effect of foliage). The aesthetic atmosphere is not only created by the description of the object itself; it is also a product of the language. To use minimalism to achieve maximal effect - this is also the case for the language. The diction is basic English words, mostly monosyllabic and disyllabic. Stevens only suggests and expects the reader to complete the picture by himself.\"Pink and white carnations\" recurs verbatim in line 6, implying that the observer moves his meditative eyes back to the core image. Then the poem abruptly takes another direction: \"One desires / so much more than that.\" This jump from imagistic to argumentative language is visually strengthened with the use of a hyphen to connect a noun phrase and a full sentence. Meanwhile, \"desire\" corresponds to the etymological hint of carnation, and the whole question about desire will continue to inform the rest of the poem. \"The day\" is in opposition to whatever \"in the room,\" designating the world external to the flower arrangement. Thus \"[...] The day itself / is simplified\" suggests that art reduces the outside world. \"[...] a bowl of white, / Cold, a cold porcelain, low and round, / With nothing more than the carnations there.\" Once again, Stevens returns to visual imagery, but this is not a wanton repetition of the earlier lines, but rather a repetition with nuanced variations or a deliberate revision, as if the observer observes through a closer perspective. \"Cold, a cold porcelain, low and round\" introduces new details about the container and unmistakably echoes the \"cold pastoral\" in Keats's \"Ode on a Grecian Urn.\" While \"a bowl of white\" seems a neutral description of what is seen, the \"cold porcelain,\" just like Keats's cold urn, implies that this is a lifeless, artificial work. Although Stevens appreciates the aesthetic effect of the flower arrangement, subliminally he is not satisfied with its lifelessness and otherness to human world. He desires more: in the closure of the next stanza, he will repeat the word \"more\" thrice, where \"more\" becomes almost obsessive.Now, get back to the title. How to justify \"The Poems of Our Climate\"? There are poets whose titles are throwaways, but not Stevens. Stevens cares a great deal about titles. His titles are always precise and integral to his poems. The first stanza seems to totally leave out the title, yet on a deeper level flower arrangement is a metaphor for poem writing. Metaphor is not an ordinary association of one object with another, but a figuration or trope which suggests the essence of one object by identifying it with certain qualities of another. Like Whitman, Stevens has an amazing command of figuration. For him, metaphor is a powerful means through which imagination imposes order on reality. \"The Poems of Our Climate\" opens with an objective description of clear water, brilliant bowl, pink and white carnations, and snowy light. As the poet is projecting his imaginary magic on those things, they will go through a metamorphosis and become metaphorical references to poetry writing, for both are the objects of formal arrangement, and both use delicate minimalism to achieve elaborate effect. Because this transfiguring act of mind is rooted in an objective world, the aura of duality shines through the images: they are at once flower arrangement and poetry writing. Indeed, what makes this poem \"poetic\" is the dynamic shifting back and forth between the real object and the metaphorical meanings it prompts.IISay even that this complete simplicityStripped one of all one's torments, concealedThe evilly compounded, vital IAnd made it fresh in a world of white,A world of clear water, brilliant-edged,Still one would want more, one would need more,More than a world of white and snowy scents.Stevens desires \"complete simplicity,\" but such \"simplicity\" is a trope for reduction and deprives him of the necessary pain and suffering in writing a poem. The capitalistic \"I\" is arresting, since Stevens always uses the impersonal \"one\" (\"one\" occurs four times in this stanza and six times in the whole poem), yet here he says \"The evilly compounded, vital I.\" In \"Notes Toward a Supreme Fiction,\" \"I\" stands out again: \"What am I to believe? ...\" There is rhetorical power in the Stevensian \"I,\" which is almost electrifying. It recalls Whitman's \"real me\" or \"me myself\" in \"Song of Myself,\" for all these terms suggest a self that is one's consciousness but is a deeper and unknown part of one's consciousness. Stevens was very evasive about Whitman, one of his prime precursors. He never had anything good to say about Whitman in prose. Actually he blamed Whitman for Whitman's tramp persona. Yet, as Harold Bloom observes, \"Whitman is a deeper and darker presence/absence in Stevens's work.\" Good poetry in any language always depends on allusiveness. This stanza echoes a couplet in \"Song of Myself\":Dazzling and tremendous how quick the sun-rise would kill me,If I could not now and always send sun-rise out of me ...As self-contradictory as the Whitmanian \"real me\" or \"me myself,\" the Stevensian \"I\" is both \"evilly-compounded\" and \"vital\" (this word is never negative). Bloom unravels the paradox by arguing that \"The `Vital I' is compounded evilly only because it is compounded at all.\" In other words, Stevens is talking about a radical duality of self or even a plurality of selves, on which he will not give a stable judgment. \"Vital\" is also to find its compelling resonance in \"the never-resting mind\" in the succeeding stanza. A critic believes that Stevens's inward peering \"I\" also implies its externally seeing homophone \"eye.\" I agree with this insightful reading, for the whole poem is built upon the act of looking and seeing. \"Still one would want more, one would need more, / More than a world of white and snowy scents\" builds a crescendo of \"mores\" and reinforces the theme of desire. Stevens was from New Jersey and in his native language \"scents\" allegedly sounds like \"senses,\" so here he might be making another homonymic pun.In this stanza, \"a world of white\" recurs once more. This time, it is the word \"brilliant-edged\" that unfolds new information. The edge is between what two sides? Japanese flower arrangement draws materials from nature; meanwhile, it is cut and placed by people. Thus, it is a product of setting art against nature, so is poetry. The edge makes clear the dichotomy of art vs. nature. Fundamentally, high literature, especially poetry, is a continuous tradition. This poem explores a single motif that emerges again and again in a succession of strong poets - the relation between art and nature. Stevens is concerned with creating some shape of order in the wilderness and chaos of reality. On the other hand, he refuses to transform and harmonize reality at the cost of making violent imposition upon it. Shelley, in \"A Defense of Poetry,\" realizes that \"even the greatest poetry will, through time, become nothing more than signs for classes of thought, loosing its poetic edge as a result.\" To find the finer edge of words, Stevens urges us to get rid of the illusion of things and get to the truth. In Stevens's own words, \"the hum of thoughts evaded in the mind.\" (\"Notes Toward a Supreme Fiction\")This stanza is syntactically distinguished from the other stanzas for a single sentence runs through all seven lines, creating an extended \"suspension system.\" The effect is to have the completion of meaning constantly delayed, and to make the delay a means of defamiliarizing the process of conferring meanings. \"Say even that,\" like \"more like\" in line 3, is an American idiom, meaning \"granted that.\" It introduces a concessive clause and distantly echoes the adverb \"still\" five lines later. This pair of connectives frames the whole sentence or stanza. While in the first stanza, imagery is the dominant device and noun structures prevail, this stanza is characterized by strong statements and powerful verbs. \"Stripped,\" \"concealed,\" \"made it fresh\" are positioned either at the beginning or the end of lines, and in sequence they make a set of structural parallels. This compels us to recognize their weight in the meaning-making process.IIIThere would still remain the never-resting mind,So that one would want to escape, come backTo what had been so long composed.The imperfect is our paradise.Note that, in this bitterness, delight,Since the imperfect is so hot in us,Lies in flawed words and stubborn sounds.If the last stanza closes with a litotes or an understatement in which one's desire is expressed by negating its opposite (\"a world of white and snowy scents\"), this stanza will directly address that keen desire of \"the never-resting mind\": \"one would want to escape, come back / To what had been so long composed.\" Again and again in this poem, Stevens plays upon opposition and apposition. We have encountered \"Stripped\" and \"concealed,\" \"evilly-compounded\" and \"vital\" before, and now the oxymoronic \"escape\" and \"come back to\" again force us to pause and think hard. \"What had been so long composed\" sounds like a Nietzschean cosmos, whose nut is hollow and lacking any purpose or unity. It also reminds us of the Shakespearean motto: \"This is an art, which does mend nature, change it rather, but the art itself is nature\" (Winter's Tale).\"The imperfect is our paradise\" invites multiple readings as well. The first thing comes to mind is the famous biblical allusion. Since the fall, Adam and Eve had been expelled from the perfect Eden and living in the far-from-perfect earth. So, from the start human beings are destined to accept imperfection as our living paradise. This sentence also echoes the Robert Browning quote \"A man's reach should exceed his grasp,\" suggesting that poetry writing is a tantalizing project. To achieve artistic perfection, one should attempt even those seemingly impossible things, despite all necessary pains and suffering. Moreover, \"imperfect\" in Latin means \"unfinished.\" By brings back the etymological meaning of \"imperfect,\" Stevens revisits the Whitmanian theme: \"Nothing is final, he chants. No man shall see the end.\"This imperfect world demands an imperfect language, that is to say \"flawed words and stubborn sounds.\" The closing sentence starts with an imperative expression \"Note that\" and takes on the tone of an academic lecture. The shift of pronouns from \"one\" or \"I\" to \"our\" or \"us\" strengthens this sense of reaching out to others. As the poem moves towards closure, it is getting more and more disturbing, and the reader can feel a profound malaise on the part of the poet. Again, \"bitterness\" and \"delight\" are set in opposition, suggesting a puzzling psychic construction. \"The imperfect is so hot in us\" means the desire for imperfection is so fierce in us. \"Hot\" is used to contrast the earlier \"cold\" (\"Cold, a cold porcelain\"), and both words can apply respectively to their core meaning and extended meaning. \"Lies\" is an even more intriguing polyseme: delight tells us untruth in flawed words and stubborn sounds, and also consists in such words and sounds. In \"Notes Toward a Supreme Fiction,\" Stevens brings forward three fundamental functions of poetry: It Must Be Abstract; It Must Change; It Must Give Pleasure. So, he shares Shelley's view that joy is what poetry emanates from (\"A Defense of Poetry\"). Yet such a joy is achieved by flawed words and stubborn sounds, in other words, the stylistic eccentricity and strangeness in Stevens's word choice and his experiment with the musical quality of poetry.Finally, in what sense do we know Stevens? Stevens is a poet of profound subjectivity. He is always working on wordplays, suggestions and subtlety. He is endless. We go down and down and down, and cannot reach the bottom, and would still want more and need more. He carries us so deep into nature and art and their intricate interplay.",
                "review/helpfulness": "36/41",
                "num_reviews": 41
            },
            {
                "review/text": "Wallace Stevens is one of those rare writers who had a golden touch with words -- musical words, spellbinding imagery, and no boundaries to keep anyone from enjoying it. \"The Palm at the End of the Mind : Selected Poems and a Play\" brings together many of his best works, starting early in his writing career and stretching through the years.Over his lifetime, Stevens wrote several books of poetry, but his exquisite poems are best taken by themselves: the languid splendour of \"Sunday Morning,\" the spare eloquence of \"Man With A Blue Guitar,\" and the hymnlike grandeur of \"Le Monocle De Mon Oncle.\" (\"I know no magic trees, no balmy boughs,/No silver-ruddy, gold-vermilion fruits./But, after all, I know a tree that bears/A semblance to the thing I have in mind.\")This volume also contains his little-known one-act play, \"Bowl, Cat and Broomstick.\" Like many of his non-poetic works, this play deals with the nature of poetry, and is in the form of a dialogue between three seventeenth-century characters. It's part parody, part analysis. And while it's a bit weird, it's certainly worth reading.Wallace Stevens began publishing poetry at an importance time in writing history, when the older styles were falling away. But instead of ignoring one type of poetry in favor of another, he took the best of all kinds -- his verse combines Victorian opulance with the more modern free-form verse.Though he isn't as well known as Yeats or Williams, Stevens' poetry is one of the few kinds that is both technically good and emotionally rich. His poetry can be whimsical (\"Every time the bucks went clattering/Over Oklahoma/A firecat bristled in the way\"), but it is also meditative and philosophical, even tackling the nature of reality.If nothing else, Stevens' writing can be read just because it is exquisitely beautiful. He lavished details all over almost every poem he wrote; his style tends to be a bit on the ornate side -- Stevens freely uses the more exotic terms -- such as \"opalescence,\" \"pendentives\" and \"muleteers\" -- wrapped up in complex verse, sometimes with a rhyme scheme and sometimes free-form.\"The Palm at the End of the Mind\" is a wonderful collection of Wallace Stevens' most significant long poems, his underrated play, and his equally important smaller ones. A must-have.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a review of this particular collection, not of Stevens' poetry; others have done that. I'll just say that T.S. Eliot and W.B. Yeats were once my favorite 20th century poets, but I have come to rate Stevens ahead of both. You could spend the rest of your life on Stevens and die knowing that you did not exhaust what was to be found there.This compilation of Stevens' poems was selected by his daughter, Holly Stevens. The poems are a selection, not the author's complete works, and they are presented in the order in which they were written. I like the book for the way the poems are presented on the page, with lots of white space around them available for penciling in your own notes; that's something you are likely to do a lot of with Stevens' poetry. (Then changing your mind, erasing, and writing new notes...)But otherwise the Library of America volume is to be preferred, because it is complete, not a selection, and because the poems are organized by the successive books of poems Stevens published. That edition also contains letters and other ancillary material of interest. But the LOA volume also has very thin pages and little margin space for notations. So, I've got the LOA volume for reference and this \"Palm\" volume for notations. Works out pretty well, and between the the two you have just about everything.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Stevens is an uncommon writer in that much of his greatest work he produced late in his lifetime. Perhaps its depth, maturity, and beautiful language result in some part from this fact. His poetry is delightful to read and hear, wrought with powerful imagery and provocative questions about art, the world, and reality. I find myself reading certain poems regularly, over and over again.The Palm at the End of the Mind is a great collection, though it includes little more than Stevens' selected works - nothing in the way of comments, direction, or information about particular poems nor about Stevens and his views.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "w h auden selected poems",
        "description": "Between 1927 and his death in 1973, W. H. Auden endowed poetry in the English language with a new face. Or rather, with several faces, since his work ranged from the political to the religious, from the urbane to the pastoral, from the mandarin to the invigoratingly plain-spoken. This collection presents all the poems Auden wished to preserve, in the texts that received his final approval. It includes the full contents of his previous collected editions along with all the later volumes of his shorter poems. Together, these works display the astonishing range of Auden's voice and the breadth of his concerns, his deep knowledge of the traditions he inherited, and his ability to recast those traditions in modern times.",
        "authors": "['Wystan Hugh Auden']",
        "infoLink": "http://books.google.com/books?id=eEOOsfQO9sIC&dq=W+H+Auden:+Selected+Poems&hl=&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "W. H. Auden has always been one of my favourite modern poets, and the 'Selected Poems' one of my favourite volumes of his work. While he gained popular vogue for a time following Ben Elton's film 'Four Weddings and a Funeral' (still one of the funniest films ever made), the full extent of Auden's ability is attested to in this volume, which includes some of his best loved and well recognised poems (and does not include 'Funeral Blues', the poem from 'Four Weddings' - if you're looking for that poem, try the short volume 'Tell Me the Truth About Love'). This selection by Edward Mendelson includes the original versions of poems edited by Auden later in his life, also giving a unique perspective on the early development of Auden's work.Poetry is, of course, a very personal taste, and one man's favourite poem is another's jumble of ill-chosen words. That being said, it is difficult, to my mind, to find poems written in this century which surpass 'Oxford', 'Mus&eacute;e des Beaux Arts', 'In Memory of W. B. Yeats', 'Et in Arcadia Ego'...the list is practically as long as the table of contents. No matter the subject (even to something as curious as 'In Praise of Limestone'), Auden has words for us, words which are as powerful, as moving now as they were the day they were put to paper.In short, if you are at all tempted by poetry, this volume is certainly worth your time.",
                "review/helpfulness": "35/35",
                "num_reviews": 35
            },
            {
                "review/text": "Auden is one of the great poets of the past century and one of the greatest ever in English. This is a particularly good collection of his work. The editor, Edward Mendelson, is a leading Auden scholar and Auden's literary executor. This volume contains all of Auden's major poetry including the great short lyrics, the major longer works, and my favorite, the great China sonnet sequence. In his later years, Auden altered the text of some famous earlier poems to change wordings he felt were false. In this edition, Mendelson uses the earlier versions of these subsequently altered verses. Many prefer the early versions though I find comparisons with the amended versions published in the equally wonderful Collected Poems, also edited by Mendelson, to be very interesting. I am not sure that the amended versions are worse, just different. It contains also a particularly insightful preface by Mendelson that does a very nice job of putting Auden into the context of 20th century English poetry. This is a wonderful book for those who love Auden's work. It can be read over and over again. It is also an excellent introduction for those encountering Auden for the first time.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "I can do little more than echo the other reviewers here. This is all a 'selected poems' shoud be: introductory and selective. Yes, &quot;Funeral Blues&quot; is missing. But no one can complain about what is here, which includes &quot;In Time of War&quot;, the great sonnet sequence; &quot;The Quest&quot;, another long sequence; and the entirety of THE SEA AND THE MIRROR, which is based on Shakespeare's THE TEMPEST. If you are, however, only interested in his love poems, I'd have to steer you toward TELL ME THE TRUTH ABOUT LOVE, a nice little chapbook containing only those.My own personal experience with this book may be relevant. It has served to introduce me to one of the finest poets of the last century and sparked a desire to read THE COLLECTED POEMS, also edited by Mendelson, to see how Auden re-wrote thirty of the brilliant poems here included. I'm continuing on my voyage; hope you are starting on yours.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "For many of us,the poems that we read in childhood and adolescence are those that stick with us the most. When I was fifteen, I bought this volume and promptly fell in love with Auden's poetry. His work showed a restlessness with the social and political state of his world, and I found that I could connect with it both intellectually and emotionally. To this day, I can revisit this book's pages feeling like I am visiting a childhood friend. Auden expressed some feelings I shared with him, and I was moved by his ability to express them better than I ever could: with frankness, wit, and grace. A must for any literary enthusiast (or any curious fifteen-year-old, for that matter).",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "W.H. Auden is truly, as noted by editor Edward Mendelson, a twentieth century poet. Auden had a firm grasp on the essence of contemporary politics and culture and possessed a knack for bringing a reader into his world. This selection spans the entire body of Auden's work, and contains several early poems which are hard to find, as Auden refused to have them republished in later collections of his work. It is a good introduction to Auden, but I recommend reading it along with Collected Shorter Poems 1927-1957, as that contains the revisions that Auden made to his poems over time, in his fervor for complete honesty in his work.While Mendelson's selection is well put together and a good representation of Auden's early craft, the revised poems are generally much stronger (though often bleaker in tone). Many changes, such as the famous revision of September 1, 1939 to read \"we must love one another and die\" rather than \"we must love one or die\" were made to reflect the author's shifting attitudes. However, other poems improve significantly with Auden's editing, and if this book is the only Auden you read, you'll miss out on the full depth of his power as a poet.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The poetry is splendid -- Auden is a brilliant, sensitive, musical and entertaining writer -- and the selection is fairly representative. Mendelson prefers Auden's later poems to his earlier ones, so the twee middle-aged sequences \"Bucolics\" and \"Horae Canonicae\" are included complete, while most of \"Twelve Songs\" (which has some terrific love poems like \"Fish in the unruffled lakes\", \"Funeral Blues\" and \"Tell me the truth about love\") is not. Still, there is enough in here, esp. in the first two-thirds of the book, to give you a fair enough taste of Auden's verse to entice you to buy his Collected Poems.(You'll still need the Selected; it has a couple of good poems that Auden decided not to republish, and superior versions of some early poems.)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Auden wrote much poetry in many different forms. He was a very learned poet with strong connection to English poetic tradition. Among his most known poems are those which are also my favorites,\"Musee des Beaux Arts\", \"In Memory of W. B. Yeats\" and \"September 1,1939\". The concluding stanza of this last poem gives a good idea of the special colloquial power of Auden's rhyme and rhythm.\"Defenceless under the nightOur world in stupor lies;Yet, dotted everywhere,Ironic points of lightFlash out wherever the JustExchange their messages:May I, composed like themOf Eros and of dust,Beleaguered by the sameNegation and despair,Show an affirming flame.In that poem also contains the great stanza, \" Lest we should see we are/ Lost in a dark haunted wood/ Children afraid of the night/ Who have never been happy or good.\"Auden was too a considerable critic of Literature, an outstanding Anthologist, a man-of- letters in a true sense.I do not know the range of his poetry well, but the anthology pieces are filled with memorable lines.Edward Mendelson, a well- known Auden scholar, in this work presents a number of original poems which Auden as he was wont to do improved for the worse.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "among the monarchs phoenix poets",
        "description": "In poems of haunting lyricism, and in a voice wholly unlike any other American poet, Christine Garren's second book of poetry explores common themes such as love, loss, and family with an uncommon sensibility. Among the Monarchs is filled with unforgettable metaphors, unconventional and unpredictable juxtapositions, turns and angles of perception, and seductive free verse rhythms. Through all of this, Garren captivates readers in a unique exploration of the nature of desire, the raptures and burdens of love and loss, the peculiarities of family life and, perhaps most compelling, the power of poetic imagination to shape what we see and feel. At once engaging and disquieting, Among the Monarchs attests to the inexhaustible possibilities of lyric poetry.",
        "authors": "['Christine Garren']",
        "infoLink": "http://books.google.nl/books?id=N_3ligl8GJAC&dq=Among+the+Monarchs+(Phoenix+Poets)&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "There is a time when I enjoy facts and details and the concrete narrative. Other times I prefer to slip away in an ethereal haze, to be taken in by a poem, to not have to understand the beginning middle and end. This poet is not afraid. She does not bend to the poetics of fashion. She has a voice and it sings, sometimes such a sad song that it almost hurts to read the poem. The poems in this book are haunting, mysterious, sometimes personal,and sometimes mythical. But they are all fresh and full of the magic that makes you want to read each short poem until somehow you find yourself at the end, sighing, lost, miraculously alive.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The remarkable feature of this set of short poems is the feeling that you can see the hand of the poet as the work is edited. There is an appreciation of the words that cluster around each poem, fighting to be included. This is not to indicate that the poems are minimalist in any sense, but rather that they carry no unnecessary baggage. The heart of the vision stands clear and unencumbered.Most of the poems are personal. Ms. Garren writes about what she knows and what she feels, but she does so in such a way that a broader context is conveyed to the reader. She does not become everywoman, but rather someone we already know, perhaps ourselves.from &quot;Picinc&quot;I saw my dead one, my unborn, wearing her dark swamp hairwave to me from a place on the grass. I did not knowshe had gone there with me - and that she would be beside me forever,as she is now, like an animal, wanting back inside the house.- - -&quot;Among the Monarchs&quot; is excellent reading on its own merits, and these short poems provide a superb lesson in what is possible with excellent editing.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "harmonium a book of poems",
        "description": "An \"incandescent....redefining biography of a major poet whose reputation continues to ascend\" (Booklist, starred review)-Wallace Stevens, perhaps the most important American poet of the twentieth century. Wallace Stevens (1879-1955) lived a richly imaginative life that he expressed in his poems. \"A biography that is both deliciously readable and profoundly knowledgeable\" (Library Journal, starred review), The Whole Harmonium presents Stevens within the living context of his times and as the creator of a poetry that continues to shape how we understand and define ourselves. A lawyer who rose to become an insurance-company vice president, Stevens composed brilliant poems on long walks to work and at other stolen moments. He endured an increasingly unhappy marriage, and yet he had his Dionysian side, reveling in long fishing (and drinking) trips to the sun-drenched tropics of Key West. He was at once both the Connecticut businessman and the hidalgo lover of all things Latin. His first book of poems, Harmonium, published when he was forty-four, drew on his profound understanding of Modernism to create a distinctive and inimitable American idiom. Over time he became acquainted with peers such as Robert Frost and William Carlos Williams, but his personal style remained unique. The complexity of Stevens's poetry rests on emotional, philosophical, and linguistic tensions that thread their way intricately through his poems, both early and late. And while he can be challenging to understand, Stevens has proven time and again to be one of the most richly rewarding poets to read. Biographer and poet Paul Mariani's The Whole Harmonium \"is an excellent, superb, thrilling story of a mind....unpacking poems in language that is nearly as eloquent as the poet's, and as clear as faithfulness allows\" (The New Yorker).",
        "authors": "['Paul Mariani']",
        "infoLink": "https://play.google.com/store/books/details?id=JjwjBQAAQBAJ&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Wallace Stevens first revealed his genius in 1923, when his first collection of poetry \"Harmonium\" was released. While it was only the first part of his career as a poet, Stevens' first book is in some ways his best -- despite being a little uneven, \"Harmonium\" has a rough, passionate quality.\"At night, by the fire,/The colors of the bushes/And of the fallen leaves,/Repeating themselves,/Turned in the room,/Like the leaves themselves/Turning in the wind,\" writes Stevens in \"Domination of Black,\" a display of the beauty and eerieness of his work. And Stevens sticks to that in poems like \"Infanta Marina\" (\"Her terrace was the sand/And the palms and the twilight\"), the steamy beauty of \"O Florida, Venereal Soil,\" or the eerie surreality of \"Tattoo.\"While lush, rich poetry was what suited Stevens the best, \"Harmonium\" also has some more minimalist poetry, such as the sparse \"Gubbinal\" (\"The world is ugly,/And the people are sad\"). And one of his rare strikeouts is the confusing \"The Man Whose Pharynx Was Bad.\" Even these are not bad, just not as good as they could be.Virtually anyone can write poetry -- the trick is writing something that stirs the reader, or at least makes them think. Stevens had a rare gift for poetry, and that gift propelled him into fame during his own lifetime. It isn't much of an exaggeration to say that he was one of the great poets of the twentieth century.Stevens dips into both free verse and rhyming poetry, without sticking solidly to anything for any period of time. At times his poetry is just an intellectual pleasure, without any rhyme or rhythm. But in \"Le Monocle De Mon Oncle,\" he creates a poem with an almost hymnlike quality -- solemn, ornate and thoroughly beautiful.It's the descriptions that really make his poetry shine. He paints almost everything with color -- sapphire seas, gilt umbrellas, electric fireflies, rotted skulls, and how a \"red bird flies across the golden floor.\" And with lines like \"the light is like a spider./It crawls over the water,\" Stevens also gave his poetry a note of the dreamlike.Richly surreal and beautiful, \"Harmonium\" is a remarkably polished first collection. Wallace Stevens wasn't yet at his peak in the years before 1923, but with \"Harmonium\" he became a must-read.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is one of those rare volumes, like the 'Lyrical Ballads' of Wordsworth and Coleridge which announces to the world the arrival of a new major Poet. Not all thought so at the time. And many found Stevens too dandified and precious to be a major voice. But among the poems of this collection are among the most beautifully colorful musical creations in Modern Poetry.This volume contains the following Poems:Earthy AnecdoteInvective Against SwansIn the CarolinasThe Paltry Nude Starts on a Spring VoyageThe Plot Against the GiantInfanta MarinaDomination of BlackThe Snow ManThe Ordinary WomenThe Load of Suger-CaneLe Monocle de Mon OncleNuances of a Theme by WilliamsMetaphors of a MagnificoPloughing on SundayCy Est Pourtraicte, Madame Ste Ursule, et Les Unze Mille ViergesHibiscus on the Sleeping ShoresFabliau of FloridaThe Doctor of GenevaAnother Weeping WomanHomunculus et La Belle EtoileThe Comedian as the Letter CFrom the Misery of Don JoostO Florida, Venereal SoilLast Look at the LilacsThe Worms at Heaven's GateThe Jack-RabbitAnecdote of Men by the ThousandThe Silver Plough BoyThe Apostrophe to VincentineForal Decorations for BananasAnecdote of CannaOf the Manner of Addressing CloudsOf Heaven Considered as a TombOf the Surface of ThingsAnecdote of the Prince of PeacocksA High-Toned Old Christian WomanThe Place of the SolitairesThe Weeping BurgherThe Curtains in the House of the MetaphysicianBanal SojournDepression Before SpringThe Emperor of Ice-CreamThe Cuban DoctorTea at he Palaz of HoonExposition of the Contents of a CabDisillusionment of Ten O'ClockSunday MorningThe Virgin Carrying a LanternStars at TallapoosaExplanationSix Significant LandscapesBantams in Pine-WoodsAnecdote of the JarPalace of the BabiesFrogs Eat Butterflies. Snakes Eat Frogs. Hogs Eat Snakes. Men Eat Hogs.Jasmine's Beautiful Thoughts Underneath the WillowCort&egrave;ge for RosenbloomTattooThe Bird with the Coppery, Keen ClawsLife is MotionArchitectureThe Wind ShiftsColloquy with a Polish AuntGubbinalTwo Figures in Dense Violet NightTheoryTo the One of Fictive MusicHymn from a Watermelon PavilionPeter Quince at the ClavierThirteen Ways of Looking at a BlackbirdNomad ExquisiteTeaTo the Roaring WindPoems Added to Harmonium (1931)The Man Whose Pharynx Was BadThe Death of a SoldierNegationThe Surprises of the SuperhumanSea Surface Full of CloudsThe Revolutionists Stop for OrangeadeNew England VersesLunar ParaphraseAnatomy of MonotonyThe Public SquareSonatina to Hans ChristianIn the Clear Season of GrapesTwo at NorfolkIndian RiverAmong these are a number of the signature- poems of Stevens: Thirteen Ways of Looking at a Blackbird, The Emperor of Ice- Cream, Peter Quince at the Clavier, To the One of Fictive Music,Anecdote of the Jar, Bantams in Pine- Wood, The Snow Man, Sunday Morning.My own personal favorite is : Peter Quince at the Clavier . The poetry of its music is among the most deeply felt and colorful in all Stevens work. Its concluding Stanza rings in my mind at this moment.\"Beauty is momentary in the mind-The fitful tracing of a portalBut in the flesh it is immortal.The body dies; The body's beauty lives,So evenings die, in their green going,.A wave interminably flowingSo gardens die their meek breath scentingThe cowl of winterdone repenting .So maidens die to the auroralCelebration of a maiden's choral.Susanna's music touched the bawdy stringsOff those white elders: but escapingLeft only death's ironic scraping.Now in its immortality it plays upon the clear viol of her memoryAnd makes a constant sacrament of praise.\"Stevens intense musicality, his love of color, the delicate intricacy of his long lines, his precise intellectual playing in searching for the Ideal in the Real, his seeming to make even Beauty a necessary fiction- all these and more- make him one of the most interesting and greatest of twentieth- century American poets.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "emily dickinson selected poems",
        "description": "During Emily's life only seven of her 1775 poems were published. This collection of her work shows her breadth of vision and a passionate intensity and awe for life, love, nature, time and eternity. Once branded an eccentric Dickinson is now regarded as a major American poet.",
        "authors": "['Emily Dickinson']",
        "infoLink": "http://books.google.com/books?id=0pYZS1NLzWsC&dq=Emily+Dickinson:+Selected+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Just as a prism breaks up light into a band of colors - red, orange, yellow, green, blue, indigo and violet - and their infinite gradations, so do Emily Dickinson's poems become, as it were, a prism which captures the white light of reality, a reality which as it flows through the prism of her poem explodes into a multiplicity of meanings.It is the rich suggestiveness of her poems, a suggestiveness which generates an incredible range of meanings, that prevents us from ever being able to say (to continue the metaphor) that a given poem is 'about red' or 'about blue,' because her poems, as US critic Robert Weisbuch has observed, are in fact about _everything_. This is what makes her so unique, and this is why she appeals to every kind of reader (or certainly to open-minded ones) and even to children.Emily Dickinson's poetry is one of the wonders of the world.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "I love poetry but had not read many if any of emily dickinson so I picked this up to read in my spare time. At first glance the book and poems seemed so simple and easy to read. I thought it would be a small little delight to read her short poems while waiting in the car, or at the bank, in line at the grocier, but as I embarked on a stolen moment with the poems of emily dickinson you discover her poems are hardly simple.Every poem seems has more than one meaning. You can truely see how complicated this simple woman must have been even in her observations.I have been delighted by her insight and each poem makes me wonder of the woman who wrote them. A lovely read.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the light the dead see the selected poems of frank standford",
        "description": "Between 1972, when he published his first book, The Signing Knives, and 1978, when he died at the age of twenty-nine, Frank Stanford published seven volumes of poetry. Within a year of his death, two posthumous collections were published. At the time of this death, as Leon Stokesbury asserts in his introduction, \"Stanford was the best poet in America under the age of thirty-five.\" The Light the Dead See collects the best work from those nine volumes and six previously unpublished poems. In the earlier poems, Stanford creates a world where he could keep childhood alive, deny time and mutability, and place a version of himself at the center of great myth and drama. Later, the denial of time and mutability gives way to an obsessive and familiar confrontation with death. Although Stanford paid an enormous price for his growing familiarity with Death as a presence, the direct address to that presence is a source of much of the striking originality and stunning power in the poetry.",
        "authors": "['Frank Stanford']",
        "infoLink": "http://books.google.com/books?id=rtumzZ-I8gwC&dq=The+Light+the+Dead+See:+The+Selected+Poems+of+Frank+Standford&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Unique in form and subject matter, Frank Stanford was a poet of great vision and power. While his verse may seem random and vulgar at first glance, The Light the Dead See stunned me with its familiarity with Death as a companion and friend. With this in mind, it seems no wonder that Stanford eventually felt compelled to take his own life.Stanford's poetry is without bounds. The imagery he puts forth concerning the backwaters of rural America gave me chills, not because it was frightening, but because it illustrated the truth about the often violent and arbitrary turns of chance rule the lives of many of us.This book is not to be missed. It could very well change the way you look at poetry.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Frank Stanford died a suicide at a young age, yet managed to create a body of work that deserves to be read despite his youth and nearly 20 years of obscurity. His poems, both subject and meter, are of great beauty. It's too bad that most of his work is out of print but, despite this, the University of Arkansas Press manages to keep the best of his poems alive. They do deserve to be read, and a good part of Stanford's work merits a wider audience. Check out The Light the Dead See for a great example of what this guy managed to create in his short life.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you're thinking about buying this book go for it. It is worth it. Most of his books are out of print but thankfully this book is available. If you like it check out Stanford's \"The Battlefield Where the Moon Says I Love You.\"",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Frank Stanford's \"The Light The Dead See\" is a compilation from 5 of his other collections: \"The Singing Knives\", \"Crib Death\", \"You\", \"Arkansas Bench Stone\", \"Field Talk\" and a brief excerpt from his epic \"The Battlefield Where The Moon Says I Love You\". There are also some previously unpublished poems.Stanford's poetry is really like nothing I've ever read, death obsessed or not. His condensed surrealistic imagery which brings one face to face with a kind of Lovecraftian secret of human behavior is Stanfordesque: there's no other way to process it. He owns every line.This is the kind of verse that as Archibald MacLeish put so beautifully, \"does not mean but BE\". \"The Snake Doctors\" makes it clear through the use of quietly violent imagery and the appearance and reappearance of carnival freaks that a monstrous apocalypse is on the horizon. A magical doom encircles the varied masks Stanford wears.At times he reminds one of Bacovia.\"I woke up in a boat/It was full of blood/My feet were dragging through the water/A knife was sticking in the prow/And the sun was black/It was dark/But I saw the snake doctors riding each other..\"Irresistible. This is the real thing, and it's a shame Stanford is known not primarily for his work as the horrible way he died. A must read for those who adore poetry in the ether.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I had not heard of Frank Stanford until my dear friend Bill gave me this little book. He explained that he was on a mission to introduce people he cared about to Stanford's poems. I can see why I missed it, since his work does not fit into any of the clean boxes that some of my early poetry influences favored. All the same, I am sorry that I missed it for so long. The jumpy dream-like quality was a lot of what I was trying to work for, back when I was writing poetry.Oddly enough, once I started reading this, all kinds of other connections appeared. For instance, my favorite Lucinda Williams song, Pineola, was written for Stanford.I like the rural focus that the poems have, and the way that the diction feels familiar even when I do not know exactly what Stanford is saying. He clearly has a taste for tall tales and dreams, and tells the truth of his world through these beautiful fantasies. It is a sad truth, and often a broken truth. Even if the introduction had not told me that Stanford killed himself, I might have guessed it after reading his work.Stokesbury wrote a good introduction, by the way. It is informative, short and not irritating. A mark that many other poetry collections miss.Anyhow, there are times when I feel as though I can review poetry, and other times that I am left at a loss for words. All I can say about this book is that I think it is a good thing that Bill is on his mission-- more people should read this work. I may just join him in it this Christmas.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "longitudes selected poems",
        "description": "Dryden: Selected Poems is drawn from Paul Hammond and David Hopkins's remarkable five-volume The Poems of John Dryden, and includes a generous selection of his most important work. The great satires, MacFlecknoe and Absalom and Achitophel, are included in full, as are his religious poemsReligio Laici and The Hind and the Panther, along with a number of Dryden's translations from Horace, Ovid, Homer, and Chaucer. Each poem is accompanied by a headnote, which gives details of composition, publication, and reception. The first-rate annotations provide information on matters of interpretation and give details of allusions that might prove baffling to contemporary readers. Some 300 years after his death, Dryden: Selected Poems will enable new generations of readers to discover the poet of whom Eliot wrote: 'we cannot fully enjoy or rightly estimate a hundred years of English poetry unless we fully enjoy Dryden'.",
        "authors": "['Paul Hammond', 'David Hopkins']",
        "infoLink": "https://play.google.com/store/books/details?id=EmMPEAAAQBAJ&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I relive shivering sleepless nights on the frosty steppes of Central Asia, longing for the warmth and fellowship of a better place and time. Reading Birkbeck's poems almost takes me there! His poem, &quot;Nazi Princess&quot;, makes me laugh and cry at the same time.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "You're walking down the richly-appointed hallway of a luxurious Florntine palace, basking in stupefied wonder and awe of your surroundings. Suddenly, one if the lavish tapestries is yanked away and you're left looking at what's really there-- curious water marks on the wallpaper. That's what reading Birkbeck's poems is like; the yanking away of apparent reality, and the glimpse underneath of the virtual reality. This poet is a magician!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Although John Birkbeck is sparing in his words and in the use of punctution, this, oddly, makes the sound and sense of the poems more cogeant and ingestible. He is a master at complex bathos and yet manages to be quite funny, too. One does not &quot;review&quot; a book like this, one wallows in it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I use the word &quot;Lunatic&quot; in a flattering way, of course, when I deal with John Birkbeck's poems. His references to the moon are quite cryptic and laden with spooky mystery. Just as in the body of his work, one dangles between humour and horror. Many of his poems are a sort of wake-up call for those of us who walk on the thin ice of the reality of the inner life.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the poems of gerard manley hopkins",
        "description": "This work has been selected by scholars as being culturally important and is part of the knowledge base of civilization as we know it. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. To ensure a quality reading experience, this work has been proofread and republished using a format that seamlessly blends the original graphical elements with text in an easy-to-read typeface. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.",
        "authors": "['Robert Bridges']",
        "infoLink": "http://books.google.com/books?id=2y_lwgEACAAJ&dq=The+Poems+of+Gerard+Manley+Hopkins&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The first poem by Gerard Manley Hopkins I read was \"PiedBeauty,\" which was included in a book of poetry for children thatwas given to me by my great-aunt. In high school, I read \"Spring and Fall: to a young child\" and loved it, though I did not realize it was by the same author. It was only college that I connected the two, and discovered a wonderful poet, who has become one of my favorites.For a fan of Hopkins looking for an authoritative volume, this edition is a treasure. In addition to his better known works, it contains early poems, numerous fragments, and unfinished works, in fact \"every scrap of English verse which can be ascribed... to Hopkins\" (from the Introduction xvii). In addition, it contains a good essay on Hopkins and his work, and extensive textual notes.Hopkins poetry may appear obscure and difficult at first, and in fact it is, at times, wildly original. Hopkins' language is deliberately archaic and inventive, and he both revives wonderful words not used since Shakespeare, and makes up his own. Hopkins also writes in \"sprung rhythm,\" a metrical style that is almost syncopated, and juxtaposes stressed syllables. I recommend reading his poems out loud. The sheer beauty of his language will inspire you to recite the words over and over again, until you understand his meaning: the essence which he is trying to distill. New readers may be daunted by this volume at first, and find that Hopkins' great poems are \"submerged in a mass of less significant fragments\" (Intro xiv). I would suggest his sequence of ten sonnets (#31-40) as an ideal place to start reading.Hopkin's friend and fellow poet Robert Bridges wrote that Hopkins strove \"for the unattainable perfection of language,\" and at times he seems to have actually obtained it: \"Men go by me whom either beauty bright / In mould or mind or what not else make rare: / They rain against our much-thick and marsh air / Rich beams, till death or distance buys them quite.\" (The Lantern out of Doors, #40). END",
                "review/helpfulness": "39/43",
                "num_reviews": 43
            },
            {
                "review/text": "THE POEMS OF GERARD MANLEY HOPKINS. Fourth Edition based on the First Edition of 1918 and enlarged to incorporate all known poems and fragments. Edited by W. H. Gardner and N. H. Mackenzie. 362 pp. Oxford and New York : Oxford University Press, 1970. ISBN 0-19-281094-4 (pbk.)For anyone who is interested in Hopkins, and everyone should be, this is the standard and authoritative edition. It gives us the only complete and accurate text which for the first time puts the poems in their true chronological order.The poems have been arranged in four sections : Early Poems (1860-1875?); Poems (1876-1879); Unfinished Poems, Fragments, Light Verse, &amp;c. (1862-89); Translations, Latin and Welsh Poems, &amp;c. (1862-67). The book contains a useful and informative Introduction and Foreword, and is rounded out with very full Notes, a series of Appendices, and Indexes of titles and first lines. It is also beautifully printed on excellent paper, stitched, and bound in a sturdy glossy wrapper.Hopkins had a unique sensibility, and brought something very special and of great value into English poetry. He seems to have had the ability to enter into the intelligence and feelings and spirit of all life forms, whether animal or plant or even landscape, to resonate with the indwelling divinity within them, and to somehow magically bring the miracle of their vibrant being over into his poems.Hopkins is in fact a striking example of the fully human sensibility as described in the works of Heidegger and the great thinkers of the East, and exemplifies a quality of sensibility which most of us seem somehow to have lost. We skate dully and blindly over the surface of things, but Hopkins plunges into the depths of being and carries us along with him. In other words, he puts us back in touch with reality, with what life is really about. Hence his enormous value and importance.In a complete collection such as this, there are bound to be many poems that fall short of greatness. For the newcomer to Hopkins, one suggested approach might be to first read some of his greatest poems, poems such as 'God's Grandeur,' 'Spring,' 'The Windhover,' 'Pied Beauty,' 'The Caged Skylark,' 'Binsey Poplars,' 'As kingfishers catch fire, dragonflies draw flame.'There are many beauties to enjoy in Hopkins - his unique use of language, his control of sound and rhythm, his amazing images and metaphors - but for me the most beautiful thing of all is the news he brings, news of a universe in which all things are of infinite value and infinitely precious, and in which no creature is of any less value than another because all are indwelt by divinity:&quot;Each mortal thing does one thing and the same : / Deals out that being indoors each one dwells ; / Selves, goes itself ; _myself_ it speaks and spells, / Crying _What I do is me : for that I came_&quot; (p.90).Hopkins makes us acutely aware of our loss, and our crime. His poems map out a path back to a saner, more balanced, and more wholesome and intelligent way of dwelling on the earth, dwelling lightly upon it with all other creatures and as its guardian, not its ravager.&quot;O if we but knew what we do / When we delve or hew - / Hack and rack the growing green! / ... After-comers cannot guess the beauty been...' (pp.78-9).Hopkins, I think, would have been very much in agreement with Heidegger who tells us that the earth must once again become a _Spielraum_ , a space of great beauty in which to play, and one in which all creatures, instead of being treated as mere objects, are allowed to do what they came here to do, to develop the full potential of their natures and fulfill themselves as manifestations of divinity. His poems are unforgettable, and one envies those who may be coming to them for the first time.",
                "review/helpfulness": "32/34",
                "num_reviews": 34
            },
            {
                "review/text": "Many lines on my Kindle 3 have rectangular boxes containing questions marks prepended. So \"The Wreck of the Deutschland\" looks something like???????????????Thou mastering me??????????God! giver of breath and bread;?????World's strand, sway of the sea;??????????Lord of living and dead;???Thou hast bound bones and veins in me, fastened me flesh,???And after it almost unmade, what with dread,?????Thy doing: and dost thou touch me afresh?Over again I feel thy finger and find thee.There are some poems where this doesn't happen at all, and others where it regularly occurs. I think the ?s represent spaces for formatting indentations. It would be nice if there were a way to either filter the ?s out or convert them to spaces. Given a relatively low price, and given that this seems to be a comprehensive collection of Hopkins' poetry, 3 stars seems a fair rating.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "On my Kindle, I don't know how to get beyond the introduction and to the poems. I do next page after next page and just get introduction. Pressing the joy stick right does nothing. There is a brief table of contents at the beginning, but Early Poems and Poems are not selectable. Of course, I can go to a high-numbered location, but I have no sensible way to choose the number. In addition, since the introduction was formatted for the Kindle DX, the lines run over on the Kindle 2.Of course if you know Hopkins, you can do a search on a word or two. The only word I knew to search for was \"dappled\". This led me to the poem I was looking for, and I enjoyed it and the next few poems. The poems fit on the page quite well.On reconsideration, I wanted to change my rating from one to three stars, but Amazon wouldn't let me.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a truly great book -- but the Kindle edition is not properly formatted for the Kindle. There is no table of contents or links to individual poems. The line breaks in many poems are in the wrong location. Some of the greatest of his poems do not even have line breaks at all but are formatted as a single paragraph. Too bad, but I recommend looking for a better edition of this book.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This review does not relate to the quality and character of the Oxford Complete Poems. It rather relates to Hopkins unique greatness as a poet which I will try to say a few words about.Hopkins created his own style of verse, his own vocabulary for perceiving the world, his own special rhythm and language in poetry.He is not the most easy poet to understand, and I will admit that his longer poems lose me.When I consider his work I relate primarily to five, six , seven poems which seem to me extraordinary. \" The world is charged with the Grandeur of God\" and \" Thou art indeed just, Lord\" and \"Felix Randall the Farrier, Is he dead then?' are to me the most memorable. They contain a power and beauty, a tremendous sense of identification with and understanding of the suffering in life, a kind of unique and intimate perception of the details of the natural world.Hopkins the tormented priest wrote to my mind some of the most memorable and beautiful lines in the English language. Consider the closing of ' Thou art Indeed Just Lord\" \"Birds build but not I build/ but break Times wounds And never breed one work that wakes Thou O My Lord of Life Send my roots Rain.\"",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Gardner and MacKenzie have compiled a fine collection of Hopkins' juvenalia, mature work, and uncollected fragments/translations.I wish that I knew what to say to compel readers unfamiliar with his work to buy this or another collection. The Terrible Sonnets are among the most moving treatment of spiritual anguish in the English language. If you are doubting, take the time to look \"Carrion Comfort\" up on the web-- the poems are available at Bartleby.com. This book is one of my constant poetic companions.For readers already familiar with the more famous pieces, it is a treat to see his younger work and translations. Reading the book as a whole gives a picture of a mind in motion. What led him to this point?\"NO worst, there is none. Pitched past pitch of grief,More pangs will, schooled at forepangs, wilder wring.Comforter, where, where is your comforting?\"Read it, read it, read it.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "this time new and selected poems",
        "description": "\"This healthy collection of new poems and selections from seven previous volumes is remarkable for its generosity of spirit, manifested in a warm surrealism that is often turned with humor toward his own past as a way of understanding the recurrent questions of growing old: 'Why did it take so long / for me to get lenient? What does it mean one life / only?' \" -- Publishers Weekly (starred review) \"Gerald Stern's achievement is immense. In this beautiful gathering . . . one encounters a poet who praises and mourns in turn and even at once.\" -- Grace Schulman, The Nation \"Stern is one of those rare poetic souls who makes it almost impossible to remember what our world was like before his poetry came to exalt it.\" -- C. K. Williams",
        "authors": "['Gerald Stern']",
        "infoLink": "http://books.google.com/books?id=dO4fNQAACAAJ&dq=This+Time:+New+and+Selected+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Reading a Gerald Stern poem is hitching a ride on a boomerang built with words. One is going to be taken on an exhilarating emotional ride through space and then returned gently to earth not quite the same person. Many compare Stern to Whitman because of his humanity which makes his work accessible and memorable. He is a magician who turns the mundane into magnificence by writing with his whole being. A master poet who doesn't tell about experiences, rather, he shares them with his readers. Keep this book by the bedtable and dream along with these poems.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Gerald Stern's book of poems demonstrates it IS his time. The selected poems cover Stern's past up to present, suspending images and thought, passing a range of emotions that then rise from within the reader. I have read and continue to re-read this collection, hear G.S.'s matter-of-fact voice lifting from pages, see his impressions as clearly as if I were seeing them with my own eyes. This is a book I take along on trips or vacations or sudden moves. If you know Gerald Stern, you'll love THIS TIME; if you don't know Stern, you'll love him before finishing only five of his poems. Lovely, lovely... and thought provoking.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "poetry and the age",
        "description": "About Poetry and the Age: \"Perhaps the most comprehensive and certainly the most detailed of all studies of modern poetry.\"-- Delmore Schwartz, New York Times Book Review \"Randall Jarrell's book about poetry and the criticism of poetry pulls the bung-cork out of the barrel. The reader is exhilarated, led on to agree with Mr. Jarrell joyfully, even to cap his opinions--and at last to grow reckless. . . . Poetry and the Age is enormously readable.\"-- Louis Simpson, The American Scholar \"The most powerful reviewer of poetry active in this country for the last decade. . . . Everybody interested in modern poetry ought to be grateful to him.\" -- John Berryman, New Republic Randall Jarrell was the critic whose taste defined American poetry after World War II. Poetry and the Age, his first collection of criticism, was published in 1953. It has been in and out of print over the past 40 years and has become a classic of American letters. In this new edition, two long-lost lectures by Jarrell have been added. Recently discovered by critics, they speak to issues at the heart of Jarrell's criticism: the structure of poetry and the question \"Is American poetry American?\" One of the outstanding poets of the postwar generation, Jarrell was also celebrated for his extraordinary praise of some underappreciated older and younger poets and for his witty dismissals of current favorites he thought less qualified. Poetry and the Age includes groundbreaking considerations of Walt Whitman and Robert Frost as well as profound appraisals of Wallace Stevens, Marianne Moore, John Crowe Ransom, and William Carlos Williams. His early reviews that established the reputations of Robert Lowell and Elizabeth Bishop are here, beside other enthusiastic discoveries that have withstood the test of time. Poetry and the Age also contains Jarrell's influential essays on the obscurity of poetry and on the age of criticism, essays that offer some of the most relevant and readable literary judgments of the 20th century. Randall Jarrell (1914-1965) wrote eight books of poetry, five anthologies, four children's books illustrated by Maurice Sendak, four translations, including Faust: Part I and The Three Sisters (performed on Broadway by the Actor's Studio), and a novel, Pictures from an Institution. He received the National Book Award for poetry in 1960, served as poet laureate at the Library of Congress in 1957 and 1958, and taught for many years at the University of North Carolina, Greensboro. He was a member of the American Institute of Arts and Letters.",
        "authors": "['Randall Jarrell']",
        "infoLink": "http://books.google.com/books?id=cxOcQgAACAAJ&dq=Poetry+and+the+Age&hl=&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Randall Jarrell, a poet of great stature as well as a critic, in 20 or so essays, discusses poets, poetry, criticism, and the merits of several specific modern poets and selected of their works. We would expect a poet to be passionate about poetry, and that he is. But more than that, he is also passionate in his conviction that \"Poetry does not need to be defended, poetry...has been an indispensable part of any culture we know anything about\" and \"Human life without some form of poetry is not human life but animal existence.\" He contends that the average person of today finds it more difficult to appreciate, or even comprehend, poetry than in previous ages because of the diminished role of reading and the onslaught of television in modern America. This was in 1953!But in rejecting poetry we are rejecting the richest form of human expression, a form that if properly experienced can convey from a very gifted individual(the poet), to the rest of us: impressions of strange beauty, and unique ways of perceiving time, existence, truth, love or any other thing or concept. He acknowledges that the capacity to appreciate poetry will probably be limited to the few, but does not condone elitism. True poetry has not to do with insiders' use of technical devices to show off their superiority, but has to do with the communication of some sort of truth between humans in a form that uses only the right words in the proper order with the proper accents, and uses no more words than necessary, to communicate that truth.There is a nice essay on criticism and what makes a good critic, which I found quite interesting. I think his guidelines for critical integrity could be applied even at the level of Amazon reviewers. And then, there are many essays devoted to the poets such as Robert Frost, Wallace Stevens, Marianne Moore, William Carlos Williams, and several others. I learned much, but feel as though I only scratched the surface of understanding much of what he critiqued. However, I have the sense that there is much worth digging for beneath that surface.The main negative to this collection was to me the constant practice of Jarrell to say things with such ironic juxtaposition, evidently to impart a piquancy and to give just that exact delicate shade of meaning to his discussions. For instance \"... it is possible to tell part of the truth about the world in terms that are false, limited, and fantastic...\" or \"Originality is one of his major virtues and minor vices.\" This is all very clever, but sometimes began to seem a bit much.But Jarrell did not spare even poets whom he considered to be great from some rather rigorous criticism. In the same spirit, I thought this was a splendid book, although sometimes its style seemed a little exalted. At 245 pages, this was rather a lot of poetry criticism to digest. Poetry, this quest for the highest level of perfection of expression, and books like this, which help prepare our minds to receive it, seem to me important human endeavors which will hopefully continue to be appreciated, at least by a few.I believe books like this are well worth exploring, even by non-academic types like myself, who are seeking to broaden their comprehension of our culture. I am personally acquainted with only one other person, a guy in Davenport, Iowa, who willingly reads these sorts of books for personal enrichment. Maybe I'm overly optimistic, but I think there are many who would find it rewarding to try at least one or two such as this.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is, without doubt, the best literary criticism - or explication - I've ever read. Among other things, Jarrell does his best to bury the popular notion of Frost as avuncular, non-threatening nature poet, bringing this dark, primal writer alive as nobody else has ever done for me.The essays on Frost, plus the author's take on such poets as Whitman, WC Williams and Marianne Moore, both enlighten and entertain.Jarrell, too, was a fine poet but, based on the evidence herein, he was an absolute master of English prose. I think this book is the one thing that he wrote that is destined to last. . .",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "poems of marianne moore",
        "description": "A landmark definitive edition of one of our most innovative and beloved poets The landmark oeuvre of Marianne Moore, one of the major inventors of poetic modernism, has had no straight path from beginning to end; until now, there has been no good vantage point from which to see the body of her remarkable work as a whole. Throughout her life Moore arranged and rearranged, visited and revisited, a large majority of her existing poetry, always adding new work interspersed among revised poems. This makes sorting out the complex textual history that she left behind a pressing task if we mean to represent her work as a poet in a way that gives us a complete picture. New Collected Poems offers an answer to the question of how to represent the work of a poet so skillful and singular, giving a portrait of the range of her voice and of the modernist culture she helped create. William Carlos Williams, remarking on the impeccable precision of Moore's poems, praised \"the aesthetic pleasure engendered when pure craftsmanship joins hard surfaces skillfully.\" It is only in New Collected Poems that we can understand her later achievements, see how she refashioned her earlier work, and get a more complete understanding of her consummate craftsmanship, innovation, and attention to detail. Presented and collected by Heather Cass White, the foremost scholar of Moore's work, this new collection at last allows readers to experience the untamed force of these dazzling poems as the author first envisioned them.",
        "authors": "['Marianne Moore']",
        "infoLink": "https://play.google.com/store/books/details?id=Cc6YDQAAQBAJ&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Every Marianne Moore fan needs this book, and even the casual reader will benefit from all the uncollected poems Grace Schulman includes in this volume, nearly twice as big as the standard Complete Poems Moore published in her lifetime.Moore was a savage editor of her work, and insisted on collecting only what she considered the very best of her poems, often significantly revised over the years. Schulman pulls back the curtain to let you see the earlier versions, in the chronological order in which they were written, along with many very fine poems that didn't pass muster with Moore. You get four versions of the famous \"Poetry,\" for instance (\"I, too, dislike it\")-the 1919 original included in the body of the text and the three variants Moore wrote over the next 40 years tucked helpfully in the Notes at the back.The upshot is that you get a much clearer sense of Moore's development and characteristic concerns. Every bit as formidable, she also becomes just a little more human when you see the full range of her writing. Some of the false starts and minor pieces can often be more revealing than the Greatest Hits (though sometimes what Moore considered minor can be scary.) Now that Schulman's book is available as a paperback, I wonder how many of these lesser-known poems will eventually find their way into the anthologies.Schulman also won me over by including Moore's earliest poem, written for Christmas in 1895 when she was 8:Dear St. Nicklus:This Christmas mornYou do adornBring Warner a hornAnd me a dollThat is all.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is a must for students of Moore as it is the only one that contains all poems from her long career. Grace Shulman is a loving and conscientious editor, but the careful reader suffers much frustration because of the arrangement of the notes. Moore annotated herself extensively and also requires editorial notes because she wrote so many versions of her poems. Shulman rightly includes both sets of notes on every poem, but this edition makes it difficult to find them in the back of the book. They are arranged chronologically, so one has to know the date of each poem in order to look up the note. If there is a future edition, I hope simple page headings can be added, such as \"Notes to pages 100-115.\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have found Moore's poetry difficult to read in her Collected/Selected/Complete volumes because I could never grow beyond the perception of her poetry that magazine readers must have had--her poetry always appeared in isolated poetic moments and not a continuity of development. \"The Poems of Marianne Moore\" allows us to see her grow as a poet--as others state in the reviews for this book. However, Heather Cass White in \"A Quiver of Significance: Marianne Moore 1932-36\" warns of two problems in \"The Poems of Marianne Moore\". The editor reprints poems with \"conscientious inconsistency\"--meaning she sometimes chooses the 1967 version of the poem, Moore's last revision before her death, and sometimes chooses to reprint an earlier version of a poem. We never know, as Heather Cass White says, \"what stage of thinking is reflected in any given poem\". A further problem arises because the hardcover contains \"frequent errors of transcription\", again I quote White. I have not personally traced all those errors and those errors have been corrected in the paperback edition, however, be aware of the limitations of this praiseworthy effort.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have found Moore's poetry difficult to read in her Collected/Selected/Complete volumes because I could never grow beyond the perception of her poetry that magazine readers must have had--her poetry always appeared in isolated poetic moments and not a continuity of development. \"The Poems of Marianne Moore\" allows us to see her grow as a poet--as others state in the reviews for this book. However, Heather Cass White in \"A Quiver of Significance: Marianne Moore 1932-36\" warns of two problems in \"The Poems of Marianne Moore\". The editor reprints poems with \"conscientious inconsistency\"--meaning she sometimes chooses the 1967 version of the poem, Moore's last revision before her death, and sometimes chooses to reprint an earlier version of a poem. We never know, as Heather Cass White says, \"what stage of thinking is reflected in any given poem\". A further problem arises because the hardcover contains \"frequent errors of transcription\", again I quote White. I have not personally traced all those errors and those errors have been corrected in the paperback edition, however, be aware of the limitations of this praiseworthy effort.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "collected poems 19531993",
        "description": "\"The idea of verse, of poetry, has always, during forty years spent working primarily in prose, stood at my elbow, as a standing invitation to the highest kind of verbal exercise-the most satisfying, the most archaic, the most elusive of critical control. In hotel rooms and airplanes, on beaches and Sundays, at junctures of personal happiness or its opposite, poetry has comforted me with its hope of permanence, its packaging of flux.\" Thus John Updike writes in introducing his Collected Poems. The earliest poems here date from 1953, when Updike was twenty-one, and the last were written after he turned sixty. Almost all of those published in his five previous collections are included, with some revisions. Arranged in chronological order, the poems constitute, as he says, \"the thread backside of my life's fading tapestry.\" An ample set of notes at the back of the book discusses some of the hidden threads, and expatiates upon a number of fine points. Nature-tenderly intricate, ruthlessly impervious-is a constant and ambiguous presence in these poems, along with the social observation one would expect in a novelist. No occasion is too modest or too daily to excite metaphysical wonder, or to provoke a lyrical ingenuity of language. Yet even the wittiest of the poems are rooted to the ground of experience and fact. \"Seven Odes to Seven Natural Processes\" attempt to explicate the physical world with a directness seldom attempted in poetry. Several longer poems-\"Leaving Church Early,\" \"Midpoint\"-use autobiography to proclaim the basic strangeness of existence.",
        "authors": "['John Updike']",
        "infoLink": "https://play.google.com/store/books/details?id=eP0VMSOXLf8C&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "A poem is a poem is a poem, right? Wrong. At least to me poetry is something that comes from within, something that's born perfect, something that doesn't need the craftsman. I know I'll draw a lot of criticism from the school of thought that swears by crafted poetry, but no, that's not my cuppa.John Updike has always passed this touchstone test of mine, more so in this collection. True, not all pieces in this volume are spontaneous, but thanks to his respect for poetry, he has segregated his poems from his &quot;light verse.&quot; In his own words, &quot;In making this collection, I wanted to distinguish my poems from my light verse. My principle of segregation has been that a poem derives from the real (the given, the substantial) world and light verse from the man-made world of information - books, newspapers, words, signs. If a set of lines brought back something to me something I actually saw or felt, it was not light verse. If it took its spark from language and stylized signifiers, it was.&quot;The fact that Updike understands the thick line between poetry and prose in verse, doesn't make his poems and verses any less interesting. In fact, it adds to their character.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I really love the variety in this collection. He writes about science, travel, nature, and much much more. Each poem is quite different from the others. This variation makes each poem unique and very interesting.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "John Updike has accomplished a great deal in his career, but his poetry cuts to the heart of his obessions/teachings/observations on life. What a wonderful collection to behold. He makes one appreciate how poetry can once again speak to the heart as well as the mind. I highly recommend this excellent collection for poetry lovers and non-poetry lovers alike.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "talking in the dark poems",
        "description": "Whether homages to \"Old Cadillacs\" or reflections on \"Why We Need Poetry,\" these poems demonstrate Wesley McNair's ability to tell a life in a line and to disclose the knowledge of the heart. How McNair's characters talk about their difficulties -- or why they can't -- is central to this collection, as are meditations in which the poet speaks directly to the reader about the trials and affirmations of human experience.",
        "authors": "['Wesley McNair']",
        "infoLink": "http://books.google.nl/books?id=xq-umusezzoC&dq=Talking+in+the+Dark:+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Without abandoning the odd characters and comic moments that bring his poetry to life, Wesley McNair has moved in his new book from storytelling to meditation. As always, his sentences accelerate through unexpected turns, like one of his favorite old Cadillacs floating just off the ground, its steering wheel in the grasp of a proud owner who imagines the car new and himself rich. But these poems dare more than his earlier work, challenging the reader to ponder as well as see. Talking in the Dark is McNair's first book of new poems in five years. He is a New Hampshireman who has lived in Maine for 11 years. His poetry is deeply rooted in northern New England, but his voice is universally American. This has been his ambition since he published his first book, The Faces of Americans in 1853, 15 years ago. The new book's themes are loss, the struggle against life's limits and love. The love is sensual but sometimes unconventional. In &quot;Why We Need Poetry,&quot; the narrator wonders aloud at 3 a.m., after finishing a wallpapering job in his kitchen, why the cucumber sandwich he is eating tastes so good. The why is unimportant, he decides. What matters is that you're here in the pleasure of the tongue, which continues after you've finished your sandwich, for now you are savoring the talk alone -- how by staring at the band of fluorescent light over the sink or the pattern you hadn't noticed in the wallpaper, you can see where the sentence you've started, line by line, should go. Only love could lead you to think this way . . . And when the light itself grows larger, it's not the next day coming through the windows of that redone kitchen, but you, changed by the hunger for the words you listen to and speak, their taste which you can never get enough of. The sense of affirmation in these lines is the engine of McNair's poetry, the counterforce that lightens the clueless characters who inhabit many of his poems. He writes of lost people with their their ambitions collapsing and their dreams foundering and of old people with their faculties blinking out. He calls up the humiliations of his own dirt-poot childhood, events that eat into the present because they can never be buried or erased. Even the dogs in his poems often find themselves at the mercy of cruel owners. But McNair's characters are redeemed by their humanity. We readers see ourselves and our neighbors in them. We may pause at first to ask ourselves whether we are not captive to the same ironies and illusions that ensnare these characters, but the quesion soon turns into a resigned nod. We, too, crave what we can't have, fall for seven-day diets and lose our great thoughts in mid-sentence. McNair's poetry has always had three defining qualities: down-to-earth subject matter, accessibility and that saving grace, humor. He is a keen observer of the power of the popular American culture to overwhelm old values and a realist, not a sentimentalist, about the rural northern New England that is fading before our eyes. Talking in the Dark is McNair at his best.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Reading Talking in the Dark is like reading the inarticulate thoughts of your own heart. McNair writes with such eloquence and compassion about the inescapable realities of life that I cried as much with relief as with sadness as I read the poems. His very insistence on the embarrassing limits of our humanness points to what lies beyond it - a connection to ourselves and one another that defies our ability to understand it well enough to hold tightly to it for comfort, but which glimmers on the edge of consciousness, like headlights on the ice-coated telephone wires of &quot;Glass Night.&quot; The poems are written in the clear and simple language of everyday interactions - with an angry step-parent, an elderly relative who's abandoned the strain of an unacceptable reality, the neighbor who hopefully assembles old cars and appliances in the yard, the lover of many years whose very familiarity has a kind of strangeness in it. The mute testimonies of houses, cars, and clothes also appear, allies in the effort to make deals with our individual fates. These poems reveal the ordinary for what it is - an incomprehensible mystery. I highly recommend this book to everyone who struggles to make sense of the confounding mixture of passion, loss, humor, mortality, tedium, pain, and mute love that fills an average life.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "opus posthumous poems plays prose",
        "description": "When Opus Posthumous first appeared in 1957, it was an appropriate capstone to the career of one of the most important writers of the twentieth century. It included many poems missing from Stevens's Collected Poems, along with Stevens's characteristically inventive prose and pieces for the theater. Now Milton J. Bates, the author of the acclaimed Wallace Stevens: A Mythology of Self, has edited and revised Opus Posthumous to correct the previous edition's errors and to incorporate material that has come to light since original publication. A third of the poems and essays in this edition are new to the volume. The resulting book is an invaluable literary document whose language and insights are fresh, startling, and eloquent.",
        "authors": "['Wallace Stevens']",
        "infoLink": "https://play.google.com/store/books/details?id=qztUqewMpa0C&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This collection lacks 22 poems which appeared in \"The Palm at the End of the Mind\", Holly Stevens carefully edited selection highly approved of by Harold Bloom. Missing are \"Of Mere Being\", \"A Child Asleep in Its Own Life\" and \"For an Old Woman in a Wig\" to name but three. It leaves out the added lines of \"The Man Whose Pharynx Was Bad\". It lacks an index of first lines. If you're going to buy a book of Stevens' poems spend the extra $10 and get the magnificent Library of America \"Collected Poetry and Prose\" which contains EVERYTHING, is a huge bargain and will keep you occupied for the rest of your life. Or possibly get Holly Stevens \"The Palm at the End of the Mind\" which eliminates a lot of lesser poems which could confuse a newcomer to Stevens. The Vintage people have thrown this together without much thought. It's better than nothing, but the other two books I have named are the one's to get.",
                "review/helpfulness": "61/62",
                "num_reviews": 62
            },
            {
                "review/text": "Can poetry replace religion as an object of personal \"faith\"? Wallace Stevens thought so, and in this collection of exquisitely crafted poems he attempted to show us how. This collection contains many of his most famous pieces including the much anthogized \"The Snow Man\", \"Fabliau of Florida\", Anecdote of the Jar\" and \"Thirteen Ways of Looking at a Balckbird\", as well as, his most famous (anthologized) poem \"Sunday Morning\".In many ways the intensely focused vision and complex word play that Stevens employed, which aimed at breaking down the Western metaphysical binary between word and thing, in his poetry is representative of the deeply complect nature of his poetic vision. While not only breaking new ground in form and voice, Stevens, in these poems, sought to promulgate a view of poetry as deeply subjective and personal as our contact with the world and Nature itself. As Stevens himself later explained, his poetry was meant to represent \"not Ideas, but the things themselves\".The Snow Man, for example, can be read as a mediatation on death and its place in the natural part of the unending cycles of being. Although, not a new idea, the way Stevens frames it, through his highly complex use of such simple language, brought to bear by the implied interrelationships of the individual words at play, introduces the idea of Gaia to the discourse of modernity. Thus, to understand and experience connection with the world itself requires the abandonment of irrational, socialized fears and a willingness to accept death as a natural outcome of life, without deference to hopeful dogma and superstition.As \"The Snow Man\" illustrates, the message that Stevens tries to impart, through the transformation of language from mere linguistic signifiers into \"real\" referential elements grounded in reality--in brute being--is simply to force the reader to realize that the same action can be enacted in our individual interactions with each other and the world. Through metaphor and complex word play Stevens shows that the very metaphors that we all live by, simply shroud the apathetic reality that surrounds us all--something that some are just not willing to face. Thus, in a way Stevens poetry, through a redoubling of signification falls back upon itself and reveals that the world and the word are merely one and that neither takes precedence over the other, both mutually informs and defines the other, but only we, through our harmonium with the world, allow them to do so. Otherwise, we simply continue to delude ourselves and fail to see the actual things that lie in the ideas themselves.",
                "review/helpfulness": "25/36",
                "num_reviews": 36
            },
            {
                "review/text": "\"Her terrace was the sand/And the palms and the twilight\" -- and those are only the first two lines. Dipping into surrealism and imbued with spirituality, his poetry is compiled into \"The Collected Poems of Wallace Stevens,\" which includes seven compilations of his work.Over his lifetime, Stevens wrote several books of poetry, but his exquisite poems are best taken by themselves: the lush grandeur of \"Sunday Morning,\" the hymnlike \"Le Monocle De Mon Oncle,\" and the humid grittiness of \"O Florida, Venereal Soil.\" He takes multiple looks at \"Thirteen Ways of Looking At A Blackbird,\" and the lush \"Six Significant Landscapes.\"In other poems, Stevens dips into outright surrealism, like in the delicate \"Tattoo\" (\"There are filaments of your eyes/On the surface of the water/And in the edges of the snow\"), and also adds a meditative bent into \"The Snow Man\" (\"For the listener, who listens in the snow,/And, nothing himself, beholds/Nothing that is not there and the nothing that is\").If nothing else, Stevens' poetry can be read just because it is exquisitely beautiful. He lavished details all over almost every poem he wrote, and gave many of them the quality of a dream. His descriptions are simply written, but brilliantly laid out: \"When my dream was near the moon,/The white folds of its gown/Filled with yellow light.\"His style tends to be a bit on the ornate side -- Stevens freely uses the more exotic terms -- such as \"opalescence,\" \"pendentives\" and \"muleteers\" -- wrapped up in complex verse, sometimes with a rhyme scheme and sometimes free-form. And lush detail is added to many of his poems, with descriptions of the moon, sun, plants and lighting, along with dazzling descriptions of the colors.But his writing is more than beautiful. Stevens' work often poses questions about death, life, religion, and art, taking the conventional and turning it on its head. His belief in the importance of his art is reflected in poems like \"Not Ideas About The Thing But The Thing Itself,\" which ends with the portentous lines: \"Surrounded by its choral rings,/Still far away. It was like/A new knowledge of reality.\"Wallace Stevens is one of the most unique poets of the 20th century, and the sprawling \"Collected Poems of Wallace Stevens\" is a wonderful read.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "The poetry of Wallace Stevens as found in this most harmonious compendium is almost as inexhaustible as Shakespeare. There are times when he is as oblique within his traditional cadences as Emily Dickinson, but like that same poet, the words coruscate and are not cliches. What poet of sixteen, learning what poetry is, wouldn't benefit from a memorization of &quot;Le Monocle de Mon Oncle,&quot; or of parts of &quot;Sunday Morning&quot;?Wallace Stevens begins in the tropics and ends in the cold north; his two seasons as a poet are summer and winter; in both climates, he excels. Witness the formidable achievement of Crispin's voyages (&quot;The Comedian as the Letter C&quot;) for Stevens in summer, and later poems in blank couplets such as &quot;No Possum, No Sop, No Taters&quot; for Stevens in winter. In between, there is the marvelous tapestry of controlled whimsy and exquisitely orchestrated anarchy of &quot;Notes toward a Supreme Fiction&quot; where we have everything but the kitchen sink (caparisoned elephants, a flag whacking at the halyards, the President ordaining the bee to be immortal).We all know &quot;Thirteen Ways of Looking at a Blackbird&quot;; we might profit by reacquainting ourselves with &quot;Academic Discourse at Havana,&quot; &quot;An Ordinary Evening in New Haven,&quot; &quot;The Auroras of Autumn,&quot; &quot;The Dove in the Belly,&quot; and (forgive us if we do not record the full title, with its wince-worthy epithet, of the truly splendid sequence of small but glittering poems) &quot;Like Decorations in a Cemetery.&quot;These poems really should slay the thoughtless notion that the pentameter is an insurmountable restriction for the modern poet, because we see that a poet who is hampered by such an alleged &quot;difficulty&quot; is really no poet at all. (It was Mr Cummings who said that no poet should venture vers libre until he has mastered the old cadences, stanzas, &amp; forms.) We really must ask ourselves if the more facile modes of composition are necessarily improvements over these (or any) lines by Wallace Stevens:&quot;Panache upon panache, his tails deploy / Upward and outward, in green-vented forms, / His tip a drop of water full of storms.&quot;Or the pasage in &quot;Of Modern Poetry&quot; where we see the actor (poet) as &quot;A metaphysician in the dark [...] twanging a wiry string that gives / Sounds passing through sudden rightnesses.&quot; Or yet again:The old seraph, parcel-gilded, among violetsInhaled the appointed odor, while the dovesRose up like phantoms from chronologies.An anthologist of poetry once called Wallace Stevens's universe &quot;solipsistic&quot;; but we demur at this term. It is evident that, in spite of the occasional impenetrability of meaning, the discursus without destination or the &quot;description without place,&quot; the missing gist or multitude of gists, the ideas hiding almost successfully behind a glitter-glatter of joy in the sounds of the words themselves, Wallace Stevens had a lifelong conversation with reality that helped to compose these marvelous concertos of the supra-quotidian. His &quot;pick of ebon, pick of halcyon&quot; rarely failed him as he plucked his antique string in an accord of repetition. There is sometimes a surfeit of color, an impression that the poems (however elegant) are all &quot;surface,&quot; and the tone can sometimes oppress; but this oppression, if possible, is salutary. Always in evidence, however, is a mind at work on the language, making an ineluctable music, sometimes comic, sometimes tragic, consistently if not invariably enchanting:. . . words of the sea,Words of the fragrant portals, dimly-starred,And of ourselves and of our origins,In ghostlier demarcations, keener sounds.",
                "review/helpfulness": "19/25",
                "num_reviews": 25
            },
            {
                "review/text": "Stevens is a quirky and imaginative poet with a taste for unusual diction, a fluidity of ideas and an unerring instinct for the haunting and intriguing. The poems are meditational in their completeness and memorability and present a more delightful and pleasurable style of Modernism than the other 'greats' of the period such as T S Eliot or Ezra Pound. His attempts to create a 'Supreme Fiction' can at times be baffling, but there is a richness of pure self-indulgence in the poetry which means that it is immediately compulsive and a book which several of my friends agree is 'essential' to any poetry collection, whether its concern be with Poetry at its literary finest or with the langorous pleasure of 'the green freedom of a cockatoo...'and inspirational dream-like meditations. Treat yourself!",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "It has been said many times that Wallace Stevens is one of the five best and most influential American poets. After reading this collection of poems it is impossible to disagree. It is a marvelous experience to pick up this book and read a few poems.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Our Modernist Master. THE poet of the age, of any age, really. More soulful and jazz-happy than any Slam(e) Poete out stalking the cafes. A chirping metaphysical mind with all the right rhythms setting new tones.Unfortunately, you'll have to buy Opus Posthumous for some of the really great rare stuff.But here!: &quot;The Snow Man&quot;, &quot;To the One of Fictive Music&quot;, &quot;Re-Statement of Romance&quot;, &quot;Examination...&quot;, &quot;The Revolutionists...&quot;What a Figure of very capable imagination!",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Wallace Stevens is my favorite poet. This collection was prepared late in his life and is in a sense definitive, though the excellent Library of America collection is to be preferred as including a number of additional poems (including the controversial long poem \"Owl's Clover\"), as well as alternate versions of some poems, juvenilia, and also Stevens's essays.Stevens is known, it seems to me, in two separate ways. In the popular sense, he is known for a series of remarkable early poems, in most cases not terribly long, notable for striking images and quite beautiful prosody. Of these poems the most famous is surely \"Sunday Morning\" -- other examples are \"Thirteen Ways of Looking at a Blackbird\", \"Peter Quince at the Clavier\", \"Sea Surface Full of Clouds\", \"Tea at the Palaz of Hoon\", \"The Emperor of Ice Cream\", \"The Idea of Order at Key West\", \"Of Modern Poetry\". The great bulk of these come from his first collection, Harmonium, and indeed from thefirst edition of Harmonium, published in 1923. These were certainly my favorite among his poems on first reading. And they remain favorites.But his critical reputation rests strikingly on a completely different set of poems, all later than those mentioned above. (Though it must be acknowledged that at least \"Sunday Morning\" and \"The Idea of Order at Key West\" as well as two early long poems, \"The Comedian as the Letter C\" and \"The Monocle de Mon Oncle\", are in general highly regarded critically. And that most of his early work is certainly treated with respect.)I think it's fair to say that \"late Stevens\" begins with \"Notes Toward a Supreme Fiction\", perhaps his most highly regarded work. Of course the terms \"late\" and \"early\" are oddapplied to Stevens. His first successful poems appeared in 1915(including \"Sunday Morning\"), when he was 36. He was 44 when the first edition of Harmonium came out. That's pretty late for \"early\"! And by the 1942 publication of \"Notes Toward a Supreme Fiction\" he was 63. Indeed, his production from 1942 through his death in 1955 was remarkable: two major collections each with several long poems as well as at least another full collection worth of late poems, some included in this _Collected Poems_ but quite a few more not collected until after his death.What to say about late Stevens? The most obvious adjective is\"austere\". But that doesn't always apply -- he could also be quite playful. However, there is never the lushness of a \"Sunday Morning\" or \"Sea Surface Full of Clouds\" in the late works. The sentences tend to extraordinary length, but the internal rhythms are involving. The poems are all quite philosophical, much concerned with the importance of poetry, the nature of reality versus perceptions of reality, and, perhaps more simply, with growing old. (A Stevens theme, to be sure, that can be traced at least back to \"The Monocle de Mon Oncle\".)So: Stevens is an impossibly wonderful, remarkable, poet, either early or late. His lush and imagist early work remains a delight, and his philosophically involving late work rewards rereading and concentration. He is a poet to whom you can return again and again, and he will always be new.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Stevens is for me the great American poet of the twentieth century.His music is the supreme music of poetry . Not since Keats is there anyone as rich in the most elaborate kind of longworded poetry.His metaphysical meanderings may confuse but somehow find themselves justified by the memorableness of the great lines- and again the music.No one comes close to him in the kind of deep and complicated beauty he presents- and again the music.The meanings he makes are musical meanings, and the sounds of his lines sing in us ever more strongly , the more we read and reread.Stevens is the kind of poet we want to memorize and always have with us inside, so wherever we go , we can stop and to ourselves recite lines of beauty in joy.I may be wrong but I simply hear his poetry as the greatest America has had in the twentieth century - though lesser than Whitman and Dickinson.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I don't have much to add to what others have said, except this thought. I seem to remember reading a critic who said of James Joyce that his writing was (I am paraphrasing) not *about* anything, but was, instead, the thing itself. While I love Joyce, I think that this statement applies even more perfectly to Mr. Stevens. Let be be finale of seem!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the urban stampede and other poems",
        "description": "This new collection of poems by F.D. Reeve includes \"The Urban Stampede\", a dramatic narrative in poetic form, and twenty-four lyric poems. \"The Urban Stampede\" is a retelling of the Orpheus-Eurydice myth. It is the third such narrative from Reeve, as he attempts to rehouse grand myths from fallen cultures into the consciousness of today, seeking to show the enduring power of language itself and to bring spectator, poet, and performer together in the same place. These narratives include spoken voice and singing and are shaped by a careful underlying distancing?the basic characteristic of narrative poetry. In this way, a well-known story is coolly evaluated for cultural change and linguistic difference. In both the long poem, which is the centerpiece of this collection, and in the shorter poems, Reeve takes risks in order to explore the meaning that poetry gives to life-an immediately apprehensible vision apt in size and shape to our idea of the world, one in which the language of hands speaks to a guiding practical faith and the language of the mind leads to understanding and delight.",
        "authors": "['Franklin D. Reeve']",
        "infoLink": "http://books.google.com/books?id=aSpbAAAAMAAJ&dq=The+Urban+Stampede:+and+Other+Poems&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "F.D. Reeve is one of the finest, most underappreciated poets now at work in this country. For thirty-some-odd years he has been producing work of stunning power and relevance, work that reminds one all at once of the prophetic voice of Yeats, the piercing, crystalline sensibilities of Stevens, and the wild winds and fur pelts of a Siberian shaman. Unfortunately, the cultural spirit of the times, in its myopia, hasn't been able to keep up with him. It's true that Reeve has sometimes had a weakness for doggerelesque flourishes, but why so many critics focus on those while ignoring the overwhelming power of the rest of the work is a mystery.Although \"The Urban Stampede\" of the title is an oratorio written for performance and perhaps doesn't stand up as well on the page, the short poems included in this collection are, as the previous reviewer stated, monumentally good. Simply quoting lines from these poems will not do them justice, will not show how they cohere, but some of the lines are simply astounding. From \"The Side Show Uprising\": \"Praying for what they had nothing of/the homeless died one by one on the cold stones/unable to bear the grotesques of love\" From \"Still Life\": \"Real are the apples of Sodom, which when you touch them/dissolve in smoke and ashes on the table\" From \"Highgate Easter\": \"Old Believers gone, the words lie on the stones:/ No life is true but dying makes it fair\" From \"Bones in a Landscape\": \"the zodiac came alive;/a holy man at the door/arrested the unfaithful stars\" From \"Looking Ahead\": \"Neither was nor will be, the Great Attractor,/black moon, pangalactic draw,/something from nothing, the secret dies./Nowhere to go--we breed where we are--consumed in natural law.\"I could cite many more, but best just to get this book and read the poems, as well as Reeve's previous work. Long after today's Poets of the Hour have been forgotten, there will be many of us still reading his poetry, for its beauty, its timelessness and prophetic daring, its metaphysical grandeur, and its raw, hungry energy.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "THE URBAN STAMPEDE is spectacular. Reeve's contribution to American poetry, as I now see it, is to have made possible highly sensuous, fully embodied, musical thought--in a way, an improvement upon the (at times) mere rhetoric and abstraction of Stevens. Halfway between free and formal verse, the poems lean backwards in their echoes of poetry past all the while establishing new possibilities of complex expression--all the while negotiating a darkness that the mind (and a full life) can't exactly compensate for. I think \"Barnyard\" an immensely successful poem, the first stanza stunning in its metaphorical equivalences and formal balance. \"Highgate Easter\" seems to gather up and comment on any number of poems that want to see in nature some sign of redemption, trumping these poems with the line \"Men in winter let their language go\" (a subtle reworking, as I take it, of the argument in Stevens' \"The Snow Man\"). The last line of \"Wild Life,\" in its evocation of nature's exasperating indifference, is MONUMENTALLY good: \"and wild dogs shred the terrified sun.\" I can't think of a better line of poetry; it compresses an entire philosophical argument. What an image! The music of \"Watersong\" is impressive, beautiful. I like the way it recasts, in softer tones, the problem in previous poems. \"Bones in a Landscape\" is also very fine, the last line, again, particularly stunning: \"a holy man at the door/ arrested the unfaithful stars.\" \"Conventional\" navigates similar poetic waters in a way that juxtaposes incommensurate perspectives--I LOVE \"the infinite universe balloons/ in the cage of its own unused space.\" The tiny/immense paradox of contained expansion subtly becomes a metaphor for the mind's ambition. HOW CAN POETRY BE THIS GOOD??????? \"The Grand Illusion\" seems to walk new ground, at least with respect to its slightly more conversational voice and its presentation of a series of unanswered, unaswerable questions--questions that link religious \"cathedral\" and secular \"casual eating place\" in a tempting musical, miraculous hypothetical. \"Open and Closed\" reminds me of a poem Reeve wrote (a villanelle?) about a museum in Russia that was similarly \"closed.\" In a SELECTED POEMS, these two would work very well together. The rhyme scheme itself seems to embody the poem's mischievous send up; the last line hits you like a ton of dirt on a coffin lid! Suddenly, you're on a ride to the afterlife and cannot get to the necessary station. (In an anthology, I'd juxtapose this poem with the old Em Dickinson standard: \"Because I Could Not Stop For Death.\") \"The Instruction\" is absolutely devastating (I wonder if he's sent it to Robert Pinsky?); it nicely offers a more genuine democracy of the spirit, one fleshed out in \"The Urban Stampede.\" \"Afterword\" is a lovely ars poetica. I recommend to any true poetry lover this gorgeously sad but triumphant book. It's about time that some publisher issue a selected poems from this secret giant of American letters.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "a shropshire lad",
        "description": "A. E. Housman was one of the best-loved poets of his day, whose poems conjure up a potent and idyllic rural world imbued with a poignant sense of loss. They are expressed in simple rhythms, yet show a fine ear for the subtleties of metre and alliteration. His scope is wide - ranging from religious doubt to intense nostalgia for the countryside. This volume brings together 'A Shropshire Lad' (1896) and 'Last Poems' (1922), along with the posthumous selections 'More Poems' and 'Additional Poems', and three translations of extracts from Aeschylus, Sophocles and Euripides that display his mastery of Classical literature.",
        "authors": "['A.E. Housman']",
        "infoLink": "https://play.google.com/store/books/details?id=zbdLE4PENCYC&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "the title of 'A Shropshire Lad' indicates both rural specificity and human universality, and it is in the gap between the two that the poems' tension and tragedy lie. they evoke a timeless pastoral world, of streams, plains and roses; of ploughing, carousing and love-making; of villages, churches and football; all belonging to the unchanging cycle of the seasons. In this context man as a type, as a member of a community, is eternal also, not least in the folk idiom in which Housman's classical clarity is decaptively cloaked.as an individual, however, the 'lad' is insubstantial, doomed to leave or die as rural life continues unchanging without him. Many of the poems are narrated by exiles or ghosts, crushed to find the old routine the same as if they had never existed - the phantom of 'Is my team ploughing?' discovers even his grieving sweetheart now warm in his interlocutor's bed; he of 'Bredon Hill' plans his wedding, only to attend his own funeral.Housman uses a direct and simple vocabulary and metre with devastating resonances, the very music of the poetry at once rooted in the eternal communal land and yet indicative of sadness and loss. Written in 1896, the irony of death and change in the never-ending countryside was doubled by the reality that the countryside was changing, that the centuries-old lifestyles were being encroached on by industry and modernity - what seemed to be inviolable itself becomes obsolete. in hindsight, a third, poignant irony is added - within 20 years of publication, these lads would be sent to the slaughter in World War One, as previsioned in 'On the idle hill of summer'. One of Housman's greatest admirers, the composer George Butterworth, who wrote two song-cycles based on these beautiful poems, would be one such victim.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Housman is one of those very popular poets that are looked down by your English professor as being low brow and unfit for the elect. If you're the type who claims to belong to these elite, good luck for your choice of a sour life, you should never be caught with this book.Everybody else, dip in, the water is just fine.In Housman's poetry, there is sense, and ideas you can understand on first reading. Moreover, there are rare qualities you seldom see nowadays - rhyme, rhythm, correct grammar, proper punctuation, and words spelled so you can confirm from any English dictionary that they were used right.Be warned however that Housman's themes are repetitious (probably explains why he never wrote much poetry - perhaps he realized he is beginning to sound like a broken record even for the little poetry he was able to write), mostly about the transitoriness of youth and the tender sadness of death. Reading him too much too often is like listening to the greatest hits collection of a minor singer - after the third song, you get tired. But you did enjoy the first two.When I first bought this book in April 2000, the list price was only $1.00 and Amazon's price was 80c. It was good value then even for someone living in Asia. Now that there's a special surcharge, I guess it's just good value if shipping cost is minimized.For your money, however, try to find the old edition with line drawings. That was the first time I read Housman, and the line drawings realy enhanced the haunting loneliness of the sad poems.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This review refers to the Dover Thrift Edition Paperback of \"A Shropshire Lad\"....Without getting too analytical of the poetry itself or the meaning of Housman's works,as I am not a poet myself, I will say that I throughly enjoyed this edition of \"A Shropshire Lad\". Although Housman's words at times may seem a bit like the antedote to exhilaration, he seems to speak from the heart and wisely about the cycle of life. The never ending scheme of things.The seasons and the earth changing year by year. Young men falling in love, going off to war, coming home wounded, dead, or finding their loves no longer want them. It brought to mind for me, the song by Peter, Paul and Mary \"Where Have All The Flowers Gone\".Although these words were first published well over 100 years ago, I found there is still meaning in his words.Many of the lines in this book I found to still be quoted today. For example in poem LVI-\"The Day of Battle\", he ponders this:\"Comrade, if to turn and flyMade a soldier never die,Fly I would, for who would not?Tis sure no pleasure to be shotBut since the man that runs awayLives to die another day,And cowards' funerals, when they come,Are not wept so well at home,.........\"This Dover Thrift Edition is a great value for the price. It contains all sixty-three original poems of \"A Shropshire Lad\" including XIX-\"To An Athlete Dying Young\"(which you've heard if you have seen the film \"Out of Africa\"). It has an index with notes on the text which will clarify some of the names and places Housman uses that might be of geographic or historical value to the reader, and also has an index of the first lines, helpful in finding a specific poem. It's a small lightweight book you can easily throw in your purse, briefcase or even a large pocket, that you can pull out to read while you have time to kill or while traveling. It's something to add to your cart when you need just a little bit more to put you into that free-shipping catagory!Dover Thrift has many of these little books of great literary works, I plan on adding more to my collection....enjoy....Laurie",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "...in A. E. Housman's \"A Shropshire Lad.\" He is obsessed with death and the brevity of time. He is determined to wring meaning out of a teen soldier's blood-soaked shirt, to bring beauty out of tragedy.Poets' critical reputations move up and down like a sine curve. Given the increasingly unread status of poetry, however, one would think that Housman's rep would be on the upswing, since he presents his ideas with clear language, pleasant rhyme, simple trochaic or iambic meter, archetypal imagery, and intense emotion; his is among the most plain and accessible poetry a major author has ever crafted, a boon to the genre at a time it's largely being ignored.Still, people tend to read Housman wrong. They claim he's either promoting or deriding war. In fact, he's doing neither; war is simply an unfortunate fact of life for Housman. People must confuse him for Wilfred Owen, who actually does fulminate against war or Rudyard Kipling, who actually does promote it.... Even the lovely rural setting of the poems, which in another book he refers to as \"the land of lost content,\" suggests the rapture and freedom of boyhood is being mourned as it passes. Battle death is often a stand-in here for the death of innocence. War is only slightly more awful toward the body than time itself. War is only Housman's metaphor; love is his objective.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Recently, I was appalled to discover that the top one hundred hits under the heading \"A. E. Housman\" do not disclose a single volume of his collected poetry to be in print, save for a ridiculously overpriced and bloated scholarly edition of interest only to plodding, dry-as-dust, doctoral candidates. This is a disgraceful state for one of the great poets of the turn of the Twentieth Century, one who in his miniaturist way was a peer of Elliott and Pound.Alfred Edward Housman was born in 1859. At Oxford, he was universally regarded as a high-flyer, an odds-on favorite to win a \"First in Greats.\" All went well until his final term in 1881, when he crashed and burned during a disastrous final examination. Not only did he fail to get his \"First,\" he managed to get his degree only after months of delay, and that was a lowly, utterly undistinguished \"pass\".Housman was, to say the least, not loquacious about his life. What seems to have happened was that he fell hopelessly, eternally, absurdly, romantically in love with one of his roommates, a stolidly athletic young man named Moses Jackson. Jackson, alas for Housman's hopes, proved to be inconveniently and irredeemably straight. Not long before the final examinations, Housman apparently declared his passion for Jackson, who seems politely, even kindly to have said something on the order of \"No, thanks.\" In cricket terms, Housman was \"hit for six\" and he never recovered to the day he died.Housman's expectations of an academic career went down in flames along with his \"First.\" He slunk away from Oxford to work in the Patent Office, where--surprise, surprise--Jackson was also working, although the latter drew a higher salary because of his better degree. For ten years Housman toiled in these unfertile fields while on the side he contributed learned articles on classical subjects to the leading scholarly journals.Such was the brilliance of the man that in 1892 he was unprecedentedly plucked directly from the academic sterility of the Patent Office to become Professor of Latin at London University College. In 1911, he moved up a very large notch to become a professor at Cambridge, a very unusual thing, then, for an Oxford man. He remained at Cambridge, recognized as one of the jewels in the University's crown, until he died.Housman remained quietly attached to Jackson, even through Jackson's marriage and after he moved thousands of miles away to live in Vancouver, British Columbia (where I am writing this). Housman became the godfather for one of Jackson's children. When Jackson was on his deathbed in 1923, Housman rushed to him a copy of his second book of poetry, \"Final Poems,\" so that Jackson might read it in his last hours. Jackson, of course, was the unnamed subject of some of the poems in that book, just as he had been in Housman's first, \"A Shropshire Lad.\"After Housman's death in 1936, his younger brother, the novelist Laurence Housman, rummaged through his papers and from them published the third slender volume of Housman' poetry, \"More Poems.\"Housman was not prolific. He seems to have worked in short, intense spurts of creativity no more than three or four times in his life. He devoted far more time and effort to his life-long magnum opus, a multi-volume critical edition and study of Manilius, a late Roman poet of truly breathtaking obscurity, dullness and unimportance. Housman appears to have had the very last word on Manilius, largely because it is hard to conceive that anyone else would care enough to add another. Housman's lasting fame rests on just three slender volumes of poetry, respectively 96, 71 and 66 pages in length.Housman is the bard of tiny, perfect, miniatures. He is always formal in structure. One critic quite acutely called him the last Roman poet. There are no sprawling epics in him, hardly any smiling pastorals. He writes in a fit of sustained and remarkably entertaining depression, a poetic equivalent of film noir.Here is Housman the Roman, writing of Britain's standing army of regular soldiers, all but destroyed in 1914:These, in the day when heaven was falling,The hour when earth's foundations fled,Followed their mercenary callingAnd took their wages and are dead.Their shoulders held the sky suspended;They stood, and earth's foundations stay;What God abandoned, these defended,And saved the sum of things for pay.(\"Last Poems,\" XXXVII)Here is Housman in gaudily Romantic despair:The Queen of air and darknessBegins to shrill and cry,\"O young man, O my slayer,To-morrow you shall die.\"O Queen of air and darkness,I think `tis truth you say,And I shall die to-morrow;But you will die today.(\"Last Poems,\" III)And here is Housman in his first and most famous volume of poetry, \"A Shropshire Lad\":When I was one-and-twentyI heard a wise man say,`Give crowns and pounds and guineasBut not your heart away;Give pearls away and rubiesBut keep your fancy free.'But I was one-and-twenty,No use to talk to me.When I was one-and-twentyI heard him say again,`The heart out of the bosomWas never given in vain;`Tis paid with sighs a plentyAnd sold for endless rue.'And I am two-and-twenty,And oh, `tis true, `tis true.(\"A Shropshire Lad,\" XIII)\"A Shropshire Lad\" was first published in 1896. \"When I was one-and-twenty\" was written in January 1895, at which time Housman was thirty-five and a professor of Latin. When Housman was twenty-one, though, he was an undergraduate at Oxford and sharing space with Moses Jackson. Despite the warnings he must have heard, he gave his heart away, no use to talk to him. When he was two-and-twenty, he paid with sighs a plenty and examination's rue, and oh, `twas true, `twas true.Housman was a great poet in a small package. Grab anything of his that you come across. He'll make it worth your while.Full five stars / For many a rose-lipt maiden / And many a lightfoot lad.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "As with most high school students, I was required to read and analyze &quot;To An Athlete Dying Young.&quot; Its simple structure, elementary language and subject matter to which I could relate all made it one of my favorite poems at the time. Now, years later, it remains very interesting and drew me into A Shropshire Lad. I was curious to see the other material Housman published and was thrilled to find that all of his work shared similar attractive qualities. His poetry is accessible to even the most novice poetry readers (like myself) and clearly expresses complicated thoughts with beatiful language. Housman's empasis on the brevity of life, death and war are not happy topics, but they are realistic and it is valuable to consider his concise thoughts. I think this book, which essentially follows the life cycle, is full of fascinating poetry that anyone will enjoy, no matter what level you wish to analyze the material. It is a terrific collection.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I bought this book of poetry because of a recommendation from a close author friend of mine. Since I bought \"A shropshire lad,\" I have read it three times, highlighted my favorites and enjoyed every verse.The great thing about Housman is that his rhyme scheme seems effortless. Whereas other poets seem to struggle and adjust a story to fit the rhyme, Housman's poems flow naturally and are lyrical. The subjects of his poems are very royal and I enjoy them a great deal.If you are looking to enjoy some poetry that isn't hard to understand and is among the best ever written, I hihgly recommend \"A Shropshire Lad.\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Without getting too analytical of the poetry itself or the meaning of Housman's works, I will say that I throughly enjoy \"A Shropshire Lad\" many times over. Although Housman's words at times may seem a bit harsh or sometimes even depressing,he seems to speak from the heart and wisely about the cycle of life. The never ending scheme of things.The seasons and the earth changing year by year. Young men falling in love, going off to war, coming home wounded, dead, or finding their loves no longer want them. It brings to mind for me, the Peter, Paul and Mary song, \"Where Have All The Flowers Gone\".Although these words were first published well over 100 years ago, I found they are still most meaningful in today's world, as the cycle repeats. Many of the lines in this book I found to still be quoted today. For example in poem LVI-\"The Day of Battle\", he ponders this:\"Comrade, if to turn and flyMade a soldier never die,Fly I would, for who would not?Tis sure no pleasure to be shotBut since the man that runs awayLives to die another day,And cowards' funerals, when they come,Are not wept so well at home,.........\"All sixty-three original poems of \"A Shropshire Lad\" including XIX-\"To An Athlete Dying Young\"(which you've heard if you have seen the film \"Out of Africa\") are contained here. A wonderful book of poetry that knows no age. One that may be read often and aloud.Beautifully written,Enjoy...Laurie",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I adore this book of poems, and one of my most prized possessions is a very old, leather bound edition that I found in an antique store. That one is safely tucked away to prevent further deterioration, so a nice Dover Thrift version to carry around with me was just what the doctor ordered. If you're not a big poetry fan, this may be the right \"starter\" for you. Houseman's poems are simple yet thought-provoking, and they all strike me as hauntingly beautiful. This is my favorite book of poetry to just read straight through. Sometimes I read it all the way through at a sitting and other times I'll just read one or two and ponder a while. Houseman's themes of the transience of youth and the inevitability of death are easily relatable to all human beings, and his diction is so simple and direct that his meaning is usually clear. I recently ordered several of these to give out to my students (I teach high school) because the price is so unbelievably cheap. Briliant, beautiful poetry for $2! Need I say more?",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "poems everyman",
        "description": "A collection of poems about love and romance by famous poets from the eighteenth to the twentieth centuries",
        "authors": "['Peter Washington']",
        "infoLink": "http://books.google.com/books?id=kE-c58Jubj4C&dq=Poems+(Everyman)&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "There are two editions of Yeats' poetry with similar titles, this one (The Collected Works of W. B. Yeats: Volume 1: The Poems, edited by Richard Finneran, with 751 pages and published by Macmillan) and The Collected Poems of W. B. Yeats (also edited by Finneran, but published by Scribner with only 576 pages).The Collected Works: Volume 1: The Poems, contains all of Yeats' verse, including the poems from his plays and essays (hence the almost 200 additional pages in length). If you want every poem Yeats wrote, buy this edition.",
                "review/helpfulness": "46/48",
                "num_reviews": 48
            },
            {
                "review/text": "If you are, like me, a huge fan of the William Butler Yeats then you will find yourself slowly accumulating the 'Collected Works' volume by volume and not concern yourself with the cost. You will probably start with this volume, enjoy reading every poem written and feel this is an excellent volume.If, however, you are looking for a volume to study Yeats or enjoy the best of his verse you may be better served by 'The Collected Poems of W.B. Yeats&quot; or &quot;The Yeats Reader: A Portable Compendium of Poetry, Drama and Prose&quot;, both edited by Richard J. Finneran and less expensive, more portable paperbacks.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "One may find from Finneran similar collections in theThe Yeats Reader: A Portable Compendium of Poetry, Drama, and Proseand his ample collection, similarly titled but briefer,The Collected Poems of W.B. Yeats. Either may also be found more favorably priced as well, and, more humbly bound, submissive to rough and daily usage.Nevertheless this is the best you can get, and the price for a Like New or even a New copy is now quite accessible. I am very glad to have acquired mine today, through the great and mighty amazon.I have the Scribner Collected Poems linked here, which I shall use for my reading copy. This I will place in the shelf of Bibles, for special use, and special times, when settled in arm chair to read, in peace and safety, should that day ever come. This is a glorious book, of great scholarship and dignity, and commands respect.I refer here to the revised Second Edition published copyright 1997, so wonderful to hold, to find familiar verse, to bear in arms and to read.Essential reading for any appreciation of Mr. Yeats I have found in Professor Vendler'sOur Secret Discipline: Yeats and Lyric Form, which has opened so much to me, not only Mr. Yeats but beyond, into lyric form. I wished it had included a explicit and systematic revelation of his shifting meter as well, but what magnitude there is is ever-expanding.Please see also Mr. Ellman's study of WB,Yeats, the man and the masks (A Dutton paperback)andEminent Domain: Yeats Among Wilde, Joyce, Pound, Eliot and Auden.. I now await a recorded version of his work on Yeats, also through the amazon.In this present volume, so dignified, so glorious, so firm, so stern and serious to hold in hand, certain of its own great worth, we find therefore the most comprehensive collection of Mr. Yeats poetry possible, and the most authoritative. Part one of this 752 page book is titled Lyrical, containing every collection of poetry published in his lifetime, plus other collections, in chronological order, beginning with the 1889 Crossways through the 1899 Wind Among the Reeds through the Wild Swans at Coole of 1919 (containing some of his best known pieces) through the 1928 The Tower, through the Winding Stair and other poems of 1933, which includes Blood and Moon so well explained by Professor Vendler, and the Crazy Jane sequence, through New Poems and Last poems of 1938-9. Of course several collections are skipped in this present list for lack of space.This first Part also contains \"Narrative and Dramatic\" Poems beginning with the early Wanderings of Oisin (1889) through to the 1923 Gift of Harun Al-Rashid.Part Two contains Additional Poems, 129 in all. Then follows Appendix A of Yeat's own notes to his Collected Poems (1933). These from the Poet himself are followed by Finneran's Notes upon those Notes, as in the Scribner collection. Then follows five musical notations for five poems from 1938's New Poems, with notes for the tunes and their traditional origin.Then comes one hundred pages of explanatory notes original to this editor, who explains what to expect and what not to expect within them. \"The purpose of these notes is to annotate all specific allusions in the poems. Annotation of other kinds, as well as interpretive commentary, has been avoided (p. 623).\" Along with other avoidances, Finneran mentions ascribing certain personages to certain poems as a slippery slope not to be approached, although traditionally we have assumed certain poems to be \"about\" someone in Yeats' life, just as we like to assume we know the object of the Sonnets of Shakespeare, including his \"Dark Lady.\" Finneran explains: \"This last omission perhaps requires comment, as many readers of Yeats are accustomed to approaching a particular poem 'knowing' that it is about a certain person - be it Maude Gonne, Olivia Shakespear, Margot Ruddock, or whomever. However, firm evidence for many of those identifications is lacking. Moreover it is arguable that Yeats did not wish to narrow the meanings of those poems by presenting them as statements about specific autobiographical situations. A key instance is 'Upon a Dying Lady.' ( . . .) he preferred to present it as a universal statement on death and dying, much as he told Hugh Lane that 'To a Wealthy Man . . .' was addressed to 'an imaginary person' (see note to 114.4)\"I quote this at length to demonstrate the academic rigor of these notes, that they keep to what is provable and not fanciful. We may trust Finneran's judgment and scholarship here in these notes as elsewhere. The notes therefore are not only extensive but based on solid, demonstrable research.Then follows a few pages of Textual Notes which describe the sources used for the poems, in Part B the copy texts used and in Part B Emendations to the copy texts, with the authority for emendations made. Those requiring further information upon these, Finneran's editorial decisions are referred to hisEditing Yeats Poems: A Reconsideration.Following this helpful section lies the Index of Titles and of course the Index of First Lines.I hope this brisk walk through this tome has been of some assistance in your search to purchase. Certainly you might have discovered this through the Search Inside feature of the amazon product page, but perhaps this helps in something. Truly this is a book worthy of every home, each library, each university, every hearthside.Incidentally this is but the first of fourteen volumes collecting every thing known published by Mr. Yeats, with additional materials. The entire series is overseen by Mr. Finneran and George Mills Harper. The second volume contains theThe Plays: Vol.2 (The collected works of W.B. Yeats), edited by David R. Clark. Let these small steps begin your acquisition of the full set, well worth it in our darkening post-literate age, in which we lose the power to express the human heart with this power and precision, and glory.Read this book, and live it, and sing it, and write your own . . .",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            }
        ]
    }
]