[
    {
        "Title": "party summer fear street super chillers no 1",
        "description": "Three girls are terrorized at a summer beach resort.",
        "authors": "['R.L. Stine']",
        "infoLink": "http://books.google.com/books?id=fcgRlAEACAAJ&dq=Party+Summer+(Fear+Street+Super+Chillers,+No.+1)&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "Four teens trek up to a supposedly hauntel hotel to fix it up, find a cave inside it, and are hunted down by a psychotic butler with multiple personalities and a big gun. The first in the SUPER CHILLER division of FEAR STREET is boring to no explaination point, the suspense is all padded and muffled, and the ending is stupid. And to top all of this, it's extremely long.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I do not really remember what the story was about except some parts. I am in the 8th grade and had last read the book in the 5th grade when the other day I started thinking of the book and how good it was. I couldnt remember the title and I have spent hours trying to find this book on the internet. After I looked at some titles that looked familiar I found Party Summer, and knew that was the book. I looked at some of the reviews, and sure enough it was! I was sooo happy and after I am finished writing this review I am going to buy this book! Please read, because after about 4 years I remembered how good the book was, and I know that you will love it too. Dont listen to the bad reviews because if you do, you dont know what youre missing! Read!Read!Read!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Despite what others said about this book, i think it was very good. The reason i think everyone didn't like it was because it wasn't that scary! I mean, it was good but it was more adventerous and thrilling, than scary and chilling! It was pretty good! Not the best Fear Street book ever, but it was definitley good! I recommend this book if you are looking for a good Fear Street book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "In the book Party Summer R. L. Stine starts the book out as an exciting vacation and a job at an old inn for a couple of teenagers looking to get away from home for the summer, but things turn out the worst. In the book there are four teenager characters that have disagreements and one of the teenagers is studying witchcraft. They go to the inn and find out that the inn has been closed for remodelling. Then people start disappearing and people start being chased, in the end it's a matter of life or death, will they come out alive? I recommend this book to younger kids into the horror things. I liked it but it wasn't that scary. I like scary books like Stephen Kings Pet Cemetery; though this was a good book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you haven't read this book....please do! You will not be dissapointed at all! Sure some parts were unlikely....but, come on, thats what made the book so good. If you are planning to read this for the first time: don't trust anyone because you never know what might happen.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "make four million dollars by next thursday",
        "description": "Jason Nozzle, multimillionaire. It has a nice ring to it. But can an ordinary kid really make that much money in one short week?",
        "authors": "['Stephen Manes']",
        "infoLink": "http://books.google.com/books?id=SzKqPwAACAAJ&dq=Make+Four+Million+Dollars+by+Next+Thursday!&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I first read this book in the third grade and still love it!!! I am in the eighth grade now and still enjoy it. It is very funny,and easy to read. One of my favorites!!!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is about a boy named Jason. One day he loses hisallowance and uses his brother's metal detector to try tofind it. It doesn't work, but he does find a book. The bookis called \"Make Four Million Dollar$ By Next Thur$day\".He reads this book and follows all the directions. Thedirections are to do all kinds of crazy things. It is funnybecause they are things you would not expect. Does he makefour million dollars? You will have to read the book to findout.I would like to have four million dollars, but my family ismore important.I recommend you first read Stephen Manes' other book \"Be aPerfect Person in Just Three Days\" because it is containedin the storyline of this book. I only gave this book 3 starsbecause \"Be a Perfect Person...\" was funnier.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Quick! Open up this book and begin reading immediately! Dr. Pinkerton is at it again with this second book on how toaccomplish the impossible. It's funny and easy to read (allow45 minutes). Like the previous book, Be a Perfect Person inJust 3 Days, the author has a talent for making you feel likeyou are there. Each page leaves you wanting to find out whatcomes next. Then suddenly, the book is over. Well, it wasn'tas funny as the last one but if I see another book like this,you bet I'll read it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "top ten of everything 2001",
        "description": "A collection of top ten lists of facts and trivia updated for 2000.",
        "authors": "['Russell Ash']",
        "infoLink": "http://books.google.nl/books?id=V2GFJwAACAAJ&dq=Top+Ten+of+Everything+2001&hl=&source=gbs_api",
        "categories": "['Curiosities and wonders']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book is awesome. It makes a great bathroom reader and fact book. It's fun to read it aloud to other people, too. I really reccomend getting 'Top 10 of Everything 2000'. You will really enjoy it. A great companion to this book is 'Guiness Book of Records 2000(hardcover)'. These two books are great fact books and entertaining too. AWESOME!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I found this book to be almost addictive. I originally saw it in a doctor's office and thought of taking it with me, but didn't. I left his office and imediately bought it. The text is well orginized and to the point, with hundreds of little known facts. An excellent book for the Cliff Claven (from Cheers) in all of us.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is very cool. It's a cool book to just flip to a page and start reading. It's a coffee table book, totally addictive for the whole family. Once I start reading it aloud, everyone gathers 'round and pretty soon we're all in stitches. It has all sorts of facts and it have even helped me with homework. This is just a fun book, not serious reading just cool to have around.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "if this book were in a smaller size, it would make a perfect book full of reading material to brouse while in the bathroom. People will think you have died in there because you will be reading so long. It's both interesting and funny.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "casanova was a book lover and other naked truths provocative curiosities abt writing selling reading books",
        "description": "Everyone knows which books people buy; they can just look at the best-seller lists. But who knows which books people steal? Who, for that matter, knows that authors ruin the book market by writing too much? Or why book critics are not critical? Or why librarians need to throw out more books? Who, indeed, knows the answer to that all-important question in our democracy: should presidents and presidential candidates write books? (The answer is no.) In this irreverent analysis of the book industry, John Maxwell Hamilton -- a longtime journalist and public radio commentator -- answers these questions and many more, proving that the best way to study books is not to take them too seriously. He provides a rich history of the book -- from the days when monks laboriously hand-copied texts to the tidal wave of Titanic tie-ins -- and gives a succinct overview of the state of the industry today, including writing, marketing, promoting, reviewing, ghostwriting, and collecting. Throughout, Hamilton peppers his prose with spicy tidbits of information that will fascinate bibliophiles everywhere. For instance, did you know that Walt Whitman was fired from a government job because his boss found Leaves of Grass, and its author, immoral? Or that the most stolen book in the United States is the Bible, followed by The Joy of Sex? How about that Dan Quayle's 1989 Christmas card read, \"May our nation continue to be a beakon of hope to the world\"? Or that Casanova was an ardent lover of books as well as women? Hamilton offers an inside look at the history and business of book reviewing, explaining why, more often than not, reviewers resemble \"counselors at a self-esteem camp\" and examining the enormous impact of the \"Oprah effect\" on the market. As the self-appointed Emily Post of the book world, he advises publishers, authors, and readers on proper etiquette for everything from book parties (\"Feel free to build a party around a theme in a book, no matter how tacky\") and jacket photos (\"You should not show off your new baby unless [your] book [is] about raising kids\"), to book signings (\"Just because an author has given you an autograph does not mean they want to become your pen pal\") and promotion by friends and relatives (\"They should carry the book at all times on public transportation with the cover showing\"). Both edifying and enjoyable, Casanova Was a Book Lover fills a Grand Canyon--sized void in the literature on literature. It is indispensable for book enthusiasts who want to know the naked truth about reading, writing, and publishing.",
        "authors": "['John Maxwell Hamilton']",
        "infoLink": "https://play.google.com/store/books/details?id=M79HuG-HhzMC&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "8 Stars ********This was the first book I have read in years that I was sorry to reach the end of. Each sentence is there to delight you. Each story is there to enthrall you. Each chapter encompasses a microcosm of the wonderful world of books. If you love books, are interested in authors, wonder about reviewers, or find dedications and acknowledgments intriguing, you've found just the right book!One of the things that makes the book especially delightful is that it does not take the subject too seriously. For example, the dedication (in part) is to all book reviewers so that they will not pan the book (I would have praised the book anyway!). You will also learn which authors wrote in the nude on their porches. There really is a section on the writing career of Casanova.From readers, to the economics of authors, to what happens to all those books that go to the Library of Congress, to which books are stolen most often, it's all here. Each seemingly irreverent thought though builds into a fascinating picture of the role that books play in the lives of authors, readers, reviewers, publishers and book sellers. You will get insights from Gutenberg to Amazon.com.Here are some of the chapter titles to give you a sense of the book's coverage and mood:-- T. Roger Claypool's Fish Store -- Art of Marketing -- Artless Thank You's -- A Guide to Good Book Behavior -- Inglorious Employment -- Literary Luck -- Best Stolen Books -- Dear Mr. Politican, Please Don't Write A Guide to Good Book Behavior tells you what to do and not to do when you friend writes a book. You'll learn the etiquette of writing an autograph if you are an author.The material is so good that this could be turned into a one person Broadway show. That would be wonderful!Have a great time reading this book. It is best taken in laugh-size bites!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Where do I begin the praise for this extraordinary book? I could start with the brilliant prose, that makes every passage sparkle. Or I could comment on the ingenious content, that unleashes its wisdom upon the reader as each page is turned. Perhaps I should begin with the witty satire, that provides comic relief throughout the whole of this magnificent book. No, I don't think there is just one facet of Casanova that makes it the wonderful piece of literature that it is. Rather, it is the sum of its parts that makes me read it over and over and over, until I have been able to memorize and recite entire chapters at a time. Like a fine french wine, say a '75 Rothschild, this book has to be savored. Every page has to be drunk deep into the readers' psyche. I would suggest you buy several copies, just as insurance in case one or two are destroyed. My father really needs the money from the royalties.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Hamilton does what needs to be done to the book industry...this book pulls no punches and exposes all the tie-ins and problems with critical reviews, including the problems with the one I'm writing right now! It really is an eye-opener and has helped me be more critical of the quality of books now being published and to distinguish between the plethora of junk and self-promotional drivel. Good read!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "John Maxwell Hamilton, in Casanova was a book lover, obviously researched his material extensively. Yet a credit to him is the fact that this book is the opposite of dry. Casanova was a Book Lover is wetter than the Amazon(no pun intended) Rain Forest, as he adds dashes of wit to his wisdom regarding his subject matter. There were passages I literally laughed out loud even as my uneducated (respectively speaking) brain soaked up his tidbits of knowledge. This text isnt perfect obviously, and confession time I skimmed a page here and there. Overall though it is arguably the best book on books writtin within the last decade. Perhaps the greatest compliment is his ability and agility in appealing to both the Literrati, and layperson in this book;s text and factiods. A fine touch of irony in that he seems disparaging of the Amazon review process, and I see his point in many ways, yet his work gets glowing reviews(mine isnt first or hopefully last). Well done Mr Hamilton, though you may snort if you happen to come across this review teehee, I stand by my critique.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This work appeals on many different levels. With the author's sparkling wit a constant companion, the reader is taken on a veritable Aeneid through the literary world. Everything from vanity presses to coming-out parties to the hype machines that drive sales to the overloaded Library of Congress make appearances. The breezy style lulls you into enjoying every little tidbit until you look up to realize that the ride is at an end.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "maxwells train",
        "description": "Burnt-out intellectual Harry Maxwell, employed as a cleaner for the Washington Terminal Company, becomes involved in a plot to steal a U.S. Treasury currency shipment from the railroad, a scheme that embroils him with the World People's Army, an international terrorist organization",
        "authors": "['Christopher Hyde']",
        "infoLink": "http://books.google.com/books?id=pBNM-8B2hnsC&dq=Maxwell%27s+Train&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Love this book. I've always enjoyed train movies, and this is my favourite train book. Non stop action! Like the other reviewer said, the main character is no saint, with a less than savoury past, but you are cheering for him at the end, because there is much worse than him around - especially on this train.A recomended read if you run across it second hand.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is my favorite book!!!! If you had to pick 1 book to read, pick this. A book you can't put down. &quot;You feel the same as the train, racing down the track at 79 mph&quot",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The hero is no saint! Yet his motives and methods make him a role model (not that I recommend robbing a train!) I read this book when it first came out and have read it several times since. I have kept it through four moves and expect it will stay on my shelf for some time.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "But this book sucked. I gave it 2 stars out of respect for the author. I started with 2nd Assassin, loved it, then it was Gathering of Saints, love it, then Wisdom of the Bones, and I loved it, but this early work by Hyde just didn't cut the mustard with me. I found it slow, and awkward, and it felt as though it was written by a novice. I didn't finish, barely got half way, which is pretty rare for me. I've got to really dislike a book to not finish. If I had read this book 1st I wouldn't have read any of his work since this one. Glad I didn't start here.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "jessica next stopjr high sweet valley twins diaries 2",
        "description": "Traveling to Costa Rica to help those in need, Elizabeth is disappointed by the group's perpetual partying and fears she is falling in love with, J.P., a boy who originally repelled her.",
        "authors": "['Jamie Suzanne', 'Francine Pascal']",
        "infoLink": "http://books.google.com/books?id=qPzWxQ-Y9WcC&dq=Jessica:+Next+Stop,Jr.+High+(Sweet+Valley+Twins+Diaries&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Three words... THIS WAS AWESOME!!!!!!!! After reading Elizabeth's diary, I was positive this one was going to be just as good. I was right! It may have been better, I can't decide. I was just thinking as I read the book that me and Jessica are totally alike! That is sooo cool! She can be snobby at times, sweet and caring, and fashionable! I loved how Wiley broke up with Lila at the end! Lila deserved it! I can't wait to read the Jr. High books!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Ok this book was totally awesome, here are some reasons why you should read this book. It is great, and Jessica stands up to her snobby Unicorn friends. Also, Lila gets the suprise of her life at the end which she deserved for treating Marissa that way. If you wanna know more you are going to have to read the book because it really rocks.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I absolutly loved this Book. But Like My title states it is a little far fetched. Overall I enjoyed the book so much I could not Put it down! The only thing I really Hated was the ending. I can not Wait to read lizzies book.Ps I'm an old Fan of The sweet vally series!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the nokia revolution the story of an extraordinary company that transformed an industry",
        "description": "This potent study of breakthrough innovation and strategic transformation takes readers behind the scenes of the legendary, yet enigmatic, Nokia Corporation.",
        "authors": "['Dan Steinbock']",
        "infoLink": "http://books.google.com/books?id=o2RnQgAACAAJ&dq=The+Nokia+Revolution+:+The+Story+of+an+Extraordinary+Company+That+Transformed+an+Industry&hl=&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Did you know that Nokia started out in the mid-1800s as a forestry plant in Finland? Yes you heard right: a forestry plant! This is a very well written book about the history of the Nokia Corporation, its ups and downs, successes and tragedies. If you've ever wanted to know what Nokia was like before it became a mobile communications giant, then you should read this book. However, be forewarned that this book is not for the casual reader as it can get very technical in terms of economics.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Nokia Revolution has such a detailed history of this famous cell phone company from its very beginning of a wood pulp factory to the leading mobile and internet company now, that it taught me a lot more about how a business really works than how a successful company looks. Nokia, according to my poor knowledge before, is merely a famous company whose cell phones are said to be the most durable product that won't be broken even if you drop it a thousand times to the ground. This book makes me think much deeper into the struggle the company went through to get this kind of fabulous quality and services to satisfy customers' needs.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Dan Steinbock gives you a riveting look at one of the most important companies of our time in an elegant, storytelling style. His text is rich in detail and seems to capture every conceivable perspective on every possible event in Nokia's 140-year-old history. Writing almost at the level of a fictional narrative, Steinbock adroitly takes you through the company's highs, lows and pivotal moments from its origins in the timber industry in the 1860s and the merger in the 1960s that first gave it an electronics division, to the suicide of its influential CEO in the 1980s. It's all here, along with Nokia's strategies and values. We [...] recommend this book to anyone who relishes well-written corporate adventures or who harbors a certain curiosity about events inside influential companies (or about corporate thought in Finland, for that matter).",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Before reading that book you should to ask your self why you reading it. Did you read it because of fun or as a buisness searching source. If you reading it for fun the book would be kind of boring and dump, but if you read it as a source you would benifit and that will be great for you. The book is a kind of historical book, the author just put facts on his own way. Althought the book have no fun it is generally a good historical book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "justice for all",
        "description": "One of the most acclaimed and best political biographies of its time, Justice for All is a monumental work dedicated to a complicated and principled figure that will become a seminal work of twentieth-century U.S. history. In Justice for All, Jim Newton, an award-winning journalist for the Los Angeles Times, brings readers the first truly comprehensive consideration of Earl Warren, the politician-turned-Chief Justice who refashioned the place of the court in American life through landmark Supreme Court cases whose names have entered the common parlance -- Brown v. Board of Education, Griswold v. Connecticut, Miranda v. Arizona, to name just a few. Drawing on unmatched access to government, academic, and private documents pertaining to Warren's life and career, Newton explores a fascinating angle of U.S. Supreme Court history while illuminating both the public and the private Warren.",
        "authors": "['Jim Newton']",
        "infoLink": "https://play.google.com/store/books/details?id=OkJRtyJ4xR0C&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I am not very good at reviewing books so I will just say what I think. I think this book is great and I bought an extra copy because first editions are worth more later if the writer goes big. I did this same thing with the first Harry Potter book and am very glad I did. I see books as investments and this book is a good investment.Thank you for reading my review.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The story of a young mans manipulation into a world of Chaos and drugs. It could happen the same way to a lot of people. Every element was valid and realistic, no fantasy or science fiction. The character in the lead was very real. He grows and learns and makes a few critical errors.I found the writing very good and the story very realistic. I would saya young reader might have to concentrate to grasp the story but the contents are acceptable for kids..no vivid images of horror or sex, etc.I enjoyed this book.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read about one book a month. I don't know if that makes me a big reader or a lite one.The action moves fast in this book and every second seems to flow to the next moment and that made it a good book for me. I hate red tape or books that have a lot of words that dont really add to the context. This book was good for that reason also. It cut right to the chase and didnt diddle dally around. Another reason I felt the book was worth while was the way I felt like I was inside the thoughts of the main players. Every thing they did, especially the central character made sense. Thats important to me because I hate to read a book and get to a part where I say now why did he do that? It all makes sense, especially in the end.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I enjoy action and crisp, clear writing. I liked the way the main character evolved from the unknowing child like boy in chapter one, to become a socially adapt and capable young man in the final chapter. I wish I could go out and buy a convertable, after reading about the corvette the main character bought I felt like I was riding around with the wind blowing through my hair. My son is a freshman at Duke University in North Carolina and I sent a copy to him. Jason sent me an email telling me he was inspired by the book. As a father, I could ask for nothing finer.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Until recently I didnt get into reading. I spend most of my free time playing basketball. A few months back I tore out my left knee and the doctor told me to stay off it while it healed and soon I was sick of tv. My sister bought this book for me and I figured why not? Not like I was going anywhere for a while.Anyways, I liked it so much I read it twice and found things the second time I missed the first. I reccommend this book to anyone who wants to read a good book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very good book for getting the job done. I hate sad, overly dramatic books. This book moves alone without poking around and the story is happy and inspirational not sad and dramaticly depressing. It is well written and tells the story of a boys college day trials over peer pressure.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "First of all, let me say cheers to the USA for the incredible amount of aid given to disaster relief for the tsunami survivors.This book chronicles the life of Gary Barton, a college senior straped with a new roommate named Rocky Tompson. Gary under goes a triffle of pressures and twists via the mind control and mental subjections of Rocky whom attempts to distort Garys views on everything in his world. Gary mets up with luck and love and snowballs into danger and trouble head long and fast. By the grace of God he is pulled from the brink of distruction in the nick of time. What happens next I will say, but as a Canadian I really enjoyed the write sculpting of an inspiring American author. Several of my friends and I discussed the book with a warm drink and all agree; this book is a real treasure in literature greats. I believe everyone will enjoy this read.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am glad to see a writer in North Carolina break out into the lime light! This is a really good book! I read a lot in the winter, living in the mountains, I don't like to get my car out in the snow so when I see it start to fall I grab up a book I've been meaning to read. I ordered this one because I liked the cover, its not a flashy cover so I figured, might be a good read. I really think its good and fit for reading!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I read all the time, I think its all I ever do! Thats my husbands opinion anyways! I have read good and bad..this book was great! I found it tantilizing and seductively clever. Action and romance, comedy and tragedy all combined. I gave some thought to going to law school and this book would be ideal for a law course teaching persuasive argument. The way Rocky molds his roomie's thoughts was brilliant! Its a master mind of internal thinking! I would have to say it is one of my favorite books.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I like books with strong plots. When I read a book I expect to feel as if I am there and as if it could really happen as it happens in the book (no matter what 'it' is)This book is consistant throughout and completely believeable. I hate reading a book where some guy knows theres a killer loose who once lived in his house, then the power goes out and he hears a noise so he goes to the attic..oh please!This book has all the people in it acting like real people would act so I really enjoyed it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "sometimes form sometimes vessel a collection of poetry",
        "description": "Four separate generations of nameless characters struggle for redemption, love, and peace in a lyrically weaved collection of stories.",
        "authors": "['David Belczyk']",
        "infoLink": "http://books.google.com/books?id=Zxw2LwEACAAJ&dq=Sometimes+Form+Sometimes+Vessel:+A+Collection+Of+Poetry&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The first poem I read from this book - I wasn't sure how I felt. The poem was more than just description, it captured a certain sense within its words. As I read more, things began to fit together, and eventually, I felt like I got it. The poems are more like seeing something than reading it - more like touching something than thinking about it. It is visceral poetry! And I believe it is breaking new walls for modern poets. Five stars!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "An excellent book - I enjoyed this author's sophisticated word choice and philosophical insights. Top notch poetry, which is difficult to find out of contemporary poets. Hopefully there will be some form of follow-up to this great piece of literature!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I got this book on a suggestion from a friend, and I'm glad I did. The forward explains that the whole book is actually the poem and that the individual poems within reference each other to add meaning throughout the book. That was something that I had never seen before, and I though it made the book very interesting to read. I came back to things I had read before, because I saw how their meaning could change based on things I read later. It's a great book if you're like me and you enjoy thinkning about the poems and trying to figure them out.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "fishbone",
        "description": "The imaginary Lucas Fishbone fosters a special relationship between a grandmother and her granddaughter.",
        "authors": "['Gregory Maguire', 'Frank Gargiulo']",
        "infoLink": "http://books.google.com/books?id=BHCpKQAACAAJ&dq=Fishbone&hl=&source=gbs_api",
        "categories": "['Grandmothers']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I had to buy this book for class, true, but wow, it really opened my eyes up to a whole new kind of poetry--one that isn't boring and one that made me want to write and write and write!and that hasn't happened with any other book. EVER! it's just a small collection but i think there will be another one by this poet soon??--watch out: Aimee N. is SURE to take the poetry world by storm with her candor, humor, honesty and utter charm. even if you think you don't 'get' poetry--BUY this book--guaranteed to change your mind!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My roomie had to read this for a class and she left it on the table over break and I never read poetry before so I thought why not but wow this book blew me away. I love how this poet uses neat scientific ideas to color her metaphors even more. You can tell she is a nature fan, in almost every poem, even the ones about relationships, there is a smidge of small but extraordinary moments observed in nature, it helps make her experiences come alive to me even more. Nezhukummatathil can be funny too, and sarastic, and sensuous. A hard feat to accomplish all three!! You can tell she seems real and doesn't take herself too seriously. Seriously, like I said, I NEVER read poetry, but this little book was quick and easy and a delight to read. My only problem was that it was too short? When will she write more???! Highly recommended.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "1000 years 1000 people ranking the men and women who shaped the millennium",
        "description": "Ranks individual in the arts, the sciences, government, religion, business, and other fields according to their positive or negative contributions, contemporary and lasting influences, uniqueness, and fame",
        "authors": "['Agnes Hooper Gottlieb', 'Barbara Bowers']",
        "infoLink": "http://books.google.com/books?id=yEdNPwAACAAJ&dq=1,000+Years,+1,000+People:+Ranking+the+Men+and+Women+Who+Shaped+the+Millennium&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "With the coming of the new millennium, every one is writing a book about the top 100 or 1000 in just about every category. This book is no exception to that rule. What makes this book different is that fact that this book doesn't bore the reader to sleep with endless pages of nothing.There is just enough written about the 1000 people, in this book to make the reader want to find out more. You will pleasantly surprised by the list of people in the book. The authors explain, in detail, how they determined the list rankings.The book is well written and researched by all authors. They break down the listing in groups of 100, which I found to be extremely helpful. I found each short bio, on the person, to be easy top follow.This book makes a great gift for those hard to buy for people. The price is in the range for those on a budget. Overal this book is a good buy for the money.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "The Beatles ahead of Elvis? The loser of the cold war(Gorbachev) ranked 237, and the winner(President Reagan) not ranked? What kind of book is this? Well, I'll tell you what kind of book it is, its the kind you won't be able to put down! This book is absoulutly fascinating! It's truly a learning experince, there are so many people in this book that I'll bet most people never even knew existed, and learning of them is not just educational, but also a lot of fun. While you read it, you will say things like, 'what were these people thinking when they put William Blake(mystic poet, ranked #315) ahead of Barthelemy Thimonnier(inventor of the sewing machine, #316)?' This is part of the beauty of the book, the fact that there is no posssible way you could ever agree with all 1000 entries. This book will get you to think. Buy this book, read it. You won't completly agree with all the picks, but you'll trully enjoy reading it.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "getting my 14-year-old daughter to appreciate world history has proved darn near impossible. at least that was the case before we picked up &quot;1,000 years, 1,000 people.&quot; over several evenings, we have played a game: one of us picks a number between 1 and 1,000 and the other reads aloud the name of the historical figure ranked in the book. the person selecting the number then attempts to explain the importance of the individual within one minute. quite often, frankly, it's a shot in the dark, but the exercise has evolved into a game that we call &quot;millennium minute.&quot; and somewhere along the way it has helped to engender in her a budding interest in history. though it is easy to quibble with the listed ranking and, inevitably, some readers will protest on the exclusion of some notable, to me this is one of the book's fundamental strengths. indeed, the authors have devised a clever way for us to debate the last 1,000 years and celebrate in an intellectually engaging way the new millennium. unfortunately, however, the publisher and the book distributors are not making easy for us. this book can be difficult to find! if you are lucky enough to locate a copy, share it with your family and friends. and if you have a teenager whose idea of history is what he did yesterday, challenge him to a &quot;millennium minute.&quot;",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book was pretty interesting. It kept my interest so I would'nt put it down. It told the truth about Castro as a brutal despot and the Communist founders as a group of blood thirsty vultures who belong on the trash heep of history. It gave Truman a good review as a man who had to make tough choices and did so wisely.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Most books I read I put down, earmark, and come back to. Not this one.The humor in most of these short bios humanize them and the sheer number of people in the book make it the kind you want to re-read.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "1,000 Years, 1,000 People is intelligent, challenging and great fun. This book is a must for everyone interested in the millenium, testing their knowledge of history, or in just having fun.This is an intelligent, informed and well-researched look at the movers and shapers of the second millenium.The scope of knowledge and research is impressive. Despite an inevitable western bias, the authors clearly made significant efforts to provide a world view and to cover all fields of human endeavor. The authors share their perspectives, explain their procedures, and invite us to apply their BioGraph system for ourselves. We may each arrive at different sums, but understanding the process allows us to debate with the book -- and with each other.And therein lies one of the challenges. A simple listing can be ignored. But 1,000 Years, 1,000 People invites us to participate in the process, and challenges our knowledge and judgement.Why didnt Eli whitney (#135) or Max Plank (#136) make the top 100? Or Ralph Waldo Emerson (504) or Charles Lindberg (516) not make it into the top 500? Apply the system, and come up with your own solutions.Also test your historical knowledge. Who was Vincent of Bauvais (#447)? Or John Gorrie (#450)? Or Ramanuja (#187)?But, mostly, 1,000 Years, 1,000 People is great fun. The authors obviously had fun writing, researching and arguing about the selections. They share this enjoyment in their writing: did John Montagu -- the Earl of Sanwich -- (#473) hold the mayo? And were Wilbur and Orville (#23) really the Wright Stuff?The real fun comes from endless hours of arguement over selections: Why is Karl Marx 50 places higher than Thomas Jefferson (#14 - 64)? And why is Ram Singh (#310) a more important libertarian than Thomas Paine (#311)?If you only buy one millenium book, it should be 1,000 Years, 1,000 People. In fact, if you buy only one book for the rest of this millenium, consider 1,000 Years, 1,000 People. It will provide hours upon hours of fun and intelligent conversation. And, as USA Today said, launch 1,000 aurguments.Buy it. Give it as a gift. Plan parties around it. Test yourself. Challenge others. 1,000 Years, 1,000 People is a whole lot of fun, as well as a thoughtful and thought-provoking look at our millenium.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is perfect for even lazy people like me. It ranks the people based on a point system and it gives one phrase summaries and 2 paragraph summaries. you can learn a helluva lot in 5 minutes. excellent for people of all ages. Also, the authors have an EXCELLENT SENSE OF HUMOR. You should definitely buy this book!!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "1,000 Years, 1,000 People provokes something more than arguments as to who should be listed among the thousand most significant people to have lived in the last millenium. Other readers of this book whom I know argue about who should have made the list, and in what order. Likewise press accounts on the book take up the debate. Everybody seems to have an opinion. Sharing and comparing these opinions reveals a lot about how we weigh achievement in our civilization. Few subjects can more important, as we try to make sense of the present. So the book deserves great credit for stirring people to think about an academic discipline that most left behind in school. The biographies themselves are a great refresher course, and to be honest, I had not heard of some of these people. But indeed they do seem important. We have enjoyed this book as a starting point for discussions with our five children and recommend it heartily to other families.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Luckily the authors of this book don't take themselves too seriously, pointing out in their introduction that if they had \"dined on fish and chips instead of hot dogs and sauerkraut the day we considered [the rankings,] the results might have been much different.\" They admit that there is no accurate way to rank the most important and influential people of the last thousand years. I have to agree with the reviewer who pointed out the apparent biases of the authors... they did make the effort to get \"nominations\" from friends and experts, but I doubt they had the time or funds to travel the globe to do so... thus the scope of the 1,000 people is limited, to be sure.Ok, so here's my main gripe... nowhere in the book is mentioned one of the world's most brilliant minds, Nikola Tesla. I mean, the man only invented alternating electric current (AC) which today brings power all over the world! He also invented modern radio, X-rays, and the vacuum tube amplifier just to name a few. He's not even mentioned as an aside... well, thank goodness Coco Chanel made it!An enjoyable read, if you want a rather lighthearted and brief look at some of the people who shaped the last 1,000 years.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Whether you love or hate history, you'll enjoy this fabulous, readable book. As a college history major, I highly recommend 1,000 Years, 1,000 People to history buffs and non-buffs alike. It's easy to pick up and put down or devour in one sitting (like I did). Kudos to the authors! They have put together a great book.P.S. It also makes a great gift.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "rommel drives on deep into egypt",
        "description": "\"Rommel Drives on Deep into Egypt is Richard Brautigan's eighth poetry publication and includes 58 poems. The title of the book echoes a 1942 San Francisco Chronicle headline describing a successful operation by Rommel during the North African Campaign of World War II.\" -- Wikipedia viewed April 27, 2021.",
        "authors": "['Richard Brautigan']",
        "infoLink": "http://books.google.com/books?id=9k1aAAAAMAAJ&dq=Rommel+Drives+on+Deep+into+Egypt&hl=&source=gbs_api",
        "categories": "[\"Children's literature\"]",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I first discovered this book on my parent's bookshelf when i was six or seven years old. Bored with sesame street picture books, i read it. I felt rather violated by it at first because many of the poems were impossible for me to comprehend and seemed rather nonsensical to me at the time. Yet I was intrigued. This untraditional book challenged me in a way no robert frost or ogden nash book ever did. Convinced that there was some deeper meaning that I wasn't picking up on, I read the book many times over . The more I read these poems the more i understood them and they began to take on definite shape and character. They began to make A LOT of sense. This book may be a difficult read for a seven year old, but i grew to love it then and i havent stopped loving it since. Now ten years later, at seventeen, let me tell you this is a phenomonal book. I've read a lot of books over the past decade but none of them compare to this one. These poems are so beautiful, so unique, so powerful that they will haunt you for an entire lifetime...Richard brautigan was a genius.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I love Brautigan. This poetry collection is the best I've read of his. There's something about his poetry that distills everything down to a simple unique thought and gives it the attention it deserves. While his prose is beautiful (and poetic) as well, I like his poetry better for it's amazing simplicity and depth. If you've never read a Brautigan, start here, then go to TROUT FISHING IN AMERICA.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Richard Brautigan was crafty. I read once that he wanted to write the perfect poem and that poem would be about the shortest period of time one could imagine. That poem would be one word. Nobody has ever heard the word yet. It hasn't been created. Everyone knows what it means. We've always known. If you are buying your first Brautigan book I highly reccomend starting here and finishing when you own everything he's written.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Do you think of me as often as I think of you?R. BrautiganThe photo on the cover would be worth the price of the book even if the poems were awful, and they're not. In fact, they're great. Light, withought being trivial, this one's a quick read that stays on. Brautigan's uniqe humor is pervasive and nothing is quite as simple as it might seem at first glance. Warning: Don't think about them too much. These are not grab on and chew kinds of poem-lettes. They're funny ineffable little beasts. I especially like Donner Party and Clad in Garments Like a Silver Disease. A great book just to have knocking about the house. Rock on Brautigan!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "winter of fire",
        "description": "A world destroyed by fire is saved from ice by a charismatic young woman who has powers beyond those of any living human being.",
        "authors": "['Sherryl Jordan']",
        "infoLink": "http://books.google.nl/books?id=2o_zGwAACAAJ&dq=Winter+of+Fire&hl=&source=gbs_api",
        "categories": "['Fantastic fiction.']",
        "ratingsCount": 12.0,
        "review": [
            {
                "review/text": "I read this book as a 8th grader in middle school. I only read it because it was the thickest book in the library, which ment it worth a lot of points. From the moment I opened this book I was in the story, and I could feel everything that was going on, I was really there. I can still see myself there and feel the story, I remember the entire storie and it was 6 years ago that I first picked it up. I would have to encourge that this storie be read by all children and adults, as it takes you to this place of adventure and sadness. I believe that all parents should read this storie to their children. It will bring you and your child closer together.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Even though this book is loved beyond words i will try to describe it for you. It's about a teenage girl and her struggle against prejudice. It left me a changed person, inspired to live my life differently. I was also inspired to write this review by the worst review of this book I have read. That review was from Kirkus reviews. They stated that the main character sounded like a &quot;walking essay&quot;, and that the relationshipes throughout the book were &quot;confused rather than complex.&quot; This review is a far cry from the actual book and the reviewer has failed to find the message in the book. The book taught me about the struggles people will endure when fighting for something they believe in. Being a young black woman (now years after my first reading of the book) I applied this to my life and strugglers I have had to endure. This is a great book for young women to enjoy. I strongly recommend reading this book, and hope it will become one of your favorits too.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I am not a reader of many books. I cannot seem to find a book that can keep my interest for very long and i almost never finish a book. There are 3 books that have caught my attention and heart. Winter of Fire is one of them.I have read this book over a dozen times and find myself wanting to start reading it all over again when i am finished. It is hard to express how i feel about this book in alot of words. All i can say that it is outstanding! The determination of the character and the beauty,love and chaos of the book so well written i can literally see it unfolding in my minds eye.That is when a book is truely a great when you feel you are there living it with the character. It is certainly a must read. I had this book for a long time and since lost it. I have found it here in this amazon web site and will surely own it again with the great price here!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is the best. I love to read it over and over again. I read it at least 3 times a year. As soon as I finish it I start it again. The only problem I have is that I can not find a hard cover of it anywhere, everything says it is out of print. I recommend this book to everyone. It will leave you touched. It makes you realize how prejudice and closed minded people can be. I promise you that you will be satisfied.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "So, you've already read over and over again what this book is about--I won't bore you with a summary, let me instead tell you that I first read this book in 9th grade and the story was soo rich and imaginative that I am now 24, still own the book and still read it from time to time. You will not be disappointed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I'm a twenty year-old college student and an avid fantasy reader. I first read this book when I was ten and its still one of my favorites. Elsha is one of the strongest and admirable heroines of all time, and Sherryl Jordan is one of the reasons I want to become an author myself.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "A slave woman sentenced to death (for slacking off) is rescued by the most powerful man in the world. Installed as his handmaiden (a highly covetted position normally reserved for the females of the most prestigious families), Elsa is granted the unique oppurtunity to see the world outside of mine where she was born. However she never forgets where she has come from or what she left behind.Raw determination overcoming adversity is a common theme in books of all genres. What makes this book unique is that Sherryl Jordan was overcoming adversity of her own when she wrote Winter of Fire. Jordan's own determination gives her writing an edge that enhances the story quite a bit. Furthermore the plot is tightly woven and progresses in a way that is very believable.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read this book for the first time in eighth grade and loved it. I was haunted by the characters, by the story, and by the world Jordan created. I read it for probably the fiftieth time again this year (I'm in college now) and was just as drawn in and enchanted. It's not a hard book to read, but it has some amazingly complicated ideas about morality, prejudice, and tradition. Read it, love it, tell everyone you know!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have read the book Winter of Fire many, many times and have never ever got tired of reading, ever! The majority of the people that have rated this book (which is like everyone) put it as a 5 star book which makes me think that it should still be being printed! It is my favorite book in the whole wide world and not having it in the local stores is slowing killing me! Please start printing it again!I'm begging you, please!From a loving reader.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a very good book. From the moment I picked it up, I was drawn into the plot, and empathised with Elsa, the main character, easily. It tells the story of her rebellion against her society's ways and discrimination, and is a wonderful book which leaves the reader with a sense of resolve. I recommend this book for anyone for even though it is thick, it is exciting and you just keep on turning the pages, something is always happening and it is NEVER boring. Read it!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "wonder",
        "description": "\"Now a major motion picture! Includes full-color movie photos and exclusive content!\"--Dust jacket.",
        "authors": "['R. J. Palacio']",
        "infoLink": "http://books.google.com/books?id=p5ozDwAAQBAJ&dq=Wonder&hl=&source=gbs_api",
        "categories": "['Abnormalities, Human']",
        "ratingsCount": 3416.0,
        "review": [
            {
                "review/text": "When I got this book for my birthday, I wasn't so sure about it. When I read it I loved it. When I don't know what to do, I get this book out and read it! I've read it so much, it looks like it's been around for centuries, not just one or two years!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I cannot believe how good this book is. I own it, and I can tell you that I have read it over and over and over, even lost count now. If you haven't read this book. . . I STRONGLY STRONGLY suggest reading it. Because it will just capture you and not let you go till you finish. You may think I am weird for going nuts over a book, but I am not. Its really good. I hope you take the time and read it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Jessica and Shelia have been best friends since kindergarden, but everything changes on the first day of seventh grade.I would recommend this book to a girl in the fifth, sixth, or seventh grade. I would also recommend Wonder to a girl who likes to read books about two best friends. Since Shelia is now popular and Jessica is a social outcast, Jessica doesn't think she will ever have friends again. One day jessica becomes popular and shelia becomes the social outcast. The last reason i would recommend this book is because it teaches you a lesson. The lesson is always remmber who your true friends are.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was an extrordianry book...i fell in love with it..it gave me hopes and dreams about my crush..and how one day, he would soon fall in love with me...it showed me how cliques can hurt, and how much i used to love hanging out with my old friends, before i found my new ones...i just loved this book...",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book, I felt was very good. It was about a girl my age and what she goes through. I thought the author was very good in writing from a seventh-grader's point of veiw. Unfortunately I haven't seen any other books that she has written. I highly recommend this book to anyone who is around this age group.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is one of those rare books that every teenager can relate to. This has been my favorite book for about a year now and I'm still reading it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "then suddenly pitt poetry series",
        "description": "Finalist for ForeWord Magazine's 1999 Poetry Book of the Year A reader and a writer don their respective roles and embark on the journey of a book. This is their story--ultimately a love story--darkly funny, mournful, testy. It is about a reader who at times presides over the page like a god, and at others follows the leash of the author's voice through the dark streets of the book like a dog, and it is about a writer of determined slipperiness. As we read, we think that each of us is The Reader, the one who knows the Real Story. But the more we think we understand, the more the story moves away from us-all is not what it seems. This eagerly awaited third volume by the poet whose work The New York Times described as \"at once charmed and frightening\" is a book of high-spirited subversiveness, a work of argument, seduction, and a relentless devotion to language. Then, Suddenly- bristles with the sound of the author's voice--insistent, vital, hilarious, and iconoclastic--tearing away at the confinement of the page and at the distance between the page and the reader. Emanuel's images are dazzling. She creates a performance that is fearsome and funny in its portrayal of the argument between the work of the text and the world of the body. The Gettsyburg Review has called her a writer of \"exquisite craftsmanship\" who can \"strike from language . . . images chiseled clean as bas-relief.\" Then, Suddenly- is a book of spectacle and verve, part elegy, part vaudeville.",
        "authors": "['Lynn Emanuel']",
        "infoLink": "http://books.google.com/books?id=Ob44zwEACAAJ&dq=Then,+Suddenly+(Pitt+Poetry+Series)&hl=&source=gbs_api",
        "categories": "['Poetry']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I saw some wonderful cagy things going on in Emanuel's first two books. But now comes THEN, SUDDENLY, which deconstructs itself word by word as it goes along, and in a very transparent manner. (The everyperson's answer to Jorie Graham will have to wait.) THEN, TO TOP IT ALL OFF the poems are flat. The life seems to have been revised right out of them. &quot;When the reader's radar tracked me down&quot; Emanuel writes. What happened? The answer is, You thought about it too much and the result is stiff, self-conscious poetry.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "An amazing book of poems, or a book of amazing poems, or both. The bongo-madness rhythms of the voice linger in your head after you put the book down. Serious without being solemn, playful without being silly. I read this book first time through in a single sitting, and when I was done I knew that I had started somewhere and ended up somewhere else, though the precise names for either place eluded me. A very interesting, very smart, very pleasurable book.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "&quot;~Glad to see someone else (and Kevin Canty, no less) thinks this book is good. I read the first stanza and immediately knew it was for keeps. It's a book of poems about a book of poems, about an author of a book of poems, about the aboutness of an author making a book of poems.&quot;~ happen up front, center stage.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "n sync with justin",
        "description": "Offers a profile of one member of the popular five-man group 'N Sync.",
        "authors": "['Matt Netter']",
        "infoLink": "http://books.google.com/books?id=f4zBp9pPouYC&dq=%27N+Sync+With+Justin&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I thought this book was good but it wasn't one of those books you have to read over and over again. I had read all the stuff in Teen But I loved the pictures that were in it. They made him look even hotter then he already dose.I would keep the book if someone gave it to me but I don't think I would buy it if I didn't already have if. If I hadn't read all those Teens it would be a really good book.I love 'N SYNC 4-life.",
                "review/helpfulness": "28/33",
                "num_reviews": 33
            },
            {
                "review/text": "Okay, I bought this book and I honesty thought it was pretty good. The only problem is that the author takes everything from Teen magazines so if you really like N sync and you read those magazines all the time you'll hear a lot of the same stuff! But I mean I read those things all the time and I still found the book interesting plus it talks about what Justin sees in a girl which I didn't really know that much about!! It's a cool book so I would definately get it if you really want it!!! Just don't get your hopes up too high!!!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "If you like Justin it's a must have. But there were a few errors in it. Like it said at one part that Justin's mom was Lisa. So, I don't know. But it wasn't a book you had to keep reading cause you couldn't put it down. I didn't even finish reading it, cause it was all stuff I have already learned from magazines and off the television. If you're a serious die hard Justin fan and you have nothing better to spend your money on, then go ahead and buy it. Not highly recommended though!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a great purse sized book for all the Justin hungry fans. Keep up the good work, NSYNC.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Yeah he's cute but he's gettin kinda repetitive. Let's move on people! JUST MOVE ON!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "THIS BOOK WAS GREAT IT GIVES YOU ALOT OF INFO ON JUSTIN BUT IF YOU ARE A DIE HARD FAN I THINK YOU WOULD LOVE THIS BOOK.BUT DON'T GET YOUR HOPES UP BECAUSE MOST OF THE INFO YOU ALREADY KNOW ABOUT HIM. BUT I THINK EVERYONE SHOULD AT LEAST READ THE BOOK.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "just do it the nike spirit in the corporate world",
        "description": "Presents a look at the Nike Corporation, its goals, business operations, image, influence, and global implications",
        "authors": "['Donald R. Katz', 'Katz']",
        "infoLink": "http://books.google.com/books?id=3VwfAQAAIAAJ&dq=Just+Do+It:+The+Nike+Spirit+in+the+Corporate+World&hl=&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I don't know what Katz' fascination is with Nike. He's not from Portland, not a personal friend of Phil Knight(though you'd wonder after reading this)but really looks at Nike as it is the gold standard of all companies. I read the book before I started working at Nike and I found two completely different worlds. I'm sure at the time the book was written(94) there had only been one layoff(in 15 year history), and employees did follow the company with blind allegiance, but times have changed. With the un-ignorable exploitation of Asian labor and several company layoffs in the past few years to appease wall street, employees are more objective. They can see the inherent flaws of the company...the same as every other large, arrogant, and bureaucratic organization. I now work for another company in the industry, and I can tell almost no differences. Despite what Katz says, employees don't work until 9 every night and think of coming to work as &quot;going to the homecoming Big Ten football game&quot;. This book reads like the employee propaganda they used to distribute to us in quarterly meetings. Maybe Katz is a stockholder..who knows?",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Read this book! Unfortunately named 'Just do It' (and sounding like a company shill piece in the process), this is actually a fascinating look at Nike and its founder, Phil Knight. Whenever the subject is Knight, you cannot put the book down. He is a truly remarkable individual.Katz covers all dimensions of the Nike juggernaut: the Knight engima; Nike's rebirth after the rise of the inferior (in Knight's estimation) Reebok aerobic sneaker in the mid-eighties; its association with Michael Jordan; the jocky world of the Ekins; the designs of Tinker Hatfield and other shoe creators; its relationships with Weiden Kennedy (developers of its ad campaigns); and its offshore manufacturing difficulties.To me, the visits into Knight's inner sanctums are worth the price of the book, and make it a truly fascinating read. You get to see the man behind the wrap-around shades, and he turns out to be a fascinating, complex character.. you come away from the book with an understanding of Knight's athletic background, his hatred of Olympic-style 'officialdom,' and his will to win. As much as Bill Gates defines Microsoft's corporate character, Knight does for Nike.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Well, what can I say except that I expected to be given more insights into managerial techniques that have driven NIKE to the top and not a eulogy of Phil Knight. I'm sure Knight is a great guy but there is more to Nike than Knight. The author has given a lop sided view of Nike and looks at the entire industry with a distinct bias. Reebok and Adidas are treated as if they are some alien force out to destroy the world. I will not recommend this book to anyone. One thing for sure is that I will think a million times before venturing to buy a book written by Katz again.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Just Do It digs under the skin of the Nike corporation and gives a behind-the-scenes look at the company that has grown to be the number one shoe marketer in the U.S. The author details every aspect from Nike's involvement in the Dream Team awards ceremony fiasco in the 1992 Olympic Games in Barcelona to the sweat shops of Asia where the shoes are actually produced. The author taps into the psyche behind what Nike is about and what makes a typical Nike employee: love of sports combined with a rebellious, headstrong nature to think outside the box. For example, one prospective employee with a PhD and a law degree was dismissed by the selection committee for not knowing who Deion Sanders was. The book opens with the 1993 retirement of Michael Jordan and ends with some &quot;small&quot; layoffs by Nike in September of the same year and the effects that the layoffs have on chairman, Phil Knight. The prose is well-chosen and the reader is shown the business side of superstars such as Charles Barkley and Michael Jordan that you won't find in Sports Illustrated. There are two minor weaknesses to Just Do It. There is definitely an inevitable pro-Phil Knight slant to everthing written. Also, an extraordinary amount of pages are devoted strictly to the quagmire that is the Asian economy. The author may find this topic interesting, but the average reader won't and it strayed from the central theme of Nike's corporate culture.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is probably the fairest look at Nike you will find. Far from being a mere tribute to the company, &quot;Just Do It&quot; looks at Nike's triumphs and failures. Excellent insight into the business strategy and the creation and maintenance of &quot;the Nike image&quot;. It's nice to read something unbiased after all the Nike-bashing that has gone on in the media. This book makes a great companion to &quot;Swoosh&quot; which is the actual history of the company. I read them back to back (Swoosh first) and it was great.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Just Do It, does a wonderful job of describing and promoting the corporate culture at Nike--in fact it did such a good job I can think of nowhere I would rather work. That aspect of the book bothers me though, because it sometimes becomes such a glowing portrait of the company that the story can not be taken at face value... That being said, I think Katz's unprecedented access to Phil Knight and many of Nike's other top executives and athletes allows him to tell the story of Nike's growth and continuous battle for market share from a unique perspective. I have also read Swoosh, cowritten by the wife of a former Nike executive, and it tells a similar tale, but is so biased against Nike that it's analysis is even less believable then Katz'z. I think this is an interesting portrait of a great American company and has an insider perpective you will not find else where, but I only give it three stars because it is a bit of a PR job and is surely not as even handed as I would like.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Just Do It by Donald Katz wasnt the one of the best books I have read, it didnt even make my top ten list. This book is full of uninteresting, and tedious specifics which did not make me want to read the book any more than I had to. On the back of the book U.S News &amp; World Report says &quot;Engrossing....a corporation fueled by the MTV corporation. Engrossing?..it really wasnt. It was grossingly boring by the time i started read the 30th page. The back of the book also says it was a riveting biography. The things are said by popular sources like People Magazine. This book was so boring to the point where I am starting to beleive that the author payed these people to say the things that they said. : &quot;never judge a book by its cover&quot;,I learned my lesson. This book cover looked so nice, attractive, it made me want to pick it up right away. Id have to say the best part of the book was the cover. The frist few pages were okay only because it talked about Michael Jordan, then the book just hit rock bottom. I was reading the book with the same emotion when i have to choke down bitter medicine. If u have insomnia, read this book. I promise it will be ur cure.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "666 the beast revealed",
        "description": "This exposition is set apart from others because Christopher (last name not revealed for his personal protection), the author, claims to have received the metaphoric interpretation of Revelation's long-held secrets from the mouth of the man who wrote it?John the Beloved himself'one of the original 12 apostles claimed to have ?tarried? as mentioned in NT John 21:20-24.The whole truth in all its splendor, glory and dread, is revealed, explained, and expounded upon in this historic book. Every chapter and every verse of the book of Revelation is covered. Every other book ever written on the topic, which claimed to reveal or explain the mystery of Revelation, will be put to open shame as the simple, yet remarkable truths are revealed within the pages of this miraculous book.",
        "authors": NaN,
        "infoLink": "http://books.google.com/books?id=Xd7QbQeYey0C&dq=666,+The+Beast+Revealed&hl=&source=gbs_api",
        "categories": "['Beast of the Apocalypse']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I read this book and really enjoyed the author's slant on the catholic religion; however I was skeptical about some of the prophesies and connections between various biblical references. I then researched each and every prophesy as well as asked two local ministers to help me in my studies. The result was that this book was 100% accurate on everything it outlined. My whole church is now reading it and we have agreed that the author Mr Adams is the true authority on biblical prophesy. We highly recommend this book to all readers and all people of the earth.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "My husband was raised Catholic - he even went to a Catholic school. A friend of ours gave us this book as a gift. At first, I thought the book was going to be just a bunch of crazy religious ideas, coming from religious fanatic with psychological problems. But, it wasn't! I read the book twice and then read it to my husband. It opened our eyes, and caused us to seriously change our whole idea about &quot;THE CHURCH&quot;. My entire reality has been altered because of this book, and I highly recommend it. It is honest and powerful. Don't be afraid to question what you have been taught!",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is not an intelligent work of research. I wouldn't recommend it to anybody because it is inaccurate, unbiblical, and sometimes just plain stupid. These other reviews are obviously rigged, or else they describe a completely different book from the one that I read. This book was a waste of my time. It was a juvenile attempt at a subject best left to more intelligent, talented and well spoken authors. Sorry, but this one doesn't even qualify for my &quot;two thumbs down&quot; rating.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a very poorly done book from a prophecy perspective..it is fairly well written..just totally off base as far as prophecy is concerned. He does a good job exposing some of the occultic practices in the Catholic Church but you can learn about that for free at many sites on the net...the rest of it is a waste of time.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "This particular book is very well written and easily read. This is a powerful book. I read it in three hours. I simply couldnt put it down (not even to use the bathroom). If you read this book then you are going to need a highlighter so you can mark certain spots and research this info for yourself. While I do not doubt that this author is correct in his writings, I will study it for myself. I urge that every reader do the same. Especially before you write a review.If you are a Christian (especially a catholic) this book will shock you. I highly recommend this book to anyone who would like to expand their understanding of the book of Revelations.BUY THIS BOOK, READ IT, GIVE IT TO YOUR PASTOR TO READ, AND BUY COPIES FOR YOUR FAMILY. BUT MOST OF ALL, DO THE RESEARCH FOR YOURSELF.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "It is amazing what some donald-lowlifes will do to sabotage writers of Christian truth. I just read a review of this book by such a donald-lowlife, and he said that the book was fluff and poorly researched. Balogne! I read this book, and it offered such a slam on Catholic false doctrine that I converted out of the Catholic religion and into a religion of bible truth. When a writer can change your whole spiritual life, like Canyon Adams did mine, I say his writing is a whole lot more than just fluff. This book is a classic.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is mostly fluff. I didn't find much useful information in it. I like to try new authors once in a while, but I guess sometimes it pays to stick with those writers you know and respect.I didn't feel that there was a great deal of research or professionalism in &quot;666&quot;, and I found it very hard to stick with my rule of always finishing a book once I start reading. Maybe someone else will find this book informative. I didn't.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I can barely describe how powerful and life changing this book is. If your view of end times prophecy runs along the lines of the &quot;Left Behind&quot; series, you've got another thing coming. You will never pick up another one of the books from that series again. It is hard to describe how powerful this books is. It is not even 200 pages; yet I found myself taking longer to read it then I anticipated as I literally had to stop reading the book after every paragraph or so and just think about what I just read. IT IS THAT POWERFUL!!! This book has changed my entire outlook on the end times prophecy and believe if you really and truly want to know more about this subject, you owe it to yourself to read this book. I feel Canyon Adams is right on the money. I think that Mr. Adams knows more about this subject than anyone out there at this time. It is up to you. You can either believe what the &quot;churches&quot; and man interpret about prophecy OR you can read this book and see how the bible backs up itself and explains everything so clearly now. I feel as if a veil has been removed from my eyes and I really can see the truth now. No other book out there backs up it's claim with so much BIBLICAL evidence. The only thing we need to know to interpret end times prophesy is the Bible. Period. I am currently reading the authors other book, The Signs and will be reviewing that one very soon as well, but so far it is just as unbelievable as this one. If you are going to a &quot;christian&quot; or catholic church right now, please read this book. It is a simple choice really. Go to the church of your choice, or go to God's church. It's up to you. All the other books out there on prophesy right now are full of manmade interpretations, not biblical. Read these books and see for yourself.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I bought and read 666 The Beast at the same time the Pope was visiting the holy land. Ding! Ding! The bells were going off all over in my head. Everything that Mr. Adams was saying was true. It was eerie, almost as if he predicted it, but I guess that is the point. The bible predicted it all along, and now all we have to do is read and watch. The book is amazing and I recommend it to everybody.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I read this book in one day, I just couldn't put it down! Canyon Adams, by far, has the freshest and most unique approach to the tribulation and &quot;end days&quot; events. This book was truly an eye opener, and unlike many other books on prophesy. The author was also very biblical in supporting his statements, approaches, and theories. Definitely a &quot;must read&quot; book. People of the Catholic faith may not be too pleased with it's contents, but, it sure leaves you with many things to think about.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "book savvy",
        "description": "Recounts the adventures of Mibs Beaumont, whose thirteenth birthday has revealed her \"savvy\"--a magical power unique to each member of her family--just as her father is injured in a terrible accident.",
        "authors": "['Ingrid Law']",
        "infoLink": "http://books.google.com/books?id=SUGLDQAAQBAJ&dq=Book+Savvy&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 130.0,
        "review": [
            {
                "review/text": "Book Savvy is an excellent guide for those with reading addictions but not a lot of time to scour the shelves for just that right book. Katona has done it for us so that we can spend our time reading the books, not finding them.I am already a lover of books and reading, but it was interesting to read Katona's thoughts on the importance of reading. She makes some excellent points about how reading can transport and transform the reader.The heart of this book though is the roadmap it provides for a journey through time,lands,people,and perspectives via books. The author has developed a series of icons that among other things, tell us if a book helps us understand ourselves, understand others, takes us to new geographic places, or is primarily for fun. She also rates the reading level of the book as well as provides a synopsis of it. Armed with this information, I can then decide what book to pick up for my next transpacific flight, where I want to be engrossed for 15 hours but don't necessarily want to ponder deep thoughts. I can then also pick out a book for that rainy day by the fire or the one that takes me to a genre that I haven't spent much time with.Book Savvy can be used by the teacher that needs a guide to pick out literature for class, or the book club that needs a very useful resource for future choices, or by the reader that wants to focus on reading and needs to narrow down the choices instead of being lost in the aisles of the bookstore.In addition, this book will provide value over the long run. The books Katona reviews run from current to classics and so the guide will be helpful to me for a very long time. And I might even have the courage to start a book journal, based on the blueprint the author gives at the end of the book.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "To confess it up front, I am a lapsed reader of books. Oh, my grounding isn't bad, if Great Works didn't especially enter in, but I'm as much a perpetrator/victim of the closed cycle of the pressures and urgencies of current life as the next person. Let's face it. Time is precious, things compete--yet it may be the rare person who doesn't believe they can rise above. ...Even if the current situation is one they themselves are responsible for. I am not an educator, not technically a student, but I know that I have not run out of things to learn.So with some Mighty Sam McClain spinning soft and deep on the CD player, I started reading my copy of Book Savvy. Some truth: at the end of the first chapter, Ms. Katona's short autobiography, my eyes were a bit past misting. And I kept turning pages. During the second chapter, \"Introduction to the State of Reading in America\", it was difficult not to see bits and pieces of myself scattered throughout. If I can count as an example, reading in this country has sloughed off. The reasons found in the chapter are more than accurate. Following that chapter, things increasingly build towards the weightiest portion of the book, the \"Annotated Book List.\" Although the back jacket of the book puts the book in the categories of \"Literature\" and \"Education\", certainly fitting, it might be worth considering these categories outside of some rather narrow definition. After all, even if a person is not a student, learning something you don't already know is a good thing. In my case, recovering something that has long been set aside isn't so bad either. So we come to the \"Annotated Book List\"...The \"Annotated Book List\", contains such things as title, author, genre, synopsis, quotations, things to look out for and think about while reading, other things written by the same author and, maybe as a bonus, information about any movie versions. There are eighty-eight works in the \"Annotated Book List\" (I counted)...covering a great span of interests. I came across books that I now know I will have to pick up.After the list are chapters covering how to become an \"active\" reader and how to develop a reading journal. Finally, there are two appendices devoted to \"Book Lists and Awards\" and quotations about books and reading.Now I have to say that the chapter on becoming an active reader gives me a slight amount of pause. After a brief introduction, the chapter reprints \"How to Mark a Book\", by Mortimer J. Adler. To be honest, marking a book worries me. The chapter, through the writing of Mr. Adler, makes some very good points about marking a book and why there is value in doing that. What is said makes sense. But I have never once marked a book, dog-eared a page...nothing. Maybe because the bulk of my early reading was with library books, I don't know, but after I've read a book it looks pretty much the same as it did sitting in the book store--and I kind of like that. Now, I do think getting much more out of books than I have gleaned is not a bad idea., but I might have to try things out on a few practice books.I don't have any such qualms about keeping a reading journal, though I've never done that either. When I've read a book, I've just read it. Anything that sticks becomes part of my psyche, but I've very aware that there is a lot that doesn't stick. Maybe in my reading journals I can also keep the marks I don't want to put in books.I found the books lists and awards very interesting, and the same thing was true for the quotes. I was curious to see how many science fiction lists and awards were covered (kind of a secret litmus test), and there were several--not bad. It was just fun for me to read all the lists, and clearly the award lists give many more books that will be worthwhile for me to pick up and read.It was no less fun to read all the quotes. Though there were quite a few of them, let me pass on two: \"The things I want to know are in books; my best friend is the man who'll get me a book I ain't read.\" -Abraham Lincoln; and, \"People don't realize how a man's whole life can be changed by one book.\" -Malcolm X. It's hard to beat the two for a summation of why reading is worthwhile, even valuable.I believe that I have been missing out on a lot while I've been paying attention to other things. Book Savvy? Yes, highly recommended. I got a lot of enjoyment out of even reading it. But it didn't only give me a single book...I just might have been taught how to fish.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I thoroughly enjoyed Ms. Katona's Book Savvy. Her comments on reading in general and her recommendations for reading caused me to revisit works I had not thought of in ages. Her take on books I had already read stimulated an interest in the ones on her list that I have not yet read. She gives practical and useful tips on active reading that all of us should put into effect. I'll never read a book again without marking it up.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a fantastic book. I love the elegance and gentle humor in Katona's writing, the whole savvy idea and the incredible inspiration on every single page. I love the cultural perspective -- reading as an unnatural act in America! --and all the practical, technical help she gives the reader -- the whole TEACHING part without any didactic turn-offs. And the amusing list of quotes, like separating people into those who read to remember and those who read to forget.Really, it's a treat to read not just Katona's assembly of books, but to savor what she says about each of them, and how little (admirably little!) she needs to say to make them hot. I was fascinated by her choice of quotes from the books she mentions, especially when I knew the book. And of course, I loved to find so many of my own old favorites among them, and to discover some new ones as well. Page after page I went: Ah, maybe I should have read this book, after all...Darn, I really ought to read that one, too.... Okay, I will read it NOW!!!It's like a pleasure walk through one's book life, with surprises and suspense all along the way.Katona's students are lucky, lucky to have her as their prof.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the golden treasury of poetry",
        "description": "SUMMARY: Over 400 poems ranging through all periods of English literature, simple verses, then progressing through twelve categories including animal poems, portraits and nonsense poems.",
        "authors": "['Louis Untermeyer']",
        "infoLink": "http://books.google.com/books?id=C-sFAQAAIAAJ&dq=The+Golden+Treasury+of+Poetry.&hl=&source=gbs_api",
        "categories": "['American poetry']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "I have read this so many times my copy is literally falling apart. I am 37, and to this day entire phrases still ring in my head from classics like The Highwayman, Paul Revere's Ride and Jabberwocky (&quot;beware the Jub-jub bird and shun the frumious Bandersnatch!&quot;). In fact, when I took the GRE several years back, my acquaintance with this collection was of more value than my college literature classes. Not only for children - although I would buy a copy for every child I care about if it was still in print.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "...Begins one of my many favorites introduced to me by this book. My mother (a librarian) first read poems such as &quot;Wynken, Blynken, and Nod&quot; to me from this book, and I continued to read them until a hiatus where a young man disdains poetry as not being macho. I rediscovered many an old friend when I started reading these poems to my own children. Now the book is in tatters (glueback bindings do not stand the test of time, especially not in dry Colorado), and I search for a replacement. If the reissue has indeed been 'sanitized' in the name of political correctness, then I fear much will have been lost, and I will be reduced to trying to rebind my tatters.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am 45; I grew up with this book as our family poetry book-I am no poet but gained magic from having this book on the upstairs shelves to read when I wanted to--my folks didn't push it. I know there are many others but this one let poetry into the life of a hard core boy. I would like to get it for my son.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I fell in love with this book in my elementary library. I've paid enough late fines on it in the last 15 years to have bought the book several times over. It's here that I fell in love with Lady Clair and a million other classics that have resurfaced over and over in my classes in grade school and college. I want my own copy!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "betsy and billy",
        "description": "Betsy, Billy, and their friends enjoy and learn from the many activities in the second grade. Simultaneous.",
        "authors": "['Carolyn Haywood']",
        "infoLink": "http://books.google.com/books?id=kFg3rp2VLioC&dq=betsy+and+billy&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Betsy and Billy are very good friends in this book. They played together a lot and they had funny adventures. I liked this book because it was interesting and funny. It made me laugh. I have read lots of other books about Betsy too,",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Betsy is back in an all new adventure. This time she is off to second grade. She and her best friend Billy are always up to something. This time they fight over who will lose their first tooth first, make great Halloween costumes, and make a big mess in the kitchen when making a snack.You just never know where the book will take you next!The chapters are short and easy to read. There is no violence of any kind in the book. Readers who need gentle book will enjoy this very much.I would recommend this book to kids in second grade. They will be able to relate to the book and the characters in the book well.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "My daughter just finished reading this book and I am back to purchase more. She needed to chose a chapter book for her first book report and I was trying to steer her away from her first choice of Junie B. Jones - which she picked up in school. She said she loves Junie B. because it's funny - but I feel the main character is rude and wanted a better role model for my daughter. When she realized that Betsy is also in second grade she began to read it.After finishing the book she told me she understands everything in Betsy's book whereas with Junie B. she was just reading the words. Her favorite part of this book was the fact that Betsy got her Christmas wish of a baby sister - which they named Star. Just a very nice story for a little girl who is a new reader.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "theres a fly on my toast",
        "description": "THIS IS AWESOME! Reviewer: A reader This book is SO MUCH fun! I have read and reread the funny, peculiar, thought provoking poems so many times with my daughter that it is already showing great signs of wear, after only two months. I hope this author is discovered by some big time talk show people. He deserves to be known as well as some of the others such as Shel Silverstein, Jack Prelusky and the others that keep us laughing. Encore! Encore! Encore!",
        "authors": "['Justin Matott']",
        "infoLink": "http://books.google.com/books?id=TSQeAgAACAAJ&dq=There%27s+a+Fly+on+My+Toast&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am nine years old and I think that Justin Matott's books are great for young kids to read. I have read all of them many times. My favorite poems in \"There's a Fly on My Toast\" are, \"Revise This, Revise That\" and \"There's a Fly on My Toast.\" I can't wait for his next book!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "my mom got me shawn silverstine books and i read them all. I like crazy poems and then I got this one. It is so funny and has a ton of different kinds of things to read about. The pictures are funny too and i want to read more of Mr. Mattott books.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the rune of zachary zimbalist connedim connedim",
        "description": "Twelve-year-old Zachary is whisked off to the land of Connedim, a dimension between past, present, and future, where he must fight the forces that plan to spread chaos and pain throughout history.",
        "authors": "['Pamela Keyes']",
        "infoLink": "http://books.google.nl/books?id=Rq0_AAAACAAJ&dq=The+Rune+of+Zachary+Zimbalist+(Connedim)+(Connedim)&hl=&source=gbs_api",
        "categories": "['Bullies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Rune of Zachary Zimbalist was awesome. I loved the mandiballs. Probably my favorite part was when Zachary's mandiball bit Denny in the rear end and it had its temper tantrum. It was also funny when Zachary pretended to throw the ball at Denny and Denny flinched. I thought it was really creative about the group of animals with Eddy Abby. On the cover of the book it says book one so I cant wait to read book two. I am not really a lover of reading but if I find a book that is good, then I read it! I read this book in two days.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Other activities normally take priority over reading for my active 11 year-old; yet he loved Harry Potter, and so I purchased this book at a book signing. He loved it, and went on to buy the second book. I read it and enjoyed it as well--it has suspense, compelling characters, and terrific imagination. A gem!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The Rune of Zachary Zimbalist is about a boy who gets to do a bunch of things that I'd like to be able to do, like fly, and time-travel, and have lots of friends from different countries. Mandiballs are so cute and I want to have one! This book is a fantasy but with no princesses. You can really use your imagination.The main message of the book is that you should never give up. And you should always believe in yourself.When I was reading the book I never wanted to put it down. I would beg my mom to read one more chapter before bedtime. My mom liked the book so much that sometimes she would stay up late and read it with me.I would recommend this for anyone ages 8 and up.Erin L.Age 10",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I might as well compare it to Harry Potter, because the author is obviously a Rowling fan. I'm not complaining, though. I've been looking for more great fantasy ever since I started reading Rowling, especially since her latest books are for older kids. The Rune of Zachary Zimbalist is all about twelve-year-old Zachary travelling through time to save history from the evil Scatterers. I loved the twists and turns at the end, and I just bought the second book. I can't wait to read it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "naked came the sasquatch",
        "description": "Michael Fenberg, editor of a small, eclectic newspaper in a rugged community in the Sierra Nevadas, is out to solve a series of grisly killings. He knows that a monster is committing the murders - but WHICH monster? And why is the creature so interested in murdering Elaine Mitikitski, Fenberg's love and ace reporter? \"Naked Came the Sasquatch\" is the genre-busting underground bestseller that melds adventure, romance and mystery. Some readers claim it's the funniest book ever written. Several have complained they innocently started reading, couldn't put the book down, stayed up all night and missed work the next day. Others have worn out their copies, reading it over and over. We suggest you follow their lead.",
        "authors": "['John Boston']",
        "infoLink": "http://books.google.com/books?id=imbtzgEACAAJ&dq=Naked+Came+the+Sasquatch&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was lucky enough to have been working in a bookstore when this book first came out. I walked past it everyday and it always caught my eye so I finally bought it. This may be the best book I have ever read. It has great characters, fantastic imaging from the descriptions, suspense, murder, humor, and monsters. It has gotten to the point that when I read this book, I actually visualize it as a movie with Bruce Campbell playing the main character Michael Fenberg and Janine Turner as Elaine Mitikitski(oh if it would only happen). It's a truly visualizing book from the reflections of Tuberski's See-Em-Dead Zoo Bar and Grill Massacre to Fenberg's giant truck to the Mogonogonovich Brothers brutish antics; it's a riot and so enjoyable. You'll read this book until it falls apart (then you'll tape it together over and over again).I have recommend this book to numerous people and all of them are grateful for having got it. I got my wife to read it and well to make a long story short, we read it so often that I've had to buy three replacements because they get worn out (my prize one is I managed to snag a John Boston autographed copy). By all means, have no doubts, GET THIS BOOK! You will not be displeased.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Lets face it, anyone reading these Sasquatch reviews are doing so because they've read the book, loved it and want to know what other people have said. The gods smiled on me the day I found this brilliant book hiding in my local bookstore. I read the first page, marvelled at the low cost of the book and bought it. I laughed, cried and laughed when I read it. I then promptly read it again. The characters are very well thought out, and I am thinking of changing my name to 'Tuberski'. Why this book is not a best seller and hasn't been snapped up for film rights is beyond me. I like the descriptions of Northern California(?), it sounds like a good place to live. This book made me want to do silly things like write letters of praise to the author and shout how good it was (the book that is)from the top of the nearest hill(!). Do you get the feeling that John Boston knows something about the sasquatch that most of the rest of the world doesn't. Has he written any other novels or short stories? Finally 'foof' has become a permanent part of my dictionary. Thank you John and please hurry up with the next novel. Another good author I've read recently who makes good use of humour,horror and good characterization is Michael Marshall Smith.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The suspense in this book is great, but it isn't just the tense moments that make it so good. Normally when a book gives you a rundown of the character's life it's kind of dull. Boston takes these character development areas and makes them wet your pants funny. It's the first book I've ever read that didn't have a single dull moment.Keep in mind that I have a warped sense of humor.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I've read this book a minimum of 6 times and still can't get enough! I first purchased it in 1993 on a whim, and made the mistake of loaning it to a someone in 1996, never got it back. Everytime I discribe it to someone as comical horror story, they look at me like I've lost my mind. But what can I say, Mr. Boston captivates you from the first chapter. I couldn't put it down. The &quot;big-butt monster&quot; stoled my heart. I've been searching high and low for another copy of it and if Amazon UK has enough,I'm getting atleast 3!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am a fanatic about the Bigfoot/Sasquatch phenomenon, and when I saw this book, I jumped at the chance to read it. Most of my books are the documentary/sightings/analysis type, so reading a fictional account was a treat. Wow. It was different and kept me reading. Before it is over, you have murders, humor, romance, comedy and even a werewolf! Holy smoke! The only thing that detracted from the book to me was the long and unusual names Boston used, such as John Tuberski, Elaine Mitikitski and a couple of brothers whose names I can't spell because I don't have the book right here in front of me. Very entertaining, though, overall. Beware of the Mandrango!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Having lived in the Pacific Northwest and Northern California, I was interested in the subject of the title. I found this book to have quite a unique view of the creature most call \"BIGFOOT\". So far, I've let three others read the book and everyone of them laughed as they returned it. They agreed that you can be scared and laugh at the same time. The book pulls you in with the struggles of a small town newspaper office dreaming of \"The One Big Story\" that will put them on the map. Little do they know just how big their story will get. You have murder, blood/guts, suspensful moments, GREAT one liners to make you laugh and the chilling twist to keep you reading untill the end. The author uses alot of modern environment to make this book believeable. You'll get goose pimples and side aches; from laughing while being scared.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I first picked up this book a few years ago because of the cover (I am something of book cover whore. I am easily pleased.) and I've never regretted it. I've never come across another book that was able to mix comedy and horror so well. As hilarious as this book was there were also numerous scary moments that didn't lose any of their power when it was preceded by a light humorous moment.Anybody who reads it will fall in love with Fenberg and his multi-named brother who have to fend off curses, werewolves and vengeful rednecks to save the people they love. The story is off and running from the first page and you won't want to put it down, so don't!My only complaint is why hasn't John Boston written another book?!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Found this book last week at a used book store. Bought it on a whim. Found myself waking-up in the middle of the night to get a few more lines in before dawn. Mr.Boston has a talent for keeping you in suspense but with such witty dialogue. I have not not laughed out loud while reading a book in many moons. Only wish he would bless us with another gem. This one is a keeper!!!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "There are so many great things I would like to say about this book, but I will not profane the book with my incoherent rambling. This book is excellent. Buy it as soon as possible. You'll love every bit of it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "It's great, great fun. Read it. Enjoy it. Lend it out and share the experience with others. \"Naked Came the Sasquatch\" has quickly become one of my favorite books and I recommend it to all. If you loan it to someone and they don't like it I believe you have justification for ending any relationship you have with that person. I knew I was hooked when I started to end my conversations with my brother with \"ps - bed wetter\".",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a savage business the comeback and comedown of mike tyson",
        "description": "Examines the life and career of Mike Tyson inside the arena of professional boxing, looking closely at the personalities, deals, and profits that make up this world of sport and violence",
        "authors": "['Richard Hoffer']",
        "infoLink": "http://books.google.com/books?id=QwSEUvYSq-gC&dq=A+Savage+Business:+The+Comeback+and+Comedown+of+Mike+Tyson&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I would like to say that I tore through this book at a rate of knots and left fully satisfied. I hate to discover that halfway through a book it is becoming a chore to read but that is exactly how I found this book. Although it does have moments that will no doubt allow you leave to pause for thought, generally it is a tough read that the author has obviously tried hard to complicate regarding issues where motives were actually very simple. Maybe he was looking to read between the lines for deeper issues but I don't believe that they existed. If this were a school report card it would have &quot;could do better&quot; written all over it. Frustrating.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Interesting Book Best Served With Bad IntentionsInteresting Book - I recommend reading it in addition to reading Bad Intentions: The Mike Tyson Story by Peter Heller - this book picks up pretty much where Heller's book leaves off - it picks up at Tyson's release from the Indiana Prison and ends at the Holyfield ear biting.The beginning and end are very clear in it's dealing with Tyson and notably charismatic and captivating - I especially liked the perception and analysis of Tyson's career.The middle came up a bit short, but was readable and mostly dealt with the business side of things - the business side of Las Vegas, hotels, Don King and the business of boxing - Tyson is in there - just not as much as in Heller's book.A necessary book for the Tyson fan - and it's an interesting read -On it's own - I'd give A Savage Business: The Comeback and Comedown of Mike Tyson 3.5 stars (out of 5) - however - as a companion to Bad Intentions: The Mike Tyson Story - I'd give it a 4.Also (just so you know) - Iron Mike: A Mike Tyson Reader (by Daniel O'Conner) is another awesome book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "be a successful building contractor",
        "description": "Running a small business can be daunting to the contractor whose expertise is in building -- not finance or law. This book helps to demystify the day-to-day challenges that contractors face. Running a Successful Construction Company is acknowledged as the leading book in its field.",
        "authors": "['David U. Gerstel']",
        "infoLink": "http://books.google.com/books?id=LNL4Aw71kzkC&dq=Be+A+Successful+Building+Contractor&hl=&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is a wonderful book on the industry. If you are interested in becoming a contractor and don't have much experience with the all of building aspects, this book should enlighten you. I highly recommend it.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "If you are new to the building business - this is definitely NOT the book to buy or read. I found the book to be very general speaking on all 26 topics being discussed. E.g. topics on computers - why to use them or not - are completely outdated.This book lacks a lot of detail. It scans over most items and I really find it difficult to highlight facts that I would re-read later. This book will NOT make me a successful Builder - just a frustrated reader.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "As someone who hopes to become a home builder I found this book very helpful. The author answers many questions about the buisness side of the home building industry. It is a step by step guide, my only objection is that it did not go over the actual home building process (But I believe that was not his intended message, so I can not fault him for that.) I would read more books by this author.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "While I am only about 85% of the way through this book let me say that I have found some very informative material. I have also found some VERY VERY wrong information. As a financial advisor turned contractor I am currently in the &quot;Planning for your future&quot; chapter and have found some terrible advice. It leads me to believe that although he was a succesful builder and did well that he doesn't know when to shut-up about things he really has no idea about.I have enjoyed the book so far but it really is outdated and needs to be revised or pulled off the shelf so that inexperienced builders do not use his &quot;past there prime&quot; ideas in todays market.If you are in the market for industry books then you can do better. There are books out there that are much more current than this one. Buy a specialty book and stay away from the guys that think they know it all.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Good book. A solid value. This is a very versatile book, as it applies to all types of construction business. Its really about solid business practices(not strictly pertaining to building, although theres plenty about that in here). This book is very business oriented and covers quite a bit in the legal aspect as well. Good book with good templates. Finally i got some decent info on lein waivers. To those who arent computer savvy, chapter 17 is for you.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I am extremely disappointed in this book. After all the hype (the author proclaimed he was very successful, building 60 homes a year at his peak), this book appears to be written by someone who has never set foot on a building site.It is virtually all written in generalities, with very little useful or valid information pertaining to contracting. This book really lacks SPECIFICS!! A lot of what the author does is just write \"fluff,\" or \"filler.\" In other words, much of his writing is just wasted space.I believe that the positive reviews on this book were either written by morons, people who think \"fluff\" is good writing, or most probably, friends of the author who are trying to increase sales of his book.It's really a shame, because I have the feeling that the author really does know about the building business. Too bad that he didn't choose to impart any specific knowledge to the people who forked over $25-30 for his book.The author should be ashamed of this piece of work. It's really a ripoff. If you are a budding young contractor like me,DO NOT waste your money on this book! Or, your valuable time.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "being methodist in the bible belt",
        "description": "Written in a humorous, accessible style, this book is an easy-to-understand guide to the kinds of theological questions that many United Methodist youth and others are asking today.Being United Methodist in the Bible Beltwill help any United Methodist youth, parent, or educator better understand their unique brand of Christianity in light of the understandings of those from the evangelical tradition. With helpful sidebars explaining United Methodist history and polity and questions after each chapter for reflection and action, this book is ideal for Christian education courses for youth and adults, new member classes in United Methodist churches, as well as personal reading.",
        "authors": "['F. Belton Joyner']",
        "infoLink": "http://books.google.nl/books?id=6JKNoEWa8-cC&dq=Being+Methodist+in+The+Bible+Belt&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Attention ALL United Methodists (whether or not you think you're confused)! This book provides exactly what the title suggests and does so in an organized, intelligent, and humorous way so I won't waste your time elaborating. Buy the book. Better yet, buy 4 copies. Give one to your church library and submit an article for the next issue of your church newsletter calling attention to the new addition. Take the 2nd copy to your Sunday School teacher and volunteer to use the book to teach the next several weeks for him/her. (I'm sure they deserve a break.) Give the 3rd copy to your youth director. (I sure wish it had been available to me as a youth.) Keep the 4th for yourself and loan it out often. I slightly disagree with the authors opinion that the &quot;Bible Belt&quot; is a state of mind. Perhaps, but I think we struggle with these issues much more in the south than anywhere else. Buy the book. You won't regret it.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "I concur with Laura's analysis of this book. This is actually an introduction to UMC theology/doctrine, but it is presented in a very readable format. It describes what makes United Methodists distinctive from other denominations while allowing for diversity of belief. Buy it!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I bought this book shortly after joining a United Methodist church. As a former southern baptist, I found this book very helpful in discerning the differences between the denominations. I've since recommended this book to several friends and family members.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "funny ,easyto read, information priceless to a long time Methodistlike me, I learned a lot from reading this book, it is a referencefor me, I'd like to thank the author for writing it",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am a life-long Methodist,a seminary graduate, and thought I knew a little about Methodism. Belton's book opened my eyes and mind to a better understanding of just who we are, who we claim to be, and why we are who we are. I have had the opportunity to take two classes with Belton Joyner at Duke Divinity School and he is just as engaging and well versed on Methodism in real life as he is on the written page. This book is a must read for anyone who \"thinks\" they know Methodism and would really like to have a quick crash-course to reaffirm those beliefs.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is a great read and VERY pertinent. It really makes you think and Belton had lots of great ideas. VERY FUNNY.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I had this book on my (very crowded) shelf of books that explain United Methodism and Wesleyanism for years until I read it just a few weeks ago. Wow. For a readable introduction to our tribe, it does not get better than this. Is Joyner a little campy in his illustrations? Perhaps - but then, that may be just his style as a preacher coming through, because even the silly illustrations contain truth. I now have it loaned out to a seeker coming from a de-churched background of various denominations, and she is finding it very helpful. Perhaps you, or someone you know, will, too.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "rebel bookseller how to improvise your own indie store and beat back the chains",
        "description": "Renowned bookseller Andrew Laties offers a radical and creative new paradigm for independent booksellers on all sides of the cash register, written to inspire a revival of community bookselling. In his 20 years of revolutionary retail, Latie's ideas were adapted by Barnes & Noble, Zany Brainy and scores of independents. Rebel Bookseller challenges today's bookstore workers to improvise the wildly imaginative indie bookstores of tomorrow, and includes a behind-the-scenes history of the book industry, humorous anecdotes and bittersweet lessons, ten interlacing Rants, and three Rough Rules of Rebel Bookselling Blending adventurous memoir, satire and sharp-tongued jibe, the author dares the chains to sell this revolutionary book.",
        "authors": "['Andrew Laties']",
        "infoLink": "http://books.google.com/books?id=HBuq-kHI2ZUC&dq=Rebel+Bookseller:+How+to+Improvise+Your+Own+Indie+Store+and+Beat+Back+the+Chains&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "More than a simple expose of the rather murky and misunderstood book world, Laties \"Rebel Bookseller\" is a call to arms for all future independent bookstore owners. While his tone is acerbic at times, his information and insights are top-notch. They should be after the over 20 years of independent bookselling he's done. Laties explains why books are so expensive and why superstores are to blame. Still, his message is a hopeful one. He sees the importance of independent bookselling for all aspects of the industry as independent bookstores are a breeding ground for independent thinking and independent writing and most important of all, independent reading. This book is a must-read for all booksellers, all bookstore owners, and all who hope to join that weird and wonderful world.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "Dear god this is good. I don't care if you know what a bookstore is, buy this immediately. I stayed up 3 nights finishing this brilliant work of literature.",
                "review/helpfulness": "14/21",
                "num_reviews": 21
            },
            {
                "review/text": "If you are planning on opening a bookstore and know nothing about the book trade, this book might not be as entertaining. If you have worked in the trade before, however, this book is both a quick, entertaining read and a wealth of information in the form of anecdotes and handy tidbits toward going it on your own. It won't give you a step-by-step guide to starting a bookstore, but then again if you wanted that you probably wouldn't be reading a book called \"Rebel Bookseller.\" Laties' claims that he did everything first and the chains stole all the good ideas from him are a little wearing at times; then again, I can appreciate arrogance if it's justified and judging by his level of success both with bookstores and his book, obviously the guy knows what he's doing, so listen to him. Written passionately and optimistically, if nothing else this book will bolster your faith in indie bookstores and get you ready to do it yourself.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I would have to strongly disagree with a previous reviewer who believes this is some kind of a masterpiece. This is basically an autobiography of a guy who owned a couple bookstores and thinks he is the Michael Jordan of Indie Bookstores. If he is so successful, why did his business fail? Paranoia sums up a good chunk of this dead wood, as the author thinks the chain stores stole most of their good ideas from him. He is very angry about this supposed fact but readily admits that he ripped off ideas from many others. He loves capitalism and making money until someone else is making money, then he thinks they should be regulated.There are a few good tips for indie booksellers in here but nothing that you can't get off the ABA website of figure out with a bit of common sense. He is very much into events and PR and the back of the book is full of such information. I have met other indie booksellers who were more into being the center of attention and doing events than selling books. Most of them are now waiting tables...",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "Very enlightening book about the bookselling industry and the giant chain stores. This is a must read for indie store owners, not just booksellers.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "...you'll still enjoy this book. Laties discusses the numerous bookstores he's run or co-run, and I found the inner workings of the book business to be extremely interesting. The tips and techniques explored in Rebel Bookseller could carry over into any industry really, but it's exciting to hear how some were developed and implemented by Laties, and the successes or failures they produced. I highly recommend this title.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I rarely read a book all the way through as quickly as I did with this one.I own a bookstore chain, and I have had such trouble trying to find quality literature about the art of selling books. This isn't a textbook about the book business, but it definitely helps a fledgling bookstore owner by giving a real account of a life in the trade.If I were to rate the book purely of its own merit, I would give it 4 stars. This is really because they book has more stories than business advice about the book trade.I give it 5 stars, however, because it in the most enthralling read I've found about the day-to-day life of a used book seller.I highly recommend!Thank you, Mr. Laties, for this work.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "If you're looking for an unabashed peek behind the curtain of big time bookselling politics, then you'll thoroughly enjoy this romp down memory lane.The author exposes the good, the bad, and the ugly about the inner workings of the bookselling industry as seen through the eyes of a successful independent bookstore owner. When someone who's operated a single store for multiple years that grossed nearly $1 million dollars a year begins to talk, he's worth listening to.This is not a \"how to\" book on bookselling. Nevertheless, you'll get some excellent ideas just by reading between the lines. I was especially impressed with the reprinted \"Showcasing Your Store\" articles that contained detailed descriptions of the author's community involvement programs used to attract customers.Because of this book, I no longer view my business as an \"independent bookstore.\" Rather, I now see it as a community center with a rich assortment of events and activities that happens to be funded by an independent bookstore. That's a lot more fun.Joe Waynick, Author\"Internet Bookselling Made Easy!\" series[...]",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "inner city hoodlum",
        "description": "After a heist on a freight train leads to murder, Johnny and his friends go to work for kingpin Duke Davis, but when Duke recruits Johnny's little sister Leslie for prostitution and later kills her, Johnny seeks revenge.",
        "authors": "['Donald Goines']",
        "infoLink": "http://books.google.com/books?id=Xeo25DpX4twC&dq=Inner+City+Hoodlum&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "It's a real good book. It's the only book that I read from cover to cover. I lost the book in high school and have been looking for it since then. From then on I haved liked Goines. He is so descriptive!!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book followed the same formula, but there are some moments in it that separate it from the other books he has written. The ending of this book pissed me off, but besides that, I loved it. Two friends kill a guard in self-defense, and turn to a neighborhood numbers man with a known reputation. Things hit close to home with one of the young cats, and he, along with his friend, seek revenge for the overdose of his younger sister, by the Duke, the numbers man. There are the vivid scenes, the gruesome descriptions, and everything else which makes Donald Goines work stand out. Don't expect a happy ending, because that is not what Donald Goines was all about. He was about presenting reality.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The book was tight ya dig. The book keeps calling you back for more you can't put it down. Once you read it you keep going back for a different book. Donald Goines is the best writer there is and ever will be don't sleep on him.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This was a short read. It was okay. I am getting used to books with an incredible amount of detail and this one really didn't have it. I believe that the story was based upon factual accounts of Mr. Goines life. It was tragic because the character could not liberate themselves. I have read one other of his books in the past and perhaps I will start with his first book and read all of them. This one was okay.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I love Donald Goines books but this book was not what I expected. The book was like a repeat of 1 of his other books. After reading it I felt like that was my 2nd time reading the book. I liked it because it still was real and spoke the truth. It didn't hold anything back.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I have mixed emotions about the book. Finally, I met some colorful characters that didn't totally resemble the characters from the other six books I read. I enjoyed every minute of Johnny and Buddy's story, I was intrigued by Leslie's tale of prostitution, and wondered what in the hell Duke had in his pants to make these girls so stupid.But I don't understand why Spence is so eztra angry (would've enjoyed his back story), why Johnny never used what he taught Buddy as protection, and how submissive Gloria became.Either way, this book gave an intersting spin on how hood life is for young kids who have no other means to make it.P.S. I love the toilet mishap.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "an introduction to the urantia revelation",
        "description": "An introduction to the urantia book revelation, with many quotes from the urantia book.",
        "authors": "['David Bradley']",
        "infoLink": "http://books.google.com/books?id=xy7JPAAACAAJ&dq=An+Introduction+to+The+Urantia+Revelation&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is an excellent reference tool for those who are first exploring the gigantic contents of this epochal book. Due to the extent of the contents of THE URANTIA BOOK, a guide like this is essential to prevent frustration and failure to locate and comprehend vital information. It also provides an invaluable concept coordination for new or seasoned readers. We owe the author a debt of gratitude for creating an accurate and helpful companion to the &quot;Big Blue Book&quot;.",
                "review/helpfulness": "43/45",
                "num_reviews": 45
            },
            {
                "review/text": "This book is beautifully written. It captures the essence of the Urantia Book revelation and presents it in a &quot;reader friendly&quot; format which greatly increases the potential for spreading the word about the Urantia Book and it's message. I have initially ordered 10 copies for distribution to my family and friends and expect them to be so well received that I will soon be back for more. Thank you, David Bradley, for this loving service to your fellow humans. I believe that in writing this book you were truly &quot;following God's will&quot;.",
                "review/helpfulness": "36/38",
                "num_reviews": 38
            },
            {
                "review/text": "If you have read The Urantia Book and couldn't understand the first section, this is the book for you. It's brief, to the point, explains with maps and charts.Excellent!!!!!!",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "For someone who has just discovered the Urantia Book and may be overwhelmed by all the information it contains, this is an excellent introduction to the book. The author is very knowlegeable about the Urantia Book, and he highlights sections that are of particular interest to him. He uses many quotes from the Urantia Book and arranges the material in sections so that a reader can go to a specific topic that interests them.If you like the Urantia Book, this is a real asset.Susan FlacksTrenton, NJ",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This beautiful book is a must-have! If you wonder what the Urantia Revelation is all about, or if you are a new student/reader of The Urantia Book, this is for you. David Bradley has presented an overview that is well presented, simple, and illuminating. I personally find myself reading it over and over again, even though I have read a great deal of TUB already. The illustrations are elegant and thought-provoking, to say the least. Thank you, David, for this service of love.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I have been a reader of The Urantia Book for several years. Despite regular and methodical reading, plus also owning a copy of Concordance, I still have not managed to finish the book nor digest some of its more difficult premises. This Introduction by David Bradley helped me do that.At first I was hesitant that it would alter some of the TUB's basic theories. When an author attempts to simplify and explain, he can offer enter in false information through his own personal \"filter\" of understanding. Bradley avoids this by quoting directly from the book and keeping his own explanations to the barest minimum. The most beneficial thing Bradley did was to select out key paragraphs from TUB and put them together, thereby helping the reader to summarize some of the most important concepts quickly.The other benefit of Bradley's book are the illustrations. In order to understand the cosmos as explained in TUB, I've had to make my own sketches. Bradley has saved us all a lot of time by making two large and really excellent illustrations.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "The U Book is often a difficult read for first timers, especially if they have had little preliminary discussion about its content. \"Introduction\" presents some of the fundamentals contained in the revelation in an easy to grasp manner. If still interested, the reader can progress to the U Book itself. This is far better than frustrating a reader in the first 20 pages of The Urantia Book.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a wonderful book for beginners to learn the principalsof the Urantia book. It is also a great teaching tool.Wendy Vig",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "For a couple of dollars more just buy the Urantia book. In this book you will mostly find quotes straight out of the Urantia book. I read the Urantia book first and then ordered this book. I guess I expected more insight. The Urantia book on the other hand is the most beautiful book I've ever read. Get the leather bound so it will not fall apart when you read it for the 3rd time.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I've given this introductory book to the Urantia Book to several friends. My copy is worn, underlined, read and reread. It's prompted me numerous times to either go online or to pick up the UB itself and read a passage further. It sits prominently on my night table book shelf.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]