[
    {
        "Title": "clearing the way working with teenage writers",
        "description": "Written for secondary school teachers whose job it is to help adolescents become better writers.",
        "authors": "['Tom Romano']",
        "infoLink": "http://books.google.com/books?id=AXnuAAAAMAAJ&dq=Clearing+the+Way:+Working+with+Teenage+Writers&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Tom Romano knows high school students. His book is inspirational and pragmatic. He provides stories of his students as writers and gives some great insight into the art of reading student papers for the good things that are there. I heard him speak last summer - the man knows his stuff. I liked the book even more after listening to him.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Romano's book has some valuable and practical methods of &quot;inspiring&quot; writing to teenagers. If I taught writing to teens based on what I learned (during the sixties and seventies), I would be a disastrous failure, not prompting young people to truly expand their talents. I found myself craving Romano's student examples, reading them over and over, and amazed at what teens are capable of, provided a nuturing, supporitive teacher, not a directive, tunneled, self-absorbed instructor. Romano's work will surely affect me if I someday teach. Teachers today would surely benefit if Tom were to update this book, revising it for the 21st century, though most of the book is timeless.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "arttalk",
        "description": "ArtTalk - The perfect blend of art criticism, art history, aesthetics, and studio production.",
        "authors": "['McGraw-Hill Education']",
        "infoLink": "http://books.google.com/books?id=t2f6JwAACAAJ&dq=Arttalk&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If your are an art teacher or an amateur in the field of art, you must use this book as a source for classroom teaching. This book leads you through the elements and principles of the visual arts. It is easy reference for lesson plans and for reference material, for any teacher. This book also covers areas in the profiles of learning and technique tips. Excellent for any one interested in the visual arts!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "If your are an art teacher or an amateur in the field of art, you must use this book as a source for classroom teaching. This book leads you through the elements and principles of the visual arts. It is easy reference for lesson plans and for reference material, for any teacher. This book also covers areas in the profiles of learning and technique tips. Excellent for any one interested in the visual arts!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "a short guide to writing about art the short guide ser",
        "description": "The best-selling guide to writing about art Sylvan Barnet's A Short Guide to Writing About Art guides students through every aspect of writing about art. Students are shown how to analyze pictures (drawings, paintings, photographs), sculptures and architecture, and are prepared with the tools they need to present their ideas through effective writing. Coverage of essential writing assignments includes formal analysis, comparison, research paper, review of an exhibition, and essay examination. New to the 11th edition is a chapter on \"Virtual Exhibitions: Writing Text Panels and Other Materials.\" MySearchLab is a part of the Barnet program. Research and writing tools, including access to academic journals, helps students master basic writing skills. To provide students with flexibility, students can download the eText to a tablet using the free Pearson eText app. NOTE: MySearchLab does not come automatically packaged with this text. To purchase the text with MySearchLab, order the package ISBN: 0205949525/ 9780205949526 Short Guide to Writing About Art Plus MySearchLab with eText -- Access Card Package Package consists of: 0205239927 / 9780205239924 MySearchLab with Pearson eText -- Valuepack Access Card 020588699X / 9780205886999 A Short Guide to Writing About Art",
        "authors": "['Sylvan Barnet']",
        "infoLink": "http://books.google.nl/books?id=S-YwnwEACAAJ&dq=A+Short+Guide+to+Writing+about+Art+(The+Short+Guide+Ser.)&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I recently read the 6th edition of this book in hopes that it would help me to improve my ability to understand and write about art. I found that the book is a direct, well-written primer for someone finishing high school or beginning their undergraduate degree, but for someone with a bit more experience, it turns out to be a mixed bag.I know next to nothing about visual art. I'm the quintessential &quot;knows what I likes, and likes what I knows&quot; type of guy. On the other hand, I'm a graduate student in English, so I'm well-practiced in writing essays and in applying various theoretical and critical methods. I read this book in the hopes that it would help me to better understand art. That is, I wanted to learn, as Sylvia Barnet puts it, &quot;How does art mean?&quot; The beginning of the text does introduce some basic questions and ways to think about different kinds of art, ranging from painting, to sculpture, to architecture, to photography, to video art, etc. However, this is not meant to be an instructional book to teach someone about art. It is more like an assistant text for a freshman-level art history course. A great deal of the book is spent discussing how to organize essays, sentence structure, revising, formatting, and some instruction on critical methods. But, again, this book is not a book on writing. It's not about art, it's not about writing, so what is it? Well, like it says, it's about writing about art. A good deal of this book was useless to me, but some of it was enlightening. If you've already got some experience studying the visual arts, or some experience writing, or you just want a really indepth study on either, pick out something else. If, however, you just want an easily understood, basic primer on writing and art, this isn't a bad choice at all.",
                "review/helpfulness": "93/114",
                "num_reviews": 114
            },
            {
                "review/text": "My Art History department adopted this book as its official style-manual a few years ago, and we assign it as a textbook for our writing and methodology class. To my great dismay, however, our bookstore has had some trouble ordering it this year, and so I have encouraged my students to &quot;cut the Gordion knot&quot; by ordering it from Amazon. The chapters on choosing a topic and organizing an argument are, I think, useful and well-written, but the greatest value of this book is Chapters 9 and 10, which provide clear instructions for writing footnotes and bibliography. This may be a mechanical task, but it is a frustrating one for many students, because there are so many possible formats to use (MLA, Turabian, etc.) Barnet's system has the virtue of being designed specifically for research papers about art and art history, and the format he recommends is clear and logical. The book also reprints the instructions for contributors from the Art Bulletin, the most prestigious art-historical journal in this country, and so will be of value for graduate students and recent PhD's preparing their first works for publication.",
                "review/helpfulness": "77/77",
                "num_reviews": 77
            },
            {
                "review/text": "This book is helpful. I do not know if this is THE most helpful book on the subject, but it's helpful. However, I must say that author's arrogant tone is not at all encouraging to a student, working on his/her assignment. At times, it is simply irritating. A book, directed mainly towards students, should be morally encouraging (not to mention inexpensive). This book is neither on these two things.",
                "review/helpfulness": "20/30",
                "num_reviews": 30
            },
            {
                "review/text": "I was quite surprised, but I really like this book. I was having a lot of trouble writing an art history paper and this book really helped clarify my thoughts. The book asks pointed questions that helps you focus your thoughts. I would strongly recommend this book to someone writing an art history paper.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "Head of the Department of Fine Arts (art history) at the University of Hong Kong had all of us first-year students buy this book. It is permanently stocked by the campus bookstore.It is a very good guide, with actual examples of short essays by students. In my opinion, one of the examples is a tad un-scholarly, using the first person and personal anecdotes in what is otherwise a formal essay. Some professors may not approve... mine did.I read this short book and used it; I am sure it contributed to my high GPA.",
                "review/helpfulness": "15/23",
                "num_reviews": 23
            },
            {
                "review/text": "As a student who studies art history, this book helped me (and still helps me from time to time) a lot. Great when you need a guiding light when writing. I really thank the author.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "I purchased this book at the beginning of the semester and have found it an invaluable resource. This is my first term as a graduate student, and I don't think I could have survived had it not been for this book. It gives useful commentary, helpful hints and a terrific reference section for footnotes and bibliographies. It addresses real problems that often occur in writing an art history paper and provides insightful solutions that encourage independent thinking. It also includes a section on essay exams which gets a quick read through when I take a test.I had several \"a ha!\" moments when reading it for the first time, and now I keep it within arms reach whenever I write.The price was a little steep, so I hesitated in buying, but when I finally made the purchase I was glad that I had.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a great book to refer to when writing an art history paper. I was an art history major in college, and this was the book that was recommended by the majority of my professors. I definitely recommend buying yourself a copy, because the copies at my art library were always checked out!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a must have for any art major that is currently or will be going into any college Art Program -- especially the analysis of Art via Art History classes. The directives are clear and easy to follow. Barnet breaks down all facets of writing -- from Reviews of exhibits to critical analysis of art work. This book can also be helpful in other classes as it guides the reader into writing more concisely and in a more direct manner. This is an excellent addition to any College Student and/or Faculty library.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I originally purchased this book as a guide to writing for my critical essays in art history classes. I have found it to be so helpful. It includes the kind of information that you don't even think about until you actually need to utilize them..so grateful it was available to me. The explanations and provided examples are very clear. I would recommend this book to anyone who wants to improve in their writing style.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "talk that book booktalks to promote reading",
        "description": "\"This book envisions the language and learning possibilities of young children's active engagement in literature discussion, which is not often found in books about early read-alouds. This book promotes read-aloud experiences that keep children, their backgrounds, and their experiences front and center. This book shares our journey, as educators and researchers, with a goal to support the learning journey of other early childhood educators. This book includes vignettes from classroom literature discussions as well as conversations between educators\"--",
        "authors": "['Sherry Sanden', 'Cassandra Mattoon', 'Sandra L. Osorio']",
        "infoLink": "http://books.google.com/books?id=c7lLEAAAQBAJ&dq=Talk+That+Book:+Booktalks+to+Promote+Reading&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "TALK THAT BOOK is the perfect link for school librarians and students! Ms. Littlejohn has built a bridge between the books and readers. As the Head Librarian at St. Maur International School in Yokohama, Japan it is my responsibility to connect the students with the latest and greatest books available, and TALK THAT BOOK helps me &quot;talk those books right off the shelves.&quot; This book features an author index, title index, genre index and selected subject index to point you and your readers to that perfect read.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "As an aspiring teacher, I found Ms. Littlejohn's book extremely helpful in preparing a summer reading list for my students. Also, the format of the book is both unique and insightful. The entire book talk is on one page, sectioned off in a way that makes photocopying and pasting the &quot;talk&quot; onto the back of a notecard a breeze. For those of us not comfortable giving book talks, this book is a blessing!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "radical reflections passionate opinions on teaching learning and living",
        "description": "The internationally acclaimed children's book writer and educator offers her insights into the learning process, language education, and the pleasure, growth, and power that reading and writing can bring.",
        "authors": "['Mem Fox']",
        "infoLink": "http://books.google.com/books?id=CBfLngEACAAJ&dq=Radical+Reflections:+Passionate+Opinions+on+Teaching,+Learning,+and+Living&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "&quot;Those who write well have more power and therefore have more control over their lives&quot; (p.21). If this is indeed true then Mem Fox is a very powerful woman! In the midst of the phonics vs. whole language war being raged in the media, this book is a call for reading and writing teachers to examine their practices and strive for truly purposeful, artful teaching. Fox's insights into her life as a writer, teacher and mother make this a truly inspiring and intensely challenging read. I have always believed that to be an effective reading teacher, I must be a reader, able to share my passion for books with my students, but Mem Fox points out that unless I am a writer as well, I will be unable to know the difficulties, fears, hopes and needs of my students as writers. I plan to thoughtfully explore the forms of writing I use, examine the writing process I go through and share my writing with my students on a more regular basis. I am convinced that we will all grow from the experience!!",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "This is the one book I kept from college and the one that convinced me to teach. I re-read it from time to time to recapture my vision for reading and writing in my classroom. What can I say? A must read for parents and teachers.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "I like to read this book just before I start a new school year. It reminds me of the reasons children want to learn to read. I teach remedial reading. The programs my district uses focuses on phonetic instruction. My students do need specific instruction to decode words, but they also need to be motivated and to know the pleasures of reading. This book helps keep my priorities right .",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "If you are a teacher, or you are in a teacher education program, or a parent and you haven't read this book you are missing out!!! Every teachers ed. program should require this book. It was an amazing read. Mem takes you to places in education you never knew existed! Thanks Mem!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I just finished reading this exquisite book, and have sent emails to all my friends who are educators and/or parents. Fox writes with such passion and voice that I couldn't put the book down once I started it. Her ideas are needed, her style is eloquent, fluent and mesmerizing. This is a book I will read again and again, especially at the start of each new school year. What she says is as important for high school learners as for kindergarten. She has stated so succinctly why it's essential to keep the heart in education. She shows how children can come to the love of reading, writing and thinking. Her diatribe against fill-in-the-blank worksheets is convincing. I will give a copy to every teacher that my children will have throughout their schooling.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the literary terrorism of harold jaffe the journal of experimental fiction 29",
        "description": "Harold Jaffe's acts of literary terrorism work to wrestle control of the future of literature away from the dominant culture. This book celebrates that effort. Jaffe is an acute observer of the painful conditions under which we are forced to live on a daily basis. And like any harbinger of ill, he is sometimes mistaken for its creator. But he is not. He is clearing out space that has been polluted for too long. His acts of literary terrorism are acts that reclaim literature and art fiction from its cooption by fast-food-wielding advocates of disposability: what has been disposed by the dominant political culture has too often been literary artists. Those who have benefited have seldom been literary artists. Jaffe has worked brilliantly to save literature from its unwitting complicity in the elimination of readers who dare question authority. The writing in this volume, whether by Jaffe, his former students and colleagues, or works inspired by his lead, helps blast us out of our complacency and reclaim space we should never have relinquished. Innovation and renovation are inextricably linked.",
        "authors": "['Eckhard Gerdes']",
        "infoLink": "http://books.google.com/books?id=-TAjXYoSQ38C&dq=The+Literary+Terrorism+of+Harold+Jaffe:+The+Journal+of+Experimental+Fiction+29&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I had not and still have not read anything by Harold Jaffebut he has a small but dedicated group of fans and readers.In this book Jaffe is placed on a lofty pillar by writers whoplace him amongst the most important current writers. On mynext Amazon purchase I promise to order a book by Jaffe. Youshould too.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Our world could use more literary terrorists like Harold Jaffe. This book is an excellent tribute to Jaffe.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "vas an opera in flatland",
        "description": "Tomasula's dissection of post-biological life is about the new interaction of bodies and DNA possibilities. His imagination, satiric edge, and wildly comic sense of things, combined with Stephen Farrell's inventive page lay-out, make reading this 'Opera in Flatland' an unforgettable experience.--Marjorie PerloffMore than a novel with 3-color graphics, almost a film, possibly a meditation, certainly a breathtaking inquiry into the artifacts of the human imagination, VAS is sensuous, ferocious, and original (Rikki Ducornet). When Flatland inhabitants choose to rearrange bodies (animals, plants, even themselves), they enter the double-helix of language and lineage--stories of knowledge, power, history, gender, politics, and self-identity.Steve Tomasula teaches writing at the University of Notre Dame. Stephen Farrell teaches graphic arts at the Art Institute of Chicago.",
        "authors": "['Steve Tomasula']",
        "infoLink": "http://books.google.com/books?id=7NMgAQAAIAAJ&dq=Vas:+An+Opera+in+Flatland&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Reading \"Vas: An Opera in Flatland\" while I waited to have my hair cut, someone nearby asked what I was reading, and was it a good book. Answering, \"yes this is an excellent book\", I was not prepared for the next question. \"How do you know it's an excellent book\"? Being a person who would typically answer, \"Because someone told me so\", or trying to end the conversation I had become a part of, I answered, \"because I am enjoying it, its making me think about a lot of different things, and its cool (I apologize for the `cool')\".Sinking my head down I pretend to read but was actually thinking about the question I had already answered. How do I know this is an excellent book? The question intimidated me. I wondered if I was answering this in the presence of the author that wrote it or the artist that put it together what my answer would be.So I tried, this book (seems unfair to call it that) encompasses written and visual art, science, humor, some history, politics, ethics, and more. From the books bindings, to the artwork and the writing I find it difficult to compare to anything else I have read or seen (OK, as far as books are concerned). I looked at the drawings, layouts and fonts and typeset, I laughed, I read and I learned. I cannot think of other works that touched so many areas. If this is a new approach to literature, I feel it is `excellent'. If this is an approach to literature that I have been missing then I apologize for myself.Please give this work a chance, while reading, looking, holding, etc you will ask `you' a lot of questions and will be looking at a lot of different images. When you are done you will struggle to put your hand on what you have put down, a piece of art, a book, or something else.I'm not sure what I should call it, but it is an excellent book. (Buy It!)",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "In some sense VAS picks up where Richard Powers's groundbreaking The Gold Bug Variations leaves off: assume that the structure of language is reflected in the double helix, and assume further that print technologies are an analog for body technologies, words and images and book materials made flesh and blood and bones. Now imagine a narrative orchestrated around characters whose symbolic proportions resonate with the latter two assumptions, and you have some idea of the staggering visual sweep and poetic beauty of VAS, perhaps the first graphic novel (term used advisedly) in which both &quot;graphic&quot; and &quot;novel&quot; are given their full due as contemporary art forms, thus reinventing the genre while re-novelizing the novel of ideas. VAS stitches personal reproductive drama to social-scientific controversy to illustrate the challenges facing our species, a species wedded to its incorporations. Author Tomasula and designer Farrell have set the bar very, very high.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I've been a fan of Steve Tomasula's writing ever since I read his brilliant short story, \"C-U See-Me\" in The Iowa Review. VAS: An Opera In Flatland only confirms my best suspicions: that Tomasula is one of our most talented and innovative writers creating in this age of same-ol/same-ol. His collaboration with artist Stephen Farrell hits a high note in the field of Text + Image. This is a literal work of art, and should be approached in the same way one views a painting - by allowing the work to speak on its own terms rather than from conventional and limiting expectations. Reading VAS is like witnessing scattershot in reverse: With narrative of an impending vasectomy combined with scientific data and historical facts (to name only a few), and structure combining the media-asides that bombard us daily, the process of reading here is broadly experiential - an accumulation of often poetic, comic, and tragic information that coalesces as you reach the end. Very much like life between the covers. But a very smart, richly lived life.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "The book is a fun, funky blend of novel, epic poem, found poetry, and graphic art. You will be enthralled. Shipping was fast, too!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "moko or maori tattooing",
        "description": "This oversize volume presents 72 full color photographs of contemporary Maori facial tattoos, documenting the resurgence of the traditional moko.",
        "authors": "['Hans Neleman', 'Tame Wairere Iti', 'Pita Turei', 'Nicole MacDonald']",
        "infoLink": "http://books.google.com/books?id=LasTAQAAIAAJ&dq=Moko+%3B+or+Maori+tattooing&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I've read a lot about Maori tattooing, and this book is very informative and interesting. I strongly reccommend it for educational or personal research.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Great art work in this book. Highly recommended for anyone interested in Polynesian culture and the art work.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "this book was extremely helpful for the college research project i was doing. great illustrattions and a lot of good information",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "on the preparation and delivery of sermons",
        "description": "Fully revised edition of the classic guide to the art of homiletics incorporates recent helpful developments in the field.",
        "authors": "['John A. Broadus']",
        "infoLink": "http://books.google.nl/books?id=tt5I9cV9bsQC&dq=On+the+preparation+and+delivery+of+sermons,&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is one the best books ever written. It was the first book passed on to me as a young minister. I would suggest that all preachers read, and reread this book. This homiletic masterpiece is a must for all young preachers. This book was originally published under the title ' A Treatise on the Preparation and Delivery of Sermons'. This book is both informative and inspirational. It was no mistake when I opened these comment by saying that this is one of the best books ever written, (not limited to homiletics), one of the best books on any subject. ** Rev. Clay A. Jackson *",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "Scripturally sound, practically oriented, broad in scope, but specific in advice, this book is a masterpiece. Anyone with an interest in homiletics either has read this book or should.If you're a layman who teaches a Sunday School class, buy this book. Your presentation skills and organizational ability will skyrocket. Your students will get more from the lesson, you will present the material in a more professional manner and you will be easier to follow.This book is helpful for anyone with a call to use the spoken word to advance the Kingdom of God. Highly, highly recommended.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "teaching art with books kids love art elements appreciation and design with awardwinning books",
        "description": "Easy-to-use art lessons with award-winning books.",
        "authors": "['Darcie Clark Frohardt']",
        "infoLink": "http://books.google.com/books?id=zFARrhNG7roC&dq=Teaching+Art+with+Books+Kids+Love:+Art+Elements,+Appreciation,+and+Design+with+Award-Winning+Books&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "As far as teaching art concepts, principles, elements, style, this is a good book.BUT...I thought this book would include picture examples from the &quot;more than 20 Caldecott... books&quot; mentioned. The way the synopsis on the back of the book reads &quot;Using more then 100 illustrations and award winning children's books...&quot; is technically correct. There are pictures &amp; there are books, the pictures are just not OF or FROM the books. All the pictures were &quot;created by the author&quot;(p.xvi). The books are included in each chapter as &quot;Children's Literature Examples&quot; and given in a sort of bibliography type format. &quot;Famous...books...are listed. Finding examples can be frustrating...Don't spend a lot of time on it...&quot; (p.xv).Perhaps this was meant to foster trips to the library, but I am still dissapointed.",
                "review/helpfulness": "58/65",
                "num_reviews": 65
            },
            {
                "review/text": "This book is a great resource for learning how art is put together as well as experiencing different types of 2-dimentional art. This book is an easy read for the educator. Each chapter has projects for helping children understand the concept as well as recommendations for children books that put the art idea into action.The book begins with the elements of art such as line, shapes, texture and so on, this is followed by the principles of art like harmony, balance, movement ... and finally to artistic styles such as realism, impressionism, etc.Example: Chapter 8, Variety and Contrastexplains why artists use variety and contrast and what methods they use, references to fine art and children's literature are given, apply technique by drawing flies in different sizes, facing different ways and with different patternsNote: You do not need the reference books to use this book, it is only additional help. We did not use it and enjoyed the book.",
                "review/helpfulness": "51/52",
                "num_reviews": 52
            },
            {
                "review/text": "Not only is this an excellent way to bring art and literature together in the classroom, but the author proves each day how well her strategies work. I am a colleague of Darcie Frohardt and see the amazing results she gets from children every day. This book is for &quot;all&quot; teachers (not just art teachers), and the books she teaches from are readily available in your school library. In fact, you'll probably own most of them yourself. In a time when the arts are being threatened by the standardization of education, Darcie's book is a shining light. Go ahead, give it a try. You will be glad you did.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "Using more than one hundred illustrations and award-wining children's books, Darcie Frohardt provides classroom teachers with all the tools necessary for teaching art. The information, examples, project directions, and variety of choices showcased in Teaching Art With Books Kids Love: Art Elements, Appreciation, And Design With Award-Winning Books provides everything necessary for a successful, student-involving, fine art curriculum that will engender and enhance student creativity, grades K-5. Teaching Art With Books Kids Love is highly recommended for both public school and home schooling fine art curriculum development and implementation.",
                "review/helpfulness": "26/30",
                "num_reviews": 30
            },
            {
                "review/text": "Teaching Art with Books Kids Love presents the elements of art in a way that engages students and is clear enough for the 'artistically challenged' classroom teacher to follow! The project directions and examples are excellent. This is a great find for teachers who want to present a quality art program.",
                "review/helpfulness": "27/30",
                "num_reviews": 30
            },
            {
                "review/text": "I am very impressed with this book! It explains clearly how to introduce the elements of art to children - and the choice of literature is wonderful! I am not an artist but I found this book very user friendly, providing success for the teacher and for the students. It is refreshing to find a high quality book on art for children, instead of the usual &quot;cutsie sop&quot; that passes for children's art instruction.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Great connections of art and literacy. I highly recommend this book for art educators!!",
                "review/helpfulness": "12/16",
                "num_reviews": 16
            },
            {
                "review/text": "Teaching Art with Books Kids Love presents the elements of art in a way that engages students and is clear enough for the 'artistically challenged' classroom teacher to follow! The project directions and examples are excellent. This is a great find for teachers who want to present a quality art program.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I would recommend this book for elementary classroom teachers. It provides outstanding projects and ideas for integrating Art into Language Arts. The author does and excellent job of teaching the elements of art and principles of design in the art projects! I am an Art Teacher and have taught many of the projects in the book. All projects were successful!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book has a lot of ideas for lesson planning in the art room. It is divided into sections so that lessons are easy to find and also offers many great children's books to base lessons off of. GREAT!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "draw the line",
        "description": "Draw the Line is a powerful picture book about forgiveness from Kathryn Otoshi, author of the bestselling book One. When two boys draw their own lines and realize they can connect them together-magic happens! But a misstep causes their lines to get crossed. Push! Pull! Tug! Yank! Soon their line unravels into an angry tug-of-war. With a growing rift between them, will the boys ever find a way to come together again? Acclaimed author/illustrator Kathryn Otoshi uses black and white illustrations with thoughtful splashes of color to create a powerful, multi-layered statement about friendship, boundaries, and healing after conflict. A Kirkus Reviews Best Picture Book of 2017",
        "authors": "['Kathryn Otoshi']",
        "infoLink": "https://play.google.com/store/books/details?id=9Bs0DwAAQBAJ&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I was very disappointed with this book - disgusted, really. I've taught drawing seminars to elementary and high-school age children and have encountered youngsters with as much or more mastery-of-technique as the author of this book. The artwork by Mr. Soltero is amateurish at best, which can be OK if the descriptions and techniques are aptly described, but this is where the work really falls apart. ALL of the chapters, if you can call them that, are composed of random sketches with insightful &lt;read sarcism&gt; captions such as the following:Chapter on 'Animal Drawing': &quot;There is an inner beauty to all living and non-living things. Try to capture this in you drawings.&quot; - Brilliant!Altogether a very random &amp; sloppy job that any artist/author worth their salt would ashamed of releasing to the public.I don't know who the other reviewers are, but they are either THE author of the book, RELATED to the author of the book, or have never read any other art instruction book in their lives.If you're looking for a GREAT book on drawing, and I've read a lot of them, look no further than any of Jack Hamm's books, particularly his book on 'Drawing The Head &amp; Figure' - terrific stuff! However, ALL of Mr. Hamm's books are very instructive with 'to-the-point' explanation.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is a great. It covers information that you might not find in other books, copyright info., characters and scripts, duo tone. The drawings are beautiful, especially the animal and human drawings. The perspective section was helpful as I have dreaded and feared learning perspective. He shows you concisely how to do it. I followed along and was able to do it! The overlapping concept on pg. 37 is just great, it truly helped my drawing. The sequential art section is good for storytelling, and the inking page shows you the direction or how to move your brush or get the brush stroke you want.This book is great for beginners and professionals. It is easy to read and the drawings are just great.The book is a limited edition, and my copy came signed. Hey, this book has quotes in the back cover from Dr. Seuss and Frank Frazetta.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Theres alot of info and drawings in this book, well worth theprice. Mr. soltero also gives some good tips that you won't find in other books that obviously come from experience. Something youwill also notice is the use of more ethnic features and bodies.As well as different body types. Something really lacking in thehow-to art books of today. I like alot of the tone work Mr. Soltero does with pen and brush. Whats really interesting aboutthis book is the collection of pictures, they run from fine artto cartoon, anime, and watercolor. Its pretty neat to see allthis in one book, something i have'nt seen in any others.Which makes Mr soltero a very talented artist to me.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Emilio's message is that we can all become -- all already are -- artists, whatever our age or background, or style. His book's engaging, energetic visual presentations and clear, succinct text guide us through essential concepts and take us into different ways of seeing the world. Scattered here and there are intriguing, fun surprises, like the horse galloping across the top of the pages; and check out all that interesting activity on the serious student's desk as he studies (p. 58). Yet the price of the book is more than repaid by Emilio Soltero's 12-page (63 panel) book-within-a-book, &quot;The Story of Harriet Tubman.&quot; I can't stop returning to these stunning, elegant watercolor paintings that transform and enlighten. They moved me to finally pick up a brush and begin to paint, after years of wishing I knew how to draw but not knowing how to begin. And yes, I was also inspired by the energy of the joyful dancing girl on the last page who asks, &quot;Well, what are you waiting for? Start drawing!&quot;",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "The most helpful sections dealt with human anatomy, storytelling, and sequential art. The sequential art section dealt with different viewpoints, and explanations on splash pages. I am an animator and graphic artist and I recommend to all artists. The perspective section was also informative. The manga section has few pages but the author provided different ways to draw a manga figure, easy to complex styles.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Draw the Line covers a wide variety of drawing styles and has an indepth review of the drawing basics, plus it's loaded with great tips and techniques not commonly found in most &quot;how to draw&quot; books. A must read for all artists interested in drawing.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is strong in the anatomy section, including muscles and figure drawing. It also supplies great examples and art about making comics, and would go well with the Wizard basic training book, and the Andy Smith book, Dynamic Comic books. The author supplies good examples for the establishing shot. There are many other ideas and concepts, and it is quite diverse. This is what makes it unique. The gesture drawings are as powerful as the ones by Karl Gnass (Spirit of the Pose), specifically the drawings on pages 112-113. Gnass is also a great gestural artist. The book is geared for both professionals and beginners. Though the Manga section is officially covered in few pages, I believe the entire book will help the Manga artist (for instance the perspective part)as manga artists draw in many styles. There are manys tips and well worth the price of the book. I have quite a few art books and this one goes well with them.Other books to consider would be the Chelsea book on perspective, and the Jack Hamn books.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I am very impressed by this book. It really inspired me to continue with my art and to inspire others to become artists. I really loved the story of Harriet Tubman which not only utilizes some of the ideas presented but would be very useful for teachers to use in their lessons on Harriet Tubman to students. This book can help anyone tap into their artistic, creative side.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I am very impressed by this book. It really inspired me to continue with my art and to inspire others to become artists. I really loved the story of Harriet Tubman which not only utilizes some of the ideas presented but would be very useful for teachers to use in their lessons on Harriet Tubman to students. This book can help anyone find there artistic, creative side.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "publishing with students a comprehensive guide",
        "description": "A new world has opened to writers who wish to have their words turned into finished books. With technological advances in typesetting, printing, distribution, and sales, self-publishing has become a reality. But while converting your writing into a commercially available title may sound relatively easy--based upon the claims of some companies that offer this service--there are many important considerations you should be aware of before going to press. Publishing expert Dr. Jan Yager has created an easy-to-follow guide that will take you from a book's conception and writing to its production and sales. Whether your work is fiction or nonfiction, How to Self-Publish Your Book offers sound and proven advice at every turn, enabling you to avoid common pitfalls along the way to becoming a self-published author. The book is divided into three parts. Part One takes you through the initial manuscript preparation--setting your goals, writing, sequencing, editing, and proofing, as well as creating a business plan for your book's eventual release. Part Two focuses on the actual production of your book. It explains the importance of cover and interior design, what you need to know about producing physical books and e-books, and how to turn your title into an audiobook. Part Three provides key information on how to market and sell your book--subjects that are crucial to a title's success, but of which most writers have very little understanding. Also included is a valuable resource section that guides you to websites which offer essential information on self-publishing service providers, including complete self-publishing companies as well as freelance editors, proofreaders, printers, distributors, marketers, and publicists. Today, self-publishing workshops and lecturers charge hopeful writers hundreds of dollars, promising to turn their self-published books into bestsellers. The fact is that your book's chance of success starts at its origin, not with the finished product. However you choose to produce your book, whether through a self-publishing company or through separate services, here is a complete road map to what lies ahead--based not on hype or wishful thinking, but on Dr. Jan Yager's lifetime of experience in the world of publishing.",
        "authors": "['Jan Yager']",
        "infoLink": "http://books.google.com/books?id=tbjEtAEACAAJ&dq=Publishing+with+Students:+A+Comprehensive+Guide&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Publishing With Students: A Comprehensive Guide by Chris Weber (ESL teacher and Founder of the Oregon Students Writing &amp; Art Foundation) is a first-rate introduction and instruction text showing parents and teachers how to best help young people on their way to becoming the next generation of published authors. Individual chapters address the pros and cons of displaying students' work on the Internet, school newspapers and magazines, e-mail publication projects, crucial steps to successful bookmaking, and much more. Appendixes full of resources round out this informative, practical, &quot;user friendly&quot;, and highly recommended question-answering guide.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "From cover to cover, this is the BEST GUIDEBOOK for publishing that I've read for teachers and others who are interested in inspiring young writers (K-12) --our future authors, poets, journalists, research scientists, educators, and anyone who appreciates the art of communicating skillfully. It gives our students a REAL PURPOSE FOR WRITING. Every essay was filled with exciting and practical ideas that I wanted to apply immediately within my own classroom. They are written in a structure that is USER-FRIENDLY, showing you steps to take in producing student publications, interviewing people, and much more, while giving extraordinary examples from students around the world. In fact, I have already used much of the information with my students in their writing, such as the scientific inquiry journal publication 'Great Blue', written about by teacher, Mark Wagler and by using as models the stunning artwork, touching stories and poems written by students in the 'Treasures' publication series by Chris Weber. Please read and enjoy this unique and beautifully written book. I'm certain you will come away eager to apply what has been presented here. Your students will WANT TO WRITE, revise, and put their heart into their writing after you read PUBLISHING WITH STUDENTS!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the nude a study in ideal form bollingen series no 35 the a w mellon lectures in the fine arts 2",
        "description": "Issued in connection with an exhibition held Oct. 5, 2010-Jan. 17, 2011, Metropolitan Museum of Art, New York, and Feb. 23-May 30, 2011, National Gallery, London (selected paintings only).",
        "authors": "['Jan Gossaert', 'Stijn Alsteens', 'Nadine Orenstein', 'Lorne Campbell', 'Metropolitan Museum of Art (New York, N.Y.)', 'National Gallery (Great Britain)']",
        "infoLink": "http://books.google.com/books?id=3aikaSu3tokC&dq=The+nude%3B:+A+study+in+ideal+form,+(Bollingen+series,+no.+35.+The+A.+W.+Mellon+lectures+in+the+fine+arts,+2)&hl=&source=gbs_api",
        "categories": "['Art and design']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "THE NUDE: A STUDY IN IDEAL FORM, a classic investigation and summation, is one of scholar/historian Kenneth Clark's finest works - and that is high powered praise in view of all of his contributions to literature. Few writers inform with such dignity of prose, style, and warmth as Clark and THE NUDE is no exception. This handsome and illuminating volume dates back to 1953 and is based on six lectures given by Clark for the A. W. Mellon Lectures in Fine Arts at the National Gallery in Washington, DC. Clark opens his book with a lyrical treatise \"The Naked and the Nude\" in which he not only introduces his manner of examining the use of the nude as pictorial image for artists from ancient Greece through the Renaissance to the present, he wraps his scholarly information with personalized psychosocial commentary that is uniquely his own and allows the reader to settle in for the exploration ahead.Approaching first the male nude [\"Apollo\"] from the Kouros of 600 BC through the vases, sculptures, reliefs, and paintings from all periods of history, he then moves to two views of the female nude - Venus I [the celestial female form] and Venus II [the woman of earthly form]. Having laid the foundation for the use of the nude in general, he then addresses the artistic emotions of Pathos, Energy, and Ecstasy in a manner that is near novel-like in reading. He closes his lecture series/book with a thought-provoking discussion of how man has viewed the nude through history, vacillating between laud and honor to the depiction of guilt, of the human stain. And finally he demonstrates in \"The Nude As An End In Itself\" both the occult appropriation of repeated forms and the acknowledged plagiarism of the nude studies from the earliest to the current. The Book is generously illustrated but in the paperback version available the illustrations are in black and white only. This profound and warmly human book is a must for artists and art lovers alike. Highly Recommended. And as is so often the case, Amazon.com does its readers a great service by finding ways to make books of such importance as this available to the public.",
                "review/helpfulness": "32/34",
                "num_reviews": 34
            },
            {
                "review/text": "Whether you are a student of the arts, religion, history, or life you will learn from this work. Mr. Clark speaks with the authority of an educated and thoughtful expert on the subject and with the voice of a formidable author as well.His work is as densely packed with meaning as you might expect to find in the writings of Reinhold Niehbur yet is possessed of a wonderfully literary mask. The writing is so well done, one might accidently read right over the meaning in the haste of seeing what will come next.If you're the highlighting or underlining type, I'd recommend saving such marking for the second read as more of the true significance bubbles to the fore. Put aside your expectations of a &quot;typical&quot; art history text and prepare for an incredible enlightenment.Enjoy!",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "THE NUDE: A STUDY IN IDEAL FORM is one of scholar/historian Kenneth Clark's finest works - and that is high powered praise in view of all of his contributions to literature. Few writers inform with such dignity of prose, style, and warmth as Clark and THE NUDE is no exception. This handsome and illuminating volume dates back to 1953 and is based on six lectures given by Clark for the A. W. Mellon Lectures in Fine Arts at the National Gallery in Washington, DC. Clark opens his book with a lyrical treatise \"The Naked and the Nude\" in which he not only introduces his manner of examining the use of the nude as pictorial image for artists from ancient Greece through the Renaissance to the present, he wraps his scholarly information with personalized psychosocial commentary that is uniquely his own and allows the reader to settle in for the exploration ahead.Approaching first the male nude [\"Apollo\"] from the Kouros of 600 BC through the vases, sculptures, reliefs, and paintings from all periods of history, he then moves to two views of the female nude - Venus I [the celestial female form] and Venus II [the woman of earthly form]. Having laid the foundation for the use of the nude in general, he then addresses the artistic emotions of Pathos, Energy, and Ecstasy in a manner that is near novel-like in reading. He closes his lecture series/book with a thought-provoking discussion of how man has viewed the nude through history, vacillating between laud and honor to the depiction of guilt, of the human stain. And finally he demonstrates in \"The Nude As An End In Itself\" both the occult appropriation of repeated forms and the acknowledged plagiarism of the nude studies from the earliest to the current. The Book is generously illustrated but in the paperback version available the illustrations are in black and white only. This profound and warmly human book is a must for artists and art lovers alike. Highly Recommended",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "the nude a study in ideal form bollingen series xxxv2",
        "description": "From the art of the Greeks to that of Renoir and Moore, this work surveys the ever-changing fashions in what has constituted the ideal nude as a basis of humanist form.",
        "authors": "['Kenneth Clark']",
        "infoLink": "http://books.google.com/books?id=v4YVBgAAQBAJ&dq=The+Nude:+A+Study+in+Ideal+Form.+(Bollingen+Series+XXXV.2)&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "THE NUDE: A STUDY IN IDEAL FORM, a classic investigation and summation, is one of scholar/historian Kenneth Clark's finest works - and that is high powered praise in view of all of his contributions to literature. Few writers inform with such dignity of prose, style, and warmth as Clark and THE NUDE is no exception. This handsome and illuminating volume dates back to 1953 and is based on six lectures given by Clark for the A. W. Mellon Lectures in Fine Arts at the National Gallery in Washington, DC. Clark opens his book with a lyrical treatise \"The Naked and the Nude\" in which he not only introduces his manner of examining the use of the nude as pictorial image for artists from ancient Greece through the Renaissance to the present, he wraps his scholarly information with personalized psychosocial commentary that is uniquely his own and allows the reader to settle in for the exploration ahead.Approaching first the male nude [\"Apollo\"] from the Kouros of 600 BC through the vases, sculptures, reliefs, and paintings from all periods of history, he then moves to two views of the female nude - Venus I [the celestial female form] and Venus II [the woman of earthly form]. Having laid the foundation for the use of the nude in general, he then addresses the artistic emotions of Pathos, Energy, and Ecstasy in a manner that is near novel-like in reading. He closes his lecture series/book with a thought-provoking discussion of how man has viewed the nude through history, vacillating between laud and honor to the depiction of guilt, of the human stain. And finally he demonstrates in \"The Nude As An End In Itself\" both the occult appropriation of repeated forms and the acknowledged plagiarism of the nude studies from the earliest to the current. The Book is generously illustrated but in the paperback version available the illustrations are in black and white only. This profound and warmly human book is a must for artists and art lovers alike. Highly Recommended. And as is so often the case, Amazon.com does its readers a great service by finding ways to make books of such importance as this available to the public.",
                "review/helpfulness": "32/34",
                "num_reviews": 34
            },
            {
                "review/text": "Whether you are a student of the arts, religion, history, or life you will learn from this work. Mr. Clark speaks with the authority of an educated and thoughtful expert on the subject and with the voice of a formidable author as well.His work is as densely packed with meaning as you might expect to find in the writings of Reinhold Niehbur yet is possessed of a wonderfully literary mask. The writing is so well done, one might accidently read right over the meaning in the haste of seeing what will come next.If you're the highlighting or underlining type, I'd recommend saving such marking for the second read as more of the true significance bubbles to the fore. Put aside your expectations of a &quot;typical&quot; art history text and prepare for an incredible enlightenment.Enjoy!",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "THE NUDE: A STUDY IN IDEAL FORM is one of scholar/historian Kenneth Clark's finest works - and that is high powered praise in view of all of his contributions to literature. Few writers inform with such dignity of prose, style, and warmth as Clark and THE NUDE is no exception. This handsome and illuminating volume dates back to 1953 and is based on six lectures given by Clark for the A. W. Mellon Lectures in Fine Arts at the National Gallery in Washington, DC. Clark opens his book with a lyrical treatise \"The Naked and the Nude\" in which he not only introduces his manner of examining the use of the nude as pictorial image for artists from ancient Greece through the Renaissance to the present, he wraps his scholarly information with personalized psychosocial commentary that is uniquely his own and allows the reader to settle in for the exploration ahead.Approaching first the male nude [\"Apollo\"] from the Kouros of 600 BC through the vases, sculptures, reliefs, and paintings from all periods of history, he then moves to two views of the female nude - Venus I [the celestial female form] and Venus II [the woman of earthly form]. Having laid the foundation for the use of the nude in general, he then addresses the artistic emotions of Pathos, Energy, and Ecstasy in a manner that is near novel-like in reading. He closes his lecture series/book with a thought-provoking discussion of how man has viewed the nude through history, vacillating between laud and honor to the depiction of guilt, of the human stain. And finally he demonstrates in \"The Nude As An End In Itself\" both the occult appropriation of repeated forms and the acknowledged plagiarism of the nude studies from the earliest to the current. The Book is generously illustrated but in the paperback version available the illustrations are in black and white only. This profound and warmly human book is a must for artists and art lovers alike. Highly Recommended",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "learning by heart teachings to free the creative spirit",
        "description": "Tap into your natural ability to create! * Engaging, proven exercises for developing creativity * Priceless resource for teachers, artists, actors, everyone Artist and educator Corita Kent inspired generations of artists, and the truth of her words \"We can all talk, we can all write, and if the blocks are removed, we can all draw and paint and make things\" still shines through. This revised edition of her classic work Learning by Heart features a new foreword and a chart of curriculum standards. Kent's original projects and exercises, developed through more than 30 years as an art teacher and richly illustrated with 300 thought-provoking images, are as inspiring and as freeing today as they were during her lifetime. Learn how to challenge fears, be open to new directions, recognize connections between objects and ideas, and much more in this remarkable, indispensable guide to freeing the creative spirit within all of us. With new material by art world heavyweights Susan Friel and Barbara Loste, Learning by Heart brings creative inspiration into the 21st century!",
        "authors": "['Corita Kent', 'Jan Steward']",
        "infoLink": "http://books.google.com/books?id=X7fcwAEACAAJ&dq=Learning+by+Heart:+Teachings+To+Free+The+Creative+Spirit&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "During my doctoral work in Leadership Studies, my literature review on Creativity that led me to Kent/Steward's coloful and wise book. Corita Kent was a woman way ahead of her times, and Jan Steward did the world a favor by collaborating with this amazing artist to share with the world her engaging and charismatic teaching methodology.This book is a must for all teachers of art, women's studies professors, and anyone interested in creativity, multiculturalism, and leadership. Why don't they republish this treasure so that new readers can access it for a reasonable price? It is worth the $..., but unfair to the humanities!",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "Sad that this book is hard to find as it is one of the livliest books around on the subject of creativity! Filled with wonderful words of inspiration, pictures and photos it takes the reader through many aspects of artistic creativity. The book, itself a playfulrealizaton of creativity, brings the teaching brilliance of Corita Kent to all who read it.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "Rarely have I met a book that invites me to join in such a luscious romp in creativity. Since this book found its way to me 10 years ago, I keep it close at hand and revisit its pages with the same pleasure as visiting a dear friend. The writing style and images are inviting, informative and inspiring.This is a valuable tool abundant with ideas for the artist as well as the educator who dreams of a rejuvenation in their teaching and learning. I wish to see this book in print once again, to continue to inspire the joy found in true creativity.As Education Director for a large arts organization, I desperately need 30 copies to pass on to our teaching artists to ignite the fires we all kindle deeply inside. And then of course, I'll need a spare to takes its place alongside my own rather tattered and loved - Learning by Heart.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "I am using Learning by Heart as a resource with my graduate students in a course called &quot;Research and Teaching in the Humanities&quot;. The book has fabulous activities, thoughts, and ideas for encouraging the creative process. I would have used it as the textbook, had it been available! Please encourage the publisher to reissue this wonderful, insightful book!",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "Since I bought this book about eight years ago, I've loaned it to many who have been loath to return it to me. I continue to hope that it will be republished. I think it deserves a revival. I highly recommend it to anyone who is interested in exploring their own creativity or enabling others creativity. This is a resource that should be availble for a long time. Please let me know as soon as it becomes available again.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Corita Kent was one of the great American artists of the XXth Century. She made hundreds of works of art in her lifetime, designed books and posters and was a legendary teacher. She taught at Immaculate Heart in Los Angeles in the 1960's. In this concise and wonderfully illustrated book her teaching lives on for many new students and readers to enjoy. This is a real treasure and the exercises that Corita Kent and Jan Steward have put together in this book make it valuable and inspiring.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I bought this book because I am an Gen-X art teacher who saw it in the library of an older teacher. It was hard to find, but I devoured the entire book when it arrived. It's beutiful and insightful, and an inspiration to art teachers and artists everywhere. Corita Kent has touched many of us in the education community, and she guides teachers to foster the bravery to chart into the waters of creativity. I wish I had had the priveledge to work with Corita Kent. Buy this book and cherish it.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Everyone with a mind is creative. Now in a newly updated and expanded second edition, \"Learning by Heart: Teachings to Free the Creative Spirit\" is a guide to embracing the creative energies within everyone, and unleashing them to create whatever it is they seek to create. With a focus on the visual arts, \"Learning by Heart\" is a step by step guide to the many aspects of art and will do much in educating and inspiring readers to push forward. \"Learning by Heart\" is a top pick for those seeking a creative outlet.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Corita was an artist who was so ahead of her time. She, virtually, invented the whole concept of teaching with a multicultural, cross curricular approach. She used poetry, prose, folk art and film and tapped into mass media to teach her students.Corita used techniques to teach her students and left a mark with her own art work, influencing advertising with her use of caligraphy and popular media slogans.This book describes her approaches and tries to give the reader a philosophy to use when approaching art. This is not just a how to do art book, but more of a how to think about the world and art.The messages in this book by the author, Jan Steward, make this book worth reading.It will wake up the artist inside of you.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is pretty amazing, as was Sister Corita. I love her approach and reflections on art, the nature of art, and the creative spirit. It is such a rare and refreshing experience to come across an art book that carries with it so much truth, power, and depth. The exercises are taken from ones that she actually taught to her students and going through them really does free the spirit to experience the simple yet blessed joy of not only creating, but observing creation as well. I come back to this book every so often when I feel like I need to fill the well and it never disappoints. I am so glad this was republished, grab it while you can before it disappears again!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "warner brothers animation art",
        "description": "Looks at animation cels as art and introduces Warner Bros.' key people and controversies.",
        "authors": "['Jerry Beck', 'Will Friedwald', 'Warner Bros. Cartoons']",
        "infoLink": "http://books.google.com/books?id=ax0RAQAAMAAJ&dq=Warner+Brothers+Animation+Art&hl=&source=gbs_api",
        "categories": "['Performing Arts']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book was well done and very appealing to the eye and informational to read. It gives the reader some good history of Warner Bros. cartoons and the rarely credited artists. Through-out the book there are pointers on how to draw various characters, but unfortunatly they are not as complete as one might have it. However, the overall is terrific.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you like to own some really cool prints of Bugs Bunny, Tweety, or just the old folks from the Warner Bros. Studio, this is the book! It goes through the history of the animation studio and its founders. Chuck Jones is similar to Walt Disney, he had his own crew of animation masters to create a whole new perspective of cartoon.One disappointing about this book is that its published date is 1997. Sadly &quot;The Iron Giant&quot; (released 1999) and &quot;Cats Don't Dance&quot; (1997) did not make it to the book; two of the most successful WB animated feature film. However, it is still a book to own and look for inspiration.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a great book for animation geeks. You get to see all sorts of animation art by Chuck Jones, Bob Clampett, Tex Avery, Friz Freleng, and Robert McKimson. There's even some pull-out pages with huge art pictures. There's also great profiles on a good amount of characters and their creators- the directors, the writers, and the voices/sound crew. I would only recommend a filmography for the book, rather than the \"highlights\" in the back.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "animation writing and development from script development to pitch focal press visual effects and animation",
        "description": "The art. The craft. The business. Animation Writing and Development takes students and animation professionals alike through the process of creating original characters, developing a television series, feature, or multimedia project, and writing professional premises, outlines and scripts. It covers the process of developing presentation bibles and pitching original projects as well as ideas for episodes of shows already on the air. Animation Writing and Development includes chapters on animation history, on child development (writing for kids), and on storyboarding. It gives advice on marketing and finding work in the industry. It provides exercises for students as well as checklists for professionals polishing their craft. This is a guide to becoming a good writer as well as a successful one.",
        "authors": "['Jean Ann Wright']",
        "infoLink": "https://play.google.com/store/books/details?id=Se-DPhymSeIC&source=gbs_api",
        "categories": "['Computers']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "The book covers tons and tons of topics, which is good for a person with no background in animation writing. But the topics written about, from dialogue to outlining, come with no context, no examples to back up what the author is talking about. Wright writes \"Keep your characters consistent. They must be true to their core traits and to what has made them who they are.\" An example from a current or classic cartoon is direly needed. This happens throughout the book. Under the subheading Conflict Can Reveal Information in the dialogue chapter, she writes \"conflict in dialogue...is a good way to get information out and keep it interesting.\" How? Once again this book screams for examples.The book trys to explain every thing and any thing about animation. A daunting task. But in the process, every thing seems trite. The chapter on writing features, aka movies, is skimmed, and after reading it, will not make your more apt at writing animation films. Scriptwriting for film is different, in many aspects, from tv animation, and in this book it's made to sound that it's the same.Overall the book is informative, but for someone who grew up with Scooby Doo, He-Man, Thundercats and saw every Disney film and could write endless thesis on Scooby Doo's tremendous appetite, this book lacks substance.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "Jean Ann Wright has written a valuble handbook for anyone interested in creating animation scripts.It offers fun and practical overviews of the various aspects of development, from characters to plot to style to pitching.Each information-packed chapter includes a marvelously detailed checklist to inspire your creativity, diagnose story problems, and guide the fixes.I found Animation Writing and Development to be like a film school education in a book - comprehensive and confidence-building.Currently working as a writer-for-hire and consultant on three different animation stories, I found Jean Ann's suggestions insightful and invaluable.Animation Writing and Development will have a permanent place in my film book library, and it should in yours, too.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I teach an animation writing class and have used Wright's book for the past two or three years. It not only contains useful insights into animation writing but also provides perspective through such topics as the history of animation and understanding the tastes of various audiences according to age group. I've also used her chapter on pitching a script for an oral communications course. However, I often find that her paragraphs aren't all that coherent in that she jumps from idea to idea. It sometimes seems as though a lot of this is first-draft material. Perhaps the next edition will be more readable. Overall, this is a useful supplement to other materials. I haven't found a perfect animation writing book yet, so this one will do for now.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Every industry has its own special requirements. This book \"Animation Writing and Development\" by Jean Ann Wright should be titled \"A Manual for the Working World of Animation\". There are not many books that give all the working aspects of a creative vocation. Wow! What to do, how to do it, and still nurture creative desires! Being a college art instructor, all my classes will know about the existence of this fine work. B. McInerney",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "61 traits of writing the complete guide for the primary grades",
        "description": "Describes the traits of good writing in any genre and includes information on assessing student writing skills, lesson planning, and activities.",
        "authors": "['Ruth Culham']",
        "infoLink": "http://books.google.nl/books?id=cpyJGwAACAAJ&dq=6+1+Traits+of+Writing:+The+Complete+Guide+for+the+Primary+Grades&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I'm sorry, but 6+1 equals 7. Just kidding- I understand why she called her book that. This is the best writing book I have come across for primary grades. Easy to use lesson plans, examples of student work, and book title suggestions all make this the perfect writing resource. If you want to purchase the titles referenced in the book, there is a website that I found that sells them in a set, plus a lot of other stuff: www.whoossmart.com. Check them out!",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "If ever there was a book that a teacher could take off the shelf and use, this is the one. Ruth Culham has written a book that should be on every teacher's desk. The format is very easy to follow with lots of GREAT ideas that can be used immediately with your students. Not only is it the perfect writing guide for primary teachers, it gives a scaffolding for intermediate teachers to understand how primary students come to be writers.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "\"Ruth Culham masterfully unlocks the magic of writing for teachers and students alike. She's created an invaluable resource for primary teachers to use in guiding children as they begin the journey of learning to write. Included are suggestions on what to say to young writers, teaching ideas, examples of student work, scoring guides to assess primary students' writing and much, much more! Ruth's book will touch your heart and leave you excited about writing. Voice in non-fiction? You bet! Anything's possible, once you know the traits.\"--- Libby Jachles , Instructional Specialist, Council Rock Primary School, Brighton Central School District, Rochester, NY",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I agree with the positive reviews. The concepts and lessons are great. However, this book must be \"all the rage\" because when I went online to purchase the trade book from the first lesson plan, I could not find it for less than $50! Of course, you can substitute in your own book selections, but if you want to rely on the lessons as written you MAY not be able to find every book. [...]",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "We are a K-3 public school with about 400 students. We purchased a book for each staff member and are using it as a \"book study\" reading and discussing a chapter a week as a staff. It has been very helpful in assisting us to improve student writing.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have found that implementing strategies and lessons from this book have helped my students better understand what is expected of them. It breaks down 7 elements of writing into teacher and kid friendly lessons.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "We asked. We pleaded. We begged, \"Pretty pleeease.\" Ruth Culham responded to our request with great enthusiasm with 6+1 Traits of Writing: The Complete Guide for the Primary Grades. And teachers across the globe cheered, \"Wahoo!\" Finally, a resource book for primary educators who have been searching for child tested ideas that tackle instructional strategies and assessment techniques in one comprehensive book. Thank you, Ruth, for doing a wonderful job of explaining each trait, equipping us with developmentally appropriate focus lessons, and reminding us that teaching writing to young authors is a process in which they need plenty of practice and opportunities, and an extra helping of patience on our part doesn't hurt. This must have book for all teachers - novice and experienced alike - won't be another resource that is shelved after a quick glance. It will be close at hand as it is used throughout the year to help develop the talents of young writers.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a fantastic tool for lower elementary teachers. This is how writing should be assessed. This book is a practical tool. It includes practice assessments and lots of student example papers to help you better understand each trait and how to evaluate it. It also includes many wonderful teaching ideas and picture book examples!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a terrific resource and one that I have been using all year in my classroom. We have begun using this book as a book study for a Professional Learning Community at our school for those teaching K-3. My Grade One class has never loved writing more and their enthusiasm for writing has been tremendous.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a great book with LOTS of useful information and lesson plans. It really helped me to understand the 6 Traits better, and how to go about teaching them to my kids. If your new to 6 traits this is a must have!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "men who have walked with god being the story of mysticism through the ages told in the biographies of representative seers and saints with excerpts from their writings and sayings",
        "description": "Sheldon Warren Cheney was an American author and art critic, born in Berkeley, California. Cheney was one of the most significant pro-modernist theatre and art critics of the early twentieth century. He helped introduce European modernist practices in theatre to the United States. 'Men Who Have Walked with God', traces mysticism through history, concentrating on eleven men from Lao-Tse and the Buddha to Jacob Boehme and William Blake. This is a book about certain artists and poets and spiritual prophets who have been close to God in the special mystic way. They have known the experience of union with God. The writers and artists among them have believed, in some cases, that their writings and pictures were composed as if by divine dictation; or they have thought of art as a special mode of revelation of the rhythm or vital order of the universe.",
        "authors": "['Sheldon Cheney']",
        "infoLink": "https://play.google.com/store/books/details?id=HNx9CgAAQBAJ&source=gbs_api",
        "categories": "['Body, Mind & Spirit']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "A followup to my previous review... The writing in the book is still wonderful but the publishing is of the worst quality. It looks like the 1945 hardcover book has been photocopied and black and white stats made of the illustrations (which were black and white photographs of fine art prints). Since I own a copy of the 1945 hardcover edition, I compared page by page, and it definitely does look just like a copy job. The cover is flimsy and unattractive. I was actually wondering if it was legally published or stolen, but I don't know how to find out. The star I gave it was for the writing, not the publishing! What a shame to put out such a pitiful edition of a beautiful book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a classic book by a prominent theatre and arts historian who also seems to have had an interest in, and insight into, the mystical life. I bought a second-hand copy 25 years ago and it has stayed in my library while countless books have come and gone. Finding it in print, I am buying a copy for a friend.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "creating characters kids will love",
        "description": "Alphin's advice on how to successfully write a book focuses on how characters, more than any other story element, draw kids to the page and keep them hooked from the beginning to end.",
        "authors": "['Elaine Marie Alphin']",
        "infoLink": "http://books.google.com/books?id=i3sHAAAACAAJ&dq=Creating+Characters+Kids+Will+Love&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "What do you do when you don't feel like writing? You go online and review your favorite writing books on Amazon.com!Creating Characters Kids Will Love is really a must-have for the wanna-be children's writer. This book and \"Story Sparkers\" (also available here--look for the set and save money!) are the best write-for-children guides I own, and I own nearly every one on the market!The fun large format makes this book feel sort of like a workbook (though it really isn't), and it's easy to just flip to a section and start reading some helpful info without starting at the beginning. This is how I find myself reading this books much of the time (I get stuck writing and take a break by just reading some advice out of one of these). There's some very good stuff here, and lots and lots of recommendations for books and magazines to read, if you're the kind who'll actually go find the stuff!This book concentrates on character development, with some how-tos on plot structure and conflict (as they relate to character development!) thrown in. Also, if you're interested in writing true stories or maybe historical fiction, there are chapters for you. All in all, it's really a good read. Even if you don't relate to the author's own examples of writing, you'll come away with a better idea of what kids (and publishers) expect in your manuscript. Good luck!",
                "review/helpfulness": "59/67",
                "num_reviews": 67
            },
            {
                "review/text": "I'm very glad I ordered this book as an interlibrary loan instead of buying it. What a disappointment it was, from the disturbing cover art to the 50's clip-art illustrations to the hodge-podge, disorganized text. In a series of repetitive, higgledy-piggledy chapters, the author recommends the reader read specific children's books in order to \"notice\" a single thing about them (eg \"See how Gene and Phinny are best friends--who turn out not to know each other at all\") and gives assignments which mostly have to do with keeping a journal of memories from one's own childhood... and then she makes one of the most appalling errors I've seen in the literature on children's literature.On page 125, she writes that Harry Potter is \"bullied by Malloy and Snipes\". Now I can understand not liking Harry Potter enough to read it, but in that case, why use it as an example? And surely the name of Snape, if not Malfoy, has entered the zeitgeist by now to the extent that most people know it? This was where she finished losing me.She began losing me on the page where she suggested that the hopeful writer visit a school and ask lots of questions about the children's daily schedule. I've worked in the public school system. A person who did this would probably excite quite a bit of suspicion and might end up getting a visit from the police.The book may contain material that is new to a beginner, but the difficulty of ferreting it out may daunt some readers. The last section of the book is on writing nonfiction, which may not be of much interest to those who have chosen to read a book on creating characters.",
                "review/helpfulness": "31/42",
                "num_reviews": 42
            },
            {
                "review/text": "This is a very good source book for any one who wants to write for children, or have a main character that is a child.It really makes you think and gives you very good insights on children. It's also very easy to read and enjoyable.",
                "review/helpfulness": "22/26",
                "num_reviews": 26
            },
            {
                "review/text": "I recommend this book to anyone thinking about writing for children and anyone who currently writes for children. The book starts with the basics and builds towards the end. It is easy to understand with plenty of exercises to get those wheels spinning. Great for those interested in picture books, middle grade and young adult novels. A must have for a writer's library!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is more like a class than just a book. It's full of great information and practical exercises to put them into place right away. I spent a few days reading it and doing the exercises and found it invaluable.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "how to write book reports 3e how to write book reports 3rd ed",
        "description": "Book reports are a great way for young people to share their thoughts about books they have read. The activities in this book will help readers develop the skills needed to identify important information from a text and write a clear and concise book report.",
        "authors": "['Cecilia Minden', 'Kate Roth']",
        "infoLink": "https://play.google.com/store/books/details?id=Wmm7BgAAQBAJ&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "For all of us who have reviewing as a hobby - and especially for college students, to whom this work is targeted to a text that shows the correct way to present an opinion is a godsend. In today's world, most of us are eager to express our feelings, to communicate our own impressions on everything that surrounds us. Sadly, a lot of our credibility slips through the cracks because of our own inability to present a valid argument, independently of it being true or not (after all, who owns The Truth?). As stated in Chapter 1, under the title of &quot;The rewards of writing reviews&quot;, &quot;You will learn to analyze your tastes, your likes, and dislikes, and back up your statements of opinion with sound reasoning&quot; (Page 4).&quot;How to write book reports&quot; includes all the tools and suggestions needed for effective reviewing. I liked very much the idea of presenting the &quot;History of the Essay&quot;, as a reference on how it all began, since right up to the sixteenth century, as the author points out, everything that was considered culturally acceptable was always written in verse. It was since then, that qualified reviewers had been relied upon for almost everything mankind has been interested in trying. Sova devotes a whole chapter to the qualifications of the reviewer, be he an expert scholar or a starting student looking for good grades. Organization is the key not only of effective review-writing but also of everything that makes a good impression. The book divides the actual task of writing the report into three phases: preparing, organizing and writing it, providing in this way an actual blueprint for a flawless work. There are also suggestions on how to review the different literary genres, and an Appendix with further exercises to be done either orally or written, to provide fresh outlooks to the task. To give practical examples, a few sample reviews are provided; of a novel, a play, a short-story collection and a biography.I hesitated at first about buying this slim volume because I saw it too high school, instead of professionally, oriented. Once I looked at its contents, I felt almost sure I had made a good choice. After having started to read it, I knew I had indeed purchased a simple but valuable volume. The book takes the fear (and boredom as well), out of reviewing assignments. The techniques suggested can be applied not only to literature but to anything related to art and culture, e.g.: music, cinema, graphic arts, etc. Dawn Sova intends to make the task of writing reviews an enjoyable experience, as she puts it herself &quot;Reading, especially outside reading, should be fun&quot; (Page 3). Throughout the book and in only ninety pages, she achieves this with a bang.As a final suggestion, I would also recommend that you visit the publisher's website, called The Education Supersite, especially if you are just starting your own college period. It can be an invaluable resource as well if you are planning to go back to school, to find out about everything from financial aid to test preparation and universities that offer all types of online degrees.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "You already know how to write book reports if you can say what you dislike about a book or why you like it. Book reporting blends opinions with details: you take personal reactions based on your experiences and knowledge from life and other books; then back them up with facts and incidents from the book and with logic and reasoning. Along the way, you need to think not only what the book was about but also why it was written: for example, literature can bring out emotions or teach us something. So in the end, you want to say if the book did what the author wanted it to and if it is worth reading: these are the last thoughts that you leave with the reader. Harry Teitelbaum writes so well that what he says can be applied to any kind of writing, and I like to think that book reporting is the next best thing to the actual writing. His book leads in to other books on short, to the point writing: Mervin Block's WRITING BROADCAST NEWS, Syd Field's SCREENPLAY, Louisa Peat O'Neil's TRAVEL WRITING, and Elizabeth Penfield's SHORT TAKES.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "There are few books on the market today with information about writing professional book reviews. How to Write Book Reports by Harry Teitelbaum is a reference device, written with the high school or college student in mind, but can be a handy tool for the discerning reviewer. The author actually explains the difference between a book report and a book review, and shares the rewards of writing reviews.Because it is written for student use, the general focus is on book reports in essay form that would be graded by a teacher or professor. Be prepared to take a nostalgic journey back to high school English class, complete with grammar lessons. However, the outlined essay form can be a useful plan for organizing thoughts on an ungraded book review. The same rules a student would follow while writing a report can assist in creating a polished review that lends credence to the reviewer's opinions.Teitelbaum advises the reader to take notes as they read. He provides several lists of questions to consider that generate thoughtful review material. These questions could be the most beneficial tool for the professional reviewer, as they are a springboard for critical analysis. For all writers, a list of proofreading symbols for editing is included at the back of the book. (Although, I wish the author would have taken a bit more time to proofread his own work. On page 30, he refers to author Stephen Crane as a female.)How to Write Book Reports would be a helpful addition to any English professor's teaching curriculum. It shows the student how writing book reports and reviews can be a fulfilling task beyond the grade the instructor assigns. For those who have already discovered the joys of reviewing, this book can be an important aid for honing writing skills.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "teaching writing skills with childrens literature",
        "description": "Using picture books as models is a powerful way to teach key expository and narrative target skills. Step-by-step directions and charts, with quality children's literature used as models, help you set up and manage effective 45-minute long writing workshops.\" Also includes extensive lists of other children's literature with their recommended Target Skill application. Teach brainstorming, focus, organization, elaboration, and writing conventions using literature as models. Primary and intermediate-level lessons for each of 20 models allow you to customize your writing workshops to the needs and abilities of your K-5 students.",
        "authors": "['Connie Campbell Dierking', 'Susan Anderson-McElveen']",
        "infoLink": "http://books.google.nl/books?id=SkOERHb8ZSAC&dq=Teaching+Writing+Skills+With+Children%27s+Literature&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This Book was written by two teachers from my son's elementary school. They have given workshops about just this subject. FANTASTIC. Mrs Dierking is my sons first grade teacher. She is an incredible help to both her students and their parents. My son made honor roll and reads at level 18, he writes wonderful stories in his journal. The book that they have written is a fantastic guide for parents and teachers alike. Not that I'm partial or anything :0) ENJOY.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I work as a writing specialist at an elementary school and I recently purchased this book to use with students in both primary and intermediate grades. Teaching Writing Skills With Children's Literature is packed with practical lessons to use in teaching the elements of writing. The lessons are well written and easy to use. Ms. Dierking and Ms. McElveen have done a fantastic job of bringing together literature and writing skills. Since purchasing my first copy I have bought two more to share with fellow teachers. I hope you enjoy it as much as I have.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Of all the books I have encountered that use picture books to teach writing, this one has been the most helpful.My students have not only progressed but have thoroughly enjoyed the experience!!!! Denise Goforth - educator",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "children and their art",
        "description": "A trusted guide and companion for current and future art educators, CHILDREN AND THEIR ART presents a professional approach to teaching art consistent with national standards for student learning. This Ninth Edition is targeted at middle level and elementary schools. The authors are experienced as art teachers in the public schools and have a broad knowledge about school art programs. The Ninth Edition provides updated developments in theory, research and practices, with a strong emphasis on how digital technology provides new ways of teaching art. The most comprehensive textbook available for teaching art education methods, CHILDREN AND THEIR ART covers all aspects of teaching art in the elementary and middle school classroom: the basic principles and goals of art education, the characteristics and needs of children as learners, the core principles of art as a subject--aesthetics, principles of design, art history, new developments in art media and technology. It also covers all aspects of instruction: curriculum planning, sample lessons, suggested readings, and internet resources. Among numerous updates throughout the text, the Ninth Edition features a brand-new chapter on new media in art education with 22 new images. It features the use of digital technology in elementary and middle school classrooms and examples of digital art created by students. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
        "authors": "['Michael Day', 'Al Hurwitz']",
        "infoLink": "https://play.google.com/store/books/details?id=ATs9AAAAQBAJ&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a great book to use in a pre-service teacher education program. However, I am a long-time art educator and I still refer to it because it has a wide range of information on issues we encounter every day. This year I am teaching the art class for undergraduate elementary teachers and it is proving a very valuable resource. It is written in a readable, highly practical way with lots of examples that make adding art into an elementary curriculum not seem so foreign or so daunting. I do feel that there is a need for other supplemental reading and resources to accompany this text, but it is a great overall art education text, especially for the generalist teacher.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Children and Their Art is the most comprehensive textbook available for teaching art education methods. This bestselling textbook covers all aspects of teaching art in the elementary classroom: the basic principles and goals of art education, the characteristics and needs of children as learners, the core principles of art as a subject-aesthetics, principles of design, art history, art media-and all aspects of instruction-curriculum planning, sample lessons, classroom management, and assessment. The seventh edition has been thoroughly updated and includes coverage of the National Standards for Art Education as well as the impact of postmodern thought on the practice of art education. It also provides a concise overview of child development theories and the latest findings on child development and brain research, including Howard Gardner's theory of Multiple Intelligences.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "guiding readers and writers grades 36 teaching comprehension genre and content literacy",
        "description": "Describes what is necessary to have a quality literacy program in the upper elementary grades.",
        "authors": "['Irene C. Fountas', 'Gay Su Pinnell']",
        "infoLink": "http://books.google.com/books?id=ImmeQgAACAAJ&dq=Guiding+Readers+and+Writers+(Grades+3-6):+Teaching,+Comprehension,+Genre,+and+Content+Literacy&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Again, Fountas and Pinnell have helped teachers with their incredible insight on educating children. This time their help/advice/knowledge focuses on grades 3-6 but do not let that stop you if you teach another grade level. Their information on the essential components of a quality literacy program is true for any grade level. Fountas and Pinnell offer suggestions for effectively helping readers and writers who are not meeting &quot;standard&quot;. These suggestions are specific and establish teaching practices that will help all readers and writers. They also give many mini lesson ideas and great literature connections that make a teacher's job easier. The appendices include forms for language/word study for both reading and writing and for literary assessment. Once again, their book ends with a valuable book list that is leveled. This book is an essential resource for all teachers.",
                "review/helpfulness": "71/74",
                "num_reviews": 74
            },
            {
                "review/text": "Authors Irene Fountas and Gay Su Pinnell have given language arts teachers a real gem of a resource.Guiding Readers and Writers (Grades 3-6) contains a wealth of ideas that will inspire students to become more literate. I am a teacher of children with mild to moderate learning disabilities who plans on using this book as a springboard to teach Language Arts to 4th and 6th graders this fall. This summer, this book has proved to be a priceless resource in teaching reading in a summer school program for learners who are able to decode, but have a difficult time making the connection from print to meaning.I have literally seen my classroom transformed as I have engaged the students in minilessons, conferences, group sharing and response journals all for the purpose of building a community of learners. Taking this book, and utilizing a constructivist approach, my classroom has become a place where each child is valued, encouraged to express him/herself, take risks, and celebrated for their unique perspective on the world.Like I said, I have been using this resource for teaching summer school to children from regular education classrooms, but I am certain that my students who are on IEPs, for one reason or another, will also be intellectually stimulated by these, and many more methods this book has. I will be curious to see how end of year results compare with the baseline data I take in Aug. and Sept.I am quite certain that Guiding Readers and Writers Grades 3-6 by Fountas &amp; Pinnell will make a difference.",
                "review/helpfulness": "57/59",
                "num_reviews": 59
            },
            {
                "review/text": "If you have been wanting to convert your classroom into a reading/writing workshop but haven't known how to start, _Guiding Readers and Writers: Grades 3-6_ is the book for you! Authors Irene C. Fountas and Gay Su Pinnell have created a comprehensive manual for establishing a reading/writing community -- a place where students can spend two and a half to three hours a day engaged in authentic reading and writing.Teachers who are already using a workshop approach are likely to find much in _Guiding Readers and Writers_ that will make their job easier. Even teachers of younger and older students will find many practical suggestions to implement.Fountas and Pinnell see the goal of language arts instruction in the intermediate grades to be the creation of lifelong readers and writers. They structure the language arts class in a three-block framework: a sixty-minute reading workshop, a sixty-minute writing workshop, and a thirty- to sixty-minute language/word study segment (including spelling, vocabulary, decoding, and more).In addition to providing a treasure trove of information, Fountas and Pinnell have produced a book that is remarkably readable and user-friendly. The two-column format is extremely helpful. In addition, frequent headings, bullet points, and graphics help you to efficiently get the information you need.With photos and other graphics, Fountas and Pinnell show you how to organize your classroom, your materials, and your time for a reading/writing workshop. The authors provide step-by-step instructions for getting started (in a few instances even offering a sample script). They provide scores of suggestions for minilessons, and they recommend more than 1,000 books for classroom use. In addition, each section includes techniques to use with struggling readers and writers. The book even devotes a section to the \"testing genre,\" helping students develop strategies to maximize their performance on standardized reading tests.Furthermore, _Guiding Readers and Writers_ includes sixty-five appendices (nearly 150 pages)! Fifty-three of the appendices are reproducible pages that the teacher or the student can use for planning, record-keeping, assessment, analysis, etc. Most of the remaining appendices comprise lists of recommended books. A list of 1,000 books is repeated -- organized once by title and again by level._Guiding Readers and Writers_ will help you rekindle the passions that originally prompted you to become an English teacher -- and it will show you how to share those passions with your students. Focusing on the vital elements of communication is likely to produce the best year ever -- for you *and* for your students.",
                "review/helpfulness": "40/40",
                "num_reviews": 40
            },
            {
                "review/text": "This is an excellent resource for every intermediate grade teacher. It is also one of the few books that I am keeping from elementary education program. Fountas &amp; Pinnell are leaders in this area of educational theory. Their research and work is cited and quoted in books across the field. This is probably their finest example of the program they have designed.These two professors have designed a literacy framework that really works. It keeps kids interested in reading and learning, while not being too difficult for the teacher to implement or to assess. The book is so well written - there are guides everywhere and the illustrations and diagrams are actually useful (not just taking up space)! I highly recommend this book for any and all intermediate teachers. Many of their concepts can be adapted for older or younger students with relative ease.Why 5 stars?:I have seen the ideas of Fountas &amp; Pinnell and it really works. Of course, they have designed a utopian classroom in their book, but it is possible to achieve a strong literacy framework with the help of this book. I know I will be using it. They are up on their research and have designed a program that will keep student, teacher and administrator happy. There are even sections on how to deal with standardized tests and &quot;struggling readers.&quot; Every intermediate should own this book!",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "I have read several books that address some of the topics covered in this book, however, none compare. The book takes you step-by-step through setting up a reading and writing workshop. It is very user friendly and gives several authentic examples which includes photos and dialogue. In my opinion, it is an essential resource for intermediate teachers.",
                "review/helpfulness": "17/20",
                "num_reviews": 20
            },
            {
                "review/text": "This book is an excellent source of graphic organizers, mini-lesson ideas for reading and writing, and examples of how a reading workshop and writing workshop could be run and managed. The authors provide excellent examples and rationale for all information presented. It is easy to read and understand. This is a must for any 3-6th grade classroom teacher!",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book was just what I needed as I tried to implement a cohesive, leveled, workshop-based language arts program in my room. If you liked what you read in Mosaic of Thought, and Strategies That Work, you'll love this book. The book is filled with lots of background, food for thought, suggested ways to organize your classroom and teaching, then specific lesson ideas--there must be hundreds. Probably the best classroom resource I have come across in my ten years of teaching.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I am a brand new teacher, teaching 7th grade English. This book has become my bible. I am currently using the first twenty days of reader's workshop chapter with my class. It breaks down the lessons step by step, gives all of the masters, and even has a script to read if you need it. I recommend this book to anyone wanting to implement the workshop model in their classroom, and I encourage all new teachers from 3- 8th grade to have this as a reference on their bookshelf. I am very pleased!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Excellent resource for those teachers wanting to grow in their literacy instruction. If you feel like you have to reenergize your reading and writing program then this is a great book for you. I wish I had this book when I was a first year and would reccomend it for any teachers just starting out.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "You'll be surprised by the progress your kids will make, when you teach using the methods described in this book. You will reach learners at every level and do so in an authentic way that provides each student with choices and opportunities to become instrumental in their own learning. You will foster the love of reading and writing and the children will beg you to do reading/writing workshop. What a gift Fountas and Pinnell have given children across the country! If you teach grades 3-6, it is a staple...must have!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "fine art publicity the complete guide for galleries and artists business and legal forms",
        "description": "This savvy resource helps artists and art professionals generate the publicity that keeps their artwork and business in the public spotlight. Provided are practical tools for attracting the media's attention and building bridges between artists, their galleries, and collectors, and between museums and their audiences. This new edition provides the latest word on new art markets; how to research the Internet, build a Website, and launch e-mail publicity campaigns. Allworth Press, an imprint of Skyhorse Publishing, publishes a broad range of books on the visual and performing arts, with emphasis on the business of art. Our titles cover subjects such as graphic design, theater, branding, fine art, photography, interior design, writing, acting, film, how to start careers, business and legal forms, business practices, and more. While we don't aspire to publish a New York Times bestseller or a national bestseller, we are deeply committed to quality books that help creative professionals succeed and thrive. We often publish in areas overlooked by other publishers and welcome the author whose expertise can help our audience of readers.",
        "authors": "['Susan Abbott']",
        "infoLink": "http://books.google.com/books?id=yrpPAAAAMAAJ&dq=Fine+Art+Publicity:+The+Complete+Guide+for+Galleries+and+Artists+(Business+and+Legal+Forms)&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I buy alot of books but I have never before seen a book written for an adult audience spread so thinly over so many pages. I suppose this was done to try to create the illusion of there being more information here than there really is. What little useful information this book contians seems to be repeated over and over. I would guess again to fill pages. I feel there is virtually no practical information here for an artist and very little for a gallery. I usually don't have an interest in writing book reviews but I was so disappointed in this book that I wanted to alert others to search elsewhere for useful information.",
                "review/helpfulness": "57/61",
                "num_reviews": 61
            },
            {
                "review/text": "I dont usually write reviews, but I completely disagree with the bad review on here. This is an incredibly useful book for art galleries. I can't express how helpful this book has been to me. This is a guide for galleries not artists, so maybe that's why the last reader had issues.",
                "review/helpfulness": "23/28",
                "num_reviews": 28
            },
            {
                "review/text": "The majority of art career guides come from either career counselors or artists themselves, so it's refreshing to note that Fine Art Publicity: The Complete Guide For Galleries And Artists, appearing in its second updated edition, is written by an industry publicist backed by the knowledge of her profession. Galleries and artists receive the basics of marketing to the art community; from researching a media list for both local and national contacts to locating businesses connected to the arts, and gathering a library of samples for targeted publicity contacts. Simply an outstanding reference; a 'must' for aspiring artists and gallery owners alike.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I am writing a business plan to open an art gallery.Even though I already know how to market service businesses,I need to learn a lot about marketing an art gallery. Ifound a trove of very good advice in this book. I appreciatethe easy layout and readability also. I expect anyonewith an art business can find ideas here.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Fine Art Publicity has some very good ideas about marketing and publicity. We just opened an art gallery, and have already had a few articles published in local newspapers thanks to the suggestions in this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the dot irma s and james h black honor for excellence in childrens literature awards",
        "description": "Curious minds are rewarded with curious answers in a fantastical bedtime book by Mac Barnett and Isabelle Arsenault. Why is the ocean blue? What is the rain? What happened to the dinosaurs? It might be time for bed, but one child is too full of questions about the world to go to sleep just yet. Little ones and their parents will be charmed and delighted as a patient father offers up increasingly creative responses to his child's nighttime wonderings. Any child who has ever asked \"Why?\" -- and any parent who has attempted an explanation -- will recognize themselves in this sweet storybook for dreamers who are looking for answers beyond \"Just because.\"",
        "authors": "['Mac Barnett']",
        "infoLink": "http://books.google.com/books?id=jo6RDwAAQBAJ&dq=The+Dot+(Irma+S+and+James+H+Black+Honor+for+Excellence+in+Children%27s+Literature+(Awards))&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "This book was delivered automatically in our Junior Library Guild order, and it has become one of my all-time favorites as a librarian.When Vashti angrily stabs a dot onto an empty art class assignment, her teacher wisely follows through with a lesson in life by framing her dot for all to see.This little bit of attention takes Vashti to new heights by allowing her to take that dot and see where it leads her. She paints all sorts of dots and gains new confidence.What the story really teaches us is to try, and to start with the tiniest of dots to begin our journeys. As my library class discussed the theme, many of the kids brought up \"dots\" in their own lives, such as learning how to roller skate, sink a free-throw, or turn a cartwheel. We all have to start somewhere!And as Vashti's teacher told her when she finished that first dot, \"Sign it!\"This little book is truly an inspiration, and the kids loved it. I want my own copy!",
                "review/helpfulness": "39/40",
                "num_reviews": 40
            },
            {
                "review/text": "My second grade class LOVES this story and have carried over the message of being proud what you do into their writing as well as drawing. The author Peter Reynolds came to speak at our school and was wonderful. He held the students attention and was very inspirational. I highly recommend all of his books, he writes great fables with a positive message.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "Reynolds does a fantastic job showing how someone can be creative or artistic and not even know it. I picked up this book at an elementary book fair first because I thought it was well written and illustrated. Second because I want to help my children realize they have hidden talents. And third because my husband is an art teacher in high school and his students are constantly telling him they can't draw.This book not only teaches that anyone can be artistic but it teaches that creativity is not something only some of us are born with - it is something we all have inside of us, we just need to find a little bit of inspiration to bring it out. In Vashti's case, it was her teacher framing her dot and hanging it by her desk.I recommend this book for anyone: kids, adults, teenagers.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "Peter H. Reynolds has crafted a simple but inspiring story that recognizes the creativity in everyone and shows how simple words can inspire that creativity. This is a book for all those people who have been told they can't by someone, because it proves that imagination lies within us all and that we only need hear it from someone so that we may begin to believe it ourselves. Reynolds reminds us of the powerful influence of teachers and their ability to challenge the preconceived notions we might hold about ourselves, encouraging us to dream and turn those dreams into reality.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book actually has an ageless appeal to all of us who feel 'I'm not an artist'. I'm a middle school art teacher, and it also charmingly shows how a gentle nudge by a teacher can start a snowball of creativity!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Vashti thinks she's a terrible artist. Her art teacher challenges her to draw a dot. When Vashti sees her finished dot on display behind the teacher's desk, she decides she can do better. The beautifully simple illustrations add to this sweet book about finding hidden talents.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I'm a middle school art teacher. I read the book to every class on the first day. Then, I gave them a few different media to use, (watercolor, oil pastels, markers) and asked them to \"make a dot and see where it takes you\" We made two rules, you had to know where your original dot was and you had to work for 15 minutes. The results are great and we are off to a great start. I also own ISH by the same author and use it a little later in the semester.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "A fabulous book. For those of us that never got beyond drawing stick people it's a revelation! What is art can all depend on ones perspective. I think it's great for ALL ages!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Anyone who works with children and reaches out to give them a sense of self-worth deserves this book as a gift. It is simple, gentle and touching. The Dot is the story of a child who is frustrated with the artwork she makes until a teacher tells her simply, \"sign it\". That small interaction gives the girl the confidence to take chances and grow until, ultimately, she's the one saying \"sign it\". This book speaks to the idea that teachers really do touch eternity...they never know where their influence will stop. If you have a favorite teacher, give him/her this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I absolutely loved this book! It not only entertains, but teaches children that their own artistic expressions are valuable. It's a \"feel good\" book that children and adults will love!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "writing like writers guiding elementary children through a writers workshop",
        "description": "Build a classroom of excited, talented young writers. This wonderful teaching resource offers a complete approach to creating a classroom of enthusiastic, skillful student writers. The authors provide a comprehensive approach to teaching writing in the classroom. This book offers the strategies teachers need to teach writing skills that meet national standards and produce excellent results from children. Topics addressed in this guidebook include: creating the writing classroom, teaching the writing process, teaching effective writing strategies, teaching elements of story structure, teaching the advanced craft of writing, and using a writers' workshop to teach good writing. Writing is a great differentiator. During the writers' workshop, each student is engaged in meaningful ways. Pulling together more than three decades of practical experience and research on the best strategies for teaching writing, Writing Like Writers offers a friendly, easy-to-use guide for any teacher seeking to build a classroom of successful writers.",
        "authors": "['Kay Johnson', 'Pamela V. Westkott']",
        "infoLink": "http://books.google.com/books?id=G7AJjwwuL_oC&dq=Writing+Like+Writers:+Guiding+Elementary+Children+Through+a+Writer%27s+Workshop&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Writing Like Writers guides students through the writing process in a step-by-step fashion that's interesting, and full of different ideas for different writers. Students try each step along the way, and can work out the writing process that suits them best.Writing Like Writers is complete, with samples and reproducible worksheets throughout. Every aspect of writing is covered: characters, plot, setting, point of view, theme, dialogue, and much more. But far more important than the definition of each aspect, are the examples for teachers to share with their writers. Writing styles and details from repeated words, precise language, onomatopoeia, and more are discussed and tried. Techniques are discussed for use in both fiction and nonfiction writing.By the time they finish this book, your students will be interested and experienced writers, with many great tools at their fingertips. For teachers, Writing Like Writers provides assesment tools for both teacher- and self-assessment of students' writing. Finally, the book includes \"Teaching Children to Write\" - a conceptual framework for writing instruction, or how to encourage all the kids in your class to be writers.Writing Like Writers says that it's for elementary children, but many middle school students who would benefit just as much from this great guide.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "As a novice teacher, I have embraced Writing Like Writers: Guiding Elementary Children Through a Writer's Workshop as my primary source for understanding and teaching the writing process. The book has an easy to use format. It provides step by step models for teachers to use to demonstrate the crafts, skills and strategies of writing. I wanted to set up a Writer's Workshop in my classroom that would address the reality that my students are often at different stages of the writing process. This book provided me with the structure and the content to do just that. It's helping me to become a more effective teacher of writing and therefore my students to become better writers.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "In Writing Like Writers: Guiding Elementary Children Through A Writer's Workshop, Kathryn Johnson (who teaches Language Arts Methods and supervises student teachers at the University of Rhode Island) has teamed up with Pamela Westkott (who has been teaching third grade for most of her career in a suburban Rhode Island seaside town) to provide frontline elementary school classroom teachers with a complete and comprehensive instruction manual on instilling creative writing skills in their students through the forum of a writing workshop. Writing Like Writers takes the instructor step-by-step through the process of creating an engaging and productive young writer's workshop in any ordinary classroom and integrated into any standard curriculum. The instructional text is enhanced with illustrative real-life experience-based anecdotes and stories that will inspire the classroom teacher with respect to suggested changes in their approaches to teaching writing to young students. Fully covered are such basic issues as preparing classroom materials for an effective writing environment; utilizing scaffolding techniques to guide the student through the process of writing; strategies and crafts allowing young writers to clearly and descriptively express their ideas. There are even reproducible workshops and helpful websites. Writing Like Writers is commended to the attention of classroom teachers, school curriculum developers, and would prove immensely useful to dedicated homeschooling parents for their use as well.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This outstanding book is perfect for both novice and veteran teachers. It provides an organized and creative approach to implementing a writer's workshop. Within the book you'll find lesson ideas, reproducables, assessment criteria, workshop format, tips, and just about everything you need to create a successful writing program within your classroom. I use this book in my classroom as the foundation for my writing program. My collegues were so impressed with the results and ease with which it can be used, that the rest of the school will be adopting the approach and using this book as the corner stone! I can not say enough good things about this book. It is a must buy.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "introduction to rock art research",
        "description": "First published in 2005, this brief introduction to methods of studying rock art has become the standard text for courses on this topic. It was also selected as a Choice Magazine Outstanding Academic Book in 2005. Internationally-known rock art researcher David Whitley takes the reader through the various processes needed to document, interpret, and preserve this fragile category of artifact. Using examples from around the globe, he offers a comprehensive guide to rock art studies of value to archaeologists and art historians, their students, and rock art aficionados. The second edition of this classic work has additional material on mapping sites, ethnographic analogy, neuropsychological models, and Native American consultation.",
        "authors": "['David S Whitley']",
        "infoLink": "https://play.google.com/store/books/details?id=fakYDQAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Dr. Whitley is one of the top three specialists in rock art research in the world today. His scholarly record of top-notch scholarship spans three continents and includes ground-breaking perceptual advances. He pulled together and edited the 2000 capstone book \"The Handbook of Rock Art Research\" - the standard by which all other future compilations must be judged.The problem was that introductory rock art students would find \"The Handbook\" a bit too intimidating. Little existed for those who want to go beyond being a photographer of rock art and start down the road towards contributing to our scholarly knowledge of these priceless insights into past minds. Instructors from the community college on up teaching the basics of rock art research were left to cobble together a series of articles and picture books, ending up with an unsatisfying set of readings.This book solves the problem of an individual wanting to explore the scholarly study of rock art. Dr. Whitley explains in clear language the state of the art of research into rock art. This book is perfect for anybody who has wondered, \"What can be done with these amazing images of the past\". Dr. Whitley provides the reader a concise and readable way to understand that a tremendous amount of research is possible. So this book is for the regular person who has taken the time to stop on a road trip and wonder about past visitors to a site.The reader will receive a wonderful introduction to rock art, come to grasp the importance of field work in rock art reserach, be introduced to classification methods, dating methods, scientific analysis methods, how to interpret symbolic and enthnographic elements, and even link rock art to how our minds are constructed at a neurophysiological level. Most importantly, the book turns to management and conservation of this cultural resource that we are losing in bits and pieces every day.Even though this book is written well enough for someone \"new\" to rock art to understand the field, this book is also a must for professional archaeologists. This is because rock art is a field long overlooked by archaeologists. Archaeologists older than about 30 years were taught in classes that \"nothing could be done\" with rock art. Dr. Whitley's book indicates that such statements reveal the lack of scholarship of the speaker. For any archaeologist who simultaneously claims to be a scholar and also questions the relevance of rock art for the student of past peoples, Dr. Whitley's book is a must read. Or the general public will quickly come to the opinion that the \"professionals\" are so stuck in their old ways that they have become the relicts that they study.So if you love the pictures and want to learn more, or if you are an out-of-date professional and don't want to be caught being the fool, read this book!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Whitley does a good job writing an introduction book on rock art. He gives examples from all over the world including California, South Africa, and France. He writes about ethnographic interpretation as well as the neuropsychological approach to rock art and shamanism.Whitley includes a short glossary at the end of the book and a very helpful list of references. The \"list\" is almost 30 pages long.About the only thing wrong with the book is that there are not as many photographs as I had expect for a book on this kind of topic. Whitley could have included more photographs of the rock art he wrote so well about.I recommend this book to any aspiring rock art researcher (like myself)",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "i'm not a student or a professional rock art researcher, but i do have a keen interest in rock art. that said, i just finished reading rock art research, cover to cover, and found it a remarkably comprehensive book about how reseach is conducted, how theories are put forward, investigated, and rigorously challenged. this guy whitley has a remarkable mind and is able to lay out theories in clear fashion which come alive.as fine a writer as whitley is - and i believe him to be one of the best writers on rock art that i have read - i did find my mind wandering a bit in chapter 8 OTHER FORMAL APPROACHES - but i don't know if it was me being a little impatient or his writing, or if it was the theories discussed in that chapter that are not as interesting...by the time i'd finished the book, i was wondering WHY he so rarely references shaafsma - because i've always found her to be quite insightful and interesting... i know her book on shields does not embrace shamanism, and i'm sure that there is somekind of philosophical difference between them, but he should have highlighted what those differences are and not simply ignore it/her. THAT would be an interesting intellectual challenge.i await with great anticipation his newest book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "art students college guide",
        "description": "Offers advice on passing admissions auditions and provides two hundred school profiles, including information on admissions requirements, costs, and programs offered.",
        "authors": "['Elaina Loveland']",
        "infoLink": "http://books.google.com/books?id=yOE6IQAACAAJ&dq=Art+Student%27s+College+Guide&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is not a review, but a question. Is there not an updated edition of this book, as some things have changed since 1996.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "We checked an older version of this out of the library. It was good in that it had the basic information listed for a lot of art schools but there were only a few pages of very general advice about how to pick a school. I needed more advice about this. I would have liked to have known how they picked art schools within universities. Did they just include any art school program that returned a questionnaire sent out to them or was there some criteria used before including or excluding them? This book serves as an okay encyclopedia of art schools but art students could use further guidance in picking a school.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "i have a 1996 edition of this book which, oddly, i purchased in 1999. let the buyer beware: they do not update this book on a very regular basis as far as i can tell. there are interesting and useful facts in the school profiles, however, no two schools have exactly the same \"questions\" answered in their profiles, making it difficult to compare schools because there are few easily viewable commonalities. students are not interviewed and the profiles seem to be direct quotes from the press releases offered by individual schools. therefore, as an art student myself, i have found it much more useful to visit the webpages and campuses of the colleges i am interested in, consulting ARCO as little as possible.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "formatting your screenplay",
        "description": "In this unique manual, author and screenwriting teacher Reichman discusses all the major elements of an authentic authors script and gives strategies for using each element to maximum effect.",
        "authors": "['Rick Reichman']",
        "infoLink": "http://books.google.com/books?id=RdRSPQAACAAJ&dq=Formatting+Your+Screenplay&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I took Mr. Riechman's class at Georgetown University, and partnered with him on a few screenplays. Rick is an excellent teacher, and really does know his stuff. In regard to previous comments on the format being wrong in the book, it was an error on the part of the printer. I wish I knew where Rick was these days, I could use his sage advice. At least I still have the book :)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is not a sit-by-the-fire-and-enjoy-a-brandy sort of book. It does exactly what it says it will do and will teach you how to format your screenplay into a format that Hollywood readers expect. Every year thousands of screenplays are rejected without being read because they don't look like screenplays. Add this tool to your kit and at least get your scripts read.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "When I first realized I might have a story that was suitable for movie treatment I bought a couple of books which told me all about how to get ideas etc. but I couldn't find any hard copy on how to format. The general advice was read some manuscripts and learn from them. Good advice except these aren't types of manuscripts submitted the first time. I finally consulted Dr. Roger Busfield (author of The Playwright's Art) and he said Formatting Your Screenplay was the best book for learning how to correctly format a screenplay. He was right. It had the information I wanted in an easy-to-access form.Coupled with The Playwright's Art it is an exclent addition to any beginning script writer's library.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]