[
    {
        "Title": "niv compact concordance",
        "description": "Excellent for use in the home and classroom, this compact concordance lists all major references for all important words in the New International Version, which is now the bestselling English version of the Bible in North America. Part of a series of NIV-based compact reference books that will also include a commentary and a topical Bible.",
        "authors": "['John R. Kohlenberger']",
        "infoLink": "http://books.google.com/books?id=s4TWAAAAMAAJ&dq=NIV+Compact+Concordance&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "This is a great concordance. I've had it for about 4 years now and find it really helpful. It includes several words on either side of the entry to help establish context, which cuts down on the amount of flipping to verses that don't apply. I definitely recommend this, I'm going to get a copy for my roommate so that I can get mine back!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Altghough this is not an exhaustive concordance, its size makes it quite useful.The only real drawback is that it is paperback, but because of this, the price makes it one of the best values in a full concordance out there.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "A must for any person reading the Bible for the first time to a much read Bible scholar. A helpful tool when a word is mentioned and you need to find where it is located in Scripture. Necessary when you want to do a study of a particular word in the Scriptures. Recently given to friends who don't necessarily use NIV Bibles. They are able to still find what they want by locating the Scripture in their own translation or paraphrase.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Great item! Small enough to bring with you, but large enough to cover many topics.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Very good Concordance to help with your Bible Study. Gives a lot of details like a larger Concordance. I recommend this book along with the NIV Compact Dictionary of the Bible.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "niv womens devotional bible",
        "description": "Offering a fresh perspective on life, the devotionals in this hardcover Bible are written for women by women. Designed with devotions for both weekdays and weekends, you can reflect on how the Scripture relates to your life Monday through Friday, and get to know the women of the Bible on a more personal level on the weekends.",
        "authors": "['Zondervan']",
        "infoLink": "http://books.google.nl/books?id=F2UXugAACAAJ&dq=NIV+Women%27s+Devotional+Bible&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 20.0,
        "review": [
            {
                "review/text": "This is one of my favorite Bibles. If you're looking to study the Bible in a year, grab this one and off you go! It's very interesting to read the devotionals and then try to apply what was said to your life. I use this Bible as a pick-me-up whenever I've had a rough day. Somehow, I find a devotional that applies to the situation and also, one that highlights what may have happened that day. It's a definite must in today's world, trust me! I've had mine for about 12 years now and need to replace it. It's about worn out!",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "I bought this bible as a gift and liked it so much that I bought myself one...This is my first NIV bible and must say that is very easy to read. The devotionals are inspriring, affirming, and the scriptures inspire me to follow a more Godly path.This bible will make a wonderful present for any woman seeking to learn and live more for Christ.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "I throughly enjoy reading the bible and especially since I purchased NIV'S WOMEN'S DEVOTIONAL. It is so Inspirational to read from this bible. It is so clear and understandable and it offers devotional readings to motivate the heart and soul. I recommend this book to all women. One Love.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "i bought this book to go along with my study bible. I can't say enough good things about it... buy it and enjoy",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I am the wife of Randle A. Humphreys. I read through the Women's Devotional Bible twice and I can truly say it is inspirational. The women who share their thoughts and lives in the devotionals have their focus on God and how He can work in our lives. Their writings of poems, personal stories and annecdotes bring the message in that days Bible passage home. With all we have to do in our busy lives, the time we need to take to be alone with God can get easily filled with less important things if we do not make it a priority. The Women's Devotional Bible helps to focus what time you do make for quiet-time meaningful. I have highly recommended this book to friends and family, and they have liked it as much as I have.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a beautiful bible. My son gave my a Borders gift certificate for my birthday and I wanted to get something I would use daily and this bible is perfect. The devotions are timely and meaningful. This edition is truly a treasure.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love my NIV Women's devotional Bible. I find a daily devotional to suit the need no matter what it is. The NIV translation is easy to read and understand, and I think that women of any age will find that this Bible will more than suit their spiritual needs. I'm going to buy one for my sister and surprise her with it.If you purchase this Bible, you will NOT be disappointed.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "So much easier to understand and read than the King James Version PLUS the bonus of devotionals written just for women ....",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This Bible has helped me with a lot of things I've been going through. I'm glad I purchased it. It is in excellent condition.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Sent to a friend in distress, she said it helped her through some rough days.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "nelsons compact series compact bible concordance",
        "description": "The Compact New Strong's Concordance puts Bible references for spiritual growth at your fingertips. It has: over 40,000 entries; the quickest way to find the most-used Bible words and verses; includes brief definitions and pronunciation guides for all proper names; key references for Bible words arranged from A to Z; easy-to-read format works with many other Bible translations; locate favorite passages quickly and easily; and the essentials of Strong's scholarship in a convenient, compact size.",
        "authors": "['James Strong']",
        "infoLink": "http://books.google.nl/books?id=bAN7zgEACAAJ&dq=Nelson%27s+Compact+Series:+Compact+Bible+Concordance&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 9.0,
        "review": [
            {
                "review/text": "Very complete, found everything I wanted, but because of the compactness, the print is very small, so would not recommend for elderly eyes or anyone with serious vision deficiency [magnefication needed].",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This Concordance has the SMALLEST print I've ever seen in ANY book!! Even with my reading glasses I have to squint in order to make out the print. I even tried a magnifying glass but gave up. I don't know who would able to use this book. I wasted my money since I can't even read it!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "true identity the bible for women todays new international version tniv",
        "description": "True Identity: The Bible for Women helps you see yourself as God sees you and become who you are in Christ through your relationship with him. Imagine having an incredibly wise friend who is always available to hear you share your struggles and challenges. This Bible will show you that, like a wise and compassionate friend, God cares deeply about your story and speaks truth into your life through Scripture. Inside this Bible are various notes and articles designed to help you live out who you are in Christ in practical ways as a woman living in today's world. Drawing on the truths of Scripture, True Identity: The Bible for Women will strengthen you with insights and encouragement for the issues you face. 'Myth' articles refute society's myths with the truth of God's Word; 'Ask Me Anything' notes profile women from the Bible in an interview format, allowing you to hear the biblical woman's perspective on the real-life issues she faced; 'Conversations' ask penetrating questions for reflection, which you can do alone or with a friend or mentor; 'He Is' callouts highlight the attributes of God as shown in Scripture and what they reveal about your identity as a woman; 'At Issues' notes discuss important life topics such as money, sex, and pride; and book introductions, a topical index, and articles on relevant topics make this Bible a helpful tool for you or any woman. NIV 2011. The New International Version (NIV) translation of the Bible is the world's most popular modern-English Bible---easy to understand, yet rich with the detail found in the original languages.",
        "authors": "['Zondervan,']",
        "infoLink": "http://books.google.com/books?id=9SLo9-iehdwC&dq=True+Identity:+The+Bible+for+Women,+Today%27s+New+International+Version+(TNIV)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "I bought this to replace my rather worn out Women of Faith Study Bible. I love the devotions, and how relevant they are to women today, with topics such as dating a nonbeliever or being a shopaholic. Little \"conversation\" blurbs also provide questions that really make me think. The True Identity Bible is my primary, every day Bible, and I bought it mostly for the topical articles. One star off for not being made in the NIV format, my preferred Bible translation - although I haven't really come across too much of the \"gender-neutral\" or other changes that people have been debating about the TNIV.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Purchased this Bible for our daughter. Content is excellent. Leather binding is very good also, BUT, because of the type of leather used, the local Bible store could not imprint her name on the cover. Reconsider this item if the imprint is important to you.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "niv study bible new international version large print edition",
        "description": "Presents a full translation of the Bible, with explanatory introductions to each book and color illustrations.",
        "authors": "['Zondervan Bibles']",
        "infoLink": "http://books.google.com/books?id=xaD3tgAACAAJ&dq=NIV+Study+Bible:+New+International+Version+(Large+Print+Edition)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 9.0,
        "review": [
            {
                "review/text": "I was recently asked by someone who had read some of my reviews which study Bible I recommended. Such a hard question, since there are many excellent ones available! My answer to him compared the NIV Life Application Bible and the NIV Study Bible. Here are my thoughts on these two, plus comments on the Quest Study Bible as well.The Large-Print Edition of the NIV Study Bible doesn't have HUGE print - just a bit bigger than most Bibles. I still use that Bible a LOT and it's just comfortable reading. It is a bit bigger and heavier than my LAB, but not by a lot. I really like the larger type. You can get REALLY large print, but that's not what this is.The Quest Study Bible doesn't go as deep. I think it's perfect for someone who is just beginning to study the Bible and has lots of questions like those that are answered in the Quest Study Bible. However, that's not to say that I already know all the answers to those questions! ;-o It just doesn't go much deeper than those questions.I have in front of me the NIV Study Bible and the Life Application Bible NIV. They are both excellent - either one would go deeper into the Word than the Quest Study Bible.The obvious differences to me are as follows:Text The Life Application Bible (LAB) has the text straight across the page - the NIV Study Bible has the two-column layout. I think I prefer the two-columns. It is easier to get through some of those Old Testament books such as 1/2 Chronicles! ;-o However, this is very much a matter of personal preference.Notes The notes, while excellent in both Bibles, are different in tone. The NIV Study Bible notes are very objective and purely informational. One of the downsides to the LAB, for me anyway, is that sometimes the notes in the LAB get rather preachy and sometimes go far afield of the text. I'm not saying asking personal applications is a bad thing, but if you're doing a lot of reading in that Bible, it might get to be a bit much. The tone of the notes is is the reason I gave the Life Application Bible 4 stars instead of 5! A note might ask &quot;Do you believe that God can help you? Do you really want his help?&quot; (note for Matt 9:27-30).The clear, informative and objectively stated notes in this NIV Study Bible earned it 5 stars in my book!! I would, however, have appreciated lengthier personality profiles. But no study Bible has everything!Other helps In the back of the LAB, there is an &quot;Index to Notes&quot; which includes the maps, charts, personality profiles, and the notes. It really isn't a concordance, but it is helpful.The NIV Study Bible has an Index to Maps separately, an Index to Subjects, and a Concordance. The Concordance isn't exhaustive, of course, but it is much better than the one in the LAB.The LAB wins the contest in the &quot;Personality Profiles&quot; category. They have quite a detailed description of all the key people you'll meet in the Bible - they often cover about 2/3 of a page!! In the NIV Study Bible, these personality notes are relegated to just a few lines in the Notes section! The LAB definitely is the winner in this category.Both Bibles contain a Harmony of the Gospels, something I find really helpful. The LAB, however, numbers each event in the Gospels, and before the section in the text, it gives this number and then gives the passages in the other gospels that tell the same story. I found the number to be really helpful. The NIV Study Bible doesn't have such numbers.I could go on and on, but you get the idea! Those are the main differences, I think!! Both Bibles are excellent. I haven't found any others that are better. I also have the NIV Living Insights Study Bible that has Chuck Swindolls notes, but the notes aren't as complete. Also, the &quot;Word in Life Study Bible&quot; is chockfull of different kinds of sidebars and articles and is just wonderful as well.I had purchased the Large-Print Edition of the NIV Study Bible because of some temporary vision problems. I hope this is helpful! Please check out my other reviews of Bibles and other Christians books and contemporary Christian music!",
                "review/helpfulness": "216/218",
                "num_reviews": 218
            },
            {
                "review/text": "I have had an NIV study Bible for several years. I originally purchased one to enhance my own study time. During discussions with friends or family, however, I saw a need to share the information contained within the Study Bible. Therefore, I always keep one here to study with, but I never put my name in it. I keep it &quot;unassigned&quot; until someone I know needs one, then I give them mine (but, of course, I still have my regular NIV and KJV, too). Invariably, this kind of &quot;opportune giving&quot;, that is, giving the Study Bible after a frank discussion of its contents, leads to eager reading. I gave one to my sister-in-law recently, who forgot to bring her KJV Bible while visiting. I lent my NIV Study Bible, and her eyes were opened to a whole new understanding. She was so enthusiastic about &quot;not having to translate&quot; what she had read (as she was used to doing with her KJV), that I offered her the Study Bible to take home. When she protested, I explained that I always kept one for expressly that purpose. It has become her study Bible of choice. Anything that brings a clearer understanding of God's word is worth having and sharing.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "This is a good Bible for the average eye, but not for someone who wants a study bible with VERY large print. The words of the scriptures are written in medium large print, while the study notes are written in standard small print. The content is MUCH more easy and enjoyable to read than the King James version.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "The notes of the NIV Study Bible are helpful for average Bible readers. The maps and time lines are also very helpful.The NIV is one of a number of &quot;dynamic equivalent\" translations of the Holy Scriptures. There is no perfect translation, since translation is inherently interpretation, but the NIV does a pretty good job of bringing the Scriptures, originally written in Hebrew, Aramaic, and Koine Greek, to modern English. I prefer the NRSV for more serious study, but the NIV is a great devotional Bible.The King James Bible was the best in its day. In today's world, it is NOT closer to the original Scriptures as some think, but as its translators say in the forward, it is a revision of a revision and was meant to be improved upon as the English language evolved. That is what translations like the NIV and the NRSV attempt to accomplish. We have uncovered better Greek manuscripts now and understand the language better.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "The NIV Study Bible always has an easy to understand explanation of biblical wording and cultural events,etc. of bygone era to help a student of the bible today grasp the full meanings.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have to say no matter how many other Bibles or Study Bibles I have tried or looked at I seem to always come back to this one for some reason. I have owned this Bible for almost twelve years and even in it's worn state(duct tape does wonders for a spine that is trying to fal apart) I find it to be my favorite and most easy to find things in resource. Part of it is personal use(the highlighted stuff and the fact that I've had it so long) but the other part is the Bible itself. The concordance is almost always helpful(other study bibles I Have used have less complete concordances or smaller ones) The large print isnt, as another reviewer noted, TOO large but it's great for someone like myself who is visually impaired and appreciates not having to strain to read tiny print. All in all this study Bible has been a tried and true friend to which I can turn often.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is easy to read and the words of Jesus are in red. I highly recommend it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "the best study bible i have come across. it is just a wonderful book.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "zondervan niv study bible new international version",
        "description": "Dive into a deeper study of God's Word with the comprehensive NIV Study Bible The beloved NIV Study Bible features a stunning four-color interior with full-color photographs, maps, charts, and illustrations that bring the stories of the Bible to life. The in-depth notes are coded to highlight items of special interest in the areas of character study, archaeology, and personal application. This NIV Bible provides you with just the right amount of study information, placed in in just the right locations, to answer your most pressing questions about God's Word and how it connects to your life today. Since its first release in 1985, the Gold Medallion Award-winning NIV Study Bible has become the treasured and trusted companion of over nine million Bible readers. Referred to daily by pastors, students, church leaders, and other Bible readers around the world, the over-20,000 NIV Study Bible notes are the handiwork of the same translation team that produced this Bible's text. Like no other Bible, the NIV Study Bible places an entire resource library for Bible study in your hands. Features: Complete text of the accurate, readable, and clear New International Version (NIV) Over 20,000 study notes, with icons to make important information easy to spot Introductions and outlines provide valuable background information for each book of the Bible In-text maps, charts, diagrams, and illustrations visually clarify the stories in the Bible 16 pages of full-color maps plus time lines and presentation page Words of Jesus in red NIV concordance plus subject and study notes indexes eBook has been optimized for reading on color screens, but will still function effectively on other devices",
        "authors": "['Zondervan,']",
        "infoLink": "http://books.google.com/books?id=VVOzRVQcD3sC&dq=Zondervan+NIV+Study+Bible+(New+International+Version)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 63.0,
        "review": [
            {
                "review/text": "The only statement the publiser/editors make about how this revision differs from the landmark first edition (1985) and the well-received second edition (1995) is found on page xviii: &quot;In this fully revised edition of the NIV Study Bible, the Associate Editors and I have added hundreds of new study notes, improved the book introductions (e.g., paying greater attention to the rhetorical, structural and other literary features) and enhanced other helps.&quot;A certain amount of the &quot;Evangelical defensiveness&quot; I found bothersome in the 1995 edition has been burnt off in the nicely-conceived, thoughtful re-expression of book introductions found here. Compare, for instance, these statements from the Introduction to Job:[1995 ed.] &quot;Two dates are involved: (1) the date of the man Job and his historical setting, and (2) the date of the inspired writer who composed the book.&quot;[2002 ed.] &quot;Two dates are involved: (1) that of Job himself, and (2) the composition of the book.&quot;While the editors have not gone overboard trying to turn the NIVSB into a &quot;pc/inclusive language&quot; text, they have restated a few things here and there that, to my sensibilities, seemed worth fixing. For instance:[1995 ed., from Wisdom Literature Introduction] &quot;The Jews sometimes speak of the OT as the Law, the Prophets, and the Writings.&quot;[2002 ed., page 725] &quot;An ancient tradition among the Jews divided the collection of their holy books into three major divisions: the Law (Pentateuch), the Prophets (Former and Latter) and the Writings.&quot;These are small but welcome changes. [For those who may be following the controversy about the &quot;Today's New International Version&quot; translation, an adaptation of the NIV which endeavors to use gender-inclusive language when both men and women are clearly being discussed or addressed, the NIVSB uses the &quot;unaltered&quot; NIV. This is a good choice for a Study Bible, since serious Bible students need to confront the patriarchy of the ancient world at some time or another. The notes, rather than the translation of the text, seems the best place to accomplish this.]Although I see nothing in the introductions and notes that should be alarming to the book's primary audience (Evangelical Christians), the NIVSB now seems worthy to be used by Christians from other Protestant traditions, as well as by the general reader who may be curious about the Bible as one of the most important texts of Western civilization.The NIVSB continues to use three &quot;icons&quot; with its introductions, charts, and notes: a &quot;seedling&quot; to suggest an item that will help the reader apply something to her/his personal life; a &quot;trowel&quot; to identify items based on archaeological discoveries; and &quot;a human head&quot; to call attention to items relating to key characters. One could read the notes carefully and dispute the way these icons have been assigned throughout the text, but the editors should be applauded for their judicious restraint. To tag more notes with icons (or to introduce more types of icons) would have created visual clutter. The publisher should also be applauded for making the icons gray instead of solid black as in the previous editon; it's easy to read around them. (I only pay close attention to the &quot;trowel&quot; icons, because I am personally curious about what in the Bible can and cannot be confirmed by external evidence; although I usually skip the &quot;seedlings&quot;--because I don't like to be told how to apply Scripture to my life--these notes often discuss key theological concepts and are equally worth reading.)The typography is improved in the 2002 edition, most notably in the center column reference system. However, I still find it difficult to know where to look when I see a superscript marker in the Scripture text (To the center column or at the foot of the Scripture text?). At some points in the text, there are two superscript markers! For example, the name &quot;Immanuel&quot; in Matthew 1:23 is followed by a roman superscript &quot;d&quot; and an italic superscript &quot;w.&quot; Oddly, both identify Isaiah 7:14 as the related text. Although, I suppose, there's nothing technically wrong with stating something more than once, I think it unnecessary in a book so tightly packed with information. The unintended effect on the reader might be to erode his/her willingness to pay attention to the notes or to bother to look things up. That would be unfortunate, indeed, because there's a lot in the revised NIV Study Bible that is worth checking out.",
                "review/helpfulness": "202/205",
                "num_reviews": 205
            },
            {
                "review/text": "The main difference between this new 2002 and the previous 1995 revision is the inclusion of 800 new study notes. A quick browse through easily reveals a number of these, the first of which being at the first line of Genesis. There are also a number of explications to replace the frustrating \"See note at Psalm 15:2\" type of notes. Now they sometimes tell you why you should see it. Many of the earlier notes are also revised based on comments from seminary students, professors and pastors to bring them up to date with current conservative evangelical scholarship. There are also a few more charts in this version, a couple of new color maps (only dropping one, the pointless \"The World as it is Today\" from the previous edition). The typography is also slightly different, as are the icons used to denote archeology and life application passages. The font used for the headers is also different (in my view a slight improvement since it makes it easier to quickly spot stories and parables), and the comfortable font used for the Bible text itself remains unchanged. The standard edition is 2198 pages not including color maps, while the 1995 version was 2172. The spine of the leather version is also more stylish than the 1995 edition, simply stating \"Zondervan NIV Study Bible\" and \"NIV\" and \"Zondervan\" near the bottom. The 1995 edition said \"The NIV Study Bible\" \"New International Version\" \"Words of Christ in Red Letter\" and \"Zondervan,\" which made it a little busy. Oh, yes--the new version contains no family record pages, apparently realizing that study Bibles are used for study and not as heirlooms. There's only a nice presentation page and then it gets right into the timelines. All in all I highly recommend this update--and that's only after a quick browse-through! Frank",
                "review/helpfulness": "94/99",
                "num_reviews": 99
            },
            {
                "review/text": "The European Leather Bibles are beautiful inside and out, but are not thumb-indexed. Other Top Grain Leather editions are available, both indexed and non-indexed.It's unfortunate Amazon can't fully describe these Bibles on their pages. I used the Zondervan website (www.zondervan.com) to find out the ISBN numbers for the highest quality, top grain genuine leather bound editions, and ordered the navy indexed model (ISBN 0-310-92982-2). I am very happy with this Bible, as the leather is soft and the look is unique in the navy color with silver page edges. It is also a very thick Bible and has numerous maps, timelines, and other helpful study aides, in addition to the thorough notes. My only complaint is that the font is a rather modern one, and does not look as fancy as the Ryrie Study Bibles. They also have Burgundy and Black, in Top Grain or Bonded Leather, and with or without thumb indices, it's just nearly impossible to tell which is which on Amazon.Here's a list from www.zondervan.com of all the styles available, hope it helps:Zondervan NIV Study Bible (European Leather, Black/Black ISBN: 0-310-91997-5)Zondervan NIV Study Bible (European Leather, British Tan/Alligator ISBN: 0-310-91998-3)Zondervan NIV Study Bible (European Leather, Taupe/Mahogany ISBN: 0-310-91999-1)Zondervan NIV Study Bible (Hardcover, Printed ISBN: 0-310-92955-5)Zondervan NIV Study Bible (Bonded Leather, Burgundy ISBN: 0-310-92956-3)Zondervan NIV Study Bible (Bonded Leather, Black ISBN: 0-310-92957-1)Zondervan NIV Study Bible (Bonded Leather, Navy ISBN: 0-310-92958-X)Zondervan NIV Study Bible (Top Grain Leather, Burgundy ISBN: 0-310-92959-8)Zondervan NIV Study Bible (Top Grain Leather, Black ISBN: 0-310-92960-1)Zondervan NIV Study Bible (Top Grain Leather, Navy ISBN 0-310-92961-X)NIV Study Compact, LTD (Italian Duo-Tone, Green/Sand ISBN: 0-310-92966-0)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Black ISBN: 0-310-92977-6)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Burgundy ISBN: 0-310-92978-4)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Navy ISBN 0-310-92979-2)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Burgundy 0-310-92981-4)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Navy ISBN 0-310-92982-2)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Black ISBN 0-310-92980-6)",
                "review/helpfulness": "94/96",
                "num_reviews": 96
            },
            {
                "review/text": "I own many different study Bibles, from the Scoffield, New Scoffield, Thompson Chain Reference, Dake Bible, NIV Topical Study Bible and several Parallel Bibles. While I use them all, my favorite for study and for Scripture reading is the NIVSB. The language is easy to understand and the study notes are fairly comprehensive. The commentary hails from a conservative evangelical theology.Book binding quality:The binding is strong and is durable. I've carried this Bible around a lot, and it has held up with no sign of failure.Scripture Page layout:The Scriptures are laid out in the natural paragraph form, rather than the bullet form based on verse numbering. The Scriptures are laid out in two columns, with a column for Scripture cross-references in the middle. The bottom of each page contains commentary listed by corresponding verse. The words of Christ are in red, and contextual sections have headings that correspond to the outline at the beginning of each book.Introduction to Books:Each book of the Bible has a discussion of the author, audience and purpose, date and place of writing, characteristics, sources and a short outline of the book.Commentary:The notes deal with archaeological, historical, lexical (minimal lexical inputs) and cultural aspects that pertain to conservative hermeneutical exegesis. In disputables, the often do make definitive conclusions, but also at times give different views giving info on what the editors believe is the most probable correct conclusion. It is impossible to put all information on a topic into a study Bible, but the NIVSB does a good job of packing a lot of information in for a significant level of understanding.Indices:There are several helpful and easy to use indices at the back of the Bible. An Index of Subjects acts as a topical study help. An Index of Notes acts as an index for the subjects of NIVSB commentaries. There are several map and measurement aids and finally a standard but fairly comprehensive concordance is included.A note on the NIV translation:The NIV translation is a controversial translation. It has begun to outsell the long-beloved King James Version (KJV) Bible. I am not here to say one translation is the one to read while another should be shunned. I prefer to study many different versions, hence my use of parallel Bibles. But, please know that many of the negative reviews tend to be based on dislike of the NIV translation. Until Zondervan creates a parallel study Bible, this will remain one of my favorite Bibles.To find comprehensive information of a topic or passage, I use my Thompson Chain Reference. For seminary study, I use parallel Bibles (Evangelical Parallel NT and NIV/KJV Parallel). For initiation of a study, reading and study away from home, I use the NIVSB. There is a wealth of information in this study Bible.",
                "review/helpfulness": "59/59",
                "num_reviews": 59
            },
            {
                "review/text": "It's unfortunate Amazon can't fully describe these Bibles on their pages. I used the Zondervan website (www.zondervan.com) to find out the ISBN numbers for the highest quality, top grain genuine leather bound editions, and ordered the navy indexed model (ISBN 0-310-92982-2). I am very happy with this Bible, as the leather is soft and the look is unique in the navy color with silver page edges. It is also a very thick Bible and has numerous maps, timelines, and other helpful study aides, in addition to the thorough notes. My only complaint is that the font is a rather modern one, and does not look as fancy as the Ryrie Study Bibles. They also have Burgundy and Black, in Top Grain or Bonded Leather, and with or without thumb indices, it's just nearly impossible to tell which is which on Amazon.Here's a list from www.zondervan.com of all the styles available, hope it helps:Zondervan NIV Study Bible (European Leather, Black/Black ISBN: 0-310-91997-5)Zondervan NIV Study Bible (European Leather, British Tan/Alligator ISBN: 0-310-91998-3)Zondervan NIV Study Bible (European Leather, Taupe/Mahogany ISBN: 0-310-91999-1)Zondervan NIV Study Bible (Hardcover, Printed ISBN: 0-310-92955-5)Zondervan NIV Study Bible (Bonded Leather, Burgundy ISBN: 0-310-92956-3)Zondervan NIV Study Bible (Bonded Leather, Black ISBN: 0-310-92957-1)Zondervan NIV Study Bible (Bonded Leather, Navy ISBN: 0-310-92958-X)Zondervan NIV Study Bible (Top Grain Leather, Burgundy ISBN: 0-310-92959-8)Zondervan NIV Study Bible (Top Grain Leather, Black ISBN: 0-310-92960-1)Zondervan NIV Study Bible (Top Grain Leather, Navy ISBN 0-310-92961-X)NIV Study Compact, LTD (Italian Duo-Tone, Green/Sand ISBN: 0-310-92966-0)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Black ISBN: 0-310-92977-6)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Burgundy ISBN: 0-310-92978-4)Zondervan NIV Study Bible, Thumb Indexed (Bonded Leather, Navy ISBN 0-310-92979-2)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Burgundy 0-310-92981-4)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Navy ISBN 0-310-92982-2)Zondervan NIV Study Bible, Thumb Indexed (Top Grain Leather, Black ISBN 0-310-92980-6)",
                "review/helpfulness": "51/53",
                "num_reviews": 53
            },
            {
                "review/text": "I received this Bible as a gift a number of years ago, and I've used it regularly ever since. Personally, I prefer the New American Standard version for studying and reading, but I always keep this Bible handy for its unbeatable study notes and cross references. The notes, written to be nondenominational and always upholding the infallibility of the Bible, shed light on difficult passages and historical information, helping readers get the most out of time spent in God's word. Bible book introductions are often several pages long and discuss the book's origins and themes. And between the cross references and the excellent included concordance, I've been able to examine what the rest of the Bible says regarding topics in the passages I've studied. In fact, I often copy information out of this study Bible and put it in my other Bibles, so that I can always have easy access to information about my favorite verses and chapters.How this Bible looks also makes it stand out. The leather is high quality and attractive. Inside, the font size makes reading easy on the eyes, and other formatting features help make the Bible simple to use and navigate. Its size makes it a bit cumbersome for everyday use while on the go, but for at home study and going to church, there's no problem.Bottom line: NIV fans who want excellent study supplements inside an attractive cover simply can't go wrong with this Bible. The highly respected, easy to read translation combined with top notch study notes, cross references, and a concordance make this Bible a great way to set out on the journey of studying God's word.",
                "review/helpfulness": "45/47",
                "num_reviews": 47
            },
            {
                "review/text": "I was surprised by some of the negative comments about the NIV Study Bible, though my own opinions of it are less than raving about its perfection. While not the best around, I did find it has some definite redeeming features, (apart from the end, of course).The NIV has a very useful cross-reference system, (for which it is justifiably well-known), that makes pursuing a particular topic or item through the Bible very easy. This makes finding things a breeze. In addition, and contrary to some, the subject index and concordance are pretty good. Yes, they are very basic, but this is a Bible and not a concordance in itself. I did not find anything wrong with them, and they were pretty useful.There has been some comment about the introductions to each book, and I have found to be reasonably balanced and realistic about the evidence. In some cases, I would personally suggest even later dates for the books than the NIV gives. While the introductions are not perfect, (for more detailed information, see the real evidence out there), they do the job. I don't see how dating books accurately according to evidence is \"godless\" or in anyway detrimental to the Bible. Anyway, back to the point: the introductions are not detailed, but they are adequate for the task.I found the translation to be ok in most cases, though in some places, it seems to soften the ideas and teachings of Christ. This is noticeable when it is compared with other versions, which take a more literal translation as a technique. A teaching on marriage and not being married seemed to be softened in the NIV as compared to others. While I have no problem with the \"dynamic equivalence\" method, (it is not paraphrasing, as some seem to think), the NIV highlights the need to check with a couple of translations, unless you are going at it from the Greek, as well. This is something which makes me cautious to recommend the NIV as a primary study reference.While limitations of space have a significant effect on how much commentary you get, the NIV could have a little more. Admirable effort at leaving the real thinking to the reader, but in some nasty places there was very little commentary given, and it would have been useful.Overall, the NIV is not bad, and certainly not worth burning along with the other heretical works. It does a good job, and it has some very good features that make studying it easy, functional and even fun. Apart from the concerns above, it is pretty good.",
                "review/helpfulness": "28/37",
                "num_reviews": 37
            },
            {
                "review/text": "I'm going to review the book published by Zondervan, and not talk about \"The Bible\" itself.If you've made up your mind to read The Bible, this is an excellent book to use. What I liked about it was that it is a widely accepted translation, excellent commentary on most every verse (important to someone like me that did not grow up reading The Bible), and a lot of contextual information (drawings, book introductions, etc).For the uninitiated, it is a toss-up between this and the Quest Study Bible, also published by Zondervan. The Quest has a slight edge for the lay person as opposed to the serious Bible student -- it has answers to a number of blunt questions that may cross your mind, but which do not classify as Bible Study.I purchased a leather bound edition of this Bible from an Amazon seller. It was brand new, in unopened packaging, in leather, for far less than the list price of the paperback version. So, shop around the Amazon marketplace sellers before you buy.The only quibble I have is that Zondervan does not stitch the spine of its Bibles (atleast not the one that I have). No matter how carefully you treat it, a stitched spine always beats a gummed spine. See if you can get an edition with a stitched spine for a few extra dollars. It will be worth it.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "I have used the NIV study bible for 7 years and I think it is the best study bible on the market. The editors have a somewhat conservative perspective, but they are very much upfront about that, and the scholarship is solid. I also have the Oxford New Annotated Bible and the Harper Collins Study Bible sitting on my shelf right now and the NIV is without a doubt my favorite and most helpful study bible (followed by the Oxford). The cross references may be the best thing about this study bible! They are amazing! If you wish to find any of the obscure Old Testament prophetic references in the book of Revelation, for example, the center column cross refernces are your best friend. In addition the NIV has (I believe) the largest concordance of any major study bible, which makes finding that reference that you only sort of remember much easier. The notes in earlier editions were slanted a bit in the Reformed-Calvinistic direction, but the revisions of the last few years are supposed to make for a more ecuminical study bible. The introductions to the sections and books are also very good, TONS of info is included about the historical contexts from which the different books come in addition to the theological emphases. I HIGHLY recommend this study bible for pastors, students, and anyone who wants a better understanding of the Scriptures.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Looking for a study Bible?Want a Biblical commentary that allows you to draw your own conclusions?Then you may want to consider the NIV Study Bible.This is a great study Bible for Christians both young and old in the faith. It combines a readable and reliable translation, excellent reference material, and unbiased commentary. I have seen this study Bible through all it's previous editions and am continually impressed.Pros:1) The readable and reliable NIV text.Some people can be rather critical of the NIV even to the point of accusing this translation of heresy. Such accusations are completely without merit. I have studied from the NIV for over 20 years and I have never found it to be anything but reliable.2) Excellent reference material.Cross-references, maps, charts, timelines, historical context, and more. This study Bible has just about everything you would need for a complete study of any given passage. Granted, space restrictions do not permit an exhaustive analysis of any of the above. However, there is more than enough information to satisfy all but the most intensive reader.3) Good commentary.The study notes offered in this Bible are excellent. They do not enforce any one denominational position and present various viewpoints on disputible issues.4) Easy to read print.I do not know what kind of font was used for the printing of this Bible but it is incredibly easy to read.Cons:1) Thin paper.Unfortunately the paper quality for many of Zondervan's Bibles has been rather poor recently. It is ultra thin, probably to allow for thinner Bibles. It can be distracting to see the opposite page through the one you are reading. Especially if the next page is a chart or a map. This can also cause problems for people who like to take notes in their Bibles.2) Only available in the NIV.As I've said in the Pros this format is very good for Bible study. It would be nice to have this available in another translation for those who prefer a more formal translation like the NASB or ESV. There is a Zondervan NASB Study Bible that is very similar but it has not been updated along with the NIV.Overall, I would recommend this Bible to any one who desires to dig into God's word for themselves. You won't be steered wrong by this.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "ncv becoming the complete new testament biblezines",
        "description": "This BibleZine brings forth truth from Scripture which helps baby boomers look at life from a Christian perspective, particularly as they begin to deal with the many facets of change life brings.",
        "authors": "['Nelson Bibles (Firm)', 'NCV TRANSLATION']",
        "infoLink": "http://books.google.com/books?id=AcS2SQAACAAJ&dq=NCV+Becoming:+The+Complete+New+Testament+(Biblezines)&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am so excited about this magazine bible. This is the whole New Testament in a magazine format, how cool is this? It is packed full of delightful extras such as mini articles on life and things that all of us gals deal with on a daily basis. Also fun bible facts and mini articles on women of the bible. Not only is it packed full of extras, it is written in the easy to read and understand New Century version. Perfect gift for all of your gal pals, secret sisters, mother's and guess what they even have them for teen's (Revolve and Refuel). I hear that they are coming out with a version for Men next spring, my husband can hardly wait. God Bless Thomas/Nelson..",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "I have always struggled with reading the bible. This is fun and exciting. I can't put it down! It also tackles issues facing women today, divorce, infertility, dating, marriage, all with Biblical references to back it up.I will buy this for several friends' birthday presents. And Highly recommend it!I'm praying for an Old Testament version.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "I've tried several times to get into reading my Bible and, sadly, failed each time. When I got this New Testament version of Becoming I found it much easier to read. I've made a goal to read the entire Bible starting with using Becoming. It's much easier to understand and apply to my life with the examples given throughout the text. By no means does it stray from traditional scripture, it just makes it an easier read by using fun facts, modern day stories, and other things that are interesting. I'd highly recommend getting this, or any other version of the Bible put out by the company for yourself, family, or friends. I love the product!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I know some folks will be put off by the contemporary wrap of this easy to use tool, but I am so glad to have it! I gave copies to my daughters and plan on giving out more, especially to those who wont open a 'real' bible. As long as they see Jesus (Which they will in this book) that's all that matters! A perfect Easter gift.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I asked my kids for this Bible for Mother's Day to take on vacation. I always like something to read on the plane and when I want to relax by the pool. I didn't want to bring my regular Bible, worry about getting it bent, wet, or dirty and besides it's heavy! I also liked the magazine format and extras, it has just enough thought provoking sidebars that I didn't feel I needed to purchase a magazine at the airport. The translation is refreshing and conversational and yet it is a translation not a paraphrase. I really like it! I have since given a couple as gifts and they have been very well recieved. If you would normally pick up a magazine to read on the plane I would encourage you to get this, I know you will love it.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "When I was ten I got my first \"grown up\" Bible. All white leather with a zipper and my name in gold on the cover. As the man at the book store handed it to me he smiled and said, \"You will read about a womderful man in there.\" I still have that Bible and love it. Today my copy of Becoming came in the mail, and although it is not bound in white leather it is still God's word and I lOVE it. Every page gives you some way to apply the lessons taught to help in your every day life. Facing the hard times life hands us, learning to forgive, relationships and how to become more involved are handled in a way everyone can learn. The Beauty tips may at first seem unseemly, but when you take time to read them you find a lesson. I like the Women of the Bible segments, brief biographies of some of the Bibles most famous (and infamous) ladies and what we can learn from their lives. The monthly calendars are interesting as well. I intend to buy the teen versions for my two nieces, and I am sure friends will be finding copies of this Bible wrapped in birthday paper over the coming months. I know they will love it and USE it as much as I will.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "life application study bible indexed nasb",
        "description": "A flinty blade poised over a young man's heart - a heavenly command preventing the knife's deadly descent - the drama of Abraham and Isaac is one of the Bible's best loved stories. But what is its relevance for you? How do you apply this ancient Biblical account to your life today? Turn to the NASB Life Application Study Bible. It's wealth of study aids helps you translate Scriptural truths into practical action. You'll find application notes filled with insights for godly living. Character sketches to help you learn from the strengths and accomplishments, weaknesses and mistakes of key Bible characters from Aaron to Zerubbabel. A dictionary-concordance to help you understand and research important words and concepts. Book introductions, maps, charts, timelines, and more. All in the popular New American Standard Bible--today's most literal word-for-word translation, now updated for greater clarity and readability.",
        "authors": "['Life Application Study Staff', 'Zondervan Publishing']",
        "infoLink": "http://books.google.nl/books?id=mV25HAAACAAJ&dq=Life+Application+Study+Bible,+Indexed,+NASB&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have always considered the Life Application Study Bible to be the best study bible ever made. Unlike most other study bible I own which offer a more doctrinal and expositional approach, this bible approaches God's Word in a very practical and timely method thereby making an impact in our day to day living. The recent addition of the NASB version further made the best even better for it is an accepted fact that NASB is the most literal translation of the bible in English today. The genuine leather is of a high quality and the printing excellent, which is expected from Zondervan. If you need a study bible which will make you connect to God's Word in your daily life, this is it!",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "If you're really serious about owning and studying from a true translation of the original Greek and Hebrew language, the Life Application NASB is for you! Because it is an Life Application version, its 10,000 study notes, 100+ profiles, maps, charts and diagrams, concordance and much more makes it even better.The only downside to the NASB is with its readability because it is the most literal word-for-word translation. However, the new updated NASB has made it easier to read without sacrificing accuracy as does the other translations such as the NIV, NKJV, or the NLT.As a bible instructor I use this version exclusively, as well in all my writings and publications. Again, if you're a serious student of the Bible, the NASB Life Application Bible is the best. If you're just a causal reader you might want to consider another translation because the NASB is written at the college level, whereas the NIV and the NLT is written for 8th and 6th grade levels respectively.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "If you can only afford one Bible, this is the one. It's like having a commentary built into your Bible and the maps and amenities are fabulous. Zondervan BTW is an 11 on a scale of 1 to 10 in terms of customer service. I had a small defect in my Bible and with one e-mail, Zondervan replaced the Bible with no questions asked.....and they didn't even request that I return the defective Bible. WOW!",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "There are three big decisions involved in getting a Bible, not counting expense.The first is the translation. If you want something to give you an easy, casual reading, and you don't care about accuracy, then the NASB is not for you. If you want something that is fairly accurate, but don't really care if it is precise or not, then the NASB may or may not be the best choice for you.If, however, you believe that the Bible is the Word of God, and you want it translated into readable modern English as precisely as possible, because you want to apply the Word of God to your own life, then there is NO other translation that will do. From my perspective in comparing both the Hebrew and the Greek, there is no other translation that even comes close to the NASB for accuracy, with the possible exception of the NKJV, which to me ranks a fairly distant second.The NASB is written in clear, readable 12th-grade-level English. That makes it a bit difficult to read for some. If you are willing to put forth the effort to let your life be stretched by the Word, however, is it not also worth the effort to let your English be stretched by the most accurate translation?One of the commentators on here mentioned that he preferred the NRSV over the NASB for accuracy. I'm afraid that is simply not correct. The NRSV is loaded with inaccuracies in translation, which appear to me to have been deliberately inserted to skew the translation in favor of a particular theological viewpoint, making it one of the LEAST accurate translations available.The second big decision is what kind of study helps to get. I find the Life Application editions well organized, easy to use, and Biblically sound, but to each their own. I suggest looking at some friends' copies to decide for yourself.The third is what kind of cover. The top-grain leather is the only one that will last a lifetime. (I know, I've worn out two split-grain editions and a couple of vinyl editions.)Don't think of it as a book. Think of it as a lifetime companion on the road to glory.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "This bible is a literal fresh perspective of the word of GOD. I think there are areas of the scripture that leave you confused if you are a NIV, KJ,...reader. The largest reason for this was a lack of literal translation prior to the NASB. When in doubt the dictionary in the back will help solve that problem prior to reading the scripture notes at the bottom of each page.The scripture notes really allow one to understand how the scripture relates to and about life. The features in this bible are top notch. This bible can give you light and understanding you have never known.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I bought this Bible to replace a bible that was bound with the \"Bonded Leather\" method. Other Bibles on Amazon.com listed \"Bonded Leather\" as the method, and this one was listed as \"Leather Bound\" in contrast.So I thought I was getting a Genuine Leather Bound Bible. I was wrong. I returned this Bible to Amazon and ordered one that was clearly described as Genuine Leather Bound.Bonded Leather is less durable than Genuine Leather. My current Bible is losing flakes of the \"bonded leather at the edges and it is spreading across the covers.I have no comments on the actual contents of this Bible as I never removed the shrink wrap once I saw that the cover said \"Bonded Leather\".It is probably a great Bible, but Amazon is doing a disservice with its description of the \"bound\" style.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "If you do your research, you will see that this is the best quality bible for a thumb indexed NASB Life Application Bible. If you want your bible to last as long as your notes in the bible, then this is the bible for you. Top grain cowhide rather than bonded leather is the way to go. Spend the money up front and get this bible. You won't be sorry.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I bought this for my husband. We both like the accuracy of the NASB, but it is hard to find a \"Life Application\" in this version, in the Christain bookstores. Also, the version itself when leather bound is usually high. The list price is absolutely accurate at over $80. I was lucky to get this at a sale price. The leather was black and had gold edging. Very nice.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a tough review in that religious perspective is always a debatable subject-area. I needed help in understanding some of the phrases about what I was reading, and the advantage of this Bible is that this Bible contains very informative commentary and historical perspective at the bottom of each page which helps in adding meaning to Bible study.As a former seminary student, I hesitate using any single form of reference when it comes to commentary, but I've found this Bible reflects an understanding that I perceive to be quite accurate and reliable. At seminary, there was an overall consensus that the NASB (New American Standard Bible) was actually the most preferred of the updated versions of Scripture to the King James Version. The NASB version has the reputation for being one of the most, if not, the most accurate version which is expressed in plain English, making it easier to read. I have to admit that I prefer the elegance of the King James style, but understandably, it has proven to be difficult to interpret by many, thus creating a market for additional \"easy to read\" versions of the Bible, such as the NASB version.If you're like me, and appreciate getting some help in understanding as I study, I highly recommend the Life Application Bibles. Again, there will always be those with differing opinions and reviews, but I have appreciated this Bible enough to have one in King James Version and also [the] NASB version. Serious students, however, should study by using various credible research sources to obtain a sound biblical perspective. Be reminded that it's not always what is printed, rather how you interpret what is printed, along with the Divine relationship that you maintain. The key to biblical understanding is realizing and knowing that the credibility of Scripture comes from it's own text which has sustained the test of time, and that it encourages testing its wisdom against our experiences in life and all other forms of education. May the Lord bless all of you in your journey and pursuit of Truth.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the nelson study bible nkjv",
        "description": "The NKJV Study Bible, Second Edition is the most comprehensive study Bible available! It has the most complete study system for pastors, teachers, or students who desire accurate study in God's Word. Using the trusted New King James Version, The NKJV Study Bible has \"the mind of a scholar and the heart of a pastor.\" Thomas Nelson's skilled team of scholars has produced the study system to reach for when accurate study in God's Word is the goal. Features include: More than 15,000 verse-by-verse study notes 150 Bible times and culture notes 114 articles on key Bible doctrines 350 word studies with Strong's numbers \"Christ in the Scriptures\" feature Topical index Deluxe Nelson concordance Full-color maps Part of the Signature Series line of Thomas Nelson Bibles NKJV Study Bibles sold to date: More than 1.3 million The New King James Version - More than 60 million copies sold Thomas Nelson Bibles is giving back through the God's Word in Action program. Donating a portion of profits to World Vision, we are helping to eradicate poverty and preventable deaths among children. Learn more and discover what you can do at www.seegodswordinaction.com.",
        "authors": "['Nelson Bibles']",
        "infoLink": "http://books.google.com/books?id=XGX7kQEACAAJ&dq=The+Nelson+Study+Bible+NKJV&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Nelson Study Bible NKJV is a Bible School in a briefcase. First, throughout the text are key definitions of Hebrew and Greek words set off in a separate box. These definitions, cued to the Strong's numbering, are easy to read, accessible, and meaningful. Study notes are lucid, especially with their historical background. Of particular use to praise/worship leaders and songwriters, is the addition of the thematic outline of many of the Psalms in the study notes. All of the Psalms are song lyrics (not poems). The word Psalms is from the Greek psalmoi (and the Hebrew mizmer) which means to pluck. Hence, Psalms is an arranging term from the Temple indicating that these songs are to be performed with plucked stringed instruments. For Christian songwriters, these study notes can be an invaluable guide to not only better understanding the individual lyric, but equally in creating your own new ones.The text has a very balanced view of the Holy Spirit which few should find fault with. NT study notes are equally lucid especially in explaining certain cultural issues, alternate translation possibilities, and clarifying difficulties from the NKJV translation of the Pauline epistles.Center column references are very practical and useful. There is a brief subject index for those liking the Thompson Chain Reference approach, and an excellent concordance spanning about 200 pages. There is a comprehensive outline for each Bible book, nearly as deep as G. Campbell Morgan's Analyzed Bible.The graphic layout is quite good and easy to read. Of all study Bibles of all translations, I rank this #1, followed by the NIV Study Bible, and the Spirit Filled Life Bible (NKJV - Jack Hayford Editor), and Dake (KJV only). Thompson's has a totally separate study approach and therefore isn't quite comparable to the others.Key word for this study Bible: balanced.A readership note: The NKJV is about a 12th grade reading level. By comparison, newsmagazines are written with a 7th grade reading vocabulary. Readers looking for an easier reading translation would do well to consider getting the New Living Translation to complement the Nelson Study Bible NKJV.I've selected the Nelson's as the study Bible of choice for Alexander University students taking our online Christian songwriting classes.",
                "review/helpfulness": "80/84",
                "num_reviews": 84
            },
            {
                "review/text": "I'm not a Christian but decided to purchase a bible to get this classic work under my belt. I wanted a study version though so I could get through the tougher parts without being baffled at the language or meanings. I purchased the Nelson version after reading many positive reviews and feel I made a great choice! Understandably, you need to be careful with study bibles in case you begin to adopt the editors' slant on things, but from what I can tell the Nelson team has done a fine job of retaining the integrity of the NKJV translation in their commentaries.I'm still on the Old Testament (2 Kings right now) and I've throughly enjoyed most every single chapter so far. Thanks to the well-written and not-too-long commentaries on many verses it's easy to comprehend the significance of the passages and understand some of the ancient practices prevalent at the time.Great maps in-text and at the back, helpful tables of dates and events, thorough cross-referencing, definitions of especially meaningful words in the Hebrew context, as well as in-text discussions of major concepts make this a definitive study bible for any NKJV reader and also as a reference work.",
                "review/helpfulness": "42/43",
                "num_reviews": 43
            },
            {
                "review/text": "Here is a Bible for serious study and/or devotion. The devotional quality is achieved primarily through the tone of the copious and scholarly notes, which are reverent, main stream, and remarkably non-intrusive. I have a number of other study Bibles, and have generally found them lacking.I appreciate the lofty literary style of the King James (Authorized) version, and wanted to try the New King James (NKJV). I have spent hours comparing the two versions. The poetic books are almost unchanged except for long obsolete words, pronouns and inflectional verb endings. The meter is unchanged. Other books have been further updated with modern sentence structure where it is most needed. The result still sounds magnificent and timeless, and glows like a freshly restored work of art.The Nelson SB contains a remarkably comprehensive concordance which contains proper nouns and describes them within the concordance listing. Thus the concordance can also be regarded as a Bible dictionary.There are eight pages of color maps in the rear. I would have liked a color map showing the twelve tribes at the time of the judges (after Joshua's conquest of Canaan), but the intext maps show this very nicely, so this is a quibble.Nelson's SB is most remarkable for its highly tailored, complete and accurate annotations, which can only have been achieved through a devotion to the work and a lot of toil. This book is quite evidently a labor of love, and this, more than any other quality ranks it as the finest SB I've encountered.I received the black bonded leather edition. Its Gold stamped quality leather cover and gold edged paper, as well as the overall high quality of workmanship make this book a delight to the senses. A real treasure all 'round.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "The Nelson Study Bible (NKJV) is a masterful conglomeration resulting from years of scholarly and Christ centered craftsmanship. This translation is very clear and throughout its tenor maintains a strong stabilty as the words flow together with eloquence. Certainly, the editors and contributers of this translation achieved what was necessary for producing such an excellent Bible.The foreward proves itself very welcoming by concisely exerting the main features as a helpful tool in studying the Word of God. The preface explains the history of the NKJV, the precision and accurracy of the translation, the devotional style for the reader, and the general format for the Old and New Tesaments as a whole.Some aspects that will be beneficial and enjoyable while reading this Bible are the in-depth prolouges that describe who the author was, when it was wrote, and for what purpose the author served in writting the book. On top of all of this are finely arranged outlines and timelines to further your aquiantance with the general themes of that particular time in antiquity. There are 350 words held equivocal in this translation, so the scholars provived a section for these terms and called it 'word focus.' The words are discussed with regard to the context in which they are used, and their meanings and biblical usage are explained wonderfully. Also the scholarly commentary, the vast array of maps, pictures, charts, graphs, and cross-references add all the more radiance to this edition. To cap it off, there lies in the back a subject index to the annotations and special features provided in this Bible. Following that I found the Concordance and colorful maps in the back to further add prestige to the Nelson Study Bible.So for the overall quality of this Bible I would highly recommend this work to anyone who wishes to grasp ahold of a great study bible. For the evangelist, pastor, and lay person alike, the Nelson Study Bible will be a tool to refine yourself as a Christian, and to bring those who are less familiar with the faith to reconciliation with God.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "The content of the Nelson Study Bible is analogous to its binding. It looks great, but after a little use, it falls apart.Some of the graphics in this Bible are excellent. The frequent maps are helpful and the diagrams really explain the text. The page layout is clear and neat. The cross-references are thorough and have some fun features.But the annotations are awful. The annotators either ignore, or are unaware of, modern scholarship. The introduction to Genesis reads, \"Genesis was written and compiled by Moses in the Wilderness of Sinai\" (p. 1), ignoring source criticism. Song of Songs is \"a moving love story about a young country girl and King Solomon\" (p. 1097), ignoring the difficulties in interpretating this text. The annotations are padded with paraphrastic summary, and when they give information they tend to enter polemics (\"Mary was blessed because she received God's grace, not because she bestowed it\" [p. 1686]) or excuses (\"The apostles did not take Jesus' words to mean that they had the power to forgive sins\" [p. 1808]).Some of the features are superfluous. The \"WordFocus\" studies highlight words in Greek or Hebrew and give them lengthy explanations. This reflects an unfortunate Evangelical trend where people ignorant of Greek or Hebrew do \"word study\" with a lexicon. This leads to invalid doctrinal conclusions (cf. D. A. Carson's \"Exegetical Fallacies\").Some of the charts are great, but most are not. For example, see \"Isaiah: A Bible in Miniature?\" (p. 1144). Here we learn that Isaiah has \"66 chapters\" while the Bible has \"66 books.\" Entertaining, but a waste of space.Dr. Radmacher's essay on how to read the Bible is poor. The essay works from his premise, \"meaning is singular\" (p. xiii), which is not an historical Christian way of approaching the Bible. This \"fundamentalist\" approach is a disservice to both Fundamentalists and others.Finally, the binding: some of the pages fell out of the back after a year.If you want an explicitely Protestant study Bible, there are a host of others. Keep looking.",
                "review/helpfulness": "17/23",
                "num_reviews": 23
            },
            {
                "review/text": "This study Bible is actually the new and improved version of the now discontinued \"Open Study Bible.\" Therefore, my review will be in two parts--the first for those that already own the \"Open,\" and the second for everyone else.The \"Nelson\" doesn't have much more than the \"Open.\" The main differences are in layout and extra colorized feature pages. Also, I happen to prefer the \"Open\" with its dictionary at the beginning of the book, as it makes a nice buffer between Genesis and the cover. It greatly reduces wear in the spine in the first couple of books. The full color pages in the \"Nelson\" that I just mentioned make thumbing through the Bible a little difficult, as your page flipping becomes hindered by passing a glossy thick page every fow hundred pages. They just make the book overall open and lay awkwardly. The \"Open's\" layout is simpler and better, I think, and leaves much more Bible text per page. It's not cluttered with hundred of magazine-article like topic headings. In short, it's not worth the money to switch to the Nelson.Now, if you have neither, I suppose the best idea is to get a \"Nelson.\" For one, the \"Open\" is discontinued, so I guess you'd have no other choice in most cases, depending on which edition you're interested in, although there are still a few \"Opens\" for sale on Amazon. Overall, the \"Nelson\" is very full and informing. It makes a great secondary Bible, and if you don't mind many pages containing only a few paragraphs of Bible text, a great primary Bible.Doctrinally, the \"Nelson\" is fairly middle of the road. Pretty much any Christian would find this Bible usefull and non-threatening to their personal beliefs.Of all of the major study Bibles, the Nelson is quite the best choice for anyone.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "I was using an NRSV Life Application Bible, which I was pleased with, but wanted something with more depth to the comments. I looked over several study Bibles (Ryrie, New Oxford, NIV Study...), and felt the Nelson was the best by far. Cross refs. are relevant, and the on page comments are the best I've seen - they go into great depth and deal with the heart of the matter. The 200 page concordance is also a plus, as are other features. I wasn't sure about the NKJV (only choice), but took a closer look and am very pleased.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "When I needed a good NKJV study Bible, this seemed like the obvious choice. I've used The King James Study Bible by Thomas Nelson for a few years, and it's been extremely useful and informative. My wife uses The New Spirit Filled Bible (NKJV) which is also by Thomas Nelson. Those are the two Bibles I'll use in comparison to The Nelson Study Bible.The strength of this Bible is in the annotations at the bottom of each page. Nearly every verse is expounded upon. While I can't fault the editors for being thorough, the sheer volume of the notes causes one to bypass them altogether, unless he has a question about a specific verse. This version does not have any form of The King James Study Bible's Doctrinal Footnotes to lead the reader through a systematic study of the Bible's teachings. Nor does it offer Personality Profiles or Archaeological Sites, as the KJV does.This version does offer WordFocus Word Studies, which are very similar to Word Wealth offered in the New Spirit Filled Bible. In both versions, these are sprinkled throughout the text near relevant verses. Finding a particular word study is no problem in the Spirit Filled Bible, because there is an alphabetical listing of them at the front of the book. However, in this version the listing is not alphabetical, but instead lists them in the order they appear in the book, making it very difficult to find any particular word. The same is true of the listings for the \"InDepth Articles,\" the \"QuickView Charts,\" and the \"InText Maps.\" How hard would it have been to list these alphabetically? The WordFocus studies are not even cross-referenced in the text as they are in the Spirit Filled Bible, so finding one occurance of a word won't help you find its word study.Most Bibles have a section in the back where miscellaneous materials can be found. Things like a harmony of the Gospels, listings of the teachings of Christ, etc. This Bible does have many of these features, but they are spread randomly throughout the text. They are all listed in the tables of contents, but I've already described what a catastrophe those are.Despite the claims that this Bible was years in the making, I feel it is basically shovel-ware. There is little organization, and the features that are included are not easy to find. If bottom-of-the-page annotations are what you're after, this Bible offers lots of them. But if you're looking for comprehensive study features similar to those in The King James Study Bible, keep looking. That's what I'm going to do.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "This Bible is easy to understand due to the extensive use of word studies and articles sprinkled throughout. When you are reading something you wish you knew more about the information is right there on the same page. No need to flip thru the index looking for more information.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Nelson hit the mark. If you're looking to buy a single source for study or simple inspiration, this is the one. Serious students and lay people alike are going to be pleased. The text on mine is a tad small, the genuine leather version is a tad pricy (as with anything, you get what you pay for), but I know it is something I'm going to use for years and years. You'll regret buying the &quot;other&quot; Bible on the rack. Trust me. It's easy to use and the cross reference system is a snap. The &quot;study&quot; notes are informative without being intellectually invasive. It's sturdy too (that's a real consideration if you take your Bible everywhere). I know I can spill coffee on it, use it as a pillow on long trips (leather softcover version) and still take it out and read God's word in small group study. Buy it. Real men still love Jesus. Peace.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "biblia de referencia thompson dos tonos negromarron spanish edition",
        "description": "For 25 years the Holman Illustrated Bible Dictionary has been the go-to Bible reference resource for lay Bible students, teachers, pastors, academic courses, and libraries. Now this bestselling dictionary has been UPDATED with 200 new articles and over 500 new photos compiling a collection of over 6,500 articles from Aaron to Zuzite are written so as to equip the reader for greater competence in understanding and interpreting the Scriptures. TAn excellent companion to the Holman Illustrated Bible Commentary.",
        "authors": "['Chad Brand', 'Eric Mitchell', 'Holman Reference Editorial Staff']",
        "infoLink": "http://books.google.com/books?id=jgxCDwAAQBAJ&dq=Biblia+de+referencia+Thompson,+dos+tonos,+negro/marron+(Spanish+Edition)&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 82.0,
        "review": [
            {
                "review/text": "Well, this bible is just great. We know how good and useful the Thompson Study Bible is, but this version is excellent. The colors of the leather are nice and it is much more manegeable because they are soft. This is what I was always looking for in a Thompson Bible. Bye to hard cover. Well, this is the only different feature in this blible since everything else is the same as any other Thompson study bible so you know you get the excellent quality a Thompson sutudy bible has.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "The bible was bran new and came very quick. Also to get a Thompson chain bible for $19.40 is un heard of....i was satisfied.Just make sure you dont make the same mistake i did, i ordered spanish when i wanted english...my fault.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "bible workbook volume 2 new testament",
        "description": "The Bible Workbooks are a systematic, individual study of the Bible. The student learns by doing; information is given and questions are asked to test their understanding. Bible Workbook Volume 2 gives an overview and a book-by-book study of the New Testament. Interesting, stimulating, and informative, Bible Workbooks provide an understandable and enjoyable means of personal Bible study.",
        "authors": "['Catherine B. Walker']",
        "infoLink": "http://books.google.com/books?id=-FkGAAAACAAJ&dq=Bible+Workbook,+Volume+2+--+New+Testament&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have seen other books that focus on specific topics. These workbooks just cover a general intro to the bible. They are easy to follow and have maps, questions, and blanks for you to write in. I am looking forward to finishing it and starting with the Old Testament version.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "There are definitely things you should know about this workbook before you purchase it. First, the most recent copyright is 1952. Second, it is directed to High School age. Third, it is meant for group study.Ms. Walker knew her bible, and includes lots of useful background information. She asks good questions. She keeps the lessons moving along. I found this workbook useful and informative.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "niv study bible large print indexed",
        "description": "With over 9 million copies sold, the bestselling NIV Study Bible features a stunning four-color interior with photographs, maps, charts, and illustrations. This fully revised edition includes dozens of new articles and a thorough update to all its study features set in Zondervan's exclusive NIV Comfort Print typeface.",
        "authors": "['Kenneth L. Barker', 'Mark L. Strauss', 'Jeannine K. Brown', 'Michael Williams', 'Craig L. Blomberg']",
        "infoLink": "http://books.google.com/books?id=lrDTywEACAAJ&dq=NIV+Study+Bible,+Large+Print,+Indexed&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is the King James Version of the NIV Study Bible--the notes are basically identical, just adapted to the KJV wording. The notes and references are plentiful--some may say there are too many! Nearly every verse of the Bible is covered with a comment or outline of some type. While this is a conservative study bible, sometimes other more liberal interpretations are listed along with the conservative position. Besides the copious and helpful notes, there is a subject index, concordance, and colored maps and a historical timeline. Interspersed throughout the entire Bible are pertinent maps, charts, outlines, etc. The KJV Study Bible also has brief word definitions or substitutions for outdated words listed in the center column, which is helpful if you prefer the KJV but stumble on some of the wording.The binding and pages are typical Zondervan---cheap and not likely to hold up long. I have the large print edition; the print is wonderful to read, but of course makes this book HUGE and heavy--not a Bible to carry around.All in all, this study bible will give you hours and hours of reading and study pleasure.",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "First of all, I love to study the Word of God. It is practically all I do in my free time as of late. To do that, I need a Study Bible that gives me extensive notes, maps, charts, tables, etc. that let me know just about everything I really need to know all in one book.There is only one book that has stood up to my expectations and has given me all that I have wanted for the most part. It is the Zondervan KJV Study Bible. Not only is it the classic King James Version (in my opinion, the most accurate) but I get all that I want. The notes are rich in content and will satisfy anyone who likes to delve into Scripture. The tables and charts help explain major aspects of Scripture that are in best expressed in that format. At the beginning of the book, they even include a time line that presents the major Biblical events from Abraham to Christ.This has got to be the ultimate of ultimate Study Bibles!! (For those of you who enjoy the NIV, there is also a Study Bible by Zondervan that gives you the exact same content that this Study Bible does.)",
                "review/helpfulness": "29/31",
                "num_reviews": 31
            },
            {
                "review/text": "The Thompson Chain Reference KJV has been my primary Bible since 1984. Based on a desire to dig deeper and get more perspective, I started to look for an additional Bible.The Zondervan KJV Study Bible has been a great choice. I went with the same translation to keep a continuity when cross-referencing.The Study Bible has great resources, specifically book introductons, center column reference, and study notes at the bottom of the page.In the near future, I am hoping to add a NASB (Life Application or possible Classic Reference) and an Amlified Bible to the library. This is not out of inadequacies with this Study Bible - just as glimpses into additional resources.Bottom-line: I would encourage looking into any Zondervan Study Bible, regardless of translation. The Zondervan site ( http://www.zondervan.com ) has also been a great tool when looking for a good fit for my Bible needs.",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "The NIV Bible has allowed me to read the Bible and understand it for the first time in my life. I have always known God had a plan written for me but it seemed like it was in a foreign language and unreachable.It is easy to read and the scripture reference which relate to different topics has helped me to see the Bible is all relevant and not just a compilation of unrelated stories. The Old and New Testaments are brought together with clarity with Old Testament prophesies vividly revealed in the New Testament.As a new Christian, it truly is the Bible I read and study everyday of my life so that I may continue to build a closer relationship with God.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "The large print edition is really a misnomer. This edition contains normal sized print and is very readable.I started with the regular print edition and had difficulty with the small font used on the main text. It is quite compressed. The large print edition uses an 11 point font and leaves more space between the lines. Both editions use the same page size, so the large print edition has more pages to compensate, but not so many that the book becomes unwieldy.Surprisingly, I did not have difficulty in the regular edition with the small font used for the extensive footnotes . Still the footnotes are even easier to read in the large print edition. If you're eyes are on the border, or you expect to use this bible past age 40, you'll probably appreciate the large print edition.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book will open your eyes to the truths that our society has been ignoring for much too long! An excellent guide for the post-modern thinker. Contains key concepts that will change your life, helping you too live happier and healthier! I believe that everyone needs to read this book, if only to open their eyes to see what our society has turned into instead of going through our daily routines, ignoring what other people have instilled in our brains, telling us how we should be living our lives. This is a very very important book and must be read as many people as possible. After you read this book you will begin to notice things happening in the world that you haven't noticed before. It will open your eyes to a new way of living, a better way of living. I recommend this book to all of you.",
                "review/helpfulness": "11/17",
                "num_reviews": 17
            },
            {
                "review/text": "The NIV Study will be the standard in classic study bibles. It was the first bible when I became a Christian 15 yrs. ago, and now I still reference it every day. The leather bound large print is not only compleatly functional for easy reading but feels comfortable, and looks good. My husband Walter uses it as his main Bible. When I first purched it for him he explained &quot;this is the one for me!&quot;. The feature of it being indexed adds very much to it's characture A definite must for a home that needs a good reference large print.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "As a former publisher of Christian material, a comprehensive study Bible was essential to my profession. Although I have several Bibles, this one with the large print is definitely one of my favorites.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "The NIV Study Bible has been an excellent source of information and interpretive help in studying scripture, for my husband and myself.The charts, timelines, maps and chapter overviews and outlines provide rich groundwork for the reading and study of the Word.It is my first choice when re-reading and researching a passage that is not clear.The NIV Study Bible is a must for the library of any student of the Bible, and every believer.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Nearly every verse has detail comments and they are very teachable useful tools.So much information given and very available. So many illustrations, maps of journeys, temple constructions etc. Plenty of subjects and color maps at the end of the bible.Will presented, very thought through and highly recommend this KJV self study bible",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "crudens complete concordance",
        "description": "Bible students have enjoyed Cruden's easy-to-use format and portable size for over 250 years. Available in both cloth and soft cover editions, this valuable reference is handy for fast word studies or just for finding a favorite passage. It is ideal for busy Bible students, teachers, and pastors who need a convenient and portable concordance. \"Cruden's Complete Concordance\" enables the reader to quickly locate all of the occurrences of any given word in the Bible. - Includes an alphabetical listing of every word in the King James Version, along with over 200,000 chapter and verse references - A complete concordance to proper names in Scripture - Handy for word studies or just for tracking down a favorite passage Special features include: - Cruden's original notes and comments on Bible places, names, and types - Names and titles given to Jesus Christ - Titles and description applied to the Church",
        "authors": "['Alexander Cruden']",
        "infoLink": "http://books.google.com/books?id=9ESkAAAACAAJ&dq=Cruden%27s+Complete+Concordance&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "A Bible verse flits through your mind, but you can't remember it exactly, and you're not sure where to find it. You look in the Concordance in the back of your Bible. No help. Even the gigantic Strong's Concordance (which gives you a hernia to lift!) doesn't help because it's keyed only to the King James translation. Cruden's to the rescue! Look up a key word and you find the reference in 'most any translation. Example: you remember somewhere in Scripture the phrase, &quot;God inhabits the praise of His people. So you look under &quot;praise&quot; and you find Psalm 22:3: &quot;OH Thou that inhabitest the praises of Israel.&quot; OK, so you didn't recall it quite right. Now you know. Another example: you're curious what the Bible has to say about JOY. Wow! More than 2 columns of references on joy and joyful! A Bible study in itself. As a writer, I adore this book, but anyone who loves God's word and studying it will, too.",
                "review/helpfulness": "52/52",
                "num_reviews": 52
            },
            {
                "review/text": "Although I have both Strongs and Youngs concordances, this one is an excellent choice for your bible readings and research while either on the road or when you simply want to get quickly to the scripture you remember and wish to reference directly. What this has is so many variations of the scripture by word, and the quick short sentences or snippets of scripture will make it very easy for you to find what you are looking for. Although, the more words you remember from a scripture the better/quicker to find it.If you are not necessarily a researcher and/or someone giving messages or communicating the gist of scripture, this is an excellent reference work. If you wish to have the basic Hebrew or Greek words from which the English derives from then the above two mentioned reference works are best (athough there is a view that the Youngs and Strongs are strongly influenced away from the Koine Greek.)I just love the Crudens for when I travel, usually light weight and even in the complete edition, not so bulky as to take up too much space. A definate for any library where someone reads the Bible from time to time to the seriously studious who needs a quick look up.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Note: Your \"helpful\" vote is appreciated. Thanks.My copy of \"Cruden's Complete Concordance\" has been well used over the decades. It should be updated into a larger format with larger print, but it is still a valuable work of some 800 pages.Any word found in the Bible can be easily located, including variations of the word. For example, there is a listing for \"fatlings,\" \"flatling,\" \"fatness,\" \"fats,\" and \"fatted.\"Highly recommended along with:\"The New Smith's Bible Dictionary.\"New Smith's Bible DictionaryNew Smith's Bible Dictionary",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "new international encyclopedia of bible characters",
        "description": "The New International Encyclopedia of Bible Characters is a complete index of every person named in the Bible, from Aaron to Zurishadai. Discover the roles that men and women-from the obscure to the famous to the infamous-have played in the unfolding story of Scripture. Entries range from one-line biblical references for minor characters to full-length articles that address the theological significance of over forty major figures. With entries based on the New International Version?today's most read, most trusted Bible translation?this easy-to-use volume will help pastors, teachers, students, and church workers quickly and easily identify and understand the importance of every person in the Bible. The New International Encyclopedia of Bible Characters features contributions from top biblical scholars of the United States, the United Kingdom, and Australia. In addition to the alphabetic name-entries, twenty supporting articles shed light on topics of particular interest and relevance, such as: Kings of Judah and Israel Women in the Bible Children in the Bible The Apostles Pharisees The Elderly in the Bible Angels in the Bible Jewish Genealogies -ZONDERVAN'S UNDERSTAND THE BIBLE REFERENCE SERIES- This four-volume series supplies users of today's most popular modern Bible translation, and New International Version, with scholarly, economical, and uncompromisingly evangelical study tools. It includes: New International Bible Commentary New International Encyclopedia of Bible Words New International Encyclopedia of Bible Difficulties New International Encyclopedia of Bible Characters",
        "authors": "['Zondervan,']",
        "infoLink": "https://play.google.com/store/books/details?id=vxNRCgAAQBAJ&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "Since I bought this book, I have not been able to put it down! This easy to use reference lists every person (including all those listed in Chronicles!) named in the Bible and gives a description of the character based on the Scriptures. All entries are cross-referenced to their location(s) in the verses.While nothing can replace the original Bible for discovering the men and women of God, this books pulls together all the information under each character into one crisp, flowing summary. There are over 40 major characters that receive extended articles from Abraham to the Woman at the Well. Under Paul's article, there are entries for specific events in his life, his missionary journeys, and the themes that run through his writings and teachings. Additional articles also give an overview of certain groups, such as the Judges, Kings, and Prophets.The only drawback to this book is the lack of a pronunciation guide (you'll have to look that up in the Bible Dictionary of the same series) but the meanings of names are given when known. This minor oversight is negligible for such a great reference work. Whenever I am studying the Bible or preparing a lesson, this book will always be in reach.This book is part of Zondervan's six-volume &quot;Understand the Bible&quot; Reference Series. The other titles are New International Bible Commentary, N.I.B. Dictionary, N.I.B. Concordance, New International Encyclopedia of Bible Words, and the N.I.E. of B. Difficulties. Be sure to check those out also.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I have often referred to Encyclopedia of Bible Characters when preparing Bible study lessons or for my own personal study.The book contains valuable information (Bible verse reference, contribution, significance, etc.) of each person mentioned in the Bible. Knowing more about a particular will enhance your Bible study as you realize that the people of the Bible were much like we are today, strengths and weaknesses!A highly recommended buy, the title will be a valuable aid for the reader in learning more about the many colorful characters in the Holy Bible!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I was very pleased to find that this book far exceeded my expectations for providing background information on the major characters in the bible. It really helps in the study of the Bible because it adds background information about major events and links them to the characters and their roles in the events.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "hayfords bible handbook the complete companion for spiritfilled bible study",
        "description": "The Hayford Bible Handbook continues to offer charismatic and Pentecostal Christians a major reference tool that provides easy access to a wealth of biblical and practical information",
        "authors": "['Jack W. Hayford']",
        "infoLink": "http://books.google.com/books?id=kgudzgEACAAJ&dq=Hayford%27s+Bible+Handbook+The+Complete+Companion+For+Spirit-filled+Bible+Study&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "With an easy read Commentary, Bible charts and Encyclopedic Dictionary this is a good &quot;all-in-one&quot; study guide. Designed as a companion to the &quot;Spirit-filled Study Bible&quot; this book is great for someone wanting to start getting into study of the Bible without getting too overwhelmed.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I found the Hayford bible handbook to be a very helpful tool in studying the Scripture. The charts for me are particularily helpful for understanding concepts and timelines. This is a great all around reference tool to have in your library!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Dr. Hayford offers an understanding of the bible from a charasmatic perspective. It is definitely well worth the money. What I liked particularly was the Encyclopedic Dictionary. It gives a well rounded overview of different biblical and theological terms. My only critisism is that his coverage of the different books of the bible is too brief. This probably should have been a three volume handbook.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the womans study bible",
        "description": "With this redesigned, full-color edition of Thomas Nelson's best-selling, The Woman's Study Bible, women of all ages can experience the renewal, hope, and transformation that only God's Word can bring.",
        "authors": "['Dorothy Kelley Patterson']",
        "infoLink": "http://books.google.nl/books?id=DyFdAQAACAAJ&dq=The+Woman%27s+Study+Bible&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Working in a Christian bookstore exposes me to hundreds of Bibles but I find this one to be not only an effective study tool but a foundation for developing character, integrity and understanding God's plan for women. Informative helps, devotions and biblical references combine together presenting a strong biblically based cornerstone for today's Christian woman.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book has been great in revealing how a Christian woman should live, and which tools are needed to do so. Many Bibles claim to be geared toward women, but this Bible definitely reaches the depths of womanhood. Along with interesting portraits of women in the Bible, this study Bible goes into intricate detail about the people, land, and enviroment surrounding the Old and New Testaments.This is a MUST HAVE for all women....Read and be BLESSED of GOD!!!!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I actually bought the paperback version of this book and I couldn't be more pleased with it. I love the study materials it includes, such as pages on the flowers and herbs of the bible. The footnotes on the bible verses are so easy to understand. I recommend buying the hardcover version because my paperback is already showing a lot of wear, and I've only had it about 3 weeks. It really focuses on the relationship between women and God.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The Women's Study Bible is all it's title states and more. Not only do you have a comprehensive study bible but a rich tool for applying God's Word to a womans daily life. The wonderful helps section leads a woman to specific areas of interest from portraits of women in the bible all the way through what the bible says about specifically female issues. It is a rich tool for individual learning, discipleship and biblical counseling. Truly a MUST HAVE for any woman of God.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "smallest bible",
        "description": "The most portable NKJV Bible ever, its small size and snap-flap will travel in pocket, purse, or pack easily. Beautifully colored, high-quality leather bindings make it a perfect gift for birthdays and special occasions, for hospital visits, or with floral baskets.",
        "authors": "['생명의말씀사편집부']",
        "infoLink": "http://books.google.com/books?id=4yAwNwAACAAJ&dq=Smallest+Bible&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This Bible is excellent for travelling! It is not only a New Testament and Psalms, but a complete Bible in a very small (lightweight pages) but durable format. I use mine all the time and have also purchased it to use as a gift for friends who fly a lot.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "The Nelson's smallest Bible is an extremely portable 3&quot; x 5&quot; genuine leather Bible. It is about as big as most Gideon vest pocket New Testaments w/ Psalms and Proverbs and about twice as wide. If you travel a lot or you want to carry a Bible with you at all times, I would definitely recommend this Bible. However, there are two cons: 1)The print is so small that a magnifying card is provided, 2)This is the King James translation.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "In the year 2003, I optaiend a copy of this fine Bible. My Brother purchased it for me for my Birthday. It has, ever sence, accopmpanied wherever I go, situated in my upper [...] pocket. When I take a walk to the park, go to Nashville on buisness trips, or am waiting for someone, this handy Pocket Bible is with me.It's everything one woudl desire in a Bible that wa smuch larger, including the complete 66 book cannon used by most Protestants.( It omits, alas, the Apocrypha, not foudn in most KJV Bibles,and which woudl have been difficult to include giventhe size anyway.)Its sturdy, reliable cover, made of Bonded leather, gold, gilded edges, whihc on mine have steadily eroded off due to use, thin, but durabl an stong, pages, and clear, crisp type. Although the font size is extremely small, the book comes with a handy magnification lence.It does not, hwoever, have a snap flap, or any oher sort of flap, to protect hte book, rather, it looks identical to a larger Bible, as just the covers.The edition I own, and displayed here, si the Authorised King James Bible,the most beutiful, stirring, and masterful translaiton in English, and the most Faithful translaiton thusfar in English.I know others will disagree, and one reviewer even used this as a con, but it is the Bible of preference for me, without getting too much into a debate.It certainly is a helpful Bible to have on hand for travels or small trips, and will be a blessing to whoever owns it.Mine has withstood abuse, and keeps on standing up, with crumpled pages and a bent cover, but still usable and in excellent shape. Not bad for an object in my pocket for three years.I'll let it go with this.God bless.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "naves topical bible",
        "description": "A comprehensive digest of over 20,000 topics and subtopics with more than 100,000 associated Scripture references Features \"Zondervan's Pictorial Bible Dictionary, \" which contains more than 5,000 entries and 700 images that embrace the complete spectrum of biblical concerns 1,616 pp.",
        "authors": "['Orville J. Nave']",
        "infoLink": "http://books.google.com/books?id=BHlkOQAACAAJ&dq=NAVES+TOPICAL+BIBLE&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": 22.0,
        "review": [
            {
                "review/text": "This book is an excellent resource, but the kindle version leaves a lot to be desired. There is no table of contents so you will have to scroll page by page to get to the section you want. There is also no search function, which is a major flaw since this is a massive book. Lastly, the reviews I read prior to buying were for the printed version, not Kindle. I would not reccommend this version until the navigation problem has been redone.",
                "review/helpfulness": "99/104",
                "num_reviews": 104
            },
            {
                "review/text": "If I was told that I could only have my Bible plus three other books for sermon and Bible study preparation, the three choices would have to be Strongs concordance, a good Bible dictionary, and Nave's Topical Bible.Nave's has more than 20,000 topics leading to over 100,000 scripture references providing Biblical insight on a multitude of subjects. Just as importantly, this is no flash-in-the-pan, here-today-out-of-print-tomorrow study tool. Nave's has withstood the test of time and met the needs of millions of users down through the years. This is a work that no clergyman or serious reader of the Bible should be without.",
                "review/helpfulness": "54/57",
                "num_reviews": 57
            },
            {
                "review/text": "This is a logical grouping of verses based on the topics they deal with. This is the perfect tool if you want to know all the verses that apply to a certain topic. The only critique is that Nave's needs to be updated. Much of the language is outdated and it is sometimes hard to determine what heading the verses you might be looking for are under. For instance, greed is under Covetousness. While this instance has a cross-reference pointing you to the right heading, many words do not. Despite this critique, this is one of the best resources for Bible study.",
                "review/helpfulness": "31/34",
                "num_reviews": 34
            },
            {
                "review/text": "Nave's is a great topical reference, but this Kindle version does not have a table of contents which makes referencing any book difficult, but is especially troubling for a reference work. Don't waste your money on this title.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is an indispensable tool in any family's study of the Bible, particularly for young readers, for topical studies or for moments when you would use Strong's but cannot remember the exact wording of a passage.The binding of this edition is of better quality than the slightly less expensive version offered by Nelson, and while the paper stock will tend to yellow and brittle with age, this edition should be able to take a decade or two of heavy use without exhaustion.An excellent, affordable resource. Highly recommended.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "A good topical Bible is needed for subject studies and for preparing messages.The Nave's Topical Bible can assist the novice and the expert review scriptures by topic and it tends to be pretty exhaustive. There are times where other related scriptures are listed as opposed to quoted. This is a great resource if we are seeking scriptures to instruct us on various topics about living life. Also subjects about people in scripture or just any topic is listed.Anyone using this can do so as a jump off point to additional studies and Naves is the best for your buck.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I thought I was purchasing the Nave's Topical Bible, it is only a reference manual, no links, no verses, nothing. The Kindle Nave's KJV is better and works much like an App.Nave's Topical Bible, King James Version.If you go with a Kindle version, get the KJV. It's 3 times the file size with good navigation and active verse links in full screen.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Having no table of contents is a major detriment to the value of this purchase. Let's hope they remedy this in a timely fashion.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This purchase was a waist of space on my Kindle and a waist of money.No table of contents or easy way to do a topical search for anything. You must use a tedious scroll at best to find anything. I will delete this and anything else setup like it from my Kindle. I see no benefit to keep this on my system.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "The kindle version of naves topical bible is not a good buy, I would call it useless but I like the hard cover. I find this version extremely tedious to use because there is no search function or active table of contents...much work (preferably an improved download) needs to be done before I could recommend this to anyone.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "zondervan niv wide margin bible",
        "description": "Larger print Single-column format Wide-margin text Red letter NIV Concordance 16 pages of full-color maps Lifetime guarantee 1,728 pp.",
        "authors": "['Zondervan Publishing']",
        "infoLink": "http://books.google.com/books?id=rJHGPAAACAAJ&dq=Zondervan+NIV+Wide+Margin+Bible&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I've used this bible for a few days now and I find it very helpful and easy to use. The font size is larger than I thought it would be, and makes for very easy reading. There is plenty of room on each side margin for notes, and also many blank pages at the back for more detailed and complete notes or observations. The size of this bible is very nice for me as well, as it's somewhat smaller than most wide margin bibles, which I find easier to carry in my everyday reading and studying. Also, the binding, although somewhat stiff now (I can tell it's brand new), is well done and should soften up nicely with age. Finally, I like the fact that there are no commentaries or notes at the bottom of the page. I like to learn about the bible on my own, and I find this one very helpful because I don't have someone else's notes taking up space.Now - the negatives:1) The words of Christ are in red-letter format. This doesn't bother me at all, but I know it does some people, so if this is important to you, you might want to look elsewhere.2) There are very few references to other verses, and little in the way of footnotes. If you are looking for a comprehensive study bible, this isn't the one for you.3) There are no wide margins on the top and bottom of the text - only the outside margin. I don't mind this, but if you need the extra room, this one might not work for you. (Although the text is single-column, so you don't have to worry about fitting as much on a page as you would if you were writing notes for two columns.)All in all, I enjoy this bible very much. The font size, margin space, and physical size work very well for me, and although it's not the most comprehensive bible out there in terms of notes and references, if you're like me and just want to discover the text of the bible for yourself, but need a little extra margin room for notes, you should find this bible very helpful and useful!",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I've used many different Bibles over the years and this is the only one that has ever really satisfied me. Being a cronic note taker I felt stifled by most study bibles that wanted to tell you every thing but never let you interact with the text; in other words, when a great application of scripture came to me, I was forced to dig for a notebook, only to lose it days later. One note, however, the pages are a little thin, so if you're heavy handed like me there will be imprints of what you wrote in the margin several pages later, but no worse than most other books. Bible includes the venerable and popular NIV translation.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I just received this Bible yesterday and it is like a breath of fresh air. Finally I have room to write my study notes in my Bible. There is a decent amount of space on the margin on each page to write your study notes right next to the Scripture passage. And there are even blank pages at the end of the Bible specifically designed for the purpose for writing additional notes.Even though I only just received the Bible, I have already put it to use and it is already one of my favorite Bibles I have ever owned because it is so useful and practical.One thing that may be a detraction for people is the absence of study notes or commentary in the Bible. For me, though, this is actually a bonus. I do not dig built-in study notes or commentary in the Bible. I also appreciate the single-column format of the Bible-- it makes it more readable for me.What could have made this a better study Bible for me are several things. First, I actually would have liked slightly wider margins on the side, as well as larger margins on the top and bottom of each page for additional space to take notes. I also would have liked even larger print. I also do not dig Christ's words in red. I prefer black lettering throughout the Bible. I also wouldn't have minded a larger concordance in the back either. But I suppose you can't have everything.Again, if you like to take notes in your Bible and find that you never have any room, this Bible is for you. I really like this Bible a lot, and I actually wish I could stock up several more copies of this Bible before it goes out of print.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Most Wide Margin Bibles of any translation cost around fifty dollars. This one not only has wide margins, is an NIV, but has a concordance and a ton of pages to take notes at the end. I really would recomend it.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This Bible is good for notes in the side columns, but would probably be better if there were lines out to the side instead of the current wide open format. This would also be better with a scripture reference column and actually more room to take notes. I was disappointed with the cover bending so easily. This would be better in a genuine leather cover.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is great for note taking (over 1 and 1/2 inches wide on the two outer edges)! The tops, bottom, and inside (binding) margins don't have as much room (about a 1/2 inch top and bottom with 1/4 inch on the binding edge--almost impossible to write on this 1/4 inch due to the binding). Good tool for those who need some writing space like me.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "The NIV wide-margin bible by Zondervan is great. I love it.First of all the size of this bible is just right. I was afraid it would be too bulky, but it's not.The printing is excellent. The letters have the right size, not too big, not too small and the printing is very clear. See the Zondervan website for a nice sample. The one here on Amazon doesn't give an accurate picture at all. This bible is excellent quality. Very easy on the eyes, very clear, very nice.The main feature I bought this bible for is the wide margin and I'm very pleased with it. It's 1.5\" on the outer edge. There are also blank pages in the back.Not much of anything else though, it's not a study bible. There is an explanation of weights and measures in the back, a concordance and some maps. That's it. So if you need a lot of extras this is not the bible for you.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I bought this Bible and found it to be very helpful in note-taking, as well as during my personal study time. An economical no-nonsense Bible that is very useful. I would suggest reading other translations as well or using some helpful online guides in Hebrew and Greek.The Bible is quite durable and will probably last five years. If you use your Bible a lot, that's pretty good...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am in seminary right now at Vineyard Leadership Institute and I bought this Bible specifically so I can use it for taking notes in school in the margins.Regardless if you are in a Christian school... in Bible college or seminary... this is the Bible you need so you can make notes... underline for future reference.I am also a pastor that works on a large church staff and a large part of my job is to do sermon research and preparation. I use this also to make notes for future references toward sermons.The only down side is to make sure that you do your notes in pen. I started out doing it in pencil and it did seem to fade fairly quickly.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I was looking for a Bible that had room to write notes and thoughts down as I studied. This Bible fit the bill. It is a good tool for those who want to jot down what the Holy Spirit is teaching.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the old scofield study bible kjv standard edition genuine leather burgundy",
        "description": "Book introductions Complete Scofield references Subject chain references Concordance Red letter 16 pages of full-color maps with Index Same-page text helps Comprehensive Index Subheadings Revised marginal renderings Chronologies Smyth-sewn Gold page edging Round corners Presentation page Family record pages Imprintable 1,616 pp.",
        "authors": "['C. I. Scofield']",
        "infoLink": "http://books.google.com/books?id=tcrx72Syfr0C&dq=The+Old+Scofield+Study+Bible,+KJV,+Standard+Edition+(Genuine+Leather,+Burgundy)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Old Scofield Study Bible is an excellant value. First the construction: The Berkshire leather cover is durable, pleasant to the touch, and very attractive. At 1616 pages long, it's not so big that it's cumbersome to carry around. The page layout, and print are attractive and easy to read. The paper quality is better than average, though I prefer the paper in the Cambridge and Thompson Bibles.This Scofield is published by Oxford. They use a KJV text with the old time spellings: saviour, privily, and etc. If you compare the Oxford Scofield KJV with the Cambridge KJV Bibles you will find that while the Cambridge updates the spelling in a few places, in the Oxford Scofield it is updated in only a very few places. This would be very important to someone who wants to be sure he has a \"genuine King James Bible.\" The only places that I found where the spelling was changed my Scofield was the use of \"inquire\" in place of \"enquire\" in Genesis 24:57, and the use of the lower case \"s\" in place of the upper case \"S\" in Matthew 4:1.The only downside to this edition is that Scofield can go off on a tangent with some of his notes, although I did find them helpful more often than not.The other strong point of the Old Scofield KJV is that the concordance is among the best that I've seen in a medium priced study Bible. I've got about six daily use Bibles including some by Cambridge and Thompson Chain, (see my other reviews) yet this is one of my favorites. Amazingly enough, the Scofield was the most inexpensive. All in all, the Old Scofield Study Bible is worth every penny, and deserves your consideration if you are shopping for a nice KJV study Bible.",
                "review/helpfulness": "79/81",
                "num_reviews": 81
            },
            {
                "review/text": "If your looking for a good quality Bible with solid and reliable study notes this is the Bible for you. I would avoid the &quot;New&quot; Scofield for reasons below:The first and most weighty reason why the New Scofield Bible is not a Scofield Bible at all is shamefully simple. Dr. C.I. Scofield did not edit it. Dr. Scofield died in 1921!A book which claims on its title page that a dead man (Dr. Scofield) is one of its editors.The text of the New Scofield Bible is NOT a King James Bible and it is NOT a Scofield Bible.See also pocket size.",
                "review/helpfulness": "56/61",
                "num_reviews": 61
            },
            {
                "review/text": "A friend at my Church turned me on to the Old Scofield Study Bible. I have had it for a couple months now, and I absolutely love it! It really unlocks the Scriptures, and transforms mediocre bible study habits into Spirit-filled absorption of the Word of Truth! It has even turned me back to using the KJV (I was reading the NIV before...).One thing that I don't buy in the notes is the support of the events that allegedly occured between Genesis 1:1 and Genesis 1:2 (the Gap Theory). The Scriptures used to support this position are questionable for this application. Of course, no notes added to a study Bible are ever going to be infallible. Only Scripture can make that claim. Overall, this is the best study Bible available for serious study of God's Word. Just make sure that you get the OLD Scofield Study Bible (Not the New politically correct one).",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "I own a Nelson KJV study bible, a zondervan KJV study bible and this one, the old scofield, old reliable is the best with none coming close. Get the old scofield, you will not regret it!!!Authorized King James Bible = THE WORDS OF GOD!!!All other versions = Words of men!!!!! Nuff said.",
                "review/helpfulness": "16/23",
                "num_reviews": 23
            },
            {
                "review/text": "C.I. Scoffield's study Bible has stood the test of time. I appreciate the way he reverently \"compares spiritual things with spirtual\" when commenting on passages and doctrines in the Bible. His writing his insightful, edifying, and enlightening.The Bible itself is a work of art. The concordances and indexes in the back are the next best thing to having a Strong's concordance built right in! The name index, whereby you can look up the meanings of the names of people and places, is a priceless addition to this already stellar work.I cannot reccomend this study Bible enough. 5+stars.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "The Scoffield version of the bible is authentic and real. It is the best bible I have ever read. It is well written. One can see the inspiration of the Holy Spirit in the research and the text that was compiled. I recommend the Bible to anyone who wants to read an authentic version of God's Holy Inspired Word.Robert",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "About 6 months ago i started with my \"BSC\" study (Biblical Studies Certificate, correspondence course) at Moody's and thought it would be a good idea to have an English Bible too since the course is in English (i'm Dutch). Since i knew about Scofield's Study Bible i decided to buy it. In fact, i bought it just before i started the course. The \"Scofield\", beeig of such importance to Evangelical Theology, would be the best choice i guessed to go with the BSC from Moody.I must say, i really don't regret buying this wonderfull commentary. I know the pro's and con's about Scofields ideas on some matters, i know some see him as a \"fundamentalist\" and i don't share all his ideas either but still i'd suggest you buy it anyway. Especially since a lot of the 1917 edition is Gaebelein's work. Apart from that it has a load of cross-references and a great concordance (as more people wrote before).The Bible itself is leatherbound, thumb-indexed and with \"gold-print\". It's amazing that it sells for this price. In Holland we pay lot's more for Bible's like this.. A big thumbs up for Amazon: superfast delivery, well packed. Great service.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This was a gift for my Mom, who was thrilled with it. It is a beautiful leather bound Bible with tabs to make finding the books easy, and it has Scofields original notes, which is like gold to a Scofield lover.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "How can you rate the Bible! The cover is burgundy leather, the edges of the pages are gold, there is a thumb index. Everything is just perfect. It was delivered in its own box, within secure packaging, so it arrived without a dent or scratch! Now I need to start using it!",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "The classic OLD Scofield! If you want the best this is it! The gold-standard of study Bibles!",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "zondervans compact bible dictionary",
        "description": "This Bible dictionary is a readable fact and picture-filled guide to the arts, cultures, geography, geology, theologies, philosophies and life styles of Biblical times. It also vividly illuminates and enriches individual understanding of the greatest stories ever told.",
        "authors": "['Al Bryant']",
        "infoLink": "http://books.google.com/books?id=d0IllwfUWuEC&dq=Zondervan%27s+Compact+Bible+Dictionary&hl=&source=gbs_api",
        "categories": "['Bible']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I purchased the Compact Bible Dictionary in 1988. It has been an excellent resource to help in my Bible study. I am now purchasing 30 copies to give to members of my Sunday School class.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book helps explain so many of the phrases, terms, locations, items, etc. in the bible. It is enjoyable to just thumb through it and stop on a word, and say \" ghee, I didn't know that\" I highly recommend it to anyone who is interested in the bible.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "zondervan compact bible dictionary",
        "description": "This Bible dictionary is a readable fact and picture-filled guide to the arts, cultures, geography, geology, theologies, philosophies and life styles of Biblical times. It also vividly illuminates and enriches individual understanding of the greatest stories ever told.",
        "authors": "['Al Bryant']",
        "infoLink": "http://books.google.com/books?id=d0IllwfUWuEC&dq=Zondervan:+Compact+Bible+Dictionary&hl=&source=gbs_api",
        "categories": "['Bible']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I purchased the Compact Bible Dictionary in 1988. It has been an excellent resource to help in my Bible study. I am now purchasing 30 copies to give to members of my Sunday School class.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book helps explain so many of the phrases, terms, locations, items, etc. in the bible. It is enjoyable to just thumb through it and stop on a word, and say \" ghee, I didn't know that\" I highly recommend it to anyone who is interested in the bible.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "the bible for men vol 1 women friends and male power",
        "description": "Male alliances, partnerships, and friendships are fundamental to the Hebrew Bible. This book offers a detailed and explicit exploration of the ways in which shared sexual use of women and women's bodies engenders, sustains, and nourishes such relationships in the Hebrew Bible. Hebrew Bible narratives demonstrate that women and women's bodies are not merely used to foster and cultivate male homosociality, male friendship, and toxic hegemonic masculinity, but rather to engender them and make them possible in the first place. Thiede argues that homosocial bonds between divine and mortal males are part of a continual competition for power, rank, and honor, and that this competition depends on women's bodies for its expression. In a final chapter, she also explores whether female characters in the Hebrew Bible use male bodies to form friendships and alliances to advance female power, status, and rank. The book concludes by arguing that women are essential to the toxic biblical hegemonic masculinity we find in the Hebrew Bible, but only because their bodies are used to make it possible in the first place. This book is intended for scholars of the Hebrew Bible, as well as advanced undergraduate and graduate students in religious studies, women and gender studies, masculinity studies, queer studies, and like fields. The book can also be read profitably by lay students of biblical literature, seminary students, and clergy.",
        "authors": "['Barbara Thiede']",
        "infoLink": "https://play.google.com/store/books/details?id=iJktEAAAQBAJ&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Look at this cover. What's the deal with the old VFW dude wearing shorts that are way to short for him, hanging out with some other closeted idiots, while some washed up waitress looking chick (presumably trying to look interested and sexy) stares on? It's a total joke, and looks as if some fool snapped it up at a local Starbuck's, or, probably more realistic, visiting hours at a nursing home.Then you get inside the book itself. Kind of like a geeky junior high kid's version of Dale Carnegie's book if you ask me. You didn't, but I told you anyway. It's a complete and total travesty and those people who are, in any way, lead by this treatise need to seriously get out of the house more and develop some taste (as well as social skills).Avoid. Completely.",
                "review/helpfulness": "16/25",
                "num_reviews": 25
            },
            {
                "review/text": "I've been using on line dating services in the UK (match.com) and for the first time I've found a book for men, written by a man, that I am recommending in my personal profile to all men. If a guy follows Mills' advice with women, I don't see how he could possibly miss. This book is also a lesson in relationship possibilities and spirituality that both men and women alike can benefit from immensely. Anyone in the healing and/or social services field should read this book. I discovered it in a women's studies class, and we all loved it!!!!",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "At last! A fresh approach to the male - female relationship. For women who truly want to understand male power and build meaningful lasting relationships, The Bible for Men is a must read! Relationship-making is not easy and this book does not offer a simple formula. Instead, Mills gives the reader a basis for a new understanding and thus a new model for lasting relationships. The Bible for Men is a guide for building relationships on friendship and understanding.Mills does not claim this is an easy-read. He is aggressive in his ideas and approach because relationships are serious business. Whether or not you agree, Mills provides numerous avenues for lively discussion!",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "I loved this book because it has a new approach to relationships but I think the author is trying to kill country music. No more jealousy, ownership or even marriage as we've known it, and no divorce or romance as we've known them, so what kind of lyrics will we have? Is it really feasible?Personally, I found myself agreeing with the Monogamy Inorganic and I think most women will feel the same way. There is nothing more intimate than sex, when two people are \"in\" each other, naked, exposed. both body & soul, showing all your weaknesses, lies, frailties, egos. I just don't think you can ignore that aspect even if you are friends.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "zondervan kjv study bible large print",
        "description": "The most full-featured King James Bible available, this Bible is a virtual library of reference tools. With notes adapted from the NIV Study Bible, which has sold more than five million copies, this Bible includes 20,000 in-text notes plus hundreds of maps, charts and diagrams. It also features a chart on defending the issues in which the targeted reading audience is most interested, including literal creation, apologetics, and prophecy.",
        "authors": "['Zondervan Publishing', 'Zondervan Publishing Staff']",
        "infoLink": "http://books.google.com/books?id=gSmiGwAACAAJ&dq=Zondervan+KJV+Study+Bible,+Large+Print&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Zondervan KJV Study Bible Large Print is a great Bible. The font size and notes are unsurpassed. This is the 1873 Cambridge edition of the KJV, using the NIV Study Bible notes. Archaic terms are defined in the centre column. This is a BIG Bible, large and very heavy. It is printed in the USA, so the quality may not be so great, but I haven't been able to locate the fault line in either the front or back of the Bible, which is a good thing. This is a much-preferred option to the regular sized edition, which has a small font. I recommend this study Bible highly! And, considering the price of Bibles today, it is reasonably priced.",
                "review/helpfulness": "39/41",
                "num_reviews": 41
            },
            {
                "review/text": "large print, christ's words in red, tons of study notes, maps ect, and each chapter begins with a summary!! to give you the basic idea of whats going on and where everything takes place, and who everyone is! I bought this for my grandmother for christmas and she loves it! [...]",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "The printing is high quality. The design is excellent. The content(I mean the explanation)is very in-depth. It really helps me in studying God's words. With this bible, I found that KJV is no longer difficult to understand. Instead, I enjoy reading/studying it. Every time I study with it, I feel I have more understanding of Gods words than before. My interest in studying bible increases everyday.Thanks for publishing such good book!",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Excellect study notes. It really is combo of NIV and NASB study helps but the KJV text. Very easy to read.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "The Bible came today. Quick service and the Bible itself is wonderful. Everything one could ask for in a study Bible and in the KJV. I have several study Bible's in other translations but this is THE ONE..........the print is great; column reference, great study notes, timeline, Subject index, concordance and great maps. It is heavy but lays flat quite well. Anything by Zondervan is always done in great form",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an excellent study Bible. The notes are plentiful and the layout of the text is aesthetically pleasing to the eyes. The Bible itself lays flat when you open it which is good. The quality of the Bible as far as how its made is ok, but not great. Oxford does a much better job with their Scofield III Study Bibles than does Zondervan as far as the stitching of the binding goes, but this Bible should nevertheless provide you with a lot of use. Some might consider it a bit bulky but its actually not all that big considering the text size and the amount of information it contains. I'ld definately consider it portable. So, if you like the KJV, and this is the 1783 Edition i believe, and you want a good Study Bible as well, this will fill your need. God Bless!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I find this bible to be an excellent resource. It has much of the additional information which I am seeking. Thanks",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This study bible was just what I was looking for. I like the King James Version. The comments on the bottom of each page are helpful in my studies. The only other thing I would add to this bible would be tabs for each book on the outside edge.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "that i may know him philippians and colossians the international inductive study series",
        "description": "Here readers discover for themselves the truth about who Christ is. This study of Philippians and Colossians encourages believers to find joy in every circumstance and to walk worthy of their high calling.",
        "authors": "['Kay Arthur', 'David Lawson', 'David Arthur']",
        "infoLink": "https://play.google.com/store/books/details?id=rCewtDMJWx4C&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 16.0,
        "review": [
            {
                "review/text": "This is the second Kay Arthur bible study guide that I have used and she does not let you down.Kay has a way of bringing hidden details to light. Her method of reviewing the material being covered may seem like repetition at times but the end result is that you come away with a better understanding of the study material.Her suggestion to mark up your bible with all kinds of meaningful symbols, highlighting and notations is merely a suggestion. This may work for some and I don't know if it is a gender thing, but this is too chaotic for me. What I do is print out the chapters being reviewed from the internet and then mark the printed copy instead of my bible.Once again this is just my preference but I would highly recommend her study guides.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "When I first looked this book over, I was a bit disappointed because it seemed extremely simple. It seemed there wasn't much to it, and I'm one of those folks who likes to go deep. However, as I started going through it, following its regimen for daily study, the method revealed more and more depth in Philippians and Colossians than I'd ever suspected.This is a book whose primary purpose is to get you into the Bible, and to help you see what treasures it contains. It doesn't tell you, but instead shows you the path to see for yourself. It did a wonderful job of putting the Bible into your heart and kept the focus on scripture.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "That I May Know Him: Philippians And Colossians (The New Inductive Study Series)This is an awesome study. Our Women's Inductive Study team is leading this study with a group of women that are seeking to know God's Word and apply it so that we can be shining lights in this dark world.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "There is no better personnal or group Bible study format than this inductive method. And the Phillipians study is my favorite I've seen yet.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "classic reference bible updated nasb",
        "description": "Filled with the features that increase understanding with every use. - Complete text of the updated New American Standard Bible, today's most literal word-for-word translation. - Center-column references that unlock the depths of Scripture. - Maps and in-text charts for added insight while you read. - Introductions and outlines for every book of the Bible - Exclusive NASB Concordance for locating passages easily. - Easy-to-read typeface and verse-by-verse format with paragraph markers. - Presentation and Family Record pages for a lasting remembrance of significant events. - 8-page, full-color map section that accurately locates hundreds of important places in the Bible. - Red Letter text indicating the words of Christ. - Promises and Perspectives From the Bible.",
        "authors": "['Zondervan']",
        "infoLink": "http://books.google.nl/books?id=D3euGwAACAAJ&dq=Classic+Reference+Bible,+Updated+NASB&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I've had this bible for about 6 months now, and it is a great bible for it's price. This bible is the updated New American Standard Bible. This bible is pretty easy to read (though not as easy as the NIV or NLT) but it is also considered to be the most literal English translation today.This is a nice personal sized bible, and it is perfect for a daily reader and a bible to take to bible studies and church. Every book has a summary at the beginning, and there are a couple of maps and other types of study aids that are scattered throughout the bible. Otherwise, it is a plain, center column reference bible and it is a red letter edition (which I personally like).But the one major problem I have had with this bible is the binding. The pages are simply glued into the spine, and because of that, after a few months, whole sections of my bible began to fall out. I had to use Elmer's glue to re-glue the sections back in, and thankfully, that seems to have done the trick for now.Still, the font size is nice, the center column references are nice, and the bible is a nice size and the price is fantastic. The only really complaint I have is the binding, and had the binding not been an issue, I would have given this bible 5 stars. But since losing whole sections from the binding isn't a small problem, I am forced to give this bible 3 stars.This bible is great for a daily reader, but if you're looking for a bible that is going to last a lifetime, or at least a really long time, I would suggest spending a little extra to make sure you get a bible that is bound better.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This is a great Bible in my opinion... The most literal translation, red letters, and a center column reference so you know where that OT quote is coming from. It's also a handy size - not as bulky as a study Bible yet large enough to stay open when you set it down, unlike those tiny ones. The concordance is 59 pages, but sometimes I still have to pull out another one to find what I'm looking for. But still my Bible of choice right now.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "all of the women of the bible",
        "description": "All the women of the Bible offers a rich biographical perspective on evey female figure in scripture -- including the famous, the little-known, and even the unnamed. In more that 300 engaging and insightful portraits, Edith Deen brings alive the saints and sorceresses, queens and servants, mothers and daughters, wives and widows whose profound influence is felt through-out the Bible. \"You can almost trace light and darkness in the Bible by the women themselves,\"she writes. \"Hannah, praying mother of Samuel, gave birth to a son who became the first great Hebrew prophet. And, of course, there was the mother of Jesus. On the other hand, Jezebel and Herodias were vile influences, the first tearing apart the northern kingdom of Israel, the second causing John the Baptist to be beheaded.\" Combining thorough detail with a lively and dramatic narrative, All of the Women of the Bible portrays the real women behind the Biblical stories and shows how, in their human struggles and triumphs, they are very much like the women of today. With each major biography identified by Bible chapter and verse and prefaced by a key passage of scripture, this is an ideal resources for teachers, Bible students, preachers, and writers, as well as anyone who wants to learn what it was really like to be a woman in Biblical times.",
        "authors": "['Edith Deen']",
        "infoLink": "http://books.google.com/books?id=9zVDeI50QHIC&dq=All+of+the+Women+of+the+Bible&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 8.0,
        "review": [
            {
                "review/text": "Perhaps it is due to the age and place in which I was raised--the 70s and 80s in Europe and Washington DC--or perhaps it is simply who I am, but my interest in the Catholic Church and the Bible itself has had its ups and downs. Whenever my interest in the Church and the Bible was awakened, however, it was due to interest in the writings of the Bible.Whatever the initial reason that my interest in the Bible was inspired, however, I always read about the same topic: women and, in particular, the heroic women who were respected and revered by their husbands, families, and/or nations. I wanted to find women to emulate.This book is the best I have read on the subject of women in the Bible. Deen's work remains concise, while she makes you feel as if you know each character as a woman and as a part her place in history. Then, after writing these evocative passages, she has useful appendices such as an alphabetical listing of each woman who is named in the Bible and a brief description of each, a listing of women according to their station in life, a bibliography, and an incredibly in-depth index. This is a book that you will refer to throughout your life, whether you are looking for an interesting story, you want to learn about the age these women lived in, or you simply need inspiration. No matter your need, this book can fulfill it.",
                "review/helpfulness": "81/83",
                "num_reviews": 83
            },
            {
                "review/text": "This exhaustive work is invaluable to anyone who wants to know the stories of Biblical women better. I'm doing research on Biblical widows, and this book is the most accessibly organized sourced I've found. It was written in 1955, so don't be surprised if it's a bit dated stylistically &amp; theologically. Still, it's valuable as a reference tool that may lead to you to deepened encounter with women of faith.",
                "review/helpfulness": "45/47",
                "num_reviews": 47
            },
            {
                "review/text": "One of my sons, when he was about four, ran to the front of me, his mother, on a narrow sidewalk with the statement: &quot;Men are leaders in front; women are leaders behind.&quot; This was the politically correct point of view in less enlightened times - especially in biblical times. Or was it? Edith Deen has compiled all the data necessary to answer that question. She has reviewed every woman mentioned in the Bible, those whose names were given, and those who were unnamed. She has pointed out those who were &quot;leaders in front&quot; and those who were &quot;leaders behind.&quot;She has also listed them according to their roles in the family: daughters, wives, mothers, widows. There is an excellent index to help you further find them by their roles (e.g, &quot;Warfare, women taking action in&quot;). This is a delightful book, whether you are wanting to discover what roles women played in ancient Israel, or whether you just want a book that has sections that you can read quickly for a short moment's diversion.",
                "review/helpfulness": "41/43",
                "num_reviews": 43
            },
            {
                "review/text": "Women in the bible are often not a topic discussed in church or elsewhere. This book is a wonderful look at the ignored parts of the bible, (and I don't mean every book after Exodus). Women did participate in the bible and this book celebrates their accomplishments and gives them long overdue praise.",
                "review/helpfulness": "36/41",
                "num_reviews": 41
            },
            {
                "review/text": "This book is a must for all women wanting to know more about the great women of the Bible. In this book you will learn all about the cultural heritage of the women of the Bible, all about the struggles these great women faced in their lives, and a true behind- the-scenes look into their lives. We have used this book in our home to teach our children what the lives of Bible Figures were really like! I have used this book to better understand the Bible. In this book, Edith Deen did extensive research all over the world in order to make this book accurate. This book is great for all wanting to know more about the Bible...for all who would like to know more about the cultures shaping the saints from the Bible...for Christians seeking to learn more about being godly in our world today! This book is a must for every home! A true classic!",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "The books came in good condition and arrived sooner than promised. We are using it as a group study, and though it was published years ago the contents do not get outdated, any more than the Bible. It makes these women come alive for us as real people.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is an excellent reference book for all Christian women who really want to know about women who blazed the trail for us. Not only do you study the women in the Old Testament, but the New Testament as well. This book is used as a textbook in our Church Leadership School. Wonderful gift for a Christian sister. Of all the books cooncerning the women in the bible that I have read, this one is by far the best.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was written before computers, so the author knew the material intimately as she categorized and collected details. Very reliable source for Bible study.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Impressive, well written and researched material. I first read this book having found it in the local public library. I liked it so much that I ordered a copy via Amazon so that I might read it at any time again and again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ryrie study bible kjv bonded leather black red letter indexed ryrie study bibles",
        "description": "\"The Bible is the greatest of all books; to study it is the noblest of all pursuits; to understand it the highest of all goals.\" - Dr. Charles C. Ryrie Regardless of how many Bibles you may already have, a study Bible is a must if you intend to deepen your understanding of God, His character, His methods, and His commands. The Ryrie KJV Study Bible is purposely designed to keep the focus on God's Word, the 10,000 explanatory notes are written to enhance, not comment on Scripture. In addition, wider margins allow you to add your thoughts, notes, and insights. Also included are in-text supporting maps, charts, timelines, and diagrams; 16 full-color maps and 8-page historical timeline; thorough topical index and comprehensive concordance. And whether you are a new believer or a mature Christian, Dr. Ryrie includes helpful articles to further your knowledge of the Bible. In addition, you will receive a software download for The Moody Library, an ideal Bible software program for Pastors, Teachers, Professors, Students, Bible Study Leaders, and anyone thirsting to learn and understand more fully. Valued at over $400, this study and reference software was developed by Moody Publishers and WORDsearch(tm) as an electronic companion to The Ryrie Study Bibles.",
        "authors": "['Charles Ryrie']",
        "infoLink": "http://books.google.nl/books?id=HeEiPQAACAAJ&dq=Ryrie+Study+Bible+KJV+Bonded+Leather+Black-+Red+Letter+Indexed+(Ryrie+Study+Bibles)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am a pastor, and over the year's I have had the privilege of using several different study Bibles. I have used the Open Bible, Thompson Chain, Matthew Henry Study Bible, Dakes, Word, and Scofield to name a few. The notes and helps in each of these have their particular strengths and weaknesses. I could comment on each but will not. For my expository style of study, I have found that I like the Ryrie by far the best. What I am looking for is insight into the scripture for what it actually means, giving consideration to the original intent of the author, NOT JUST A PRETTY DEVOTIONAL THOUGHT. In the Ryrie, notes on Old Testament symbolism with New Testament fulfillment are great. In particular the notes in Hebrews are very well thought out. The notes in the Gospels are also excellent.Dr. Ryrie chose his words in his notes to be concise meaningful but not overly wordy. This allows for the Bible not to be cumbersome to use with overly exhaustive notes that give repetitious lists (i.e. Dakes). If I had to choose one study Bible for the rest of my life this would be it.My only regret: I purchased the less expensive bonded leather rather than the genuine leather. Now I have a favorite Bible that is full of my own hand written notes and underlined passages, but the cover is separating. Oh Well...TRW",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "I would like to highly recommend this Bible for anyone who is interested in studying God's word. In all my years of Bible study and preaching God's word the Ryrie Study Bible is the best study Bible I have found. I have recommended this Bible to many people and they all have enjoyed it also. It will help you to understand the Bible. It has a very detailed section in the back on Doctrines of the Bible, it also has detailed maps and outlines of the chapters. If you are interested in studying God's word this is the Bible for you.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "In the short time since my purchase of this Bible, it has become my primary carry and reading Bible.First, the explanations are quite thorough and researched. The introduction to each book of the Bible is quite useful for setting the stage for understanding the material to follow. Timelines are also included to help place Biblical events in perspective.The overall quality of construction of this Bible is tip notch. I feel that even with heavy use, this Bible will be around for many years.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is an excellent Bible with a lot of extras that provide in depth information without just being filler. My only complaint is that there's not more room for notes.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "About 10 minutes ago I received, by express mail no less, my new \"genuine leather\" Ryrie study bible. I took it out of the box, opened it to about the center pages, browsed a little, then turned back to the front cover.It had already started to tear from the binding. I looked at the very back, and the same thing. A small tear in the upper part of the cover.If this is \"genuine leather\" I'll BBQ it and eat it without any steak sauce. I noticed the Bible was printed in Columbia. It looks like it. It must have been from a shop in the jungle. I can't believe the poor, poor quality of this bible. I just lost $75 for the worst quality product I've ever been unfortunate enough to buy.One other tip while I'm at it. Just because a bible says \"genuine leather,\" don't let that fool you. There is genuine and then their is actual GENUINE. I thought I could trust Moody. What a mistake that was. This is even poorer quality than the \"bonded leather\" junk these publishers push on the public. They need to have Lewis Printing of Vermont print their bibles. Now there is genuine quality.Save your money. DO NOT BUY THIS product. Go to the salvation army and spend a dollar for a bible. It will be better quality.Moody should be embarrassed by this absolute piece of junk they are inflicting on the public. I will NEVER buy ANYTHING sold by Moody again.All I can say is the bible is pathetic, Moody should be ashamed of themselves, and Columbia needs to use labor that have worked in the printing industry before.Once again, save your hard earned money and do not buy ANYTHING by Moody. How cheap can these corporations be?On a more positive note, the Ryrie Study Bible, leaving out the printing quality, is one of the best study bibles I've ever owned. There is room in the margins for notes, the print is good size, the notes are extensive, and of course, Dr Ryrie is an excellent expositor of scripture. The notes are much more comprehensive than the Scofield Study Bible, dealing with subjects other than just prophecy. The contents of the Ryrie Study Bible can't be beat, it's the quality I have the problem with.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My husband is a Minister and I gave this bible as a gift. He was very pleased with the quality of the brand and the quantity of information it contained. I was pleased with the delivery of this item.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "life application study bible kjv",
        "description": "The Life Application Study Bible, is today's #1-selling study Bible. The Life Application Study Bible, includes nearly 10,000 notes and features designed to help the reader apply God's truth to everyday life. Personality profiles highlight over 100 important Bible characters. Book introductions provide vital statistics, overview, and time line to help readers understand the message of each book. Two hundred thumbnail maps highlight important bible places and events and 260 charts help explain difficult concepts an relationships.",
        "authors": "['Tyndale House Publishers']",
        "infoLink": "http://books.google.com/books?id=28dZPgAACAAJ&dq=Life+Application+Study+Bible+KJV&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is the best study Bible I own -- over 10,000 life application notes help drive home the relevance of Scripture to our everyday lives. Another feature I liked was that, in the King James Version edition, there are plentiful footnotes to explain some of the more challenging words. I've started using the KJV because of its majestic style and historical ties to my own religious background (Anglican/Episcopal), but one obstacle has always been that some of the words have been difficult to understand. The footnotes really help in that respect.My only wish for this Bible is that it included the Apocryphal/Deuterocanonical books, but I suppose the omission is understandable, given (as I perceive it) the predominantly evangelical theological orientation of the contributors and editors.",
                "review/helpfulness": "32/40",
                "num_reviews": 40
            },
            {
                "review/text": "Despite the title, I own a number of \"Study Bibles.\" If you are going to buy a Bible of this sort, the KJV of the Life Application Study Bible is the best of those I have.Why do I say that? Two reasons. If you are buying a study Bible, you are obviously doing it to study the Bible. That being said, a KJV is the version you need because Strong's Concordance is keyed to it (you need a Strong's if your going to study also). The second reason is that every study Bible that I have picked up adheres to some particular doctrine and is weighted toward it. This is the most doctrine neutral of all the ones that I own. After all, if your studying what the Bible says, not what some other person says the Bible is saying. You still need to be on your guard, but not nearly as much as with some of the others.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Here's a breakdown of the features of this Bible. At the beginning of each book of the Bible there is a full page (2 sides) of information about the book such as: PURPOSES, AUTHOR, ORIGINAL AUDIENCE, DATE WRITTEN, SETTING, KEY VERSE, KEY PEOPLE, SPECIAL FEATURES. There is a time line of events in the book at the top, a few paragraphs summarizing the message of the book, and a chart of the themes. My favorite feature of this Bible is that it is not separated into columns, and it is in paragraph form, both of which make reading much smoother, and like a normal book. The bottom half of the page is notes about specific verses such as 2:13 and then the note. Sometimes they are spiritual and sometimes they are practical explaining the culture, or why something was significant. Underneath the Bible verses, and above the notes are definitions of certain words in the Bible such as: 1:2 rent: torn Obeisance: bow low. There are all kinds of charts in this Bible and hundreds of personality profiles. Also lots of maps, which are great for understaning battles. There are all sorts of helps in the back of the Bible such as Table of Weight and Measurements, a Master Index, and a Dictionary/Concordance. The black leather is beautiful and it isn't so big that you feel silly bringing it to church. I think everyone should own a great study Bible like this.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Bible was purchased as a gift for my wife...She loves it! She really appreciates all of the helps / references and layout of the Bible.Thanks for a quality product at a affordable price!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I admit I didn't buy this Bible for the \"Life Application\" part, at least not directly. I bought it several years ago, when my Bible I'd had since 1st grade got wet in a leaky car trunk, because, first and foremost, it's a top-quality Bible, with nice pages, binding, and cover that so far have proved extremely durable. I also like that instead of two columns on each page, it's laid out like a normal book. Now when I read a regular Bible I realize how much I don't like all the hyphenated words and constantly going to the next line. As for the Life Application comments, what I like about them is that since they take about a quarter to a half of most pages, they provide a place for notes. From what I've read of them, they do give valuable insight sometimes, but sometimes I don't agree with them. But they always give room for post-it notes. My only complaint is that this Bible is a little large, but I have found large covers online that fit.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I really wanted the Bible that you advertised (leather bound NOT bonded leather) but after 2 failed attempts on your part you gave up and cancelled my order! VERY DISAPPOINTED on your part.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "life application study bible nlt indexed new living translation",
        "description": "Trusted & Treasured by Millions of Readers over 30 years, the Life Application(R) Study Bible Is Today's #1-Selling Study Bible Now it has been thoroughly updated and expanded, offering even more relevant insights for understanding and applying God's Word to everyday life in today's world. Discover How You Can Apply the Bible to Your Life Today With a fresh two-color interior design and meaningfully updated study notes and features, this Bible will help you understand God's Word better than ever. It answers the real-life questions that you may have and provides you practical yet powerful ways to apply the Bible to your life every day. Study the stories and teachings of the Bible with verse-by-verse commentary. Gain wisdom from people in the Bible by exploring their accomplishments and learning from their mistakes. Survey the big picture of each book through overviews, vital statistics, outlines, and timelines, and grasp difficult concepts using in-text maps, charts, and diagrams--all to help you do life God's way, every day. Features: (Enhanced, updated, and with new content added throughout) Now more than 10,000 Life Application(R) notes and features Over 100 Life Application(R) profiles of key Bible people Introductions and overviews for each book of the Bible More than 500 maps & charts placed for quick reference Dictionary/concordance Extensive side-column cross-reference system to facilitate deeper study Life Application(R) index to notes, charts, maps, and profiles Refreshed design with a second color for visual clarity 16 pages of full-color maps Quality Smyth-sewn binding--durable, made for frequent use, and lays flat when open Presentation page Single-column format Christian Worker's Resource, a special supplement to enhance the reader's ministry effectiveness Full text of the Holy Bible, New Living Translation (NLT), combining the latest biblical scholarship with clear, natural English The words of Jesus are in red letter.",
        "authors": "['Tyndale']",
        "infoLink": "http://books.google.com/books?id=kpTJDwAAQBAJ&dq=Life+Application+Study+Bible+NLT,+Indexed+(New+Living+Translation)&hl=&source=gbs_api",
        "categories": "['Bibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Yes, yes yes! I received this from a friend. I never used to read the Bible -- too boring, couldn't understand, etc...that is until this came along! Very interesting to read and keeps my attention. I recommend this to any new Bible reader. Don't let anyone tell you that this version isn't &quot;official.&quot; Bunk. If you've been looking into reading the Bible, this is THE ONE!!!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I purchased this bible because of the ease of understanding the New Living Translation. It has great footnotes that help to apply the passages to events and circumstances in our lives today. The concordance/dictionary is sufficient. There are maps throughout the bible, that really help show the geographic areas of bible events. I especially recommend this bible for those who have a hard time understanding bible language. The New Living Translation is in today's language.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is an excellent modern English translation which i would recommend to anyone. The study notes in this version are for the most part of good quality and there are versions of this bible without the study notes if that is your preference. I find that this bible provides an excellent complement to my other bible, The New Jerusalem Bible (with footnotes). The NLT is written using language which is more accessible than the NJB while the NJB (with footnotes) provides a translation which appears to better reflect the underlying, original, text from which it is drawn. Depending upon one's tastes either is sufficient, i happen to find that the two together complement each other in a manner which aids me in understanding the underlying meaning.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    }
]