[
    {
        "Title": "china in the tokugawa world the edwin o reischauer lectures 1988",
        "description": "This engaging book challenges the traditional notion that Japan was an isolated nation cut off from the outside world in the early modern era. This familiar story of seclusion, argues master historian Marius B. Jansen, results from viewing the period solely in terms of Japan's ties with the West, at the expense of its relationship with closer Asian neighbors. Taking as his focus the port of Nagasaki and its thriving trade with China in the sixteenth through the nineteenth centuries, Jansen not only corrects this misperception but offers an important analysis of the impact of the China trade on Japan's cultural, economic, and political life. Creating a vivid portrait of a city that lived on and for foreign trade, the author details Nagasaki's pivotal role in importing luxury goods for a growing Japanese market whose elite wanted more of everything that ships from China could bring. Silk, sugar, and ginseng were among the cargoes brought to Nagasaki as well as books that, by the late Tokugawa period, signaled the dangers of Western expansionism. The junks from China brought people as well as goods, and the author provides clear evidence of the influence of Chinese expatriates and visitors on Japanese religion, law, and art. Japan's intellectuals prided themselves on their full participation in the cultural milieu of the continental mainland, and for them China represented an ideal land of sages and tranquility. But gradually China came to represent, instead, a metaphor for the \"other\", as Japan's quest for a national identity intensified. Among the Japanese, a new image of their nation was beginning to emerge: a Japan superior to Asia in general and to China in particular.",
        "authors": "['Marius B. Jansen', 'Professor Marius B Jansen']",
        "infoLink": "http://books.google.com/books?id=11dbNDpaxOAC&dq=China+in+the+Tokugawa+World+(The+Edwin+O.+Reischauer+Lectures,+1988)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Refreshing to find a book that goes beyond the bare facts. A new angle on the Tokugawa era that I found quite fascinating.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Marius B. Jansen is a distinguished scholar who wrote his PhD thesis onThe Japanese and Sun Yat-senand then dedicated a book toJapan and China: From War to Peace, 1894-1972. In China in the Tokugawa World, he builds on other people's scholarship, both from Japan and from the West (though not from mainland China or from Taiwan) to survey three interrelated themes: the contacts between Japan and the Chinese world in the Tokugawa period; the images projected by the Chinese civilization upon Japanese leaders and intellectuals; and Japan's shift to a bellicose attitude in the early Meiji period.This book stems from the spirit that animates the Edwin O. Reischauer lectures series at Harvard's Fairbank Center for East Asian Research: the ambition \"to restore the sense of an East Asian civilization that once pervaded all our work but has been greatly weakened by the more recent specialization on single-country histories.\" Indeed, the tendency to see neighboring countries through Japan's lenses--a tendency no doubt pioneered and encouraged by the author--has been the hallmark of recent scholarship focused on reassessing the role of Japan in the international order. Firmly anchored in the study of national archives, but breaking the conventions that separate East Asian and national history in Japanese universities, this strand of research often requires the mastery of a second Asian language, putting additional strains on the already demanding requirements put upon Western scholars specializing in Japanese history. But it has the effect of recentering Japan in its regional environment and, by doing so, of putting an end to the exclusive focus on relations with the West that has characterized previous scholarship on the isolation and opening of Japan.Viewed from an Asian perspective, Japan's seclusion during the Tokugawa period was less absolute and more adaptative than previously assumed. Scholars have pointed out that the forms of seclusion changed over time and did not in fact become pillars of Tokugawa ideology until the nineteenth century, when bakufu authorities began to refer to isolation as a cardinal aspect of the legacy of Ieyasu's rule. Ronald P. Toby was early to point out that the term sakoku (closed country) first appeared in a translation of Engelbert Kaempfer's History of Japan, and that it has a meaning chiefly with respect to Japan's relations with the West and not to those with its neighbors in East Asia. It can also be argued that China was no less \"closed\", and Korea more so, than Japan; each country tolerated trade only through highly structured institutional forms, and certainly neither China nor Korea experienced anything like the intellectual stimulus that Japanese scholars derived from outside, especially Western, learning.The course of events that ended with the restraints on travel and trade on the Edo years stemmed from two rival forces: strong but limited demand for a limited set of goods, and the desire on the part of the bakufu government to maintain and monopolize profits. Japan was a strong producer and exporter of minerals: according to Japanese historians, Japan may have accounted for as much as one third of the world's silver output at the end of the sixteenth century and beginning of the seventeenth century. Subsequently, Japan was also the world's largest copper-producing country. The foreign trade that resulted was dominated by the exchange of Japanese bullion for the Chinese silk that adorned the merchant capitals and castle towns of Tokugawa Japan. Restraints measures were linked with the progressive depletion of silver and then of copper resources, as well as the sumptuary laws that limited the use of silk through Japanese society.Nagasaki, where foreign trade was concentrated, was in the seventeenth century the most cosmopolitan city in Japan, and the Chinese presence, first spread in all parts of the city until the special Chinese quarter was built in 1689, far exceeded the Dutch trade community in Dejima. As the author writes, \"Dutch trade at Nagasaki was always smaller in amounts than the Chinese trade, and it is in good part the ethnocentricism of the West that has led to our obsession with seclusion when the Nagasaki door was always ajar and sometimes wide open.\" Much of the activities that took place along the chain of Chinese trading posts throughout Southeast Asia, which encompassed Dutch and Portuguese trade, can be understood as the securing and maintaining of access routes for the transport of Japanese and New World silver to China and Chinese silks to Japan.The China trade financed much of the resistance of Taiwan and south China to the Manchu takeover. Trade restrictions through the regulations of 1685 and 1715 encouraged a program of import substitution, with the domestic production of such import items as silk, sugar, and ginseng. Enjoying a climatic monopoly on sugar production, Satsuma found a secure source of income that helped to finance the political and military structure so important in the Meiji Restoration. When the ports opened to foreign trade in 1859, Japan's silk exports quickly became a powerful source of profit, strengthening the economy in general but weakening the bakufu's ability to monopolize profits from the exchange. Thus foreign trade's ebbs and flows were an important factor in the political and economy trajectory followed by Japan in the modern era.The image of an isolated Japan whose inhabitants were cut off from the outside world also conflicts with a second factor highlighted by recent scholarship: Tokugawa Japan formed a civilization that was oriented more than ever before toward the language and classical culture of continental China. Literacy and education for the elite were thought of in terms of the mastery of Chinese, and a disproportionate amount of time was spent teaching students to read and compose texts in classical Chinese. Here the author pays tribute to the work of ba Osamu, who pioneered the history of cultural interchange between Japan and China, and also refers positively to the research of Kate Wildman Nakai, who showed that Confucianist scholars such as Ogy Sorai compensated for their relative lack of status in Japanese society with the apology of the Confucian order, in which the scholar-official was the ideal-type. The essay also documents the rise of anti-Chinese feelings, which help to account for the alacrity in which Meiji Japan was prepared to \"part with Asia,\" in Yukichi Fukuzawa's words, and join the circle of imperialist powers.Although China in the Tokugawa World is a synthesis that surveys the period with broad strokes, it also features individual vignettes and historical anecdotes that give depth and perspective to the picture. Each story could form the setting of a fiction novel or a historical narrative. In order to satisfy the curiosity of the reigning emperor without breaching the protocol, an albino elephant from Siam was given an honorary court rank and granted an imperial audience in Kyoto. Zheng Chenggong, known as Koxinga in Europe and Watnai in the Japanese puppet play by Chikamatsu Monzaemon, is still revered as a national hero in Japan, Taiwan and mainland China. Chinese junks arriving at Nagasaki received formal warnings by Japanese officials about Christianity, and the crews were required to tread on sacred images in a fumie ritual; discoveries of translations of Jesuit tracts resulted in the burning of the offending books, seizure of the rest of the cargo, and exclusion of the shipowner from further trade at Nagasaki. The book concludes with a fascinating dialogue between imperial commissioner Li Hongzhang and young Japanese envoy Mori Arinori, who justified the abandonment of national dress and adoption of Western mores including respect for women's rights. The spirit originating with Harvard scholars Edwin O. Reischauer and John K. Fairbank is very much kept alive in these lectures.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the asian mind game unlocking the hidden agenda of the asian business culture a westerners survival manual",
        "description": "Offers strategies for defending against Asian business tactics",
        "authors": "['Chin-ning Chu']",
        "infoLink": "http://books.google.com/books?id=LhEx3lLwdKoC&dq=The+Asian+Mind+Game:+Unlocking+the+Hidden+Agenda+of+the+Asian+Business+Culture+-+A+Westerner%27s+Survival+Manual&hl=&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "OK, this is NOT a recommended title, but I couldn't resistsaying a few words about it here because of its high entertainmentvalue. For 15 years now I have consulted for US companies entering the Japanese market. So naturally I paid close attention to the chapters on Japan. They were very entertaining. They read like the script from a Mr Bad Guy in a 007 movie... Check out the prose, too: &quot;A Japanese samurai worker produces in one day what it takes an American worker two days to produce. To the western world the Japanese stress the importance of free trade because they know that the western worker is no match for the Japanese samurai worker&quot; (p. 125). .. The final section contains precious specific advice such as &quot;respect local culture&quot; and &quot;develop long term objectives&quot;. One of the deepest pieces of timeless advise is that &quot;if you drop your chopstick in Asia it means good luck&quot;. I guarantee you won't know a thing about doing business in Japan after reading this book, but you may be amused reading it. ... it seems that a ticket to Austin Powers may represent better value. END",
                "review/helpfulness": "26/33",
                "num_reviews": 33
            },
            {
                "review/text": "With books like this purporting to explain Asia and its people, it is little wonder that the average Westerner is still so misinformed on the subject. Contrary to what the title says, she is not &quot;unlocking any hidden agenda&quot;. The fact is, this is well-charted territory, much of which is covered in books millenia-old (Art of War). Another problem with the title is that she is not providing any &quot;survival&quot; advice. She simply shows how Asians operate and negotiate without showing the best way to counter their tactics. Reading this book to learn how to deal with Asians is like studying martial arts to learn how to get beat up. But perhaps the worst quality of the book is the way she imbues each passage with the sense that Westerners shouldn't even bother trying to understand Asia. (Certianly they shouldn't bother learning from her.) In one section she even states explicitly that there are two types of Westerner in Asia -- 1) the Asia-phile who thinks he knows alot but doesn't and 2) the novice who realizes that he knows nothing. But hey, here is the real &quot;secret agenda&quot; of some Asians: when a teacher tells her students that they are still ignorant, the students exalt her as one of the few enlightened ones to whom they can turn. They become dependent on the teacher for her pearls of &quot;wisdom&quot;, each one poisoned with the idea that student is ignorant.",
                "review/helpfulness": "19/25",
                "num_reviews": 25
            },
            {
                "review/text": "Yes, the book is unsubtle, as some reviewers have complained. And the stereotypes are exaggerated. They're also a bit dated, since the book was written in 1991 -- before China's private economy had blossomed, before Taiwan and Korea had become such important high-tech centers, and before Japan went bust.The book also sensationalizes the degree to which people may be trying to deceive you, and the degree to which this deceit is based on your being a Westerner. Often the deceit, when it happens, is just a cultural way of dealing with embarrassment.But when I was a beginner with Asia, I found this book a helpful eye-opener. I'd never heard of \"The 36 Stratagems\", which another reviewer calls tedious (this was before Asian video games based on Chinese military classics became popular here). It turned out that just about all educated East Asian people I met, men and women, knew them to some degree. The book also describes some relevant differences among East Asian cultures - a cure for the usual Western point of view that lumps Japanese, Koreans, Chinese and others all into one \"Asian\" category.By now, most of my time in the past 9-10 years has been spent involved with East Asia and East Asian people. This has been at both a business and personal level, including through marriage and working for a Japanese company. From that perspective, I can also say the book's lack of political correctness and its hype about military strategy are kind of virtues.How? On its surface, the book is about Asian-Western interactions. But underneath, the book illustrates a lot about how people from different Asian cultures regard each other, both cross-culturally and intraculturally.Chairman Mao may have used the phrase \"politically correct\" from time to time, but in its current form it's a Western concept, and a recent one at that. It's also something that comes easier to the lips than to the heart or mind. My friends from Asian countries are usually more direct -- they often express quite stereotypical (and negative) views about people from neighboring countries, even when they make exceptions for individuals. More than once has some really balanced or sweet person mentioned to me after a pause, \"But you know, I really can't stand people from X.\"Business practices and politics often can be pretty manipulative even against colleagues within the same company. (Watch just about any Japanese TV drama about office life, if you don't have a chance to experience the real thing.) And I've run into plenty of East Asian managers and executives who think they're great strategists in the style of the Chinese classics, even though in fact they're about as clumsy as you or I would be.Read this book with a grain of salt. But you can definitely benefit from having read it.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I read this book many years ago and recall being hugely amused by it and its numerous stereotypes. In fact, I gave it to a sociology PhD candidate studying Chinese culture for a good laugh. I regret parting with it because it is quite a unique artifact, being quite comprehensive in its stereotypes of various Asian nationalities. Nevertheless, I can see the value of the book for those completely unfamiliar with Asian culture and desperately grasping for some way to categorize what seems to be inexplicable behavior, since the first response to unfamiliarity is to attempt to build categories to group and generalize. As such, I might recommend it, but only with the caveat that its contents should not be taken as authoritative.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I lived and worked in Asia for over 8 years. Fortunately, I read it years ago while still there. I found this an invaluable aid. Ms. Chu does a remarkable job in explaining the subtle differences between the various cultures to the Western mind. I wrote this today because once again, I have recommended it to a work group that has interest in Asia. It is timeless.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I have worked in Korea, Vietnam and Singapore and this book has done more to enlighten me to the multi-faceted aspects of working with Asians than almost all other sources combined. Chu Chin-Ning's explanations with numerous examples from Chinese and Asian history do a lot to explain and reinforce the concepts. But I must say that though the first third of the book is important and good stuff, it is a little hard to get &quot;past&quot; all &quot;36 Strategies&quot; or &quot;proverbs&quot; of Chinese war. But enjoy each one as they only pick up speed -- and those 36 &quot;strategies&quot; affect almost all Asian minds, educated or not.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I just got back from China as an English teacher, granted I taught in a small city which automatically gave me the celebrity status, but after reading this book all I can say is I wish I picked this up before I went to China in the first place.For those who want to understand the \"Art of War\" and the \"36 Strategies\" this is a good book to learn how it applies not only to war and business, but also to other aspects of working in China. It explained many inner workings about how things are done.As for the \"stereotypes\", of course they are not 100% true. But it's a good idea to read her views on the Chinese mind set to understand some of the cultural and historical influences that are shaping China of today. Being there, I met many people older than me who still have been influenced by the Cold War and Mao's \"anti-imperialist\" propoganda. Many of the youths I met still hate the Japanese with a passion.Of course, I've only read the 1988 publication of the book, so it doesn't factor in many huge changes in Chinese hisotry, such as the reutrn of Hong Kong and Macau to China or even the alliance with the Communist party and the Nationalist party in Taiwan. You will find no references to the 50 year plan of one country, two systems they use to ease Hong Kong and Macau back into Mainland territory.My only problem with this book is that even though she writes about the many cultural problems that Westerners will face going in these countries, she doesn't give many good suggestions as to how to surmount them. To tell you the truth, if I ever go back to China, this book does sometimes make me feel paranoid not knowing who is friend or foe.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the nanjing massacre in history and historiography asia local studies global themes",
        "description": "A compelling historiographic study of the Rape of Nanjing during the Sino-Japanese War of 1937-1945, one of the worst atrocities of all times, and of the event's repercussions.",
        "authors": "['Joshua A. Fogel']",
        "infoLink": "http://books.google.nl/books?id=8z6c6rTk0WUC&dq=The+Nanjing+Massacre+in+History+and+Historiography+(Asia:+Local+Studies+/+Global+Themes)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I am a Chinese and I have read some books and watched some videos about the Nanjing Massacre. I can't hold my angry towards the Janpenese who wrote some nonsense below.I'd like to ask some questions to him/her. Frist, how could he/she explain why there are plenty of survivers of the Nanjing Masscare who still live in China and can show uncountable injuries throught their bodies? Don't forget that it happened only 60 years ago and the survivers hasn't died out. If you want to lie, please wait to those people pass away.Secondly, what is the casue of the war? Did China invaded Japan? Tell me which one happened frist, Pearl Harbor or bombing of Tokoy? Why there are 3 million Japanese troops stayed in China during 1937-1945? What did they do? Were they in vacations?Third, why there are millions of Japanese \"residents\" lived in Machuran, or the northeast part of China? And Why they could occupy most of the land, forcing Chinese people to leave? Why the Japanese \"residents\" did not pay tax to local Chinese government but pay tax to the Japense troops? (The truth was the Japanese occupied the whole area, which is 5-6 times larger than Japan itself, and wanted to change the land as a \"new Japan.\")Could you answer these questions?Yes, the Nuke bombs killed thousands of hundreds Japanese, but Japanese killed at least 25 million Chinese during WWII. 25 million! Who was \"brainwashed\"? Why don't you say that it is a lie of Pearl Harbor, the truth is Americans attacked Japnese?We never refused to admit that the Japnese suffered by the nuclear weapon. But we can's understand why there always be some Japnese who refuse to grant the history? History is history. There is no need and to lie. If Japan wants to become a normal country and get respect from other nations, it should stop to \"modify\" the history. Please watch what the German did and compare to yourself!",
                "review/helpfulness": "32/39",
                "num_reviews": 39
            },
            {
                "review/text": "This is a lesser known source among published Nanjing Massacre literature, but is well worth acquiring due to the variety of perspectives it offers in one book. I would say that any criticisms lodged here against this interesting work, from the typical Japanese Nationalists trolls whose primary ambition is to share their confusion with others, should be completely ignored.Every legitimate WWII historian, including not a few brave scholars in present-day Japan, understand and accept the basic facts and figures surrounding the Nanjing Massacre and the trail of brutality that led from Shanghai in 1937-38. The documentation is extensive, from numerous Western eyewitness accounts to intercepted Japanese diplomatic cables. Magazine accounts of these events can easily be found in Western libraries and even on eBay. Yet Japanese nationalists want us to believe that a massive \"conspiracy\" has led to an \"untrue version\" of the Massacre. But the conspiracy rests solely with JAPAN, not the Allied Nations. Nationalists will point you to absurd Japanese press coverage of post-massacre Nanjing, which is nothing more than skewed occupation propaganda. Likewise, published revisionist accounts by Imperial Army officers in Nanjing, offered in defense of the nationalist position, are usually no more than denials or excusals for their own indifference during the Massacre.The fact that a member of the Imperial House is accused of being a primary instigator of the Massacre is of utmost concern to Japanese nationalists. But the Nanjing Massacre should not be considered as unusual conduct for a Japanese military that also brutalized Manchuria, Hong Kong, and Singapore citizens, killed over 200,000 laborers on the Death Railway from Thailand to Burma, and ravaged innumerable Philippine villages, culminating in the Rape of Manila. The Imperial Army's abandonment of their own conscripted settlers in Manchuria and mass slaughter of Okinawans in 1945 also speaks of the evil that pervaded Japan's military before and during WWII. You can go to any of these places, talk to the survivors and still see physical evidence of Japanese military atrocities. Yet Japanese nationalists, often motivated by insecure needs to believe in a delusional glory of the past, deny anything that would place Japan's military actions in a bad light. The question is why citizens of the world should trust such revisionists who essentially possess the same arrogance and racism of the former militant regime which they extoll and worship? We should not.While I have great fondness for Japanese culture and people, I am dismayed by the distorted histories that are still found today in their own schools. Many Japanese I talk to say they learn of Japan's real WWII past only in college. Japan today should not be judged by the ridiculous extremists who comment here and those old men in high places who try to suppress their national shame. The good news is that with more internationalization, young Japan is slowly coming to grips with their past. Recent TV doramas such as \"Song of the Canefields\" (reciting Imperial Army atrocities in Okinawa), have educated many young Japanese better than the heavily-edited history textbooks in ther schools. The recent actions of fanatical extremists in Hiroshima and anti-Japanese sentiments during football matches in China also have placed Japan on notice as to their obligations to resolve past offenses.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "The nonsense written by Hiromi is ridiculous.There are for a fact several surviving non chinese people who even recorded videos of the horror japanese troops inflicted against the people in Nanjing, and there are several photos also which can easily be verified as original non edited photographs by any photo lab today.And to say no foreigner actually witnessed the massacre is so naive, if you where going to execute 30.000 civilians and your the invading force, would you just allow some foreigner to sit by and watch? of course not even bringing such a point up is nothing less but stupid.And for the authors Higashinakano Shudo and Tanaka Masaaki, they are both know pro right wing LPD so of course they will deny that the nanjing massacre ever took place.And i wouldn't call it a brain washing program either, more true information program, since during the wartime the japanese government had total media control and most japanese had no knowledge what really happened overseas.It's just stupid to not take responsibility for past actions and try to deny such an obvious truth. It would be like if my country (sweden) tried to deny its invasion of norway, russia, and the majority northern europe. Or trying to deny the crusades made by christian knights to spread the christian faith using armed forces against those who did not convert.Face it, it did happen and i welcome any book that can help the truth thats why i give it 4/5.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "We need books like this to show the past to those brainwashed people, such as one of the viewers---Hiromi (a Japanese woman) (To Hiromi: Stop being so naive!)Learn from history. Don't let this kind of terrible things happen again! World peace!Nanjing Massacre upsets and stuns me every time when I think of it. Moreover, the fact of the Japanese government which distorted history and referred to the 1937-38 Nanjing massacre (an estimated 250,000 to 300,000 people were killed) by the innocuous title of \"incident\" is absolutely outrageous!!!!!!",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "In 1997, historian Iris Chang resurrected American memories of what was once a sensational scandal. In \"The Rape of Nanking,\" she gathered stories and pictures of the Imperial Japanese Army's conquest of that city in 1937, when it was the capital of China.Her book was a best-seller, and other Chinese-Americans also were documenting and publicizing these events, though with less impact than Chang's.But if Americans had almost forgotten the Rape of Nanking, neither the Chinese nor the Japanese had. \"The Nanjing Massacre\" brings together essays by three young historians exploring the historical interpretations of the event in China (by Mark Eyholt), in Japan (by Takashi Yoshida) and in the academy (by Daqing Yang).Chang's book was attacked by Japanese militarists. \"The Nanjing Massacre\" is a good place to start evaluating these criticisms, which were mostly unfounded.What Yoshida calls \"Japanese conservatives\" have denied the massacre, or, if admitting some small atrocities occurred, claim they were no worse than things done to the Japanese.None of the essayists doubts the Japanese slaughtered, raped, looted and burned their way across Nanking (or Nanjing) city and province. But they do doubt the honesty, clarity and reliability of the writing of the event's history on all sides.Eyholt reports that Chinese governments, both Nationalist and Communist, have generally found reasons to play down the massacre. The Communists have preferred to ignore it, and declined to seek compensation, because the regime has wanted economic cooperation with Japan.The level of cynicism displayed by the People's Republic government and the Chinese Communist Party is hardly surprising but nonetheless breathtaking: In the early '50s, the Communists blamed westerners in Nanking for aiding the Japanese. The truth was, any Chinese who survived did so because the Japanese were afraid of Western public opinion.In the '80s, Chinese students began investigating the massacre and publicizing it. Throughout the 20th century, from the May 5 movement in 1919 to the pressure on Chiang Kai-shek to resist the Japanese invasion of 1937, Chinese public opinion has been uniformly anti-Japanese and far more nationalist than the governments have been.The situation in Japan, as reported by Yoshida, is as would be expected. Japanese public opinion is overwhelmingly against admitting or apologizing for the massacre.The governments, the courts and what Yoshida calls \"progressives\" (a jumble of democrats, old socialists and decent people) hold the formal control of organs of \"public opinion.\" Government ministers who say the massacre never happened are forced to resign.But books exonerating Japanese war criminals outsell books telling honestly of the war in China by a hundred to one.Americans have invested a thousand times as much effort in understanding the Holocaust as they have in understanding Japanese war crimes. But editor Joshua Fogel warns against easy comparisons between the two forms of genocide. They are, the essayists agree, not directly comparable crimes.A great deal of the controversy has surrounded the exact total of rapes and murders. China has settled on a figure of 300,000 slain.Japanese revisionists have attacked this statistic. They argue that if they can show that the numbers were inflated, that would prove the massacre never happened at all.Anyhow, the relevant answer is not a number. The answer to \"How many Chinese were killed at Nanking?\" is \"all of them.\"All three essayists miss this point, which is, after all, the main one. Yang, in particular, surrenders to the fascists on the question of responsibility.Now that the story is falling out of the hands of the participants and into the hands of the professional historians, the fundamental problems not only do not receive better answers, they are being wrongly answered.The most egregious example concerns the extent to which higher levels of the Japanese army and government were aware of and tolerated or ordered the rampage.Historian Yang looks for a piece of paper either implicating or exonerating some group or other, though the answer is obvious to anyone. The fact -- and it is a fact -- that the Japanese exterminated almost a whole province, except about 200,000 Chinese who managed to crowd under the shelter of American and European flags, proves as much as anyone could want that the Rape of Nanking was calculated, deliberate policy of the army and the government.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the samurais garden",
        "description": "The daughter of a Chinese mother and a Japanese father, Gail Tsukiyama's The Samurai's Garden uses the Japanese invasion of China during the late 1930s as a somber backdrop for this extraordinary story. A 20-year-old Chinese painter named Stephen is sent to his family's summer home in a Japanese coastal village to recover from a bout with tuberculosis. Here he is cared for by Matsu, a reticent housekeeper and a master gardener. Over the course of a remarkable year, Stephen learns Matsu's secret and gains not only physical strength, but also profound spiritual insight. Matsu is a samurai of the soul, a man devoted to doing good and finding beauty in a cruel and arbitrary world, and Stephen is a noble student, learning to appreciate Matsu's generous and nurturing way of life and to love Matsu's soulmate, gentle Sachi, a woman afflicted with leprosy.",
        "authors": "['Gail Tsukiyama']",
        "infoLink": "https://play.google.com/store/books/details?id=9Wk_f67mqJ0C&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 41.0,
        "review": [
            {
                "review/text": "The Samurai's Garden is a soothing, hypnotic, heartbreaking, evocative book we all enjoyed. Is it the story of Stephen, a young Chinese man recovering from tuberculosis in pre-war Japan while under the care of a loyal family servant, the &quot;samurai&quot; of the title. The book explores cultural differences and similarities as it portrays the development of friendship and respect in disparate characters.With sparce and simple prose, Tsukiyama depicts her principals as humans who try to be good but not perfect; as people accepting their circumstances and finding inner peace despite their flaws and mistakes.Appropriate for all age readers, particularly young adults, we found a number of themes especially appealing: relationships, isolation/alienation and subsequent reconciliation, and the appreciation of inner beauty over physical appearance. Matsu, the &quot;samurai,&quot; was a perfect teacher/mentor for Stephen, as he avioded putting him under a microscope, but rather served as his guide to realizing his spiritual self.We hope you enjoy this book as ,uch as we did!",
                "review/helpfulness": "194/205",
                "num_reviews": 205
            },
            {
                "review/text": "This is a story told in diary form about a young Chinese man (a student) living in Hong Kong who, at the outset of World War II, has developed tuberculosis and is sent away to recover from the disease at his family's Japanese beach house. There he comes to know the Japanese caretaker of the house, the caretaker's female friend, and a girl who catches his fancy, people from whom we are to believe he has learned life's great lessons. The caretaker is silent, private, kind, and wise. The caretaker's friend is a once-beautiful, gentle, and loving soul, unfortunately sidelined with leprosy and confined to an inhospitable leper colony. And the girl develops a romantic interest in the young man, sealed with a kiss, despite her Japanese father's hatred of the Chinese. Noble creatures all.From the customer reviews, The Samurai's Garden appears to be a love-it-or-hate-it kind of book, with the Love-Its weighing in overwhelmingly, if not entirely incomprehensibly: while the book is lacking in every criterion of measurement (writing, research, character development, plot) it's a sad truth that serious fiction has always engendered little public favor here, and for its writers little financial reward. (For those who have not read this book, here's a hint: the serious reviewers (the New York Times Book Review, the New York Review of Books, the Washington Post, etc.) didn't waste space and ink on this thing.)With The Samurai's Garden, I found book meant not to enlighten but to sell. Add the book's unchallenging style, at most on the seventh-grade reading level, to its heavy dose of schmaltz, and it becomes inescapable that The Samurai's Garden was written with \"best seller\" twinkling before the eyes of author Tsukiyama, her agent, and her publisher.I was under no preconceptions when I picked up this book; I wanted to like it. Sadly, it disappointed. It is so shallow that you can skate across its surface. Its wobbly premise collapses under the least scrutiny. Its characters have the attributes and the attraction of stick figures. Its dialogue is tediously juvenile. But its most grevious sin is that it is boring. The writing is so flat that it doesn't have a pulse.One of the book's more disconcerting (if not outright funny) features is that Tsukiyama assumed that she could make the narrator (the young guy) a male, but she hasn't the ability to get inside the male head, and so for much of the time that character's aura was hermaphroditic.In terms of poor research, the most egregious example is tuberculosis. From her depiction of TB, I could believe Tsukiyama did no research whatever, as she seems to see living through it then as an extended vacation. On such a vacation, the caretaker meets the young man on his arrival at the train station and has them (the young guy schlepping his suitcases) jogging several miles to the beach house (had the wheel not come to Japan?), and later has the two of them jogging to the leper colony. This is crazy. In fact, TB was one of the leading causes of death during the time period in which the book was set. It had no medicinal cure. Rest -- not marching about -- was crucial to the patient's recovery. TB is highly contagious, is airborne, and spreads rapidly in enclosed spaces. The patient becomes very sick. He is febrile, loses weight, has night sweats, and is crushed by constant fatigue. You get none of this from Tsukiyama. A person with active TB is a serious health menace. That Tsukiyama should have him visit lepers whose immunity is already compromised (!), and for her to have him kiss the uninfected girlfriend (!) is grotesquely irresponsible.There is more. The story's possibilities lie in the ethereal vapor of unrealized hopes. Tsukiyama had the path open to explore differences in Chinese and Japanese cultures, but she didn't. She could have examined what the war meant to the Chinese and the Japanese, but she didn't. She could have enearthed the complexities of the Oriental servant-master relationship, but that was another missed opportunity, as was why the young man had the bizarre notion that the beach house really belonged to the the Japanese caretaker.\"The most engaging powers of an author,\" said Thackery, \"are to make new things familiar, and familiar things new.\" Of all of Tsukiyama's missed opportunities, the blue ribbon must go to her failure to heed this. It would have been lovely to experience the sights, smells, and energy that abounded in Hong Kong and at the Japanese seaside at that time, and how war affected the lives of those affected.It has been claimed that Tsukiyama writes clean, pure lines, which are of a piece of Oriental art. Well, for that matter, the Dick and Jane stories have clean, pure lines. I suspect that the clean, pure lines here are aimed at a targeted best-seller readership.",
                "review/helpfulness": "92/116",
                "num_reviews": 116
            },
            {
                "review/text": "Towards the end of The Samurai's Garden by Gail Tsukiyama, Matsu one of the main characters says, &quot;Beauty can be found in most places.&quot; And as I read this sentence, I thought no better words than beauty could be applied to this book. For sometime I have been told by many readers how much they enjoyed this book and now I wonder why it took me so long to pick up this title. Now I can only agree wholeheartedly with these readers and add my grateful appreciation to this author for writing such a wonderful book.Beginning in prewar China, we travel with Stephen a 20 year old man recuperating from tuberculosis, to his grandfathers beach house in Japan. Isolated from his family and friends in Hong Kong and his studies at the University, Stephens sole companion in Japan is Matsu, caretaker and gardener of the beach house. At first there relationship is strained and they have little in common. But as Stephen begins to paint and Matsu works in the garden, they begin to interact with one another and eventually become the best of friends. As Matsu introduces Stephen to the surrounding villages of Tarumi and Yamaguchi, Stephen also becomes acquainted with Matsu's friends which include Sachi and Kenzo. And as Stephen becomes more familiar with them he also learns more about their lives and entanglements and we as readers are first intrigued by these three people and then become enchanted as their stories unfold. Ultimately we learn as Stephen does about life, loyalty to family and friends, betrayal, attachments but most of all unconditional love. We watch as Stephen becomes more and more ingrained in the daily lives surrounding the beach house while Japan begins to invade China and Stephen's own family is going through their own eprsoanl upheavals. All too soon, with his health restored, Stephen knows he will need to leave this solitary life at Tarumi. The approaching war and distance leaves both him and readers to wonder if he will ever see these people again.Gail Tsukiyama has crafted a marvelous novel with layers placed upon layers to tell the story of extraordinary friendships. I found that when I read this book it was as if I was a next door neighbor to the beach hosue and priuvy to all that happened in these people's lives. And as I closed the book I had a profound sense of loneliness that my visit with them had come to an end. Although I seldom yearn for a sequel, I would love to know how life treated these characters in the future.",
                "review/helpfulness": "82/88",
                "num_reviews": 88
            },
            {
                "review/text": "Why is it that many readers fawn over insipid books full of greeting-card platitudes? \"Samurai's Garden\" is truly a poor book, yet review after review praises Ms. Tsukiyama's weak prose, clich&eacute; sentiment, and generally confusing novel. It's amazing this thing ever got published - but it's still more amazing that it outsells its superior siblings, such as Kim Todd's \"Tinkering with Eden,\" Andrew Sean Greer's \"The Path of Minor Planets,\" and even Tobias Wolf's \"The Night in Question.\" The exploration of why a large number of people flock to thin helpings of frosting for spiritual guidance belongs elsewhere - in a very large book, no doubt - and this is supposed to be a book review...so onward!!Tsukiyama's prose is insipid. Page after page reveals classic writing blunders. For example, she leans heavily on clich&eacute;. (\"His lips were set in a tight line.\") Uses adverbs to help interpret dialog. (\"...he said irritatingly.\") Constructs similes from the obvious. (\"She stifled her shout and put her hand over her mouth like a person who was holding back a scream.\") Relies on a single feature to repeatedly describe her characters. (Sachi's veil, anyone? How often does this veil slip, fall, or wag about her face?) This is the kind of writing that sends readers on auto-pilot, lulling them into a zombie-like waking sleep. We readers don't have to process the words - we actually consume this book without READING.Then there's the structure, which Tsukiyama decided to present in diary form. Which is fine in of itself, but usually presents the author with certain challenges. For example, a diarist can only write in his book if he's awake or conscious. However, in one memorable scene of \"The Samurai's Garden,\" the diarist Stephan is knocked unconscious during a storm yet is still able to describe his injury and sensation of blacking out in the day's entry. The novel is full of similar, if less egregious, violations of time and space.The characters are flat. Neither Matsu , Sachi, Stephan, nor Keiko have a single irritating or annoying habit. The main protagonist seems to lack an interior life, recording not a single personal secret thought in the diary. No character emerges from under the shadow of their identifying descriptor - Sachi's veil; Matsu's thick, muscular body; Keiko's younger sister; Stephan's tuberculosis. Matsu and Sachi spill their life's secrets without much prodding, yet they are both depicted as private and secretive. Everything complex, dirty, unpleasant, and interesting is swept from the pages of this book. There's not a single lie, duck-footed walk, penis, or bowel movement in the book.The historical facts upon which this book is based are completely muddled. What's Stephan doing in Japan anyway? He's from Hong Kong, which leads me to believe he's an English citizen, but that's not mentioned in the book. If he were a Chinese citizen, is it likely that he would be allowed to enter Japan? After all, the two countries are at war during the narration of the book. There is also a lot of animosity between the Chinese and the Japanese. Is it likely that a Japanese would readily be known as a servant of a Chinese in 1937? It seems unsafe and - knowing the national attitude of the Japanese towards their Asian neighbors in this time - unrealistic.And why doesn't Stephan even THINK TWICE about smooching his girl? He's got TUBERCULOSIS! Here's what I found in a simple web search about TB:\"The TB germ is carried on droplets in the air, and can enter the body through the airway. A person with active pulmonary tuberculosis can spread the disease by coughing or sneezing...To become infected, a person has to come in close contact with another person having active tuberculosis. In other words, the person has to breathe the same air in which the person with active disease coughs or sneezes.\"Considering that a medical cure for TB didn't exist until 1944, he's playing havoc with the health and life of his girlfriend, never mind the threat to her family's honor. But - oops! - I'm letting reality interfere with your enjoyment of the book!Most people who are reading this will be irate by this point. After all, if the Amazon posts are to be believed, the majority of readers actually liked this book. A lot. But I argue that your enjoyment stems from comfort and simplicity, a coddling of your entrenched clich&eacute;s about life, happiness, and existence. But the sentiments in this book do NOT add to our understanding of life! They're better saved for greeting cards. Life is rotten and mean, ugly, scary, dirty, and complex. No one is as simple, eager, honest, and good as Matsu - and thank goodness! What a bore! Everybody has mistakes in their past, has told lies, has wrong thoughts, and selfish desires mixed in with their good qualities -- Martin Luther King Jr was an adulterer, and Hitler was a charming dinner companion. Nothing is absolute. Life is a combination of good and bad, and the evolving dispute over what exactly those terms mean.\"The Samurai's Garden\" is a hiding place, not a vantage-point.",
                "review/helpfulness": "37/46",
                "num_reviews": 46
            },
            {
                "review/text": "Gail Tsukiyama is a masterful and wondrous storyweaver. The tale of Stephen and Matsu-san is a wonderful story of life, love, acceptance, forgiveness, and the power of all living things. By the second section I was captivated by the strong and silent character Matsu-san. And as I heard the despair of Sachi-san's life, in the section of 'Spring', and the terror that she lived through, I could not keep the tears from falling. This book helped me realize so many things about myself. I find that it teaches so much as the legends of characters unfold. I will keep their stories close to my heart ALWAYS. I would reccommend this book to absolutely every person on the planet. It moved me soo much! It is not only my favorite book. It is like a sudden realization of life and what is most important in life.",
                "review/helpfulness": "42/45",
                "num_reviews": 45
            },
            {
                "review/text": "The women in our book club enjoyed this book and found much to discuss. We talked about the war as a backgound as well as the differences between Chinese and Japanese cultures. We discussed the growth and maturation of the characters at length. The authors's devices and the style of her writing were talked about. As a whole, the group found this to be beautifully written and very meaningful in character portrayals. The consensus was that this is a novel of losses and gains and this phenomenon is repeatedly found in this very moving book.",
                "review/helpfulness": "38/42",
                "num_reviews": 42
            },
            {
                "review/text": "Since I have been living in Japan for the past 11 years, I believe that is was easier for me to respect the style Tsukiyama uses. From most of the reviews I've read, I think most people have been too closed minded to accept it. This novel is very powerful in the themes it presents through its characters. Tsukiyama has simplyed mastered the use the the &quot;understatement&quot;. Most American Readers may not be able to appreciate this style because they fail to see that it represents a line of thinking so prized in Japan. I believe Tsukiyama has a beautiful style that celebrates the simplistic view of life. Definetely a huge break from the busy, complicated lives most people live through in today's world. Read it and apply it to you lives.",
                "review/helpfulness": "27/29",
                "num_reviews": 29
            },
            {
                "review/text": "Gail Tsukiyama's &quot;Women of the Silk&quot; and its sequel, &quot;The Language of Threads&quot; are my favorite novels. I think this novel is excellent too but it leaves something to be desired. It's because I'm Japanese.The protagonist, Stephen (he's Chinese but was given a Christian name by his parents) came from Hong Kong to Japan to recuperate from tuberculosis. There he met Matsu, his family's servant and skillful gardener, and Sachi, a leper who lived in a small community deep in the mountain. In spite of the ongoing war between China and Japan, they took each other to their hearts. The story about their spirits is very touching.But Tsukiyama's description of Japanese seasons and culture loses some reality (in Honshu, the mainland of Japan, we can't swim in Autumn; the autumn equinox is not the first day of autumn here; in a funeral women in kimono don't wear veil; etc.). Once I decide it's a portrait of imaginary Japan, it's excellent for me like her other novels.P.S. Japanese lepers finally redeemed their honor by winning their suit against Japanese government last month, after several decades of struggle.",
                "review/helpfulness": "23/27",
                "num_reviews": 27
            },
            {
                "review/text": "Reviews of the Samurai's Garden seem to fall into two camps. The \"Oh my God, I loved it-best book evers\" and the \"Are you kidding me? This book stunk category!\"My problem with those in the latter category is that (with a few exceptions) readers who did not like this book tend to mount some moral literary high horse. They relish insulting other reviewers, as in \"Anyone with any discerning taste and one scintilla of brain cells would NEVER like this book, ergo if you do you, I hate to break this to you, but you are a stupid, simple, idiot.\" Listen to yourselves! I wonder what it must feel like to these people to know everything?Anyway. I did not particularly love this book, but I really can see how many did. The case can definitely be made that there were many layers of beautiful, intertwining lessons in this seemingly simple, yet really more-complex-than-it-looks book. In that sense, it kind of reminds me of the polarizing effect of the Ladies' Detective Agency series by Alexander McCall Smith.My biggest problem with this book was that I don't think I was in the mood for it. I read it at a time when I had a lot going on, and couldn't sufficiently savor it. This is a book to be savored in peace. For most of my read of it, I wasn't in a peaceful frame of mind as a reader. My personal restlessness wanted more action, less bean cake eating. A few times, however, despite myself, I was caught flat-footed with awe by something in the story. The one thing I took away was to never forget that everyone has a story that helps define them. You just have to be still and listen.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "The Samurai's Garden - Gail TsukiyamaA young Chinese man comes to Japan to recuperate from tuberculosis in THE SAMURAI'S GARDEN, a beautiful book written by Gail Tsukiyama filled with wonderful images and poetic prose that paints a gentle backdrop of rural Japan before the start of World War II.Stephen has grown up in Hong Kong and lives most of the year there, but in the late 1930's he comes to Japan to stay at his family's summer residence to get away from the humidity and heat. It is his parents' hope that the cooler drier climate may help clear up his tuberculosis and improve his health.Stephen comes to the ocean-side town of Tarumi, expecting the worse. He is not happy that he is being sent away from home. However, he adjusts to his new way of life, learning to love the solitude and peaceful life that their housekeeper Matsu has led for nearly all his life. Through Matsu, Stephen learns to appreciate a different way of life, and finds that he enjoys being in Japan and learning about the people in the town of Tarumi, and in the nearby mountain town of Yamaguchi, where Matsu's dear friend Sachi lives. He spends his days painting or taking walks along the beach or visiting with Matsu and his friends.Stephen also befriends one of the local girls, Keiko, who is closer to his age than Matsu or Sachi are, and they develop a relationship that is rather tenuous throughout it's entire existence because of the war between their two countries.In the meantime, the Japanese Imperial army has captured many key cities in China and are slowly making their way south, heading towards Hong Kong. Stephen feels the tension around him, as he himself is an outsider and is considered the enemy by those who know he is Chinese. On the other hand, Stephen learns that despite the fact that he is living with the Japanese, he loves his new friends and does not want this war to come between them.Gail Tsukiyama's story of Stephen and his experiences during his year in Japan is no more than a series of observations and reflections of a young man viewing life through a new set of eyes. Written in the form of a journal, THE SAMURAI'S GARDEN lacks a strong plotline and doesn't have much action. However, it is made up by the beautiful prose and commentaries that form the thoughts of young Stephen as he discovers love of a young woman in a foreign land, love of friends, and love of a foreign country that he will never forget. Having already read DREAMING WATER, THE SAMURAI'S GARDEN was another wonderful treat and I am looking forward to reading yet another novel by this author.",
                "review/helpfulness": "20/24",
                "num_reviews": 24
            }
        ]
    },
    {
        "Title": "culture shock japan culture shock guides",
        "description": "CultureShock! Japan is a survival guide for anyone living, working or wanting to discover life in the Land of the Rising Sun. -Insights into the people and their culture and traditions -Advice on adapting to the local environment -Essential information on the coutnry's history, traditions, beliefs, etiquette, cuisine and leisure activities -Suggestions on how to get the most out of the travel experience -Hints on how to learn the language and do business -A useful list of foreign words and phrases and a comprehensive resource guide -A list of books for further reading and interesting websites for additional reference -Lively and humorous illustrations that capture the essence of the text",
        "authors": "['Raina Ong']",
        "infoLink": "http://books.google.nl/books?id=w8QxMQAACAAJ&dq=Culture+Shock!+Japan+(Culture+Shock!+Guides)&hl=&source=gbs_api",
        "categories": "['Etiquette']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As an administrator in a ESL school, where 10% of our students come from Japan, and at least 10% of our ESL teachers trainees plan on going to Japan to teach English, Culture Shock Japan was an wonderful discovery for me! P. Sean Bramble unveiled the cultural mystery step by step from every aspect of life. It's a great reference book for anyone, no matter whether you are planning a trip to Japan, moving to Japan for a long period of time, your work involves dealing with Japanese culture like mine, or you are simply curious about this modern and ancient eastern country. One of my favorite things about the book are the hilarious little stories that Bramble collected from his own 12 years of experience living and working in Japan, which gave me many giggles through out the reading.Those stories are particularly funny to me, because they often echo my own experience of of culture shock when I first immigrated to the United States from China 7 years ago. Although, I am completely annoyed when people get confused between Japan and China, there are after all lots of similarities when it comes to clashes between Asian and western cultures.I also admire the fact that the author was willing to take the risk of being accused as negative or judgmental to honestly point out the frustrating reality of living and dealing with a new culture in a tongue in cheek manner. Unlike promotional travel books, which only portray the wonders of a destination, this book gives unvarnished insight into a country where modernity meets ancient traditions, efficiency is created by rules but also destroyed by rules. It gives insider's advices on how a new comer can be prepared to begin understanding, embracing, and even having a bit of fun with the culture he is about to clash into. As I closed the book, I felt as if I had just finished a tour lead by an experienced open heart with a true sense of humor. I am now much more ready for a real trip to Japan.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "It certainly seems that the author would rather we not visit Japan, and perhaps he'd rather not live there. He seems to focus entirely on the struggles a Westerner will experience, and focuses very little on the daily interaction and culture of a country with several thousand years of cultural history. But hey, if you're a business-person planning on spending six months working in Japan, Culture Shock Japan might be able to tell you how not to embarrass yourself in very specific corporate interactions...but maybe you might just want to skip the experience altogether.Also, with Tokyo being the nexus of technological advancement, the author too often editorializes with a \"kids these days\" sort of attitude regarding technology and entertainment. I can just picture the typewriter he used when writing the first draft.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I was stationed overseas for about 1 1/2 years before I read the book. Many questions I had were answered. This book explains a lot of the everyday things you'll see/notice in Japan. Not much of a history book (which wasn't what I was looking for @ the time) but a very modern explanation of all the strange things Japanese people do.I highly recommend this book for anyone that is going to live in Japan for an extended period of time.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "While preparing for a trip to Japan, I read this book and Culture Shock! Tokyo At Your Door by Yuko Morimoto-Yoshida. I have to say (in contrast to Morimoto-Yoshida's book), this book was really unhelpful in helping prepare a Westerner for Japanese culture.Bramble's book simply reads like an American friend was telling you about all the odd customs and cultural mistakes that he made while living in Japan. While that's interesting from an anecdotal standpoint, there's appears to be very little actual research done beyond his own personal experiences.Take for example, the section of \"Doing Business In Japan.\" Bramble mentions conservative dress, the importance of business cards, resumes, and a little about negotiating. The rest of the section is useless, including an overly long discussion of the different types of jobs like hostessing and waiting tables that a Westerner can do. There is so much more to \"doing business in Japan\" than dressing conservatively and carrying a business card! But unfortunately, you wouldn't know that if you only read this book by P. Sean Bramble.Don't bother with this book. It does a disservice to Japanese people, Westerners living there, and people planning to travel there.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book does have a little useful cultural and historical information but the author's biting criticisms of the culture made me wince as I read it. Can you say arrogant American? (Although he writes as if he was British.) I don't understand why, if he hated the country so, he stayed there so long. Buyer beware: although the publication date is 2008, it appears to merely be a reprint of the original 2004 without edits. There is no indication as to when he made his observations of Japan. Case in point: the book talks about using AOL for internet service and how mobile phones are gaining in popularity. I've traveled in Japan in 2009 and 2010 and it is not the backwards country he makes it sound like. I would look elsewhere if you want a less biased but more informative book on Japanese culture.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Logically organized and clearly indexed, easy to read with hints and humor. Table of Contents nicely formatted. An awareness of the customs will help avoid insulting their culture. Some spots seem over detailed but perhaps that is due to my being a first-time visitor and have much to incorporate",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I found this book very helpful in preparing me for a recent trip to Japan. It contained a lot of information on what to expect culturally in Japan, and helped me make a few less \"outsider\" etiquette blunders. I would recommend this book to anyone heading to Japan as a good guide to help you feel a bit more comfortable in a strange land.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "grass sandals the travels of basho",
        "description": "An evocative portrait of the great Japanese haiku poet describes Basho's many experiences as he traveled throughout his beloved native Japan, in a volume that also includes haiku written by Basho and Japanese characters that represent words from the verses.",
        "authors": "['Dawnine Spivak']",
        "infoLink": "http://books.google.nl/books?id=8s4WAQAAMAAJ&dq=Grass+Sandals+:+The+Travels+of+Basho&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "In the story Grass Sandals, there is a Japanese man named after a banana tree called basho. Basho loved nature so much that he wrote about it as a haiku poet. He lived in his small house in Edo surrounded by the morning glories in the 1600's. But one day, Basho decides he wants to travel because he is restless back at his home in Edo. Before his trip, Basho's friends give him supplies for his trip including grass sandals. On the trip he writes about what he sees, meets friends, and discovers different places in this adventurous book!I enjoyed this book very much because I loved all the places he traveled and all the creative poems he wrote. I recommend this book for all afes. It is very well written!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I read the book Grass Sandals. The main character is Basho. In the story, Basho travels all over Japan. He lives in Edo. The story takes place in the 1600's. Basho wrote poems about nature and by listening and looking at his surroundings.It liked this book because it made me feel like I was there with Basho.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Grass Sandals is a great book about friendship and poems. The main character's name is Basho. Basho liked to have tea on his porch every morning under his basho tree. Basho lives in Edo. Basho likes to travel around his country. When Basho is traveling he gets many gifts from his friends. Basho is great for his blue grass sandals (from his friend) and for haikus. This story took place 300 years ago in Japan.I really liked this book because of its illustrations and of how well it is written. I think that this book would be good for people who like books from other countries. I also think parents would enjoy this story too!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This picture book presents Basho's travels, with a curious focus on the Japanese characters for various words in his haiku; I wished there had been more emphasis on the haiku themselves. But the illustrations are enchanting and evocative, deep and glowing, with a whimsical touch. While this book doesn't have the deep understanding of haiku found inCool Melons - Turn To Frogs!: The Life And Poems Of Issa, it would be a charming supplemental text for grade school units on haiku, poetry, biography, and historical Japan.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "read japanese today",
        "description": "The method that has helped thousands-Read Japanese Kanji Today provides readers with a quick and simple method to learn kanji characters. Far from being a complex and mysterious script, Japanese writing is actually a simple and fascinating pictographic and ideographic system, easily understood and mastered. With the approach used in this easy-to-read, entertaining kanji book you'll soon be able to recognize and read over 400 kanji, whether or not you have any knowledge of Japanese grammar or the spoken Japanese language. The 400+ kanji characters stick in your mind thanks to an engaging text and illustrations that show the historical development and meaning of each character. The description of each kanji explains its origins and development, its modern uses, and how it is pronounced. Many examples of everyday usage are included. This new, expanded edition has added: Pronunciations Readings Vocabulary Stroke Order Practice Boxes Use Read Japanese Kanji Today to learn kanji quickly and painlessly!",
        "authors": "['Len Walsh']",
        "infoLink": "https://play.google.com/store/books/details?id=H8A0DwAAQBAJ&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I've read and reread this work since buying it many years ago. It came in handy when we traveled to Japan: I actually understood much of what I was looking at--at least on signage--while the overwhelming majority of tourists stared dumfounded. A word of advice: I would look into Chinese first--please check out Diane Wolff's marvelous &quot;Chinese for Beginners&quot;--inasmuch as Japanese writing was built on top of Chinese. You'll get much more out of Walsh if you read Wolff first. Also, don't think for a moment that, just because you recognize a kanji, you know the meaning of the phrase in which it appears. We learned the hard way that the Japanese mind combines characters and components of characters in _very_ peculiar ways--it was often quite a surprise when a native told us what that sign over there actually meant after we told him what we ambitious gaijin thought it meant! Walsh's book cannot possibly equip you in only a couple of hundred pages to understand why &quot;lawful-language&quot; means &quot;French,&quot; or why &quot;self-move-concentrate-mind&quot; means &quot;Caution: automatic door&quot;--or why &quot;water&quot; means &quot;Wednesday&quot; on that poster! Also, bear in mind that some of Walsh's explanations for the derivation of various kanji are suspect. That doesn't really matter, of course, if his mnemonic helps you remember it--as long as you're not a philologist. Take it for what it's worth, and enjoy your heart out!",
                "review/helpfulness": "26/31",
                "num_reviews": 31
            },
            {
                "review/text": "Anyone learning or considering learning Japanese should read this book ASAP, even before looking at the kana or a grammar text (before considering books for these things, search out &quot;The Quick and Dirty Guide to Japanese&quot; and a good free kana drill program, if you want to save yourself time and money). The kanji are easy to memorize, given explanations of what they are supposed to look like. After reading it, kanji won't look like bizarre unreadable symbols, but familiar pictures of common things.Those pictures will make learning spoken vocabulary far easier than trying to learn spoken Japanese without the writing.Once you have it, take a whole day and read it through like a novel - twice if you have time. After that, you will be shocked at how much you retain. The title is not an exaggeration; after one day, you can be reading Japanese (though you'll need to learn the kana; this book has a simple section on that too).",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "The formidable hieroglyphic writing system used by Japanese is perhaps the most intimidating challenge, among many, for native English speakers. Adopted from the ancient Chinese script in the 3rd century, the Japanese written word can seem indecipherable at first glance, like a modern Rosetta Stone. But Len Walsh actually makes sense of it in this splendid little book. He organizes each character group into categories like tools, animals, derivatives of the hand, money, and the like. He shows how the Chinese script began with approximations of basic, concrete objects in nature-- the hand, the sun, the mouth, the eye, the horse, the dog, and so on-- and then began to encompass abstract concepts via metaphors, stories, and incidents involving the concrete ones. You see how the basic characters, squared off and standardized to allow for easy writing, are incorporated as radicals into more complex ones, and how compounds are formed to represent basic concepts. And since you'll learn this history, you'll learn how to glean the meaning of a character based on its constituents. You learn, for example, how the character for &quot;mura&quot; (&quot;village&quot;) came about, uniting the radicals for &quot;tree&quot; and &quot;law&quot; (the latter itself a metaphorical extension of a character for &quot;measure&quot;), with the village symbolizing a social structure that brought law out of the tree-lined jungle. You'll learn how the character for &quot;name&quot; (Japanese &quot;na&quot; or &quot;mei&quot;) arose from a combination of &quot;evening&quot; and &quot;mouth&quot;-- stemming from an ancient Chinese practice of sentries demanding the names of passersby at night. Thus you not only learn the characters themselves, but gain an insight into ancient Chinese and Japanese culture.Each character is not only drawn out and linked to a word in English; its reading (pronunciation) in Japanese is given as well. Japanese characters generally have multiple readings, which vary depending on whether the character is used as a standalone word in a sentence, or one character in a compound that represents another word (e.g. a stone being &quot;ishi&quot; by itself and &quot;seki&quot;-- as in &quot;sekiyu,&quot; petroleum-- in compounds). The standalone reading is usually native Japanese, while the reading in compounds is quite frequently borrowed from the equivalent Chinese word-- although just as French-derived English words, derived usually from Old/Middle French, differ from modern French, the modern Chinese equivalent will often vary somewhat from the Japanese. Walsh illustrates the history of the characters based on the Shuo Wen Chie Tsu, the classic source from the 2nd Century A.D. explicating the origin of the Chinese characters. Walsh's own drawings are lucid and comprehensible, and the story of many characters' origins often quite humorous (still trying to figure out how &quot;mono,&quot; meaning &quot;thing,&quot; arose from the combination of a cow and an elephant). In any case, you should pick up this book even if you intend only to learn spoken Japanese. You'll acquire a feel for how the vast majority of Japanese words were assembled from simpler compounds, and you'll sense the logic of the design. A very highly recommended book.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "If you want to learn to read kanji, there's no faster or easier way to pick up the basics than reading this book. When Walsh promises you'll be able to read basic Japanese after &quot;Read Japanese Today&quot;, he's not kidding. And the way it's written, you read it like you would fiction or easy non-ficiton and you pick up the Japanese characters without even realizing it!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I enjoyed this book very much and it was very easy to read. But it didn't really teach me much. The \"vocabulary\" is very limited and information on how to actually read Japanese is pretty much non-existant - it's more a guide on how to recognize occasional characters. If you are curious about the writing system or are travelling to Japan and just want the thrill of recognizing a few characters, this book will be good for you. If you are a serious student beginning a life-long journey of learning to read and write Japanese, I would recommend A Guide to Remembering Japanese Characters by Kenneth G. Henshall.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "...this is the book you'll want to get first. Many people studying the Japanese language, even those who have successfully learned the hiragana and katakana, become filled with anxiety at the prospect of kanji. If you really want to understand how Japanese words are constructed and by able to read and write proficiently, you'll need to at least become familiar with the kanji. Becoming familiar with the kanji is the step you must take BEFORE trying to diligently memorize all of them. You will probably get bored and disinterested if you try to start from the beginning and rigorously attempt to learn and master the stroke order, pronunciation, English meaning, and how to use them in words and sentences! Before you even come close to doing that, it is important to grasp what kanji are first.This book is arranged in a \"building block\" style; the book continually builds on what it has just taught you. The origins of Japanese writing, how the characters were constructed, how they came from China, and so on. This book does not have the style of a textbook at all; it is a very informative overview of the meanings of around 300 common Japanese kanji and how they have changed from their ancient pictograph forms. For example, Section Two begins with showing how the character for sun (which originally looked very much like a sun) developed into the more square form that it is today. Thematically-related characters are discussed next to one another; the next character, \"tree\" precedes \"root/origin\". Then the word \"nihon\" (literally \"sun-origin\"), which means Japan, is introduced. As you can see, kanji are introduced slowly and in a matter-of-fact way that won't result in any confusion as to their meaning. The book is short enough to be able to read in one or two sittings and afterwards I guarantee that you'll find that you are able to recognize most (if not all!) of the characters introduced in this book. You'll have a clear understanding of their pictograph origins in China and you'll understand that they are symbols for concepts and are used in words.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "As a first kanji book, this is excellent; it got me hooked on learning kanji. It's short but straight to the point, and very easy to read. It starts off describing how the simpler characters came to be, and builds on these as it shows how they are combined to form the more complex characters.In total, about 250 characters are explained. The book gives some readings (in romaji) for each character, and example compounds in some cases too. There are no mnemonics for learning the readings, however, and the book does not describe how to write the characters.Some of the etymologies differ from more accepted versions. For example, \"iro\" (colour) is described as a person leaning over a window rather than over another person. However, the author's interpretations do have great mnemonic value. Generally, he is very good at tying the original meaning of a character to its modern meaning; sometimes they may appear to be unrelated, but he is able to make them seem logically connected, which is what makes them memorable.I recommend this as your first kanji book. It requires only a very small investment in money and time, and is fun to read. And it will give you a good grounding in kanji recognition for when you move on to a more thorough book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I just bought this book two days ago and cannot put it down. Mr Walsh gives a good account of how the Chinese first devised their pictographic writing system, and how it was later borrowed by the Japanese. He supplies each kanji with a mnemonic device that makes it easy to remember. The book is written such that it is very accessible to the complete beginner. I agree with the reviewer who recommended getting this book as a first introduction to learning the kanji. To learn the kana, I would recommend Heisig's &quot;Remembering the Hiragana&quot; and Morsbach and Heisig's &quot;Remembering the Katakana&quot;.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a great little book.Len Walsh really plants the love of KAnji learning.It doesn't pretend to teach you every Kanji, or thousands of compounds. It gives a really simple and enjoyable introduction to Kanji and how they were derived.I would recommend this book to anyone who is interested in learning Kanji/Japanese.A great book to go a stage further with is Ken Henshalls &quot;Guide to Remembering JApanese Characters&quot;. Full of useful mnemonics and all Joyo Kanji.Both are great - enjoy!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "As advertised, this book is a solid introduction to about 300 common kanji. Walsh wrote the book with a flow that allows you to read it like a story. The characters are explained in terms of the evolution from ancient Chinese drawings to modern kanji. Walsh also gives the various pronunciations of each, as well as examples of how you will see them in context.My primary criticism is the lack of an index or headings. Walsh will say, \"the following are based on animals,\" where a heading would be more functional. Along with the lack of an index, the book cannot easily be used as a quick reference.However, I highly recommend this for anyone interested in the basics of kanji. It is an excellent first step before moving on to more advanced study.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "okinawa the history of an island people",
        "description": "\"The first full-length monograph on the history of the Ryukyu Islands in any Western language...a standard work.\"-Pacific Affairs Okinawa: The History of an Island People is the definitive book available in English on the history of Okinawa and the Ryukyu Islands, and an influential scholarly work in the field of Japanese studies. The histories of Japan, Okinawa, and the entire Pacific region are crucially intertwined; therefore the review of this fascinating chain of islands is crucial to understanding all of East Asia. Few people can point to Okinawa on a map, yet this tiny island sitting between China and Japan was and continues to be one of the most crucial Asian nerve centers in all U.S. strategic defense. Ninety percent of all U.S. military forces in Japan are located on Okinawa, and more than 500,000 military personnel and their families have lived there. In Okinawa: The History of an Island People, noted Eastern affairs specialist George Kerr recounts the fascinating history of the island and its environs, from 1314 A.D. to the late twentieth century. First published in 1958, this edition features an introduction and appendix by Okinawa history scholar Mitsugu Sakihara, making this the most comprehensive resource on the intriguing island of Okinawa.",
        "authors": "['George Kerr']",
        "infoLink": "http://books.google.com/books?id=78yHswEACAAJ&dq=Okinawa,+the+history+of+an+island+people&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Just as Gibbon's classic history of the Roman Empire tells us that Armenia has been a center of conflict since time immemorial, so also does Kerr's classic work remind us of the centuries of conflict Okinawa has witnessed. Just like Armenia, so also does Okinawa deserves something better.Okinawa's early history was pockmarked by a series of kings struggling to maintain control over fighting warlords. Although Shunten established his kingdom in the 13th Century by defeating his rivals, the entire island was not totally unified until a century later when Sho Hashi conquered the three kingdoms, which made up the island. Peace, of a sort, reigned until 1609, when the Shimazu clan from Satsuma, in southern Japan, invaded Okinawa.For the next 270 years, Okinawa was, in effect, a Satsuma colony. Satsuma demanded taxes from the Okinawans and controlled trade in exchange for island protection. Commodore Perry's black ships, as chapter seven explains, also paid an unwelcome visit during 1853 and 1854. Perry, who established a small military base there, clearly had plans to bring the entire Ryukuyu Islands into the American ambit.Napoleon Bonaparte had similar plans. He regarded Okinawa as being central to France's vital interests. Anglo-Chinese tensions brought Okinawa further unwanted attention from both Britain and China. Because Britain, France and the United States were all making efforts to colonize the island chain, an increasingly apprehensive Japan tightened its grip on the island by sending a military detachment there in 1868. Later in 1879, Japan abolished the royal government and annexed Okinawa as a prefecture.Okinawa was then left in relative peace until 1944, when the Japanese Army arrived in force to counter the impending American attack. The Battle of Okinawa was one of World War II's longest, bloodiest and hardest fought campaigns. Total American casualties were 49,151, including 12,500 killed or missing in action. Japanese Imperial Army losses totaled over 75,000. Nearly one-third of Okinawa's civilian population-100,000 people-also perished during those nightmare months. The battle ended on June 22, 1945, when Old Glory fluttered unchallenged from Okinawa's mountains and towns.The Stars and Stripes have been flying there ever since. The area stayed under American military control until May 15, 1972, when Richard Nixon transferred administrative authority of the Ryukyu Islands back to Japan. The islands resumed the status they held prior to 1945 - the 47th prefecture of Japan.Ryukyu means Beautiful Country of the Southern Ocean. Like Armenia, it is indeed a beautiful and haunted land. However, just like Armenia, it is in an unfortunate position. Because it straddles the seaways between China and Japan and because it is near to Korea, the Spratly Islands and a host of other strategically important sites, it remains one of the most militarized places on earth. As the author makes plain, China and the Philippines periodically claim the island chain as their own. When we read the book, we see how truly unfortunate this is.Kerr paints the golden days of Okinawa before these outside pressures came to dominate the island. He describes how an impoverished people living on barren islands with no metals and little forest wealth were able to construct and preserve for many centuries a complex, progressive and stable government and society. Unlike some of the world's more endowed areas, the Okinawans, like the Armenians, had a toy state, with dignified kings, sententious and learned prime ministers, as well as an abundance of temples and shrines. Okinawa's whole fragile, minuscule structure was developed in a faithful effort to emulate great China, Asia's fabled Middle Kingdom.Although Kerr paints this beautiful experiment with enchantingly melancholic hues, he makes it plain that there can be no return to those golden days. Maybe with peace pending on the Korean peninsula, a new and equally beautiful experiment in social engineering can begin. The people of Okinawa richly deserve it.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Researched and written by George H. Kerr, I believe that this book is accepted as the premiere text of authority with regard to the history of pre-war Okinawa.I've read and re-read this book and have a much greater understanding of the people of the Ryukyu Islands - and I also have a much deeper regret for having not known this history while living among the Okinawans.\"...this is the history of a little-known people whom events have made it necessary to know well. It is also one of those all-too-rare books that happily combine solid scholarship and detailed accuracy with a forthright, enjoyable literary style that does justice to the storybook quality of many of the episodes. It will long remain the standard history of Okinawa and the Ryukyus.\"",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the nightingale",
        "description": "\"From the #1 New York Times bestselling author comes Kristin Hannah's next novel. It is an epic love story and family drama set at the dawn of World War II. She is the author of twenty-one novels. Her previous novels include Home Front, Night Road, Firefly Lane, Fly Away, and Winter Garden\"--",
        "authors": "['Kristin Hannah']",
        "infoLink": "http://books.google.com/books?id=B6eQBQAAQBAJ&dq=The+Nightingale&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 3535.0,
        "review": [
            {
                "review/text": "The Nightingale is an entry in the Fairy Tale series including such notables as Briar Rose (Jane Yolen) and Snow White and Rose Red (Patricia C. Wrede). Dalkey retells the familiar story of the nightingale-- in a setting of feudal Japan rather than the original China.Dalkey is clearly fond of Japanese culture, and her knowledge of the many different aspects of its religions is impressive. She builds an evocative Japanese background and fills it with new interpretations of an old fairy tale. The nightingale is no longer a bird, but a very human woman whose flute is a tool through which dead ancestors seek vengeance on the emperor.Quite enjoyable; rather like her newer novels Little Sister and The Heavenward Path for an older audience.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I discovered Pamela Dean's _Tam Lin_ a couple of months ago, and ever since, I've been reading all the books in the Fairy Tale Series that I can get my hands on. _The Nightingale_ was the most recent one I read._The Nightingale_ makes a pretty decent &quot;for-fun&quot; read on a night when you just want to unwind with a story. However, it wasn't the enchantment I expected. Mostly I think that's because of the klunky historical detail that hit me over the head like an anvil every couple of words. No one ever just walks across the room in this book; they walk in their Authentic Japanese Shoes across the Authentic Japanese Floor, and arrive at the other side of the room, where they sit down on an Authentic Japanese Piece of Furniture. Dalkey wants to immerse us in the period; instead it feels like a history lecture at times. I contrast this with Ellen Steiber's novella &quot;The Fox Wife&quot;--in Steiber's story, we know full well that we're in feudal Japan, but the detail is subtle and flows naturally with the story. (To find &quot;The Fox Wife&quot;, see the anthology _Ruby Slippers, Golden Tears_.) I also felt that the characters could have been developed more; the most interesting characters are the poet Shonasaki (who has only a sidekick's role), and Amaterasu, who's a goddess and not a &quot;character&quot; as such. Uguisu, the protagonist, just seems to be an innocuously nice girl who plays the flute much too well for a beginner, and once in a while shows some backbone that she keeps hidden the rest of the time.Kudos, though, to the storyline involving Amaterasu (fun!) and the way the Uguisu/Takenoko/Emperor love triangle was resolved; it was done in a way that was true to the characters, rather than being formulaic. The book gets much better in the last section.Also, if you get the chance, read her later short story &quot;The Chrysanthemum Robe&quot;, in the anthology _The Armless Maiden_. It is better-written than this novel, and the story is absolutely heartbreaking.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "my twentyfive years in china china in the twentieth century",
        "description": "The ancient story of King Goujian, a psychologically complex 5th-century BCE monarch, spoke powerfully to the Chinese during the 20th century, but remains little known in the West. This book explores the story's connections to the major traumas of the 20th century, and also considers why such stories remain unknown to outsiders.",
        "authors": "['Paul A. Cohen']",
        "infoLink": "http://books.google.com/books?id=qbowDwAAQBAJ&dq=My+Twenty-Five+Years+in+China+(China+in+the+Twentieth+Century)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Powell's book covers the period between (1917-1945) and discusses the personalities of the day: Chiang Kai Shek, Yuan Shi Kai and Chang Husiliang as well the intrigues of the Soviets and the Japanese.The book is a little dry, though the anecdotes are funny don't expect a lot of caricatures or social history. The book talks about politics namely who should rule China and why.This book is free of the communist revisionism that taints most modern books.Note: Powell lost both his feet to the Japanese at his stay at the Bridge House.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very interesting... Powell is an excellent author, superb theme and idea.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the nanking massacre fact versus fiction a historians quest for the truth",
        "description": "Japanese professor uses contemporary records (or their lack of) to show that there is no proof of a massacre in Nanking.",
        "authors": "['Higashinakano (Shudo)', '東中野修道']",
        "infoLink": "http://books.google.nl/books?id=QjdxAAAAMAAJ&dq=The+Nanking+Massacre:+Fact+versus+Fiction:+A+Historian%27s+Quest+for+the+Truth&hl=&source=gbs_api",
        "categories": "['Nanjing (Jiangsu Sheng, China)']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Most Americans ingest the news and entertainment served by the establishment media without a second thought. The 1960's mantra of \"question authority\" has been replaced today by \"embrace authority.\" The sky-high approval ratings and prominent flag waving went hand-in-hand with blithe acceptance of the official reasons for invading Iraq in 2003. Today, increasing numbers of Americans are discussing the real circumstances surrounding the entry into war, which were initially either ignored or suppressed by the government. Upon further reflection, more and more Americans are beginning to understand the way in which Washington, D.C. really operates. It is critical that Americans understand the un-spun, unvarnished truth about the world, since bad policy formulated in the U.S. will have dire consequences on the rest of the world.Most if not all Americans unwaveringly believe the \"Nanking Massacre\" tale. The message from films and TV is emphatic: \"those evil Japanese savages!\" Thus, for those who wish to present facts that invalidate the official version of history struggle against a media conglomerate that dictates what is and what is not acceptable discourse. Furthermore, TV news programs have deliberately aired government-produced propaganda as actual news. With most Americans slavishly following the media's position, it should not be surprising that anti-Americanism through out the world has risen to a new and deadly level.\"The Nanking Massacre: Fact versus Fiction\" by Dr. Shudo Higashinakano is an attempt to replace TV-depicted nonsense with reality. For those with limited knowledge of the situation in China in the 1930's, a background is given. Although supporters of the \"massacre\" story will readily dismiss contemporary Japanese media reports emerging from Nanking, Dr. Higashinakano does not rely solely on those reports but cites foreign reports. League of Nations condemnation of Japanese aggression in China is described - oddly, there is no mention of mass atrocities taking place in or around Nanking, despite the fact that Nanking was the capital of the Republic. Indeed, even Mao made no mention, either during or after the war, of atrocities occurring in Nanking. The so-called eyewitness testimonies of the numerous atrocities are demonstrated to be second-hand reports or rumors at best and sheer fabrications at worst. Despite foreign military occupation, Nanking was definitely not a Falluja-like hell. Although in general clearly written, there are several areas of the book with confused English that made reading difficult. One would expect that a $30 book written in English would have better editing.There are two issues that lie with this book and extend to other books like this (e.g. \"What Really Happened in Nanking,\" by Masaaki Tanaka). First, historians should consider placing the Sino-Japanese conflict in the contexts of both early 20th century imperialism and the threat of Communism. The battle for Nanking was a fragment of the larger struggle between East and West, or, Asians vs. Whites. The \"revisionist historians\" may want to consider place Nanking within the context of the larger racial struggle. There maybe English language books that previously discussed this theme, but have not found their way into the mainstream, since Japan is still today portrayed as the aggressor in American history classrooms, films and TV programs. There will be those who argue that Japan had no right in interfering with a sovereign country, but a glance at a world map of the 1930's will demonstrate how hollow and hypocritical the argument is. The same people that argue against Japanese imperialism will probably argue in favor of U.S. imperialism in the Middle East. If placed in the proper context, perceptive Americans will be able to better appreciate Japan's pre-war situation.The second issue that needs to be fully developed in English language books that refute the \"Nanking massacre\" is understanding the motivation of Asians, particularly the Communist Chinese, of why they persist in bringing up this issue year after year, despite the factual weakness of the allegations. Perhaps the Chinese see \"Nanking massacre\" as a domestic cudgel, in that the Communists have no real way of uniting over 1 billion people other than by the use of repression or channeling the people's attention on an external enemy, ala \"1984\". As some minority groups have done in the past in Europe, the Chinese may also be using \"Nanking\" as a moral-economic weapon, evoking guilt to extract reparations, economic aid and other \"donations\". Understanding why the Chinese keep the war-time myths alive would help to deflate their usefulness as weapons. Perceptive Americans will think about other situations where guilt underlies policy - and hopefully act to change them.",
                "review/helpfulness": "34/54",
                "num_reviews": 54
            },
            {
                "review/text": "This book is fantasy. It uses very few sources to support crucial elements and hypothesis and boils down to a delusional opinion of a Right Wing conspiracy theorist. The author refuses to debate this material because it is far fetched and unrealistic and it should **NOT** be taken seriously. It uses eyewitnesses who were in Nanking as sources when they agree with the author; however then when those sources refute the author's opinion, they are cast out. Read this if you want to know how NOT to conduct serious historical research. The author should be labeled as a right wing fanatic and illusionist; this should be listed under \"fantasy/fiction\".",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            }
        ]
    },
    {
        "Title": "japan unbound a volatile nations quest for pride and purpose",
        "description": "Explores the cultural changes that have taken place in Japan throughout the last decade as demonstrated by various economic groups and institutions, predicting what Japan's changing world role will mean for the future.",
        "authors": "['John Nathan']",
        "infoLink": "http://books.google.com/books?id=o9VEYgEACAAJ&dq=Japan+Unbound:+A+Volatile+Nation%27s+Quest+for+Pride+and+Purpose&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "While Alex Kerr's \"Dogs and Demons\" harped on about the travails of the Japanese construction industry, John Nathan picks on a social axe to grind. Which makes for an indulging read indeed, although the supporting evidence is occasionally lacking and the inferences about the future are to the tune of \"It's unpredictable, time will tell.\"You've probably read other authors crunch economic data or political misgivings of the sushi nation, but Nathan turns his gaze to schools, novels, manga comic books, and the minds of young entrepreneurs and maverick local politicians. Is Japan's notoriously conformist society finally giving in to the longstanding recession? How is this affecting national identity?We first take up the issue of social corrosion. No surprise there, Japan is in a crisis. An incisive lens is directed at the schooling system, which is now a hotpot of truancy, felonies, alienation, angst amongst increasingly wayward kids. Sadly, parents are woefully underprepared to handle these issues, as are school authorities.Next we take the jingoistic extremism and of course, as people close to Japan may expect, the whacky governor of Tokyo Ishihara comes up, contrasted to the softer Tanaka of Nagano. A third person in the fray, the popular cartoonist Kobayashi, contends that Japan should in fact drop its US-linked past and become more self-assured. All of this makes for a very pithy discussion, but there may be little here that's new to people who follow Japanese news. To others, these essays alone alone are reason to grab the book.Now for the minor gripes. The section that highlights the growing capitalism cites the same pseudo-successful entrepreneurs to claim that Japan is becoming more entrepreneurial: Masayoshi and Oki Matsumoto (sigh, Monex!). To be fair, Japan does have a growing list of people stringing out on their own, but a recent Nikkei Weekly article did a much less sycophantic job of enumerating more convincing and down-to-earth examples.The author also gives in to sweeping statements such as his claim of America's encouragement to Japan to beef up its nuclear arsenal in order to egg China into getting involved with the North Korea issue. Where did this come from?Finally, be warned that the tone of the book in general is somewhat murky, and there is preciously little in terms of What Next, or How To Deal With It.Forgivable weaknesses? May be. For me, the book was an insightful read. At the very least, it'll equip you with interesting little tidbits for those Oh-Japan dinner conversations. In particular people who don't have the time to follow Japanese news on a regular basis will probably find this book eye-opening.A worthy purchase.",
                "review/helpfulness": "34/35",
                "num_reviews": 35
            },
            {
                "review/text": "Let me start by saying that I am a big fan of Prof. Nathan's biography of Yukio Mishima, especially Nathan's lucid prose and \"insider's\" knowledge. However, I am of two minds with his latest venture Japan Unbound.On one hand, I revel at Prof. Nathan's clarity, keen observations, and passion for his subject. (If nothing else, it is fast paced and interesting: I, a slow reader at best, read it in two sittings.)On the proverbial other hand, I have two (perhaps petty) axes to grind. First, his use of \"case studies,\" such as the \"typical\" family in Osaka, seems more geared to proving his own thesis about changing societal values than shedding any light on contemporary realities.Second, and this may indeed be a small gripe, I was both shocked and dismayed at Nathan's depiction of the bully Shintaro Ishihara (Gov. of Tokyo) as a macho, caring guy full of sensitivity for the general public (a real \"sun king\") while lambasting the hugely popular Yasuo Tanaka, a down-to-earth grassroots reformer, as effiminate and foppish and describing how (for what reason, I dunno) the tips of Tanaka's fingers shake like Tiny Tim's during times of stress. I suppose Prof. Nathan is just trying to realign the scales a bit, that is, to go against the norm (i.e., the typical American academic and media representation of Ishihara as a \"facist\" and Tanaka as a \"freedom fighter\") which is fair enough, but it struck me as yet another \"case study\" to prove a (seemingly) nonexistence point.Though it is a page-turner in its own right, I kept wondering throughout the book what exactly were Prof. Nathan's motivations for writing it: what is his point after all is said and done? Is this book meant purely as personal asides and self-promotion? (How many times do we need to read that he went to Tokyo University?) Or is it in fact a personal attempt to really understand \"his\" notion of modern Japan?As good as this book is, and as easily as it reads (and remains a fine general background for the lay reader), I cannot help that thinking that the former is true, and hence, my somewhat harsh rating. I suppose most readers will find something of value in it, though, and probably enjoy it more than I did.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "The central question that \"Japan Unbound\" explores is why the Japanese collectively are obsessed with their identity. Nathan makes an interesting point that one could argue that at the center of the individual and collective psyche is a void. He profers up some examples of different perspectives of people that he interviews -- troubled youths, tormented educators, happy families, dysfunctional families, etc. He devotes a chapter to each of the governor of Tokyo prefecture and the mayor of Nagano, both very interesting and inspiring characters in their own light, whose profiles (and the public reactions they illicit) shed a very intimate light on different and distinctive aspects of the Japanese character.That being said, the question of from where the void emerged and what might fill it is never satisfactorily explored on its own. We wanders in a rather unfocused manner from one Japanese obsession to another: American-worship, materialism and consumerism, ultra-nationalism. Answers are only hinted at through examples that Nathan uncovers through journalistic interviews. I admittedly have my own thesis which colors my review, however, which is that the void is the result of the destruction of Japan's religion at the end of WWII -- a state religion based on Emperor worship as the devine entity of the unique Japanese people. This reality should not be underestimated. The void at the center, I would argue, is a spiritual, and the spiritual hunger that longs for fulfillment has found collective expression in Japan through various attempts at \"Americanization\", excessive consumerism, extreme fad-ism, and nostalgic ultranationalism. Nathan somewhat blithely assumes the confidence that Americans have is a result of our culture of individuality. But I think that ignores the important and defining role that the judeo-christian tradition played in defining the western psyche. By missing that connection, he missed an opportunity to explore in greater depth the question that he tackles in this book.Another oddity about the book is some equally blithe comments in the epilogue about how Japan is turning away from America and towards Asia, particularly China, in its continuing search for identity. And he draws the fact that Chinese tea shops are popular as an example (even though Starbucks, he admits, is even more popular). Again, Nathan misses the irony in his assessment. China also once had a society organized around a emperor who was considered devine. The Confucian order that Japan imported from China fit dovetailed nicely with the Shinto basis of Japan's imperial-religious system because it provided a social order as an expression of the spiritual \"reality\" of the state devine organization. However, China cast off its system much earlier than Japan did (aided by the fact that the last dynasty was of foreign invaders). China, too, has gone through a similar identity crisis which continues to this day, which often manifests itself in ultranationalism as well.Thus, I would argue that the feeling of the void is the continuing expression of a sense of loss that occurred after the emperor was discovered to be mortal, which turned on its head the entire religious system which the state was based on. So Nathan may have benefited if he had explored this further, and perhaps explored the appeal (or lack thereof) of cults and alternative religions.I would recommend for the serious student to also consider reading \"Embracing Defeat.\" I found that to be one of the best books I've read about understanding Japan today, even though it only covers the immediate post-war era.A general observation: \"Japan Unbound\" is hybrid of literary criticism and journalism. That's not a bad thing though. I thought it interesting that author repeatedly draws reference back to the writer Yukio Mishima (regarding whom Nathan also wrote a biography, which I have not read). I did in fact learn a lot from this book about Japan, and I think Nathan's perspective and thoughts will benefit anyone trying to better understand Japan. In particular, he illustrates the Japanese celebration of the bittersweet beauty of impermanence quite well. Moreover, he does a good job of bringing to life the characters that he covers, and he selects them well. I would recommend this read for anyone interested in expanding their understanding of Japan, although it is far from a definitive account.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "John Nathan has written an interesting book. In a way, this book shows how academics have lost control of the debate about Japan. It's no longer necessary to be a Harvard Ph.D. (like Nathan) in order to get an insider's view of the Japanese public school system. Nathan's chapter on what he discovered at a mediocre public school on the outskirts of Tokyo will seem like yesterday's news to any young American, Canadian, Australian, etc. who has taught within the confines of the system. Nathan also writes at length about how, in the 1960s, Japanese were shocked by his fluency in their native language. But times have changed, and Japanese today are much more accustomed to non-Japanese possessing at least a degree of proficiency in their language. The book's best chapters (they all deal with different subjects, so you can skip around rather than reading straight from page one to the end) deal with Yasuo Tanaka and Shintaro Ishihara, two writers-turned-politicians. This isn't surprising, since Nathan is a literature expert. The book contains many minor factual errors, but overall it's worth reading. I found it quite balanced and objective, a good antidote to those books that claim Japan is about to sink into the Pacific Ocean.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have met many visitors to Japan who are extremely impressed with the hospitality and the politeness of the people. The society itself is also a highly advanced technologically and its people enjoy a high standard living that most enjoy. However, what Nathan does is that he takes his readers to a troubled Japan that is seldom seen by the outsiders. Nathan does his best to present the reasons why Japan is in the state it is in. Although it has one of the world's strongest economies, there is a sense of despair that many Japanese feel despite its modernity.As Nathan points out, it is a country that is still seeking to define itself in many ways, and this is clearly seen among the young adults in Japan. I believe that Nathan's views Japan's societal problems mostly stemming from a spiritual void (although he does not use this term). This void exists in Japan largely due to its defeat of the Pacific War and the Emperor renouncing his claims of deity. Nationally, during the Pacific War, the Emperor was the rallying cause for the country and there has been no cause to arise from that time.The generation that grew up after the war had a clear goal in mind which was to rebuild the country. Now that the country has been rebuilt, there appears to be no national cause to give oneself. The pursuit of most Japanese is individual prosperity and its people have adopted a materialistic philosophy that has not adequately filled that void. This is displayed in the lives of many broken families, absentee fathers, and a growing number of purposeless young people that Nathan documents in this book. Despite this though there are a few individuals in various stratas that are seeking to influence the future direction of Japan.Although many of the examples that Nathan provides are extreme, such problems and people are commonly known in Japan. It was a very perceptive and informative read, about a country that is still attempting to redefine itself amongst its own people and in the modern world at large.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Japan's history and culture is deeply rooted in its 1400 years of interaction and trade with its Asian neighbors, and especially with China during after the Tang dynasty of 618 to 907. This Asian orientation was the basis and has strongly influenced the development of Japan and contributed to the Japanese \"identity\". This Asian orientation continued until 1853 when Japan embraced both its past and while simultaneously embarked on a new path to absorb and adopted western or modern technology and culture during the so called Meiji period named after the emperor of that period. This continued until 1945 when its empire crumbled in war. With a fresh start but with its industrial infrastructure and with many government agencies and educational system still somewhat in tact after the war, it entered the second phase of its modern development becoming the world's leading financial power and creditor nation by the late 1980's. But after this financial run up the economy stalled, stocks and real estate prices fell sharply, and Japan entered a decade and half long period of economic stagnation and adjustment.That brings us to this new 250 page book. The author is a Japanese speaking Harvard educated American scholar with four decades of Japanese experience. He has lived in Japan for many years and is eminently qualified to write the book. The book is short and uses a combination of interviews, personal observations, and references to Japanese writings to provide a sense of a country in transition.He discusses the issue of the \"unique\" cultural identity, the politics, youth violence, the modern Japanese corporation in a state of flux, the family, and a number of other subjects. It is clear from the book that Japan is in the midst of another change or renewal. The people are turning again to nationalism, seeking pride in their country, and have a desire to re-establish Japan as a country respected by China and America but working more independently. In the background are lurking many social changes and a breakdown in the school systems, unemployment, changes in the family, and a dramatic increase in youth crime rates - all that are new for Japan that was previously a strongly structured and a more predictable society.This is a well written book. It manages to be both educate and entertain with many stories, insights, and humor. It brings up to date on what is happening in Japan today in 2004.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "talking to high monks in the snow an asian american odyssey",
        "description": "Winner of the 1991 PEN/Jerard Fund Award, Talking to High Monks in the Snow captures the passion and intensity of an Asian-American woman's search for cultural identity.",
        "authors": "['Lydia Yuriko Minatoya']",
        "infoLink": "http://books.google.nl/books?id=UFrhAAAAMAAJ&dq=Talking+to+High+Monks+in+the+Snow:+An+Asian+American+Odyssey&hl=&source=gbs_api",
        "categories": "['Japanese Americans']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was reading &quot;Growing Up Asian American&quot; and had it for over a year. Recently I have been wanting to hear more from other Asian Americans and so, resumed reading the excerpts authors shared. I read Ms. Minatoya's story and was disappointed that there wasn't more! So the next day I went and bought Talking to High Monks in the Snow. And I have just finished reading it. It's one of those books that I come across infrequently, the kind that I absolutely MUST get to the last page before I go to sleep. Because of school I longed for the moments when I could sit and enjoy my newfound treasure, on trains, breaks, at home. Ms. Minatoya is subtle in her writing but it sure hits you when you're through with the sentence. I felt the pangs of pain and embarassment and degradation when she did. It brought back sad memories. The great thing though is that she isn't sappy and she doesn't want my pity just because I relate to her. Ms. Minatoya is eloquently matter-of-fact. With each section of her book, I was amazed more and more. I wished I went to all the places she has been to, Boston, Japan, China, Nepal, and done the things she has. Actually, I admire her because she was and probably still is BOLD and DETERMINED. She has gone to all these countries and actually lived and worked there, not just visit as a tourist. She has taught and communicated deeply with people in these countries. Thanks to Ms. Minatoya, I have this urge to start a club at my college. A reading and discussional group for Asian Americans and non-Asians. I feel that many in my school and city do not appreciate our rich heritage as much as I wish they did. A club that will teach and show through discussions, reading, and debate, the sincere, talented, proud people such as Ms. Minatoya. Talking to High Monks in the Snow is a truly wonderful book for Asians and non-Asians alike. Before I read it for the second time...Thanks Amazon for letting me share my thoughts!Debbie Yeung",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "Traveling always brings a new dimension to yourself. This is an odyssey of a Sansei(the third generation of Japanese-American) woman, who has been wondering about who she is and where she belongs.Like Amy Tan's \"The Opposite of Fate\", she wrotes about her background (her immigrant grandparents, Nisei-Kibei parents, sister and herself) and her identity crisis.After growing up, she went on a trip to Asia (Japan, China, and Nepal) and met nice local people, and found some family secrets and her new Asian identity. Eventually, she comes to feel more comfortable to be Asian-American.I recently happened to take this book while traveling in Seattle. I'm so glad to find such an amazing book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "talking to high monks in the snow an asian american odyssey",
        "description": "Winner of the 1991 PEN/Jerard Fund Award, Talking to High Monks in the Snow captures the passion and intensity of an Asian-American woman's search for cultural identity.",
        "authors": "['Lydia Yuriko Minatoya']",
        "infoLink": "http://books.google.nl/books?id=UFrhAAAAMAAJ&dq=Talking+to+High+Monks+in+the+Snow:+An+Asian+American+Odyssey&hl=&source=gbs_api",
        "categories": "['Japanese Americans']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was reading &quot;Growing Up Asian American&quot; and had it for over a year. Recently I have been wanting to hear more from other Asian Americans and so, resumed reading the excerpts authors shared. I read Ms. Minatoya's story and was disappointed that there wasn't more! So the next day I went and bought Talking to High Monks in the Snow. And I have just finished reading it. It's one of those books that I come across infrequently, the kind that I absolutely MUST get to the last page before I go to sleep. Because of school I longed for the moments when I could sit and enjoy my newfound treasure, on trains, breaks, at home. Ms. Minatoya is subtle in her writing but it sure hits you when you're through with the sentence. I felt the pangs of pain and embarassment and degradation when she did. It brought back sad memories. The great thing though is that she isn't sappy and she doesn't want my pity just because I relate to her. Ms. Minatoya is eloquently matter-of-fact. With each section of her book, I was amazed more and more. I wished I went to all the places she has been to, Boston, Japan, China, Nepal, and done the things she has. Actually, I admire her because she was and probably still is BOLD and DETERMINED. She has gone to all these countries and actually lived and worked there, not just visit as a tourist. She has taught and communicated deeply with people in these countries. Thanks to Ms. Minatoya, I have this urge to start a club at my college. A reading and discussional group for Asian Americans and non-Asians. I feel that many in my school and city do not appreciate our rich heritage as much as I wish they did. A club that will teach and show through discussions, reading, and debate, the sincere, talented, proud people such as Ms. Minatoya. Talking to High Monks in the Snow is a truly wonderful book for Asians and non-Asians alike. Before I read it for the second time...Thanks Amazon for letting me share my thoughts!Debbie Yeung",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "Traveling always brings a new dimension to yourself. This is an odyssey of a Sansei(the third generation of Japanese-American) woman, who has been wondering about who she is and where she belongs.Like Amy Tan's \"The Opposite of Fate\", she wrotes about her background (her immigrant grandparents, Nisei-Kibei parents, sister and herself) and her identity crisis.After growing up, she went on a trip to Asia (Japan, China, and Nepal) and met nice local people, and found some family secrets and her new Asian identity. Eventually, she comes to feel more comfortable to be Asian-American.I recently happened to take this book while traveling in Seattle. I'm so glad to find such an amazing book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "parallax visions making sense of americanndasheast asian relations at the end of the century asiapacific culture politics and society",
        "description": "Collection of essays by Cumings on the complex problems of political economy and ideology, power and culture in East and Northeast Asia, providing an understanding of the United States's role in these regions and the consequences for subsequent policy mak",
        "authors": "['Bruce Cumings']",
        "infoLink": "http://books.google.com/books?id=oKfb-RZaB_EC&dq=Parallax+Visions:+Making+Sense+of+American&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The word &quot;parallax&quot; in this title is quickly explained: by changing your position the thing you are lloking at will also seem to change. In observing East Asia, there has been a tendency (at least prior to the april 2001 incident) you might think that American influence was declining as China and Japan are emerging as regional - global - powers. Cumings is not alarmed and believes that capitalist and democratic counties w111 continue to co-operate while and the move towards free trade and international will remain strong as more asian countries participate. As values are increasingly shared between Asia and America, it is misleading to stress the differences. America will remain the region's dominant power for a long time yet. The biggest threats to n Asia are misperceptions, exaggerated fears or imaginary &quot;sunspots&quot;. One not so imaginary spot is Afghanistan and Central Asia. the near future will provide an ideal testing ground for Mr. Cumings theory.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book offers a lot of new ideas, and if half of them are true then it is worth reading. But some of the ideas put forth, like for instance trying to relate the cult of Kim Il Sung in post war Korea to the Japanese cult of the emperror when Korea was a colony are a bit of a stretch. Also, the author seems to know much more about Korea, he is okay with Japan, and biased about China, and undestimating its place in the world. It is definitely worth reading but read it critically.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "chorus of mushrooms nunatak fiction",
        "description": "Celebrating cultural differences as a privilege, Chorus of Mushrooms explores the shifts and collisions of culture through the lives of three generations of women in a Japanese family living in a small town.",
        "authors": "['Hiromi Goto']",
        "infoLink": "http://books.google.com/books?id=TZ0fAQAAIAAJ&dq=Chorus+of+Mushrooms+(Nunatak+Fiction)&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "The first Novel from the Canadian-Japanese author Hiromi Goto.The novel tells the story of three generations of Japanese Canadian women lives in Canada, who seeks their special identity: the grandma who refuses to give up from her Japanese roots (and who hides salted squid in her pockets...), her daughter Kaiku who wants to be &quot;real&quot; Canadian and therefore refuses to speak Japanese, and the grandchild, Murial-Morasaki who is in a quest for her Japanese roots and who struggles to find a cultural identity somewhere between the two.This vivid life (and love) story is integrated with Japanese folk legends.I found it very warm, exquisite and honest, sometimes amusing and sometimes very mellow and sad. Great first novel and very mature.The book won the Commonwealth Writer's Prize for Best First Book.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This story of three generations of Japanese Canadian women in rural Alberta relates the immigrant experience through the conflict between three incredible women--a grandmother who will not speak English, a daughter who will not speak Japanese, and a granddaughter torn between the two extremes and struggling with her identity as a Japanese Canadian. It also deals with the characters' struggle to shape their environments and establish themselves in their not-so-new community. In their adopted country, they make new accomodations not only to the past but to each other.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is one of the best books I have ever read. The agony and joy of intergenerational struggles, intensified by immigrant worries, comes through on every page. Readers follow Murasaki's journey to know her grandmother's story through such imaginative contours. Canadian or not, anyone can identify with an adolescent's awkwardness; and everyone stands to learn from the struggle against racism that emerges on the Canadian prairies.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Chorus of Mushrooms really captures the sense of conflict that is felt by those who feel compelled to &quot;fit in&quot; to a new culture, and the effects that this can have on other members of the family. It deals brilliantly with the notion of individual and collective hi/stories, and is one of the best books I've read in a while.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a story about three generations of Japanese-Canadian \"Tonkatsu\" family. Grandma Naoe, daughter Keiko, and granddaughter Muriel-Murasaki.Obaachan(grandma) tells old Japanese folk tales to mago-daughter Murasaki, who doesn't understand her grandma's Japanese well, but gets it somehow, while Keiko refuses all the Japanese things. So they have some trouble with their communication each other. But after Naoe had set out on a sudden journey, they, each of them, gradually found their identity through the (especially Japanese) food. Some Japanese immitation sounds (such as sara-sara, zuru-zuru) are effectively used.I very much approve of Goto-san's belief; There are people who say that eating is only a superficial means of understanding of a different culture.....You haven't learned anything at all. I say that's a lie. What can be more basic than food itself ?And of course, \"Tonkatsu (guess what !)\" is yummy. :-))",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "romance of the three kingdoms chinese classics in english two volume set",
        "description": "\"A material epic with an astonishing fidelity to history.\"-New York Times Book Review Three Kingdoms tells the story of the fateful last reign of the Han dynasty (206 B.C.-A.D. 220), when the Chinese empire was divided into three warring kingdoms. Writing some twelve hundred years later, the Ming author Luo Guanzhong drew on histories, dramas, and poems portraying the crisis to fashion a sophisticated, compelling narrative that has become the Chinese national epic. This abridged edition captures the novel's intimate and unsparing view of how power is wielded, how diplomacy is conducted, and how wars are planned and fought. As important for Chinese culture as the Homeric epics have been for the West, this Ming dynasty masterpiece continues to be widely influential in China, Korea, Japan, and Vietnam and remains a great work of world literature.",
        "authors": "['Guanzhong Luo']",
        "infoLink": "http://books.google.com/books?id=KrHUDwAAQBAJ&dq=Romance+of+the+Three+Kingdoms+(Chinese+Classics+in+English,+Two+volume+set)&hl=&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I'm a girl in Korea, who loves this book, The Romance of Three kingdom. I think this book can be regarded as the 'Odyssey of far east Asia.' It's really funny, exciting and instructive. Almost every far east Asian have ever read this book. And I too read this book five times. But it's not boring at all.I hope much more people in the world can have the pleasure reading this. I like Kung-ming and Chou-Yu best out of too many heros in the book. You'll be excited to see the wisdom fighting between them.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Romance of Three Kingdoms is not just the novelized version of the history record &quot;Three Kingdoms&quot;. It overtook the heart of both Chinese and Japanese. In Japan even younger generation who rarely read literature enjoy the story in the form of either comic books or in popular PC games. In China many of the Chinese Opera comes from the part of this story.The story is based on the history of ancient China around late 2nd century to late 3rd century when the Chinese continent was divided by three strong kingdoms,Shu(Gui in Japanese),Wu(GO in Japanese) and Wei(SHOKU in Japanese).I am familiar with the version of Eiji Yoshikawa, the author of Musashi, focusing more on the story of Liu Pei(Wei emperor),Kuan Yu, Chang Fei, and Chuko Kunming. Liu Pei, an heir of Han Dynasty ruling clan, is a humane leader supported by Kuan Yu, deft both in brain and might maybe eastern version of Knight, Chang Fei,short tempered but really strong warrior, and Chuko Kunming the master of strategy.Rivaling Lie Pei is another giant Tsao Tsao outstanding ruler who nearly took hold of the whole Chinese continent but blocked by the allied forces of Wu and Wei in 208. Tsao Tsao is a bit demonized in this story but he is in fact one of the greatest rulers China ever had comparable to Napoleon. While Lie Pei who has little power gradually gains by charming a lot of talented people by his couteousness yet with propaganda tactics to demonize Tsao Tsao, Tsao Tsao took advantage of courting the Emperor and with the finest staff collected from the whole continent. Tsao Tsao's Shu finally unites the whole China after his death in 265, with the surrender of Wei but Lie Pei, Kuan Yu and Kunming are still loved and idealized by Chinese public. Wu survives by taking either rivaling sides and with excellent domestic and foreign affairs strategy.On first reading you will be enjoying the way the characters outsmart the other camps. On second reading you will be struck by the humanity upon which the story is based. It is much more than a legend. It will surely get you closer to the mind of either Chinese and Japanese. But be careful. The way character name is pronounced differ between Chinese and Japanese. Such as Tsao Tsao is pronounced in Japanese as SOSO.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "A great book to read. I do not recall another tome like this that has many elements masterfully blended that includes larger-than-life legendary characters, intricate and complicated plot that keeps you reading, and last but not least, descriptions of betrayal and strategy throughout the book. You will find yourself getting more and more engrossed with the storyline and the characters, and you will eventually come to favor one or some of the heroes. I myself favor the legendary line of Sun: Sun Jian, Sun Ce, and Sun Quan. I also have profound admiration for their young, wise, and crafty advisors: Chou Yu and Lu Xun. This is a book you will never forget.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Thre is an old Chinese saying... &quot;Do not read Romance of the Three Kingdoms when you are old&quot;. the implication is, you will already be very wise from your years, and to read this book then will make you almost superhuman. This book is one of the greatest novels ever written. It is a lesson in human relations, in war, in startegy, in emotion, in man management... it is so many things. Luo Guanzhong deveoted his entire life to writing just this one book, and his careful effort can be felt through the book's emotion. Today its characters are revered as gods and sages in much of the Chinese speaking world.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I can't finish all my compliment for this book in this short review. You are not gonna believe it is such a splendid book until you read it yourself. This book is a saga with so much wisdom and humanity. It is as good as ancient Greek epic (with all repect to Greek) if not better. The wisdom in it is uncommonly plentiful. Trojan horse looks children's game after you finished the book. Romance of three kingdoms is a part of Chinese lives and now becoming popular in the world. Many Japanese companies make this book as a must-read for management staff. Read this book and I garantee that your time will be delightfully spent.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "[San Kuo Shih Yen-I] This book has a theme that is so deep that a 1000 years after the Three Kingdoms period ended the book was written. From 189AD to about 300AD, the state of China was in turmoil. The evil Cao Cao ended up &quot;winning&quot; the battle in the end. But is evil, chaotic empire was resolved to dust. So is the way of the world. The goodness of the world's mana and underlying goodness of the human soul cannot be quenched by even the greatest, smartest chaotic evil executive. The good won the war. Even in death, the Good Heroes, Zhuge Liang, Guan Yu, Liu Pei and Zhang Fei are now religious figures. They have transcended time and have conquered so many more people with their intellect, love and morality than Cao Cao could have ever dreamed of. This is a book of biblical proportions. Enjoy it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the typhoon lover",
        "description": "A young woman with a foothold in two cultures, Rei Shimura has gone wherever fortune and her unruly passions have led her throughout her chaotic twenties. Now, after the streamers for her thirtieth birthday celebration have been taken down, the Japanese-American antiques dealer and part-time sleuth finds herself with an assignment to find and authenticate an ancient Middle Eastern pitcher that disappeared from Iraq's national museum. The piece is believed to be in the hands of a wealthy Japanese collector, whose passion for beauty extends to Rei herself. But when a devastating typhoon hits Tokyo, Rei is trapped with the object of her investigation-and with much much more than the fate of an ancient pitcher at risk.",
        "authors": "['Sujata Massey']",
        "infoLink": "https://play.google.com/store/books/details?id=QRW6-0ffgcMC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Is it possible to enjoy a mystery novel immensely and yet be sadly disappointed at the series-heroine's antics? This was the conundrum I came face to face with while reading Sujata Massey's latest Rei Shimura mystery novel, \"The Typhoon Lover,\" and discovered, rather to my surprise, that the answer was a resounding \"yes.\"When US intelligence suspect that Takeo Kayama, head of the Kayama School of Ikebana and Rei Shimura's former lover, may have bought an antique Mesopotamian ewer that was stolen during the latest gulf war, they decide to recruit Rei in order to discover how Takeo had acquired the piece. As a friend and former lover, the feeling is that Rei should be able to get the information without setting off too many alarm bells. And while Rei is not at all sure if she's cut out for this kind of cloak and dagger stuff, or even if she could persuade Takeo in take her into his confidence (much less talk to her since they did have a rather messy breakup), the lure of being able to return to Japan (Rei was deported from Japan in \"Samurai's Daughter), proves too much for her. And in no time at all, Rei finds herself back in her beloved Japan, and trying to reconnect with a newly engaged Takeo, who would much rather keep Rei at arm's length. And while Rei was prepared for the fact that it would take a lot of hard work in order to reestablish their friendship, what she was not prepared for, she discovers to her horror, was the resurgence of some of her old feelings for Takeo, or how her flashly blundering about would lead to tragedy...There were many things I liked about \"The Typhoon Lover\" -- like the fact that it took place mostly in Japan, and that it was a very well written, suspenseful, absorbing and totally riveting novel. However certain things did niggle at me: for example, I really had to suspend my disbelief in order to buy the notion that the US secret service's best bet to figuring out if Takeo was involved in buying stolen antiques was to bring Rei into the investigation. Surely must have been a better plan out there somewhere? I like the character, Rei Shimura, but her method of operation has always been to stumble about, rather flashily, until she arrives at the truth. Subtlety and discretion have never really been her strong points. And this was the woman that US intelligence thought perfect for this particular job? I also found that I was not really enjoying this new direction that the author was taking Rei in -- esp in regards to her relationship with Hugh (her on-and-off again boyfriend), after having gone through so much with Hugh, I was disappointed that Rei felt stifled by her relationship with him, and how she handled things here. But in spite of my growing frustration with Rei, I found that I simply had to read on in order to discover what would happen next. And this, in my opinion, was the real testament to Sujata Massey's brilliant writing skills -- that she had me absolutely riveted in spite of myself. Also brilliantly done, was how the authored portrayed the tense atmosphere as everyone was hunkering down to deal with the typhoon -- I really felt the cold, wet danger of it all. And as always, I enjoyed the author's portrayals of the current trends in Japan; and in this instance, Rei's feelings of confusion at realising that she may no longer fit in with the youth culture.In all, \"The Typhoon Lover\" was a very enjoyable read. In spite of my complaints, at the heart of things, this series has not changed. Rei is still the flawed but stalwart character, who still passionately throws herself into whatever task she's doing. She may stumble about with two left feet, angering people and setting off alarm bells everywhere, but she's always determined to do the right thing and see justice done. That's the Rei Shimura that's won fans everywhere and the Rei Shimura that will always be at the heart of this series, in spite of whatever direction the author takes her heroine in.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Japanese-American amateur sleuth Rei Shimura finds herself in the midst of more than one tempest when she is asked to investigate the theft of an ancient ibex ewer. Rei, an antiques dealer, is contacted by a U.S. government agent and asked to help with this very sensitive inquiry. Rei is uniquely qualified for this task because her Japanese ex-lover is one of the prime suspects in the theft. The problem is that she is a persona non grata in Japan because of a previous transgression in that country. Through the powers of diplomacy, her visa is restored. She accepts the opportunity to return to her ancestral home with some misgivings, but the opportunities are too good to pass up.Once in Japan, she re-unites with family and friends while working on her assigned task, only to find that things are never quite as you remember them. As the investigation intensifies, so does the weather. Rei fights bad guys, a typhoon and her conscience while searching for the stolen ibex.Set in Washington D. C. and Japan, this novel manages to blend and contrast the flavors of both cultures very nicely. As Rei travels through both locales, she explores her feelings about her Asian-American lineage as she doesn't quite wholly fit into either place.While I was reading this book, the remnants of hurricane Cindy were lashing against my window, adding a bit of atmospheric realism to the typhoon scenes in the book. I am also a native Washingtonian and enjoyed a virtual stroll through the downtown streets with Rei.This was one of the most entertaining books that I have read in a while. I completely relaxed while reading it and soaked up the gentle atmosphere. Sujata Massey has a created a complex, enduring character in Rei Shimura. I look forward to reading more books by this author.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The Japanese Desk of the State Department official Michael Hendricks hires Japanese-American antiques dealer Rei Shimura to find and authenticate a Mesopotamian age pitcher that vanished from Baghdad's National Museum. The Feds believe that Japanese collector Takeo Kayama possesses the valuable vessel and is running an international antiques smuggling ring. Once she hears his name, Rei realizes why they want her skills to investigate as Takeo is her former boyfriend.Rei travels to Japan, but starts her inquiries with her Aunt Norie, a teacher at Takeo's flower arranging school. She learns that Takeo is getting married soon to Erni, which shakes her a bit as she just turned dirty thirty and wonders what she could have done different though the government tossed her out of the country. When a typhoon hits Japan, Rei uses it as a cover to investigate Takeo's summerhouse though she also finds time to sleep with her former lover even as the case takes a bizarre spin towards Erni.The investigation takes a back seat to the intriguing comparisons between the older traditional and younger colorful Japanese generations. For instance readers will enjoy westernized Rei with her conventional Aunt. The inquiry is deftly handled albeit secondary to the deep look into customs, but the apparent spin into Rei Shimura, CIA agent seems odd at least for now. Fans of this great mystery series will anxiously wait the next installment to see if the renegade antiques dealer actually makes the switch to I Spy.Harriet Klausner",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This eighth entry in the wonderful Rei Shimura series is definitely one of the very best, if not THE best. To this reader's delight (and I suspect to other fans' delight as well), our heroine is back in Japan at last, and up to her American/Japanese neck in trouble.The reason her visa has been reinstated (by the State Department, no less) combines with the reason for her visit: She has been sent on a top-secret errand to locate a priceless pottery ibex that has been stolen from an Iraqi museum, embarrassing both the Japanese and the American governments. Because Rei is known as an antiques expert of some modest repute, she is deemed able to snoop around without calling attention to herself. Yeah, right! This is REI we're talking about. And worse, she cannot tell her live-in lover, Hugh, why she is going without him.As the plot thickens, we are drawn into all the cultural and intricate differences between America and Japan, and in Rei's own warring psyche, between her American and Japanese sides. The pace never slows, and the denoument is both satisfying and very sad.I cannot recommend this book highly enough. To those seasoned readers like myself, grab it. To those who have never read anything in this series, this is a great place to start!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "As always, Massey does a wonderful job of weaving in cultural details to her mystery story and when I finished Typhoon Lover I found myself eager to read the next book in the series because I love Massey's writing style and the world she shares through this series and didn't want my time in Rei's world to be over. That said, I didn't like the development of Rei and Hugh in this book--among other things, Rei is supposed to be 30 years old and her interpersonal instincts with Hugh can be so incredibly lacking, especially for a woman astute enough to navigate international sleuthing and the nuances of a second culture; moreover, she is often so insightful and astute in reading people. But so it goes. Still, Massey's novels are rich reads and this book had me riveted, albeit frustrated at times.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Rei Shimura, banned from Japan after breaking and entering a few books ago, gets offered a reprieve. She'll get her visa back if she agrees to help a government agency (the CIA? we're never sure) find a vase that's been associated with her former lover, Takeo, now a wealthy director of a famous flower-arranging school.We also get to spend time with Rei, a most enjoyable heroine. In fact a subplot of the book relates to Rei's up-and-down relationship with Hugh, her Scottish boyfriend and sometime fianc&eacute;. The opening scene actually telegraphs warnings about differences in values and Rei's readiness for more adventure.As other reviews have noted, the whole plot hinges on an questionable assumption. Would a staid government agency recruit an impetuous, untrained amateur? Not likely, but I believe government agencies have recruited \"sources\" who deliver information to get criminal charges dropped or reduced. Rei had a powerful reason to cooperate, although she lost a lot and almost lost everything.Unlike many writers of mystery series, Massey has resisted the temptation to create stand-alone volumes or start a new series. Instead, we get to know Rei better and we watch her grow in logical but sometimes surprising ways. Few other series characters are developed in such psychological depth; perhaps the closest is Nevada Barr's Anna Pigeon. I wasn't at all surprised at her reaction to being back in Japan: it's very common among those who feel exiled.And Massey knows how to pace, create atmosphere and maintain suspense. I never was tempted to skip her descriptions of setting, much less peek ahead to the ending.Just one quibble. I realize \"big\" publishers no longer have minions to perform copy-editing chores, so in a few places we had grammatical and other bloopers. On page 39, for instance, a paragraph begins, \"I scrambled into my Asics\" and ends, \"I gave up on finding shoes and went out in my slippers, throwing a raincoat over my pajamas.\"Which was it? And was she really wearing pajamas to sleep with Hugh? That's a clue if I ever saw one.But I'll take the quibbles along with the good stuff. Great book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "salaryman in japan japan in your pocket series no 8",
        "description": "In Japan, the figure of the suited, white-collar office worker or business executive 'salaryman' (or, sarariiman), came to be associated with Japan's economic transformation following World War Two. The ubiquitous salaryman came to signify both Japanese masculinity, and Japanese corporate culture, and in this sense, the salaryman embodied 'the archetypal citizen'. This book uses the figure of the salaryman to explore masculinity in Japan by examining the salaryman as a gendered construct. Whilst there is a considerable body of literature on Japanese corporate culture and a growing acknowledgement of the role of gender, until now the focus has been almost exclusively on women in the workplace. In contrast, this book is one of the first to focus on the men within Japanese corporate culture through a gendered lens. Not only does this add to the emerging literature on masculinity in Japan, but given the important role Japanese corporate culture has played in Japan's emergence as an industrial power, Romit Dasgupta's research offers a new way of looking both at Japanese business culture, and more generally at important changes in Japanese society in recent years. Based on intensive interviews carried out with young male private sector employees in Japan, this book makes an important contribution to the study of masculinity and Japanese corporate culture, in addition to providing an insight into Japanese culture more generally. As such it will be of great interest to students and scholars of Japanese studies, Japanese society and gender studies.",
        "authors": "['Romit Dasgupta']",
        "infoLink": "http://books.google.com/books?id=gWE2PhdiJGoC&dq=Salaryman+in+Japan+(Japan+in+Your+Pocket+Series)+(No.+8)&hl=&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "The book is criminally humorous as it describes the life, times, trials and tribulations of the 1980s Salaryman. The book is still in print in Japan, though it's relevance to today is diminishing.On the very surface it is a sympathetic appeal to what the salaryman has to put up with. Like many things Japanese, it is an onion, and a level beneath it really pokes fun at the salarymen. One more level and you get a lesson on what it's like to be a businessman in Japan.High wisdom? No. But it's still worth a read for any Japanophile.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "A Japanese friend gave me this book, and I couldn't put it down. I learned how to present and receive a business card, what a karaoke bar is like (you'll be surprised), and what a salaryman's day is like. I found the most interesting parts to be how the mixed feelings about the role of women were reflected. In one part, women were criticized for wanting to stay in the workplace rather than marry. In another part, women were criticized for spending their days shopping, not having meals ready when their husbands come home, and having affairs. If you are planning a trip to Japan, this book will give you some insight into what the Japanese feel is important for Westerners to know.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "thirty seconds over tokyo",
        "description": "From the Publisher: Ted W. Lawson's classic Thirty Seconds Over Tokyo appears in an enhanced reprint edition for the sixtieth anniversary of the legendary Doolittle Raid on Japan. \"One of the worst feelings about that time,\" Ted W. Lawson writes, \"was that there was no tangible enemy. It was like being slugged with a single punch in a dark room, and having no way of knowing where to slug back.\" He added, \"And, too, there was a helpless, filled-up, want-to-do-something feeling that [the Japanese] weren't coming -- that we'd have to go all the way over there to punch back and get even.\" Which is what \"the Tokyo Raiders\" did. Lawson gives a vivid eyewitness account of the unorthodox assignment that eighty-five intrepid volunteer airmen under the command of celebrated flier James H. Doolittle executed in April 1942. The plan called for sixteen B-25 twin-engine medium bombers of the Army Air Forces to take off from the aircraft carrier Hornet, bomb industrial targets in Japan, and land at airfields in China. While the raid came off flawlessly, completely surprising the enemy, bad weather, darkness, and a shortage of fuel caused by an early departure took a heavy toll on the raiders. For many, the escape from China proved a greater ordeal. This anniversary edition features a foreword by noted aviation writer Peter B. Mersky and an introduction by Mrs. Ellen R. Lawson, Ted Lawson's widow, as well as twice as many photographs as the original book, several published here for the first time.",
        "authors": "['Ted W. Lawson']",
        "infoLink": "http://books.google.com/books?id=G7kSgP-QI0UC&dq=Thirty+Seconds+Over+Tokyo&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Having read &quot;Four who came Home&quot;, a story written from the prespective of Doolittle Raiders who were captured, I decided to read this famous title of a movie. I once again was not disappointed. This book goes into more detail of the training and the schedule the pilots kept prior to the raid. It also goes into depth about the trip to Japan and the great job the Navy did in their support role.But the highlight of the book is the raid and exactly what they saw during the raid. This is followed by a harrowing crash and month in China staying one step ahead of the Japanese. This part of the story shows the value of the Chinese people who helped even though it put their life in danger. Did I mention hardship? Imagine having your leg amputated in a field hospital with little medical equipment.These men are truly valiant heroes and it's great to read their stories of valor.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "This is one of the best books I have ever read and should be a must read for all history students. In addition to the historical importance of the Doolittle Raid, this book brings the reader a personal narrative of the event. If you are a fan of aviation or WWII history, then this is book is for you. I enjoyed it so much that I read it cover-to-cover, back-to-back! I haven't done that with a book in a long time.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "To me the most interesting part of WWII was the battle for the Pacific Ocean. I had read many books about the Battle of Midway and Iwo Jima. They all told you about the war and the battles. The book Thirty Seconds over Tokyo tells you not only of the battles, but also the months of preperation for the surprise riad on Japan, it told you about the long month afterward in which the Chinese helped them recover and hide them from the Japanese. It tells of the crash landing on the Chinese coast and the horrible nights that followed, not knowing if they were going to turned over to the enemy or not. The book Thirty Seconds Over Tokyo is a great read for anyone who likes WWII becuase it not only tells of the battles, it gives the account of the emotional expenses a group of people were forced to go through. I liked this book and I hope you will too.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book is divided in three parts: before, during, and after the Doolittle raid on Tokyo. The first part provides the barest of autobiography, focusing mostly on how the pilots chosen for the mission prepared. This is very interesting, and the best part of the book.The middle part is by far the briefest. I don't think you could stretch a single bombing run out any longer than a few pages, and Lawson doesn't try. He could have talked to more of the other crews and recounted their own individual experiences, though he does a little of that already. It would have been interesting, then, if he'd talked for a while about how the public in the US responded to the raid.The third part, after the raid, is frustrating. Lawson was seriously injured in a crash landing, unconscious for a while, and feverish or sedated for days afterwards. As a result, he doesn't remember much. Here too it would have been better to talk to other people, such as his crewmates (who were in much better shape). Then he could have reported what happened, instead of how confused he was about what was happening.Lawson writes in 1940s GI style. The prose is simple and direct, spiced with mild cussing. It's a quick, exciting read, and the writing style would be appropriate for middle-school readers - if you don't mind the cussing.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a kid, I was not a big reader but the first time I read this story I could imagine what it must have been like to be in a B-25 over Japan. This is truly an inspiring WWII read.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a junior high school student and avaition/WWII buff, 33yrs ago, this was just the kind of book for me. I used this book for numberous book reports through out my school career. I recommend this book for all young people to read and remind them what their grandparents went through to help keep this country free of tyrannny I will always remember, April 18,1942, the &quot;Ruptured Duck&quot; and &quot;Thirty Seconds Over Tokyo&quot;.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "None of us can fully understand what took place during the Doolittle raid. We weren't there, but Captain Ted Lawson was. He explains what took place and what events led up to it, including all the emotions and turmoil surrounding it. I used this book as research for my own historical novel and found it to be immensely useful.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Ted Lawson's account of the first bombing of Japan by American forces in World War II is a seat of your pants ride from cover to cover! This book is a firsthand account of the trials of an American hero. Ted Lawson leads his B-25 crew on its bombing mission, only to meet with danger and possible capture by the Japanese forces who hunted them. A great book and a fantastic account of the successful raid on Japan by Jimmy Doolittle's Raiders!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "The term \"hero\" seems to be much overused in the media today. You put on a uniform, and you are automatically a hero. Here is a thrilling story about a group of genuine heroes. It is April, 1942. In the four months since the Japanese attack on Pearl Harbor, the United States has suffered a series of stunning defeats and lost many of its Pacific bases. To counter the seeming invincibility of Japan, Lieutenant Colonel James Doolittle leads sixteen, twin-engine B-25 bombers from the deck of an aircraft carrier to bomb targets in Japan. They cause consternation in Japan, but a longer flight than planned and bad weather cause the bombers to crash in China. Some flyers are captured and executed by the Japanese, some are killed, and many are injured. Their escape from capture by the Japanese is an epic of courage and amazing help by Chinese peasants. The story is as thrilling today as it was when first published in 1943, and it is well worth reading.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read this book when I was in grade school. It was a great book. Recently I saw a reprint of this book in the supermarket, so I decided to read it again. What a great story! Mr. Lawson, since deceased, spelled out how he began his flying career and how he got involved in the mission. His flying experience over Tokyo (amounting to thirty seconds) was a small factor in this book. What really makes the story are the heroic Chinese who saved Lawson and his crew from the Japanese. In the crash itself, Lawson injured his arm, leg, and head. The resulting infection of his leg resulted in amputation. His travels in his injured state were the main focus of most of the second half of the book.This is such a great read. Not only is the author a humble, patriotic man but his story details those who made his escape possible. A great read for anybody.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "gods dust a modern asian journey",
        "description": "The author relates his impressions of his travels through Burma, Thailand, the Philippines, Malaysia, Singapore, Taiwan, Korea and Japan",
        "authors": "['Ian Buruma']",
        "infoLink": "http://books.google.com/books?id=SaOpQgAACAAJ&dq=God%27s+Dust:+A+Modern+Asian+Journey&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Ian Buruma's lively writing style, familiar to readers of the New York Review of Books and the Far Eastern Economic Review, comes to the fore in this wonderful look at a variety of Asian countries. He manages to isolate scenes and trends that characterize the tension between the traditional and the modern in several Asian nations (or indeed nations in formation). The non-Asian writer on Asia is at times less forgiving, and at others brings a fresh view, but always provides insights that few other books or writers seem to produce. God's Dust lets the seasoned Asia dweller feel that she is developing her own unique perspective on life in Asia, and at the same time gives those who have never experienced Asia's intricacies and contradictions an opportunity to experience more than a travelogue or a soon-to-be-proven-wrong business trends bestseller would deliver.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "In a few pages, Ian Buruma sketches the essential characteristics, problems, myths and `soul' of 8 Asian countries.Burma still hangs in the iron fist of a military dictatorship. This potential rich country is strangulated by national socialism. Its population survives through a black market, `a tapeworm eating its way through a bankrupt economy'.Thailand sticks together by three crucial elements: `Nation, Religion and Monarch'. Being a country of `hedonism without guilt', it never lost its self-respect.The Philippines, as a nation, is still struggling with its colonial past (Spain and the US) and with its oligarchies, of which the strongest one is the Catholic Church. `As long as the US bases are here, we cannot become a modern country'.Malaysia's main problem is the chasm between the Village (which belongs to the Malays) and the City (dominated by the Chinese). The political class tries to cement a common national identity through religion (Islam).Singapore is a Big Brother state. Its government fears chaos and an attack on its independence.Taiwan is still dominated by the struggle between the early- and the late- comers from the mainland, and between the lowlanders and the mountain people. It has a fundamental identity problem: `How can a modern Chinese state identify itself with Chinese civilization when it is not China?'Korea has a precarious geographical situation. Its rulers have always been using outside powers to fight opponents at home. The legitimacy of the Korean nation is thwarted by the North/South division.The mythical pristine Japanese identity (idealized in the Village) based on benevolent imperial will, social harmony and communion with nature is lost in modern commercialism. Jingoism is used in order to forge a new concrete for the nation.This book is a must read for all Asian scholars and all those interested in Asian affairs.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "nisei daughter",
        "description": "Tells the story of a Japanese-American woman growing up in Seattle in the 1930s who was subjected to relocation during World War II",
        "authors": "['Monica Itoi Sone']",
        "infoLink": "http://books.google.com/books?id=kIjY38NMOnEC&dq=Nisei+daughter&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Part of Nisei Daughter's charm is the way Sone is able to weave entertaining anecdotes throughout her tale, a story which is essentially about what being Japanese American in the time around wartime America meant to her. Specifically, her position as a Nisei daughter -- child of first generation Japanese Americans -- is the focus of this tale.The disappointing thing about this book is how obviously self-censored the book is. Sone very briefly reveals deeply felt rage and resentment at intervals during the book, only to shake them off and quickly change to a more light-hearted topic. Granted, there is an ironic tone to many of her comments and situations, and again granted, she is writing for a post-war audience that probably would not be receptive to outspoken criticism of the Internment, but still Sone seems to sugar coat the experience just a bit too much for my tastes. By the end, with the patriotic speeches that make it sound like the Internment was as much the fault of the Japanese Americans as it was the government, I was getting a little tired of Sone's carefree and apologetic tone, especially after the highly charged preface. In the book, Sone all but thanks the government for interning her and her family and giving them this character-building experience.If you are truly interested in the internment and the impact it had on the Japanese Americans, try a book like Joy Kogawa's &quot;Obasan.&quot; It's written about the Japanese Canadian experience, which was even more extreme than the Japanese American one. Kogawa also experienced internment first hand, but &quot;Obasan&quot; is written far enough after the fact that Kogawa is able to give the story more perspective and is able to put a more honest face on what really happened.Nisei Daughter is not a bad book by any means ... but it did not live up to my expectations either. Sone's self-conscious editing makes the story seem much more like a novel than the autobiography that it supposedly is. I kept wishing she would drop the mask she was wearing and let the reader see what she was really thinking!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Both my wife and I thoroughly enjoyed reading this wonderful story about growing up in America as a 2nd generation Japanese-American. It is an important book to read so that we can better appreciate how fortunate folks are in the USA, and the importance of continued acceptance of other cultures and future citizens of the USA.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is the story told by a daughter of Japanese immigrants growing up in pre-World War II Seattle. She was in college when Pearl Harbor struck.I think the best parts of this memoir deal with the description of Japanese culture and the conflict between the Americanism of the Nisei and their Issei parents most of whom heavily maintained Japanese customs. Perhaps the funniest part of the latter in the book takes place during the wedding reception held for her brother Henry and his bride in their camp in Idaho during the war.I'd have to say that the best written, the most vivid part of the books is the family trip to visit relatives in Japan where her little brother Kenji fatally contracted dysentery. I'm guessing that this trip must have taken place around 1929.The author gets released from camp mid-way through the war to go live with some former missionaries in Chicago who are very nice. She works for a dentist who is, however, a real pain in the butt and she eventually quits.She then gets the opportunity to go attend Wendell college in Indiana where she lives with a nice old widow and she says that this college was full of alot of diverse foreign students. She made many close friends. During her post-camp period, her faith in American democracy was largely restored because she met so many nice white Americans who weren't racist louts. The book ends on a sort of patriotic note which I can't follow completely. In Chicago she was often mistaken for Chinese and people told her how much they respected the Chinese people, America's ally and she was sometimes mistaken for various Chinese celebrities.It's obvious, that the author, who at the time of this 1979 edition, was still a clinical psychologist, knows how to write. She is a very gifted descriptive writer, though sometimes she lays it on too heavy. She tells her life story with a great deal of sentimentality; at times I think she pours it on a little too sweetly. But heck it's her story and she crafts it very well.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Nisei Daughter is a one woman's account of what it was like for her to grow up in Seattle being a second-generation Japanese girl. Her story provides a glipse of historical Seattle, the struggle between 1st and 2nd generation Japanese Americans, what it's like to be a girl in Japanese-American families, and how Japanese/Japanese Americans were treated during WWII. (Her family was sent to an internment camp). Very moving, I read this book in college as part of a WA state history class but it was so touching that I plan to reread it for pleasure.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a real Japanese daughter in Tokyo of Today, I very much enjoyed Ms. Sone's narrative. This is a story about prewar Seattle and the life of Japanese-Americans, as well as her identity struggle during the war time.With the eyes of an observant Nisei girl, Ms. Sone tells us about people around her, and school life, both local and Japanese, in a positive (somewhat humorous, sometimes sappy..) way.This is amazing. No one told me such an interesting story like this. Travel guide books only show us lovely views or baseball stadiums. Japanese school textbooks NEVER mention Japanese-American history and heritage. What a waste. We could share their feelings...I could have been a Nikkei(JA) daughter if my great-grand parents had emmigrated to the West Coast. (Actually, they once lived in Manchuria instead.)Since I found this book, I also have searched my heart and wondered where I had come from... It's so stimulating.ARIGATO, KAZUKO-san ! Seattle does not only mean Ichiro Suzuki.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very nice memoir about being a first-generation Japanese American (\"Nisei\"). My biggest criticism is that the flow is not quite right. I attribute that to the fact that the author is not a writer by trade. The very extensive details that pepper the story detract to the overall flow of it, but nonetheless, this book is very interesting. Monica Sone explores the dichotomy that many \"hybrid\" people experience: the contradictions of culture, the generational gap made even deeper because of the cultural differences. In her case, these differences were quite extreme: from the demurred and modest Japanese ways to the boisterous, assertive American. She describes many examples of where these differences were patent, and does a very god job in the process. Another excellent area of the book is her analysis of the conflicting emotions she experienced. Here she is, feeling very American, and sent to a concentration camp, labeled as \"the enemy\". She and her fellow camp-mates experience a collective rage, but it is during these years and after her release that she finally comes to terms with her at times contradictory cultural heritage. The end has very patriotic overtones which I thought were quite sappy, given her circumstances. I wish she could have gone further into describing her family life after camp, and the reassimilation of Japanese into American society post WWII.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very nostalgic and many mutual experiences and shared neighborhoods. Keep me turning pages until I finished. Well done!!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Nesei daughter is quite an intriguing narrative based on an autobiography of a Japanese-American woman who lived in Seattle during the 1920's and 1930's.The author presents an illuminating account of the complexities surrounding being a US citizen of Japanese descent and how this affected them after the outbreak of World War II when they had to be evacuated from Seattle, isolated and kept in concentration camps without trial.The book is useful for understanding issues of identity, racism, social justice, citizenship and gender. It is an invaluable tool for understanding the history of orientals within the US and can serve as memoir for them.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "forgotten armies the fall of british asia 19411945",
        "description": "In the early stages of the Second World War, the vast crescent of British-ruled territories stretching from India to Singapore appeared as a massive Allied asset. It provided scores of soldiers and great quantities of raw materials and helped present a seemingly impregnable global defense against the Axis. Yet, within a few weeks in 1941-42, a Japanese invasion had destroyed all this, sweeping suddenly and decisively through south and southeast Asia to the Indian frontier, and provoking the extraordinary revolutionary struggles which would mark the beginning of the end of British dominion in the East and the rise of today's Asian world. More than a military history, this gripping account of groundbreaking battles and guerrilla campaigns creates a panoramic view of British Asia as it was ravaged by warfare, nationalist insurgency, disease, and famine. It breathes life into the armies of soldiers, civilians, laborers, businessmen, comfort women, doctors, and nurses who confronted the daily brutalities of a combat zone which extended from metropolitan cities to remote jungles, from tropical plantations to the Himalayas. Drawing upon a vast range of Indian, Burmese, Chinese, and Malay as well as British, American, and Japanese voices, the authors make vivid one of the central dramas of the twentieth century: the birth of modern south and southeast Asia and the death of British rule.",
        "authors": "['Christopher Alan Bayly', 'Timothy Norman Harper', 'Senior Lecturer in History Fellow Tim Harper']",
        "infoLink": "http://books.google.com/books?id=qXH9xGCWjYUC&dq=Forgotten+Armies:+The+Fall+of+British+Asia,+1941-1945&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "This is an excellent book,from the standpoint of the authors doing a comprehensive job of detailing the history of the Japanese occupation of British Southeast Asia in WWII. The authors limit their narrative to the area of the \"crescent\" running from northeastern India down south to Singapore. This was a neglected theatre of the war in history, and the interplay of the Japanese conquest, the legacy of British colonialism, and the power plays of the various nationalistic and communist elements in the area are laid out with great detail. However, the emphasis is less on the actual battles and military manuvers of the allied and axis forces, with the greater detail being laid on the effects of the Japanese occupation on the economy, nationalistic attitudes, and political fortunes of the civilian populace. This is definitely a work of history, and it doesn't necessarily read like a novel, unlike some other historical works from the same era. If you are a student of WWII history and want expansion on the Pacific theatre that you weren't aware of before, then you will enjoy this. If you are a more military-minded reader of history and want to read about detailed battles and campaigns, then you will probably want to look at other books instead. Having said all of that, from an academic standpoint this is an important work on a neglected area of WWII history, which explains in great detail why this area of the world is what it is today.",
                "review/helpfulness": "76/82",
                "num_reviews": 82
            },
            {
                "review/text": "Few events in the twentieth century did as much to shape the world in which we live than the fall of the British Empire. Every corner of the globe bears some stamp of its once-mighty presence, yet only now are we beginning to understand its true impact and legacy. In this book, Christopher Bayly and Tim Harper focus on British rule in southern Asia - India, Burma, Malaya, and Singapore - during the Second World War, showing not just how that conflict accelerated the collapse of their empire in the region but how it set the parameters of the subsequent course it took in history.The authors chart this progress from events immediately prior to the Japanese invasions of 1941-2, depicting a region at the crossroads of change. On the surface, British rule continued in the routines of rule that had existed for decades, with colonists engaged in their intricate social rituals at the top of a racially stratified society. Yet beneath these placid assumptions, a growing nationalism was beginning to erode the sureties of the British presence. Bayly and Harper's coverage of this is one of the many strengths of the book, as they describe the numerous racial groups and the complicated politics of their interactions with impressive breadth and confidence.Japan sought to exploit this nationalist sentiment by posturing as liberators seeking to create an \"Asia for the Asians.\" Yet the success of their conquest was due more to British weakness than the success of any Japanese appeal. Stunned by the rapidity of the Japanese advance, British forces collapsed in a matter of weeks, irreparably damaging the imperial prestige upon which much of their rule rested. Racial attitudes only exacerbated tensions, as white colonials often \"pulled rank\" in their eagerness to escape the Japanese onslaught. The memory of this would color relations in the region for years after the war.Though the Japanese advanced as far as northern Burma, overstretched supply lines and the annual monsoons brought an end to their offensive in the region. Yet with their forces shattered and their resources strained, initially the British could do little to dislodge them. Here the authors turn their attention to the suffering brought about by war, particularly a devastating famine in India, the result of wartime disruption, a devastating cyclone, and British misgovernment. With tensions high and many leaders of the Indian National Congress in prison, the Japanese tried to take advantage of the situation by sponsoring an Indian independence movement under the leadership of Subhas Chandra Bose. Yet this effort, like those in Burma and Malaya, soon fell victim to the brutality and abuse of Japanese rule, which alienated the native populations and fueled resistance throughout the region.With the failure of their U-Go offensive in the spring of 1944, the end of Japanese rule was increasingly apparent to the peoples of the region. Yet even as the British prepared to reassert imperial rule, their former subjects were positioning themselves for independence. Here the authors illustrate both how much the experience of war had changed the region and how blind the British were to these changes. For all of the insincerity of Japanese motivations, the rhetoric of independence and the creation of local military forces had fanned nationalist hopes and accelerated what ultimately became an irreversible end to the British Empire in Asia.Bayly and Harper have provided an excellent history of the war in southeastern Asia and its role in decolonization. The breadth of their coverage is impressive, particularly in their examination of Asian perspectives towards both British and Japanese rule - something all too often absent in histories of the conflict. Though the narrative often suffers from stilted writing, the insightful analysis the authors offer more than compensates for the lack of polish in the prose. In fact, the abrupt termination of their account with the end of the fighting left me hoping for a follow-up volume that tracks these developments to their eventual conclusion - independence and the creation of a new Asia.",
                "review/helpfulness": "59/60",
                "num_reviews": 60
            },
            {
                "review/text": "Imagine British Asia on the eve of World War Two. Singapore, Burma, India. The Japanest struck swiftly and desicively, capturing Singapore in record time and sinking two of Englands greatest warships. The war as it developed in the jungles of Southeast Asia employed many fascinating characters and peoples. The Japanest claimed they were creating a 'co-prosperity' sphere where Asians would work together towards the common future. However the truth of the matter is more complicated. Despite the Japanese claim that imperialism was 'racist' the Japanese turned out to be as imperialistic and as condescending as Europeans had been, as they stripped countries of natural resources to feed their ambitions.The British employed many Indian troops and other native troops to stem the Japanese tied. Recovering from the loss of Singapore, the defeats of the Dutch in Indonesia and the threat to both India and Australia the English waged an unending guerilla war in Burma, made famous not only by 'Bridge on the river Kwai' but also by the Chindits and Orde Wingates irregulars.This is an excellent panorama, employing whit, history and stories of the characters and cultures bisected by the war. Most of all we are given a snapshot of Asia in a time of change. The war changed everything, it brought ambitions to colonized peoples, and created the circumstances of Vietnam.Seth J. Frantzman",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "The Japanese rampage in the Pacific and the initial defeat of both the American and British forces in the region heralded the eventual death knell for all Empires involved in the Pacific war. The military political part of this story has been told many times. The cut and thrust of combat is not what this book is intended to do -- it rather covers those peoples and groups, whose absolute numbers were large, but whose history is often not factored into the momentous events in the region at this time.The Overseas Chinese and their suppport for China made them an obvious target for the Japanese, their suffering (massacres) and response -- from quiet resistance to active and robust guerilla efforts in Malaya -- are something often left out of normal narratives on Malaya, which usually end after the fall of Singapore. How did the Malays, indigenous Indians, and Chinese react to the Japanese triumphs? How did events play them off against each other?Ethnic Indians in Burma largely made up the civil service and trade industries before the war, they were mostly driven out by the Burmese who exacted a terrible toll for percieved injustice of this class foisted on them by the British. Their bones lined the escape routes out of Burma -- victims of Burmese pogroms. It is therefore ironic that Indian soldiers captured during the initial onslaught would forswear their alleigence to the King for one to the Emperor -- on the promise for eventual Indian independence. It is this devil's bargain that the authors detail very well: the training, demise, renewal, deployment and utter destruction of the Indian National Army. Ironically again, this Japanese-trained army was defeated by an overwhelmingly Indian denominated and increasing Indian-led army at the end of WWII. Indians gained their freedom not by fighting against the British, but precisely by fighting under and alongside the British. With the might of India unleashed by the British, Indian officers commanding white troops, it became apparent that even in allied triumph, the days of the Raj were limited.Britain destroyed more Japanese landforces than the entire American island-hopping campaign. Indeed these battles were the largest in Asia and the political machinations underlying the movement and supply of great armies are of a degree that it is difficult to understand. Allied cooperation in Europe looks absolutely lovie-dovie compared with the acidic and vain personalities of this theatre: the bigotted but absolutely incorrigible Stillwell, the vain and effete Mountbatten, the absolutely-bonkers Wingate, not to mention the strange warlord like Chinese generals -- laws unto themselves.The Japanese are another forgotten army. Their complete annihilation by military campaign and starvation, relegated them to the political sidelines in almost all countries. For the politicians the Japanese were defeated, what would follow -- every plan or strategem, even from early in the war seemed to be aimed at, as Churchill said \"holding our own\" -- ie, maintaining empire. All efforts that did not back that were to be discouraged, and the Americans were to be the either witting or unwitting supporters of such a strategy. This of course ran the British into trouble with both the Americans, who had other ideas, and the local independence movements. In all countries with the winds of war blowing against the Japanese, independence movements initially made alliances with the British based upon shifting needs. As the Japanese dissapeared as a threat full independence was really the only choice, Britain, huffing and puffing -- but it should be admitted, not largely shooting -- was preparing for the historical inevitable.Bayly also admirably describes Empire just before the war. The almost surreal sense of superiority the locals felt, how they sipped their Gin and Collins confident that everything would and should continue even when Europe was falling apart. Both colonial and indegenious race consciousness is described. One of the most tragic forgotten armies, the story of the Eurasians who also made up the civil service of Malaya and Singapore, being accepted by no one but relied upon by everyone. Eurasian women were seen as taboo and strictly off limits to any self-respecting white who wanted to go further and be accepted in polite society. Chinese knew they were superior to Malays and Burmese Indians got it in the neck because Burmese felt they had had it too good in a land that was not theirs.It does seem very strange indeed that our grandfathers and fathers were sometimes raised in this cultural environment that transitioned so swiftly into the post-war world of modern understanding and cultural acceptance of today. It is this consciousness of the age that Bayly reflects so well in his writing.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "untangling my chopsticks a culinary sojourn in kyoto",
        "description": "Two years out of college and with a degree from Le Cordon Bleu in Paris, Victoria Riccardi left a boyfriend, a rent-controlled New York City apartment, and a plum job in advertising to move to Kyoto to study kaiseki, the exquisitely refined form of cooking that accompanies the formal Japanese tea ceremony. She arrived in Kyoto, a city she had dreamed about but never seen, with two bags, an open-ended plane ticket, and the ability to speak only sushi-bar Japanese. She left a year later, having learned the language, the art of kaiseki, and what was truly important to her. Through special introductions and personal favors, Victoria was able to attend one of Kyoto's most prestigious tea schools, where this ago-old Japanese art has been preserved for generations and where she was taken under the wing of an American expatriate who became her mentor in the highly choreographed rituals of this extraordinary culinary discipline. During her year in Kyoto, Victoria explored the mysterious and rarefied world of tea kaiseki, living a life inaccessible to most foreigners. She also discovered the beguiling realm of modern-day Japanese food-the restaurants, specialty shops, and supermarkets. She participated in many fast-disappearing culinary customs, including making mochi (chewy rice cakes) by hand, a beloved family ritual barely surviving in a mechanized age. She celebrated the annual cleansing rites of New Year's, donning an elaborate kimono and obi for a thirty-four-course extravaganza. She includes twenty-five recipes for favorite dishes she encountered, such as Chicken and Egg Rice Bowl, Japanese Beef and Vegetable Hotpot, and Green-Tea Cooked Salmon Over Rice. Untangling My Chopsticks is a sumptuous journey into the tastes, traditions, and exotic undercurrents of Japan. It is also a coming-of-age tale steeped in history and ancient customs, a thoughtful meditation on life, love, and learning in another land.",
        "authors": "['Victoria Abbott Riccardi']",
        "infoLink": "https://play.google.com/store/books/details?id=iEkTIdCgcCkC&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Wow! I loved Untangling My Chopsticks. It is a delicious book from beginning to end. Victoria Abbott Riccardi's beautiful writing style made me feel like I was a part of her journey, discovering the foreign culture, customs and lifestyle of Japan. Through her detailed descriptions she gives the reader a very true sense of the people, the food and the natural beauty of the country. I loved learning about tea kaiseki and the foods that revolve around it. I craved Japanese food as I read the book and was thrilled to discover that each chapter ends with delectable recipes that are quite simple to prepare.This book has everything I love to read about from travel, to cooking, to history, to love (yes, it is a bit of a love story!). In summary, it is a fantastic book that captures the reader's attention through wisdom, humor and beauty.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "and after you do read it, you'll need to find a Japanese grocer in your city, because you'll be inspired to hunt all over for soba sauce and azuki bean paste.What a delight this book is! It veritably sparkles like diamonds and rubies, and in fact she compares tea kaiseki with jewels.I borrowed a copy from a friend to read, but now I'm inspired to buy my own copy so I can re-savor it and also contribute to Victoria's royalties. She deserves so much for this splendid book.Her insights into the spirituality of food, even simple things like wrapping packages carefully like the Japanese do, make it a book that you can apply to your daily life, even if you never attend a tea ceremony.My *ONLY* gripe, and I really hate to say this, is that her connection with Zen Buddhism was tenuous. She does go to Mount Hiei toward the end of the book and tries to sit with the monks, but she spends a lot more time talking about recipes again. But really that's okay because her main emphasis is not to meditate until satori, but to appreciate the food connection.I can't think of anyone who would not fall in love with this book! Thank you, Bi-cu-to-ri-ha! (That's Japanese for her name, as heard from the lips of children.)",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Three culinary trends today include drinking green tea, dining on meals composed of many small dishes, and exploring exotic gastronomic customs. I just read a book that brings those three together beautifully. It's called Untangling My Chopsticks, A Culinary Sojourn in Kyoto, by Victoria Riccardi.Trained in Western culinary tradition and a veteran of a Parisian restaurant kitchen, Riccardi was on the classic culinary track. Until an employee of the Japan Society in New York mentioned kaiseki to her, that is. Victoria's trip to Japan to learn about kaiseki changed her life as her Cordon Bleu training never would.Kaiseki, I learned, is an elegant, ritualistic cuisine, a degustation of small, seasonal dishes, which developed in Zen monasteries to accompany the traditional Japanese tea ceremony. From page one Riccardi plunged me into exotic Kyoto, the acknowledged birthplace of kaiseki, with tales of her new home dubbed the \"bedroom of eels,\" and her first meal, in a neon-yellow-splashed restaurant under the Kyoto train station. Her story unveils Japanese culture, taste, and tradition in prose that sparkles like the morning sun on a breeze-rippled pond.Before Untangling my Chopsticks, my knowledge of Japanese food culture could be summed up in a paragraph, the one dubbed \"sushi etiquette\" sometimes printed on the back of American sushi menus. The story of Victoria's sojourn was like a gift to me: lush with details of friendships forged, life-changing lessons learned, and deeply symbolic, ritual-imbued meals cooked and eaten. It opened my mind.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I loved this book. I've never been to Japan, but Victoria Abbott Riccardi's keen eye for detail and luminous imagery lured me into Japanese culture, ritual and customs quite unexpectedly. She led the reader with her to a new place, so different from the West, where every gesture has meaning, often more subtle than the Western mind can comprehend. I traveled with her through the back streets of Kyoto, saw the fruit trees in bloom, met the friends she met, worked with and lived with, and shared her cooking. The book almost becomes an etiquette manual, so detailed is it on how non-Japanese must behave to be accepted. Riccardi explains the mysteries of the tea ceremony and her particular experience with tea kaiseki which precedes tea so clearly that the reader is almost a participant in the ritual. I particularly loved Riccardi's analogies that explained things Japanese by comparisons to what Americans can understand. For example, she likens an octopus to a rubber bathtub mat with its suction cups! The recipes at the end of each chapter beg to be tried and happily the ingredients can be found in the United States. With an overlay of humility, humor and empathy the author takes the reader on a delightful journey of understanding, of maturation, soul-searching and personal peace. I recommend this book to those interested in food, the subtle and often unfathomable culture of Japan, and to anyone who wants to enjoy the vicarious adventure of a curious, energetic and open-minded American woman in Japan.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Untangling My Chopsticks is a book you want to pick up by just looking a the beautiful cover. And then the inside, just like a great piece of sushi, is wonderful. Riccardi's humor, candor and lush descriptions make this one of the best books I have read in a long time. She weaves the history of the tea ceremony with her personal stories of a year in Japan. Her descriptions of food will leave you mouth watering and her humor make you chuckle out loud. A great book to read and share with your friends. I'm going to use the great recipes to make a Japanese dinner for my bookgroup, so we can taste while we talk about the book!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I so enjoyed reliving Victoria Abbott Riccardi's year sojourn in Kyoto. I cannot wait to go to an authentic tea ceremony next time I am in Japan (my friends in Tokyo told me it must be in Kyoto). The Japanese do everything beautifully but until I read Untangling My Chopsticks I was not really aware of how much thought and detail go into the visual and tactile presentation of food. The texture of the food, of the dish, the color, the shape, the season, the spiritual message. A book worth writing and reading.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "All those with a real passion for Japanese food and culture (are these two concepts really separate?) will fall in love with this book. It's not yet another cooking book about Japan and its food, but the lively account of the year the author spent in Kyoto to learn 'tea kaiseki'. The author takes you there, and she makes you feel as if you were sharing the real experience with her. It is amazing to be able to read about the subtle nuances of Japanese cuisine, as they are experienced through the eyes, senses and culture of a curious, intelligent Western person. I couldn't recommend this more.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Victoria Abbott Riccardi's wonderful book, Untangling My Chopsticks, is a treat to read. She shares her tale of the year she spent in Kyoto, Japan, immersed in Japanese culture and studying the art of kaiseki. The story is tied together neatly and offers an immense amount of information on Japanese culture and cuisine as well as tea ceremonies. Her descriptions are so vivid and precise that I found myself salivating over the food. Having lived in Asia myself, I laughed out loud at some of the predicaments/cultural differences she comes across and so deftly describes.I will definately suggest that my bookgroup read this book and know that we will make some of the delicious-sounding recipes for our dinner meeting. Her recipes, both Asian and Western, do not seem daunting as in some travel/food journals. I highly recommend Untangling My Chopsticks to anyone who loves Asia and/or food.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "inventing japan 18531964 modern library chronicles",
        "description": "In a single short book as elegant as it is wise, Ian Buruma makes sense of the most fateful span of Japan's history, the period that saw as dramatic a transformation as any country has ever known. In the course of little more than a hundred years from the day Commodore Matthew Perry arrived in his black ships, this insular, preindustrial realm mutated into an expansive military dictatorship that essentially supplanted the British, French, Dutch, and American empires in Asia before plunging to utter ruin, eventually emerging under American tutelage as a pseudo-Western-style democracy and economic dynamo. What explains the seismic changes that thrust this small island nation so violently onto the world stage? In part, Ian Buruma argues, the story is one of a newly united nation that felt it must play catch-up to the established Western powers, just as Germany and Italy did, a process that involved, in addition to outward colonial expansion, internal cultural consolidation and the manufacturing of a shared heritage. But Japan has always been both particularly open to the importation of good ideas and particularly prickly about keeping their influence quarantined, a bipolar disorder that would have dramatic consequences and that continues to this day. If one book is to be read in order to understand why the Japanese seem so impossibly strange to many Americans, Inventing Japan is surely it.",
        "authors": "['Ian Buruma']",
        "infoLink": "http://books.google.com/books?id=Su-OV8UEyvwC&dq=Inventing+Japan,+1853-1964+(Modern+Library+Chronicles)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "This book is totally typical for Ian Buruma, a man who cannot read Japanese comic books without seeing ghosts of militarism (\"Japanese Mirror\" 1980) and who has defended British colonialism in his columns for The Guardian.You will find yourself nodding in agreement thoughout the book if you already believe that Japan is intrinsically an evil society populated by people who are a hair trigger away from commiting war atrocities if a gun is handed to them. I cannot imagine what kind of an unhappy childhood he had spent in Japan.This is an entertaining entry level book which is balanced on the surface. But he paints a century of Japanese history as if it was structurally destined to march into militarism. He neglects to mention that Turkey, Ethiopia, Thailand, Nepal and Japan were the only \"colored\" nations to remain independant until Pearl Harbor. Nor is there any reference to how close Japan was to becoming another opium infested European colony. He downplays that Japan's military build up was driven by fear of being colonized.Like so many historians of the \"Evil Japan\" school, he misses the fascinating story of how Japan's initially defensive military transformed into a fearsome expansionistic force. Analysis of this development is crucial to keeping such things from happening again. But for Buruma, it was destined to be expansionist to begin with. Japan was always evil. Although Buruma rightfully criticizes Japan's colonialist past, he does not waste the opportunity to infer, ever so subtly, that Western colonialism was somehow more humane and civilized than Eastern colonialism.Like all Japan demonizers, he attributes Japan's current ills, both real and imagined, to the fact that Emperor Hirohito was not executed after the Second World War. This bit of scapegoating is as worn out as the Kennedy Assasination. There was supposedly a dark conspiracy that involved Gen. MacArthur and some unnamed Japanese figures (always unnamed) that reached a closed-doors deal to save the Emperor. Like the unknown conspirators of the Kennedy Assasination, these shadowy figures are supposed to be lurking in the back corridors of Japanese power to this day. If they were power brokers in MacArthur's time, they must be quite marvelously venerable by now.He concludes his book with the predictable alarmist dogma that Japan could become a militaristic nation one more time and threaten the Western world if it does not \"confront its past\". Apparently, 6 trillion yen in \"aid\" paid to China as unofficial and voluntary war reparations and some more to other nations - all with the consent of Japanese voters - does not count as confronting its past. Once again, there is no mention that Britain never apologized to Zimbabwe either. If his moralizing were to be applied fairly, every country that mistreated its colonies up to about the 1940s (a time when colored people - whether they lived in colonies or not - were lynched to death for such offences as voting) need to \"confront their pasts\" in ways that meet the standards Buruma sets for Japan. Nations that do not, by Buruma's reasoning, are a militaristic threat to the civilized world.Shortly after the First Gulf War, Japanese professor Shiro Takahashi asked some 300 college students if they would fight for their country if Japan was ruthlessly invaded as was Kuwait. Only one answered that he would. All others answered that they would either surrender or run. This was the fruit of fifty years of pacifist education. Buruma turns around and calls this an \"infantile dependence\" on American military strength (which it may be), but I wonder how this reality fits into Buruma's picture of a dangerous nation that could plunge into militarism again. He does not seem to see the contradiction.Another problem, which is all too common among so many Western specialists, is that Buruma presents Japan as a monolithic entity instead of a diverse and chaotic democracy. Japanese prime ministers may visit the Yasukuni Shrine, but none of them, so far as I can remember, have ever enjoyed the widespread popularity or support of, say, George W. Bush. Some Arab extremists have presented a monotone grasp of \"America\" as a monolithic evil entity without any regard for the existance of numerous people like Noam Chomsky. Buruma presents (and has presented throughout his career) the same monotone view of Japan, as if no Japanese has ever protested against official visits to the Yasukuni Shrine. (This is ironic since Buruma, along with Herbert Bix, John Dower and many others, has basically lifted his ideas from the writings of all the \"Chomskies\" of Japan - while pretending that they did not exist) Just as the policies of president Bush is not the whole picture of America, the actions of much less popular Japanese politicians do not make up the whole of Japan. Academic writers are supposed to make people see that.As long as professional hate mongers like Buruma can pass as experts on Japan, it is prudent that Japan remains in \"infantile dependence\" and avoid building its own defence capabilities. Who is to say that Japan will not follow the fate of Iraq and be attacked for suspicions of developing \"militarist tendancies\"?It takes a detached reader to see how books like this are part of the cause of Japan's curious state in the world. Buruma along with Herbert Bix, David Bergamini, Iris Chang, Ivan P. Hall et al compose one view of Japan, but have you ever seen a book from the opposing camp? (A healthy diversity can be seen in the books about other nations. Buruma himself is a defender of Britain's colonialism even though he is critical of Japan's.) The overwhelming tidalwave of Japanophobia disguised as academic tretise shapes opinions on Japan around the world, and consequently shapes Japan. This book is worth reading only as an example of such a force.",
                "review/helpfulness": "145/202",
                "num_reviews": 202
            },
            {
                "review/text": "In contrast to Dr. Noguchi, I think Mr. Buruma has, again, shone some well-needed light into those recesses of Japan's past many here would rather forget.His ability to weave the cultural, intellectual, and political threads of Japan's modern history into a lucid text is nonpareil, particularly in such a brief work.Rather than bemoan the recent revelatory books by Blix, Dower &amp; Co., Dr. Noguchi might be wiser to re-think the reasons behind Japan's unprecedented brutality from the Marco Polo Bridge in China to Sugar Loaf Hill in Okinawa.And maybe he might also note that Mr. Buruma's formative years in Japan were adult ones.",
                "review/helpfulness": "26/37",
                "num_reviews": 37
            },
            {
                "review/text": "Buruma sets out with the ambitious task of summarising a century of Japanese history - and a turbulent century at that - in less than 150 pages. Covering the Meiji restoration, the militarism of the 1930s, war, defeat and reconstruction could (and for many authors has) take volumes, but Buruma manages his challenge extremely well.This is not necessarily a book for a Japan expert - in so short a work, necessarily the discussion about the topics raised is fairly cursory. Even major issues like the involvement of the Showa emperor in pursuing the war are necessarily brief - though Buruma's opinion does come through fairly strongly on this topic. Facts are not comprehensively sourced, either - pitched as a &quot;general reader&quot; on Japanese history, Buruma clearly did not want the flow of the story to be interrupted. However, there is a good appendix on suggested further reading. Buruma also has a talent for highlighting key facts in a new context, and in doing so triggering a response from even the more experienced reader.&quot;Inventing Japan&quot; makes a good job of dispelling the &quot;uniqueness&quot; myths that surround the country (promoted by both Japan's supporters and protagonists). Japan is, of course, unique - in the same way that France or Serbia is unique. It is not, as the militarists of the 1930s would have us believe, unique in a divine sense. This is something modern day nationalists and anti-Japan protectionists on the two sides of the Pacific could do well to reflect on. Perry did not &quot;open up&quot; an entirely isolated community, but instead visited a country that was already cognoscent with affairs in Europe and America. The Shinto rituals of the 1930s were not (all) hallowed traditions stretching back through the millennia, but were at least in part created to fit the purposes of the government of the day.Overall Buruma gives an excellent pr&eacute;cis of the development of Japan in a concise and well-written manner. This is a superb introduction for a general reader, but it is not something that the more informed reader should overlook.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "The Modern Library Chronicles series has struck again and have come up with another winner. Ian Buruma's Inventing Japan (1853 - 1964) is a valuable edition to this marvelous series. The author uses the short format effectively and efficiently as he demonstrates Japan's growing and changing sense of self since violently being pulled out of isolation in the middle of the nineteenth century. He even provides a brief look at the history of Japan before this moment to show that it was not as isolated or as ignorant of the West as the myths would have one believe. This book is wonderful at dispelling any illusions of the Japanese as a monolithic people but, instead, shows the many intellectual, cultural and political threads being woven throughout its history, often at the same time. It was a fascinating read that was over much too soon.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "It's difficult enough to write a comprehensive and readable modern history of a large nation-state like Japan, but it's a far more onerous task to attempt to do so in less than 200 pages. Ian Buruma's 177-page book manages to do so with an excellence rarely found in volumes three or four times the size.\"Inventing Japan\" traces the history of Japan from the landing of Commodore Perry's black ships in 1853 to the 1964 Olympics, a time when Buruma claims Japan \"rejoined the world\". Buruma's writing is graceful and vivid. Despite covering over a century of history, his short book never feels attenuated. He knows what to focus on and, more importantly for a book of this length, what to leave out.Buruma stirs up some hard feelings among Japan's partisans -- including some here! -- by writing very directly about what he perceives as modern Japan's negative national traits. These include an obsession with national standing, fanaticism, overconfidence and (ironically, considering the alleged overconfidence) an inferiority complex. Balanced against these, Buruma says, is a grace in defeat and an ability to rebound quickly after disaster.I enjoyed Buruma's directness. He doesn't soft-pedal Japan's crimes. But he also doesn't dwell on them. This book could only have been written by someone with a profound interest in Japan and its people. Buruma ends on a hopeful note, saying he looks forward to the day Japan does not need black ships to break out of the destructive patterns it finds itself in.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Since Mathew Perry's Black Ships reached Japan and broke its self imposed exclusion from the world, the Japanese Experience has been extraordinary. Alone among the non Western nations it has mastered Western science, technology, and economic prowess, and had earned a place among the major world powers in the pre WW2 world. Then it has joined in with Hitler and Mussolini as part of the Axis power, unleashing a gruesome campaign against its weaker Asian neighbors and a suicidal one against the United States. Following its defeat, Japan reemerged as a pacifist democracy and an economic and cultural world leader.Ian Buruma's fascinating little book about the century between Perry's arrival and the 1964 Tokyo Olympics, has to cover a lot of ground in 160 pages (he has about 1.5 pages per year). His book is necessarily frustrating in its gloss of important aspects, but he nonetheless supplies a useful account of Japan's political history throughout the period (and, surprisingly, quite a lot about Japanese culture as well, particularly the Cinema).It seems redundant to summarize the political developments in Japan; Suffice to say that, rather then a confrontation between traditionalists and modernists; Buruma sees a conflict between modernists of the Liberal and illiberal kind. The latter, drawing upon the German model, transformed Shinto into a state religion celebrating a divine emperor, created a highly militaristic state, and led Japan into a series of Military adventures, from the Sino-Japanese war of 1895, through the war with Russia in 1905, the 'Manchurian incident' in 1931, and finally to Pearl Harbor.Following Japan's inevitable defeat, The American occupation force purged the hardliner military leaders, but maintained Emperor Hirohito (Buruma is inconclusive as to the level of his culpability in Japan's militarism). It created a new Constitution (dedicated to Pacifism), and partially, but not entirely, reshaped Japan's political culture. After some turbulence, the conservative Liberal-Democratic Party settled to rule Japan fairly effectively, partially betraying and partially fulfilling the Liberal hopes from the Post War era.As interesting as Japan's political history has been, the extraordinary question of Japanese history is economic: How did Japan manage to twice rise from great disadvantages to a position as a world leader? How did Japan, alone among all non Western nations, manage to Industrialize as early as the 19th century, and how come it is today a leading member in the still almost exclusively Western club of developed countries?Buruma hardly addressed these questions, and as such his ability to explain the history of Japan suffers greatly. As interesting as the political and ideological history is, that's not where the story of Modern Japan truly is; Japan's triumph, and current difficulties are hardly addressed, and Buruma mostly sees the enrichment of post war Japan as a distraction, \"Opium to the Masses\", so to speak, allowing the conservatives to shrink from fuller Liberalization of Japan (pp. 166-167).The best insight Buruma offers to Japan's extraordinary success is in the Prologue, describing the Judo contest in the 1964 Olympics. The Japanese expected their smallish Judo champion, Kaminaga Akio to defeat his six foot six Dutch opponent, Anton Geesink. Such a victory would have signaled the \"superiority of Japanese culture, of the Japanese spirit\". (p.6)But in the end, Geesink won. The Dutchman defeated the Japanese: \"Once again, Japanese manhood had put to the test against superior Western manhood, and once again it was found wanting\". But the humiliation subsided when Geesink showed the proper respect by bowing the traditional bow. \"Geesink... would be treated as a hero in Japan forever after... One quality has stood out to serve Japan better than any other: the grace to make the best of defeat\".I think Buruma has hit upon a major element in Japan's success. Unlike many other traditional societies, Japanese were able to accept the victories of the West and to profit from them; I think people around the world have much to benefit by reflecting upon the Japanese capacity of Embracing Defeat.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "Surprisingly, I find myself basically agreeing with the Japanese reviewer named Hitoshi Noguchi. There's no need to buy this book; you can read it in a bookstore in one afternoon. Buruma writes well, but most of what he has written here has been written before by himself and others. There are a few factual errors (for example, Eisaku Sato was awarded the Nobel Peace Prize in 1974, not 1972) that give me the impression Buruma didn't put too much effort into completing this thin volume. A far cry from being a profound book about modern Japan.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "For those not inclined to read Marius Jansen's well-nigh definitive 800-page masterwork &quot;The Making of Modern Japan,&quot; this very readable short book gives the neophyte an excellent overview of modern Japanese history. Buruma does as good a job as can be done in such a slim volume (a few trivial factual errors aside).",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This introduction to modern Japanese history -- from Com. Perry's 1853 naval mission to the 1964 Olympics -- is perfectly fine as just that, an introduction for those who have neither the time nor inclination to read an in-depth 500-800 page work. Of course, as is to be expected from such a gloss, the author skims lightly across major topics, and without the context of further reading or background knowledge, it's difficult for the average reader to know what to make of Buruma's interpretations, emphases, and omissions.Certainly the span of time is well chosen, although as the book is clear to point out, the arrival of Perry's \"black ships\" to force Japan to trade with the U.S. was hardly the first significant contact with the West. For quite some time, Japan had contacts with the Netherlands, and a segment of Japanese intelligentsia pursued \"Dutch learning.\" Still, it's a good starting point, as the American arrival heralded the end of the feudal era and the start of the Meiji Restoration. Aside from little snippets here and there (a section on 1920s Japan made me curious to read more about the era), much of the early part of the book revolves around Japan's military muscle-flexing.The 1904-05 Russo-Japanese War, which Buruma describes as a brutal dress rehearsal for World War I, starts the century off on an ominous note, as the Japanese taste of victory against a European power sparks delusions of grandeur. These delusions mount as the century moves forward, taking the form of expeditions into Manchuria and China (Rape of Nanking anyone?), and finally the attack on Pearl Harbor. Japanese militarism is portrayed as an outgrowth of a strange blend of overconfidence, inferiority complex, and sentiments of racial and national superiority. Such sweeping generalization of national character are bound to raise some readers' hackles, but to Buruma's credit, he doesn't dance around them.Less familiar than Japan's military adventurism is the overview of the U.S. occupation and influence in the postwar years, and the crafting of a new constitution by low-level American bureaucrats. Another relatively less well-known area Burma sketches is the postwar Japanese domestic scene. This comes across as a relatively cozy balance of power between politicians and bureaucrats, with plenty of corruption to go around. One comes out of it with the dispiriting sense that Japan's democracy is a rather hollow one, mired in entrenched interests and overly dependent on the U.S. The narrative ends with the staging of the 1964 Olympics, an event that marks Japan's complete reassimiliation into the world community.Ultimately, this appears to be a reasonable overview, perhaps best suited as one of several texts in an undergraduate course on Japanese history. Without some other guidance or supplementary reading, it's simply too full of interpretation to take at face value. Fortunately, Buruma does provide an excellent bibliography for those interested in further reading.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the chrysanthemum and the sword",
        "description": "\"One of the best books ever about Japanese society . . . [A] thoughtful, nuanced study of the Japanese character.\"-U.S. News & World Report \"A classic book because of its intellectual and stylistic lucidity . . . Benedict was a writer of great humanity and generosity of spirit.\"-from the foreword by Ian Buruma Essential reading for anyone interested in Japanese culture, this unsurpassed masterwork opens an intriguing window on Japan. The World War II-era study by the cultural anthropologist Ruth Benedict paints an illuminating contrast between the people of Japan and those of the United States. The Chrysanthemum and the Sword is a revealing look at how and why our societies differ, making it the perfect introduction to Japanese history and customs. \"A classic of Japanese cultural studies . . . With considerable sensitivity, she managed both to stress the differences in Japanese society of which American policy makers needed to be aware and to debunk the stereotype of the Japanese as hopelessly rigid and incapable of change.\"-The New York Times \"An absorbing account of Japanese culture . . . almost novel-like readability.\"-The Journal of Abnormal and Social Psychology",
        "authors": "['Ruth Benedict']",
        "infoLink": "https://play.google.com/store/books/details?id=16_qDwAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Anthropologist Ruth Benedict was asked by the US government to research and compile information about Japan in order to understand the enemy they were fighting and the country they would soon be occupying. She did this surprisingly well considering that she had never set foot in Japan! Instead she conducted her research by interviewing Japanese who were living in the US during WWII and by gathering as much information on Japan as she could find. Having lived in Japan for ten years myself I found her observations to be accurate but also a bit outdated considering that we are now in the 21st century and Japan has become the second largest economy (not military). But Ruth did predict that Japan would refocus it's efforts and become a strong country again. The only criticism that I have personally is that Ruth had a very positive and understandably objective view of Japanese society, a society that I find somewhat childish, ignorant, and racist. But obviously one cannot completely understand a society until they have lived in that society for a while and learned the language so that they can get under the surface. I recommend this book for anyone interested in the origins of Japanese culture. As one reviewer remarked, the US should have done this kind of research before invading Iraq so they could have seen the mess they were getting into. One line from the book that I totally agreed with is that Americans tend to think that deep down inside people around the world are all the same but we are not all the same. Unfortunately (or fortunately) this is very true.",
                "review/helpfulness": "25/34",
                "num_reviews": 34
            },
            {
                "review/text": "I am an oriental who is familiar with Chinese, Japanese, and Korean culture. This really hits the nail. Many people may say that this book is outdated - not so. The fundamental cultural undercurrent of Japan still remains as the book describes. In my opinion, this book holds key to understand motivation and reason in why Japanese do and say things that would be hard to understand by Occidental standard. Also for Chinese and Korean, the idea of 'repaying debt,' and 'duty' may not be specific as Japan and may not have strong vengeful element, but still is very much tied in with idea of filial piety creating more similar result to that of Japanese then that of the first world Western culture in terms of what is proper conduct, who to respect, how to show or not show respect, and saving the face (although some Chinese and Korean may claim that they much are different from Japanese in many respect. I would say by all means it is not identical, but similar from western standard). I have seen many westerners study Zen and Japanese tea ceremony to understand Japanese culture - this will not do. This way will never quite bring genuine understanding of Japanese because they will still be considered as a foreigner thus exception to regular application of Japanese hierarchal rule.Many readers say that this book is not creditable because Ruth Benedict had not lived in Japan. That is irrelevant. This book cuts through craps and shows you the core of Japanese cultural mechanism.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "In 1944, the Allies landed in Normandy, forcing the German army to fight on two fronts; on the Pacific the counteroffensive against Japan gave the Americans one victory after another. The war was almost finished and the new world order was only a matter of time.The losers, Germany and Japan, not only had to be punished, but these nations needed to be revived and given a fresh start.In this political situation, the American government decided to get advice not only from the military and politicians, but also from the anthropologists - in an attempt to understand foreign, now subordinate, societies. The Japanese culture, so alien and distant from the American one, which is firmly rooted in Europe, was analyzed by Ruth Benedict, an anthropologist from Columbia University. The goal was to learn of the strengths and weaknesses of the Japanese in order to assume the best strategy towards the end and after the WWII.Benedict writes with rare objectivity, describing Japanese traditions and customs, the habits, which are obvious in Japan, but weird, extreme or unheard of for an average Western person. She describes the situations, when the Japanese expect politeness and respect, and when they cannot count on any; when they feel shame, confusion and embarrassment; what they demand from their family, friends, co-workers and themselves. She discusses their roots, symbols and ideas on which the society is based (this is not a book about religion or art, so they are only mentioned when necessary).The fact, that Benedict had never set foot in Japan, was nothing special - it was believed that it is possible for an anthropologist to use means other than personal experience in their work. She interviewed the Japanese immigrants and expatriates, and used written texts - books, newspapers and letters, to recreate the picture of the Japanese society and familiarize the Americans with the Japanese life attitude - to the certain extent. She succeeded in presenting the Japanese as people different, but equally civilized and developed to the Americans, and despite her objectivity she managed to sneak in some personal attitude - for example, although she mentions the defeat of Japan and American victory, she does not mention the nuclear attacks on Hiroshima and Nagasaki, which she did not approve of. Interestingly, she compares the Japanese to teh Americans, which, to non-American reader, is also a good insight into the life of the average American in the 1940s.\"The Chrysanthemum and the Sword\" remains the staple for those interested in Japan. It still gives the basis of the knowledge of the Japanese and provides a starting point. Of course, there is no mention (how could there be?) of the economic boom and the technological revolution, of karoshi and sararimen (but how to understand the latter two without any knowledge of bushido and samurai culture?). But nearly every new book, which describes these phenomena, mentions Benedict's work.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "Any westerner who's ever been to Japan may have felt at one moment or another that he or she has landed, not only in a different country, but in quite a different planet. If you're taking a trip to Japan, the cultural tips you find in a quick reference tourist guide might suffice for travel, but if you're planning to live in Japan or study any particular topic of its culture, you'll definitely have to dig way deeper.\"The Chrysantemum And The Sword\" is a classic text of Cultural Anthropology written around the end of WWII, and althought its author, Ruth Benedict, wrote it whithout ever setting foot in Japan, it's remarkable how far she went to understand the underlaying values of a culture like this, at times fascinating, and at times shocking. It was written in 1946, but it's still a book some people in Japanese universities suggest as a reference to understand some key aspects of this amazing culture. I'd also say this book is a must-read for anyone interested in humanity in the middle of war.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Certain chapters in Ruth Benedict's book are easier to read than others. In some chapters, her writing style is terse, heavy, prone to constructions that reek of a style common 50 years ago that no one uses anymore. This occasionally made it difficult getting to the useful information.Other chapters read in a much lighter, easier to digest fashion. The chapters on obligation (\"on\") and child rearing were very interesting and easy to read. These were also probably the chapters I found most enlightening for understanding the Japanese character.I recently began working for a Japanese firm and became very interested in understanding more about the unique Japanese character, and how I could communicate best with my co-workers and perhaps understand them better when they said certain things or acted in certain ways. In this respect, this book has been invaluable, especially when dealing with individuals born from 1940-1970.This book has helped me understand why the Japanese say or do certain things that seem superfluous or hypocritical to an American. Also, this book has opened me to having true cultural understanding (not \"tolerance\" which is not the same thing, but truly understanding the roots of culturally distinct behavior and psychology) for the Japanese.Recommended for anyone working with or living with the Japanese.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "nisei the quiet americans",
        "description": "Hailed at the time of its publication in 1969, Bill Hosokawa's Nisei remains an inspiring account of the original Japanese immigrants and their role in the development of the West. Hosokawa recounts the ordeals faced by the immigrant generation and their American-born offspring, the Nisei; the ill-advised government decisions that led to their uprooting during World War II; how they withstood harsh camp life; and their courageous efforts to prove their loyalty to the United States. As Hosokawa additionally demonstrates, since World War II, Japanese Americans have achieved exceptional social, economic, and political progress. Their efforts led to apologies by four U.S. presidents for wartime injustices and redress through the landmark Civil Liberties Act of 1988. Brought up-to-date in this newly revised edition, Nisei details the transformation of these \"quiet Americans\" from despised security risks to respected citizens.",
        "authors": "['Bill Hosokawa']",
        "infoLink": "http://books.google.com/books?id=toN2AAAAMAAJ&dq=Nisei:+The+Quiet+Americans.&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Most Americans are familiar with the history of oppression in our nation only as it was taught in school. While we know quite a bit about overt prejudice against blacks and Native Americans, and maybe against organized labor and our particular ancestors, we know little about other ethnic groups. Completed when Nixon was president, &quot;Nisei&quot; was an attempt to bring to our attention the struggle and ultimate triumph of Japanese-Americans. The book was a huge undertaking, and the author, a newspaper journalist and editor, takes pains to present an unbiased look at the history of his people in the context of the America in which they lived. Ironically, my one complaint about the book is that it is too even-handed. Mr. Hosokawa often went to great lengths to present the viewpoints of government officials who formulated policies that discriminated against Issei and Nisei, especially those decisions made in the wake of Pearl Harbor. The book was written in the style of most history books at the time, and it can be a dry read. Still, the book is a critical resource for anyone researching Japanese-American history.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Nisei: The Quiet Americans is a great book on the internment period of the Japanese Americans in World War II. It tells of the history of the Japanese coming to America, the development of the Japanese during the years before the war, and it vividly describes life in the internment barracks. I especially liked this book because it gave a comprehensive guide to the history of the Japanese Americans. Nisei: The Quiet Americans is an excellent addition to any history buff's bookshelf!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "In Wisconsin, in the fall of 2007, I saw a news release that Bill Hosokawa had died. I was intrigued that his death was national news. He was an admired editor at The Denver Post, back when I lived in Denver. The news release said that Bill Hosokawa had writen Nisei: The Quiet Americans. I ordered a used copy of the book, though Amazon.Nisei is a very interesting book. It gives the history of the very early and early arrival of the Japanese in the USA. After the Chinese Exclusion Act, the Japanese were still eligible to come to the USA, notably to do farm labor.The Issei were first-generation Japanese-Americans, few speaking English, none allowed to obtain citizenship. The Nisei were their children, most not speaking fluent Japanese, citizens of the US by soil of birth. The average Nisei was in his or her late teens when WWII broke out.The Japanese in Hawaii and on the mainland had been under surveillance before the onset of the war, by the Special Defense Unit of the Department of Justice. Three categories of danger, A, B, or C, had been established. \"Leaders of organizations with strong Japanese ties were automatically given an \"A\" classification; in the event of war all \"A\" Issei would be picked up immediately.\"The internment of West-coast Japanese-Americans proved to have been unnecessary. Attorney General Biddle \"eventualy admitted that his men had been making searches without warrants in pursuit of fifth columnists, but they encountered 'no Japanese saboteurs...and no illegal radio transmitter was found at all.'\" He said \"We have not uncovered through these searches any dangerous persons that we could not otherwise know about.\"But, the internment of West-Coast Japanese did occur. The book tells of the internment process and details the experience of the Japanese in the camps.Poetry heading two chapters tells part of the story:Snow upon the rooftopSnow upon the coalWinter in Wyoming-Winter in My SoulAgainst the New Year skyBeyond the fence fluttersThe Stars and StripesThe story of the creation and activity of the Japanese Americans Citizens League is quite interesting. Its executive leader became Mike Masaoka, from Utah, who before accepting the leadership offer had talked with friends, including Utah Senator Elbert Thomas, a Mormon missionary in Japan in his youth. Senator Thomas encouraged Mike Masaoka to take the JACL post.(Senator Thomas also proved valuable in assisting the Japanese-Americans after the internment took place.)In the book, there is a wealth of detail about many aspects of the experience of the Japanese-Americans after the onset of the war. The Japanese on Hawaii were not interned--they were too integral to the local economy. The Kibei, children of Issei, who had returned for a while to Japan for Japanese education proved invaluable to the US military as translators. The Nisei fought very bravely with the US military in Europe.This book, Nisei: The Quiet Americans, tells a \"brief epic\" story of one national group's experience, accomplishments, and contributions after arriving in the USA. I found it very interesting reading.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "silent honor danielle steel",
        "description": "From #1 New York Times bestselling author Danielle Steel, a moving novel of families separated and lives shattered by prejudice during one of the most shameful episodes in American history. A man ahead of his time, Japanese college professor Masao Takashimaya of Kyoto had a passion for modern ideas that was as strong as his wife's belief in ancient traditions. His eighteen-year-old daughter, Hiroko, torn between her mother's traditions and her father's wishes, boarded the SS Nagoya Maru to come to California for an education and to make her father proud. It was August 1941. From the ship, she went to the Palo Alto home of her uncle, Takeo, and his family. To Hiroko, California was a different world. Her cousins had become more American than Japanese. And much to Hiroko's surprise, Peter Jenkins, her uncle's assistant at Stanford, became an unexpected link between her old world and her new. On December 7, Pearl Harbor is bombed by the Japanese. Within hours, war is declared and suddenly Hiroko has become an enemy in a foreign land. On February 19, Executive Order 9066 is signed by President Roosevelt, giving the military the power to remove the Japanese from their communities at will. Takeo and his family are given ten days to sell their home, give up their jobs, and report to a relocation center, along with thousands of other Japanese and Japanese Americans, to face their destinies there. Families are divided, people are forced to abandon their homes, their businesses, their freedom, and their lives. Danielle Steel portrays not only the human cost of that terrible time in history, but also the remarkable courage of a people whose honor and dignity transcended the chaos that surrounded them. Silent Honor reveals the stark truth about the betrayal of Americans by their own government . . . and the triumph of a woman caught between cultures and determined to survive.",
        "authors": "['Danielle Steel']",
        "infoLink": "https://play.google.com/store/books/details?id=nfwVgK34WZgC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "This novel is so wrong it is actually funny.The cover design alone should be enough of a warning that this book is wide of the mark, it's red and gold, which are popular in the Chinese palette, but not Japan.I bought this book for my Japanese wife and from the very first sentence she started giggling at the ridiculous errors.The first character introduced in the novel has the alleged family name of Takashimaya.Takashimaya is not a family name in Japan, but it is the name of a very well known upscale department store chain.(The suffix ya means shop, btw).Maybe the Japanese translation of this novel has a lead character named Mister Nieman Marcus?I could go on but I am laughing too much to type properly.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a moving story about the unbelievable pain and prejudice faced by the Japanese in America during WWII. It tells about the life experiences of Hiroko, a Japanese girl, who arrives in America right after the bombing of Pearl Harbor in 1941. It tells of her life detained in an internment camp and her life after she is released. It tells of her romance and losses. The story is fictional, but could be real... The historical backdrop is convincing and very realistic. It reveals many of the injustices imposed on the Japanese during this time. A powerful and thought-provoking novel.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is the story of one of the most shameful times in American history, the internment of the Japanese Americans. As a half-Japanese, I know I would have been rounded up during this time and stripped of my Constitutional rights, treated as a prisoner. As such, I try to read whatever I can about this important part of America's story. &quot;Silent Honor&quot; is hardly the most &quot;distinguished&quot; or important books available on the subject. It tells the story of a Japanese girl, visiting her cousins (who, as Steel goes to great lengths to remind us, again and again, are AMERICAN, so much that they giggle at her traditions that they don't understand) in California during the time of Pearl Harbor. She gets stuck there and is placed in an internment camp. Along the way, she meets an amazing American man and has an affair with him. If you can disregard the affair (which you should cause it's pretty ludicrous, but I guess standard for this kind of book), you might get a lot out of this novel. The depictions of camp life and the hell that the internees faced is pretty well done. Steel does her research and tries to incorporate important Japanese mores such as &quot;shikata-ga-nai&quot; and historical details like the &quot;no-no-boys&quot; in to her story. You will learn a lot about the camps. I enjoyed the characters and the attention to historical detail, but it must be said that Steel is a pretty horrible writer. She begins almost every sentence with &quot;And...&quot;. I think it's trying to sound dramatic, but mostly it sounds like she needs an editor. If you've never read Steel before, this might drive you insane (look past it, if you can). If you are a big fan, I think this (along with Wanderlust) is probably her best work.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a Japanese living in Kyoto, where the Japanese girl actually came from. I found this story to be entertaining but so unreal. First of all, a Japanese girl in the 40s will NEVER have premarital sex, let alone with a white man. Being pregnent out of wedlock is the most disgraceful anyone can ever imagine. Plus having a child of white man is unthinkable.I recall in the book, the Japanese girl's father spoke to his children in English. This is a bit silly too. Also at the end when she goes back to Japan to find her parents dead from an air-raid is very dissappointing. First of all, Kyoto was never air-raided because there are many ruins of Japan. Where her parents evacuated, Maizuru is in middle of nowhere, a one-horse town, so I can not imagine any reasons for Americans to air-raid there either. I don't think such thing happened. The fact that the girl returning to Japan with mixed blood son without father is ridiculous. However, this is, after all an entertainment book so I can accept it. But I truly wished her parents were still alive and Steel wrote the conclusion in another way. The family seemed to be very modern for that time and I was very interested in finding out how they resolved the problem. But like her other stories, she killed the characters and ended the book without any real settlement.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I liked this book. I think there shuld be more books written about this subject. It is painfully overlooked. Being of Japanese decent, I have many relatives who survived just the kind of experiences mentioned in this book. I think the parts about the camps are very realistic and spectacularly written, but I shake my head at the boy/girl relationship this book is based on. I really don't think a sturdy, well-bread girl like Hiroko would just jump into a relationship so fast, much less with a white man. It gose against everything she was raised to believe. I think this book gives a very stereotypical view of the Japanese women and their morals. Steele really tried, but I think more study into traditional Japanese culture is necessary.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I found this a wonderful love story between a young lady from Japan and a young man from America. They have to face prejudisim from others but they managed to survive...read more to find out.I wasn't dissapointed with this book because she was able to grap the readers attention. Danielle Steel is the best author I've read in a long time! I liked her other novels too, The Ring, The Promise and A Perfect Stranger.Happy Readings!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I liked this book because I found it very interesting. I was able to read about a culture that I didn't know, and get a better understanding. It was a sad, horrible time for Japanese Americans, something that I think many of us forget- this story makes us remember.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Although I agree with the other individuals that have reviewed this book (that many parts seemed very unfeasible) overall it was an excellent introduction to American History. Having been entirely educated in the American school system - we barely glazed over the US treatment of Japanese during the war. I had no idea until I read this book the extent of the mistreatment and injustice that Japanese immigrants and citizens of Japanese decent were subject to during the war. As a story, this book is fabulous, as a tool for education it is a start. Today's youth will pick this up out of interest and they will learn something new. Of course if they want more accurate facts they will have to try the dryer literary works in the history section!! But, at least they will learn a little more about where our country has been and what we have done to our own citizens.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My parents are both native Californians of Japanese descent. They both were interned in concentration camps located in Arizona. Both families were farmers and lost everything as a result of being sent to the camps. My mom said that most of Steel's descriptions of this horrible incident were accurate. Since they couldn't own land, I don't think the family in Silent Honor owned their home as the author wrote, though. I also found it hard to believe the part about the illicit lovemaking, etc. A traditional Japanese girl in the 1940s would NEVER have done that. I have enjoyed Steel's books for many years and am pleasantly surprised when she writes about historical events like in this book and &quot;Message from Nam.&quot;",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is absolutely beautiful. There is so much in it that we can learn, I just don't know how to put it into words. I just barely finished it and I loved it. Good insights into Pearl Harbor and what the Japanese citizens/immigrants went through.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "ruins of identity ethnogenesis in the japanese islands",
        "description": "Many Japanese people consider themselves to be part of an essentially unchanging and isolated ethnic unit in which the biological, linguistic, and cultural aspects of Japanese identity overlap almost completely with each other. In its examination of the processes of ethnogenesis (the formation of ethnic groups) in the Japanese Islands, Ruins of Identity offers an approach to ethnicity that differs fundamentally from that found in most Japanese scholarship and popular discourse. Following an extensive discussion of previous theories on the formation of Japanese language, race, and culture and the nationalistic ideologies that have affected research in these topics, Mark Hudson presents a model of a core Japanese population based on the dual origin hypothesis currently favored by physical anthropologists. According to this model, the Jomon population, which was present in Japan by at least the end of the Pleistocene, was followed by agriculturalists from the Korean peninsula during the Yayoi period (ca. 400 BC to AD 300). Hudson analyzes further evidence of migrations and agricultural colonization in an impressive summary of recent cranial, dental, and genetic studies and in a careful examination of the linguistic and archaeological records. The final sections of the book explore the cultural construction of Japanese ethnicity. Cultural aspects of ethnicity do not emerge pristine and fully formed but are the result of cumulative negotiation. Ethnic identity is continually recreated through interaction within and without the society concerned. Such a view necessitates an approach to culture change that takes into account complex interactions with a larger system. Accordingly, Hudson considers post-Yayoi ethnogenesis in Japan within the East Asian world system, examining the role of interaction between core and periphery in the formation of new ethnic identities, such as the Ainu. He argues that the defining elements of the Ainu period and culture (ca. AD 1200) can be linked directly to a dramatic expansion in Japanese trade goods flowing north as Hokkaido became increasingly exploited by core regions to the south. Highly original and at times controversial, Ruins of Identity will be essential reading for students and scholars in Japanese studies and will be of interest to anthropologists and historians working on ethnicity in other parts of the world. Text adopted at University ofChicago",
        "authors": "['Mark James Hudson']",
        "infoLink": "https://play.google.com/store/books/details?id=tZ0BEAAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is excellent for those who want a survey of Japanese archaeological literature for the Jomon and Yayoi periods. The author reviews the development of archaeological theories in Japan, as well as among the few Western scholars specializing in Japanese prehistory. If you don't know much about Japanese archaeology, and especially if you don't read Japanese and can't go to the primary sources, this book is a great place to start.Although the title sounds postmodern, in fact this book is cultural-historical in its emphasis. The author advocates a multidisciplinary approach to the question of Japanese ethnogenesis and supports his opinions with an extensive bibliography.Particularly interesting to me is the way that (according to the author) Japanese archaeological theory has mirrored the nation's recent political history. Too bad archaeologists so often fail to be reflexive about the history of theory in their OWN countries.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Fans of Japanese archaeology and pre-history may like this book. The book covers the conflicting academic accounts of the early migrations of Yayoi and Jomon peoples in pre-historic Japan. If you are very well-versed in these subjects you may well find much to interest you. There is a great deal of commentary of the different academic interpretations of how the Japanese people have come about from different populations that may have entered Japan from the Korea, China, and from the islands to the south.Having said that, I got completely bogged down in the middle of the book, which gets mired in excessive details and charts referring to various stone implements unearthed and their relation to Yayoi and Jomon culture. Unless you are extremely interested in these things, you can comfortably skip to the final part of the book which actually contains some of the authors own conclusions once he has surveyed dozens of other academics' theories.This book is certainly to be recommended to the academic but should be avoided by the casual reader interested in Japan. I have yet to finish the book 6 months after purchasing it.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "japans policy trap dollars deflation and the crisis of japanese finance",
        "description": "Until quite recently, the Japanese inspired a kind of puzzled awe. They had pulled themselves together from the ruin of war, built at breakneck speed a formidable array of export champions, and emerged as the world's number-two economy and largest net creditor nation. And they did it by flouting every rule of economic orthodoxy. But today only the puzzlement remains-at Japan's inability to arrest its economic decline, at its festering banking crisis, and at the dithering of its policymakers. Why can't the Japanese government find the political will to fix the country's problems? Japan's Policy Trap offers a provocative new analysis of the country's protracted economic stagnation. Japanese insider Akio Mikuni and long-term Japan resident R. Taggart Murphy contend that the country has landed in a policy trap that defies easy solution. The authors, who have together spent decades at the heart of Japanese finance, expose the deep-rooted political arrangements that have distorted Japan's monetary policy in a deflationary direction. They link Japan's economic difficulties to the Achilles' heel of the U.S. economy: the U.S. trade and current accounts deficits. For the last twenty years, Japan's dollar-denominated trade surplus has outstripped official reserves and currency in circulation. These huge accumulated surpluses have long exercised a growing and perverse influence on monetary policy, forcing Japan's authorities to support a build-up of deflationary dollars. Mikuni and Murphy trace the origins of Japan's policy trap far back into history, in the measures taken by Japan's officials to preserve their economic independence in what they saw as a hostile world. Mobilizing every resource to accumulate precious dollars, the authorities eventually found themselves coping with a hoard they could neither use nor exchange. To counteract the deflationary impact, Japanese authorities resorted to the creation of yen liabilities unrelated to production via the largest financial bubble in history. The bursting of that bubble was followed by massive public works spending that has resulted in an explosion in public sector debt. Japan's Policy Trap points to the likelihood that Japan will run out of ways to support its vast pile of dollar claims. Should the day come when those claims can no longer be supported, the world could see a horrific deflationary spiral in Japan, a crash in the global value of the dollar, or both. The effects would reach far beyond Japan's borders. Mikuni and Murphy suggest that a reduction in Japan's surplus must be accompanied by a reduction in deficits somewhere else-most obviously through far-reaching shifts in the American economy.",
        "authors": "['Akio Mikuni', 'R. Taggart Murphy']",
        "infoLink": "https://play.google.com/store/books/details?id=kIpDzujtu5oC&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is not up to Brookings Institute standards, perhaps that explains the forward written by the Brookings chief, where he says the books 'conspiracy' theme is interesting, to deflect criticism that the book relies too much on secondary sources.Basically the premise is old news: Japan runs a current account surplus because it refuses to import and only exports, which creates a weaker than normal yen. The dollar surplus then has to be either invested overseas (hence the Japanese overpay for US investments), or plowed into assets by JP banks to avoid the yen from being strengthened. But that this is part of a 'conspiracy' is not really fleshed out. The book relies too much on secondary sources. And it is not clear to me that the currency imbalance is the root of Japan's ills (this is the central premise of the book). Note that Japan import/exports are only 10% of the GNP, (not unlike the 15% in the US), and thus the lack of demand in JP from the remaining 90% of the GNP is perhaps the real cause of the 10 year recession there. Also other Asian countries do the same thing as JP (namely, keep their currency weaker than it should; ration credit; restrict labor mobility and labor wage rates); how do their economies escape the JP trap of recession? Can it be that other reasons are at fault for JP's demise, such as JP is getting older? These issues are not discussed.Basically the book is a 20 page white paper made into a several hundred page book, and the tone is too 'alarmist'. The most interesting points are made when discussing politics, and how the Ministry of Trade decides who is going to live or die vis-a-vis the 'walking zombie' companies. Of course the same things happened in the US (credit rationing until the 1970s; bank failures in the late 1980s, where the government decided which banks were to be taken over; and a merchantilist philosophy of keeping the dollar strong, which keeps inflation low in the US but results in the mirror opposite but also dangerous problem as in Japan--current account deficits, or living beyond your means).",
                "review/helpfulness": "13/20",
                "num_reviews": 20
            },
            {
                "review/text": "Akio Mikuni & R. Taggart Murphy have produced an excellent critical piece on the multiple troubles that Japan now finds itself, as well as realistically outlining how the elites are still very much unaware of the full consequences of their actions, and indeed inaction. This book also raises a number of interesting indepth parallels in Japanese history, illustrating that Japan has been in similar waters before and like the past, cannot adapt and change policy before disaster causes havoc. It is furthermore explained that, like all previous merchantile and/or socialist regimes, Japan's production capacity approach to trade is of little use unless profits and risk management are approached seriously. There is some hope for Japan, but the authors wisely find that Japan's war production approach (which is indeed ancient), coupled with its ministerial fiefdoms (whom act like warlords of old.....and control things like banks and until recently the Japanese equity markets), weak liberal democratic structures, non-guilded unions, and lambish populous, coupled with a mountain sized foreign (US$) currency reserve, {which as they argue convincingly, cannot ever really be swapped for Yen....it would destroy Japan (and cause much angst elsewhere)}, all need fundamental revision. Fundamentally, this book highlights the enigma of Japanese power. It should be read along with books like Cartels of the Mind (Ivan Hall); Japan's Big Bang (Declan Hayes); Dogs and Demons (Alex Kerr);The Enigma of Japanese Power (Karel van Wolferan); and Hirohito and the Making of Modern Japan (Herbert P. Bix). Having lived in Japan for four years, I would highly recommend this book.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            }
        ]
    }
]