[
    {
        "Title": "paula deen friends living it up southern style",
        "description": "Beloved Food Network personality, restaurateur, and author Paula Deen loves a party, and in her latest book, Paula Deen Celebrates!, Paula shares with fans old and new how she celebrates a year's worth of holidays and special occasions. Now anyone can share in the down-home celebrations Paula, her husband, Michael, their kids, and extended family enjoy at their beautiful home in Savannah, Georgia. What better way to start off the New Year than with a New Year's Eve Brunch with friends -- at midnight! This colorful celebration includes Crab and Spinach Casserole and Baked Tomatoes, and finishes with a quintessentially southern Hummingbird Cake and Irish Coffee. Welcome St. Patrick's Day, Savannah style, with Lamb Stew and Green Grits Pie. The centerpiece of an Easter dinner is a Peanut Butter-Glazed Ham, accompanied by Spinach-Swiss Casserole, Squash Boats, and flaky Butterhorns, with a bonus recipe for Ham Salad that makes eating leftovers a treat. Looking for a reason to party, south-of-the-border style? Try Paula's Cinco de Mayo Fiesta menu, with Macho Nachos and a cool and creamy Margarita Mousse. Paula honors the memory of her mother, and all the other women who have blessed her life, with a Mother's Day Tea of dainty sandwiches and irresistible cookies served on her best china, and fathers get their due with a Father's Day Boating Picnic. The Fourth of July is the perfect occasion for an Outdoor Grill Party and Low-Country Boil, and if what you want is a quiet evening at home, pop a movie in the DVD player and chow down on your choice of Paula's savory and sweet pizzas. Gather the family to watch some football and savor Jamie's Cheeseburger Pies, and give family and friends the gift of a sweet treat at the holidays with Paula's Icebox Fruitcake or Peppermint Bark. Her Christmas feast starts with Cranberry Holiday Brie and stars an impressive Standing Rib Roast, with Twice-Baked Potato Casserole. The show-stopping dessert is Paula's butter-laden Coconut Pound Cake glazed with coconut syrup and covered with icing and toasted coconut! Paula brings you into her home, her kitchen, and her heart with family stories and photographs. This time, her husband, Michael, sons Jamie and Bobby, and brother, Bubba, chime in to share their memories, too. Decorating and serving ideas will inspire you to use what you have to carry through a theme to make the most informal meal special. And Paula shares her most private thoughts in a special feature -- Paula's Pearls of Wisdom -- which you'll find with each menu. Paula Deen Celebrates! is Paula at her very southern best. Join her in making and sharing her best dishes for the best times of your life.",
        "authors": "['Paula Deen']",
        "infoLink": "https://play.google.com/store/books/details?id=9qWMdJ5PSNMC&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "If you are a true Paula Deen fan as I am, you will buy this book regardless. I don't think this one is near as good as her other cookbooks. There are alot of recipes provided by friends and peers, and a few repeats from previous cookbooks. And seems like several are more exotic than her normal downhome type of things. I always liked Paula's older recipes cause chances are you already had most of the ingredients already in the pantry. I know it would be hard for her to keep coming up with original recipes given her schedule, but I'd give my eye teeth for another book of solely Paula and her family's recipes of good old southern cooking.If you watch Paula on tv and are looking for a good sampling of her work, pick up The Lady & Sons Savannah Country Cookbookor Just Desserts and you'll turn to it time and time again. For true die-hard fans who already own the other three, you'll enjoy the intros and witty comments made by Paula throughout the book.",
                "review/helpfulness": "132/134",
                "num_reviews": 134
            },
            {
                "review/text": "Paula's recipes are delicious but not for the diet conscious. Just because she uses some store bought ingredients does not detract from her creativity and makes the preparation a snap. She is the ultimate Southern cook with lots of butter and love in her recipes. I think this cookbook is one of her best. I really like the fact that I can save time by using already prepared ingredients and not lose any of the flavor when I cook. All her \"store bought\" ingredients can be found easily.",
                "review/helpfulness": "51/52",
                "num_reviews": 52
            },
            {
                "review/text": "Let me say up front that I love Paula Deen and I have read and re-read her first two cookbooks many times. Many of the recipes I've tried from those books are outstanding. This book, however, takes a detour. As a starter, you will note that this is the first book Paula has written with somebody else. Although Paula's name is prominent on the cover to attract customers, there is actually a co-author. Second, the title is even more telling: Paula and Friends. When you get to the heart of the matter, this is not a Paula Deen cookbook; it's a collection of recipes from other people with Paula's name on the cover to sell books. Paula herself hints at this in the Introduction. She says her next book was coming due (multi-book contract I presume) so she was looking around for ideas and called a friend, who turned out to be the co-author. I get the impression Paula had to come up with a new book and didn't really have any new ideas after having already written three books.As for the recipes themselves, some are just reprints of previous Paula recipes in a new format. What Paula does in this book is organize recipes by the type of function you're having. She provides complete menus for different types of gatherings. So many of her recipes aren't really new. And like I said, most of the recipes in the book come from other people. Just from reading them, they look like decent recipes, but I'm not sure why this counts as a Paula Deen book. Unfortunately, this book seems more like merchandising than her earlier books. Maybe that is part and parcel of becoming a famous chef and cookbook author.",
                "review/helpfulness": "32/34",
                "num_reviews": 34
            },
            {
                "review/text": "First off, I love this book and I could go into the details of favorite recipes but I basically bought this book because:1. I love Paula's show on tv, have made some of those recipes and like her casual, chatty style. Good food, nice presentation.2. The book has menus and great recipes and the humorous writing of Paula herself. I really like cookbooks that contain slices of the cook's life, books which are as fun to read as to use. This one is. I love the Oatmeal cookies and her fried chicken is pure Southern cooking at its best. Nothing too fancy, just good, basic home cooking.NOW, HERE IS WHAT YOU NEED TO DO IF YOU ARE INTERESTED IN THIS BOOK:This is one time when Amazon's \"Search Inside the Book\" function really helps you figure out if this book is for you. It is about as close to going into a bookstore and looking through an actual book as you are going to get - at least, while still online.Take a look at the sample menus. Then take a look at the index, most (if not all) of which is featured in the \"Search Inside the Book\" function. That will give you a detailed list of recipes and menu ideas contained in this book. You'll also be able to look at the introduction and get a feel for Paula's writing and style. Reading this book is fun and when you are in the mood for cooking, these are some fine recipes!Personal tastes differ, of course, and what one person finds delicious, others may not. But I think you'll find this book will up your chances of pleasing friends and family with delicious food. Not only does the author have a popular tv show but she has run a food business for years, one that has been successful and at least one of her sons worked in restaurants and BOTH of them grew up cooking with her. This means you'll be cooking food that has a proven track record for appeal and popularity.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "I have made five recipes from this book so far and have found it to be rather unreliable. The Spicy Tomato Soup required double the amount of chili as called for; The All Day Mushrooms needed salt--not included in the recipe or instructions; The Chicken Divan was heavy, thick, too rich, too processed and too salty (I added no salt). The Marinated Tomatoes and Green Chili Corn Muffins were the only recipes that turned out perfectly according to the ingredients lists and instructions. Somebody failed to test these recipes properly before publication, or that is my best guess. I haven't bought any of her other books, but hold higher hopes for Paula without her friends.",
                "review/helpfulness": "14/21",
                "num_reviews": 21
            },
            {
                "review/text": "What a WONDERFUL new book to add to our collections- THANK YOU Paula!First off, there are a couple of reviews thus far that are simply unfair. Paula Deen does NOT use Chick-Fil-A chicken in her recipes- she recommended picking some up for a TAILGATE party.........most people do that. Nothing unusual.And NO, she's not suggesting we eat this food everyday. Hope that clarifies for those who can't read.This book gives wonderful recipes for get togethers and those special times you want to put on a good feast for dear friends and family. These are warm, down home dishes that are sure to please.Reading this book is like being at one of her parties in person- JOB WELL DONE PAULA!PS- I just met Paula and Michael at a book signing for this book. She's incredibly friendly and beautiful to her fans. Meet her if you get the chance. She's worth standing in line for!!!",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "I'm surprised to read the few poor reviews here - I have all of Paula Deen's books, but I've gotten more 'everyday' recipes from this one than all of the others combined! I felt like I was sticking post-it notes to every other page!Yes, they're rich (it *is* Paula). Yes, she uses some convience foods (but just like the rest of us 'real-people' would - she's gone nowhere near Sandra Lee, thank goodness!). I love that she sets up menus and suggests appropriate occassions for these menus.Her best yet, in my opinion.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is my first Paula Deen book, and I must say I was pleasantly surprised. I have watched a number of her shows on Food Network, and the shows I have seen all have recipes that seem a tad fussy and over done. But the book had a number of recipes that were simple to make and had the clean, simple taste my husband and children enjoy.I love to cook, and I love cookbooks. I am always trying new things, or trying old things in new ways. Sometimes my family enjoys it, sometimes they just give me a look and eat a few bites to be nice. This cookbook takes me back to the down home southern cooking my husband knows and loves.The beer in the rear chicken was easy to prepare, and I really liked the flavor the beer infused into the chicken. There is a warm chicken salad casserole that my kids just gobbled up.The food isn't 'low fat' by any means. But on the weekend, when my husband, our four little boys and I are just hanging out, I really want something rich and satisfying-and this book delivers.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Quote from Andi in LA -\"When I actually go through the trouble of inviting people over for a nice dinner, I want to take my time with more sophisticated recipes that look like I put time into them--in other words, no dishes that taste divine but look like \"trailer tra* mush\" when plated.\" -end quote.What an awful thing to say and you call yourself a fan. Try serving your stuck up friends some fried chicken with slow cooked pinto beans & rice or some shrimp with grits. Believe me your dinner will be a hit.I would recommend this book to everyone. Sure, a lot of the dishes are high in fat but you don't need to eat this way everyday. I trust Paula. About a year or so ago I served her Sloppy Joe's (open faced) to a group of \"upscale\" friends and they're still talking about it. I have yet to prepare anything from this new book because I can't decide just yet. Nothing says \"I love you and I'm so happy you're a part of my life\" like a good ol' southern meal! Good job Paula Deen!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I really like all of Paula Deen's cookbooks, but I especially love this one. I've made several of the recipes (as I have out of all her cookbooks) and they're all *GREAT*!! Her recipes call for normal, everyday ingredients that most people either already have in their cabinet or know exactly where to find them at the grocery store. I also just love to sit down with this book and just *read* it...it's very entertaining...just like her show on the Food Network. I highly recommend this book!!!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "betty crocker 4ingredient dinners",
        "description": "Presents a delicious array of wholesome, easy-to-prepare recipes for dishes that require just four ingredients, including Glazed Turkey Tenderloins, SKillet Apple Butter Pork Chops, Mustard Lamb Chops, and many others, all enhanced by full-color photographs, nutrition information, and handy kitchen tips and notes. 50,000 first printing.",
        "authors": "['Betty Crocker']",
        "infoLink": "http://books.google.nl/books?id=C4IGAAAACAAJ&dq=Betty+Crocker+4-Ingredient+Dinners&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "The cover of this book says: \"Prep in Minutes,\" \"Make It Delicious,\" and \"Easy Homemade Tonight.\" Well, 1 out of 3 is true. You certainly can prep these dishes in minutes, but the flavor is not delicious and definitely not homemade. The vast majority of dishes in this book consist of a can of this, a box of this, and some bottled sauce or other. While this is not bad on nights when you are just desperate to get anything on the table fast, I would definitely not call them \"recipes\"--they are more like ideas. To be honest, you could come up with most of these recipes yourself. For example, throw pasta, jarred pasta sauce, pre-cooked packaged meatballs, and olives in a skillet and--voila--\"One-Pan Pasta and Meatballs.\" It's not that it's a bad idea, it's just that it's just that--an idea, not a recipe. If you are looking for real flavor and real home-cooked food with 4-ingredients, please be aware that this book relies almost exclusively on canned, jarred, bottled, and/or frozen goods (not surprising since General Mills owns the Betty Crocker label and I'm sure they want you to buy their products). The health-conscious should also be wary since processed foods generally have much higher sodium, sugar, and preservative content than fresh, whole ingredients. I can recommend this \"cookbook\" to someone who has no idea how to cook, is on a tight budget, and needs ideas for what to make fast, but I would suggest trying to substitute some fresh ingredients where possible. It could also be a good book to have on hand as an emergency source for ideas on very busy days (that's why I have it). It's not totally useless, but as far as cookbooks go . . . well, it isn't really a cookbook at all.",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "Okay, it sounds impossible and not very tasty or interesting: dinners made from ONLY 4 ingredients or less. Trust me, this is much better than you think!From desserts to sides and of course, dinners, this book has great advice for creating easy, delicious meals in no time with a minimum of ingredients. Highlights include what to keep on hand for such cooking and how to perk up quick and easy meals.It's so easy teenagers and husbands can make dinner on their own with this book!",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "The other two reviewers raved about this, so maybe it's just me, but the title should be \"The most simplistic recipes ever created\". There is actually a recipe for a toasted cheese sandwhich. If you do not already know how to make this, then this book may be too advanced. Pass on this unless you can't come up with a can of soup, chicken & bag of veggies on your own.I give it 4 stars only because it is Betty Crocker and it has great pictures.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "For those of us who aren't gifted in the culinary department, this book is a gift from above. Cooking can be a chore when you've got a hungry family waiting for something yummy to eat. This makes it oh so easy!! I'll be holding on to this book for many many years.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I first saw this book in my mothers kitchen - I now have it! This book is a life saver for busy households who simply don't have the time to spend 2 hours preparing a meal! The meals are quick, easy, and VERY tastey...many of the meals I have made from this books are now favorites of my family and friends alike! If you are looking for the BEST fast, easy, and ultra simple cookbooks..this is IT!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I've made several recipes from the 4-Ingredient Dinners cookbook and all have been well received. Tonight my kids lapped up the Breaded Pork Chops prepared using Bisquick, saltine cracker crumbs, salt and pepper, egg and a bit of water. The pork chops turned out tasty and relatively healthy since they were cooked over medium-high heat in a nonstick skillet sprayed with nonstick cooking spray.I am already planning to buy several copies as Christmas gifts.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "You won't find any caviar dishes here - but if you're blue-collar like us and don't mind eating Ravioli occasionally, then this is your book! (C'mon - you know you like Ravioli...)There are some great dishes in here, and if you use a few spices and things like ground turkey instead of beef, you can make them healthier and tastier as well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you are in a hurry or trying to teach someone to cook, this is a wonderful book. Recipes are very simple with 4 ingredients, there are also tips if you want to add more ingredients. I bought this for my daughter who is learning to cook and I was amazed at the nice variety of recipes. I bought one for myself too!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "vegetarian classics 300 essential and easy recipes for every meal",
        "description": "Jeanne Lemlin sets the standard for accessible and appealing vegetarian cooking. Vegetarian Classics is Jeanne's most useful and comprehensive book to date: an essential collection of 300 no-fail recipes for soups, salads, sandwiches, pastas, pizzas, calzones, casseroles, stir-fries, stove-top dishes, sides, snacks, desserts, and breakfasts. Each recipe is deeply satisfying and surprisingly simple, reflecting Jeanne's trademark dedication to uncomplicated techniques and unparalleled flavor.",
        "authors": "['Jeanne Lemlin']",
        "infoLink": "https://play.google.com/store/books/details?id=sJJhcgrO6JMC&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Using mostly kitchen shelf ingredients, Ms. Lemlin's book has provided our family with wonderful breakfast lunch and dinner recipes. Honestly, there is not one bad recipe in the bunch. I first took this book out of the library, paid lots of late fines and eventually, reluctantly, took the book back. My daughter bought it for me, and now I am buying her and her sister a copy of the book. The techniques are simple, the ingredients easily available and the outcome is consistent every time. I highly recommend this for either vegetarians or those who simply enjoy wonderful interesting food.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I am a huge fan of all of Jeanne Lemlin cookbooks, and this is just another addition to my collection. I am not a vegetarian, but don't eat much meat. I like simple recipes, easy to find ingredients, a good balance of nutrition, and most of all, delicious recipes. Oh, and I really like it when just one dish fulfills all these needs and you don't need side dishes (keeping it simple). Jeanne Lemlin cookbooks all meet my criteria. Some of my favorite recipes from this particular book are: Braised White Beans with Tomatoes, Zucchini, and Garlic; Classic Vegetarian Enchiladas (actually, those are in the oven right now), cooked tomato-chipotle salsa, and the Mock Meatloaf (I made this for Christmas, along with the mushroom gravy and some mashed potatoes- I made meatloaf sandwiches with the leftovers and my husband raved. The funny thing is, I HATE meatloaf made with real meat). There are many others I love, and many I haven't tried yet.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I've been collecting vegetarian cookbooks for years. Some I seldom use except for a favorite recipe or two. But Jeanne Lemlin's cookbooks are on my favorites list and I use them often. Her recipes are delicious, easy to prepare and satisfying to vegetarians and non-vegetarians alike. I own all of her cookbooks and would rejoice if she were to publish another one.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "There's a section at the front of the book that explains most of the ingredients - where to buy, how to store and use - great for people who are a little shy about using new ingredients. It's a good book for beginners or people who are experimenting with adding more vegetarian options to their diet. There is a section on planning meals at the back that lets you put together a menu of complementary items and makes it easy to ensure good and balanced nutrition.Directions are clear and interesting information is given about food and its uses, as well as easy-to-follow instructions for creating some kitchen basics so you don't have to succumb to store-bought preparations.Only criticism is, I wish it was spiral bound or had one of those lay-flat bindings to keep it open on the countertop.Highly recommended.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "campfire cuisine gourmet recipes for the great outdoors",
        "description": "Here is a guide for lovers of both good food and the great outdoors. Campers wax rhapsodic about the pleasures of communing with nature while resigning themselves to eating unsatisfying foods around the campfire. Campfire Cuisine changes all that. It offers over 100 simple but inspired meals. Such dishes as Coconut Shrimp, Grilled Eggplant Parmesan and Baked Chocolate Bananas can be cooked at a campsite using fresh foods and never relying on canned, prepared or freeze-dried products.",
        "authors": "['Robin Donovan']",
        "infoLink": "http://books.google.com/books?id=be_giE36sGIC&dq=Campfire+Cuisine:+Gourmet+Recipes+for+the+Great+Outdoors&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "My wife received this book as a gift from my mother after I recommended it to her. The recipes are much more elaborate that what we were looking for. They contain numerous ingredients, many of which are not our common staples. This alone make this book unsuitable for our style of camping. The directions do encourage at home preparation, but this, again, was not what we were looking for. We want to be able to use fewer ingredients, prepare on site, and still make delicious, appetizing meals in the great out doors! We'll keep looking.",
                "review/helpfulness": "25/28",
                "num_reviews": 28
            },
            {
                "review/text": "Many years ago I went on my first camping trip with my husband. We entered beautiful Big Sur with everything we thought we needed; a tent, sleeping bag, camp stove and some propane. I forgot to bring food. I didn't even have a can opener. If only \"Campfire Cuisine\" had been available back then. The first two chapters cover all the gear and cooking supplies you need to bring and how to plan meals for the trip.I love to cook. I love camping. This book really brings the two together. The usual camp cookbook recipe ingredients like bisquick, frozen tater-tots and canned mushrooms are completly absent. The author instead relies upon planning, at-home preparation, and careful packing to take the place of processed convenience products.\"Campfire Cuisine\" is filled with delicious recipes most of which use a camp stove or grill. (Unfortunately there are no recipes for dutch oven cooking.) The recipes are fun without being really fussy. The \"Fish cooked with curried couscous\" (page128) is wonderful without being weird. Even my kids liked it! The whole thing cooks in tin foil on the grill. No clean up! The \"grilled flatbread pizza\" (page156) calls for lavash bread instead of pizza dough. Of course the next day that same lavash can be used for one of the many varieties of \"Aram sandwiches\" (page 88). There honestly isn't a recipe in here that I wouldn't try. But I do like trendy food and I like to try new things. If you like more basic food then this book might not be for you.As for the book's design, I can see where someone who has poor eyesight would have a problem reading the book. It's printed in olive green and orange on white. I think the author wanted the book to be small enough to pack for a camping trip, so the type is really small. The content is so good though that the book is still worthwhile.After fifteen years of looking for a great camping cookbook I finally found it. If you like to cook and want a book that will make the meals on your next camping trip really shine, then this book is for you.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book received high marks from me before I even opened it--it has a compact format and a sturdy paperback cover, perfect for packing in your camping gear without excess weight or bulk. By compact, I am referring only to the cover dimensions; this is a thick recipe-packed book that is well worth the cover price.Campfire Cuisine prefaces the recipes with essential opening chapters on the basic cooking equipment needed (plus some optional upgrades), how to choose a campstove, basic storage and packing rules, fire-starting tips and rules, and menu planning. A novice will glean all they need to know about outdoor cooking in these chapters, but even the most experienced camper/outdoor griller is bound to pick up a few extra tips and tricks.The bulk of the book consists of recipes for condiments, marinades, snacks, breakfasts, light meals, dinner entrees, desserts, and side dishes. Most have streamlined ingredients and directions on how to do as much prep work as possible before embarking on the camping trip. I was struck by how this book can be interpreted at any level. I'm a fairly basic campfire chef who likes to keep her friends happy without too much legwork, and I have picked out dozens of simple but delicious recipes from this collection. If you are a super-chef who wants to entertain and dazzle at the campfire, you can ride this book full-hilt and create awe-inspiring spreads at the campstove.Don't limit this book just to camping trips! You can dazzle your friends in your backyard with all of these ideas, and in fact, that's how I envision myself using it most.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book has several really nice recipes, but, despite what it says on the cover, it is not for people who backpack or camp away from a car or RV. Why? Because the first item listed under necessary equipment is a cooler--sure, let's draw straws to see who carries it up that hill.The good:Book is a nice size--great for car camping or to keep in an RV. If you are the type who stays in established campsites with running water from a spigot where your vehicle is close by, and/or you are staying in one place for several days with several people to split up all the stuff you need to bring for this type of cooking, it's fine. Also a good book for those who just like to cook in their backyard, or at their local park for a picnic. If you stay in vacation cabins or hotels/timeshares with kitchens when you're traveling this would also be a good book, as it has \"make it at home\" directions as well.The bad:Recipe listing in the index is not good--hopefully this will be fixed in a future edition.The color contrast between the print and the paper is hard on the eyes.This is not really a cookbook geared towards anyone looking to take as little as possible on a backpacking or even a car camping trip (just because it fits in the car doesn't mean you should take it with you).Too much trash generation from ziplock bags and aluminum foil from this type of cooking IMHOA few more dessert recipes would have been nice, as well.Bottom line:This book is geared towards those who don't mind taking it all with them when they're getting away from it all. Also for people who like to spend a lot of time (relatively speaking) cooking. I checked this out of my library because I thought it was for backpackers, and it isn't, hence the 3 stars. However, for the other reasons, I bought 2 copies, used, here on Amazon.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "San Francisco, July 3, 11:45 p.m.: Warm with summertime spirit and several pints of ale, I spontaneously invited several people over to my apartment for a Fourth of July BBQ.July 4, 10:45 a.m.: I awoke, panicked and queasy, remembering what I had done. In just three hours and 15 minutes, guests were supposed to be arriving for a party that I had not even begun to plan!Luckily, I owned a new copy of Robin Donovan's \"Campfire Cuisine.\" I hurried to the supermarket and bought the ingredients for Savory Cheese S'Mores, Chipotle Turkey Burgers, Creole Slaw, Grilled Peach and Arugula Salad and a bag of briquettes. In literally less time than I spent in line at the store, I had prepared a delicious and impressive meal. I just lit the bag of charcoal, threw the food on the grill, turned on Johnny Cash \"American V,\" and I had a fantastic urban holiday meal to share with my friends....simple, creative, delicious and sophisticated. Yeah, I'm sure that Robin Donovans's recipes are equally if not more delicious when cooked in the great outdoors. But why lose your parking space when you can adapt these wonderful recipes to cook at home?",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I used this book for the first time this past weekend. Everything was delicious and very easy to make : San Francisco Cioppino, Cheesy Biscuits one night, and pancakes made with the multipurpose baking mix the next morning. I am dying to try more recipes when we go again in three weeks.The book is sturdy and very easy to pack. I do have a problem reading the page numbers though. They are light orange and hard for us seniors to see. Also, I had trouble finding Cioppino in the index. I looked under \"C\" but it was under \"S\" for \"San Francisco\" Cioppino. I think it should be under both the \"C\" section, and the \"S\" section for those of us who cannot remember the \"San Francisco\" part. Same thing with the baking mix. I had to look under \"M\" for Multipurpose Baking Mix, instead of just \"B\" for baking mix.I like the fact that there are many vegetarian recipes. Although I do eat meat, I really like the fact that you can make delicious (sounding) vegy things very easily at the campsite. This wonderful book will always go with me when my husband and I head to the beautiful outdoors.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Campfire Cuisine is without a doubt one of the best cookbooks I've ever used. If you love good food as much as you love camping, you'll go nuts for the wealth of information on outdoor cooking that's packed into this stylish little book. And the recipes (clever, creative, delicious, and some of the easiest I've ever seen) have become standard favorites that I now make all the time, even in the luxury of the great indoors. In fact, almost all of the recipes come with simple \"Make it at Home\" adaptations for those of us who spend more time in the kitchen than around a campfire. My family is in love with the Chipotle Turkey Burgers (they're the only burgers I cook anymore) Creole Slaw, Fish with Curried Couscous, Potato and Fennel Packets, Maple-Glazed Yams, and the Magic Layer Pie-to name just a few. I'm not even all that outdoorsie and I absolutely LOVE this cookbook.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Campfire Cuisine is my new favorite cookbook. It offers a treasure trove of practical advice for cooking at a campsite, but is also packed with truly inspired, yet simple recipes that can be made just about anywhere. I've loved every dish I've tried so far. A few of my favorites are: Spicy Orange Chicken, Grilled Steak Tacos, Lemony Couscous Salad, and Cinnamon-Baked Bananas.I've tried quite a few books on camping cooking, but have found that most rely heavily on prepared food mixes or canned food products. Campfire Cuisine offers gourmet recipes that use fresh ingredients and yet really are easy enough to prepare at a campsite.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I asked Amazon to send me four copies of this delightful little cookbook, and those books have already moved on to camping friends. I cook well over the campfire but without the repetoire of recipes Campfire Cuisine contains. In the past, I got appreciation for my cooking because I was willing; from now on, I'll get even more because my food will be good! These recipes are tasty and easy. My wife and I have joked about throwing out all the rest of our cookbooks and relying on Campfire Cuisine--after installing a two-burner Coleman in our kitchen.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I loved this book! As someone who can barely cook top ramen without burning the house down, it was amazing for me to see how quick and simple it is to make a truly delicious meal. I don't even go camping all that often, but all of the recipes in this book are adaptable for your kitchen at home. Recently, I made the Orange-Herb Salmon, which I LOVED!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "cook 10 a fresh approach to the vegetarian kitchen",
        "description": "Photographer, designer, and passionate home cook Heidi Swanson presents 40 basic vegetarian recipes for breakfast, lunch, and dinner dishes, sides, desserts, and drinks, each accompanied by easy-to-read tables that show delicious, inventive ways to build on them.",
        "authors": "['Heidi Swanson']",
        "infoLink": "http://books.google.nl/books?id=hoUUAQAAMAAJ&dq=Cook+1.0:+A+Fresh+Approach+to+the+Vegetarian+Kitchen&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This review is long overdue. I am an omnivore, with a mostly omnivorous family. Imagine my surprise when, two years ago, my teenager announced one evening (after a visit to a lovely farm with adorable baby cows) that she was going to stop eating any land animals. Turns out, there is a word for that:pescatarian. Back then, I didn't know that, and being faced with the prospect of trying to cook healthy vegetarian meals for a developing teenager made me want to pull my hair out. I worried that I would either end up with a malnourished girl, or that the food I cooked would be so unpalatable that she wouldn't eat it. I also didn't want to have to cook one meal for her, and another for the rest of the family. If she would make this journey, then so would we. I tried various vegetarian books, only to find tofu-pushing, bland recipes that I had a hard time tempting my whole family with. Then my sweet sister came to my rescue, telling me that her friend Heidi wrote a little book I might like...and she mailed me Heidi's guide.I call it a guide because that is what we used it for in the beginning. Heidi takes the time to explain the ingredients, the basics of how to cook them, and advises on the utensils and other things needed. She scatters useful advice throughout - it isn't a book that I just pull out when I need a recipe. I actually sit down and read it for the extra encouragement I need to keep our family on-track. I have two other children, 6 and 8. They loved their hot dogs and hamburgers. I don't know any other children their age who now rave about risotto and mushroom pot pie! My husband is a Food and Beverage Director for a luxury resort. Sometimes, after hearing about the menus he puts together for his hotel, I feel a little intimidated about what I offer him at home. This is a true sign of the success of Heidi's book: my carnivorous, German husband, Mr. Foodie, LOVES these dishes. Yes, he still likes sausages, schnitzel, etc. But he will dig into the corn, coconut, and curry soup like there is no tomorrow...Now, being more sensitive to the other vegetarians in the world, I always bring a dish from Heidi's book when I attend parties or potlucks. For our first vegetarian Thanksgiving, we were invited to a friend's home. The prospect of dining on Tofurkey didn't seem appetizing, so we made and contributed the mushroom medley fritatta and the roasted sweet potatoes to the Thanksgiving Feast. My kids had to wrestle to get some of the food we brought onto their plates! We ended up bringing home empty food containers, and I noticed there was ALOT of leftover turkey...everybody there just couldn't get enough of our vegetarian dishes.The best part is the ease with which I can prepare all this food. I enjoy cooking - I actually collect cookbooks. So I can say from experience that Heidi has a great formula with the format of this book. She gives you the basics for the core of the dish, then she offers a chart of various ingredients you can add in order to make different dishes out of that core recipe. It really simplifies things for the reader, and the various ideas for ingredients really make a difference in preventing food-boredom with my children.Again, thank-you, Heidi, for a well-written, well-planned guide to vegetarian cooking. We are two years into the game now (I thought it would last 6 months) and my well-worn copy of Cook 1.0 doesn't even make it back into my cookbook collection; I keep it out on my counter for quick reference. And my little vegetarian? Her new lifestyle has NOT turned her into the wraith I feared...she is 5'9\" now, and a star on her school basketball and volleyball teams.",
                "review/helpfulness": "84/86",
                "num_reviews": 86
            },
            {
                "review/text": "As other reviewers have noted, I couldn't wait to try all of the recipes in this cookbook. I enjoy cooking, but lack any sort of invention in the kitchen; I'm awful at trying out new flavor combinations or \"winging it\" when it comes to expanding on a recipe. This is where Heidi's book excels: showing you how to build upon basic favorites to create new dishes. My favorite portion of this book is the \"Flavor Combinations\" page, which lists some tasty couplings that I, on my own, would not have had the foresight to pair (such as apples + fennel or strawberries + black pepper). I highly recommend this book to anyone who enjoys cooking but wishes they could be a bit more creative about it!",
                "review/helpfulness": "34/35",
                "num_reviews": 35
            },
            {
                "review/text": "This is the cook book for everyone. I am by no means a vegetarian, but every recipe I have tried has just danced on my taste buds. I highly recomend the Mushroom Pie. Just plain awesome! Also, the photography is very creative and unlike anything I have seen in a cookbook. LOVE IT!!!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I took a big gamble on this cookbook - I had a dinner party this weekend and decided to cook recipes out of Cook 1.0 without ever trying them out before. THE GAMBLE PAID OFF! So much so that I ended up having to fax my friends recipes out of the book since they enjoyed the food so much. I am not the savviest of cooks but the table format made things so easy for me. This is truly a book for a new generation of cooks! I am looking forward to trying out new recipes this weekend on my family; Drop Biscuits, Smoothies, Pot Pies - My family will love this!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "First of all I must disclose that it has been said that I don't/can't/shouldn't cook, and that the only thing I have consisently made with any success are 'reservations'. I was referred to Heidi's website and was happy to order Cook 1.0 on the principle of not giving up. I found myself reading it simply because it was a fun read and Heidi's unpretentious writing and presentation makes preparation exciting and not intimidating. I have since been preparing broken lasagna with cherry tomatoes, red pepper and lemon kabobs and roasting pine nuts with uncanny success! The unique format of Cook 1.0 is so easy to follow that I think Heidi has set a new standard for cookbooks. The conversion charts, suggested menu's for special occasions and tips are so helpful that it inspires you to try! The colors and photography in the book are nothing short of delightful and photos are not about table settings, dishware or center pieces but get this... about the food. Love this book!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I picked up on this book while browsing the internet. I am a home cooking maven but I was looking for something different. I'm not a vegetarian, but I find the cooking to be creative and flavorful. Heidi's charts are really easy to use, and her tips are helpful too. I love the varieties she gives you to choose from! It makes me want to try one in every flavor! My favorites are the Broken Lasagna with Cherry Tomatoes, the Chipotle Potatoe Pot Pie, and the Raspberry Tart. Making you hungry? These recipes are easy and fun -- they take no more than an hour, many taking less time than that.Give this book a try, it's well worth it! A great overall cooking experience.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Very clever layout and easy to understand recipes. The beautiful photos make a snap to imagine cooking these things yourself. Highly recommended!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "We have tried several recipes and love the simple approach and options.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "First off it should be mentioned that this is a very attractive cookbook with great photographs that inspire cooking. I've cooked a bunch of things out of this book and, as somebody who doesn't have time to attempt huge and complex recipes and never wants to fail, this book is perfect for me.The recipes are very diverse, from pancakes to stir fry. Most are quick (under 45 minutes certainly). They are straight-forward to prepare and yet have a creative twist that gives them personality. You'll most certainly find some favorites in Cook 1.0. Since they are easy to remember without looking at the book every time you go to the store, you will find these dishes in heavy rotation.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I opened this book and instantly wanted to start trying all the recipes at once. The bisquits are scrumptious, the soups are delicious and the flavors are just a bit more exotic than my everyday meals. The recipe layouts are easy to follow and the photos are inspiring. I recommend it for experienced cooks and beginners alike. And it is not just for the vegetarians!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "moosewood restaurant simple suppers fresh ideas for the weeknight table",
        "description": "The Moosewood Collective goes back to basics with Moosewood Restaurant Simple Suppers to deliver more than 175 fresh, imaginative, and quickly prepared dishes for the weeknight table that are also delicious and reliable. Whole grains. Fresh fruits and vegetables. Lean, nutrient-rich fish. We all know the virtues of a well-balanced diet-of choosing foods that nourish our bodies and respect the environment-but as the world around us gets busier and more complicated, we also know how difficult it can be to prepare a wholesome, satisfying supper. With an emphasis on healthful natural foods, Moosewood Restaurant has operated successfully for more than thirty years and has been acclaimed as a driving force in the world of creative vegetarian cuisine. Shortcut Chili. Creamy Lemon Pasta. Warm French Lentil Salad. Pine Nut-Crusted Fish. Mocha Sorbet. From soups and pastas made with just a few pantry essentials to crisp salads, stir-fries, sandwiches, and desserts, these easy-to-prepare recipes are brilliant as is. However, the folks at Moosewood realize that flexibility is the cornerstone of weeknight cooking, so you'll find clever ingredient substitutions, alternative cooking methods, and serving suggestions alongside the recipes in Simple Suppers-it all depends on what's in the fridge and what sounds appetizing at the moment. Make extra Fresh Tomato and Mozzarella Salad on Monday and toss leftovers with hot pasta for Tuesday's supper. No onions for Black Beans with Pickled Red Onions? Try the beans over rice with Quick Avocado and Corn Salsa instead. The 175-plus recipes in Moosewood Restaurant Simple Suppers are as flexible as they are flavorful-the perfect go-to for a quick, healthy meal any day of the week, any time of year.",
        "authors": "['Moosewood Collective']",
        "infoLink": "https://play.google.com/store/books/details?id=JayoUFGtm6IC&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I own all of the Moosewood books, and this one is already a favorite (along with Cooks at Home and Daily Specials). Simple Suppers reads like an updated version of Cooks at Home- the recipes are straightforward and easy to prepare, but original in the combinations of flavors and textures. Green Bean and White Bean Gratin contains green beans, pureed white beans and whole white beans layered with cheese and breadcrumbs for a filling winter meal. Navajo Stew combines roasted sweet potatoes with black beans and a quick blender tomato-chipotle sauce. Tortilla Melts are quick sandwiches of roasted mushrooms with pesto, tomatoes, and cheese. I made all of these in the past week and my husband and I both liked them a lot- good, unfussy food.My only quibble is that it would be nice if nutritional information had been included. Many of the recipes are decidedly not light as written, but could be lightened fairly easily.",
                "review/helpfulness": "74/76",
                "num_reviews": 76
            },
            {
                "review/text": "If you're looking for food that's healthy, tasty and easy to prepare, I don't think the Moosewood cookbooks can be beat. While I've only tried a couple of recipes from this new cookbook, they've both been good and simple to put together, and I'm looking forward to trying many more. I love to cook, and I love to try new dishes, but I'm also interested in staying slender and in not spending too much time in the kitchen: Moosewood achieves all of that for me. I especially appreciate their \"serving and menu ideas,\" in which they make suggestions for what you may want to serve with the current recipe to make a whole meal -- very nice for entertaining. If you don't own any Moosewood cookbooks, the \"Moosewood Restaurant Cooks at Home\" is probably the one to start with. With that one and this one together, however, you'd have a formidable collection of recipes. Enjoy!",
                "review/helpfulness": "58/61",
                "num_reviews": 61
            },
            {
                "review/text": "I love all of the Moosewood cookbooks; unfortunately I have to say that this one is my least favorite.Still, it gets four stars because all of the recipes are exactly as advertised: fresh and simple (mostly) vegetarian meals that you can throw together for a hungry family. They are also all delicious -- again, something you can count on with any Moosewood cookbook -- and provide a lot of variety in flavors, textures, and types of meals included. The authors also make suggestions for menus as well as including tips and ideas for parents, which is a plus.My complaints with this particular cookbook are mostly little petty things, like the fact that the photos of the Collective members and the hand-made, folksy artwork have been mostly replaced by glossy color photographs. Also, these are not complex, stunning culinary creations -- they are all *very* simple -- which of course is part of the charm of this book. You don't have to spend an hour or two on a meal with this cookbook; it is most definitely a \"weeknight\" sort of cookbook. While this is most excellent for beginning cooks, if you already are relatively experienced you don't really need a recipe for some of these things. Like the Poached Huevos Rancheros -- delicious, but do you really need a *recipe* for that?Despite my complaints, I still recommend this book, especially because it rounds out the rest of the Moosewood Restaurant collection by providing a simple, inviting set of recipes for the rushed cook.",
                "review/helpfulness": "36/44",
                "num_reviews": 44
            },
            {
                "review/text": "Thought I would love this book, as I've loved Deborah Madison's newest, Vegetarian Suppers. This book was a disappointment--lots of simple recipes, but nothing that sounded like hey, I've got to try that! You probably have recipes similar to these in the book if you have a few vegetarian cookbooks anyway. I brought this one back to the store (a rarity for me--I'm a cookbook fiend!).",
                "review/helpfulness": "20/33",
                "num_reviews": 33
            },
            {
                "review/text": "I borrowed this book from the library after reading, using, and loving two other Moosewood books. I ended up returning the book the same day. Many (majority) of the recipes used processed food items and were of the basic everyday throw your food together design. I love simple, good food recipes but this book was similar to the grocery store checkout line type. I would highly recommend the original Moosewood cookbook and the Low-Fat Moosewood cookbook but not this one as it lacks in originality and in using fresh, healthy ingredients.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            },
            {
                "review/text": "This cookbook is perfect for people like me who eat fish, grains and lots of veggies, but no other \"meats\".I love the way they make suggestions for side dishes to go with their recipes. (I'm not too creative, so this helps a LOT!)Fabulous table of contents, clear cooking instructions and delicious recipes.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I purchased the Moosewood Restaurant Simple Suppers cookbook for our daughter who is vegetarian, She prepared 5 of the recipes for us during the time she was home from college over winter break and we loved all of them. We were impressed that most of the ingredients were things we typically purchased and not difficult to find items. I am not vegetarian but I am going to order the book for myself for all the delicious healthy recipes,,..food lover in Iowa City",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I originally checked this cook book out of the public library and then I re-checked it out again and when they wouldn't let me have it the third time I figured it was time to just buy it. I also bought 3 extras to give for gifts because I liked it so much. As a cook, I want simple, quick, delicious and healthy meals for my family. This cookbook offers all that!This is a great cookbook for both the seasoned cook and the beginner. The recipes are interesting but very easy and quick to prepare. I also like the suggestion box at the bottom of each recipe that tells you what to serve with the recipe so that you aren't just serving random dishes together. Very user friendly and lot of fun to cook with!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "My first vegetarian cookbook when i was 15 was a Moosewood cookbook, and at the time i struggled to find the most unusual ingredients in central Maine (this was 1990 and tahini was almost impossible to find!!). I received this cookbook as a gift last Christmas and cannot stop trying new recipes! I have a zillion vegetarian cookbooks, and usually i end up with one or 2 favorites per cookbook before i move onto another new book. Not so with Simple Suppers!! There are so many recipes that I want to try, and every single one has come out delicious! It is rare for me to use a cookbook where i love every recipe i try, and where every recipe tastes different (a problem with early Moosewood- I can still tell when a recipe is from an old school Moosewood cookbook!)I agree with an earlier reviewer that a lot of these recipes are so simple, it seems like you shouldn't need a recipe... but I figure, if i haven't thought of it and it's that simple, I appreciate someone sharing it with me!This is also an excellent cookbook for anyone who always wishes they had time to cook healthy, \"from scratch\" meals every night after a long day at work!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I initially got this book for my boyfriend to learn how to cook with, and he's been enjoying it, but we both agree that the recipes are ultimately very bland. I typically suggest he double the spices, herbs, and other condiments used to flavor the dishes to start, and after cooking five different dinners with the suggested side dishes, I think our new standard is going to be to quadruple them. Perhaps the best example is the dinner I just finished cooking, the Szechuan Silken Tofu, which called for only 1/4 tsp. of Chinese garlic-chili sauce as flavoring, along with 1/2 tsp. soy sauce, 1 tsp. vinegar, and 1/4 tsp. sesame oil, if I recall correctly. All this, plus some cornstarch, dumped into a cup of water and cooked to make a \"sauce\" for 16 oz. of tofu. I increased the chili sauce to a tablespoon, and probably could have done two before I noticed some heat.This cookbook has a great premise, and I really like how there are suggested pairings of a side dish and desert for each dinner, but I don't like having to heavily modify things all the time.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "cooking light superfast suppers speedy solutions for dinner dilemmas",
        "description": "Introduces a selection of innovative recipes for supper dishes that use no more than ten ingredients and take less than twenty minutes to prepare, as well as a selection of slow-cooker dinners, quick and easy desserts, and other special meals.",
        "authors": "['Editors of Cooking Light Magazine']",
        "infoLink": "http://books.google.nl/books?id=JlFi6j8N4cMC&dq=Cooking+Light+Superfast+Suppers:+Speedy+Solutions+for+Dinner+Dilemmas&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "I'm a big fan of Cooking Light magazine and their cookbooks. However, I was disappointed when I bought this one. There are some really good recipes in this book but there are more that i'll never make. When I think of superfast suppers I think of good food that my family will enjoy eating. Most of the recipes in this book just don't fit that description. I would recommend any of their annual recipe books and especially The Complete Cooking Light Cookbook, I've made many dishes from that one and my family has loved all of them!",
                "review/helpfulness": "51/75",
                "num_reviews": 75
            },
            {
                "review/text": "I received this cookbook as a gift. This is the first cookbook that I've found in which the recipes are simple and quick enough to make after work without being a burden and the food is always delicious. I've probably made 30 of the dishes now and they have all been hits with my family. This is my favorite cookbook out of the 100 or so I have. I use it everyday.",
                "review/helpfulness": "73/73",
                "num_reviews": 73
            },
            {
                "review/text": "This cookbook tells you exactly what to make for dinner in 20 minutes. The menu includes an easy main dish and one or two exceptionally easy side dishes. It requires almost no thought.I pick something to make over breakfast, make a small shopping list, then take 20 minutes to make dinner when I get home from work.With twice the effort I could make slightly better food, but this book makes everything super-duper easy. It's healthier and easier than getting takeout.",
                "review/helpfulness": "61/62",
                "num_reviews": 62
            },
            {
                "review/text": "I LOVE this cookbook. The meals are tasty, yet simple and (of course) superfast! There's also plenty of opportunity to play around with the ingredients and make the dishes your own. Every recipe I've tried has been great so far. I HIGHLY recommend this one.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "With a newborn and a toddler running around, I'm constantly strapped for time. This book has been a solution for me. Each recipe I've tried has been easy to make, very tasty, and healthy too. I am going to begin purchasing this book for every baby shower I go to. It is a must for anyone who likes to cook, loves to eat, but no longer has time to do either...",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I LOVE this cookbook!!!!! It was a Christmas gift and ever since we've been having great dinners nearly every night. I don't even want to go out anymore. This book contains easy to make meals in under 30 minutes (with the exception of the chapter on crockpot cooking). What I love about this one is that it plans the entire menu for you, and gives you steps to follow to prepare 2-3 recipes at once. Meals are usually a protein and a side, and sometimes include salads, breads, veggies, etc. And the best part? They're very light.I've made probably 30-40% of the menus in this cookbook now, cooking them nearly every night. The only down side is the more expensive ingredients (sometimes) and quite frankly the time it takes to find and purchase all of the ingredients in the grocery store. I spend a lot more time in the produce aisle these days.Two favorite chapters are the section of meals for two people, and the \"20 ingredients\" chapter, where you keep 20 ingredeints on hand to make each of the 20 recipes. Favorite menus include peppered beef tenderloin with orange-herbed asparagus and crusty french rolls, pan-seared chicken in proscuitto-fig sauce with roasted green beans, caesar-style green salad, and whole grain rolls, chicken piccata with garlic-basil pasta and steamed green beans, and seared chicken with avocado and tortilla chips con queso... yum!!!!!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "this was one of the 1st cookbooks i bought, and i used it a lot then.cons:like many cooking light cookbooks, some recipes use prepackaged, precooked and/or processed foods. i found once i knew what i was doing a bit better i could substitute fresh ingredients where necessary. (examples: frozen cooked chicken, frozen mashed potatoes, commercial pesto, frozen beef stew, etc.) i originally purchased this & began cooking out of necessity, so it was o.k., but now i don't like it as much for this reason.there is a section of side dishes in the back of the book, but it doesn't contain the great majority which are dispersed along side most of the entrees. while convenient at the time, it makes finding them again a pain.the serving sizes are small!pros:the recipes are good, easy, and guide you through with a chronological supper plan, including serving suggestions.there's even a good french toast recipe, despite the \"supper\" title, rationalized by breakfast for supper. =Di am usually cooking for 2, and while this cookbook is not entirely geared for 2, it does have a nice little section for just that, and the other recipes are not overwhelmingly large.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book is wonderful. The meals have minimal ingredients and require minimal time to prepare and cook. Many times with meals like this they lack flavor. That is not a problem with these recipes. As a mom, I love the \"On Hand\" section. In this section they give you 20 ingredients to keep on hand. With these you can make 20 different meals. I really have enjoyed it.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I was a little let down with this book. Can't put my finger on it but usually I buy a new cookbook and mark about 30 different recipes I can't wait to try and there really wasn't anything here that moved me. Also, for the price and a large, color hardbound book you would expect pictures of everything and they are few and far between. I don't think its worth the money.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Since starting a new way of life on www.thedailyplate.com, a website that helps determine the amount of calories you need each day to get to the weight you want to be. I refer to this book several days a week because all the calories and nutrients are displayed on every recipe. Plus, I haven't found a recipe we didn't want to make again. Honestly, I'm sad I didn't cook this way years ago.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "nathalie duprees southern memories recipes and reminiscences",
        "description": "Offering an intimate, anecdotal, and informative look at Southern food, traditions, and lifestyles, a popular television chef presents an illustrated culinary tour of the South, with more than 150 delicious southern recipes. Winner of the James Beard Award. Reprint.",
        "authors": "['Nathalie Dupree']",
        "infoLink": "http://books.google.com/books?id=wjB5uWQgAcoC&dq=Nathalie+Dupree%27s+Southern+Memories:+Recipes+and+Reminiscences&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is my favorite cookbook ever--I think everyone should have one. Ms. Dupree packs this full of recipes that real people can and would want to make--I like to think of her as comman man's Martha Stewart. What makes this extra special are the wonderful stories and beautiful photographs that accompany the recipes. Even if you never lifted a pan, you'll have a great time looking through the book, although I dare anyone to read through it without wanting to immediately try at least something from it!",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "My mom has this cookbook and I pull it from the shelf every time I go home. The recipes are excellent and the anecdotes from Dupree & Co's lives regarding Southern food are delightful. It really does capture a certain warm and generous spirit in Southern cuisine, combining old favorites with new and interesting ideas in a way that still fits in with the whole milieu. (It might sound silly to say that the pictures are gorgeous, but they are, and add not just visual information to the book but a lot of, well, heart.) I'd recommend this to anyone.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is an beautiful book filled with gorgeous pictures. Actually, I worked on the book and I can tell you that all the recipes are tested three times. Unlike many other cookbooks, Nathalie's recipes work!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "lovely pictures and charming, southern smelling annotations. what a fun book to read! The Okra and Shrimp are killer!! Please buy this book, make the food and change some poor ol' yankee's way of thinking about okra!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I don't know Nathalie Dupree, but after reading and using the recipes in Southern Memories I feel like I do. This is the kind of cookin' with which I grew up; downhome, politically incorrect, and delicious. After fixin' one of the recipes for my family, my husband remarked that he \"knew if I just kept tryin I could learn to cook like my Mama\". There is no higher praise for a Southerner from a Southerner!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is one of my all time favorite cookbooks. Amazing food! Love so many of these recipes--don't miss the tomato basil roasted red pepper soup. It is one of my favorite foods ever!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "new junior cookbook",
        "description": "An all-new edition of the perfect kids' cookbook-now more fun than ever! Written and designed to appeal to kids ages 5 to 12, this all-new edition of the Better Homes and Gardens New Junior CookBook features 65 brand-new recipes that are simple to make and a blast to eat. Each recipe includes a photo of the dish and unique and lively illustrations of characters that tell a story to complement the dish. All the recipes here are easy-to-follow and packed with helpful hints and fun ways for kids to put their own spin on them. With lots of easy-to-understand nutrition information, it's a great way to teach kids about healthy eating while getting them interested in cooking. 65 recipes include hearty breakfasts, lunches, and dinners as well as healthy snacks and treats Fun, engaging, full-color illustrations bring each recipe to life and grab kids' attention Special features cover cooking basics, kitchen safety, menu planning, basic nutrition information, and guidance on reading and understanding food labels Teach your kids how to eat right and help out in the kitchen with the Better Homes and Gardens New Junior CookBook. It's the perfect way to make it rewarding for the whole family.",
        "authors": "['Better Homes & Gardens']",
        "infoLink": "http://books.google.com/books?id=mW1GpwAACAAJ&dq=New+Junior+Cookbook&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "I purchased this cookbook for my five year old daughter for Christmas so that she could become a bigger participant in the cooking process. She already helps me make dinner most nights but I wanted her to have her own cookbook so that once a week she could pick our dinner menu, help me do the shopping, and prepare the meal (with supervision). My hope is that she can form a plan and see it through to a finished meal, all the while learning about nutrition and balanced foods. I was so excited when the box with the book arrived, but that excitement quickly turned to revulsion when I saw that most of the recipes had more than 15 grams of fat per serving and they were all the things people seem to think that kids want to eat. My daughter may only be five, but she enjoys vegetables and will eat more than chicken nuggets and hamburgers. I was looking for a teaching tool, and instead I got a cookbook that wants to undo all of the work I have done to ensure that my child eats a balanced diet full of vegetables, lean meats, and lots of flavor.",
                "review/helpfulness": "155/175",
                "num_reviews": 175
            },
            {
                "review/text": "I picked up this cookbook in the hopes that I could teach my 7-year-old some basics about cooking that would last him well into his life. (And that it would hopefully prepare him for cooking in his single life, and possibly even encourage him to cook for his wife when he gets married someday!) I loved the bright graphics and beautiful pictures of the recipes, and the easy-to-follow format was great for my son. There was a lot of helpful information included regarding cooking basics, planning a menu, setting a table, how to eat healthy, reading food labels, and great pictures of different types of equipment used for cooking.Some of the recipes that we enjoyed making together included Eggceptional Breakfast Bake, Tom Thumb's Tacos, Tangled Twisters, Chicken Dippin' Sticks, and Chocolate Pudding Bottoms Up Cake. He was really proud to be able to make something for the family to eat, and I thought he learned good lessons about shopping, food preparation, and clean-up. This is a great book to share with your kids! Enjoy!",
                "review/helpfulness": "170/172",
                "num_reviews": 172
            },
            {
                "review/text": "We stumbled upon this book in the library and didn't want to bring it back. My 9 year old daughter has made several of the recipes completely on her own. The delicious results have been enjoyed by the entire family. Most recipes are quite nutritious with nutrition facts per serving accompanying each recipe. The &quot;Groovie Smoothies&quot; were truly groovy. With the variety of recipes contained in this book, there is something for everyone here. Great layout too.",
                "review/helpfulness": "121/122",
                "num_reviews": 122
            },
            {
                "review/text": "I purchased this book for my son who had expressed an interest in cooking.This is a great beginner book that lies flat on the table/counter ... you don't need 4 pair of hands to hold the book down (which ultimately might break the binding of the book).The recipies are easy to read and sorted in a good manner.We've even pulled a new 'favorite' recipe for Macaroni and Cheese from this book. Anytime we want homemade M&C;, we dig out my this book!My son .... we'll he's headed off to a Culinary Arts school.Buy this book and you'll eat well. =-)",
                "review/helpfulness": "81/81",
                "num_reviews": 81
            },
            {
                "review/text": "This book is fantastic for the younger set. The recipes are very clear, and they are good. The book starts out with breakfast recipes, serving up speciality pancakes, and much more. The book also has a great deal of main dish recipes that the whole family can enjoy. I like this book because it chooses recipes that are simple, but yet they are not too simple. This book is perfect for the younger person that has done some cooking and is looking to do more. The book also contains extra information regarding how to do certain things like cutting up vegetables, how to use certain appliances, and much more. This is definately a worthwhile book to add to a growing chef's library.",
                "review/helpfulness": "60/61",
                "num_reviews": 61
            },
            {
                "review/text": "My eight year old can make entire dishes all on her own -- from start to finish -- from this book. She is so proud when she does it! Step by step instructions are accurate and complete. Dishes taste good, too. I am recommending this book to all of my friends.",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "The classic easy-to-use and pantry-friendly Better Homes and Garden Cookbook is pretty much in every kitchen in America and chances are, it's already in yours too. If so, then then there's nothing in this obnoxiously-colored cookbook for kids that you couldn't find in either the adult BH & H cookbook or a back issue of Family Circle. With a few exceptions, (most notably the breakfast pizza and the Hula Stir Fry) it's all extremly standard fare. The only thing that sets it apart is the crazy fonts and colors so obnoxious that I had to wait ten minutes between reading it and writing this review so I could see straight again. I mean, are you really in need of another chicken nugget recipe? Isn't there anything more interesting they could come up with? And it isn't written to make the cooking any easier for kids--they might as well grab your adult copy and save their vision.If you're looking for a kid's cookbook that's full of good projects that will appeal to your children, I recommend the Everything Kid's Cookbook which has a black on white format, crossword puzzles and word finds for the older kids, and easy to follow instructions along with five really terrific projects that the kids can whip up for play, like bubbles and play dough. Mom and Me by Annabel Karmel is also a much, much better selection, with easy to follow illustrated directions. This is a suped-up version of standard fare you'd be better off skipping.",
                "review/helpfulness": "21/34",
                "num_reviews": 34
            },
            {
                "review/text": "Book Contents and Opinion/Review:~Book CONTENTS:Basics - Parental info, measuring, lingo, kitchen tools, food safety, manners, label factsBreakfast - Pancakes, French Toast, Cinnamon Rolls, Caramelly Apple Muffins, Smoothies, Scrambled Eggs and Hash Brown Pizza, Ham and Egg Sandwich, Breakfast CookiesLunch - Tacos, Grilled Cheese Sandwich, Roast Beef Wrap, Pizza Turnover, Submarine Sandwich, Sloppy Jos&eacute;s, Gold Nugget Chowder, Mac and Cheese, SaladSnacks - Caramel Corn, Chili Cheese Popcorn, Cracker Snack Mixes, Quesadillas, Ranch Dip, Bread Spreads, Peanut Butter Cereal Bars, Melon-Berry Popsicles, Fruit Cups, Strawberry Fruit Dip, Fruit and Cake SkewersDinner - Hamburgers, Crinkly Fries, Hot Roast Beef Sandwich, Lasagna, Tortellini Alfredo, Pizza, Chili, Chicken Stir-Fry, Chicken Strips, Fajitas, Ham Balls, Baked Potato Toppers, Veggie ToppersDessert - Monster Cookies, Berry Turnovers, Cheesecake, Chocolate S'more Dessert, Peanut Butter Cookie Pizzas, Ice Cream SandwichesCelebrate - Candy-coated Snack Mix, Candy Cups, Brownies, Popcorn Cake, Hot Fudge Sauce, Snowman Cookies, Sugar Cookie Cutouts, CupcakesIndexMetric Information~Opinion PROS:Sturdy binding, and can be propped up due to the spiral held pages.Pages can sort-of be wiped off... a little love inside a cookbook just proves it gets used. :)Very colorful and bright. The graphics are clever and fit the recipe.Ingredient and Utensil needs are listed in easy-to-read fashion.Recipe time length from Start to Finish and number of servings details.Each recipe includes a \"Serve with...\" balloon.Nutrition Facts per serving with exchange values listed.Index is well-planned, with easy reference.Metric information is basic and straight-forward with charts and alternate international ingredient names.~Opinion CONS:The recipe titles are in really funky fonts making it difficult to read.Most of the recipes include some form of sugar or bread.Some of the \"Serve with...\" balloons suggest prepared foods such as bacon strips and pasta salad. Too bad these aren't in the cookbook.Many of the recipes include ingredients not commonly found in our kitchen, such as miniature phyllo dough shells, diced pimiento, angel food cake, refrigerated cooked beef roast au jus, refrigerated three-cheese tortellini, etc.The Snacks aren't exactly a quick-fix. Some take only 10 minutes, but most take 20 minutes or much longer. (None of the recipes take into account clean-up time.)Most of the recipes are not budget-conscious, do not use fresh ingredients, or request the use of pre-packaged grocery store items. Examples: \"purchase baked cupcakes\" \"cook one 16-ounce package frozen loose-pack vegetables\" \"package frozen cinnamon sweet-roll dough or frozen orange sweet-roll dough\" etc.Sugar is not listed in the Nutrition Facts. This seems odd as Carbohydrates are listed with total fat and saturated fat. Even grams of fiber gets a listing.~Final OPINION:While there is some useful information for beginning chefs and the pages are enticing, over-all, I'm just not very impressed. I expected much more as this cookbook comes from Better Homes and Gardens. I still use my red & white checkered cookbook from 25 years ago. It is a kitchen staple.My expectations included simplified recipes from the BH&G; standard cookbook - simple & fresh ingredients using basic household items, low fat & low sugar recipes, and maybe even some short-cuts or tricks of the trade.It appears my expectations were way too high.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "From Better Homes and Gardens, I expected a more basic approach to cooking. This book is so busy with garish cartoons and unreadable fonts that the recipes themselves get lost. Not all kids are video game junkies who require constant visual stimulation. I gave the book 2 stars because, as promised, the recipes themselves appear to be good.",
                "review/helpfulness": "14/23",
                "num_reviews": 23
            },
            {
                "review/text": "I got this cook book for my 8 year old daughter who loves helping in the kitchen. We were really disappointed to see how unhealthy the recipes were and loaded with candy, fat, and sugar. Imagine making a popcorn cake with 1.5 C of corn syrup, 1.5 C sugar, 1.5 C. of M&M's and 1/3 C. of unpopped popcorn - wait, that is not all, add in a jar of marshmallow creme. First of all, I don't know what possessed me to make this recipe, secondly, it was gooey and syrupy sweet to the point of making us nauseated. Pretty apparent there was no test kitchen trying out this recipe. Most all of the desserts follow suit and are sickeningly sweet and loaded with candy. Most everything else in the cookbook is full of processed meats and cheeses. Recipes are the typical burger, fries, sub sandwiches and meatballs. If you are cool with thinking children's food is what you find on children's menus in restaurants, you might just like this one. Check out \"Children's Quick and Easy Cook Book\" by Angela Wilkes if you'd like a quality kid's cook book that has real food recipes, great instructions and photos, and is a healthier alternative.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            }
        ]
    },
    {
        "Title": "the saucy vegetarian",
        "description": "With this guide, learn the secrets of making either hot or cold no-cook sauces, from curried to Italian style, sweet or spicy, smooth or chunky, that will make any meal out of the ordinary, more nutritious and mouthwatering.",
        "authors": "['Joanne Stepaniak']",
        "infoLink": "http://books.google.com/books?id=wiE-AQAAIAAJ&dq=The+Saucy+Vegetarian&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have a friend who swears that the sauce makes the meal. It used to be that the mere word \"sauce\" gave me pause, conjuring up images of corn starch, heavy, rich ingredients, and standing in front of a hot stove stirring. Erase those images from your mind and imagine a whole book of entirely vegan sauce and dressing recipes that you can make in a blender. That means no cooking and literally seconds to a better meal. A few recipes do call for toasted nuts or roasted garlic, but those can easily be done ahead of time, and believe me, that simple extra step is well worth it. The vast majority of recipes simply call for dumping everything into the blender and flipping the switch. With the help of this book I turned out a dinner of pasta with Walnut Pesto and green salad with Sweet Basil Vinaigrette in under 30 minutes. Even my omnivorous guests wholeheartedly approved. Included are sections on planning vegetarian meals and combining and correcting flavors. Recipe chapters are: Vinaigrette Sauces &amp; Dressings; Nut &amp; seed Based Sauces &amp; Dressings; Tomato, Bean &amp; Vegetable Based Sauces &amp; Dressings; and Creamy Tofu Sauces &amp; Dressings. A bonus with each recipe is a list of suggestions for each using each sauce; for example, you can use the Green Ecstasy Dressing on pasta with asparagus and carrots, on shredded daikon radish with Bibb lettuce or on sliced, ripe tomatoes. This cookbook is my current favorite!",
                "review/helpfulness": "70/70",
                "num_reviews": 70
            },
            {
                "review/text": "I have several shelves full of vegan and vegan-friendly cookbooks. The Saucy Vegetarian is one of my favorites, not just for the delicious 100% vegan recipes, but for the creativity it inspires. The recipes generally involve processing about 6 to 8 no-cook (with occasional stove-top roasting) ingredients in the blender, and in some cases a food processor. Using this simple technique, I've made many awesome sauces and dressings, both Jo Stepaniak's recipes, and variations based on her recipes. A couple of ingredient substitutions I make that work well are 1 tablespoon chopped onion for each teaspoon powdered onion, and 1 teaspoon maple syrup for each teaspoon sugar. Unlike Jo's earlier works, some of these recipes call for sugar rather than a more natural, lower glycemic index sweetener. Fortunately, this isn't a problem as the maple syrup works fine, and there is a section listing recommended sweeteners and describing how they work in recipes.My favorite recipes from the book include:* Instant Alfredo Sauce - Very cheesy and smooth. And you would never know it contains only 13 calories per tablespoon and 0 grams of fat!* Walnut Pesto Sauce - Delicious and very quick to make. No need to chop the walnuts first, just pile them high in the measuring cup. Works well with 1 to 2 teaspoons of Bragg Liquid Aminos (similar to soy sauce) in lieu of the salt and water.* Carrot-Dill Sauce - I add a secret ingredient of celery seed and cut down on the water a bit for a thicker sauce. Delicious over rice and vegetables.* Tahini, Tamari & Onion Dressing - I was afraid when I first made this raw onion dressing it would be overpowering, but the tahini and olive oil combine with the onion to make a mild oniony dressing that won't make your eyes tear. I always double this one and cut down on the water a bit to thicken it. I imagine that with mint or dill, it would make a great falafel sauce.* Herb and Onion Vinaigrette - Makes a restaurant-quality house dressing. I double this one and substitute an equal quantity maple syrup for the sugar. Works great with balsamic vinegar in lieu of the wine vinegar.* Sunflower Seed Dressing - This makes an interesting ranch-style salad dressing or dipping sauce. But it excels as a sandwich spread or pita bread filling with vegetables.Of the dozen or so recipes I've tried in the book, there's only one I didn't like--the Miso Citrus Sauce. Tasted like salty orange juice.Two helpful features with each recipe are the nutrient listing (calories, protein, fat, and carbohydrates) and the listing of foods in the margin to try the sauce on. But, this cookbook contains an amazingly helpful feature rarely found in cookbooks: In addition to merely giving you her recipes, Jo teaches you how to put together the six basic tastes (sweet, salty, bitter, sour, pungent and astringent) to develop recipes of your own. She goes into a lot of detail about these tastes, which raw ingredients to use, styles of no-cook sauces and dressings, and even how to correct flavors if you don't like the concoction you invented. She also provides information on planning vegetarian menus, along with sample menus. Whether you're a novice or experienced vegetarian or vegan, it's worth reading the nearly 40-page educational section to get the creative juices flowing. Then follow Jo's advice to be innovative and consider her recipes as a starting point, altering as you see fit. That's what I do, and receive a lot of compliments in the kitchen. :-)",
                "review/helpfulness": "53/54",
                "num_reviews": 54
            },
            {
                "review/text": "This book certainly made my creative juices start flowing! I have never been comfortable with substitutions in the kitchen, and I found Stepaniak's description of viscosity, texture, taste and energetics,in addition to her listing thickening ingredients and how to adjust the flavors,really incredibly helpful. Her chart for improvising sauces and dressings has made me courageous and actually excited about exploring new options in the kitchen. This book is full of fresh ideas, and I've been a vegan for over 20 years, but never was completely happy without a recipe; I've always been reluctant to make things unless I had every ingredient listed. Now I have a greater insight into substitutions. I think experienced cooks will also profit from the description of the subleties of flavors. I highly recommend this book!",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "This book is great! Lots of sauces and dressings that you can whip up in minutes in your blender. I just made the Thousand Island dressing and it tastes better than the bottled stuff I used to consume as a child. And it is dairy-free! The No-Cook BBQ Sauce is fantastic and yummy. Joanne always includes the nutritional info for each recipe too. Everything is vegan, too! :0)",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "The Saucy Vegetarian is the most versatile cookbook I own, which is saying a lot, considering I'm a cookbookaholic! This book is idea for beginning veggies, committed vegans and even omnivores. Joanne presents a simple and healthy way to approach meal planning. Cook a grain, bean and a vegetable and serve with one of her delicious sauces! Plus, plenty of stuff to top salad, baked potatoes, breads, etc. I also like that Joanne gives suggestions for what food to pair with a sauce--it's kind of like getting several bonus recipes in one. Some of my favorite recipes include Skordalia, Green Olive and Nori sauce, the pestos and Parisian Vinagrette. Every creative cook needs this book in their collection!",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Lots and lots of great recipes in here - in most cases two per page so it's really packed. One thing I really like about this cookbook is that with each sause there are suggestions for what to try it on which is great for me since sometimes I page through and think yum what a great sounding sauce now what can I build around it for dinner 9'cause you can't just each a bowl of sauce :) The vinegrette dressings are excellent (e.g. tamari ginger dipping sauce, different balsamic vinegar dressings, sesame oragne dressing) but even more I love the nut and seed based dressings like the herberd tahini sauce, different types of pestos. The herb dressings and bean sauces are great too. Nothing to complain about - a great way to add new zest to some old favorites. Sometimes when I get home from work I just stream up some rice and vegetables and drizzle a little sauce that I may have made the day before on there - voila a great quick yummy dinner",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I'm a vegan with a gluten intolerance who hates to cook. Rather than starve to death, I bought The Saucy Vegetarian! This book allows me to create really great-tasting meals without slaving over the stove. The sauces require no cooking, so they are ready in less than five minutes. I prepare a grain, like quinoa or brown rice, a protein like beans or tofu, and one of the sauces in the book, mix them together, and voila! I have a yummy, healthy, meal! Many of the sauces in the book make good salad dressings, too. In the margins of the book are suggestions of what each sauce might taste good with. I use the suggestions as a springboard to try all kinds of combinations. If you own a wire whisk and a bowl, this book is for you!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Vegetarian cooks who want to spice up their results using quick, no-cook sauces and dressings will find this an exceptional guide which lacks photos but doesn't need them. From a Maple-Dijon Salad Dressing to a fiery Hot Mustard Plum Dip, this includes a wide range of winners.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have used this cookbook for years, and have found it delightful. Many other veggie cookbooks offer run-of-the-mill fare - we've all seen chili, tabbouli, hummus, and macaroni-and-cheese more times than we can count. In contrast, this cookbook offers something new and delicious on nearly every page. The recipes are creative and unique, and very easy to make. Generally, I can turn out a meal in the time it takes to boil a pot of rice. The author has good taste - her flavour combinations are reliably tasty, for carnivore and vegetarian alike.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The Saucy Vegetarian presents a rich repertoire of recipes of no-cook sauces and dressings that will enhance any vegetarian menu. Food expert Joanne Stepaniak offers a tremendous collection of vinaigrette sauces and dressings, tomato, bean and vegetable based sauces and dressings, as well as creamy tofu sauces and dressings. Now the time-pressed kitchen cook can simply begin with a grain or pasta, add vegetables, beans or other vegetarian meat substitutes, and top it off with one of these no-cook sauces or dressings. From Sesame-Mustard Sauce, Cashew Sour Cream Sauce, and Walnut Pesto, to Tomato Ginger Dressing, Cucumber-Parsley Dressing, and Tunisian Cream Sauce, The Saucy Vegetarian will become a welcome and often utilized reference for novice cooks and experienced chefs alike when seeking to prepare tasty vegetarian dishes for their family and friends.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "diva cooking unashamedly glamorous party food",
        "description": "Every cook aspires to be a culinary diva who knows that glamorous, delicious food is easy. All you need are some basic equipment and a few professional secrets and you'll be creating decadent dishes in no time. The authors of Diva Cooking divulge these culinary secrets through their diva-dos and diva-don'ts lists that are part of every recipe. They include information on how to adapt recipes to include the freshest seasonal ingredients, how to create beautiful garnishes and, most importantly, how to save time doing it. Whether you want to serve tapas-style dishes or a five-course meal, this book is essential for anyone who loves to entertain. Dinners of Seared Duck Breast with Balsamic Vinegar, Rosemary and Shallot Sauce followed by Sweet Goat's Cheese, Orange and Almond Tart await you.",
        "authors": "['Victoria Blashford-Snell']",
        "infoLink": "http://books.google.nl/books?id=JAnZGwAACAAJ&dq=Diva+Cooking:+Unashamedly+Glamorous+Party+Food&hl=&source=gbs_api",
        "categories": "['Cookery']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I stumbled on this cookbook truly by accident, having to buy one book for a commitment to a cooking book club--and what an amazing suprise! I love to cook gourmet food--especially recipes fit into my busy schedule as a mom and author of The Mom Book (www.momcentral.com) and often almost always in charge of appetizers for my various women group gatherings. I always rate recipes from 1-5, and anything below a 4 never gets cooked again. I have now worked my way through about 17 recipes from the Diva Cookbook, and remarkably they are all 5's--when most cookbooks fall into the 3 star rating of recipes. I have been raving about this all of my friends, who have been impressed by the complex tastes and sophisticated presentations of these delicious appetizers (while they have not taken me more than a half-hour to make at home)--so I figured it was high time to share my complete enthusiasm for this book on Amazon[.com] to pass the word along. Outside of The Splendid Table, this is the very best cookbook I own--all I can say is: Wow!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I received this book before the holidays as a gift and found it great for preparing glamorous holiday food. The recipes were not too complex, yet my friends and family were very impressed with the tasty results. Besides great tasting recipes, I think one of the best aspects is presentation. The smoked salmon in filo dough appetizer looked very elegant at New Year and went great with bubbly. The tips (called Diva dos and don'ts) are also quite helpful in avoiding problems.I liked this book so much I bought a couple copies as gifts for friends.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Jennifer and Victoria do a wonderful job with walking you through each dish so it looks and tastes as wonderful as the pictures throughout the book. I use the book every weekend trying new dishes for my guest - All have been fantastic! This is a must buy for anyone who entertains.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "When I first got this cookbook, I salivated over all the great recipes in it. My fiancee, who also loves to cook, did the same. We have since tried a handful of the recipes, and they have all been fabulous! We recently hosted a dinner party which included 4 recipes from the book -- everyone RAVED! And lots of the recipes can be (at least partially) made ahead, which allows the host/hostess more time to relax and socialize with guests. I would not hesitate to recommend this book for anyone who loves to have people over for dinner. You will be worshipped.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This cookbook is perfect for entertaining. I have used these recipes time and time again to rave reviews. I had an Oscar Party last night and the food was a huge hit! I would recommend it to anyone that enjoys cooking and entertaining. I hope you enjoy it as much as I have...happy cooking!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "1000 vegetarian recipes from around the world",
        "description": "Bring the cuisines of over 200 countries into your home! Now you can enjoy the delicious and exotic cuisines of the world, all without leaving the comfort of your home! Not only is this book packed with over 1,000 easy-to-prepare ideas for appetizers, salads, soups, sauces, entrees, and desserts, the recipes are all vegetarian! Studies have shown that a plant-based diet can help reduce the risk of many preventable diseases, and can actually allow you to eat MORE without gaining as much weight. So everything you find will be good to your taste buds AND good for your health! What more could you ask for? How about handy guides on HOW to cook healthy meals, how to create a meal plan, where to shop for the best and cheapest ingredients, and the health benefits of over 100 fruits, vegetables, and spices? This book has ALL that and more! PLUS 100+ juices, smoothies, and herbal teas! Raw Foods Recipes! A Comprehensive Nutritional Guide!",
        "authors": "['Supreme Design, LLC']",
        "infoLink": "http://books.google.com/books?id=AuONZwEACAAJ&dq=1000+Vegetarian+Recipes+From+Around+the+World&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "this book has a lot to choose from. very well put together with calorie counts, time needed to prepare, and plenty of pictures.i like the fact that all cultures are represented in the book. pages are easy to wipe off too. happy cooking!",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "My husband and I are vegetarians who love variety! We prefer cooking dishes from scratch in less than 1 hour. This book fits our constraints perfectly. Without it, we would be lost in the kitchen.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "due to the fact that many of my friends that see the book want it immediately, and, for those that live out of country I usually oblige.First of all this is not just a cookbook for vegetarians since almost all the recepies can be used as fabulous, new and tasty side dishes. The author had to use a lot of creativity in these recepies since in being able to present a dish that not only looks tasteful but also is considered as a main dish for the vegetarians in your crowd. There are some pastry and filo dough items that are quite unique .....The presentation of this book as well is fabulous. ALL and I mean ALL the recepies take up only one page, each page has a presentation picture, and, for any slightly more complicated recepies small thumbnails showing the prep steps. In colour of course ..... Also, each recepie gives a carb, calorie, sugar etc breakdown, an estimated time for completion of the dish and a small graphic as to how many steps are required to prepare the dish .... The instrcutions are clear cut and concise ...Since this is an 'international' edition of, I guess, a USA book the recepies are very very varied and include dishes from both the Far and Middle East, from Thailand, Latin America etc etc ..... This certainly is a MUST HAVE book from the expert chef to even the most novice of cooks today ....",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book has a lot of promise, and I really want to like it. I'll start with what's good:The book is organized fabulously. Each recipe is on its own page, with a large color photo, a few step-by-step photos, nutrition information, and a difficulty gage. The recipes are organized into general sections, like Soups, Pasta & Rice, Outdoor Cooking, etc., though there's no table of contents or index. There are a lot of recipes that look and sound delicious, and make you want to jump right in and start cooking.Once I started cooking out of it, though, my thoughts changed a bit. I'm a beginning cook who doesn't have a lot of extra cash (college student). One major problem with the book that I began to notice right off the bat is that the vast majority of recipes are very \"gourmet\", whith long ingredient lists and uncommon ingredients. Several of the pasta recipes call for fresh pasta, there's liberal use of fresh herbs and gourmet mushrooms, and a lot of them simply don't seem to be aimed at the quick-and-easy set (which is fine, if that's what you want).The real clincher for me though was that none of the recipes really turned out that well for me. I skip back and forth between this book and another (Fanny Farmer) for recipe ideas, and even for nearly identical dishes the ones from this book took longer to make and turned out bland and unappetizing. There were several that I didn't have any comparison for that ended up being a disaster.Of course, I haven't tried all of the recipes here, so there could be some real gems I haven't come across (or that I screwed up in the process). I hope that's the case, because I'm going to keep trying it every so often amongst my other books. But as of right now, I wouldn't recommend this over any other vegetarian cookbook. While it's nice to look at and get inspired by, the time, effort, and taste just hasn't been worth it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is MY FAVORITE and most-used cookbook. I bought it for beans at Ross thinking it was probably one of those useless coffee table books, but after thumbing through it, I decided to give it a chance. I'm SO GLAD I did!! Two of my (non-vegetarian) friends went and bought it after I made them meals from it.The depth, breadth, and diversity of recipes is astounding. Lots of Mediterranean and Indian recipes. (thank goodness!) Beautiful photos, easy directions, and delicious meals. This thing even tells you how to make paneer (Indian fresh cheese). I made it and it was easy, scrumptious, and I must admit... fun!You WILL NOT find a better cookbook. I can't understand why it's out of print. That's just crazy. Note: this thing is huge like the Oxford dictionary, and every bit as useful.Happy Eating!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "For example, we made the Vegetable Jambalaya (p. 255) last week for snowed-in football watching. Went along with the Fish Tacos. It was delicious, and a great alternative to chili.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "As a hesitant omnivore, I picked up this cookbook on sale after paging through the recipes and seeing many different dishes with few recipes involving tofu or beans. It was literally the wisest purchase I have ever made; it made my transition to vegetarianism a smooth and thrilling one. I could not cook/live without this cookbook.The pictures are excellent, and the recipes are varied: Indian Hyderabad pickles to stellar Italian pasta dishes. Over the past year, I've tried the appetizers, breads, pasta dishes, salads and met tasty success with all of them.This cookbook is more of an introduction to than a tutorial in international cooking. Some of the recipes are a bit westernized, and the dishes suffer minor compromise. The desserts are a little too health-conscious for my taste, but the rest of the book makes up for it. Despite these drawbacks, I would recommend this cookbook to anyone--vegetarian or not, beginner to advanced cook.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Full color photo of every recipe, many with step-by-step photos, imperial & American measurements. Everything from soup to desserts. Tired of the same old thing? This is one-stop vegetarian shopping!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I bought this cookbook because my kids decided to become vegetarians, and my repetoire was limited. I have found the recipes very easy to follow. There are great pictures for many of the steps. Most recipes cook up very quickly. So far they have been pretty bland, so be prepared to add extra spices. I like the international flavor of the book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I'm not vegetarian, but I love veggies, rice and pastas, and this cookbook has plenty to serve. Each page has great color photos (usually 4) showing the different steps to cooking the meal & the final product. Each recipe also has nutritional info as well as ETAs for cooking & prep time. There are also plenty of cooking tips. My favorite recipes are the soups. We esp LOVE rthe exotic mushroom soup.Just to give you an idea of recipes: orange & pumpkin soup, zucchini & thyme fritters, eggplant timbale, white raddishh curry, walnut & olive pasta, spinich & ricotta gnocchi, bean curd w/bell peppers, cheese & potato strudel, turkish kabobs, coconut apples, special peach melba, cool cucumber salad, saffron-flavored potatoes, mango ice cream, and sweet fruit wontons. hungry yet?My onlu issue is that the book's binding is week and my book is starting to fall apart. I guess I use it too much.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the chicago diner cookbook",
        "description": "\"The second collection of recipes from The Chicago Diner, the city's premier vegetarian restaurant\"--",
        "authors": "['Jo A. Kaucher']",
        "infoLink": "http://books.google.com/books?id=AAqinAEACAAJ&dq=The+Chicago+Diner+Cookbook&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As an old Chicago Diner fan, I could not wait for this book to come out. Since I purchased it, have been using it for so many dishes at home.. Everything is so healthy and easy to make. Try the tofu cheesecake, cream soups (made with soy milk), Ex-Benedict, Tofu roll, Chocolate mousse. Even my kids approve of the dishes. They still have not figured out that they are eating tofu. Jo Kaucher translated most of the comfort foods you remember from your childhood into healthy vegan recipes -- that taste great! Thank you...",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "If you live in Chicago &amp; want to eat well..I mean healthy &amp; tasty ..their are not that many choices..the best is usually buying some organic veggies at Whole Foods &amp; cooking at home.Then there is the Chicago Diner...it feels like home...atmosphere....service staff...been going their for 20 years.The food is comforting, filling, &amp; quite tasty...prices reasonable....allways leave their feeling fullfilled.Weekend biscuits &amp; gravy &amp; Diner Hash...lunctime Sloppy Jo or Seitanic Caeser salad ..even Thanksgiving Pupmin Ravioli &amp; Diner Wellington. Desserts are fantastic &amp; all VEGAN!This book gives me so many of the staples I have been enjoying for years...Diner rosemary gravy...Dairy Free Cocoa Mousse.....Scarmbled Tofu..... Just great...thank you Diner!",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "What initially drew me to this cookbook was the Chocolate Cake recipe that I found on the net. And yes, it is possibly the best vegan chocolate cake you'll ever have.But that's not all this book is about. A good amount of tasty, easy to make recipes are also in here. I appreciated the glossary at the end of the book that takes the time to explain what some of the more obscure ingredients are, and where to find them.Overall, there are more good recipes here than bad, and I would recommend it to anyone in search of tasty vegetarian recipes.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "One of the things I was impressed with at the Diner was the (vegan) German Chocolate Cake. The recipe in this book makes it easy to prepare the same dish at home. It's incredible! The recipes are easy to prepare and the ingredients are not exotic or hard-to-find as long as you have a health food store nearby. However, some of the meals require lots of time in the kitchen and require a little planning (as with any meal).This book is a great gift for people who have visited the Chicago Diner as well as vegans and vegetarians (or those just looking for some new recipes!).",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I do not bother reviewing cookbooks that I do not recommend, and I do recommend this one (barely). I got it as a birthday present from my sister who has eaten there, I have not. So unlike many other reviewers, I do not have an emotional tie to the place. So far we have tried five things. Two (seitan goulash and shepherd's pie--particualrly the day after) were smash hits. The lasagne, lentil loaf and potato leek soup were really not worth the effort. Actually, 40% smash hits (dishes that were not just OK, dishes that people raved about) is a good average. That is why I am recommending it. My reservations are around the style of the cookbook and the suitability of the recipes for home use.Pet peeve #1, the recipes are in paragraph form. So when you are half way through you have to keep reading the paragraph to find the next unread sentence. Since the cookbook is thin and there is lots of room on the pages, there is no reason not to make it more convenient for the reader by putting each step on a separate line. OK, that is a pet peeve, it is not a big thing.Pet peeve #2, some of the recipes and instructions are vague. For example \"2 cups cooked lentils\" -- are they supposed to be red, yellow or brown? does it matter? are they drained (apparently not since they are the only source of liquid in the shepherd's pie which was dry the first time we tried it draining the lentils)? Another example, \"dice potatoes\" (how big a dice? apparently a small one since you start a new stage when the potatoes start to soften and if they are a medium dice, they are still not nearly done at the end of the stated cooking time).Restaurant ingredients -- I could have called them \"stealth ingredients\". By this I mean ingredients like cooked lentils and boiled potatoes. These are not a problem in a restaurant where the sous chef probably made a big pot of cooked lentils earlier. But when you shop on Sunday and come home from work on Thursday and start where the recipe tells you (preheat the oven), your dinner is likely to be delayed as you suddenly discover that the lentils have to be cooked (and for the brown lentils that seem to work best in the Shepherd's Pie, I like to soak them overnight, OOPS!). The lentil loaf also needs to cook in a BIG loaf pan (which I would call restaurant sized) or it gets very dry (even with cooking time reduced to allow for home pan size). Yes, I get it: this IS a restaurant cookbook. But start with \"boil the potatoes the night before\" not with \"preheat the oven.\"Preparation time. The dishes seem to take a long time to make. Again, if the sous chef does most of the basics, that is not a problem. But starting after work is different than working in a restaurant. Three hours for a faux meatloaf (that tastes, well, pretty much like meatloaf) is not a home cook friendly recipe (note there seems to be a typo in the lentil loaf as well -- four cups of lentil do not cook in two cups of water, although two cups of lentils might cook in four).Like I said, I do recommend it: I am going to keep using it as long as the family raves about the food. But I hope the author and publisher will take note for future projects. You probably can't get restaurant results without long prep time, but the directions could be better.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I'm a regular at the Chicago Diner so I was really excited to get this book. Most of the receipes are fairly easy but can be a little time consuming. However, the results are well worth it. My only complaint is that some of my favorite items are not in the book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Chicago Diner Cookbook: A Review and LoveletterDear Jo,I received your cookbook with no pictures on loan from a girlfriend from Chicago. The only vegan cookbook I had used up until that point was Vegan Cupcakes Take Over the World by Isa Chandra Moskowitz and Terry Hope Romero. I had no culinary training whatsoever....well....one day free cooking class at Mother's in Newport Beach ten years earlier, but that hardly counts.As a completely inexperienced chef, every single recipe I made turned out so well, I felt like someone had broken into my kitchen and planted new food in my oven: impossibly good food. I was outraged at how amazingly easy it was. Why didn't I start sooner?I made heart shaped pot pies. I made polenta which I'd never seen even in a picture, which somehow turned out magically good as well. Your diner gravy is so good, I could drink it, but self restraint dictates it must go on mashed potatoes or my little pot pies.Your vegan quiche is so convincing, I tricked many of my non-vegan neighbors into trying it. One neighbor didn't even realize I was vegan until she bumped into me at Whole Foods. I mentioned to an aproned, fundraising, mousy-brown haired girl selling \"Save the Earth\" cookies that if she really wants to save the earth, she should be vegan. My neighbor overheard my lecture to the non-vegan cookie salesperson and said, \"But you're not vegan! You made me that quiche the other day!\" Sorry Tauna; I tricked you good.Ratatouille Provenal, a real crowd pleaser, knocks out guests with delight with a little over 15 minutes prep time. Strogonaff made from tempeh fills me with ecstasy, I ate Ex-Benedict every day for almost two weeks, and I made both Leslie's Mushroom Spread and the Artichoke Dip for vegetable dip for my recent wedding.Not only did your cookbook open my eyes to the possibilities of expanding my world from baking to cooking, but I have since bought twelve more vegan cookbooks, all of which I use everyday. Well, I don't use ALL of them everyday, but I use at least one or two a day.My only beef is that the recipes are too huge! I'd been a single mom for eight years, and recipes yielded enough for me to open my own Chicago Diner in my tiny studio apartment in Los Angeles. Now I'm married and I feed three people, including myself, but it's still a little bit of an awkward amount of food.Thanks for inspiring me to love cooking and facilitating the feeling of being an artist at least three times a day.Love,Orchid",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "We had the pleasure of eating at the Chicago Diner as we traveled across the country. I was so impressed with the food (especially the lentil loaf), that, when I saw the cookbook up at the register, I had to buy a copy. I haven't been disappointed.Everything I've made from this cookbook has been delicious. The lentil loaf, the diner gravy, the tofu loaf, the different cookies, etc.. Last night I made the paella and it was better than the vegetarian paella we had in Spain!If you can't get to the Chicago Diner (and even if you can), this cookbook will give you everything you need to make a host of vegan delights. Jo A. Kaucher is genius!!!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "When I moved away from Chicago several years ago, I knew that I would really miss the food. One of the things I missed the most was brunch at the Diner. I couldn't get enough of the biscuits & hash. Thanks to this book, I still get to enjoy it as often as I wish. For any ex-Chicagoan out there yearning for some of that tasty tempeh hash (and biscuits, and gravy, and scrambled tofu, and Ex Benedict...), click \"Add to Shopping Cart\" right now.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I have gotten so many good reviews about the actual diner that I had to get this book. I dont live in Chicago so Im not fortunate enough to go here. But if I ever make it there I will give this restuarant a try. This book is a wonderful addition to my vegan cookbooks. The recipes in here are simple to make yet good and fulfilling. I reccomend this highly and i also give it 2 thumbs up!!!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the ultimate rotisserie cookbook 300 mouthwatering recipes for making the most of your rotisserie oven",
        "description": "We've all seen them in grocery stores and restaurants: delectably juicy, evenly browned, picture-perfect rotisserie chickens. Do you think they look unattainable, like something that can only be bought in a store and never replicated at home? In truth, it's as easy as can be with a rotisserie oven. A small rotisserie oven that fits right on your kitchen counter will effortlessly transform a humble chicken (and so much more) into a gloriously crispy, moist, and delicious family dinner in about an hour (while you are busy doing other things, or maybe even finding time to relax). The rotisserie is one of the most recent additions to the kitchen-appliance repertoire. What you may not realize is that it's also one of the most versatile and user-friendly. It can cook everything from meat and poultry to vegetable side dishes and desserts; it works without heating up he rest of the kitchen like an over; it's compact enough to occupy only a small amount of valuable counter space; plus, it's easy to clean! In The Ultimate Rotisserie Cookbook, Diane Phillips creatively takes the rotisserie oven well beyond chicken to every kind of food and every course of the meal. Go on, give it a whirl with recipes such as Calypso Jerk Chicken Kabobs, Roasted Garlic Prime Rib Roast, Plum Crazy Pork Chops, or Roasted Salmon with Mustard Chive Butter. Since the rotisserie bastes food in its own juices and allows excess fat to drain away, everything cooks up lighter and healthier than the same food that is cooked in the traditional oven or stovetop manner. For easy, no-fuss hors d'oeuvres or side dishes, try Blue Bayou Stuffed Mushrooms, Sugar Cane Shrimp, No-Fry Pommes Frites, or Pesto-Grilled Eggplant. With an extensive chapter of marinades, sauces, and rubs to spice things up or cool them down (how about Southwestern Fiesta Rib Sauce or Cucumber Mint Salsa?) and one on desserts to sweeten the deal (ever thought of making Rotisserie Caramel Apples or Fire-Roasted Pineapple with Macadamia Caramel Sauce?), your possibilities are limitless. The Ultimate Rotisserie Cookbook is, simply, the be-all and end-all book for the rotisserie oven, with 300 recipes for every possible way you could think of to use this amazing machine.",
        "authors": "['Diane Phillips']",
        "infoLink": "https://play.google.com/store/books/details?id=9vNiDAAAQBAJ&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Diane Phillips is truly amazing! In 'The Soup Mix Gourmet', she elevated the humble and oft-maligned canned and/or dried soup to haute cuisine. She's done it again with 'The Ultimate Rotisserie Cookbook'. This appliance has exploded onto the kitchen scene and is now, thanks to Ron Popeil and George Foreman, widely used in American homes.Phillips cites dry rubs as 'part and parcel of what makes delicious rotisserie and grilled food'. In the chapter, 'A Whole Lot of Saucin' Going On', she delights us with recipes for not only rubs, but marinades, salsas, pesto, and a wide variety of finishing sauces. The Fiesta Rub combining chili powder, cumin and oregano made a meal of chicken breasts exploding with flavor. There are over 50 pages in this chapter and this alone will allow you to experiment with new and old flavors and tastes.Additionally, Ms. Phillips discusses poultry, beef, lamb, pork and vegetables. Each chapter begins with a listing of the recipes and the appropriate page number. Also included are spice and sauce 'no brainers', a list of spices and sauces that complement the particular meat or vegetable. Cooking times for doneness are particularly helpful in the meat chapters.Just when you think you have tried almost everything in the rotisserie, comes the chapter entitled, 'Hot and Sweet'. Fruit is showcased here and the Rotisserie Caramel Apples will have the kids screaming for more! The book concludes with a collection of side dishes to accompany your rotisserie meal. Here you will find baked beans, potato and rice dishes and some salad suggestions, to mention only a few.As you can probably tell, I love this book! I have owned a Showtime Rotisserie for over five years and there is nothing to compare to the simplicity of use and the scrumptious results. Dianne Phillips has increased the possibilities for this appliance dramatically AND deliciously. A book on this subject is long overdue as it is easy to get tired of whole chickens. If you are a rotisserie user or considering the purchase of one, this book is a 'must buy'.",
                "review/helpfulness": "56/58",
                "num_reviews": 58
            },
            {
                "review/text": "We bought one of those showtime grills you see advertised on tv - the Set it and Forget It! rotisserie. Bed Bath and Beyond sells a smaller version for $100 - that is the one we got. Unfortunatly it did not come with a lot of recipes - just basic cooking tips - x pounds = x mins. I saw this book on Amazon and the reviews were pretty good. Those reviews did not do it justice. This book is a MUST HAVE if you have one of those grills. It is tailored to the kitchen counter rotiserie - not the big rotisserie kits for your BBQ.I never imagined being able to rotisserie a banana or an apple. This has recipes from that to chicken, pork, fish, kabobs, etc. I just got the book the book and already made 3 recipes out of it today! I made a whole chicken on it that rivals anything the supermarkets can produce. You MUST buy this book if you want to take full advantage of your rotisserie grill! Tonight for dessert I am suprising my wife with the Caramelized Apples! Yummm I can hardly wait!",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "I would not have believed that there could be gathered together 300 recipes all making use of a rotisserie oven, but Diane Phillips has done just that with \"The Ultimate Rotisserie Cookbook.\" Perfect for someone who has a rotisserie oven--or is seriously considering buying one--this is, of course, heavy on the meat and kabob recipes. These are mouthwatering: Creole Mustard-Crusted Rib Roast, Indonesian Pork Satay, Romano-Crusted Swordfish, and so on. There are even, surprisingly enough, some \"sides\" and dessert recipes. The Strawberry S'Mores and Pineapple with Macadamia Caramel Sauce could just as easily be made without a rotisserie, but what fun that Phillips had the imagination to include them here!The book is pleasingly heavy in the hand, and the graphic design attractive to the eye. I wish some color other than red had been used for notes and recipe titles (red is so hard on the eyes), but that's a small quibble with an unusual and useful cookbook.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I'm glad to have this guide to give me some options as I experiment as a first-time rotisserie grill owner. There are a number of basic recipes that give me a place to start. However, as a fairly experienced cook, I was dismayed to see a lot of ingredients and/or dishes I've never heard of. I guess I would have appreciated a book weighted a little more toward the basics of rotisserie cooking and less toward the unusual--things like Daikon-Crusted Salmon (okay, I now know what a daikon is, but I don't plan on figuring out where to track one down so that I can cook this). And there's no way my husband is going to go for Apricot Curry Shrimp. If we decide to invest in jumbo shrimp, there's no way we are going to put apricots on them!",
                "review/helpfulness": "14/22",
                "num_reviews": 22
            },
            {
                "review/text": "The recipes in this book are really great (!) BUT....I have a Cuisinart countertop rotisserie that allows me to choose the temperature (250 - 450). This book tells you how long to cook things but not at what temperature. Weird. I guess some rotisseries must be one size fits all as far as temperature is concerned......?",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "I got my George Forman Jr. rotisserie a couple of weeks before Christmas. After trying a chicken without a cookbook, I decided I needed a little help.This is the most comprehensive rotisserie cookbook I found. After reading the cookbook, I decided to give the holiday turkey recipe with bacon a try for Christmas dinner. The turkey was wonderfully moist and golden brown. While tying bacon to the turkey wasn't exactly easy, it was worth the effort. I got compliments all around on the wonderful taste. Next time I'll use the elastic bands.If the rest of the recipes are half as good as the holiday turkey recipe, I will consider my money well spent on this cookbook.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I selected this book because the title sounded like it was for any type of rotisserie. It turned out to be really favoring the Ronco rotisserie - not the kind I have. I was looking for timing of the food besides recipes, and it isn't easy to convert for my rotisserie.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I checked out a bunch of rotisserie books at the library and this was the best one. It had the most variety of recipes for different meats, and the best sounding recipes. Thus, I actually bought myself a copy.I would give it a 5th star if it had photos..i love seeing photos of each recipe in cookbooks.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "FINALLY! A good cookbook for the rotisserie. It explains absolutely everything about how to prep the meat including brines and marinades. The author really spent a LOT of time on this. You will not regret adding this cookbook to your library.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Excellent recipes and SUPER cooking tips -- well worth the purchase!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "preventions lowfat lowcost freezer cookbook quick dishes for and from the freezer quick and healthy lowfat cooking",
        "description": "Busy schedules encourage the use of convenience foods, and this innovative cookbook shows how to save money, time, and effort with delicious and healthy recipes made from staples that most people have available in the freezer. 75 illustrations.",
        "authors": "['Anne Egan']",
        "infoLink": "http://books.google.com/books?id=mbIOAAAACAAJ&dq=Prevention%27s+low-fat,+low-cost+freezer+cookbook:+Quick+dishes+for+and+from+the+freezer+(Quick+and+Healthy+Low-Fat+Cooking)&hl=&source=gbs_api",
        "categories": "['Cooking (Frozen foods)']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a really great book for people looking for freezer recipes--both the kind that you cook and freeze as well as those you want to prepare, package, freeze and then pull out for quick cooking. ALL recipes have nutritional breakdowns for those who have dietary restrictions to follow.The recipes are for REAL food--not the typically frozen stuff. I was thrilled to find a variation of my favorite Chicken Paprika that was freezer-friendly. And Snapper with Orange Sauce...? Butternut Squash Risotto...? There are chapters for soups/stews/chowders, fish &amp; shellfish, breads/muffins/quick breads, desserts/cakes/cookies--even sauces and condiments!The beginning of the book has an excellent primer on the benefits and basics of freezing; how to do it withOUT a standalone/comm'l freezer; cutting grocery costs; thawing--including thawing quickly and safely; and planning.Overall, a really good--and versatile--book for making your life easier when it comes to cooking!!",
                "review/helpfulness": "38/38",
                "num_reviews": 38
            },
            {
                "review/text": "I purchased this book several years ago and I find that it is the cookbook that I take down from the shelf most often. I am busy and don't have a great deal of time to cook but I insist that when I do cook the food must be delicious and convenient. The food satisfies my palate and the fact that I can freeze the meal into ready made future meals satisfies my lifestyle.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I absolutely love this book. I checked it out from the library about a year ago and checked it out again two months ago. I have to return it now and have decided to buy it for my own. This book has wonderful ideas for cooking both for and from the freezer. It offers great tips like keeping frozen onions on hand for use in meals and making beans ahead of time to freeze for future use and to save money. One of my favorite recipes in the book is for Turkey Sausage Stew (p. 85) because it uses ingredients I almost always have on hand in the freezer and they go straight from the freezer to my stockpot. It's a great recipe for company and of course you can freeze the leftovers. Though the book is from 1998, the recipes and ideas are timeless.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the frequent fryers cookbook how to deepfry just about anything that walks crawls flies or vegetates",
        "description": "Presents instructions for cooking with a deep fryer and includes recipes for appetizers, breads and pastries, main dishes, vegetables, and desserts.",
        "authors": "['Rick Browne']",
        "infoLink": "http://books.google.com/books?id=0y5oHAAACAAJ&dq=The+Frequent+Fryers+Cookbook+:+How+to+Deep-Fry+Just+About+Anything+That+Walks,+Crawls,+Flies,+or+Vegetates&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "My husband got me this cookbook as a holiday gift to complement the fryer he got me last year. We've been successfully enjoying the fryer, so far, but this book takes it to another level.I've only made one recipe (Fry-Grilled Pork), but that one was a HUGE hit. We had friends over; one ONLY eats pasta with red sauce; she not only ate the pork, but loved it.I've read through the book and look forward to making more of Rick's recipes. I'm hungry now!",
                "review/helpfulness": "25/31",
                "num_reviews": 31
            },
            {
                "review/text": "Like the title indicates, it has recipes for most anything you can think of frying. It also provides good information on the basics of safe frying and oil selection. I've found the general cooking times it suggests quite helpful for experimenting outside of recipes. The only problem I have is the unique names for common dishes makes finding the recipes a little challenging, but is not a big deal.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "There are some awsome recipes in here, including one for believe it or not, fried oreo cookies. There are useful frying tips too which I won't give away so as not to spoil the book.I almost gave it four stars for not having any nutritional information on the recipes, but it's obvioulsy not a sin not to include it, I hope he does in a second edition however.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Fried Food will Kill Ya! But what a way to go!!This is a down home how to fry handbook. It tells you the best methods of frying for different foods. It covers how to get the most out of your oils and explains the different oils and their qualities and when or how you would use them, along with the different temperatures and time for different types of food. Rick also goes over SAFETY and things you need to be careful of when cooking with hot oils.Then there are the recipes, I hate recipe books that are full of crazy recipes the common Joe would never try or have the time or ingredients to make, we have all seen those, well NOT HERE! These are recipes you are more than likely going to use, maybe not all of them, but a lot of them if you are interested in frying food. And the results are Yummy.It may not be the healthiest way to eat, but if you are going to have some deep fried food shouldn't it be the best tasting batch you can make/eat??5 Stars and 2 thumbs up from me!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "My husband loves this book. There are recipes to fry anything you can think of -- candy bars, twinkies. Then there are the old stand-bys: churros, fried ice cream. He took it to work, and all the guys loved flipping through it.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "fresh from the farmers market yearround recipes for the pick of the crop",
        "description": "Organized by season, a book of lavish photographs and more than seventy-five easy-to-prepare and delicious dishes suitable for family meals as well as entertaining celebrates the freshness and value available at farmers' markets across the country, in a tenth anniversary edition of the acclaimed cookbook. Reprint.",
        "authors": "['Janet Fletcher']",
        "infoLink": "http://books.google.nl/books?id=bMD9VfmgZB0C&dq=Fresh+from+the+Farmers%27+Market:+Year-Round+Recipes+for+the+Pick+of+the+Crop&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I started frequenting my local farmer's market after a stint living in Greece, where shopping at the open-air stalls taught me how good produce COULD be. This book is a treasure for anyone who has access to great veggies or grows their own; divided by season, it's full of delicious recipes showcasing produce at its very best.Everything I've made from here has been very good; I have a pot of the yellow split-pea soup with squash and kale in the refrigerator right now. I also really like the turnip and turnip greens soup, which lets you use both good things together. And then there's roasted asparagus, which I must make at least once a month throughout asparagus season.The only reason I haven't given this book five stars is because there are too many things here I would not make. Fletcher's recipes can be a little too \"restauranty\" -- too elaborated, too many strongly flavored ingredients canceling each other out. Still, for magnificent food photography and good eating, plus nice tips on how to choose the best of the market, this book is hard to beat. A good addition to any cook's shelf -- and if it inspires you to patronize your local farmer's market, so much the better!",
                "review/helpfulness": "63/63",
                "num_reviews": 63
            },
            {
                "review/text": "This is a lovely book, though I haven't yet tried many of the recipes. I use it not only for the recipes, but also for ideas on what to grow in my garden. It's also changed the way I cook corn: the roasted corn and garlic soup started me roasting corn in the husk instead of boiling it. Delicious!",
                "review/helpfulness": "16/20",
                "num_reviews": 20
            },
            {
                "review/text": "I ordered this book, because I spotted it at Whole Foods and wanted to check it out. I should have looked into it more closely, since it is specific to farmers' market crops grown in and around California. This is something I would have liked to have known before purchasing it; I can't buy most of the ingredients at my local farmers' market in Virginia, so it's difficult to use for the most part.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "I loved this book so much at my neighbor's that she bought it for me, even though it is out of print (Thank You!). Even though I live in New England, and it is written from California, it amazes me how all those unusual vegetables at the farmer's market are in it. I've cooked brussels sprouts with walnut oil, the fried baby turnips and green beans, and a host of other things. There is a lot of Italian influence, and everything's fried in butter. Yummie.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I bought this book back in 1998. It looked beautiful. I tried a couple recipes over the years and was very disappointed every time. In fact this is a book that sticks in my mind because I can't figure out why it doesn't work. It should, just doesn't. Pulled the book out again today 12 years later and read it from cover to cover, marked the recipes I want to try that I haven't yet. Tried one of the zucchini recipes. Sounded nice. First time ever my boyfriend scraped it right off his plate into the trash after one bite. I tried it and was also confused. The zucchini and the compote on top just didn't work together separately sure, but not worthy of a being put in a book. So far this is my overall feeling about this book. The recipes just don't work. I use this book to look at photos and get inspired to use vegetable I haven't tried yet. Only I make my own recipes up rather than use Fletcher's.So no not my favorite.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I'm a huge fan of Janet Fletcher's. Her recipes sing to me. So I wasn't surprised to find that I like her farmers' market book more than others in that genre.Fletcher has a distinctive way of choosing and combining foods to create the biggest bang of flavor from the fewest number of ingredients. That's pretty much the way I prefer to cook and eat. The Fennel and Prosciutto Gratin is sooo good. Her pastas are always a hit (the Penne with Green Cauliflower, Anchovies and Bread Crumbs is delicious and very typical of Fletcher's style), as are her soups. The Asparagus with Scramble Eggs has suggestions for several other ways to serve these two surprisingly harmonious foods which are not often combined in the US. The Persimmon \"Ice Cream\" is a persimmon-lover's dream.The book is arranged by season, and each chapter starts with descriptions of the best foods of the season as well as how to select and store them. Of course these recipes are best when using ingredients at their seasonal primes, but I would happily make these recipes at any time of the year.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "If you frequent farmer's markets or order fresh fruit and vegetables through an organic co-op, this book is really helpful.The section on the various vegetables and fruits and how to choose the freshest ones is invaluable. I especially liked the information on storage. For instance I always wondered why my cauliflower never seemed to taste as good when store bought or stored for a week. Outwardly the florets look okay, but as the author explains--fresh cauliflower means the best eating experience is the same day! As the cauliflower ages it gets a grainier texture.This is not a cookbook for those that are hurried and short on time. This is a cookbook for when you can savor making and eating the foods you have purchased. I loved the fingerling potato salad with fennel. I'm not terribly fond of fennel, so the second time round I adjusted the parsley and instead of fennel used dill. It was great. The autumn squash risotto with white truffle oil is another favorite of mine. I've experimented with various squashes and oils. Each time the recipe has come out different but great!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the american country inn and bed breakfast cookbook volume ii american country inn bed breakfast cookbook",
        "description": "Presents hundreds of recipes from inns around the country and gives a state-by-state description of the best inns, with information on the facilities and activities available at each inn",
        "authors": "['Kitty Maynard', 'Lucian Maynard', 'Julia M. Pitkin']",
        "infoLink": "http://books.google.com/books?id=_BzNnQEACAAJ&dq=The+American+Country+Inn+and+Bed&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "At first, the sheer number of recipes in this cookbook will overwhelm you. Then, flipping to the index in the back you will find that you are able to look up dishes based upon their main ingredient (e.g. chicken, zucchini, potatoes).We use this cookbook far more than any other book in the kitchen. Of all the dishes we have made, I can only recall not liking one.It's naturally heavy on breakfast and brunch foods, but it has something to satisfy anyone's tastes - desserts, main courses, appetizers, beverages.The biggest pain with this book is that it is separated by bed and breakfast rather than by kind of dish. This makes it rather time consuming to find a recipe. One has to turn to the index and then go down through the list flipping to various pages to find the &quot;perfect&quot; chicken dish, for example.Separating the recipes out by type would have saved the recipe searcher a fair amount of time.Still, it's a wonderful cookbook. I'm glad we have a copy. WARNING: This cookbook contains absolutely no photos of the food, so those who like seeing what the dish will look like will not enjoy this book.",
                "review/helpfulness": "28/32",
                "num_reviews": 32
            },
            {
                "review/text": "My husband just surprised me with a weekend at one of the B&amp;B's in this book. We were getting away for our 8th year wedding anniversary. And he bought me a copy of this cookbook he wants me to make some of the same dishes that we were treated to during our stay. This is something that is such a special treat. I LOVE to make dishes for our family when they come to visit. I like to see the looks on their faces when they are treated to dishes that are simply out of this world. There are just no other words to explain the recipes in this cookbook. You'll always want to keep it handy. You won't find any recipes in here that require alot of hard work or foods that most of us don't have in our kitchens everyday.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "This cookbook is great !!!! i borrowed it from a friend and never gave it back (bad!!!) but it really is a great source for entertaining. Fanstastic and easy recipes. A good way to impress your friends with your cooking. Also what i like is they usually have serveral recipes for similar dishes so lets say you want to make scalloped potatoes - you can look at them all and then kind of use the info to make your own variation with the pieces of the recipes you think sound good. Also it is good if you are doing theme parties. I love asian cooking we were having a party where i needed to bring an asian salad - they have like 5 different types. and they arent what you would expect. Note this is just not breakfast foods - all types of cooking are in this book and from all types of us regions.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I use this book much more than I thought I would when I bought it. I found some great recipes to use when having company (or not!) The ingredients are mostly easy to find and the directions are relatively easy. I guess if you get up every morning to run a bed and breakfast you don't have time for fussiness! Highly recommended!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I received this cookbook as a gift from my husband when the first edition was published. I liked it so much and used it so often I continue to give it to friends every year. If I am in a quandary as to what to prepare for company, or just looking for several versions of an old classic, this is usually my first and last stop. I especially like it for pastry, cake and breakfast recipes (not surprisingly). When we are travelling, I also use it as a guidebook!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I received this book (vol 1) from my daughter and find it to be the most used book in my collection. I know that the recipes are tried and true , since InnKeepers are expected to put out good tasty food that is made with love. I have counted on this book for last minute planning and I've not been disapointed.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This review refers to \"The American Country Inn and Bed & Breakfast Cookbook\"(vol 1) by Kitty and Lucian Maynard....St Chuck Poolside Jambalaya to North Carolina Applsauce Muffins, Aunt Ruth's Baked Eggs and Cheese to Dorothy's Chocolate Zucchini Cake, Guacamole to Lobster Pie to Salt Lake City Taffy, you'll find the biggest and best collection of regional homestyle cooking from all over this great food lovin country in this fabulous cookbook!Whatever type of fare you have in mind you'll find something good in these pages. The Manyard's have done all the work. State to State(including Alaska and Hawaii) they have found us some great recipes from Country Inns and Bed and Breakfast's from all over the country. With more than 1700 homestyle recipes you really get your money's worth.You can go state to state(without leaving home) and try something new and different, or find some of your old favorites that you've been longing for.There are two indexes to check through. You can check by city, or by food. For a good look at what's inside, the book, click on the 'Look Inside\" link to several pages to browse through.The recipes range from meals as simple as Biscuits and Eggs to the more exotic tastes like Veal Scallops with Gorgonzola Sauce. You'll find several different ways of making the most everyday things, like French Toast, depending on what State or Regional taste you're in the mood for that day!There's an additional perk to this cookbook as well. If you want to get out of your own kitchen and do a little traveling, you will find a little description as well as the addresses and phone numbers for all the Inn's used here, on the pages with their own recipes.In some cases there are nice little sketches of the lodgings as well.I use this cookbook more than any other in my kitchen. although I haven't loved every single thing I've tried, it is stained and sticky with the remnants of some terrific recipes(some of my favorite pages are in worse shape than others!). Everytime I look through it for a new idea I find one. I love it! You will too.So have fun, eat hardy and try to get someone else to do the clean-up.....enjoy...Laurie",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "My sister gave me this cookbook for my birthday a few years ago. When I found out there was a Volume 2, I rushed right out and bought that one, also. You can tell by looking at both books that they are the ones I reach for most often, because both of them are battered beyond belief!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "America's Best Bed & Breakfast RecipesI selected this book thinking that Bed and Breakfast establishments would offer great recipes that were somewhat less complicated than normal. I wasn't disappointed.I opened the book and leafed through a few pages. My eyes stopped at Country Italian Sausage Pie. It was exactly as promised. I served it at a luncheon last week to rave reviews.I would strongly recommend the book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I can't you how many times I've gone to my copy of this cookbook for recipes... it's the one I reach for first! It's like taking a trip around the country without leaving my home! VERY user friendly format, too!I love the small-sized recipes that many of the B&amp;B's and Inns use... hubby and I are 'empty nesters' most of the year with our sons away at college so there's no need to make big meals or we'd be eating leftovers forever.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "tasty get great food on the table every day",
        "description": "For the past twenty years, Roy Finamore has shaped America's most popular cookbooks, publishing such influential authors as Martha Stewart, Ina Garten (the Barefoot Contessa), and Lee Bailey and working alongside chefs and other food authorities to help them streamline their recipes. Now, in Tasty, he shows you how to make the most of your time and have fun in the kitchen. Tasty proves that a meal doesn't need to be showoffy to be uncommonly good. When you serve food from this book, your family and friends will sit up and take notice, and you'll be relaxed and smiling when you sit down at the table. Among the simple but exceptional dishes in Tasty: Buttermilk Pancakes with Hazelnut Butter: breakfast with a minimum of effort; unbelievably light and fluffy. Sicilian Spinach Pie: perfect for a lunch or picnic, with the easiest pastry you've ever made. Fresh Pea Soup: with three common ingredients, it's ready in five minutes. Chicken Milanese: Crisp chicken and tart salad -- the kind of food you crave when it's hot out. Pork Roast with Fruit Stuffing: a fine company dish or Sunday supper. Chinois Noodles: Asian-inspired and equally good warm or cold. Chocolate Whipped Cream Cake: Whip cream, add eggs and a few dry ingredients, and you've got cake! As Roy says in his introduction, \"Good simple food is meant to be shared and enjoyed. Cook often.\"",
        "authors": "['Roy Finamore']",
        "infoLink": "http://books.google.nl/books?id=vvI9-kVgDSUC&dq=Tasty:+Get+Great+Food+on+the+Table+Every+Day&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "`tasty' by master culinary editor, Roy Finamore is an odd book by many counts, but if you happen to fit its best audience, it may be one of the best cookbooks you will see for many a moon. The blurb on the front from Ina Garten, `Recipes every cook should know' goes a long way to explaining what this book is all about, especially as it has a lot of similarities to Garten's own friendly `comfort food' style of recipes. But, I must point out at the outset that while Garten's books have less than half the recipes of this volume, they are all more expensive than this very thrifty list price of $30.The very best audience for this book is not the `I hate to cook, but have to' crowd, or the `I like to cook, but don't have the time Rachael Ray fan club' or the foodie cookbook collector who pores over good celebrity chef offerings from Sara Moulton, Susan Spungen, Tyler Florence, and Deborah Madison. It is also not necessarily for the dedicated professional who studies volumes from the CIA (Culinary Institute of America) or `Cooks illustrated'. It is for people like the author who like to cook, have the time to do moderately complicated recipes (work at home men are a perfect audience here), who like tasty, classic recipes, but who don't want to assemble a large library of cookbooks to garner twenty (20) good recipes. As someone who does own over 500 cookbooks, my first impression is that I have seen almost all these recipes in some other book. Maybe not the exact recipe, but something like it, as with the tomato pie, which has a family resemblance to a Sara Moulton tomato tart or the Welsh Rabbit, which I have seen in several English cookbooks from Nigel Slater and Jane Grigson, not to mention a gaggle of Irish cookbooks.Finamore is a cookbook editor who has worked with many important cookbook authors such as Garten, Martha Stewart, Tom Colicchio, Diana Kennedy, Anne Willan, and Gale Gand. This, I sense just a bit of the culinary `fellow traveler's point of view I taste in the work of Alton Brown, with not quite as much humor and not quite as much circumspection with words as I appreciate from Brown. For example, Finamore grossly misuses the term `melt' when referring to the breakdown of one ingredient into another as when mashing up anchovies or garlic into vinaigrette. Finamore is also not entirely rigorous in explaining all his terms, as when he uses the term gorgonzola `dolce' cheese in a recipe with no explanation of the two different varieties of gorgonzola in his introductory glossary of ingredients.But all this is minor nit-picking. In general, this is a superb cookbook for the casual cook who wants a reliable source of `tasty' recipes. The fact that many of the recipes will look familiar to even the non-foodie is a good thing, because even if they are not strictly `comfort food', they will have the feel of well worn slippers instead of the straitlaced feel of a totally unfamiliar `original' restaurant recipe from Emeril or Mario or Bobby or Daniel or Thomas or even bad boy Tony. Just to take one example from my experience, I have just started to do cooking without the safety net of a published recipe, and as I had two quarts of leftover homemade chicken stock, I wanted to make chicken noodle soup. Now, I searched all my favorite soup books from Barbara Kafka, James Peterson, the CIA and what have you, and I just couldn't quite come up with a validation of what I had in mind. Most were just a bit more complicated than I thought it should be. So, I did my best, making two annoying mistakes in using too many noodles and the washed up chicken meat from the stock recipe. But here, in Finamore's book is the most lovely little chicken soup recipe you can ask for, using homemade stock and some boneless chicken breast.One of the better things about the recipes in this book is that they do not rely on a lot of unfamiliar ingredients. If you have a good working knowledge of the standard American / French / Italian pantry, you will find nothing here which will be hard to find in your local Wegmans market.I also give extra credit to the book for covering breakfast and lunch. Any good cookbook for the casual cook must include these items, as they are usually only covered in specialty books. I also give the book extra credit for giving us several recipes which make good use of ingredients we commonly have left over, such as ricotta cheese.Finamore mentions several lessons he learned from the likes of Jacques Pepin, which brings to mind the fact that this book replaces Pepin's `Fast Food My Way' as my favorite book to recommend to anyone who is looking for one good cookbook for when they like to cook. That is not to say this is not a good book for the foodie crowd. It is an excellent book for when the food sophisticate wants to let down their hair and make some `comfort food', but they want something just a bit more interesting than the latest Rachael Ray quickie. Looking through the `weekend dinners' chapter, I find, for example, the perfect combination of sophistication and simplicity in the `beef tenderloin stuffed with summer salsa' for serving 8. The beef tenderloin is impressive, the roulade technique is fancy, the salsa is `tasty, the prep and grilling requires some skill and experience, and the end result is great, even for leftovers. In the same chapter, the recipe for pork chops is careful to use a brine, without preaching about the lean state of modern porkers.Highly recommended for everyday recipes, like it says!",
                "review/helpfulness": "48/54",
                "num_reviews": 54
            },
            {
                "review/text": "First checked this book out from my local library. Within ten miinutes, I knew I needed it for my own collection. Creative, simple -- and love the \"pairing\" suggestions. Very inspiring! Thanks Mr. Finamore!",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "Picture this: You're sitting around a kitchen table on metal and vinyl chairs talking with your brother whom the family acknowledges to be the fancy cook in the family. Your brother relates to you his riffs on recipes from his famous friends or family and one thing is clear; this man knows how to cook. He knows how to kick classic recipes in the butt and give them new life. This is what it is like to read and use Roy Finamore's \"Tasty: Get Great Food on the Table Every Day.\"Finamore lovingly acknowledges the contributions of his family and friends but kicks the recipes up a notch or two to make them his own. Check out the recipes for Roast Chicken and Cod-Puttanesca style. Finamore is funny and ingenious, and he torques classic recipes to a level one would not normally consider. The man knows his way around a kitchen and the book reads like a family recipe collection on fire. Clearly Mr. Finamore loves his family and cherishes the family gatherings he has experienced in the past. He is a blast to read and his food is amazing. My recommendation? BUY IT...NOW...AND USE IT DAILY.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is a useful tool to have in your cookbook collection. Packed with great tips and \"tasty\" recipes. Useful for everyday and entertaining. His love of food oozes from every page... A delight to read!",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "Having cooked out of this cookbook for about two months, I continue to be amazed by it. The recipes are clearly written and easy to prepare. Usually when this is the case, the authors have sacrificed flavor in an effort to entice people who don't cook to learn to cook. The strategy backfires, of course, since who would want to learn to do something whose results consistently disappoint? Roy Finamore starts from the premise that regular people who have lives outside the kitchen can make really tasty food without depending on lots of sugar, salt, or fat to equal \"taste.\" As I have explored the book, I start almost every recipe thinking, \"This doesn't sound hard, how good can it be?\" and am consistently--pleasantly--amazed by the results. The food is joyful and colorful, nourishing and comforting. What a great find!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "this is available for a ridiculous price and worth, at least, five times as much. His name is not well-known, but his friends and clients are which certainly speaks well for him.I like the style of writing and the recipes, the few I've tried so far, have turned out very well. I also like the author's attitude. You have permission to enhance your result, if desired, without inciting his scorn. Latitude in cooking is a nice attribute.I found his web site, asked a question, and got a PROMPT answer.Nice photography and I like the serving suggestions that relate to other recipes in the book.This revision is written months later and i still like and use the book quite often. Some of his recipes have spilled over into other recipes I have devised and it's been a helppful read when I'm just looking for \"ideas\" on what to cook even when I don't follow a recipe.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is one of my all time favorite cookbooks. There are so many flavorful, easy recipes. I will never buy ricotta cheese again. It is so easy to make. The English muffins are better than in stores.White beans simmered with a parmesean rind, Wow! The list goes on.Roy Finamore's sense of humor and great ways with dishes are amazing.Whether you are a professional or a beginer his explanations on preparation and cooking are for everyone who loves good food. Our family uses this cook book many times to make favorites or find new ideas for dinner or desert.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am a cookbook collector. Compulsively so. And so when I bought 10+ in one go on a visit home (where the thrift stores are fantastic), I decided it was time to weed through my collection. I decided to go with more specific and/or vintage cookbooks, so this one was in the \"discard\" pile, but I pulled it at the last minute. The other day I lay out on the grass in the yard for a bit and flipped through it. And found myself dog-earing nearly half of the recipes in the book.I'm usually pretty darn picky when it comes to food. When looking at a recipe I'm looking for several factors:1) Taste & eatability - would I want to eat this?2) Availability of ingredients - if the dish depends on a certain weird veggie I don't have access to, I skip it.3) Ease of preparation - I don't want to spend hours in the kitchen on one dish.4) Quality and freshness - I hate recipes that call for canned stuff.5) Creativity - If I wanted the same old same old, I'd just make that instead of looking at new recipes.Thankfully, \"Tasty\" passes every test. I don't want to eat everything in the book, and some recipes don't pass the ease of preparation test, but for the vast majority they use easy-to-find, fresh ingredients, feature simple preparation, look damn tasty, and the author even offers alternatives for how you can mix up the recipe on your own if you want.I highly recommend this cookbook to any cook, but especially newer cooks interested in delicious, fresh, simple food. And boy am I glad I didn't get rid of it!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "IN THESE DAYS IT IS RARE TO FIND A BOOK OF THIS TYPE WHICH iS LARGELY ORIGINAL IN CONTENT. THIS IS ESPECIALLY SURPRISING IN VIEW OF THE AUTHOR'S EXTENSIVE BACKGROUND WITH THIS GENRE. ALL THE RECIPES I'VE TRIED HAVE BEEN PLEASANTLY SUCCULENT AND SUCCESSFUL WHILE BEING (APPARENTLY) KLUTZ-FRIENDLY. THE COPIES I HAVE PRESENTED TO MY STOVE-USER FRIENDS WERE VERY WELL RECEIVED AND GREATLY APPRECIATED. ONE ACQUAINTANCE WHO OWNS MORE THAN 600 COOKBOOKS WAS HERSELF IMPRESSED WITH THE SCOPE AND QUALITY OF THE RECIPES AND MEAL PLANS.DEMI-GOURMANDHARRY LIEBEN",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "We were looking for a new cookbook and I heard about this one on an NPR segment. It was billed as great recipes that were simple and of fabulous quality. We have tried the pancakes and the overnight steel-cut oats, and the oven-roasted tomato soup. All were fantastic.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the simpler the better sensational home cooking in 3 easy steps",
        "description": "Praise for Leslie Revsin Author of Come for Dinner, a James Beard Award Finalist and Great Fish, Quick, a Julia Child Cookbook Award Finalist \"Leslie Revsin cook(s) with a flair for flavor, a steady hand, and a generous heart.\" -Sylvia Carter, New York Newsday \"I have never stopped wishing I could cook just like [Revsin] does every night of the week.\" - Molly O'Neill, host of the PBS series Great Food and author of the New York Cookbook \"The food revolution continues: simpler, less fussy, more delicious dining. Leslie Revsin is leading the charge!\" -David Rosengarten, Editor-in-Chief, The Rosengarten Report",
        "authors": "['Leslie Revsin']",
        "infoLink": "http://books.google.com/books?id=ppRCOAAACAAJ&dq=The+Simpler+The+Better:+Sensational+Home+Cooking+in+3+Easy+Steps&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "After having cooked for more than 30 years, my view of cookbooks is sometimes jaded. Many books still on my shelves have only a recipe or two that I have come to rely on; others turned out to be attractive and entirely impractical. This book drew me in because of the late author's reputation for developing skillful combinations of ingredients. Still, my expectations were tempered by experiences with other so-called \"easy\" or \"quick\" cookbooks.What a tremendous surprise. My excitement grew as I turned each page. The ingredients are not hard to find, the methods are truly easy (beginners welcome here, I would think), and mostly the results are on the table in under thirty minutes.Although there are a few delightfully appetizing color photographs, these are not recipes that play better for a food stylist than for the family. This is food people will want to eat: smothered mini-meat loaves (made on the stove top!); Waldorf chicken legs (think drum sticks); halibut with creamy dill butter. Recipes for vegetables, side dishes, salads, and even desserts are cook and family-friendly complements to the variety of main dishes (including some vegetarian) presented. Annotations of simple tips, serving suggestions, and variations show how to pull things together.I like the fact that this author was not afraid to name names. Watch for the helpful brand name suggestions and for comments about the quality of various ingredients available: for example, on the condition of most fresh apricots brought to market in the USA. As an empty nester, I also appreciate the fact that these recipes prepare four servings, for the most part. A cupcake recipe makes five large or six ordinary-size chocolate cup cakes, neatly avoiding too-tempting (or too dried out) leftovers.If you have ever been intimidated by lengthy lists of ingredients and complicated instructions, this cookbook might be for you. You will look over the recipe and think to yourself, \"I could do that.\" If you simply want to broaden your repertoire of \"too tired to think, much less cook\" options, you will find plenty of rewarding ideas. There are half a dozen people -- cooks and non-cooks, alike -- who will be receiving a copy of this book from me. It is that easy; it is that good.",
                "review/helpfulness": "49/49",
                "num_reviews": 49
            },
            {
                "review/text": "Unlike most of the \"quick\" and \"simple\" cookbooks I've tried, this one has recipes that are truly quick and easy, AND actually taste good. This is the perfect book for someone who is new to cooking (a great college graduation or housewarming gift!), because the recipes are not at all intimidating and can all be completed within a half hour. And the best thing about this book, in my opinion, is that Revsin's recipes all have very short ingredient lists. I love to cook good food, but am generally on a tight budget, and I can't afford the long lists of pricey ingredients that you find in most cookbook recipes.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book is filled with homey (but not frumpy) recipes for soup, salad, sides, main dishes and a few desserts. As a registered nurse working full time, I really respect this book for not wasting my valuable free time with so-so dishes involving lots of steps. All the recipes I've tried have been more than satisfactory, while using common supermarket ingredients and simple techniques. Highly recommended.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have two small children and have less and less time to cook. This is a great book for someone who wants to serve healthy food fast.My dad was a terrific cook who did it all without recipes. He taught my mom how to cook but traditionally women in her family don't cook, so my dad did all the cooking. In keeping with family tradition my brother was required to learn how to cook and I was not.So I learned to cook after I got married and taught myself using cookbooks so I have an extensive collection. I personally think cookbooks should help make preparing food easier and inspire not intimidate. That is why I love this book. It is designed to make good food simple and easy and tasty.I would recommend this to the experienced cook looking to save time, the novice cook who wants good food with minimal effort or someone who wants fresh ideas from a cookbook written to inspire instead of intimidate.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Leslie Revsin was the first female chef at the Waldorf Astoria in NYC. She wrote this book for her dughter (who lived in CA) because her daughter had young children and very little time to cook. These are delicious recipes that are easy. My whole family loves them. This would make a great gift for a new mom.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "supper swapping cook four days a month with chefs and restaurants easy recipes",
        "description": "Trade meals with a friend and only cook once a week using simple, low-carb recipes from across America, featuring restaurants such as Joe's Stone Crab and The Broadmoor. Includes tips from health/fitness experts and top chefs and introduces the new concep",
        "authors": "['Susan Thacker']",
        "infoLink": "http://books.google.com/books?id=YFncAAAACAAJ&dq=Supper+Swapping:+Cook+Four+Days+a+Month+with+Chefs%27+and+Restaurants%27+Easy+Recipes&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Supper Swapping is fantastic! The recipes are quick, easy and delicious! I loved reading this book as it's well-written and witty too!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "\"Supper swapping is an arrangement to share dinner cooking responsibilities with a friend. You divide what you make and \"swap\" the extra portions with a friend who reciprocates. This works well whether you live alone or have a family.\" ~Susan ThackerSusan Thacker asked restaurant owners and caterers for their simplest recipes and features each chef with their recipes throughout this intriguing novel sized cookbook. She doesn't believe in making 30 meals in a day and suggests fun ideas like lunch groups where people share a lunch at work.The recipes are divided into main chapters:SoupsSalads and VinaigrettesVegetables and Side DishesChickenBeef and PorkFish, Shrimp and CrabBreadDesserts\"Cooking together, creating together, eating together...there's no better way to communicate.\" ~Executive Chef Steve ManninoRecipes include:Pumpkin BisqueChampagne VinaigretteArugula Salad with Lemon/Garlic VinaigretteGrilled Vegetable GratinAsparagus with Pistachios and Roasted Fennel VinaigretteChicken CurryGrilled Lemon Rosemary Chicken SaladPan Seared Sea BassZucchini BreadSweet Tart DoughWarm Chocolate Cake with Double Whiskey CreamI don't know about you, but after reading this book I have been thinking...\"why share?\" These recipes sound so delicious. However, if you want to make your life easier, buying a friend a copy of this book sounds ideal. With recipes this interesting I think you may want to cook more than four days a month. This book is useful for supper swapping, but can also be used by anyone who loves gourmet food at home and enjoys readingchef's cooking tips.~The Rebecca Review",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "As an expatriate family living in the Middle East, utilizing Susan Thacker's ideas in Supper Swapping with other expatriate families is a fantastic way of savoring meals indigenous from other parts of the world. For our family, swapping meals has led to experiencing foods from South Africa, Lebanon, Turkey, Malaysia, Iran and Scotland. What better way to share of one's culture than through food!One of the numerous quotes from the book, \"A recipe doesn't have to be hard to be good,\" by Executive Chef Kraig Thome, is a perfect statement in relation to Thacker's selection of recipes. She's put together a variety of recipes, with few (yet very tasty) ingredients, that are a delicious and healthy way to start sharing meals. Our personal favorites from Thacker's book are:Amuse Salad with Balsamic DressingBlueberry Spinach Salad with Toasted Pecans and Blue CheeseThai SoongChicken with Cranberry Mustard SauceGrilled Flank Steak with Lime Garlic Mojo SauceButtery Cilantro Ginger SauceCorn SpoonbreadSupper Swapping is an easy-to-read book that shares an interesting concept of supper swapping--how to get started, things to consider when swapping and how to make it work--along with extraordinary, simple, yet delicious recipes. Buy one for yourself and buy one for a friend...then start cooking and swapping!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I have made 4-5 of the recipes now from Thacker's book and have to say I have not found one that was anything less than excellent. Thacker explains the dinner swapping concept well, giving advice on the best way to get started, pitfalls to avoid, and even nutrition information for those trying to live a more low-carb lifestyle. The recipes are fantastic and the \"Kid Tested\" icon found at the bottom of recipes that tested as kid-favorites is a great concept.If you are looking for gourmet tasting recipes, without the complexity, this is the book for you. Whether I end up swapping meals with a friend or not, I will make these recipes again and again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "soup makes the meal 150 soulsatisfying recipes for soups salads and breads non",
        "description": "The book is divided into 50 menus, each including a soup, a salad, and a bread recipe.",
        "authors": "['Ken Haedrich']",
        "infoLink": "http://books.google.com/books?id=i4_xSaXJnhoC&dq=Soup+Makes+the+Meal:+150+Soul-Satisfying+Recipes+for+Soups,+Salads+and+Breads+(Non)&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I passed this book on a library cart, stopped and picked it up, was intrigued, checked it out, brought it home and read it, and finally decided I have to have my own copy. What a great cookbook, with lots of breads, soups, and salads that I can't wait to try. The breads are mostly innovative quick breads, and thank goodness for so many new picnic and potluck salads besides the tired old mayo-doused macaroni ones. I like the little intro at the beginning of each recipe, it's informative and entertaining and gives you a preview of how your final result will turn out. Most of the soup recipes can easily be modified to be low in fat (for example add evaporated milk instead of cream). My kids are adventurous eaters so I plan to try many many of these recipes, but there are few exotic ingredients or oddball flavor combinations, so I definitely think of this as a &quot;family friendly&quot; cookbook.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I bought this book for my husband, and can't stay away from it. I first read the book from cover to cover. Most of the ingredients are easily bought at a regular grocery store, and I have had no troubles with any of the recipes yet. There is a huge variety of soups, salads and breads in this book. Some of the selections are traditional favorites, others are more unusual. This book has rapidly become one of our favorites in our collection.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I cook often, but I own very few cookbooks. I get tired of buying cookbooks and finding only a few recipes worth making. This book is definitely an exception. Every recipe I've tried has been terrific, and there are so many others I'd like to try, I've decided to give the library back their copy and purchase my own. The biggest plus for me is that the recipes are all very healthy and the menus are well-balanced. Yes, he uses butter and cream in some recipes, but he balances them with amazing whole grain breads and large amounts of vegetables and fruits in the soups as well as the salads. What impresses me the most is that his whole grain breads taste so terrific - you'll wonder why you ever ate white bread! Best of all, the recipes make enough for leftovers, but not so much that you're eating soup all week. Best Bets: the Split Pea soup menu is my favorite - the bread is terrific and the split pea soup is the best I've ever tasted.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I love to cook, and I have a pretty extensive collection of cookbooks. This one ranks number one for soups and the breads and salads that best complement them. The tips that Haedrich inserts among the recipes are practical and interesting. It's fun to pick up tricks of the trade as you go along. And everyone who buys this book must try the Cream of Jalapeno soup--it is very unusual, and extremely tasty. I can't wait to try some more of Haedrich's books. He really communicates his love for food and its preparation, and makes the time spent cooking fun and rewarding.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Bought this book in Shipshewanna IN in getting ready for football tailgating. Was the hit of the Saturday soups. The Curried Pumpkin and Cheddar Bisque is to die for -- and I had a lot of people who agreed. Can't wait to try the Garlicky White Bean and my husband's favorite, Scallop & Crab Bisque. Will be looking for more books by Ken Haedrich! Well written, easy to follow, ingredients available and fun to make!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm a soup junkie- I literally eat soup for breakfast, lunch and dinner on a regular basis - and I'm so happy with this book! Every recipe has turned out well, and so far none are terribly time-consuming (yet they still all have a nice homemade-with-love vibe to them). I also appreciate the variety of salads- I'm always trying to add more veggies and more variety into my family's diet and this book has really inspired me. I have not tried the breads yet, mostly out of bread-making fear, but they don't really look too hard, and I'm actually gearing up to try one right now. The author has a nice folksy tone that makes the book pleasant company in the kitchen as you wait for your veggies to \"sweat\" and the menus are well-organized by season, though he encourages you to mix and match as taste and availability of ingredients dictates. A great addition to any cookbook collection, and a must for fellow soup junkies!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I love soup and have several soup cookbooks. This is the best by far. The breads and salads to serve alongside the soups are also fantastic. Must try recipes (my favorites) Vegetarian Split Pea (the addition of BBQ sauce instead of meat is genius); Cabbage Paprikash, and the slow-roasted tomato foccacia. You will not be disappointed by the soup book for all seasons. Haedrich has a gift in recipe development!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have had this book for few years now and after making another soup today from this book (and I have made about half of them), I decided it was time to submit a review. Time and time again I refer to this book when I need an inspiration. I dare say it's the book that gets used the most on my book shelf and I have MANY cookbooks. The recipes are innovative and the book is very well organized. I love that each meal (organized by seasons) has a combination of soup recipe/bread and salad. The bread recipes have been equally as good and the salads look enticing,although I haven't made too many of them. The recipes don't involve exotic ingredients and are generally pantry/ingredient friendly. More than once my husband has said \"this soup would be a good starter or main dish soup at a restaurant.\" Highly recommend.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "What a joy to own this book. I feel so fortunate to have found it amid so many cookbooks out there today. This book really is a must have because of so many delicious recipes. I have made almost 1/3 of the recipes in this book and not one came out bad. They are fantastic for any night or to share with others. They never disappoint and are always all-around satisfying. Not only that, recipes are simple to follow, ingredients are easy to find, and it's perfect for the beginner and advanced cook!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "My sister recommended this book to me and I completely LOVE it! I dare you to read his descriptions of soups and not start drooling. Then you will head to the store with a list and start cooking! I have really liked every recipe so far and want to try all the soups and many of the salads and breads, too!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "preventions the healthy cook the ultimate illustrated kitchen guide to great lowfat food",
        "description": "Recipes for low-fat fare include tips from top chefs",
        "authors": "['David Joachim', 'Matthew Hoffman']",
        "infoLink": "http://books.google.com/books?id=WtKITfYYQf0C&dq=Prevention%27s+The+Healthy+Cook:+The+Ultimate+Illustrated+Kitchen+Guide+to+Great+Low-Fat+Food&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I love this book! It has so many yummy recipies that actually taste good! It also is very informative about preperation of foods It has been a great help to me in my quest for a healthier lifestyle. I use it all the time and they are recipies you can use everyday not just for parties. It's great, I really recommend this book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I checked this book out from the library and have decided to buy it for myself. Everything I've made from this cookbook has turned out excellent. I also love how you can search by ingredient, even if the ingredient you want to use up is not the main ingredient, unlike most cookbooks. This is key for me, as I usually buy a lot of whatever produce is on sale that week, such as carrots, and then end up frustrated because I don't necessarily want to make a carrot recipe per se. Sometimes I want to use up the last 2 carrots, the last bell pepper, and the last 2 stalks of celery (the staples for any crisper) before buying a new batch. In other words, the index will point you to all recipes where your tail-end ingredient is used. Lesser known produce, such as bok choy, also have recipes (I buy most of my vegetables from Chinatown markets). Also, I'm generally loose with measuring, whether it'sproduce or spices, but nothing has ended up catastrophically. Finally, my boyfriend is vegetarian while I am not, but this cookbook allows me to cook for both of us, with good vegetable and tofu-based recipes. A positive recommendation.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "All the recipes I've tried so far have been delicious! The crabcakes, the vegetarian paella, the strawberry-kiwi cream tart...I could go on and on. I would recommend this book to anyone who enjoys great-tasting healthy food - and I can't think of a reason why anyone wouldn't. I just wish it had a few color photos inside to show how some of the dishes should look; that's always helpful in any cookbook. Nonetheless, it's a handy book I'll be using again and again.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have been so impressed with the recipes and information contained in this cookbook. Everything that I have tried has been so delicious. Recipes from this book have become my family's favorites - the ones that are most requested. I particularly recommend the recipes for poached salmon and chicken piccante. There is also very good information and tips about reducing fat, making substitutions, and being more health conscious in your cooking. I definitely recommend this book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "kid food rachael rays top 30 30minute meals",
        "description": "Presents a compilation of the author's 30 best recipes for comfort food, including Italian-style mac 'n cheese, 30-minute shepherd's pie, and ziti with sausage and beans.",
        "authors": "['Rachael Ray']",
        "infoLink": "http://books.google.nl/books?id=dR6TAAAACAAJ&dq=Kid+Food:+Rachael+Ray%27s+Top+30+30-Minute+Meals&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you want bang for your buck, pick up Rachael's 365 book instead of this one. The recipes here are mostly found in that book as well. These recipes really aren't all that innovative, as far as kids recipes go (you already know how to cook hot dogs and grilled cheese sandwiches, right?), and the Rachael Ray 365 book has lots more information about altering recipes to suit your needs and other really helpful hints.",
                "review/helpfulness": "92/96",
                "num_reviews": 96
            },
            {
                "review/text": "This title and three others like it by Rachael Ray in the 'Top 30 30 minute meals' series are, for the content, relatively expensive and inconveniently sized volumes of recipes reprinted from Rachael's previous books. Looking through two of the titles I recognize every recipe I see from earlier books. While Rachael is the nominal author of these books, I fully believe they were assembled by her publisher and a copy editor with maybe a day's input from Miss Rachael for all four books together.This is becoming a common practice among major cookbook authors, with Mark Bittman's re-releasing his 'How to Cook Everything' in three volumes, cumulatively more expensive than the original book.One may for a moment equate these books with the music world's 'Best of' releases, but the experience is simply not the same. A 'Best of' album's tracks are based on a genuine audience vote with their purchases and air play. These recipes are simply Rachael's opinion and that of a few of her colleagues. The parallel also breaks down in the sense that listening to, for example, 'The Who's top twelve hits introduces you to a whole new experience of listening to 'My Generation', 'I'm Free', and 'I Can See for Miles' on the same album.My 3 star rating is not based on the quality of the recipes. It is a warning that these volumes are, in fact, reprints and not new recipes. So, if you already own many or most of Rachael's books already, you may be disappointed if you buy these books.One other consideration if you do NOT own any of Rachael's books is that for not too much more money, you can get 10 times as many recipes in her 'No Repeats' book of almost all new recipes.In every way, this is a better purchase than one or all of these minibook samplers. With this kids book, you would also do much better in getting the similarly priced but larger 'Cooking Rocks' book.",
                "review/helpfulness": "75/87",
                "num_reviews": 87
            },
            {
                "review/text": "It is true that most of these recipes can be found in Rachaels 365( highly recommend ) but the true charm of this book is that it's kid friendly. Some reviewers say who needs to know how to cook hot-dogs and cheese sandwiches? They are missing the point of this book, it's meant for the young-ones and my children(ages 8-11) love the simple recipes and really enjoy preparing their own meals. For the children I would rate it a 5, but for the adults looking for something new from Rachael they should look elsewhere. So my rating is a 3 taking these factors into consideration. Thanks...",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "I got this book a week ago and tried two of the recipes (tomato/basil soup and the 4 cheese grilled sandwich) they were great! So far the book has lived up to it's name. My daughter is 15 months and LOVED the soup and sandwich. This was the first soup that she would eat without spitting some of it out. She kept wanting more and ate 1/2 a sandwich as well. I can't wait to try the other recipes.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "I can't believe this is supposed to be a book dedicated to kid food!? It's dedicated to all those picky eaters out there.... hmmm. This book contains mostly recipes that will not fly on my 3-1/2 year old's plate, and the rest are repeated recipes from her other books. I'm glad I just took this out from the library. I think these recipes would work well with 8 year olds on up, but that's just my opinion. As always, check your library first before wasting your money.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "Getting kids to eat food other than peanut butter & jelly, and chicken nuggets is a struggle for many parents. In this cookbook of kid food, Rachael Ray has tried to enliven children's' repertoire of foods to include eggplant, succotash, and lots of yummy green plants. As other reviewers have noted, however, be aware that this cookbook is a compilation of some of Rachael's previous recipes from other cookbooks. If you are a collector of her recipes, be sure to peruse this book prior to its purchase.Some of my kid's favorites include: Homemade Chicken & Stars Soup, Broccoli & Bow Ties, Sesame Noodles, Cashew Chicken, and Supreme Pizza Pasta Salad. Enjoy!",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "At first glance, I laughed. All of the recipes list several ingredients, and many have a bunch of things that I didn't think my 3-year old would really be interested in...but I was SO wrong! First, and most importantly -- the food is awesome! Second, it really does take 30 minutes or less for her meal plans. (I timed it!) And third, my 3-year old has eaten everything (even though some of them I leave out certain things) that I have made from the book. It's a MUST have for your collection of books that you will use regularly.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "How many Rachael Ray cookbooks do you own? That's an important question when considering this book because you may already have some of these recipes in other cookbooks (such as Rachael Ray: 365) by this delightfully speedy provider of zesty dishes.Here's another question: How much \"fixing up\" will your kids tolerate? My four were always on the conservative side. Here's an example. Our oldest would go into a restaurant and order a grilled cheese sandwich as follows (and this was before he ever saw Jack Nicholson's famous scene in Five Easy Pieces): \"Here's how to prepare my grilled cheese sandwich. Put American cheese slices on plain white bread. Do not toast or grill the bread. Do not add tomatoes, ham, or anything else. Put a small container of mayonnaise on the side, but not touching the bread.\"Almost all of these dishes are too adventuresome for what our kids would have tolerated with a few exceptions: cheesy popcorn, chicken cutlets, chicken and stars soup, chicken and dumplings, stuffed potatoes, and fettuccini all'Alfredo. So if your kids groove on Kraft macaroni and cheese and see vegetables as evil, they may not be ready for these dishes,However, if you enjoy kid favorites . . . and would like a more adult version, you'll be pleased very much by this book and its recipes. The ingredients are well chosen, and the herb and spice selections are inspired. Consider the quesadilla recipe. Most people put in some American cheese, diced chicken, and perhaps some cut up tomato bits. Ms. Ray adds a little finely chopped onion, a palmful of chopped cilantro leaves, a Serrano pepper, coarse salt, a half pound of chorizo (smoked sausage from Spain or Mexico), a touch of barbecue sauce and a blend of Mexican cheeses. As you can see, that's a novel and interesting dish. Not all the dishes are upgraded as much, but there's always at least a little element of sophistication added in time-efficient ways.Be aware that this book has only 30 recipes in it (along with some side dishes). But it's quite compact. You could easily fit it into a purse or pocket to take along to cook at an event where you've been asked to prepare food away from home . . . or when you are on your summer vacation if you prepare meals sometimes.One of the beauties of this little gem can be found in the close-up photographs of the dishes. With these visual images to stimulate you, the food presentation will undoubtedly be improved. It just made my mouth water to look at these luscious images.Dig in!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was so disappointed with this cookbook that I returned it. The recipes are not kid friendly and include abnormal ingredients that we would not normally have and that kids often don't like. As an alternative, I stumbled across a fun cookbook that my kids love called \"Gross out Cakes.\"",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I thought this book had some great recipes but most didn't strike me as very kid friendly. There were a few but not that many.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "grilled cheese 50 recipes to make you melt",
        "description": "A delectable guide to one of America's popular comfort foods offers an assortment of fifty taste-tempting recipes for the ultimate grilled cheese sandwich, along with new twists on old favorites, cheese suggestions, easy-to-make mustards and garnishes, and tips on selecting the perfect bread for each sandwich. Original. 17,500 first printing.",
        "authors": "['Marlene Spieler']",
        "infoLink": "http://books.google.com/books?id=JrgvSyxIFwUC&dq=Grilled+Cheese:+50+Recipes+to+Make+You+Melt&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Marlena Spieler's new book is just fabulous. Not just the recipes but the mouthwatering photography by Sheri Giblin. In addition to the grilled cheese recipes, there's a detailed discussion of which cheeses and breads to use, and an accompaniments section with recipes for homemade tomato soup and zucchini pickles, as well as a salad summary.I know what I'm having for lunch, grilled American cheese on white bread with tomato soup. Although, that may disappoint the author, as she says, \"American cheese is probably the most famous processed cheese. Don't expect to find it in this book. Why choose processed cheese when there are so many fabulous cheeses to choose from?\" (p. 17) Well, first off, I'm in a reminiscent mood. Second, I have the ingredients in the house. But I promise, next time I hit my local cheese shop, I'll have to get some Telleggio and make the \"Austin Powers' Shag-a-delic 1970s Grilled Ham, Cheese and Pineapple\" or some Gruyere for a classic \"Croque Monsieur.\"",
                "review/helpfulness": "38/43",
                "num_reviews": 43
            },
            {
                "review/text": "Who doesn't love a warm, comforting grilled cheese sammich when the weather gets cold? Some good bread, a few slices of cheddar, butter, and a big crunchy pickle is heaven to me! Throw in a side of tomato soup and we got a winning combination!I always thought I was creative when I took spinach, pears, and brie and made a very classy little grilled cheese pressed between some heavy skillets. However, Marlena Spieler - a long time writer for Bon Appetit and author of many cookbooks - has brought grilled cheese to a new level. Her book Grilled Cheese: 50 Recipes to Make You Melt is just the thing to bring a creative comfort to your kitchen during the cold season.The book starts out with a comprehensive review and introduction. She begins by covering various types of cheeses (blue viened, soft, cow, goat, semi-hard, spiced, bloomy rind, smoked and so on in extremely specifc subcategories) and how each can be perfectly utilized and paired for your own creative uses. All are accompanied by a short description describing their general flavors and properties. Since one may not be able to eat a whole wedge of cheese, Spieler also considers the proper storage and handling of cheeses. To further aide the grilled cheese selection process, a section covering breads, meats, fuits, chutneys and so on are all covered so that your experience with her recipes and your own home concoctions! At the back is even a resource guide on where to find good cheese stores or markets, and suggestions on finding local cheeses.But how do the recipes stand up? Perfectly. Rob and I have already found a few favorites, ensuring that we now keep a few select cheeses on hand, and nudging us to always experiment with a new piece of stinky goodness. Rob's current favorite is the Mediterranean Meltdown; tomatoes, Mahon cheese, and fresh thyme on olive bread. We threw in some sauteed red onions as well for a truly filling and rustic sammich!I've become partial to the fresh mozarella, fig jam, and prosciutto for it's sweet and salty sensations. The raddicchio, Roquefort and toasted pecans on pain au levain is another delectible tid-bit that goes well next to a blazing heater or roaring fire place.Breaking out the heavy skillet is definetly part of the charm, but don't think that some of these don't mix it up. Classics such as the tuna melt are revamped. Recipes calling for home made chili aioli, and fruity chutneys make for a flavorful and fun experience and a perfect excuse to visit local farmer's markets. Desserts, salads, and a classic accompaniments also adorn the book, and well as a small section for a few homemade mustards to keep things spicy!The book is filled to the brim with gorgeous photos any photographer would envy. Sheri Giblin, a local San Francisco food photographer, has done an excellent job bring each and every recipe to life. Luckilly with grilled cheese being such a simple fare, many times yours will look much like the photo. Mine have to my total surprise.[...] I highly suggest you go order a bargain book copy. Mine has one or two stickers on it, but really, who cares? The book has tons of great ideas, and will fill you with inspiration for simple meals, and fun lunches with friends.Overall, the book is shibby, affordable, and truly cheesy.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "You think you know grilled cheese sandwiches? I've been eating them for decades. But this slender volume expands one's imagination about what a grilled cheese sandwich can be! I am pleased that one of my Amazon friends brought this book to my attention. . . .As the author, Marlena Spieler, says at the outset: \"Crisply toasted in the pan or broiled open-face to a melty sizzle, there are few things more enticing than a grilled cheese sandwich.\"An early part of the book focuses on \"A Guide to the Grilled.\" Such hot topics as the following are addressed: What kind of cheese to use? What kind of bread to use? What extras might work? For instance, with a standard grilled cheese sandwich, I find that a tomato inserted into the sandwich adds a nice touch. And so on. . . .I'll begin with my favorite--Croque monsieur. The recipe in this book is quite a bit different than the simple version I make. I put some Swiss cheese (I like to use gruyere) and boiled ham inside of bread, slather the outside with butter, and fry it up. This version, instead, broils the sandwich. It really sounds tasty, so I suspect that I'll soon be experimenting.Another recipe in this book that caught my fancy: Panini Inglese. This tidbit features rare roast beef, blue cheese, and watercress. Using a panini press (I simply must acquire one of these!) or skillet, you heat this up and enjoy the result. The picture of the resulting sandwich is awfully tempting.And then there is the New Orleans version--Muffaletta. I've enjoyed these over time (although I haven't consumed as many as I'd like!). With this recipe, I think I'll create a few of these treats at home.And so many more (about 50 in all). At the close, the author adds \"accompaniments,\" salads, side dishes, mustards, and so on.If you like grilled cheese sandwiches, this is a nice resource. I look forward to expanding my repertoire of recipes!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I remember buying \"Grilled Cheese: 50 Recipes to Make You Melt\" from the school vendor who comes by three or four times a year purveying his wares. I nearly always buy a cookbook. A cookbook of grilled cheese sandwiches was just too intriguing to let pass.If you think you know grilled cheese sandwiches, you don't, at least not these prepared by Marlena Spieler with photography by Sheri Giblin. The photos make you want to reach in and grab that yummy sandwich; the recipe titles alone are just divine! On the same page with the fig jam/cheese on panini is Rare Roast Beef with Blue Cheese and Watercress grilled on sourdough rolls.That is one of the unusual aspects of the cookbook: all kinds of cheese are described, types of breads, and that \"little extra something\" that goes inside, as well as cooking techniques. In the back, accompaniments are included with their recipes. Things like Tomato soup, various salads, side dishes, and sweeties.How about some Fresh Ginger Mustard or Sun-Drenched Mustard with a Whiff of Citrus (recipes included) to go with a sandwich, but not simultaneously! Would you like to try Crisp Little Roquefort Sandwiches with Gingered Beet Marmalade? Or from the South of France Blue Cheese and Gruyere on Banquette bread and broiled. Or sliced tomatoes, toasted walnuts and goat cheese on panini bread, then toasted.The book is a veritable walk through cheese and bread land. If you love both and are willing to delight your taste buds with exotic combinations and flavors, then this is the book to take to the kitchen!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "First of all, I'm amused by the bizarrely aggressive reviewer above. Umm, it's grilled cheese - relax.Trust me, this book oozes with great content. The recipes include the relatively simple- putting together a special grilled cheese with one of the many well-thought out selections of breads, cheeses, seasonings and accompaniments (like chutney, spicy greens or pickles). Even the simple ones are not combos that I would have thought of, like the tasty Panini Inglese, built from classically English treats like Stilton, watercress, and roast beef.The book also includes some recipes that are a bit more involved, like the Hot Muffaletta or the Sage, Sausage and Jack Cheese Sandwich with preserved lemons. It's a wonderful exploration of grilled cheese, and I think you will be impressed. I'm certainly enjoying it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I run the offical Grilled Cheese Blog (search for it) and I have to say that this is the HANDS DOWN authority book on the subject of Grilled Cheese Sandwiches. I love the philosophy behind this book.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Marlena Spieler, Grilled Cheese: 50 Recipes to Make You Melt (Chronicle, 2004)There's something about grilled cheese that just plain works. Some bread, some butter, some cheese, some heat, and presto, instant comfort food. Now, be warned, Spieler's recipes aren't your momma's grilled cheese. You won't find a slice of Kraft Processed Imitation Cheese Food anywhere between these covers. Spieler covers a spectrum of cheeses, breads, and interesting fillings in these fifty recipes, ranging from the relatively normal (her take on the fabulous pressed Cuban Sandwich) to the kind of thing that most grilled cheese freaks are going to find way out there (I just bought myself a brace of pears so I can try some of the grilled cheese and pear recipes). I have to say, I do wish some of the photo space had been sacrificed for another dozen or so recipes; it seemed almost as if Spieler were just getting off the ground with this concept, and obviously, given the concept, there are endless variations to be discussed. But what's here is pure gold. ***",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The recipes in this book are great, but the ingredients are often expensive and probably not something you would buy and want to eat for a few days straight in a week to make it worth it.Absolutely delicious, though!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "kripalu cookbook gourmet vegetarian recipes",
        "description": "Drawing from the philosophies of the famous yoga and health center, a collection of more than three hundred healthy vegetarian recipes provides an introduction to Indian cooking, provides recommendations for preparing meals for children, and includes tips for party planning and entertaining. Original.",
        "authors": "['Atma Jo Ann Levitt']",
        "infoLink": "http://books.google.com/books?id=nBzQoAEACAAJ&dq=Kripalu+Cookbook+-+Gourmet+Vegetarian+Recipes&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I recommend this book to anyone interested in cooking vegetarian. The tofu basil lasagna alone is worth the price of the book, and I've even pulled off making it for a Christmas dinner (the die-hard meat eaters had no idea, and even had seconds!).The muesli recipe is excellent, and I've made the garlic green beans a staple in my house.The only drawback is that there is no nutritional information provided, which is a drag for label-readers like myself.It may be a silly point, but the book holds up pretty well in the kitchen, what with sauce and splotches mucking it up, and if it ever gets REALLY messed up, I would pay the money to replace it.Hope this helps anyone with a decision.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "Out of 12 recipies I made, my family only liked 3 of them. Spinach lasagna, rainforest bars, and whole wheat bread. There are several errors in the book, so pay attention and calculate amounts carefully. The prep and cooking times are low. Two hours usually means a little more than three. Everything looks delicious but it's not all that easy to prepare. Some of the ingredients are a little difficult to find, too.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "I like reading cookbooks. I mean, I like reading cookbooks in the same way that I like reading novels. If that's true for you as well, this book is a good choice (only beware, there are no pictures). As far as utility purposes go, this isn't a book for the casual chef. Many of the ingredients are obscure and many of the recipes call for over 10 ingredients. I disagree that it holds up well in the kitchen - I've only actually made a few recipes from it (I agree wholeheartedly about the Tofu-Basil Lasagna - but you can use regular white vinegar instead of umeboshi vinegar) and already some pages threaten to fall out.I also value a cookbook that can convince me that its recipes have been thoroughly tested. I hate feeling that the money I've spent on the book and on the ingredients (for this book, the ingredients can get costly) as well as my time and effort were all just to satisfy a whim some chef had - instead of concrete evidence that a meal will be tasty. The Kripalu cookbook includes little stories about each recipe that I really appreciate and trust.If I had unlimited funds and didn't have to work full time, this would be a primary resource in my cookbook collection. As it is, it's definitely a major player in my casual &quot;flipping through&quot; collection.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book is wonderful if you like 70's type vegetarian food. I worked in the kitchen at Kripalu for a fair few years recently and we never used this book.The menus and complexity of the food has improved and matured over the years. So I would wait until the new book comes out in the next few years.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "whether you've been to Kripalu or not, their food is wonderful. If you have been there, this book will be treasured as it offers the chance to recreate some delicious and very healthy dining experiences. Try the Greek Tahini salad dressing and the tofu-basil lasagna!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I love this cookbook &amp; have given it to many friends! The recipes are easy &amp; very tasty. Who says that eating healthy needs to taste bland? This book is good for beginners &amp; more advanced cooks. I would highly recommend it to people who want more variety in their already healthy diets.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book came to me highly recommended from a great friend who owns a gourmet deli in Door County,Wisconsin, named &quot;The Singing Bowl&quot;. Her clients love any of the recipes used from this book. I especially like the options for desserts that do not have sugar! If you remember 'Magic Cookie Bars' from your childhood, you will love 'Rainforest Bars'.Overall a great book for serious and amateur vegetarians.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have been vegetarian my entire life, and have often had limited meal options available (school lunches, restaurants, etc). Now as an adult, and now that pursing good health (and vegetarianism) are more desirable than 20-30 years ago, I have read many vegetarian cookbooks to create healthy and tasty meals. I currently own about 30 cookbooks based on a vegetarian diet. The Kripalu Cookbook is one of my top three favorite books in the collection.The first challenge (for me) with vegetarian cooking, is that many cookbooks cater to diets for people have previously been meat eaters. As this is not the case with me, I do not need to go through any elaborate process to recreate the meat-eating experience. I simply need to put together a well-balanced vegetarian meal. I am a busy single parent, who is raising a vegetarian child, so I prefer cookbooks that are straightforward and without excessive steps. Recipes must accomplish: simplicity, be kid-friendly, and be sophisticated enough that I will enjoy the meal. I have found that this book contains all of these qualities.There are some more labor intensive recipes, but I save those for the weekend. This book has been marked with so many notes and post-it's, that when I go to get a cookbook from the bookshelf, my daughter walks up to the Kripalu book and says, \"I think you are looking for this one, Mommy\".Happy cooking. :)",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This cookbook is wonderful, the recipes are easy to follow and they are really good. For vegetarian cooking it offers such a wonderful variety of creative dishes, sauces and salads. The flavors paired together in this cookbook are as interesting as they are delishous. Also, there is a wide variety of types of foods and cuisines which draw from all parts of the world, A+++++!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I love the earlier cookbook KRIPALU KITCHEN and use it all the time for simple, nutritious and tasty recipes that call for simple, basic ingredients. If you have fresh fruit and vegetables and good supply spices and dried herbs on hand, some butter, flour, soymilk, tamari sauce and perhaps some tofu, you've got all you need to create most of the wonderful recipes in KRIPALU KITCHEN.THE KRIPALU COOKBOOK was written later on after Kripalu became corporate and changed its image from ashram to upscale health spa and the cookbook somehow reflects the change...recipes are seem just a bit more complicated and call for more ingredients...still very good but not as simple and versatile as KRIPALU KITCHEN.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "la dolce vegan vegan livin made easy",
        "description": "Sarah Kramer is a vegan cooking superstar. Her first two books, How It All Vegan! and The Garden of Vegan, co-authored with Tanya Barnard, have sold well over 100,000 copies; How It All Vegan! won the Veggie Award for favorite cookbook of 2004 by VegNews magazine, and Herbivore magazine, in a cover story on Sarah, called her \"The World's Coolest Vegan.\" Sarah returns with her first solo cookbook, featuring more of the delectable, easy-to-prepare recipes that vegans around the world have come to adore. For Sarah, vegan cooking-which eschews all animal products, including butter, milk, and cheese-can be an adventure in dining, without a lot of investment in time or money. In fact, most of the recipes in La Dolce Vegan! can be prepared in 20 to 30 minutes or less. From soups and salads to entrees and desserts, they are sure to inspire both committed and part-time vegans alike. At the heart of the book is Sarah's wholehearted commitment to the vegan lifestyle that has changed her life completely-from a childhood plagued with health problems to an adulthood filled with the pleasures and joys of living vegan. For Sarah, an animal-free diet will make you happier, healthier, and more content with the world around you. In addition to the wonderful recipes, there is a fun do-it-yourself section of vegan tips and non-food items. Learn to live the sweet life of veganism and you'll never look back! Recipes include: Beauty and the Beet Borscht, Mocked Clam Chowder, Roasted Cherry Tomato Pasta, Sloppy Janes, Blessed Broccoli Stir-Fry, Apple Pie Pancakes, Carob Almond Truffles, and Tomato Soup Cake. Sarah Kramer is the co-author of How It All Vegan! and The Garden of Vegan. She lives in Victoria, British Columbia, with her husband, where she manages a tattoo shop in addition to creating her vegan masterpieces and maintaining her popular website www.GoVegan.net.",
        "authors": "['Sarah Kramer']",
        "infoLink": "https://play.google.com/store/books/details?id=OK02DwAAQBAJ&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "Le Dolce Vegan, the third cookbook by Sarah Kramer is a true joy. I have over three hundred cookbooks, but Sarah's blow my socks off. They're also some of the ones I use the most, even when cooking for non-vegans. Why?Her books are not only full of the most delicious, mouthwatering recipes ever, but they are also full of cook cooking tips, nifty crafts, pop culture, and humor. This and the two preceding books she did with Tanya Bernard I have read though and through before I ever cooked out of them, just because they're fun! Sarah is also down to earth, and her books aren't preachy like other vegan books. No guilt trips here. Just good food. How good?Wow! Not only is this book full of many yummy general recipes, the deserts in this book are to die for. Yum! Sarah also tells us how to make our own faux meat from scratch, so no more having to buy the pricey stuff from the heath food store. 95% of the ingredients used are simple things every grocery store has, and when something even semi-exotic is used, a common counterpart that can be substituted is named. Most of the recipes make 4 small or 2 large helpings, and can be made in 20-30 minutes. I appreciate this so much!I know that I'm ranting on and on, I just literally can't say enough about Sarah or this book. If you or someone you know is vegan, or even if you want to eat healthier, I can't recommend this book enough! It's just too much fun!",
                "review/helpfulness": "96/100",
                "num_reviews": 100
            },
            {
                "review/text": "As an enthusiastic fan of How it all Vegan and Garden of Vegan, I'm sorry to say I was very disappointed with this book. La Dolce Vegan is overloaded with stirfrys and other simple recipes you could pretty much figure out for yourself. There are also a lot redundant recipes for the same dish, and just silly fluff like chocolate-covered pretzels that nobody needs a cookbook to make. There may some gems in this book, but they get lost in a sea of what seems to be filler.Also, I would have to agree that it is pretty obnoxious that there are more pictures of Sarah Kramer being cute and quirky than there are pictures of the actual food, especially since many of the recipes are credited to other people.I was once told that a cookbook is a good purchase if you find just a handful of recipes that you enjoy enough to start making regularly, but I didn't find any such recipes with this book. I didn't even pick up any useful cooking tips. Pick up the first two books from this author if you like, but skip this one.",
                "review/helpfulness": "56/63",
                "num_reviews": 63
            },
            {
                "review/text": "So you know how the internet is chock full of weird recipes by everyone and their grandmother involving ketchup and mustard as the main seasoning ingredients and how most of it tastes only palatable?Well, sadly, that's this cookbook in a nutshell.I've tried six of these recipes and they all failed to pass muster in much the same way unrated recipes off the internet tend to. This doesn't surprise me too much since most of the recipes are actually recipes sent to the author by her fans and her friends. A nice thought but she really should have done some serious culinary editing. If a free recipe I've jacked from some website bombs I just shrug my shoulders - I should have known better. If a recipe from a cookbook I've payed about 20 bucks for bombs I get a little tetchy.Sometimes people don't like a vegan or vegetarian recipe because they've never eaten tofu before or think that tahini is the misspelled name of a pacific island and why is it being called for in this recipe?! Sometimes people just aren't used to the way carob chips taste and get testy when they were expecting them to taste EXACTLY like chocolate chips. This is not my problem. I've been vegetarian for 12 years, vegan for 1 year, I grew up in a hippie household eating health food and I've been cooking for myself since I was ten.I feel sad about having to write such an unfavorable review. Sarah seems like someone I would really like and the book does have a section of fun vegan stuff (plus cute retro pics of Sarah) that aren't without merit. However since her book is marketed as a COOKbook and not a neat-vegan-stuff book I feel obligated to warn other not terribly wealthy vegans to save their cash. If you want to know how to make a vinyl cuff that says vegan on it or think pictures of Sarah Kramer being silly are worth 15 dollars than go for it. If you want delicious vegan recipes look elsewhere.",
                "review/helpfulness": "51/60",
                "num_reviews": 60
            },
            {
                "review/text": "There are lots of reasons to love this cookbook: the aesthetics, the fashion tips, the motivational text. But the real reason you should own this cookbook---and the two previous volumes as well, which were co-authored by Kramer---is the fact that the recipes rock: they are simple, creative, easy and delicious. So many cookbooks are inaccessible in that they are unrealistic: yes, the recipes might be wonderful, fanstastic, even inpirational, but most of us want fast and simple. There are some \"complex\" recipes in here, too, but for the most part, these are dishes that are in the 30-minute- or-less range. Sadly, a lot of the better vegan cookbooks out there are very involved, time-consuming and full of obscure ingredients.That said, this cookbook is not perfect. It could stand one more good editing. I could list all of the small mistakes I found (such as places where ingredients were listed, and then not mentioned in the actual part where you assemble/cook the recipe). But these omissions are minor, and there aren't many of them. Little mistakes in cookbooks can spell disaster, but the oversights, at least the ones I've found, are all obvious and inconsequential.My biggest suggestion for this cookbook would be more tips on how to improvise some of the dishes (Vegan With A Vengeance is full of suggestions on how to alter recipes based on what's sitting around in the refrigerator). Several of the recipes I've made lend themselves to a multitude of variations. This would have made an already good cookbook great.",
                "review/helpfulness": "57/58",
                "num_reviews": 58
            },
            {
                "review/text": "I'm not going to rave and rave about this book like everyone else. It is merely \"aw-ight.\" I do appreciate Kramer's commitment to veganism and her personal thoughts about that, but the many, MANY pictures of her on, like, every other page get corny after a while. Many of the recipes are things that any halfway creative person that had a clue could pull together on their own. I think the book could have used some editing, both for bulk (like nixing some of these no-brainer recipes) and for correctness: there is a recipe for a sauce that tells the reader to mix two powdered ingredients in a blender and makes no mention of water or any liquid. Hello!?!",
                "review/helpfulness": "27/34",
                "num_reviews": 34
            },
            {
                "review/text": "I am a fan of the previous two cookbooks in this series, but this one doesn't have much new to offer. Many of the recipes are from other people and there seems to be a lot of typos, which makes me doubt that all of the recipes were tested. Also the author's photo is on almost every page. Shouldn't the photos be of the food? Or how about no photos at all? It's distracting and self-absorbed. The index, as in the previous two Sarah Kramer vegan cookbooks, is virtually useless. There are no footers on the pages, so you have to page to a section's start page to know where you are in the book. There are some good recipes but I don't think I will buy Kramer's inevitable sequel.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "The lack of editing in this book is painful. The recipes are simple and the amount of pictures of Sarah are just plan tacky. If you just want pictures of Sarah this is the book to get. If you want a good cook book you'll have to keep looking.",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "I used to own all of Sarah Kramer's books, but have given them away. They came highly recommended, but I found them to be too simple, and almost insulting. I mean, does a person really need a burrito recipe, or a fruit smoothie recipe?Plus, many of these recipes were contributed by fans, and since I got iffy results from them (and have friends who got the same iffy results), it makes me wonder if they were even kitchen tested before being considered for the book.Unrelated to the recipes----I would have preferred if investments had been made in a few really nice, color photographs of the FINISHED DISHES, rather than multiple, black & white photos of the author. Is it a cookbook, or a personal photo album?",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I was really excited to get this cookbook, but I was disappointed after looking through it. It has some good recipes (the banana bars are the best), but I think the author actually only provided a few of them. It seems like half of the recipes (or more) came from someone in Florida named 'Wolffie'. I recommend 'Vegan With a Vengeance' instead.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "Not sure exactly where the recent negative feedback is coming from on this book. I've been vegan for over ten years now. When my omnivorous guy and I got engaged, my mother-in-law didn't know anything about veganism or vegan cooking but was incredibly open to it--she thought it was an interesting new culinary challenge (yup, I lucked out in MIL department). This was one of two cookbooks she got.Let me tell you, the recipes out of this book are AMAZING. They are very easy--anything that requires over 30 min of prep time is marked with a little clock, and the ingredients are very accessible. My MIL, with minimal experience cooking vegan, has made incredible feasts with this book.For example, not only did she use it for holidays (Thanksgiving & Christmas); this cookbook was also the basis for a vegan-friendly bachelor party on the request of one of my fiancee's friends--all with fantastic results. Friends of ours have asked for the recipe to the fantastic chocolate frosting that for once isn't made out of chocolate chips, and the cake (a depression-era crazy cake with tofu that even my tofu-phobic brothers enjoyed and asked for more) to go with it. Just a moment ago, I finished a lunch of leftover fantastic peanutty soup that I made from a recipe in this book. I think we've found one recipe in the book that didn't really work well (a pie crust recipe), but everything else we've tried so far has been GREAT. In fact, MIL loaned us the book, and I am hard-pressed to give it back any time soon :)Some recipes make a lot of food, but I like Sarah's idea of just inviting over friends for a dinner party to use it up, or I just freeze/chill it and eat it for lunch at work. I especially appreciate Sarah creating recipes that use whole cans of ingredients. Recipes that require half the can, leaving you to strategize using it up or leaving it to rot forgotten in the back of the fridge, drive me crazy.I also appreciate that Kramer is very down-to-earth and not preachy--being vegan is at least as much about celebrating fantastic food as it is making a political point.Sorry to gush. Yes, the recipes are easy, and sometimes, yes, they could be things that you might come up on your own. But for those of us with \"cook's block\", or those new to vegan cooking, this is a very good start.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "cook what you love simple flavorful recipes to make again and again",
        "description": "Picking up where \"At Blanchard's Table\" leaves off, this all-new collection of 100 easy-to-prepare, refreshing, and distinctly homemade recipes draws upon the authors' extensive travel and years of celebrating meaningful indulgence. 80 color photos.",
        "authors": "['Robert Blanchard', 'Melinda Blanchard']",
        "infoLink": "http://books.google.com/books?id=ONMYAAAACAAJ&dq=Cook+What+You+Love:+Simple,+Flavorful+Recipes+to+Make+Again+and+Again&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "`Cook What You Love' by restauranteur / authors, Bob and Melinda Blanchard belongs to an odd class of cookbooks which has no interest in teaching you how to cook French or Italian, or simply how to cook, or how to cook fast or how to cook cheap or how to grill or how to entertain or how to cook for your family or how to cook for kids (although there is a section here for cooking with kids). These books have a mysterious attraction that, if it works, makes you simply fall in love with the books, and you can't seem to put your finger on why that is.For me, the paradigm of this type of book is those written by Jamie Oliver. Like his fellow British writers, Nigella Lawson, Nigel Slater, and Tamasin Day-Lewis, Jamie's books seem to effectively communicate more of a lifestyle which includes cooking and eating, than it does simply a set of instructions on how to cook particular dishes. Part (but not all) of this can be explained by the lessons the handlers on the Food Network's `Next Food Network Star' competition shows give to the competitors. You can't be a talking head that cooks. You have to draw your audience into your world and make them want to make your dishes. The flip side of this quality is that when it doesn't work, it can really turn one off. For example, while I constantly praise Rachael Ray's shows and books, I have a hard time buying her constantly effervescent personality. On the other hand, Mario Batali's enormous confidence and force of personality on `Molto Mario' were consistently able to draw me in and really become strongly interested with his love and lore of Italian cuisines.What all this means for this book is that the authors, the Blanchards, have opened their book with the perfect description of this quality, quoted from Food Historian, Barbara Haber, who says `Like all good books, the best cookbooks have a strong voices that lure readers into unfamiliar worlds, give colorful observations about those places, and, above all, reveal a passionate interest in sharing pleasure...' This, of course, exactly fits the title of the book. So, the Blanchards proceed to give us about 100 recipes that are near and dear to their hearts, and some stories about how they came across some of these recipes, or at least the dishes which inspired them to create these recipes.This quality, the Blanchard's call soul. And, I think they communicate almost as much soul as his nibs, Sir Jamie. They certainly do better than Giada De Laurentiis does in her two cookbooks, which don't quite capture the genuine love of food she shows on her Food Network show.One thing to keep in mind with books of this type is that they will not teach you to cook. Like a travel book, it assumes you already know how to get a passport, book passage on trains, planes, or boats, pack an effective suitcase, and get the appropriate film for your camera. It does say, before you get to the goodies, a few things about which techniques and ingredients are really important. These are all things you should already know. They are just reminding you that planning and a good pantry will make a big difference in enjoying your cooking.A few things that strengthen my opinion of this book are the chapters on neglected subjects such as breakfasts, sandwiches, and kids cooking. I especially like the fact that the sandwiches are quite simple. They seem to loose their whole point when they take much more than 10 minutes to make, not counting makeahead time for spreads, but even those should be relatively easy. For example, the egg salad has only half the ingredients I put in an egg salad, in spite of the fact that it adds an unusual ingredient (crumpled bacon).Most of their stories, interspersed among the recipes, are about their lives divided between Vermont and their restaurant in Anguilla. There is little about how they arrived at this split existence, but that seems to be in an earlier book, `A Trip to the Beach'.This book is for the cookbook reader who knows their way around the kitchen, and, ideally, has a family or at least some significant other with whom to share these vicarious experiences. If you live alone, much of the charm may be lost, as you have no way to recreate, for example, Bob Blanchard's breakfast in bed treat for his wife.Overall, I find these recipes to be delightfully simple, presented in a way that really makes you want to make them. I can't say the personality comes off the page quite as strongly for me as I get form Oliver's books, but that may be because I've formed a strongly positive reaction to Sir Jamie through his TV appearances.This is a perfect book for a cookbook discussion club (if such things exist outside my wishful thinking). Like similar books from Ina Garten and Sara Foster, and Sara Moulton, they are just long enough and just inexpensive enough to make them a worthy purchase for someone who doesn't want to sink a lot of money into cookbooks.All recipes give prep times and cooking times and, as usual, they are times for a person with well-practiced knife skills and an arsenal of sharp knives. If you shrink from an 8-inch chef's knife and use a stamped peeling knife, these prep steps will take longer.Great reading and very respectable recipes, easy, but not simple-minded.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "So...with all the free recipes online, why would I need to buy cookbooks? The authors address this question in the introduction, and I agree with the answer they quote in their book:\"Like other good books, the best cookbooks have strong voices that lure readers into unfamiliar worlds, give colorful observations about those places, and, above all, reveal a passionate interest in sharing pleasure.\" (Barbara Haber, food historian.)Online recipes (not the food described, but the writing style, if that makes any sense) are usually straightforward and colorless. \"Do this. Do that. Don't let this happen.\" The recipes in the best cookbooks, on the other hand, imply the outlook of their writers. \"Do this, because it will make your tongue melt. I did that the other day, and while it isn't for everyone, it made me want to dance around naked.\"*The recipes in Cook What You Love are appealing. The first section, breakfast, begins with a short essay about the joys of making breakfast in bed, so while I was reading this section, I was imagining my husband bringing me breakfast in bed. \"Yes,\" I said to myself, \"I would eat Crunchy Coconut French Toast in bed. I would eat Orange-Currant Muffins and One-Eyed Jacks and Spanish Scrambled Eggs in bed...\" It all sounded good. I then asked myself whether I would cook all those recipes if it meant getting up early to do it...well, that one was harder, but I ended up with a \"yes\" there, too. As I read my way through the book, I realized I would cook anything in the book, just so I could eat it, and that, I think, is the mark of a good cookbook.The mark of a really good cookbook is when it can talk you into trying something you normally wouldn't try, either because you don't care for it or it's a pain to make. I found myself actually considering roasting cherry tomatoes, even though I don't like them, just because of the description in the book:\"We're always looking for ways to add color and texture to a recipe. Food seems to taste better if it looks beautiful. Roasted whole cherry tomatoes are a quick, easy way to brighten up a platter of these or any other scrambled eggs. Just toss the tomatoes with a little olive oil, salt, and pepper and roast at 400F for about 10 minutes or until hot and wrinkled. Serve them hot or at room temperature.\"Hm....I'll think about it. I keep promising myself a trip to the farmer's market. Maybe I'll pick up some cherry tomatoes and give it a go.*Also, online recipes usually don't have pictures. Mmmm....it's food erotica.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I read the Blanchard's cookbook in two sittings at Barnes & Noble. The photography is beautiful and the recipes are reasonably simple. I tried the Brown Sugar and Basil Bacon right away and it was a nice sweet change from what is always eaten. And there are others in the book that I am excited to try out.One other nice thing about the Blanchard's book is that it's quite unusual. It has stories of their lives mixed right in with the recipes. If you enjoy reading or looking at cook books \"Cook What You Love\" makes for a delicious read.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is probably the best cookbook that I have ever purchased. So far, I haven't found a recipe that wasn't great and easy to make. Unlike some complicated and unclear recipes found in cookbooks and internet sites, this book lays out clear unambigious tasks while identifying the times and ingredients to make it all happen. Recipes are simple to make and oh, so delicious! I would recommend this book to anyone from a beginner to a pro! Go ahead, buy the book for some Caribbean flavor!",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "It's easy to love --- or envy --- Melinda and Bob Blanchard.They have a charmed life: a restaurant on a Caribbean island so popular that people fly to Anguilla just to have dinner there, a lovely house in Vermont for summer retreats, lifestyle books that sell and sell.But in the end, the early motto of Motown applies: \"It's what's in the grooves that counts.\"That is: These \"simple, flavorful recipes to make again and again\" --- well, do you?We bought \"Cook What You Love\" because \"At Blanchard's Table: A Trip to the Beach Cookbook\" was very much a cookbook we turned to again and again. And not for the entertaining stories about Blanchard's Restaurant, the Blanchards' enlightened management theories and their annoyingly happy marriage --- those passages made for pleasant reading, but only once. The reason to own a cookbook is the food. And here the Blanchards shine.Melinda Blanchard does not begin in the kindergarten --- she assumes you know your way around a kitchen and can crank out a dozen meals good enough to serve to friends. She assumes you have sharp knives and quality pans. She assumes you don't need to be told that fresh trumps frozen, that prepared foods are generally a disguised delivery system for chemicals, and warmth and friendship are essential ingredients in any dish.As a result, Mrs. Blanchard produces stunningly straightforward recipes. You'll need fresh ingredients and a few spices. You won't need much time; nothing takes very long to make. And you won't need to stress, as dinners build around Blanchard recipes somehow seem.... relaxed.Bonus points: great range and great editing. In about 175 pages, Melinda Blanchard not only covers hors d'oeuvres, salads, main dishes, vegetables and desserts, she presents a toothsome selection of breakfast specialties and eight recipes for kids.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A friend gave me this book, and I absolutely love it. The recipes depart refreshingly from standard fare and yet remain very accessible, often by providing a twist on old favorites. Just as the title says, these are wonderful, simple recipes you'll want to make many times.The style of the writing is warm and welcoming, a friendly reminder to slow down and savor the moment. And whose life wouldn't be improved by a little more savoring? :)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "We were told before our recent trip to Anguilla, Blanchard's is simply the best! Not only did we fall in love with the island but with Blanchard's and their newly opened restaurant, Zurra. The food was amazing and each night Bob Blanchard personally greets all the guests. We purchased both this cookbook and another and yes, we have brought it all home. The recipes are easy to follow, quick and are simply delicious. You can not go wrong!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "white trash cooking",
        "description": "More than 200 recipes and 45 full-color photographs celebrate 25 years of good eatin' in this original regional Southern cooking classic. A quarter-century ago, while many were busy embracing the sophisticated techniques and wholesome ingredients of the nouvelle cuisine, one Southern loyalist lovingly gathered more than 200 recipes-collected from West Virginia to Key West-showcasing the time-honored cooking and hospitality traditions of the white trash way. Ernie Mickler's much-imitated sugarsnap-pea prose style accompanies delicacies like Tutti's Fancy Fruited Porkettes, Mock-Cooter Stew, and Oven-Baked Possum; stalwart sides like Bette's Sister-in-Law's Deep-Fried Eggplant and Cracklin' Corn Pone; waste-not leftover fare like Four-Can Deep Tuna Pie and Day-Old Fried Catfish; and desserts with a heavy dash of Dixie, like Irma Lee Stratton's Don't-Miss Chocolate Dump Cake and Charlotte's Mother's Apple Charlotte.",
        "authors": "['Ernest Matthew Mickler']",
        "infoLink": "http://books.google.com/books?id=SzaeduhU2AEC&dq=White+Trash+Cooking&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "I must confess that I resisted buying this cookbook for many years. I am an avid collector of American Regional and International cookbooks, but found the title of this book offensive. I assumed it was written to mock rural whites, a people I know to be hardworking, self-reliant, and decent. I was wrong about this one. This book actually celebrates these people and their cuisine, and is one of the very best traditional American cookbooks in print. Great recipes for fried chicken, catfish, hushpuppies, collard greens, Hoppin John, cornbread, and biscuits, as well as rabbit, squirrel, and yes, even possum. The book has a folksy humor throughout, and the recipes are authentic. Books like this become even more precious as this and other American regional cuisines disappear under a blanket of bland corporate burger chains, sub shops, and pizza joints. Incidentally, several recent medical studies have shown that rural Appalachians who consume this traditional fare are far healthier than those who embrace the modern suburban diet of chain restaurant food! If you have any interest in traditional American cooking, this book is a must-own.",
                "review/helpfulness": "59/64",
                "num_reviews": 64
            },
            {
                "review/text": "I first bought this book years ago, when it first came out-and itshows: the biscuit page has tea stains all over it-so does thepotato-chip sandwich! The latter is worth a try, albeit a tadsalty, but it IS delish. You absolutely cannot fail to make goodbiscuits with their recipe, it is simple, basic, and wonderful.What they do with food is real simple, and the low-priced versionof \"peasant food.\" It is worth it for the pictures in the centeralone, it doesn't put down white trash, it celebrates 'em! Darnfine cooks, too. Really delicious summer produce recipes, andthe tomato sandwich idea is one anyone can relish.This book occupies a proud, and well-used, pride of place in mycookbook collection. Unlike snotty cookbooks where they lookdown on the reader, presupposing a well-laden pantry groaningwith esoterica-this is REAL FOOD, REAL SIMPLE. A tribute to allthe white trash who built this country, and really tasty, too.Y'all try it some, hear?",
                "review/helpfulness": "43/45",
                "num_reviews": 45
            },
            {
                "review/text": "This book is hysterical, tasteless and wonderful. To start off with, the recipes are authentic and they are tasty. Don't even think about looking for anything low cal here. The pictures are priceless, the short stories will keep you in stitches and the recipes will have everyone saying you are a wonderful cook. GET IT GET IT GET IT. If you are a fan of cookbooks you should not be without this one.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "I bought this book years ago when it first came out, and absolutely LOVE it: great recipes, great pictures, down-home real food.Best recipe for biscuits I have ever seen-my book's permanentlystained from use! Even tried the potato chip sandwich, a littlesalty, but delish.You don't have to pay an arm and a leg for pretentious, overpric-ed \"country peasant cuisine,\" you have it right here: polenta'sgrits, baby! A lot of these recipes are solid, delicious food,stuff we grew up on in the Midwest, stuff our granmas used tomake. And if you have ever attended a church social, you'll re-cognize many of the dishes in this awesome cookbook.It's worth it for the center photograph section, for a nostalgictouch, for in the rush to urbanize here in Florida, many roadsidefruit and vegetable stands have been zoned out of existence. Upin the Panhandle you might still find roadside boiled peanut sta-nds(now THAT'S some great eatin'!), and some produce stands-butif you can't go there-try this book-you won't regret it.You might approach this book thinking of it as a joke, or in acondescending approach to white trash(read American Peasants),but once you start to read the anecdotes and recipes, you gain anunderstanding and respect for these tenacious souls.P.S. Try the cheese grits-with Velveeta and Tabasco sauce-thatwill wake you up some!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "My dad always said my mother was a peasant at heart when it came to eating. I am proud to say that I follow her footsteps right to the head of the line at any church social, bar mitzvah, picnics at state parks or cemetaries...wherever homecooking can be had...I will be there. Filled with the recipes we knew as children or have seen other folks eat at rest stops across the country; author, Ernst Matthew Mickler so eloquently sums up this type of cooking by saying, it'll make you lay down on the floor and scream. This book is a national treasure and should be in the kitchen of every American household. Sit back with a cold ice tea and enjoy each and every page. It doesn't get betta dan dis!",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "I LOVE this book....Right now I have a meatloaf and a peach cobbler in the oven the same day my book arrived.After years of eating my own unimaginative cooking ,this book is a godsend, for it tells how to prepare the very dishes my mom and grandmother used to cook.(Not to mention the Baptist Ladies!)The title is just a gimmick...Inside this cookbook is a treasury of soul-satisfying Sothern/Midwestern country cooking that you may remember from your childhood.This cookbook is the ideal gift for newlyweds, college students,single friends, heck ,anybody who like to eat!Hmmmmm...Tomorrow I think I'll make the Buttermilk Fried Chicken.Yum!",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Mickler's self-deprecating portrayal of Southern prole culture is absolutely hilarious! But, even 'though this book is laugh-out-loud funny, it is no mere joke-book. Make no mistake -- these are real recipes that work. I took this cookbook with me when my family was relocated, for my husband's job, to live in Silicon Valley for three months in a corporate apartment and forced to make do with a bare-bones kitchen containing three foil-thin skillets and a rectangular Pyrex baking pan. Amazingly, these recipes were simple enough that I was able to make easy and delicious meals everyday with a minimum of implements and without need for fancy ingredients. This is, simply put, real folks' home-cooking. By the way, you have got to try Irma Lee Stratton's Chocolate Dump Cake! It is the chocolate cake recipe I had been searching for, the moistest and fudgiest chocolate cake I have ever had. You won't even want to add frosting, it's that good!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Yes, I got this as a lark many years ago. As time passed more and more black older people were wanting copies of pages for them selves. Seems they were eating the same stuff down the road, and across the tracks? My mother first thought it was gross, then read the stuff and stopped on this page, and that, and went to the kitchen and cooked up what she had missed for years. Her mothers food. I never thought of patoto chip sandwiches though? But mirical whip and jello live in my mind. And Jesus, Macaroni &amp; Cheese. My son loves hot dog water soup. Go figure.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Growing up as a child in the 50s in Texas, I ate most of the foods mentioned in this wonderful cookbook and they are still the foods I crave, the comfort foods I depend on, and the foods that linger in my memory, binding forever in my mind &amp; heart the beloved grandmothers, aunts, and assorted relatives who fixed my favorites and served them with large doses of love! This book brings it all back...enjoy..enjoy...enjoy.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is priceless. If you are a serious cookbook enthusiast, or just a casual collector, you cannot be without this book. The recipes are all down-home cooking, and some are quite good. There are sandwiches and salads in here that I never imagined! The book is very entertaining, and as stated previously, it is an authentic cookbook. The pictures are also great, and fit perfectly with the recipes. I recommend this book to any cook with a good sense of humor! Enjoy!Kathleen",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "incredible edible glutenfree food for kids 150 familytested recipes",
        "description": "Serving foods that are appetising is no easy task for the parent of a child on a gluten-free diet due to condition such as celiac disease. Forbidden foods -- wheat, rye, oats, and barley -- pervade most recipes and food labels are not always clearly marked. This cookbook, however, can save families time, money, and anguish by providing clear guidelines for selecting ingredients and preparing food safely. But best of all, this is the first cookbook to provide delectable gluten-free recipes formulated especially for children. The rest of the family will want to try them, too. In addition to food recipes, there are tips for cooking substitution, entertaining, a list of resources, as well as a detailed trouble-shooting chart for the gluten-free baker. Sanderson also offers advice on how to deal with situations outside the home that may compromise a child's diet, such as peer-pressure and day care.",
        "authors": "['Sheri L. Sanderson']",
        "infoLink": "http://books.google.com/books?id=b1wNAAAACAAJ&dq=Incredible+Edible+Gluten-Free+Food+for+Kids:+150+Family-Tested+Recipes&hl=&source=gbs_api",
        "categories": "['Cooking']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have a 4-year-old with celiac disease, so I was excited about this book. Unfortunately, when it arrived I discovered that the recipes didn't offer me as many new and different things to try as I had hoped. (I already own 4 other gluten-free cookbooks.) I tried the Breakast Muffin recipe. It was okay. Nothing special. If you don't own any gluten-free cookbooks already, this one may be good for you. Two things really bothered me. First the bread machine recipes never stated the size loaf you were making. I assume 2lb, but that's important info to leave out. Second, I felt that some recipes were included just to fill pages. One page is a recipe for a baked potato. The resources in the back are quite helpful, but you could easily find them other places.",
                "review/helpfulness": "56/60",
                "num_reviews": 60
            },
            {
                "review/text": "When I found out my 3 year old twins were gluten intolerant, I had no idea what to do or where to start. This book offered a wealth of information not only about recipes, but information on the disease as well as excellent resources. Sheri's recipes offered me time saving, excellent recipes to offer my kids. It was nice to have recipes that were already family tested. I was busy enough chasing my twins and entertaining my 6 year old daughter at the time. Not only did my 6 year old prefer the gluten free breads listed in this book over regular store bought bread, but I have had company (not gluten intolerant) tell me the bread was excellent and asked for more! Just last week my sister was here from out of town and I had to ask her to save it for my boys! I specifically like the rice tapioca bread, breakfast muffins, and the chicken with dijon sauce. Another thing I am thankful for is the recipe for gluten free play dough. My kids were able to go to preschool and play with play dough! I didn't have to worry about them getting ill from the other play dough the school provided. Most importantly, they didn't feel left out by not being allowed to play with the schools play dough. I would highly recommend this book to any family, even adult gluten intolerant individuals who want to save time, money, and heartache.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I really loved this book. My son is allergic to wheat, gluten and dairy. This book really opened the door for making alot of foods that my son use to eat, but no longer could have. My husband and I really liked the recipes too. The best part was that the recipes here did not have that bitter taste that we got with alot of batters and mixtures that we got from health food stores. Having this book really rediced alot of stress I had with my son's allergies.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "My daughter was diagnosed in Sept 2006 and she has pretty much eaten the same things over and over-fruits, vegetables and meats but since we got this cookbook (this week) we have prepared corndogs- just like the ones at the fair ( they may not look like the ones at the fair but they sure do taste like it), tortillas and lemon bars. I finally feel like she is getting some variety in her diet!!! We can't wait to try the others we have marked. The best thing is there are over 150 recipes in the book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I borrowed this cookbook from the library first. I like it so much I bought it online. Best bread and chocolate chip cookies (gluten free) I have ever made.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book has been a sanity saver. I recommend it to anyone with a wheat intolerant child. It is very informative and the recipes are great!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Book came quickly and I was delighted with the contents. Cooking for a family with a gluten free toddler presented me with challenges. I wanted to be able to cook a meal that ALL would eat. I was not disappointed by the content.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have enjoyed making some of these recipes. They have been really tasty and my kids don't know that their dinner is made with \"Mom's special food\".",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This cookbook was ordered as a birthday gift for our granddaughter who is 9. It was full of recipes and cool ideas of things for kids to do. She was excited when she opened her cooking gift and was looking forward to using it. She has been wanting me to teach her to cook so I decided for her birthday to do a gift basket which turned out to be a bowl full of baking goodies and cookbooks.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The recipes in this book are easy and my son love the ones I have tried so far. The best cookbook I have come by for wheat free cooking.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]