[
    {
        "Title": "hachiko waits",
        "description": "Loyal to the end, Hachi the dog, unaware that his owner had died, waited at the train station every day for the next ten years in the hopes of seeing his beloved owner come off the train like he had done so many times in the past. 15,000 first printing.",
        "authors": "['Lesléa Newman']",
        "infoLink": "http://books.google.com/books?id=EaYX31sk98AC&dq=Hachiko+Waits&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 36.0,
        "review": [
            {
                "review/text": "Hachiko is a wonderful young puppy who lives with his master, Professor Ueno. Each morning the Professor tells Hachiko these same words, as he boards the train: \"What a good dog you are. What a fine dog you are. Hachi you are the best dog in all of Japan.\" And every afternoon, at 3 o'clock on the dot, Hachiko arives back at the train station to greet his owner once again. However, one day, the Professor doesn't step off the train. So Hachiko waits. He waits for ten years. Not even the kind young boy known as Yasuo can persuade Hachiko to leave his post, and take shelter in a warm home. Soon Hachiko is known around the country, and the world, as the dog who never gave up on his owner's return.I love animal stories, and I've always been interested in the Japanese culture, so I adored HACHIKO WAITS. Leslea Newman has done a marvelous job of capturing the love an animal - whether a dog, cat, etc. - holds for his or her owner, as long as they treat him/her well. The prose is wonderful, and will hold young readers enamored for hours, while the gorgeous black and white illustrations by Machiyo Kodaira bring the story even more to life. This is an absolute must read for all animal lovers.Erika SoroccoBook Review Columnist for The Community Bugle Newspaper",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "There is a statue of a dog in the Shibuya train station in Tokyo. It was first set in place in 1934 to commemorate the loyalty and devotion of an Akita who waited for his master for ten years. The master was a university teacher, who died unexpectedly at work. It was the Akita's habit to wait for his master's return from work then walk home together. Because he could not understand why his master did not return, he faithfully waited until he died in his place at the station, where the statue was erected in his honor. This is the dry version of a true story.\"What a good dog you are. What a fine dog you are. Hachi, you are the best dog in Japan.\" These are the words Professor Ueno speaks to his Akita everyday at the train station just before he departs for his teaching job at the university. And they are the last words Hachi ever hears the professor say. The dog waits until the station is closed and the train master encourages him to go outside the gate.A little boy whom the professor befriends, Yasuo and his mother take the dog in, but Hachi is one of those rare one-master-only dogs. He escapes. No one knows where he goes during the day or night, but each afternoon at five minutes until three, Hachi reappears to wait until closing. This continues for ten years.Meanwhile, people begin to notice Hachi. They pet him, worry about him, feed him, offer to take him, write newspaper stories about him, come from far and near just to see him. He becomes a symbol of the devoted, loyal dog, man's best friend. Through it all, Hachi remains calm, but most importantly, patient. He waits for his master.Today, Hachi's story is told in Japanese schools all across the country. Each year he is honored during a special ceremony at the Shibuya train station at the foot of Hachi's statue. During his lifetime he was proclaimed Chuken Hachiko (Chuken=faithful dog, -iko, a term of respect), for people loved, respected, and honored him for this total loyalty. Still, this is the dry version.In a historical novel a writer is allowed a certain freedom or license to get into the story and bring the reader with her. Leslea Newman and artist Machiyo Kodaira take the reader right there on that train station, right there beside Hachido, feeling his extraordinary devotion and dedication. Right there with each person who attends Hachiko. We are right there as Yasuo grows into a man and watch him meet a young woman. Early in the story the train master tells Yasuo that his promise to care for Hachi will bring him an unexpected happy result. And so it does. This is a story not to miss.Being inside the story with Hachiko and all the people whose lives he touches and influences is the wet version. For there is no way you can escape deep emotion reading this story. The tears will come, but they are cleansing tears. Hachiko will win your heart.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "Hachiko, a beautiful golden brown Akita pup is the loved and revered pet of his owner, Professor Ueno. The curly tailed dog was named Hachi because Professor Ueno considered the Japanese character for the number of 8 fortunate. This is his 8th Akita and he feels the dog has very special qualities. Professor Ueno and his dog walked to the commuter station each morning. Hachiko would trot back to the Shibuya station every afternoon at 3:00. The station master said that one could set their clock by Hachiko.In May of 1925, some 15 months after buying Hachiko, Professor Ueno died suddenly at work. His loyal dog continued to wait at the train station for him, even though others made overtures to him. The fictional subplot of Yasuo, a young boy who first sees the dog and meets Professor Ueno at age 5 and his partial ownership of the dog when his owner dies is moving and lovely. So are the beautiful illustrations that grace this book.This is a wonderful book about cultural sharing; I like the way Japanese words are included along with a glossary and a thumbnail history of Japanese foods and traditions.This is a beautiful book that might make you cry, but it is well worth the read. People of all ages will love the gentle Professor and his loyal Akita who never gave up waiting for his owner to return.In 1935 Hachiko was immemorialized in statue form as the symbol of unflagging devotion. Hachiko, like another curly tailed dog, the malamute Balto, who in 1925 braved an Alaskan blizzard to bring in a shipment of medicine share a history of being immemorialized in statue form and were recognized for their unflagging spirits.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "It was a truly sad story. I enjoyed the kindness and dedicated love of man,dog and family. It was an easy read even I as an adult truly enjoyed. It was beautiful, everyone should read it. I enjoyed it for another reason. They filmed some of this story for the movie in my hometown of Woonsocket,R.I. I was able to see some of the shoots and re-doing our original train station to resemble the one in the book. It was fantastic. Loved it!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Waiting, waiting, waiting. This dog sure can wait. Hachiko Waits by Leslea Newman is a heart-warming story. It is a fantastic historical fiction book.Hachiko is owned by Professor Ueno. They live in a little house in Japan. Hachiko is a golden-brown Akita-ken. Professor Ueno has a thin moustache and is a little short. He teaches at a university.When the story begins, Professor Ueno and Hachiko go to the train station a couple of times so the professor can go to work. Then something happens to the professor and then Hachiko ends up waiting for days.This book is an easy read. I liked Hachiko Waits because it has great details and I liked where it took place. You should read this book because it has great detail and it really holds your interest. That is why you should read Hachiko Waits.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "If you are a pet lover, this story is for you! It is about the faithfulness of a dog to his master and is based on truth. After I read the library edition, I knew I had to purchase it for my collelction plus one for my friend. When I went to the vet with my cat, I found out she had an Akita dog as in the story. She had purchased five copies of the book, one for herself and the rest for other pet owners. You will not be sorry you bought it!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is really a short book, and it is written for young children - just the thing for reading a bedtime story to the kids. Hachiko was real; the book has been fictionalized in part.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I bought this book for my 23 y.o. daughter who loves animals and reading. After seeing the recent release \"Hachi ~ A Dog's Story\" starring Richard Gere....I knew she would love this book. She read the book first....then saw the movie. The book is set in Japan, where the actual events took place. She could really picture the characters....Hachi, The Professor, etc. by the authors descriptive verse. Although the movie is set in the USA and brought to modern times, the story....absolutely true...is hard to believe. The loyalty of this beautiful Akita dog is a real wonder. Very inspiring and a must read (and see) for the animal lover.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Excellent book...highly recommend. My youngest son and I enjoyed reading this book together.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Have you ever seen a dog at train station that waits for his master everyday? The plot in the story is when an Akita named Hachiko waits for his master at the train station, but he never \"shows up\". His master had a stroke and died. Hachiko finds a new home, but when they open the door to go to school Hachiko runs away to the train stations to wit for his master. People try to take him home, but Hachiko keeps running away. Everyone at the train station leaves him there to take care of Hachiko. The genre is this book is realistic fiction.This book was exciting to me because it was a book about dogs and any dog who waits for his master is the greatest dog in the world. I would recommend this book to people who like dog books. There are many books to find, but you have to choose the right one. A teen or younger might like this book. Yes this book was a page-turner because it was exciting to see what would happen to Hachika. I enjoyed this book because it was about dogs.The story made me like the genre because you never knew what was going to happen. I think people who like dogs or animals should read this book, because it almost like telling someone telling a story about there pet.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "golden days memories of a golden retriever",
        "description": "There's no love quite like the love of a golden retriever. Anyone who has experienced this unique, wondrous relationship, or who simply enjoys a beautiful tale of the affection between people and their very special dogs, will fall in love with Arthur Vanderbilt's unforgettable memoir of a doting retriever named Amy and the seasons of joy she shared with those around her. First published in 1998, Willow Creek Press is proud to bring back to print this tenderly told love story that illustrates what a golden retriever can teach us about ourselves and the world we share.",
        "authors": "['Arthur Vanderbilt']",
        "infoLink": "https://play.google.com/store/books/details?id=p4l1CAAAQBAJ&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I agree with all the glowing reviews Golden Days: Memories of a Golden Retriever has been receiving, but I see something else in this book that no one else has mentioned yet--an added dimension that, I believe, gives this book its universal appeal. I think the author has written something much more than a book about a wonderful dog named Amy. Behind that captivating story is a meditation on the inevitability of the passage of time, almost an inquiry into the meaning of time and memory. Look at it: all the action takes place in a tiny geographic area, maybe a square mile at most. Very subtly moving across this canvas are the people whose lives touched this square mile--from prehistoric man to Indians and Pilgrims to pirates and finshermen and World War I aviators. Way behind the scenes there's a reference to great-grandparents, and grandparents and parents. A day in the past, the author seems to be saying, was their time, today is ours, tomorrow others will walk these same beaches, and that will be their day. I think it may well be this very quiet undercurrent that gives this slim book its punch and unforgettable power. I'd be interested to hear if any other readers have felt this too.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I found this book at the university bookstore a few weeks after losing my own 13 year old golden-retriever. As I began, tears immediately began to fall but soon they were replaced by smiles and bursts of laughter as I was pulled into the lives of the characters and the wonderful dog, and I was flooded with memories of my own Baron boy. This book is for anyone who has been blessed enough to share their lives with a special golden retreiver, or anyone who doubts the joy a dog can bring. Vanderbilt's book is an honest, from-the-heart portrayal that captures the spirit of the breed.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "As a dog lover, I've read, and keep in my home library, copies of all the great books, including Willie Morris' &quot;My Dog Skip,&quot; Peter Mayle's &quot;A Dog's Life,&quot; Barbara Bush's &quot;Millie's Book,&quot; Elizabeth Thomas's &quot;The Hidden Life of Dogs,&quot; John Steinbeck's &quot;Travels witih Charley&quot;--all of them. And of all of them I think Arthur Vanderbilt's &quot;Golden Days: Memories of a Golden Retriever&quot; is my favorite. Maybe its because I'm partial to Goldens, but I think its more than that. Amy, the golden retriever, comes alive in this quiet, inspirational book, not as some sort of wonder dog, but as the dog we all have loved. And believe me, you'll end up loving Amy as you do your favorite! Theis beautifully written book reminds me of Truman Capote at his beset, in a short story like &quot;A Christmas Memory.&quot;",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "You don't have to own a golden retriever to read and really enjoy this beautiful book. As a dog lover that I am, I read anything which has to do with dogs regardless of breed. This book is similar to &quot;the dogs of our lives&quot;, a book which touches your heart and brings tears &amp; laughter as you read it. Thank you Mr. Vanderbilt for sharing your memories with us.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I will admit right off the bat that the Chatham neighborhood that Amy and her human family inhabit is also my neighborhood. But I am sad to say that I never met Amy who sounded like a wonderful dog. All dogs are wonderful, in my book, and certainly in Arthur Vanderbilt's book &quot;Golden Days.&quot; This is one of those tales where, although you know how it ends, you still weep at the end. Months later, certain scenes-- such as Amy's unusual love of bananas-- stick in the memory so that you feel you really knew Amy. &quot;Golden Days&quot; is a book about a golden retriever and it's also about those golden days of summer in a certain special place that Arthur Vanderbilt knows very well. I recommend this book for anyone who has ever cared for a dog. For anyone who has ever loved Cape Cod. In fact, I recommend this book, which is profoundly moving without being sappy, to everyone!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Actress Betty White is right: Golden Days is the real thing--an authentic voice, a story about a dog that could be yours or mine. Its a beautiful book full of the magic and wonder of any day and every day. A special gift and a must read for every dog lover!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a beautiful, honest book about a family's love for their Golden Retriever. While the humans in the story are skillfully drawn, the central character is Amy--a loving and loved Golden Retriever. I cried at the end of the book. The lesson of the book is that a much loved dog can have a dramatic impact on a family's life--even if she isn't a search and rescue or therapy dog.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I laughed and cried when I read this book. Vanderbilt truly depicts life with a Golden. My son was devastated when we lost our twelve-year old Golden; I sent him this book so he could, like the author, reflect on the joy of having one of these incredible dogs in our life. The author truly touches the sacred moments we share with these beautiful creatures. A must read for Golden owners.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "gretchen the bicycle dog",
        "description": "Recounts the true story of a dachshund that, after accidentally injuring her spine and losing feeling in her back legs, learned to use a cart to get around.",
        "authors": "['Anita Heyman']",
        "infoLink": "http://books.google.com/books?id=KNcCngEACAAJ&dq=Gretchen+The+Bicycle+Dog&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Though written for children, with each simple sentence accompanied by a photo, the book is utterly charming for adults too; just the many pictures of the doughty, endearing Gretchen were worth the price of the book. Gretchen loses the use of her hind limbs through a spinal injury, and her magnificent coping, eventually with the aid of a cart, is lovely and inspiring. As a recent and first-time dachshund owner, I appreciated the afterword that briefly discusses this common affliction in dachshunds and offers advice on preventing it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A sweet little dachshund has her story chronicled in appealing photographs depicting her life from puppyhood to grown dog. She is the much loved pet of a dog friendly family and has never had a shortage of love. Sadly, the little hound suffers a trauma to her spine which renders her hind legs immobile.Surgery does not restore the hound's use of her hind legs, but she still gets around. She drags herself with much effort. Finally, her family orders a special dog cart that can be strapped to her chest. Her buttocks rest in the cart and she can trot along, with her back end coasting on wheels.A delightful little book with comments, crayon markings and a beautiful little dachshund with a plucky, resilient spirit. In fact, dogs who have suffered similar traumas as Gretchen who have been outfitted with such carts have been used as therapy dogs for people in hospitals, homes and nursing facilities. The dogs on wheels have indeed brought many smiles, rays of hope and inspiration to those they encounter.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "angel by my side",
        "description": "It was 1995, and Mike Lingenfelter was ready for his life to be over. Two serious heart attacks and open-heart surgery had taken away most of the good things that he had in his life. However, his doctors still held out hope for him, and they were trying to find ways to motivate him to get out of the house and exercise. Their vision was that an energetic dog on a leash might do that for Mike. And so it was that this golden retriever named Dakota, who had been rescued from death himself, came to help Mike with his rehabilitative therapy. Eventually, Dakota became Mike's protector and his best friend, saving Mike's life several times after somehow learning how to alert Mike of oncoming heart crises. Dakota gave Mike back his dignity, his pride, and his life. Early on, it became evident to Mike that this wonderful 98-pound, red-haired, four-legged angel had a special gift: Dakota was a spirit guide, and it was Mike's duty to share him and the power of the human-animal bond. Ultimately, as part of that journey, one more miracle was needed, as Dakota fought a courageous and dignified battle for his own life.",
        "authors": "['Mike Lingenfelter', 'David Frei']",
        "infoLink": "https://play.google.com/store/books/details?id=XSBnDwAAQBAJ&source=gbs_api",
        "categories": "['Body, Mind & Spirit']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "genre: Non/fictionThree sentence summary: Its about a man named Mike who had a heart attack he gets a very speciel Golden reteriever service dog who possed unique life saving talens its a true story a dog who saved a man and a man who saved a dog.What I liked most about the book: That its a true story and the love for one another in this book.What I didn't like and why: That the dog dies in the storyMy favorite character and why: The dog because Dakota was cute dog with his green frog.The scene, line, or passage that meant something to me and why When Mike cried when he helped a crippled kid feel better.What I would say about this book to someone else: That its heart warmingOne question I have after reading this book: Are dogs really angelsMy strongest reason for recommending this book: Because most people love dogs.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I don't normally write reviews, but this book I would encourage everyone strongly to read. I read about the book and saw about it being about service dogs, which I can't say I have a big interest in even though I LOVE animals. So I didn't get it right away. Then I read it. This book is simply put, a gift to the soul! I read it and I've loaned it to everybody I know and I've purchased it as a gift to send to everyone out of state I know. You think you'll cry at the end and you cry from beginning to end. This captures the connection and bond we have when we truly allow ourselves to get close with our animal friends. You won't regret reading it.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I recently lost my Golden Angel too, and while I was looking for a book to helpMe cope with my pain, I found this book. I am a very busy person and don'tHave much time to read, but this book took me 2 days. It is full of feelings and even humor. No matter what the situation is, our Golden's will manage to put a smile on our face. When you start reading this book, make sure you have a box of KleenexNear by. This book goes into my favorite book list, and I purchased a few more asChristmas presents.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Mike Lingenfelter and David Frei have written a book showing the dramatic bond between humans and their dogs. Mike's experiences with Dakota are dramatic examples of what can often happen, but are so often unheard. Dogs become very attuned to their humans, and so often we ignore what they're saying. This book proves that when you listen, you learn more about yourself, and your dog. It's a powerful book, and I cried during the last half. Dakota and Mike have helped change the way people think about service dogs. Thank you for this wonderful book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Thank you to Mike Lingenfelter for sharing his exceptional story, I absolutely loved this book. Not only is this book inspiring to all who will read it. &quot;The Angel By My Side&quot; will open your heart to what service dogs do for their human &quot;partners&quot;, the difficulties and obstacles that each has had to overcome and the truly remarkable work that both Mike and Dakota have done and continue to do. In our &quot;throw-away&quot; society, perhaps this story will also teach people about rescue dogs and what wonderful companions they are (I have a rescue dog of my own). Beware...you will need a box of Kleenex when you read this book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "After loosing my golden that I had had since age 7, for as long as I could remember, a friend bought me this book. It was truly excellent and brought this 6' 8&quot; man to tears on a constant basis. His descriptions of a guardian angel in the form of a dog could not be more accurate. I have bought numerous copies of the books since to give to friends and fellow dog owners.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "As a Puppy Raiser for Southeastern Guide Dogs, I know that dogs are exceptional and are often guardian angels. This book, however, tells the story of Dakota who is not only a guardian angel for his owner, Mike, but his spirit guide. Through the gentle encouragement from Dakota, Mike has found his mission in life - to educate others about the human-animal bond and about the specialness of service animals. Bravo Mike for telling this truly amazing and touching tale of love, generosity and spirit.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "What a truly inspirational story about the inter-species bond between human and canine. Stock up on at least a box of kleenex before attempting to complete the read. Reminded me of BOOMERANG - A MIRACLE TRILOGY, an inspirational tale of a Boston Terrier named Boomerang, who shows humans the power of unconditional love. They would both be the ideal gift for &quot;Love Your Pet Day&quot; on February 21st.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I got this as a gift at Christmas and it took me months to read. What a sweet surprise. Whether you are a dog person or not, this is a must read! I was reading on the plane and keptgetting tears streaming out. I would put it away, compose myself and then have to get it out again. The worst part of the book was when it ended...I wanted more! Such a great story with so many lessons about life! Take the time to read this! You will not be sorry!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I enjoyed the book so much. Felt like I was right there with them and every time the author had an attack could visualize how much his Angel/dog helped him through it. They had a bond that is so hard to explain unless you have had an animal and then know what it means, they are not dogs, they are your family and in this case especially he was not only family but his life support and friend. I definitely would recommend this book to anyone, have since bought additional copies to give to my animal lover friends for gifts.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "rufus chronicle another autumn",
        "description": "In a collection of his columns for the \"Kansas City Star,\" the author recounts how his Brittany spaniel, Rufus, has affected his life",
        "authors": "['C. W. Gusewelle']",
        "infoLink": "http://books.google.nl/books?id=bdsztIYwBu0C&dq=Rufus+Chronicle+:+Another+Autumn&hl=&source=gbs_api",
        "categories": "['Nature']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I couldn't put this book down until I reached the end. It was funny, heart-warming, and heart-breaking. Rufus had uncompromising character (at least in the field; at home he was a bit of a terror); he loved his work and he was truly an inspiration. At first I thought the birding/hunting terminology would be a problem; I'm a vegetarian who knows nothing about the subject. But I assure you, being unfamiliar with the subject didn't affect my enjoyment of the book at all. In fact, I felt guilty that my Brittany, Pointer and Weimaraner have never had such experiences. A dog, like a human, has certain gifts and talents, and Rufus was lucky enough to utilize his to the fullest. Mr. Gusewelle is very talented - he had a wonderful story to tell and he told it beautifully. I highly recommend this book!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Rarely does a book come along that seems upon first reading like reacquainting oneself with an old friend. But, with The Rufus Chronicle: Another Autumn, author C.W. Gusewelle's writing is like taking a walk in the quail fields with hunters we have known.The book is about Gusewelle's dog, Rufus, a Brittany Spaniel. Rather, it is a chronicle, a diary of the life of Rufus with Gusewelle from a pup until maturity at 13 seasons. It has plenty of dog lore, from puppyhood to middle age to advanced years, seemingly paralleling the stages of the author's own life. Along the way, we read pearls of wisdom, such as: &quot;\"I've seen people wear out, forget their purpose. But, an old bird dog, when autumn comes, always can smell tomorrow on the wind.&quot; And: &quot;There's no surer way to friendship than to praise a stranger's dog.&quot; Or, &quot;a morning hunt's missed is one you'll never have again.&quot; Chronicle is a time well spent, foraging in the fields of the heart.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This memoir by columnist Gusewelle of the life of his dog Rufus is rich, funny and gives a thorough explication of what it meant to live with the Brittany Rufus. I was not partial to the passages on hunting, as I am not a hunter, but I was still engrossed in the book, because these incidents told a lot about Rufus, and after all, HE loved the hunt. It's a pleasant read, with a not unexpected end that while sad completes the story satisfactorily. If you know someone who loves to read, hunt and loves his dogs, this book is definitely the perfect gift.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I dislike books about dogs as a general rule, but The Rufus Chronicle was an unexpected treasure. Gusewelle speaks with a solid yet familiar voice about the joys and the learning curve of raising a dog from a pup with the intent for it to be a hunting dog. I haven't hunted or had a dog for many years, but with every turn of the page I was transported back to a time when my greatest pleasure was taking to the field with my canine companion. This book has the rare quality of speaking to the reader on a basic human level, causing you to not only remember scenes from your past, but also sounds, smells, and feelings. If you hunt, keep dogs, or are simply an animal lover with a big heart, then you must read this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book catches your attention immediately. The author's style makes you want to curl up and read without putting this book down for even a second! I am a Brittany owner but dog owners of all breeds, especially gun dogs, will find themselves smiling, crying, laughing and more as they take an emotional journey with the author and his dog through the seasons of their collective lives! ....a wonderful, heartwarming experience, don't miss it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This will warm the hearts of all dog lovers. Dog owners will reflect on their own experiences with dogs as they read about Rufus, his yard mate and his Master, Charles. Do not be surprised if you find yourself smiling, crying and even laughing out loud.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This collection of columns, written from 1983 to 1996, records the relationship of Mr. Gusewelle and his Brittany spaniel, Rufus, as well as the relationships Rufus has with Mrs. Gusewelle, their two daughters, their older female dog, Cinnamon (who lived, despite Rufus' teasing and gnawing on her legs and tail, to be 20 years old!), and four cats, all of whom shared the Gusewelle household. The essays are charming, very comical at times, and describe the lessons Rufus attempts to teach each of his family members over the thirteen years of his life. Anyone who has ever cared for, loved, and shared a home with a dog will appreciate this book, and smile, chuckle, and weep at the memories evoked with regard to having known his or her own pets, and from being acquainted with the wonderful creatures we know as dogs, in general. If I have a &quot;criticism&quot; of this book, it is that it left me longing to hear more about Rufus, his sometimes bumbling &quot;master&quot;, a! nd the rest of his loving family (which eventually included two of his sons).",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "bottlecap sundaes",
        "description": "A recently published study stated that 100% of the seventy million dog owners in America talk to their dogs, and 97% think their dogs understand them. The question that has always interested dog owners is: \"Do they talk back?\" BOTTLE-CAP SUNDAES is a hilarious, heartwarming story of three dachshunds: Mozart, Elvis, and Whoopi, that answers that question in their own words. Mozart is the first Canine-American in the history of the family. Being the only dog in the house is pretty heady stuff for young Mozart. Then the twins arrive. Elvis and Whoopi are black miniature dachshunds who immediately fall in love with Mozart. The feeling is not mutual. They soon become constant companions who relate their experiences and feelings on subject like kennels, sibling rivalry, house training, and being neutered. They use their irreverent sense of humor to speak up for dog rights, needle each other, and one-up their owner. Their mannerisms, habits, and dialogue demonstrate three very different personalities. BOTTLE-CAP SUNDAES will bring enjoyment to any reader with a sense of humor, and is sure to strike a familiar chord with anyone who has ever owned a dog.",
        "authors": "['Patrick M. Sheridan']",
        "infoLink": "http://books.google.com/books?id=xvfFwAEACAAJ&dq=Bottle-Cap+Sundaes&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Bottle Cap Sundaes offers delightful insight into the tremendous love of the Sheridan family. By the end of the book, I could so clearly picture Elvis, Whoopie and the never-to-be outdone Mozart as if I was sitting in their living room! Patrick Sheridan should be commended for his first entry into the publishing world, and I hope this is not his last. His imagination, wit, and honesty kept me engaged until the last page, and then anxious for more. I hope there is a second volume of stories on these three extraordinary Canine Americans and their wonderful parents.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a warm, terrific story about three happy, heart-warming pets and their parents! The author has the greatest sense of humor and the love for his dogs is an inspiration to every pet owner! I've had an Old English Sheep dog and a mutt and numerous cats. This book makes me want to look in the classifieds for Dachshunds breeders. I've recommeded this book as the Book of the Month for our Reading Group! Several members have commented on what a wonderful movie this would be! We've had movies about Lassie and Rin Tin Tin but never a movie about Dashshunds! This would be the perfect choice. It's a page turner!!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Bottle Cap Sundaes offers delightful insight into the tremendous love of the Sheridan family. By the end of the book, I could so clearly picture Elvis, Whoopie and the never-to-be outdone Mozart as if I was sitting in their living room! Patrick Sheridan should be commended for his first entry into the publishing world, and I hope this is not his last. His imagination, wit, and honesty kept me engaged until the last page, and then anxious for more. I hope there is a second volume of stories on these three extraordinary Canine Americans and their wonderful parents.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The twist is that the author presents his dachshund trio mainly through his dialogues with them, and these cheeky, irreverent interchanges not only enliven the book but highlight each dog's unique personality. Along the way I learned a lot about dachshunds in general, and the later chapters, in which the dogs explore their new farm, are especially interesting. The couple's delight in and devotion to their canine family shines through on every page.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "You can't go wrong buying this book. It made me laugh, it made my feel good, and I think for a first book by Mr. Sheridan, this is indeed a wonderful effort. Don't pass it up! If you have animals of any kind, you won't be disappointed with Bottle-Cap Sundaes.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The author had me at the prologue! I laughed! I cried! This delightful, wonderful, humorous story about Mozart, Whoopi and Elvis Sheridan and their Mom and Dad will tug at your heart strings page after page. It takes the reader through a remarkable ten year journey about a family. From how they named their three puppies to the discussion about whether the dogs might some day go off to college, the love Pat and Diane Sheridan have for these members of their family is very apparent. These adorable, lovable, intelligent dogs have enriched their lives immeasurably.This is a feel good book and will appeal to anyone who has ever loved a pet. When I started to read Bottle Cap Sundaes, I couldn't put it down until I had read it through. I very highly recommend it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book gives an entertaining and insightful look into the relationship between a man and his dogs. The dogs all have voices and personalities that any dachshund owner can certainly relate to. A great read!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mayas first rose diary of a very special love",
        "description": "The author describes Maya, the dog with whom he shared eighteen years of his life",
        "authors": "['Martin Scot Kosins']",
        "infoLink": "http://books.google.com/books?id=SkpWAAAAYAAJ&dq=Maya%27s+first+rose:+diary+of+a+very+special+love&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I lost my beloved cocker spaniel after almost 15 and a half years recently. On a pet-loss grief site I got the book recommendation. I could have written the book myself. Only someone who loves a pet so deeply could truly understand. The book made me feel as if I weren't alone.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I read this book after our childhood pet died. She was my friend and my confidant thoughout childhood. She died on my 23rd birthday. Mr. Kosin's book helped me mourn. It was eloquent and touching; a beautiful tribute to the love between a dog and her human. Though I do not know that I would have gone to the extremes that he did in the book, it is nice to know that someone loved an old dog as much as I loved mine.I now give this book to friends who have lost their pets to help them mourn.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I read \"Maya's First Rose\" in one seating with my 13 year old dog on my lap and a box of kleenex by my side. Martin Kosins has written a beautiful and very moving tribute to not just his own dog Maya, but to all dogs who are loved whole heartedly by their humans. I've read his famous dog prose on the 4 stages of a dogs life before (which is not in this book) and been touched, but this book was so much more than I ever expected. His final poem in the book, which is also called Maya's First Rose, is a haunting and memorable work of poetry that I have saved and will send out to those people who I know who have loved and lost a dog.I was shocked I must say to see the callous hearted \"reviews\" some people have here at Amazon about this same lovely book. If you have never loved a pet then why would you even read this wonderful book much less write a scathing comment about it here?If you have never loved a pet you will never understand those who do. It is only your misfortune.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book tore me apart. As the current owner of a 14-year old airedale mix with not much time left on this earth, reading about Kosins' story with his beloved Maya really hit home. A short book and an easy read (I suggest one sitting), this relentless tear-jerker is beautiful and almost poetic. While it is true that Kosins' sometimes over-the-top behavior to make his dog's life better in her later years (quitting his job, cutting himself off from friends) may be difficult to identify with, this also helps us realize the level of devotion Kosins felt. A wonderful -- though heartbreaking -- read for any dog lover, preferable on a rainy Sunday afternoon with that special someone (somedog?) curled at your feet.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I will keep this short and sweet. If you have never been a dog lover, don't read this book. You will think the author is insane. However, if you have a dog or have lost a dog that was close to you....read this book. You will cry, but with a smile on your face. This is a beautiful story simply because it depicts one mans complete unselfish love for his dog. Some may say he goes too far, but if you are truly a dog lover you will agree with his devotion to Maya.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "A friend gave me this book after I lost my first dog, a rescued collie-shepherd mix who had became my asthma alert dog and saved my life several times.Yes, it's sappy and emotional, and anyone who has never truly bonded with a dog will not understand it. Those who have, will not make it through without crying. To persons not in a state of grief (or facing the old age of their beloved pet) it may come across as over-the-top; but for those living with the sharp and intimate pain of losing a beloved companion animal--all I can say is, I read this and cried my eyes out, and somehow it helped.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you've ever had a dog steal your heart, then this book is for you! It will make you smile & cry. A beautiful love story...if you have the chance to buy this book, do so.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "After losing my Doberman, a fellow animal lover suggested the book to me. I was reluctant but finally did. I couldn't put it down, read it in one night. Cried my eyes out but in the end, the book helped me to remember the wonderful antics of my dog, good or bad, and I gained even more appreciation for having her in my life. Since then, I've lost other pets; dogs, cats, horses, rats -- during our time together, I learned to see all of their unique qualities and understand their behavior better, BEFORE they pass. I cherish this book. The author is very intune to 'life' and helped me to appreciate the gifts we are given.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I bought this book and started reading it (and finished it!) in the same day. This was and is the most wonderful book I have ever read. It was so touching and sweet and sad all at the same time. I have always loved animals and have had a special connection and love for those that share my life. Many times I feel a bit \"crazy\" for loving my animals the way I do but reading this book made me realize that I am not alone. The connection we get from our pets is something that we just can't get anywhere else; it's completely special in its own way. The devotion this man showed toward his dog is an inspiration. That kind of unconditional love is amazing. I have read this book probably 5 times since I bought it a few years back and I cry every time I read it. If you LOVE animals, you'll LOVE this book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "just gus a rescued dog and the woman he loved",
        "description": "The true story of a successful journalist, diagnosed with late-stage breast cancer at age thirty, who rescued Gus, an injured and abandoned dog that was about to become one of the seven million animals euthanized each year, explores the relationship they shared that brought joy, comfort, and love to the dying woman's last days.",
        "authors": "['Laurie Williams']",
        "infoLink": "http://books.google.com/books?id=OShyAAAACAAJ&dq=Just+Gus:+A+Rescued+Dog+and+the+Woman+He+Loved&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Aside from being an absolutely lovely portrait of how dogs enrich our lives, this book gets at a question so many dog owners I know agonize about: what if you pre-decease your dog? A very, very moving story.",
                "review/helpfulness": "45/46",
                "num_reviews": 46
            },
            {
                "review/text": "This is a deeply touching and inspirational true story. The author gives you not just one but two characters in whom to invest your hopes and emotions. Gus's journey, from abandonment to the loving home and second chance given him by Stephanie, is the stuff of movies. He's also an extremely photogenic dog and the book's photos are in just the right balance with the text to draw you in and make you feel and identify with the characters. As for Stephanie, she's nothing short of heroic. Her example of dreaming big and never giving up is a model for all of us, regardless of individual challenges and hardships. Kind of a \"what are waiting for\" wake-up call. This is a really great read, perfect for animal lovers, for those who have taken life's knocks, and for all who dare to chase their dreams.",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "Well, I bought this book because of the title and subject matter. It really isn't a reading book but more of beautiful pictures of Gus and his owner. A sad tale but you really never get much of a story. I thought it would have more hints and tales about Gus--in depth. But you only get the fringe and just by looking at the pictures they tell a story (a girl that is dying and her dog that helps her through and then he finds a new home) without words. So, I flipped through in half an hour and now the book is on the coffee table.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "Touching story that would make even the hardest of us soft. The photos are beautiful, the message is powerful, and the people are far and few between. Buy this book, if not for yourself, then for someone who needs inspiriation and support.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "This story was great for the dog lovers of the world-of which I am one. It is a bittersweet story with beautiful photos and simple prose. For me, this was not a 5 star book because I prefer a long story and this was a half hour read. In my opinion, that is just not enough story for the price. However, if you have dogs in your heart, this will be an enjoyable read.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "\"Just Gus\" is the heartfelt true story of the special relationship between an adopted stray and his terminally ill owner. It describes Gus's life in terms suitable for all ages, and illustrates the type of healing that only comes from befriending an animal. \"Just Gus\" focuses more on the dog than the girl, showing the happy side of a sad story, although you will definitely shed a tear or two as you read. If you're already a petowner, it will make you appreciate your four-legged friend that much more; and if you're not, it will make you want to run out and adopt you're own \"Gus\" as soon as possible!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "a wonderful story, very well told and covered beautifully in photographs. it reminds us that taking just one poor little lost pup from an animal shelter and giving it love and understanding, can so enrich our lives, no matter what our situation is or what lies ahead.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "Not many pages but what the book says is very powerful. It makes you wonder how much fate and destiny really does factor in our lives. Hope was given to a woman in the form of a dog and hope was given to a dog by someone who I believe was meant to be the one. They found and needed each other is a under statement. The story will make you laugh and cry. Worth every dime and I would recommend it to anyone.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I thought the book was very well done. It made a great case for dog rescue which I am sure would please Stephanie Williams who had rescued Gus. It also demonstrated how important animal companions are to the people who love them.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I heard of this book because Howard Stern said it made him cry. It made me cry also. This is a nice story about a dog, a girl, and mortality. It could have been written better, it could have been more exciting, but if you read it, you will look at your relationships with your pets, and other peoples relationships with their pets a completely different way. You may look at your relationships with people differently also. I highley reccomend you read it, and then act upon it.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "a dog of flanders a christmas story",
        "description": "The story of a Flemish boy named Nello and his dog Patrasche.",
        "authors": "['Ouida']",
        "infoLink": "https://play.google.com/store/books/details?id=Nb4CUm4bSMkC&source=gbs_api",
        "categories": "['FICTION']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This European tear-jerker is considered the first modern dog story, published in 1872, by an Englishwoman of French extraction. Ouida, as she called her literary alter-ego, obviously traveled in the Low Countries, for she is conversant with both the Flemish people (city life, country life, general customs) and the foibles of human nature. The tale is frankly sentimental; one wonders if she is making a plea for social reform or communal conscience. I suspect that this story was not well received abroad; the city of Antwerp and the selfish villagers come off quite badly as a result of their shallow attitudes and callous indifference to povery, pain and hunger.A dog is elevated to having almost human feelings, while an innocent youth is rewarded for his simple faith--only after death. Too late for Society to make amends; all they can do is grant the pair a single grave. Few teens of the 90's would appreciate this syrupy tale of Patrasche's devotion and Nello's artistic apotheosis. Still the book may strike a responsive chord in the hearts of sensitive readers of all ages. A good read-aloud story for bedtime. This emotional tragedy highlights the art of the Baroque master, Peter Paul Rubens (1577-1640). This Dover PB edition contains the original pen and ink sketches, which greatly enhance the story and our ability to &quot;see&quot; the characters.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I read A Dog of Flanders by Ouida mainly out of curiosity. I wanted to read the first &quot;boy and his dog&quot; book written for children. I didn't expect much, and I was surprised when I began to enjoy the story late in the book.The story is of a peasant boy, Nello, and his dog, Patrasche. The boy just wants to be an artist and see a painting by Rubens. The dog (who has very human feelings) just wants to help the boy reach his goal. The two face absolutely every hardship possible in their attempts.To enjoy this story, you have to take it in the context of the time it was written. The book is really, really sentimental. Every play for emotion possible is made by the author. Early in the book, it even says (in a literal tone) that Nello and his grandfather would just lay down and die if anything ever happened to the dog. Patrasche was their &quot;alpha and omega.&quot; All of the sentimentality really bothered me at the beginning. I'm used to modern writing and didn't take the overplay of emotion well. I had to take into account, though, that Ouida wrote in the romantic tradition, when this type of writing was common, especially in children's books. Looking at A Dog of Flanders as an example from the time period helped me to enjoy the novel even through its oversentimentality. Overall, A Dog of Flanders is a pretty decent read. Most children of today wouldn't love it. A Dog of Flanders is definately a worthy read as a curiosity piece, though.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "`A Dog of Flanders: A Christmas Story` is a young adult book written by the Victorian English author Marie Louise de la Ram&eacute;e (aka \"Ouida\"). It's a sentimental animal fable, part of her lifelong campaign to draw attention to the problem of cruelty to dogs. It's set in Flanders where dogs are routinely worked to death. The hero of the story, a peasant boy named Nello, saves an old dog Patrsche from such a fate. When Nello falls impossibly in love outside his class with the millers daughter, Alois, his heart is broken when she is denied to him by her cruel father.I found the story pleasant and emotionally moving. It can be overly sentimental in that Victorian way, and has some Romantic Nationalism, but the story is good and leaves one with a positive feeling in the end. Although Ouida wrote over 40 novels and was very popular in her time, she is hardly read anymore, this childrens books appears now to be the most popular of her works. But in her time her most famous work wasUnder Two Flags(1867), which was still being published and read in the 20th century, including 4 different movie adaptations. Likewise `A Dog of Flanders` seems to have inspired at least 7 movies, as recently as 1999. It also sells well in Japan.For an audio version and scans of the original book with illustrations - see the comment below of this review.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have had a little copy of this book with 2 other Ouida tales in it for years. It is a perennial favorite of mine and my children in spite of, or perhaps because of, its shamelessly emotional nature.The writing is lyrical and lovely, as are the illustrations.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Very famous story in Japan. After many hardships, a boy and a dog could glance a Rubens in Notre Dam de Antwerp to be relieved from their lives. They gave their friends the purest form of love, which will be deeply engraved on readers' memory. A true gem.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the canine good citizen every dog can be one howell reference books",
        "description": "\"...purebred or mixed, with this book any dog can become a Canine Good Citizen.... The Volhards'...approach to training, which they call the Motivational Method,...is designed to do just that motivate the owner and the dog. The Motivational Method is grounded on a thorough knowledge of how people learn and dog behavior. Since 1983 they have authored or co-authored four major books on dog training and teaching dog Obedience classes, and have produced four video tapes. I am...pleased that they have written this book on the Canine Good Citizen. I cannot think of anyone else who could have done a better job. This book contains everything the reader needs to know about training any dog to become a Canine Good Citizen. Still, there is much more the book shares a wealth of insights for the beginner, as well as the experienced dog person. The book's best feature is that it gives each person the means to tailor the training to the individual dog's character and temperament. It thoroughly explains what makes dogs different and how these differences dictate the approach to training that needs to be taken.\" James E. Dearinger, AKC Vice President, Obedience The American Kennel Club's Canine Good Citizen program was developed to promote responsible dog ownership in a manner that would be easy for both dog and owner. Any book that promotes and encourages dog owners to participate is doing a public service, and this book does it well. \"This book is aptly named. Yes, every dog, both pure-bred dogs and mixed breeds, can be a good citizen if their owners care enough to make it happen. The key is to encourage dog owners everywhere to be responsible enough to make their dogs a pleasure to be around and able to handle most situations that they might be expected to encounter in everyday life.\" Robert H. McKowen AKC Vice President, Performance Events A Howell Dog Book of Distinction",
        "authors": "['Jack Volhard', 'Wendy Volhard']",
        "infoLink": "http://books.google.com/books?id=5u9Xk2TEnewC&dq=The+Canine+Good+Citizen:+Every+Dog+Can+Be+One+(Howell+Reference+Books)&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "This is a must have for every dog owner. If you own a dog then you need to teach your dog some manners. Every dog has the potential of being a well behaved canine citzen and the Volhards teach you how to motivate your canine to become one. They break down the steps into an 8 week course and thoroughly explain each step. This has become my bible of dog training. The book is centered around taking the Canine Good Citizen Exam, however even if you do not attempt the exam you and your dog will highly benefit from its instruction. It will become an enjoyable time between you and your dog as they promote motivational training. You will be happy with your purchase of this well written book.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "I am a dog nut, a diehard fan of Job Michael Evans and Mryna Milani, owner of more dog books than I can lift at one time.This is *the* dog book I recommend most often.I've been a champion of the Canine Good Citizen program since I first heard about it. I expected to read this book and enjoy learning more about the program. I did not expect to be blown away by the practical and compassionate approach of the authors. There are many other dog books out there that I consider useful, helpful, even brilliant... but this is the one book I believe *every* responsible dog owner should make the time to read.",
                "review/helpfulness": "33/36",
                "num_reviews": 36
            },
            {
                "review/text": "Once again the Volhards motivational method of dog training is applicable to not only show dogs, but also your household pet. This book also provides preparation for the AKC's Canine Good Citizen test. This test is available to mixed and purebred dogs and alot of fun. This is a fine intro to training a dog for both the home and the ring. The Volhards help you to train by teaching you to see things from the dog's point of view. This method WORKS!!!!",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "The things I like best about this book aren't in most other books. I found the personality test for the dog both interesting and helpful, and the distinction between dogs who react to fear with flight and those who react with aggression is important.The discussion of the test itself is detailed, and the training programs, particularly the ones that last several weeks, are helpful and practical. This test requires your dog to perform consistently, and that means practice! Learning how to structure a \"Stay\" program that will take 4 weeks to complete is critical if you really want a dog that can pass the test.However, the book was written more than 10 years ago, and the specific techniques rely heavily on physically moving the dog into place. There are some master trainers who can do that, but these days most humane societies and group trainers don't advise amateurs to use those methods unsupervised.For example, the book says that with some dogs, when teaching \"Sit,\" \"You may have to physically place them. With your left hand, stroke down the entire length of the back, over the tail all the way to the stifles, and with equal pressure of the right and left hands, fold the dog into a sit with the command 'Sit.'\"I don't know of any book written in the last 5 years that would recommend this method for home training. Instead, the preferred method is shaping and patience--reward the dog for each effort towards the desired behaviour. Almost all dogs will eventually get there, and the shaping method is usually safer and more reliable for amateurs.This book uses similar physical manipulation techniques throughout. That's really the only reason I can't give it a higher rating.I recommend that you get any other good recent book on training for ways of teaching the individual Sit, Down, Heel and Stay behaviours. Then use this book for working out a training schedule specifically to prepare for the Canine Good Citizenship Test.Most other books are going to talk as though your dog will have Heel mastered in a session or two. And it's true the dog will learn the basic command that quickly. But to truly MASTER it, you will need something like the 8 week training schedule that the Volhards lay out in this book.There's a lot to learn from this book, and some very practical tips. But you'll also need a current book specifically for amateur trainers to teach the individual techniques--or take a class from your local humane society or work with a local trainer to get the basics.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I ordered this book and read it extremly fast that I was surprised that I got what I did from it. I entered my dog Princess and she passed!! I expected it to be a lot harder that it was (the actual test). But, best of all I have a very well behaved dog. It was the Volhards book that spurned me on to K9 search and rescue, therapy, skijoring, agility and service dog training, which I train my own dog for. Being 14 that is a lot!! Very good book. I would HIGHLY reccomend.",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "This book is a step by step, week by week training book. It's not a &quot;Train your dog in 2 hours&quot; book. Any dog owner know that it take time, patience and more time to train a dog. There is an exercise at the beginning to teach your dog who is in control. It takes 30 minutes to do and you need to do it 5 days a week for 4 weeks. If you don't have that kind of commitment this book isn't for you. If you do, then you're in luck. I could see a change in my dogs after the first week. During the 4 weeks that you are doing the control exercises, you will also learn a new command each week for 8 weeks. If you have the time and commitment, BUY THIS BOOK. You and your dog will be good citizen!",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Excellent book, easy to read and understand. This should be a manual given out to everyone planning on getting a new puppy, as well as anyone wanting to have a well mannered companion dog of any age. One of the best books I've ever read, well worth the money.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "The first time I read through this book, I was very new to dog training. I had no idea how valuable the information in this book is. After having trained a few dog, consulting with dog trainers and reading just about every book about dog training and behavior that I can get my hands on I now have a new appreciation for The Canine Good Citizen.This book contains the basic information that every dog owner should know and understand. It's a great book for someone just starting out and it's a good review of the basics for those of us who have been there, done that. The simple trainig methods work and the added information about how your dog views the world will help you to understand why some of the things you might currently be doing aren't working.I would and do recommend this book to anyone who has dogs.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book centers around the American Kennel Club's Canine Good Citizen test, outlining the purpose and content of the test, and providing training information to prepare your dog for the test.It also provides a useful way to determine the best methods to train your dog, based on your dog's individual drives (a test is provided to determine the level of prey/pack/fight/flight drives in your dog). I found it very helpful in preparing for the CGC test, as well as providing insight into understanding my dog, and ideas to work with her in a productive manner - it includes a very helpful section on stress &amp; training. It does not go into much detail regarding more severe problem behaviors, but covers the basics in a clear &amp; easy-to-understand manner.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This little volume is pure gold. Some may criticize this book as not being advanced enough, or not containing new information - they are missing the point. Ultimately this is a book about educating people about how to help their dogs learn good people manners.While the context is preparing for the American Kennel Club's Canine Good Citizen test, really this book is for any dog owner. If you have a family dog that needs a little help in learning good people manners, this is the book for you. If you are already involved in competitive dog sports, such as obedience trials or have experience in dog training, this book has not really been written for you.The Canine Good Citizen test involves 10 individual tests, all of which allow the dog to show that she well mannered in everyday situations. For example two of the tests include the dog must sit politely while being petted by a stranger, and walk politely on leash through a crowd.Whether you ever test your dog or not, teaching these skills to your dog will result in a dog that is well behaved, a joy to be around. Isn't that what everyone really wants for their family dog?For me, the best parts of the book are those that coach you on how to work with your dog, how to understand the dog's psychology - how dogs learn. This has been invaluable to me. Early in the book, the authors introduce the idea that dogs are, of course, pack animals. Our human family becomes their pack, and someone has to be the leader of the pack. For everyone's sake, the leader of the pack must be one of the people - not the dog. The Volhards help you understand how to be the pack leader. This is not hard to do and certainly does not require you to be unkind to your dog. Our dog has learned these lessons well enough that she even cheerfully takes commands from our 3 1/2 year old son.There is plenty of good advice here about preparing for the actual CGC test and what to expect. If passing the CGC test is your goal, the easiest approach is to enroll yourself and your dog in a hands on obedience class and use this book as the companion text book you almost won't get otherwise.For those without ready access to obedience classes, this book does provide guidance on how to train your dog by yourself. Having been through several obedience classes with our dog, I believe that if you followed the Volhards' advice carefully - and actually practiced the skills as they suggest - you really could train your dog on your own using this book.I have set myself a challenge - to have our family dog (a 2 year old shelter rescue Australian Shepherd mix) take and pass the CGC test at the local dog show in about a month. As the local dog show is VERY large, this will be an extremely distracting environment and a real challenge for our dog. I am convinced that when our dog takes the test she will pass. This book has helped me understand how to get her ready and how to help her be pretty much the perfect family dog.In the year-and-a-half since the kids wore me down and convinced me we really \"needed\" a dog, I have bought several dog books and skimmed many more at bookstores and libraries. This is the one book I would enthusiastically recommend for any dog owner in the early stages of teaching good manners to their dog, even if they never plan on having their dog take the Canine Good Citizen test.Great stuff, and highly recommended.Update - our dog has now taken, and passed the Canine Good Citizen test. I am still convinced that the Volhard's book is great stuff. Their advice equipped me to teach our dog to be a well mannered member of the family. Following their advice, she aced the test.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "one incredible dog lady one incredible dog",
        "description": "Chronicles a day in the life of Kathy, a nurse, and her therapy dog, Lady, as they visit the patients in a hospital to assist and cheer them up.",
        "authors": "['Chris Williams']",
        "infoLink": "http://books.google.com/books?id=wDY9TsNh8OsC&dq=One+Incredible+Dog!:+Lady+(One+Incredible+Dog!)&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "So dear!I was \"raised\" by Siamese, but about 9 years ago I got my first dog, a Great Dane named Courageous. He has since passed to doggie heaven and two new dogs, Tempo and Scherazadh, also Great Danes, have taken their place in our hearts and home. It has been my wish to train one of them to be a therapy dog since I first saw the effect of a visit by such a dog to my ICU unit several years ago. Like the heroine dog, Lady, in the book this dog was very well trained, very friendly, and was an instant success. The patient had suffered a self-inflicted gun shot wound to the face and was VERY depressed, but the dog was able to connect in a way and to such a degree I had seldom seen in the past. I was very impressed. Unfortunately I have been unable to get my pets to the level of behavior that the dog I met or the dog Lady acheieved.The book shows the importance of early training for dogs, significant even for a family pet who doesn't go on to be a therapy dog, and of the involvement of the owner with the animal. One doesn't just with provid food and shelter, one must devote time to them as well. Sometimes people who want to owe a dog forget that they need more attention than a cat or a bird. They don't realize that a dog is a member of the family, and one that needs a lot of attention.The book also provides names, addresses and web sites of non-profit organizations that provide further information about therapy dogs for those individuals who would like to learn more about them or to learn about programs for training them. This is a significant addition, especially for the student who may like to write a report on training animals, on the jobs that working animals do, and on animals and people.The reading level of the book is that of about a 1st or 2nd grade level or for precocious younger readers, but it would also make a good \"read to me\" book for younger pre-readers.A very charming addition to any child's personal library or to a public or school library.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Meet Lady, a very special dog. Her life as a therapy dog is sweetly told in this hardcover book. It's about how one dog can make a huge difference in the lives of many people! Along with a special dog comes a special trainer and Kathy is it!Children will enjoy reading about the dynamic team of Kathy and Lady as they travel to hospitals. Lady cheers people young and old up and gives them hope and so will this delightful book. www.weeonesmag.com",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Awarding-winning Judith Friedman illustrates the spirit of Chris Williams' story of Lady, a Therapy Dog, who helps cheer up people, young & old, who are confined to hospitals, nursing homes & special homes for children.Rebeccasreads highly recommends LADY as an \"old-fashioned\" story book about a good dog who brings comfort to the needy.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is an easy read, which means that it's perfect for children 10 and under. The story is captivating, inspirational, and heartfelt, while touching on a very important topic. The author was able to keep the story lighthearted and fun. The illustrations compliment the storyline, without being overbearing. My daughter fell in love with Lady, her mission in life, and the important lesson it taught: anybody and anyone can help change lives.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Lady, the dog in One Incredible Dog! Lady is a real live therapy dog! In One Incredible Dog! Lady, the reader experiences a day in the life of Lady. Kathy is a nurse and Lady lives with her. Kathy and Lady work at a hospital. Therapy dogs are very gentle and enjoy being around all kinds of people: young, old and in between. And they always obey their handlers.The reader follows Lady as she makes her rounds with the hospital patients. We see Lady perform tricks, help an elderly woman strengthen her arm by throwing balls for Lady to catch, sooth a cancer patient, bring joy to a little boy who suffered a broken leg in a skateboard accident, take a stroll with a man who had a hip replacement and say a grand goodbye to a little girl leaving the hospital.The appealing illustrations by Judith Friedman are in black and white. Part of a new Early Reader Series, this book that honors dogs that do incredible things for people. It is geared for children ages 4-8 and is a remarkable book that will not only educate but entertain.One Incredible Dog! Lady is a grand read for those special children in your life. I highly recommend this book and the series.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "what dogs do",
        "description": "Dean Miller has been studying dog training and animal behavior his entire life. Through the years, he has developed a keen understanding of how dogs think and act. A Dog's Way shares this knowledge with you. A Dog's Way is not a training manual. Instead, Miller offers an unparalleled look into your dog's mind. Dogs have simple, straightforward thought processes, with instincts capable of reacting in the blink of an eye. Their body language is eloquent and nuanced. They may not be able to do math or drive a car, but their skills and capabilities are breathtaking in their own right. Understanding your dog makes training easier and enhances your relationship with your pet. But more importantly, your dog can teach you as much about yourself as you teach your dog. To understand and love a dog is to see yourself reflected in your dog's eyes. They are perfect little windows of insight into the soul. Whether you're a longtime dog lover or you just welcomed a dog into your life, A Dog's Way will help you understand and appreciate your canine friend. And in doing so, you will learn to better understand yourself.",
        "authors": "['Dean Miller']",
        "infoLink": "http://books.google.nl/books?id=JtrarQEACAAJ&dq=What+Dogs+Do&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Let the adorable doggie portraits, in this Sparkling canine snapshot publication, speak for themselves. More than thirty heart warming glimpses of our 4 legged friends, from many important breeds, and others from the Mongrel and Mutt class grace the pages of this little Gem of a publication from Seattle born and raised diversified photographer, Sharon Beals.There are few written words here.... only, carefully selected single word descriptive captions grace the preceeding pages of portaiture. No time wasted....JUST PLENTY OF VISUAL PLEASURE WILL BRING THE VIEWER BACK, TIME AFTER TIME! The language, like the photographs is universally recognized and appreciated by all fortunate enough to see this book!The book is a Jewel along side other Dog Picture Publications, and with its miniscule price should find a way into every Dog Lover's library! Ordering a dozen copies for my dog loving friends!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I read this in a cat/dog specialty store while on vacation. I stood in the store laughing, then crying, because it made me miss my babies so much. It's a wonderful portrayal of dog's emotions and behavior through photographs. If you're a dog lover, this is a coffee-table must have!!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a fabulous book!!! Love the pictures!! Each photo has a word that describes it like the cover is called &quot;worry&quot;. Other pics include &quot;wait&quot;, &quot;ponder&quot;, and my favorite, &quot;rescue&quot;. I couldn't stop laughing when I looked through it. It reminded me of my dog soo much. If you like dogs' doofy ways, you will also love this book!!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "fire bed and bone",
        "description": "In 1381 in England, a hunting dog recounts what happens to his beloved master Rufus and his family when they are arrested on suspicion of being part of the peasants' rebellion led by Wat Tyler and the preacher John Ball.",
        "authors": "['Henrietta Branford']",
        "infoLink": "http://books.google.com/books?id=yY7p8rzO6xAC&dq=Fire,+Bed+and+Bone&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Branford has crafted a powerful piece of historical fiction about fourteenth century England and has done so in a manner that honors the Young Adult audience's often ignored right to realistic, unromantic history. Her narrator, a wise, nameless hound is endearing but never cute. Through her eyes we witness the brutality and social upheaval of the late Middle Ages. This sage old dog, so unlike the traditional, overwrought animal narrator, provides a sense of detachment from events like the Wat Taylor rebellion that allows us to feel the peasant's righteousness as well as to cringe at their senseless mob violence. Above all, get ready to breath this one in. Fire, Bed &amp; Bone is so splendidly redolent with the real, visceral scents of the age that you will inhale it as much as you read it.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "What a brilliant book! This is set at the time of the 1381 Peasants' Revolt in England, and it shows the causes and events and results of that social upheaval in a way that is quite sympathetic to the peasants' side of the story without glossing over the mob violence that was involved. The book manages to be dense with factual information without being boring or preachy. However, the narrator is a dog -- a dog accustomed to a life of good care, with the comfort of the fire, a bed, and an occasional bone shared from the meager resources of its owners. And the dog tells us not only about the impact of social unrest on the people but also on their animals. The reading level is suitable for average fifth graders, but the issues are powerful and complex enough to interest older students of any reading level. This is a wonderful narrative of human events from an animal's perspective and should be placed along the classics of this genre.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "In 1381, English folk rebelled against the oppressive system of serfdoms. Cruel lords and masters ruled villages of ordinary folk with no say over the heavy taxation and unjust laws.For a simple hunting dog, human politics meant little to nothing. As the canine friend to Rufus, a simple man, the old dog is happy to keep her place by the fire, take her master hunting, and sleep in the house.Everything changes shortly after the birth of her latest litter of puppies. Soldiers take Rufus and his wife, Comfort, away, leaving behind their three children. The dog ensures the children's safety and returns to find only one of her puppies has remained. Together, she and her young pup do their best to survive. She experiences freedom, captivity, and reunion, all in the names of love, loyalty, and survival.Originally published in 1998, FIRE, BED & BONE is a dog's observation of the horrors life sometimes presents us. This telling of a significant event in history is done in a way that will engage kids, teach them, and show them a wonderful story. Using a dog's point of view (there are no talking animals in this book) to portray the way of men is a powerful tool, and in this case, it is well used.This book should be a leading candidate for classroom use, as well as for simple reading enjoyment. The writing is easy to follow and sentimental without growing sappy. I definitely recommend this title.Reviewed by Christina Wantz Fixemer10/26/2006",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book if absoloutly fantabulous beyond belief. How buetiflly the words are used. descriptive of every detail. Extroudinary. I could read it a thousand times and never get bored. Buy it now! its great!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "this is with no doubt the best book i have ever read , it is filled with so many mixed emotions and the way it is seen through the eyes of a dog makes it ever more interesting . the feelings that you feel when you read it are a mixture of sadness , joy and wonder . you will never know what is comeing next and that just makes you want to read it even more . belive me when i say this is the best book you could ever get",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "blue dog man",
        "description": "The creator of an American classic speaks out on the origins and meaning of Blue Dog in Cajun country and its widespread appeal throughout the country.",
        "authors": "['George Rodrigue']",
        "infoLink": "http://books.google.com/books?id=gClQAAAAMAAJ&dq=Blue+Dog+Man&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Tom Brokaw's Forward truly captures the essence of Blue Dog. The book is an absolute charmer from the moment you set eyes on it to the very last page. George Rodrigue has put together a wonderful collection of his work with some surprises in store for the reader as they page through the book. The first &quot;Blue Dog&quot; book by Rodrigue held a special place on the living room coffee table. &quot;Blue Dog Man&quot; deserves a lighted shelf of its own on the bookcase.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is a weighty (but not cumbersome) coffee table book that any thinking, feeling human being would be happy to own. Ever since I saw some original Blue Dog paintings in New Orleans, I've wanted to own one of them. Alas, I'm too poor. This book captures the spirit of the little alien-looking pooch and lets me borrow it for a price I can manage.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "After an extremely stressful day of running my own busy insurance agency, I was browsing through the aisles at Barnes &amp; Noble when my eyes spotted a delightful book with a captivating blue dog on its cover. I sat down with the book and found myself smiling and laughing quietly as I read the entire book. Blue Dog totally captivated me, and the stress faded as I read the book and enjoyed the images. I've never before bought such a book, but felt I must have this one! I will take Blue Dog Man to my office so that I can turn to it when things seem to get just TOO serious. I wish I could thank the artist personally for giving me such joy!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is one of those &quot;hmmmmm...interesting&quot; books. George Rodrigue gives a compelling history about his roots and how Blue Dog came into creation. While I love the content of the book, I am even more facinated by the design. Inside you will find a &quot;punch-out&quot; blue dog mask, postcards and other little nifty interactive thing-a-ma-jigs that help make this book such a pleasure to enjoy.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Teach an old dog new tricks? Absolutely, provided the pooch in question is Blue Dog, that colorful canine spawned from the mind of Cajun artist George Rodrigue. (For those no up to their four-legged friends fodder, the cobalt canine with the yellow eyes is based on three of the artist's now-dead dogs, and was first immortalized on slick papers back in 1994.) Who says a sleeping dog must lie? This babe is everywhere: portraits hang in the White House, on the set of \"Friends\" and in fan Whoopi Goldberg's abode; Blue Dog also stars in an Absolut ad. This volume boasts 60 gorgeous never-before-published paintings, along with commentary by Rodrigue on the birth of Blue Dog and its transformation into a pop culture icon. Tom Brokaw, an avid Blue Dog collector, wrote the book's forward. The cat's meow. Really.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "You just can't fully appreciate or understand the scope and delight of Blue Dog until you read this book. I adore Blue Dog. This silly, goofy blue dog provokes emotions in me that I have not experienced with art before...there is some strange, sad, beautiful, eerie, rapturous, haunting, joyful essence to this darn dog. This book is completely unique, fun, inspirational...I could go on and on. You just have to touch this book (the cover is fuzzy!) and open it...you will be hooked. The best coffee table book and a sure conversation starter, though that is hardly its value.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Any book with more of Blue Dog is great. This features more of the pop art world of Blue Dog than the previous books of Rodrigue's work. (I actually like the paintings of Blue Dog in cajun settings best.)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Being a cajun from Louisiana with so similar roots as Mr. Rodrigue, I enjoy reading and appreciating his artwork. I have become very attached to the &quot;Blue Dog&quot;.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the dog who came to stay",
        "description": "The national bestselling memoir of a friendship between a New England outdoorsman and the scrawny foxhound who came to his door one snowy day. In the midst of a blizzard, late one Christmas night in the 1950s, author Hal Borland heard a howl at the back door of his home on a hundred-acre farm in the Housatonic Valley of northwest Connecticut. Resistant at first, he called around trying to find an owner whose dog had gone missing-with no luck. Finally, with the encouragement of his wife and haunted by memories of his childhood collie, Borland brought some scraps of leftover steak outside. This was his introduction to Pat, a miserable, half-starved, but deeply trusting black-and-white foxhound mutt. Pat would soon become a member of the family, accompanying Borland on hunts and terrorizing the local woodchuck population-and teaching him that sometimes our most immediate connection to the natural world is through the animals we live with. A longtime journalist and a winner of the John Burroughs Medal for distinguished nature writing, Borland tells the tale of the time he shared with Pat in this touching true story that \"will appeal to many sportsmen and to all people who have ever been closely attached to a dog\" (The New York Times Book Review).",
        "authors": "['Hal Borland']",
        "infoLink": "https://play.google.com/store/books/details?id=be11ACU6PTIC&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I didn't know what to expect when I ordered this book, but it had a title similar to another book I just read, so I was curious. When I read the introduction, I realized that this was a book written almost half a century ago and reissued recently. I learned that Hal Borland had died in the 1970s, but had been a prolific writer about many things and especially outdoor life. His story about the dog who chose to stay with him and his wife began on Christmas night and continues over the ensuing years. His descriptions of the dog, Pat, his rural life as a writer, sportsman, and gardener are completely absorbing. They draw you into the world of the upper Connecticut valley by the Housatonic River. I soon began to wonder about his wife, Barbara, and found that her obituary had just been published in the NY Times on the day I looked for reference to her in Google. I felt a real sense of loss at that. This is how Hal Borland's wonderful descriptive writing lead me to feel as though I was back in time and there with them over 50 years ago. Most of all, Pat, his dog, comes alive as a unique yet thoroughly doglike personality who charms and delights the reader. Pat is just one more example of why humans love dogs so much.",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "I didn't know what to expect when I ordered this book, but it had a title similar to another book I just read, so I was curious. When I read the introduction, I realized that this was a book written almost half a century ago and reissued recently. I learned that Hal Borland had died in the 1970s, but had been a prolific writer about many things and especially outdoor life. His story about the dog who chose to stay with him and his wife began on Christmas night and continues over the ensuing years. His descriptions of the dog, Pat, his rural life as a writer, sportsman, and gardener are completely absorbing. They draw you into the world of the upper Connecticut valley by the Housatonic River. I soon began to wonder about his wife, Barbara, and found that her obituary had just been published in the NY Times on the day I looked for reference to her in Google. I felt a real sense of loss at that. This is how Hal Borland's wonderful descriptive writing lead me to feel as though I was back in time and there with them over 50 years ago. Most of all, Pat, his dog, comes alive as a unique yet thoroughly doglike personality who charms and delights the reader. Pat is just one more example of why humans love dogs so much.",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "I have a bit of a sentimental attachment to this book as it was one of my first \"adult\" books, given to me by my grandmother when I was 9. I have read this memoir of a man and his 'found' dog at least a dozen times through and have, actually, visited the house and grounds. Hal Borland, little known now, was a much read naturalist and writer for the New York Times. I don't like his novels so well, except for \"When the Legends Die\" one of his later books, but his non-fiction is excellent -- factual, loving, but not much anthropomorphism. The dog has his own dignity and the author does his best to convey this. If you are looking for a truthful and loving recounting of the relationship between an older man and a dog, as opposed to the usual sentimental 'boy and his dog' bit, this is a book worth finding.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "well written this book is so real that I can my self relate to it with my love for dogs and how aware they are of people . and also the relation of the husband and wife.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "pack of two the intricate bond between people and dogs",
        "description": "At the age of 36, Caroline Knapp, author of the acclaimed bestseller Drinking:A Love Story, found herself confronted with a monumental task: redefining her world. She had faced the loss of both her parents, given up a twenty-year relationship with alcohol, and, as she writes, \"I was wandering around in a haze of uncertainty, blinking up at the biggest questions: Who am I without parents and without alcohol? How to form attachments, and where to find comfort, in the face of such daunting vulnerability?\" An answer materialized in the most unlikely form: that of a dog. Eighteen months to the day after she quit drinking, Knapp stumbled upon an eight-week-old puppy at a local animal shelter, took her home, and named her Lucille. Now two years old, Lucille has become a central force in Knapp's life: \"In her,\" she writes, \"I have found solace, joy, a bridge to the world.\" Caroline Knapp has been celebrated as much for her fresh insight into emotional and psychological issues as she has been for her gifts as a writer. In Pack of Two, she brings the same perception and talent to bear on the rich, complicated terrain of human-animal relationships. In addition to mining her own experience with Lucille, Knapp speaks to a wide variety of dog people--from animal behaviorists and psychologists to other owners whose dogs have deeply affected their lives--about this emotionally complex, sometimes daunting, often profoundly healing alliance. Throughout, she explores the shift in canine roles from working partners to intimate companions and looks, too, at how this new kinship, this wordless bond, becomes a template for what we most desire ourselves.",
        "authors": "['Caroline Knapp']",
        "infoLink": "https://play.google.com/store/books/details?id=VpvGRcCkFcEC&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "Pack of Two lives up to its subtitle--it is an intricate and subtle exploration of the relationships between people (mostly single) and their dogs (often plural). Knapp appears in the book to be working through her reservations about the strength of her attachment to her dog Lucille. There is some pretty convoluted introspection, but she eventually comes out with a very life- and dog-affirming position--in the best cases, we love our dogs for themselves, not as replacements for kids, partners, etc. Well, no kidding. I think she approaches, but does not look straight at, the possibility that the affirmation we receive from our dogs makes us stronger--because we have dogs, we don't need people as much, and may be happier to be without partner or kids--although she makes the point that dog people tend to be more sociable and have more friends (often other dog people)... Alone (if you call hanging with the mutts alone) more, but less needy. Not a bad way to be.One footnote. Knapp unfortunately confuses operant conditioning/positive reinforcement with no training/no discipline. In fact, operant conditioning/positive reinforcement training requires a great deal of discipline--it's just the discipline doesn't take the form of strangling your dog, pinching his/her ears, etc. People who don't train their dogs are really irresponsible. People who believe you have to hurt your dog to train it are either misguided or sadistic. Jean Donaldson's &quot;The Culture Clash&quot; makes these points clearly and forcefully.",
                "review/helpfulness": "38/41",
                "num_reviews": 41
            },
            {
                "review/text": "Okay, I admit it: I am not a dog lover, so I'm probably not the prime target for this book. However, I did love Caroline Knapp's last book, &quot;Drinking: A Love Story,&quot; and I eagerly awaited her next effort. I have to say I was a little disappointed. At 250 or so pages, this isn't a long book, but it feels like it should have been about 240 pages shorter. Knapp passes over the same territory again and again, often using the same images and descriptions. They're ones that seemed fresh to me in &quot;Drinking&quot; (there's never just rage, but &quot;oceans&quot; or &quot;rivers&quot; of it; &quot;add venom and stir,&quot; a great description of anger, has multiplied into at least 5 versions of the &quot;and stir&quot; or &quot;stew&quot; images) but now seem tired and unimaginative. These are stylistic concerns, though - my biggest problem with this book is that despite its attempts at characterizing its chapters with headings like &quot;Therapy Dog,&quot; in the end each section is more and more of the same. It reminded me a little of Stewart Smalley, the character from Saturday Night Live who repeated, &quot;I'm good enough, I'm smart enough, and gosh darn it, people like me.&quot; Caroline loves her dog Lucille more than anything; Lucille loves her (she hopes.) And, gosh darn it, she's okay with that, so you should be, too.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book is perfect for people who own -- and love -- their dogs, yet are stymied when their non-dog lover friends say, &quot;Sure, Barkey is cute, but he is JUST A DOG.&quot;Caroline Knapp has truly communicated the joys of &quot;dog cohabitation&quot; (as opposed to &quot;dog ownership&quot;) in a way that even non-dog people can appreciate. Her largely anecdotal work will both resonate with those who have a dog, and will help to shade in mysterious and perplexing areas for those who don't -- and who wonder how people can get so darn attached to an animal.And, perhaps best of all, Ms. Knapp avoids most of the preposterious dog-as-human-in-little-fur-coat anthromorphism that many writers of less talent and intelligence have used to convey that difficult to describe feeling of being engaged in a reciprocal love relationship with a dog.As a writer myself, I am impressed -- and a little bit jealous of -- Ms. Knapp's use of language and phrasing to convey both complicated concepts and strong emotions. And, there are quite a few instances of humor in the book as well -- any dog owner who, as Ms. Knapp recounts, is convinced that a neighbor overhearing him or her speak to the dog would think &quot;I'm a goon&quot; will certainly empathize.Again, the tone of this book is appropriate for both &quot;dog people&quot; and those indifferent to dogs alike. And, for those individuals (you all know who you are) who have fretted while dining out -- or, better yet, refused a dinner invitation altogether -- because of not wanting to leave Rover home alone, this book will speak to your soul.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "After reading many books about &quot;dogs&quot;, a friend suggested this book. Unlike many others, this book deals almost exclusively with the dog/person relationship, and discusses it in depth and detail not found in any other book I've read.Not everyone relates to their dog in the way Ms. Knapp does, and I certainly didn't agree with everything she wrote, but the book provides such a warm, intimate, unflinching look into her first relationship with a dog that I could not help getting teary at certain points. For some, dogs can and do provide a type of love found nowhere else. Even, as Ms. Knapp points out, if your life is balanced and full with a spouse, kids, career and other emotional connections. Perhaps one of the best things this book accomplishes is the confidence with which she says that loving a dog does not mean you are emotionally flawed. That alone should be merit enough.This book is so different from many other dog books. It is introspective, personal, affirming. One of the best books I've read in a long time, and one that could be read again and again.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I read this book the weekend after losing my thirteen year old maltese and I laughed and cried my way through every wonderful word. Knapp is a terrific writer and I'm glad she has Lucille in her life. And that her book is now in my life.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is my first book review and, WOW! did I pick a great one to start off with.You'll have to pardon me if I'm over-enthusiastic with my praise, but I'm telling it as it is.From page one, I totally related to this lady (Caroline Knapp), from the time she was 'just thinking' about getting a dog, to going to the Dog pound to 'just look', to 'should I adopt or not?' to 'well, maybe' to finally getting the pooch.I think I even got the same Mutt breed that she adopted.The Pound informed me that my Sara was a GSD/Mix. Ms Knapp adopted a Shepherd/Mix. She says this is Dog Pound code for\"We really don't know.\"I became so engrossed with the human/dog connection we have with our soul mates, that I looked Caroline Knapp up on GOOGLE.Sad, it is to say, I found out that she died of cancer at the age of 42.Her loyal companion, Lucille, was there at her bedside, faithful to the end.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "last month, my maltese dog, priscilla, died. i had gotten her when she was 6 weeks old, fell in love with her instantly, and stayed in love with her for the next 16 years. my husband bought Pack of Two after reading a book review. in the review, the relationship between caroline knapp and lucille reminded him of myself and priscilla. my husband's concern was that my reading it might be too upsetting for me. on the contrary, knapp's insights into the interdependence between people and their dogs was enlightening, entertaining, and heartwarming. the strenght of the book lies in the psychological assessment of why we bond so strongly to these animals. knapp has really done her homework, citing interviews with psychiatrists, psychologists, veterinarians, and pet owners, as well as reporting research done on the human companion-animal bond. what results is a book that explores the connection we make with dogs. we fall in love with our dogs and they accept us for w! ho we are. we relive our past lives through our dogs and they bring out the best in us. they provide us with constancy and companionship. as i read through the pages, i kept repeating &quot;yes, oh yes, i know houw you feel&quot;. i will grieve for my priscilla for a long time to come, but the comfort i derive from these shared experiences found in the pages of this book help ease my pain. bravo to knapp!! this book is bound to become a classic for dog lovers everywhere.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is for anyone who wants to consider reasons why they love what they love.The author's independent view gives the type of different perspective many of us read books for. If she was only super smart, & told us primarily things we already knew, that would probably not be worth reading. Ms. Knapp is so much more.I admire Ms. Knapp's intellect, uncommon perspective, & incredible focus on a particular subject matter. Anyone who reads this book is going to understand more about why certain people go to such amazing lengths, and spend so much time, money, and energy on their dogs. Her writing style is great. Her lack of repitition in her vocabulary, sentence structure, and thought presentation is remarkable. This book is not just about dogs. It is an interesting read for people who want to understand the thought processes of people who: 1) love dogs, or 2) are neurotic, or 3) have human relationship commitment issues, or 4) struggle with their human family.Ms. Knapp's focus & examination of the ideas and perceptions that can lead to the creation of strong bonds with dogs is fascinating. She gives the reader a greater appreciation, like a wine expert might teach someone more to appreciate about wine.Ms. Knapp loved dogs for their tolerance, faithfulness, lack of artificial baggage, and accepting accomodation. She found qualities in her dog that she did not perceive in the humans she encountered.She asserts that relationships with dogs are occasionally a substitute for other things; but more often, they are beautiful on their own merits and do not find value by being a substitute for something else.Dogs can't use words. They are beautiful because they must learn to listen and communicate to the people around them largely based on non-verbal cues.Very sadly, Ms. Knapp died at too young of an age. If she were alive, I'd write her a letter of gratitude and ask her many questions.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I can't say enough about this book. A few years ago I read Caroline's book &quot;drinking a love story&quot; and found it hit very close to home and that we had many, many things in common. After spending 10 years sober and divorced, I decided it was time to commit to a dog. I THOUGHT I was getting just a dog. No, not me, extremist that I am. I got a 15 pound bundle of love and joy that I can barely leave to go to work. I am so happy to read that other people have shared this insanity. I have found myself like the author reduced to eliminating activities that don't include the dog. Caroline gives me hope that this situation will abait. The book is extremely well written, funny and thoughtful. I don't necessarily agree with some of the other reviewers that people who aren't crazy about their dogs will appreciate it. I suspect that many of those people who say &quot;come on, it's just a dog&quot; would never get this book. &quot;A pack of two&quot; is right up there on the list of books for dog lovers along with &quot;dogs never lie about love&quot;.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Eloquent yet direct, touching and honest without being sentimental -- this book comes straight from the heart. Excellently written, Caroline Knapp succeeds in verbalizing the thoughts and feelings of dog owners who love their dogs as deeply as they do their dearest family members. She captures with words what many of us have felt and known in our hearts...anyone who has felt lost and alone and turned to his dog for comfort and love will understand what she means when she describes having a dog as &quot;solitude without loneliness.&quot; Anyone who has heard &quot;its just a dog&quot; and secretly thought, &quot;No, he's my dearest friend&quot; will see themselves in many places in this book. Those who feel a desire to get a dog but don't know why will likely find the answers in this book -- especially if they've felt deep personal pain. For those of us who love our dogs deeply, but come from families or cultures who consider this kind of love &quot;stupid&quot; or! ! &quot;abnormal,&quot; this book is a vindication, a testament that the way we feel is normal, that there are many others who feel as we do. If you fit any of these descriptions, I'm sure you'll find &quot;Pack of Two&quot; as insightful and moving as I have. A warning: though this book is well-written and interesting in itself, non dog lovers may find it difficult to &quot;get into&quot; this book and may well be bored by the details which dog lovers will find delightful.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "jon van zyles iditarod memories 25 years of post",
        "description": "Every year, Jon Van Zyle donates a painting to create a fund-raising poster for the Iditarod Trail Sled Dog Race RM. Here are 25 years of his stunning artwork.",
        "authors": "['Jon Van Zyle']",
        "infoLink": "http://books.google.com/books?id=qtBtPQAACAAJ&dq=Jon+Van+Zyle%27s+Iditarod+Memories:+25+Years+of+Post&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Jon Van Zyle's Iditarod Memories, Alaskan artist Jon Van Zyle has captured the twenty-five years of the Iditarod Trail Sled Dog Race year by year with his commemorative posters celebrating the triumph, heroes, historic tales, and spirit of this classic dog sledding event. With true-life Iditarod stories by Jona Van Zyle, this 64-page book is a fitting memorial testament and celebration of human and canine endurance, courage, perseverance, and accomplishment, as well as &quot;must&quot; reading for anyone who has ever thrilled to an Iditarod event.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This small-format lavishly-illustrated book accomplishes everything it attempts. The posters are reproduced nicely, although in postcard size. To readers with questions about the actual canine work of a race, this book explains quite a lot. Siberian huskies are the stars of &quot;the last great race,&quot; and there are many modern-day improvements to their lot - food-warmers, airlifted straw drops (for their sleeping comfort) and more. The Van Zyles' dogs are varied and gorgeous. Jon Van Zyle is a handsome bearded man who appears - with great success - in some of the posters. Jona Van Zyle offers a wealth of information. The drawings are romantic and even heroic - without being kitschy. For example, the piercing blue eyes of a Siberian husky are actually hauntingly beautiful in real life - and a Van Zyle painting might confirms that. A great look at beautiful, hardworking dogs by two people who love them.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a dog year twelve months four dogs and me",
        "description": "\"Change loves me, defines and stalks me like a laser-guided smart bomb. It comes at me in all forms, suddenly and with enormous impact, from making shifts in work to having and raising a kid to buying a cabin on a distant mountaintop. Sometimes, change comes on four legs.\" In his popular and widely praised Running to the Mountain, Jon Katz wrote of the strength and support he found in the massive forms of his two yellow Labrador retrievers, Julius and Stanley. When the Labs were six and seven, a breeder who'd read his book contacted Katz to say she had a dog that was meant for him-a two-year-old border collie named Devon, well bred but high-strung and homeless. Katz already had a full canine complement, but instinct overruled reason, and soon thereafter he brought Devon home. A Dog Year: Twelve Months, Four Dogs, and Me is the story of how Devon and Jon-and Julius and Stanley-came to terms with each other. It shows how a man discovered a lot about himself through one dog (and then another) whose temperament seemed as different from his own as day is from night. It is a story of trust and understanding, of life and death, of continuity and change. It is by turns insightful, hilarious, and deeply moving.",
        "authors": "['Jon Katz']",
        "infoLink": "http://books.google.com/books?id=8US1OBz8ncAC&dq=A+Dog+Year:+Twelve+Months,+Four+Dogs,+and+Me&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 18.0,
        "review": [
            {
                "review/text": "If you have not already read this book, I would recommend you read the reviews for the book which chronicles the end of Orson's life (the gorgeous dog on the front cover. In A Dog Year you are introduced to Katz's pet project - Orson. We are lead to believe that Orson (aka Devon) is Katz's soulmate and Katz is the person who can save the poor troubled and mis-handled Orson. Although I somewhat enjoyed a Dog Year, I was worried that Katz had taken on something he didn't understand. Orson's final book - A Good Dog - proved me right. Katz cannot handle Orson and eventually euthanizes him. Katz made his money out of Orson by writing these books and then gave up on him. Considering the depth of feeling that Orson had for the author - I was left incensed and speechless at the end of A Good Dog. As an aside - the other border collie you are introduced to in a Dog Year is given to a new home because he doesn't fit with Katz either. So, before putting even more money into the coffers of a man who said that he could not justify spending money on Orson to find out what his issues were, I would refrain from spending money on this book.",
                "review/helpfulness": "84/98",
                "num_reviews": 98
            },
            {
                "review/text": "This book made me very uncomfortable in many ways. I wanted to like the book and I wanted it to be heart-warming, but everything this author did caused more heartburn than warm fuzzies. He was perfectly happy with two yellow labs and a routine that suited them all but he couldn't help but adopt a border collie and ship him to his home in...suburban New Jersey!? My stomach turned. His &quot;education&quot; of the dog was a tad rough by his own admission, throwing metal choke chains and physically striking the what, 30 or 40 pound dog? I was a bit embarrassed for him for admitting it publicly. He put his yellow lab down when he still had many good days of playing and companionship ahead of him and was not in pain. His choice, but I felt a bit queasy. He caved in and brought a second border collie into the house against his better judgement. I wanted to scream. This must be a man who can't say no to all of those telemarketers. I am very happy things worked out for him in the end, but I still need antacids to get over the angst this book has given me.",
                "review/helpfulness": "66/80",
                "num_reviews": 80
            },
            {
                "review/text": "I really wanted to love this book. How could I not with a picture of a Border Collie on the cover? After all, I am a border collie owner....an owner who adopted an abused border collie six years ago. To say that my life has changed for the better since then would be an understatement. Of course, these aren't feelings only reserved for owners of border collies as all of my friends who are dog owners feel the same way. There is a magic in having a dog in your life and I'm just happy to be so blessed.With that said, it caused me to read this book with my own dog in mind judging the author's own decisions along the way. I just couldn't reconcile the idyllic life he had with Julius and Stanley (his Labrador Retrievers) and then bringing Devon (his adopted Border Collie) into the fray knowing full well that it would overturn the applecart. Once Devon arrived, I felt like Julius and Stanley were pushed to the side and relegated to the backyard, while Devon occupied all of their owner's time. Was this their reward for years and years of loyalty and companionship? Yes, it was great for the new addition to the family but at the expense of two dogs the author supposedly loved above all things.As if that wasn't bad enough, Stanley begins to get sick...not sick enough that he wasn't enjoying life any longer. I read the section, where Jon takes all three dogs to the mountains so that Stanley could enjoy his last trip there, with a knot in my stomach knowing full well that, upon their return, he was going to have Stanley put to sleep. There's no way I could spend a glorious weekend romping in the woods with my dog, having him retrieve the ball he so loved knowing that his days were numbered because of a decision I was making.Perhaps I'm being too critical but these two things took away from the overall enjoyment this book could have given me. In no way could I look my beloved border collie in her one blue and one brown eye and tell her not only that I was bringing someone else into our home who would change her life forever (and not for the better) and, as if that's not bad enough, there's no way I could drive her to the vet and put her down when she wasn't even close to no longer being a functional and loving pet. I know the author did a good job justifying these actions but this reader and this dog lover just didn't buy it.",
                "review/helpfulness": "49/61",
                "num_reviews": 61
            },
            {
                "review/text": "Before you buy this book, you need to know that Devon, the Border Collie, is killed by Katz, as detailed in the later book \"A Good Dog.\" Katz had his two yellow labs, Julius and Stanley, killed at the first sign of illness, before attempting any treatment. He tells Devon, on page 88, \"I will never abandon you,\" playing up his promise to his dog as something solemn and sacred. Although I thought Katz did almost everything wrong in this book, I was willing to forgive it because he claimed he loved Devon and was dedicated to the best care of his \"soulmate.\" Then I come to find out that Katz has written another book about having Devon killed, while the dog was young and in good health, for what Katz decided were insurmountable behavioral problems. This new book, A Good Dog, makes the argument that it is the moral responsiblity of dog owners to kill their pets at the first sign of trouble instead of spending money on training or medical treatment. For Katz, you had better be young, healthy, and happy, or you get the ax. This is a disgusting person who should not be allowed to own animals. He most definitely should not be viewed as an animal lover or an expert on animals. Do not buy any books written by Jon Katz.",
                "review/helpfulness": "46/56",
                "num_reviews": 56
            },
            {
                "review/text": "\"He was a two-year-old border collie of Australian lineage, well-bred but high-strung, and in big trouble.\" so starts this glorious book. I heard Jon Katz on NPR discuss his newest book, and knew I had to read his work. I decided to start with an older book of his to get the flavor of the writing and his message. This is a \"cannot put down\" book. A book filled with humour and fun and sadness and death.Jon Katz believes strongly that if we are to take a dog into our lives, we must treat them as dogs, not as humans. Dogs do not know human behavior, and we should not treat them as such. And, if we love our dogs we will have them trained by someone legitimate, someone who understands dogs. Dogs need to learn to live in our people society.Jon Katz had two lovely Labrador dogs, Julius and Stanley. Everyone loved them. They were the kind of dogs who are peaceful and contained. They loved everyone and actually liked to lick children's faces. They went everywhere with Jon and were well behaved. So, then, why did Jon feel an urge to bring into their lives a border collie who was untrained, wild and had not succeeded in his previous environment? You will come to understand. Jon was approached by a trainer who had read his books on dogs to take in this animal. Devon arrived from Texas on a wild and wooly night via airplane at a New Jersey airport. Jon waited for him and when his cage appeared, he unclasped the lock and zoom the dog was gone. Jon and the security guards spent the next 45mins trying to capture Devon. Finally, he was corralled and thus started the trial to tame Devon. Devon was a border collie, intelligent and curious, but he was the master and no one had been able to train him successfully. He needed to herd and he would run into the road trying to herd garbage trucks and buses. This just didn't work, He would run away and just at the time Jon started thinking it might be time to send Devon back to Texas- a miracle occurred.Julius and Stanley were not loving Devon's arrival, but they tolerated him. Jon and the three dogs would go to an isolated area in New York State on a small farm and run free. Finally life seemed less stressful, and then the unexpected. One of the dogs becomes ill, and one of the most moving dog experiences I have ever read occurs. Tears dripping down my face I finished that chapter. And, then on to the arrival of Homer another border collie.The lessons learned from this book about loving and living with dogs are significant. This is one of those books that help us to realize why animals are so important to our lives. So well written that I feel I know Jon Katz and I certainly know Julius, Stanley, Devon and Homer. Unabashedly recommended. prisrob",
                "review/helpfulness": "41/54",
                "num_reviews": 54
            },
            {
                "review/text": "I don't read much so am irritated when I get stuck finishing such a rotten little book. This book is a self-interested rambling mess. The set up: Sedate middle age man gets feisty intelligent border collie because a breeder who read his book thought they were a good match (?). One internet search on border collies would provide enough information to tell him this breed was not a good fit. Border collies are intelligent and sensitive and need to be throughly trained. This usually require (demand) more time and effort than other breeds.In the book we meet Devon when he gets loose in the crowded airport (Katz's fault). He boosted that the dog was a \"champion border collie\" to discourage an officer from calling in animal control. Although he had no experience with Devon, he was less concerned that a frightened dog would bite when cornered than passing up the chance to let strangers know he had a \"special\" dog. Katz's treatment of Devon is disturbing (yelling, throwing chains, hitting) as is his lack of judgement in letting Devon chase trucks. Regardless of the fact a barrier was in place, he was setting a dangerous precedent.What's frustrating is that Katz had the money to pay professionals who would have trained both him and the dogs but didn't bother asking for help. Maybe having a dog that was miserable because it didn't know how it was expected to behave was more entertaining.Katz should have stuck with labs. Less interesting book material but a better fit for his personality/lifestyle. He is making money from the misery his own dog ownership is imposing. Consider that purchasing his books will encourage him to spread tales of his poor actions and decisions.",
                "review/helpfulness": "35/42",
                "num_reviews": 42
            },
            {
                "review/text": "Do not make the mistake of thinking this book is a training guide or how-to book for dog owners. Mr. Katz is, by nature, a story teller, and in this compact book, he weaves together observations and anecdotes during the course of a dog year, a year he pretty much devoted to his four dogs, a pair of aging labs and a pair of young border collies.The striking differences in the dispositions of the labs and Devon, a troubled border collie he adopts sight unseen constitute much of the book's premise. Mr. Katz must come to terms with Devon, a dog that is totally different from his beloved, mellow labs---so different, that he soon earns the nickname \"Helldog.\" In learning to train and love this high-strung, very intelligent new addition, he must confront his own notions of discipline, commitment, and duty. He does not always make the right decisions, but he willing lays out the consequences, right or wrong, for readers.Though there may be lessons here for dog owners, and especially for potential dog owners, the book ultimately is a musing, and a good one, on looking honestly on life and death, seeing into one's own dark corners, and rejoicing on the primal bond between human and canine.If nothing else, I would hope that Katz opens up some eyes about how much work and joy are intertwined in being a dutiful dog owner.",
                "review/helpfulness": "30/40",
                "num_reviews": 40
            },
            {
                "review/text": "I have to agree with the negative reviews here. This author shows in later works that his tendency to be self serving here is proven out. He created an industry out of his dogs and has no idea what it means to be a responsible dog owner. Please don't waste your money. Read \"Marley & Me\" for a story of how to love a difficult dog, not this one.Marley & Me: Life and Love with the World's Worst Dog",
                "review/helpfulness": "23/33",
                "num_reviews": 33
            },
            {
                "review/text": "I really admired Jon Katz's \"Geeks\" and I'm deeply interested in dogs, so I pounced on this book, but I'm sorry to say I found it very disappointing. Katz writes well, and some parts of the book are touching, especially his accounts of putting his labs down, but on the whole the book is grating in its misperceptions and obtuseness about canine behavior. It also seemed to be reaching for significance and spiritual insight in a self-conscious way that is occasionally embarrassing. Worst of all, much of it is just not interesting. There are so many insightful and genuinely touching books about the human-canine relationship that this one just seems unnecessary. I hope Katz gets back on stride with his next book.",
                "review/helpfulness": "20/33",
                "num_reviews": 33
            },
            {
                "review/text": "Same old Jon Katz methods and writing style. Unfortunately it's so insincere and full of contradiction. Ultimately it is completely dishonest and without any heart or soul. See his book \"Good Dog\" (reviews).He should write about pet rocks. He would be considered more an authority in that realm.",
                "review/helpfulness": "24/32",
                "num_reviews": 32
            }
        ]
    },
    {
        "Title": "dogs of the iditarod",
        "description": "Describes the characteristics and training of dogs worthy of the Iditarod Sled Dog Race in Alaska, and presents a collection of color photos of husky puppies and racing adults.",
        "authors": "['Jeff Schultz']",
        "infoLink": "http://books.google.com/books?id=MOb0wAEACAAJ&dq=Dogs+of+the+Iditarod&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Being partial to sled dogs myself (I am owned by two) I very much enjoyed leafing through this book. I actually bought it as a gift for my brother who adopted an Alaskan Husky last year, but I may have to buy another copy for myself!Good portraits of the various types of dogs which nowadays run this intense and challenging race. The photos and text give you a glimpse into the world of sled dog racing, yet the book also shows the \"gentler\" and \"calmer\" side of these magnificent animals (lets enjoy the quiet times, as we know, calm or slow is not really an important part of their vocabulary!).If you love sled dogs, get this book, it is worth it.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Filled from cover to cover with glorious full-color photographs, Dogs Of The Iditarod by Anchorage-based professional photographer Jeff Schultz celebrates the canine participants in Alaska's famous Iditarod Sled Dog Race. These dogs' athletic endeavors, their incredible endurance, and their very special bonding with their owners are all showcased in this fantastically visual and highly recommended read for dog lovers everywhere.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This not a serious book, but shows the dogs at various stages of the Iditarod. Fantastic pictures of these dogs who are ready to run any time...Dogs of the Iditarod",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "dog logic companion obedience rapportbased training howell reference books",
        "description": "To train your dog effectively, you must establish more than authority and obedience. You must train the dog to want to please you. You must establish rapport. It is upon this basis that the excellent training regimen given in Dog Logic: Companion Obedience is developed. Understanding your dog's natural behavior and responses to the world he lives in is the key to achieving the training results you want. That key is provided in this book and will result for you in a responsive, obedient dog that accepts your leadership and happily lives by your rules. This is mutual respect that works! The exercises in Dog Logic are for the companion dog and, if you like, the obedience trial dog. They guide you gradually and expertly through the whole series of training objectives, and your ultimate reward is a dog you can always be proud of. Week by week and level by level, you will see your dog gaining poise, polish and the admiration of all who meet him. You and your dog will become a living example of what it means to be a smoothly functioning dog/human partnership. These training methods are tested, proven and reliable and can make a world of important difference for you and your dog. A Howell Dog Book of Distinction",
        "authors": "['Joel M. McMains']",
        "infoLink": "http://books.google.com/books?id=OxYEAAAACAAJ&dq=Dog+Logic:+Companion+Obedience,+Rapport-Based+Training+(Howell+Reference+Books)&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The sub-title of this book, \"Rapport-Based Training,\" made me give it a try, even though I do not employ force-based training methods. I do, however, try to give everyone a fair shake.However, there were some things in this book -- which is full of hypocrisy, BTW -- that turned my blood cold. His inclusion in puppy testing of checking for pain sensitivity (he calls it touch sensitivity), because your training program will assume the dog will respond to pain, is chilling. And the statement \"Experience says that force is an inescapable training element\" shows that, no matter how open-minded he says he is in the preface, this trainer has not explored all options. He views \"tough\" dogs and \"submissive\" dogs as irredeemable, while other training programs not based in force have turned these dogs into wonderful companions.Although at no time does the author suggest that he is not a force-based trainer, he states repeatedly in the front matter that he gives a dog a chance to learn before applying force; yet from lesson one he recommends giving a new verbal command to a dog and applying pressure with a pinch collar to force a dog into various as-yet unlearned positions.I was hoping to find in this book something more based in relationship-building than the traditional correction-based methodology, something I could recommend to those who cling to force-based methods. Yet the only place where I could agree with this author is that a pinch collar is less damaging than a choke chain (which, frankly, has no place on any dog). It was a disappointment.Better reading materials for those who don't want to use strictly food-based training methods include \"Excel-erated Learning\" (Pamela Reid), \"So Your Dog's Not Lassie,\" and \"Never Say No\"(Dr. Mugford).",
                "review/helpfulness": "17/27",
                "num_reviews": 27
            },
            {
                "review/text": "McMains is a dog lover, first and foremost. He takes great pains to emphasize that dogs are friends and comrades, not employees or slaves, and should be treated with the respect and love they deserve. In the heat of training, many people (even many trainers) seem to forget that the reason they originally got a dog was not to do a straight sit or a snappy recall, but rather to fill out their world with a new friend. I don't know a friend in existence who would tolerate what some trainers advocate in the name of &quot;training.&quot;His method is not compulsion-free, but it is centered around the dog VOLUNTEERING behaviors, rather that being yanked/forced into them repeatedly. He discusses how to use the dog's natural compulsions/drives to encourage the behaviors the team is shooting for, as well as ways of solidifying those responses under REALISTIC distraction conditions.The most telling point about the book's organization is that it doesn't adhere slavishly to the standard AKC Novice routines, but rather focuses on skills and attitudes that the non-competitor will find most necessary/useful around the home, which is where all dogs, competitor or not, spend most of their time. Make no mistake, a McMains-trained dog will reach its full competitive potential, but McMains' focus is where it should be, on the 99.9% of the dog's life spent outside the ring.In a world where millions of dogs are put to sleep in shelters each year, primarily for &quot;temperament problems&quot; (which can be interpreted as the owner crying &quot;I don't know how to deal with this dog!&quot;), a book with this much compassion and intelligent information on how to understand and relate to your own dog is invaluable. The problem is not that there are too many dogs in this country, it's that there are too many OUT OF CONTROL dogs in this country.If McMains has his way, that won't be the case forever.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "***** Outstanding! Dog Logic provides readers with an excellent guide on obedience training for practical purposes. McMains' rapport-based methods are based on mutual respect between owner and dog, and his love for our best friend is evident throughout the book. Author McMains explains how to appeal to your dog's drives and instincts in order to become the animal's pack leader. He encourages readers to train &quot;at the dog's level of understanding,&quot; and reminds that &quot;rapport is critical.&quot; Anyone can force a dog to be obedient, but McMains shows you how to have your dog respond out of a desire to please you. This is where McMains' insights help you to think like your dog and understand canine logic.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Dog Logic: This is a book clearly created for easy to follow instructions in dog training! Your dog will come away trained and still want to keep company with you. It has all the instructions needed to train your home pet. I applaud, Joe M. McMains for his guildence and understanding of mans best friend.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "&quot;Dog Logic&quot; was a brilliant piece of work, penned by a master dog handler in hopes of bettering the lot of his canine buddies. Far too many people own dogs who shouldn't, either due to ignorance, laziness, or just plain nastiness. Mister McMains realizes this, and knows that the answer to the problem can be summed up in a single word: RAPPORT. If you objectify an animal, as (unfortunately) does the overwhelming majority of dog trainers, you may be able to get your dog to perform tricks and obey commands, but that deeper connection will not be present. If, like most owners, you simply think of your dog(s) as nothing more than a &quot;pet for the kids,&quot; &quot;something to bark at a doorknob rattler,&quot; or even &quot;a creature that lives to eat, shed, and mess,&quot; then your dog is far more likely to be ignored and otherwise neglected than if he were instead viewed as a member of your family entitled to your respect. Contrary to what pseudo-intellectuals like Desmond Morris would have us believe, dogs ARE capable of higher thought processes, and DO express actual emotions. Neglect is psychological abuse, and will have negative effects on your animal's personality. As the U.S.A.F. K-9 school says, &quot;Every handler will end up with the dog he deserves.&quot; The &quot;Ten Commandments&quot; after the Postscript is well worth the cost of this book in itself. Highly recommended.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "My only complaint about this book is that I couldn't put it down! Without a doubt the best single book (I still recommend buying several different training books for scope) on dog training ever. This is written for all of us average folks who just want a very stable and well behaved pet that responds to our leadership role in the family. Joel is one of the few authors I've read who seems to really UNDERSTAND dogs and the dog/human relationship as it should be--not as politics or fads would have them be...a must read for the first timer, as well as those of us with years of dog experience. I would also recommend &quot;Manstopper&quot; for a genuine insight into how dogs learn by association. Even if you have no desire or interest in protection training, it will prove invaluable for problem solving (and prevention) in your basic obedience training at home....it teaches you how to think associatively like a dog does. Dog Logic is not a book for the wishy-washy or those of us who don't have time to invest in a regular training routine...it's for people who are serious about having a well mannered dog and want to train in such a way as to INCREASE the trust and love between you and your pet. Happy Training!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I bought this book when I got my first dog of my own. My family have always had dogs but had always been content to get as far as \"sit\" and then let them do what they wanted. I wanted something more from my dog and suspected what was confirmed by the book: that a trained dog is a happier dog. I've recommended the book to countless others and am about to order it as a gift for someone who recently got their first dog. I hope that it will provide him with as much insight as it gave me and I can assure you that you'll gain plenty of tools, both practical and thoughtful, from this book. More than just giving you a series of instructions, this book will help you to have a little more of an idea of what's going on inside the canine head. And McMain manages, in spite of the obvious love that he feels for dogs, to strip away some of the sentimentality that often clouds our relationships with our dogs. I offer him my thanks, and if he could, I'm sure that my dog would too.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I train owners to train their dogs as a supplament to my income. I also do it as a way to improve the quality of life for both the canine and the owner. Dog Logic is like a required &quot;Text Book&quot; for my classes. Yes I am partial to Joel's style and techniques. I am also proof that they work. My experiece with Joe's training methods were personal and resulted in a dog that was a Champion in Two states for 4-H; Also one that was the envy of anyone that met him. Dog Logic is a realistic approach to training and understanding your K9 compainion. With this book and individual comes away with a new insight and understanding of their best friend. This book also helps the owner of a dog develop a better relationship with their pet as a result of love, understanding and training.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "In treality this books covers training for dogs and teaches the reader how to relate to their best friend in a positive re-inforcement based training. I found the book a little boring only because I had just finished reading Mr. McMains other book, MANSTOPPER. DOG LOGIC offers the reader a lot of good information on the subject of dog training. A need to read book for everyone with a dog.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Dog Logic is the book I'd recommend if you were going to get only one dog training book. McMains teaches the reader to see the world from a dog's eye view and learn to communicate and build a relationship based on mutual respect. It is practical, down to earth, and enjoyable reading.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "three dog life memoir",
        "description": "The wife of a man who was institutionalized after an accident left him violently brain damaged describes her efforts to rebuild her life in a small country town with three dogs, a process during which she struggled with a very different relationship with her husband, passed her days knitting, and found comfort in friendships and her changing perceptions about life. Reader's Guide included. Reprint.",
        "authors": "['Abigail Thomas']",
        "infoLink": "http://books.google.com/books?id=-VRSq3u4pUoC&dq=Three+Dog+Life+-+Memoir&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 44.0,
        "review": [
            {
                "review/text": "*****This book is sweet, poignant, and beautiful. It is also gut-wrenchingly honest and realistic about the author's attempts to cope with her life after her husband has a TBI (Traumatic Brain Injury). He gets hit by a car while walking their dog and their lives are never the same. This memoir is about the author's life and marriage after the accident and for the next five years, until the present day. I loved reading it. I haven't really ever read a book like it.The author builds herself a life, accompanied by what ends up being three dogs altogether. She still takes joy in her marriage, such as it is. I wish I could put into words how beautiful this book is, but I can't. It is a lovely book with mature topics (grieving, survivor guilt, etc.) for adults or especially mature teens. Highest recommendations.*****",
                "review/helpfulness": "120/124",
                "num_reviews": 124
            },
            {
                "review/text": "......enjoying it so much that when I finished, I felt that my best old friend had left me. Afraid to let go, I had to start reading it again, so we could re-unite. I found new gems with every re-read, and appreciated the writing, warmth and feeling even more than the first time in a way that love/like is not supposed to work.",
                "review/helpfulness": "72/76",
                "num_reviews": 76
            },
            {
                "review/text": "This memoir managed to be both incredibly sad and yet positive and life-affirming at the same time. Abigail Thomas describes the journey she must take in the years after her husband's accident and how she manages to progress from inner turmoil (and at times, the inability to function at all), to a place where she is at peace with her life. Though her husband must remain at a hospital for brain-injured patients, she is able to bring him home for visits and spends time with him at the center. The comments and thoughts from his head are so fascinating...I found myself eagerly waiting to see what he would say the next time. Just wondering about the brain and all that we don't know about it is truly amazing to me. Sometimes he makes pronouncements that appear so profound, and other times he seems in total confusion, and while it's incredibly heartbreaking, it's also mesmerizing to read their conversations together.As for Thomas' relationship with her three dogs, she describes it beautifully. I would think any dog owner, as I am, can relate to the description of bed-crowding and jostling for the most attention, but mainly to the bond that forms between human and animal.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "I could only read this elegant memoir a sentence at a time. It was like falling face first into a rose garden, thorns and all.Abigail Thomas...you wise old woman...you are brilliant.",
                "review/helpfulness": "24/31",
                "num_reviews": 31
            },
            {
                "review/text": "I discovered A Three Dog Life through an article in the New York Times this summer. An excerpt from Abigail Thomas's book appeared in the column, Modern Love. She titled it: \"My Husband Survived, the Man I Married Didn't.\" That is the crux of her book. And with this title, she got me. I, too, have a husband who survived a traumatic brain injury (stroke), and the man I married did not fully survive either.Thomas's writing is poetic, courageous, and raw. Her story is the pain and joy of the human condition distilled in a small volume. Thomas weaves a new cloth of love from what was and what is now, looking for the meaning of life in the simple and the mundane, and appreciating both with keen insight. Abigail Thomas, the woman, discovers hard and wonderful truths about herself, and is wise enough to learn from her husband the infinite value of just one moment of life, lived in the present. As a writer, she shares generously with us the wisdom she has aquired, but did not ask for.Although this book looks at tragedy head-on, it is filled with beauty and humor. I laughed out loud, as well as cried while reading it. And when I finished it, I immediately started it over again.A Three Dog Life is a gift of a read, but to one who loves someone with a traumatic brain injury, it is a measure of sanity in a life forever changed. She \"gets it\" and writes honestly and poignantly about this journey, a rare combination.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "Rich Rogin was walking the family dog late one night in his Manhattan neighborhood when he was struck by a car and nearly killed; the accident report said, \"dead, or likely to die.\" Although he didn't die, he suffered a traumatic brain injury (TBI, to those unlucky enough to be on familiar terms with this sad condition).Abigail Thomas gives us a tender little book about life with her husband after the accident wiped out his past and his future, leaving him only a jumbled present. Rich was not able to live at home and Abigail moved upstate to be near the facility where he lived, bringing him home for a visit every week. She filled her days with writing, knitting, and napping with her three dogs.While the facts of the story are painfully sad, Abigail infuses her writing with loving accommodations of Rich's diminished condition. Of her visits, so often made difficult by his inability to fix himself in the real world: \"During the days when it is impossible to communicate in words, I get into his bed and we hold hands. Nap therapy. This is a familiar posture, something we can do without speech, without thinking.\" Rich's reality becomes her reality on the days when she can't penetrate his confused world.Abigail's enjoyment of her dogs is threaded through the book. Like her husband, they force her to live in the present. \"Dogs are never in a bad mood over something you said at breakfast,\" she writes. \"Dogs never sniff at the husks of old conversations, or conduct autopsies on weekends gone wrong. An unexamined life may not be worth living, but the overexamined life is hell. We talk too much.\"Although \"A Three Dog Life\" is labeled a memoir, it's not laid out in the linear fashion of most memoirs -- more like a collection of essays presented in random order. For me this presentation left a lack of closure with several of her themes. I realize that it was a deliberate choice by the author but for me it was the one blemish on an otherwise magical reading experience. Do read it for yourself, in one sitting if you can. You'll find it a much happier book than it sounds.Linda Bulger, 2008",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "I read this book several times and will read it again and again--it's like the best of friends. In the particulars of her husband's accident and the five years following, the author explores the elements of love and how a life can be built and then rebuilt upon them, despite great loss. She writes sparely, powerfully, and with wonderful wisdom and wit. I would recommend this beautiful book as a gift to anyone going through hard times.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book is like a small but perfect diamond. It is cut and faceted to shape a story that will resonate with the reader for a long time. At least that's how I felt after reading it.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "In her memoir of her life after the traumatic brain injury to her husband, Rich, Abigail Thomas gives us all something to live for. Hope can be not just for the future, but also for the present. Thomas's descriptions of her husband, her dogs, her house, even her socks, show us how to knit a pattern of courage when faced with life's vicissitudes. This is a small book, easily read in one sitting, but one that you will want to read again and again.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This remarkable book is both poignant and upbeat - gives hope and pathos to the way life can work. Is a \"keeper\" that I loan to others but do not let go of - will read again and again.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "found dogs tales of strays who landed on their feet",
        "description": "By the author and photographer of Second Chances, more wonderful profiles of people and their adopted dogs.",
        "authors": "['Elise Lufkin']",
        "infoLink": "http://books.google.com/books?id=yGj40rkFhtsC&dq=Found+Dogs:+Tales+of+Strays+Who+Landed+on+Their+Feet&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I first picked up this book, at the library, when I was borrowing a breed identification guide, to try to identify the small, red, muscular, angry and frightened dog that appeared in our yard. It turned out that he was a Min Pin, a very abused one. The obvious previous mistreatment of this dog and his, resulting, very aggressive and fearful behavior made me question weather or not we could help him. Then, that evening I found myself sitting quietly on the couch, reading this wonderful book and suddenly I was joined by our \"found dog\". He cautiously curled up on my lap (our first positive interaction!) and I (carefully at first) pet him and read, all evening. By the end of the book, we had bonded. It wasn't an easy journey, but we made it. It has been four years and he is one of the smartest, funniest, most loving dogs we have ever known. We can't imagine our life without him.This is a teriffic book for anyone who has adopted a rescued dog (or is thinking about it). It gives wonderful inspiration!",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "This is a wonderful book, buy one as a gift and one to keep for yourself. I bought it as a gift for a friend who volunteered at our local shelter. The volunteers are true heroes, and so are the ordinary people highlighted in this book. After reading this book, I knew it was a keepsake I could not part with. One page stories of extraordinary bonds between owners and the homeless dog they took the risk to adopt make for easy reading that you can pick up, put down, and walk away feeling better about the world. This book is the finest gift for the dogs lover in your life as well as the volunteers at the shelter, your beloved veterinarian, the Dog Control Officer that saves the dog lost in traffic, for your favorite dogsitter, and for anyone who understands there are wonderful dogs out there in need of a home and a person to love. The best part is, profits from the book benefit animal related organizations and shelters. You will feel better having read this book, and a homeless dog somewhere will benefit.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "I was afraid to order this book at first because I am such a huge animal lover and get very distressed when I hear stories about animals who have been abused or abandoned. I literally get nightmares when I read about animals who are suffering and I wasn't sure if this book would be more upsetting then pleasurable since I knew many of the dogs would have tragic tales before adoption. My experience with this book: got it today, sat down on the sofa with it and simply could not put it down. I read every story and even though many of them were tragic they really didn't dwell on the horrific past in a way that made me uncomfortable. I did cry but they were slow, blissful tears that often melted into the edges of an unforseen smile. These stories are some of the most uplifting, gorgeous stories I have ever read and the photos that accompany them are beautiful, often spontaneous portraits of owners embracing their saved animals. In every furry face you can see the joy and the gratitude and the extinguished pain. They are saved and they are home and it burns your eyes and warms your heart and leaves you shivering in goose pimples. I am SO glad I decided to order this book! It's a must have for anyone who loves dogs.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "\"Found Dogs\" recounts numerous success stories of dogs winding up with new, caring owners after being strays, rescued, or otherwise finding a suitable human. The editor Elise Lufkin and photographer Diana Walker document these success stories with pithy narratives that capture the human perspective and revealing black and white photos that say more about the dogs than the people. Taken together, the text and images reveal convey the strength of the bond between humans and dogs and vice versa.The book runs the gamut from small to large, pure bred to mutt dogs, and, likewise, captures a good portion of the human spectrum from blue collar workers to celebrities, from young to old, and from those already savvy about canines to neophyte owners.A trend that recurs in many of the tales is that bringing a new dog home requires work, patience, and understanding (those same qualities these dogs' previous humans lacked). The author provides a number of resources in the appendices for those who want to rescue or adopt a dog or learn more about training and recreation.Certainly, Ms. Lufkin and Ms. Walker are preaching to the choir in a sense, but one hopes that anyone thinking of adding a dog to his or her family will perhaps check out a book like this one first to obtain a better sense of the rewards and effort that are the inherent, intertwined realities of responsible dog ownership.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is an incredible book. I have owned it for several years and each time you pick it up to revisit its pages it makes your feel wonderful all over again. If you aren't a dog lover, you will be after you read this book. It stays on my coffee table in the den and has been the topic of many interesting conversations with fellow dog lovers. I guess this book is so close to my heart because we are fortunate enough to have a &quot;found dog&quot;. I am looking forward to Ms Lufkin doing a second book and perhaps including our &quot;Found&quot; dog in it. Buy the book - you'll be glad you did.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I love this book so much that I decided to donate a copy of it to my local public library in memory of my sweet doggie-man, Forrest.I've owned it for years and have read it several times- it never gets old.I am glad to see they have come out with a second edition, I will definitely be buying it very soon!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is full of great stories that show the great benefits of sharing your life with a rescued dog. It also is a great read. I've had my copy for years and there are stories that still make me cry.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book will be a breath of fresh air for those dog lovers who hear a lot of stories about abused and neglected dogs. Although many of the dogs described have poor backgrounds, the incredibly kind hearts of the people who adopted them is a real inspiration. Up to reading this book, my wife and I were wondering whether we should adopt a second dog. This book has put our decision &quot;over the top.&quot;",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I can definitely relate to these stories - our own 'son' is a stray we adopted from The Animal Defense League. He was the only one our 'daughter' didn't lunge at, just growled at. She was used to being the boss and we had just put her sister to sleep recently. Three days after we adopted our son, the two were inseparable.Believe me, strays definitely show how grateful they are for the second chance they've been given. The stories in this book show that. Sometimes it seems the people are the ones who need saving. If someone ever wanted to know how much saving a dog (or any other animal stray) can make a difference, READ this book. The story in the introduction is just wonderful. You won't be sorry and this family gives it 2 paws up :)",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Elise Lufkin has managed, in her book Found Dogs, to move without cloying, to educate without preaching and to make us laugh. This book is a compilation of photos and stories of dogs who have been rescued by caring people and many of who have in turn &quot;rescued&quot; their new owners. These stories range from the amazing; the dog who can detect her owner's oncoming seizure, to the heartwarming; the dog who has they same big brown eyes as his owner's late husband. Diana Walker's photographs capture the connection between each &quot;found dog&quot; and his savior. She shows not only the uniqueness of the dogs but also the varied roles they play in their owner's lives. Useful information on adopting and adapting to a pet is provided. This book is a must for all the animal lovers on your Holiday gift list.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "kathy santos dog sense",
        "description": "Whether you have a puppy or an adult dog, a home- or sleep-wrecker (or both), whether your dog has ingrained bad manners or simply hasn't learned any good ones yet-Kathy Santo shines a light into the dark bedlam of life with an unruly dog. The secret of her ebullient and innovative guide to training: dogs are individuals, and any dog's nature depends far less on his breed or pedigree than most training methods suppose. In easy steps, you can quickly determine your dog's \"personality\"-the interplay of prime motivations, energy level, work ethic, and emotional profile-to tailor a regimen optimally suited to his learning needs. Where \"one-size\" programs typically founder in canine chaos and human frustration, the Santo method carries you past failure: even when your dog doesn't respond, your understanding of him deepens and leads you to a better strategy. This unique interactive approach-based on the author's twenty years of experience-not only speeds canine learning but also lifts training from a temporary chore to an increasingly relaxed way of life. The result is a lifetime of improving obedience-an ever more confident and happy dog, and an ever more gratifying relationship for you both.",
        "authors": "['Kathy Santo']",
        "infoLink": "https://play.google.com/store/books/details?id=raOec48pFC8C&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book is fabulous. As the first-time owner of a dog (a big, energetic lab at that), I was looking for help, and Kathy Santo's advice is right on. Her technique is based on the premise that each dog is an individual, and is motivated to learn in a very specific way. Her explanations are quite clear and very entertaining. Some of the examples and turns of phrase were so funny, I laughed out loud.I've been worried about being able to keep our dog safe from cars and other animals, and to keep her from jumping on kids and older people, all without stifling her enthusiasm and happy lab personality. Kathy's suggestions have already begun working a miracle of obedience. Buy this book if you have a dog. Run to buy it if you have a dog behavior problem. Now if I could only use these methods on my husband...",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book has changed the way people will look at their dogs forever! I found it to be a very easy read and I loved the 'true stories' throughout. I learned a great deal about the inner workings of my dogs' minds and I also learned how to deal with those aspects of my dogs that I was not always pleased with but had learned to live with. This book taught me that just because I love my dogs does not mean I should put up with bad behavior. I have found great success with your methods and look forward to spreading the word about this fantastic book. Three cheers for Kathy Santo!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I highly recommend this book for people who are serious about training their dogs. This method of dog training works because it is specific to the dog's particular needs and personality. My border collie couldn't care less about getting a treat for doing a good job, but if you toss him a tennis ball or a frisbee he's the happiest dog in the world!! This book focusses on training your dog based on his specific personality.I highly recommend this book, and I plan to keep it handy as a guide for dealing with the ingenious things my sometimes too smart border collie tries to get away with!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is a must read for every dog owner. Discovering my dogs' unique personalities was quite amazing, two border collies with totally different motivations. Training has become an enjoyment with each new success. The training methods outlined in this book have given me an insight to my dogs that I never thought possible. Thank you, Kathy Santo!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Finally--a comprehensive dog training book! Mrs. Santo has a delightful sense of humor that comes through in her writing. My impish golden retriever is acting like a very well behaved dog since implementing Mrs. Santo's suggestions--and it's only been a few days since I've read the book. I'm tossing all my other dog books out--Dog Sense covers it all.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is invaluable to both the novice and experienced dog owner. Kathy Santo's depth of knowledge and straightforward approach yield positive results in the form of a happy well trained dog and owner. I've owned and shown Weimaraners in conformation, agility and obedience for almost 10 years and find her methods practical and effective. If you've made the emotional and financial investment in owning a dog, you and your family will benefit by training the Kathy Santo way and have a dog you can love and live with.I highly recommend this book and will add it to my must read list for new puppy and dog owners!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have professionally trained dogs and conducted obedience classes and problem solving sessions for the past 25 years. I still try to read anything dog-related to keep myself up-to-date on new training methods to incorporate into my classes. I found Santo's book to be one of the very best available. I recommend it all my friends and clients. It's excellent information for new dog owners, but written with humor and insight that even professional dog trainers will enjoy and benefit from. Santo gives easy-to-follow instruction for basic obedience as well as the day-to-day problems any dog owner faces. She teaches methods that range from the most gentle of motivational techniques to ways to deal with dogs that require tough love. It's rare that I find a training book that I consider the \"one book to buy if you buy only one book.\" Santos' book is definitely that \"one book.\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have 2 dogs who are SO different from one another. This is the first book that takes each dogs' personality into consideration when training your dog. The book is definitely the best I've read on dog training - and I've read alot on this topic!I'm anxiously waiting another book by Kathy Santo. I hope she gets one out soon.I highly recommend this book!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Finally. I've waited and dreamed of a creative method of dog training.This book not only made sense but I found the information written in a very entertaining manner that encouraged me to want to continue reading and learn more.The way Kathy Santo approaches her training, each dog as an individual gives our four-legged family members the benefit of their unique personalities.I can only hope that Kathy decides to continue on her venue of writing more books about dogs.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I thought this was a great book. Full of very helpful information, written in a way that I just couldn't put it down! This book has lots of humor mixed in with the eductional part which made it a very easy and fun read.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "crawlspace",
        "description": "Six years after the alleged death of murderer Randy Dodd, true-crime writer Jake Tiptree and her assistant journey to the city of Eastport to investigate suspicions that Dodd faked his death, an effort that is challenged by sinister threats and the abduction of Jake's son. By the author of A Face in the Window. Reprint.",
        "authors": "['Sarah Graves']",
        "infoLink": "http://books.google.com/books?id=kcxSTLDK7tUC&dq=Crawlspace&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "Crawlspace is a book that my friend Chuck had been recommending to me for years as it was his favorite book of all time. I finally got around to reading this and must say I really enjoyed it. It is the story of a lonely, childless couple who befriend a young drifter only to have him move into their house, or more specifically, under the house. Over time, they come to trust Richard Atlee enough to even invite him to live with them. But, eventually, all good things must end. Crawlspace is scary at times and sad at times but one thing for sure, you won't forget young Richard Atlee any time soon. This was written in the early 70's and may be difficult to find but if you do, you'll be glad you did.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Crawlspace is an intellectual exploration into the psychological needs of people, human interactions, and the breaking point of the human psyche. An elderly couple is obsessed with the something that they've never done--the experience of parenting. The book kindly provides for them through the introduction of a lonely drifter character. What forms is the most gruesome parody of human relationships ever depicted. The drifter has nothing and, as such, is willing to accept nearly anything. The psychological makeup of the drifter suggests that he's either exceptionally mentally handicapped or that he's been treated most horribly throughout his life. He is undemanding, unassuming, and has almost no will. The elderly couple, whose lives have been more normal, have no idea how to reach the man and no way to help him open his eyes to the enjoyment of life. The psychological tension combined with the sheer hopelessness of the situation makes the novel a very depressing read.It could be summed up metaphorically: Severely mistreated sled-dog that has been used in vicious dogfighting finally escapes and, after traveling hundreds of miles in despair and loneliness, finds a macabre solace in a herd of milk cows. The dog eventually snaps from psychological tension, deprivation of productive attention, and constantly dodging the lumbering behemoths who rarely bother to look for the dog underfoot. The cows are forced to trample the dog to keep him from nipping at their ankles when they step on his tail.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was an adolescent read for me, yet I've returned to it time and time again...and with each subsequent reading, I've never failed to glean yet another &quot;nugget&quot; of insight into human nature ( all of its dark nature intact ). &quot;Crawlspace&quot; is one of those rare books that offers commentary on a page by page basis, Lieberman having skillfully interwoven such tidbits into his wonderful first person narrative. The story is enthralling, yet educates as it entertains. I cannot adequately stress this! I've read this work at least a half dozen times over the past three decades, and I still come away with yet another pearl of wisdom into what makes us do the things we do. Characters do not get more true to life than Alice and Albert Graves...I gained such an empathy for the elderly, and the quiet desperation in which they live out the remainder of their lives. The mean-spiritedness which bubbles along just under the surface of small town America...how small a catalyst it indeed takes to bring out the worst in people! This one's worth returning to many, many times down the road.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "jim the wonder dog",
        "description": "Long before canine YouTube stars, Missouri laid claim to the Smartest Dog in the World: Jim the Wonder Dog, a Great Depression Era hunting dog that many believed was either a genius or possessed of clairvoyant skills. Evidence existed for both claims: Jim predicted seven Kentucky Derby winners and the winners of the 1936 World Series and presidential race, but the setter could also take direction in foreign languages (Italian, French, German, Spanish), shorthand, and Morse Code and recognized both colors and musical instruments. This is the true story of the dog that became known as Missouri's Wonder Dog.",
        "authors": "['Marty Rhodes Figley']",
        "infoLink": "https://play.google.com/store/books/details?id=ruQHEAAAQBAJ&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "In the early 1940's, I was living with my grandfather in Springfield, Missouri. My grand-dad was a Continental Can Company mechanic who carried a special gas rationing exemption in connection with his work in servicing the giant Panama canners which were leased to food packers. Harry Buck drove a company car -a \"salesman's coupe\" with large trunk and platform replacing the rear seat, plus heavy-duty springs for the extra weight of his tool kits, over the state of Missouri and northern Arkansas from Monday through Friday. He was often called out on weekends, during which times, I would occasionally accompany him.When he was in the Marshall, Missouri area, Gramp stayed at the old Ruff Hotel, owned and run by the Van Arsdales. My grand-dad never met Jim (the dog died in 1937), but he did talk to Sam Van Arsdale about his remarkable dog and brought back Clarence Mitchell's book for me. My grand-dad also met townspeople who verified the accounts told about Jim. I was fascinated by the book and remember it vividly, more than a half-century after reading it. The one shortcoming I found with the book is the fact that it was written in the first-person, making it seem more like a Jack London tale than the thoroughly documented account of a supernatural fact that eludes our ability to explain, to this day. If only Jim had written it....",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Heart warming nonfiction story of an an amazingly smart dog. I read this book every one in awhile just to be re amazed. He was born in 1925 in Louisiana and was gifted to Samuel VanArsdale, of Marshall, Missouri.Quoting from the web site-So what makes Jim such a \"Wonder Dog\"? Jim displayed signs of extremely high intelligence.* Jim was able to pick out colors a person was wearing, although dogs are apparently color-blind.* He could pick out a car by its owner, color, make, or license plate number.* He could pick out a variety of trees or shrubs, name of a business, or the occupation or home of a stranger.* As Jim could not speak, a variety of answers were written on slips of paper even in different languages and Jim would always pick out the correct one.On top of this- the Story is written from the Dog's eye view- super cute.I would safely recommend it for all ages to read",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "little dog lost",
        "description": "A boy, a dog and an old man are all lonely before the boy plans a rally, the dog looks for a boy, and all the townspeople run to the old man's aid when lightning strikes his home. By the Newbery Honor-winning author of On My Honor. Reprint.",
        "authors": "['Marion Dane Bauer', 'Jennifer A. Bell']",
        "infoLink": "http://books.google.com/books?id=S0lTeYLjoJ8C&dq=Little+Dog+Lost&hl=&source=gbs_api",
        "categories": "['Juvenile Fiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This classic children's book tells the story of a Welsh Corgi puppy who gets lost in the woods and is adopted by a mother fox. He learns to survive in the wild as a fox, but is found at Christmas by humans and adopted by a little girl. The Corgi later goes back to the woods to help his injured fox mother, who eventually comes to live at the farm woodshed under the care of the Corgi's human family.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This wonderful book tells a tale of how adventure,curiosity and wonder..can get us in to trouble. It is also a tale of how a friend can get you out of it ,and home again safe. And then how wonderful it can be to get the chance to repay a kindness. This book wonderfully illustrated by Wallace Tripp ,who can sketch the pounce and bounce in a puppy really well. Loved it and you will too.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was my first introduction to the breed of dog known as the Welsh Corgi. From the moment I read the first page of this little book, I was in love. A wonderful story of lost and found. I still have my Weekly Reader copy...I will treasure it always.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "puppies dogs and blue northers",
        "description": "Minnesota author and dog musher Gary Paulsen reflects on the growth of his sled dogs as he and his animals discover the world around them.",
        "authors": "['Gary Paulsen']",
        "infoLink": "http://books.google.com/books?id=maQ-9BvBUUYC&dq=Puppies,+Dogs,+and+Blue+Northers&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "This is a must read follow-up to Gary's book \"Winterdance\". You'll read more about his dog Cookie as well as a variety of other sled dog related adventures and observations. If you've ever bonded with a dog (dog musher or not) you will enjoy this little gem of a read. It is a book easily read in one sitting.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This wonderful book about Gary and his dog, Cookie, starts here. Cookie is a true leader and loves being a sled dog. Cookie has about three litters a year. In one litter, one pup did not live; Cookie would not let it go until five days! A while after that Cookie and Gary were teaching pups to be true leaders, boy or girl, just like Cookie by running on the Alaskan plain. Cookie started to limp. She had arthritis! The doctor said, \" She would have to give up running as a sled dog!\" Will Gary have to give up racing, too? You will have to read the story and find out. Gary, a main character, is obviously representing Gary Paulsen, the author. I recommend this book to all readers, because it is heartwarming.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "A must read for any dog lover or one who enjoys Gary Paulsen's work. The simple joy of the little balls of fur that are husky puppies is portrayed lovingly throughout the book, as you follow along with the birth, education, and growing up of the litter of Gary Paulsen's best and most wonderful lead dog, Cookie. Unfortunately, there comes sadness, as Gary is forced to give up the kennel he loved, and keep only Cookie as a reminder of the dogs he once had. In an amazingly short space of time, you will find yourself laughing hysterically, and sobbing, and anyone who reads this book without doing both at least once has no sence of humor and a heart of stone.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "dog talk training your dog through a canine point of view",
        "description": "Explains canine behavior, offers practical advice on training a dog or puppy, and tells how to handle problem behaviors",
        "authors": "['John Ross', 'Barbara McKinney']",
        "infoLink": "http://books.google.com/books?id=hGjppYFd9qcC&dq=Dog+Talk:+Training+Your+Dog+Through+A+Canine+Point+Of+View&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "John Ross is vastly under-rated and under-cited; at least it seems that way with other trainers I've spoken with on the East Coast of the USA. This book provided the foundation for my training with my first dog that has led to my entry into professional dog training. While many people looking for house manners for their puppies seem to turn to the Monks of New Skete book, a fine work in its own rite, those who I encounter who chose *Dog Talk* typically seem to have better working relationships with their dogs.Perhaps it is his clear, concise, and straightforward method that makes the difference. Not only does he talk about his successes in dog training, he offers examples of his own failures in dog training to clearly demonstate to the reader better methods that he acquired as a result. Personally, I like to learn from someone who is likewise interested in learning, as well--I tend to be wary of those who seem to have never made mistakes.Not only does he get a dog owner through the basics of house manners, he includes solid instructions for expanding into a working relationship with a canine, and that includes a few fun tricks.This book is divided into two sections--the white section includes general stories, and anecdotally describes how to speak to your dog on a level he understands. In the central grey section he tells, step-by-step, how to train a particular behaviour (e.g., &quot;Sit,&quot; &quot;Stay,&quot; etc.), what to expect as your dog begins to learn, and how to address specific problems as they arise in the training process. He doesn't expect one to read his mind when he describes a process--he gives one all the necessary information, including photographs, so one will know if one is going about something the right way.The only potential drawback to this book is that he does incorporate a traditional dog training collar in some exercises. I contend, however, that if one has firmly followed his instructions on how to engage a dog--in language the dog understands--one will find that the dog performs such that corrections are not necessary. This is especially true if you begin work with a puppy (a dog under the age of two).If all humans engaged their new pups in *Dog Talk* from the day they brought them home, the dog shelters/dog pounds would no longer be over-flowing with discarded pets, and there would be virtually no such thing as a &quot;bad&quot; dog anymore.This book really is just that good.",
                "review/helpfulness": "63/63",
                "num_reviews": 63
            },
            {
                "review/text": "My wife and I had to interview for our labrador (twice), and were REQUIRED to purchase this book before we took ownership of our dog. I was kind of irked by this, and purchased this book to pacify both my wife and this kennel owner.With this as a background (I began reading this book with a bad attitude), I was amazed at what I read. Everything about the book made perfect sense. One reason this book is so different from all of the others is that it makes the reader stop and think in terms of a canine -- something that many people who just want a &quot;dog&quot; refuse to do. This book will not disappoint anyone whose dog is top priority in their life (which is hopefully the case).",
                "review/helpfulness": "45/45",
                "num_reviews": 45
            },
            {
                "review/text": "Dog training has recently gone through a metamorphosis, churning out a whole new slew of &quot;positive only&quot; training methods. Clickers and food are the new tools of the trade. Well, let me tell you - don't go for this &quot;ersatz&quot; training. You will only be in for frustration - both for you and your dog. Train your dog properly - in a way that is both easy and that your dog understands - without the use of gimmicks like treats and noisy toys. _Dog Talk_(and John Ross's book on puppy training)are the way to get there.He teaches you how to train a pet dog for real life. The &quot;down-stay&quot; is focused on immediately in his step-by-step training program, as he understands how this simple command can make or break your relationship with your dog. You teach all the commands in steps that introduce the dog to what you want without harsh corrections.You mold the dog into position, instead of correcting upwards sharply for a sit, gently place the dog in a down - no dragging with the collar. When your dog begins to understand, you up the criteria until your dog understands fully enough to &quot;test&quot; her. You place the leash and training collar on and give the command. Due to the work you have put into teaching the meaning of the word, you dog will almost certainly do as you ask. If not, a gentle correction is used to guide the dog into the proper position. If you had to use a correction, you go back and work on understanding with your dog. This is a completely comprehensive and fair way of training a dog.The author also teaches you how to solve all sorts of behavioral &quot;problems&quot; like food stealing, leash pulling, and jumping up in a fair and comprehensible manner that the dog understands very well. You correct using your dogs own natural corrections - a scruff shake, a harsh &quot;Naaah&quot; growl, a nip on the snout. This is what a dog understands. A dog doesn't understand that if it stops eating the cake on the table it will get a click and treat - it understands that if you don't stop her, she gets to eat cake, and that eating the cake is perfectly acceptable. If you growl &quot;naaaahhh&quot; as your dog is thinking about jumping up to eat the cake, you dog thinks &quot;uh oh, that behavior is not something that Pack Leader will allow&quot; and leaves the cake. Possibly she will try again, and you(pack leader) would follow up with a harsher &quot;naaaah&quot; and possibly a scruff shake. Again, and a nip on the muzzle.This is what a dog understands - the growl warns the dog that repercussions will ensue if she continues on that path. She understands that if she continues, she will be corrected. A dog learns this while with their mother. Its the natural way to train your dog - using your dog's own language. This is what you learn using Dog Talk.I have had many dogs. This book has helped me teach them each how to be exemplary companions in every way. We can go to baseball games - my dog will lie down and stay, her leash in her mouth. We can walk down busy streets - depending on local laws, she can wear her leash, or she can walk beside me carrying it in her mouth. She listens when I speak, and is continuing her education so that she can compete in obedience trials.When I first got her, she was overweight, aggressive, had separation anxiety, more energy than should be possible in a single dog, and the ability to pull me off my feet on walks. Now she is one of the best dogs I have ever had, because I learned to talk to her in her own language.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "People wonder why I have the perfect dog. It's because of this book. Not only does it deal with normal doggie situations, it gets into the heads of dogs AND their owners, so that you &quot;know&quot; and expect what will happen with the dog before it actually does. I totally recommend this book...I'm an expert &quot;growler&quot; now :-) If you've read this, you know what I mean.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I bought this book (amongst others) 8 years ago when I got my first dog. After reading all of the dog books I could lay my hands on, I decided to try this one. I followed it religiously and it worked like a dream. As a result, both my dogs are amazingly well trained and behaved. By the time they were six months old they both responded to spoken commands as well as hand signals. I can leave food out on the table without fear they will eat it when I'm not in the room, leave them in a down stay for as long as I need and take them for walks without being dragged. They even go pee on command! Neither one of them took or needed obedience training.Fair warning though, it does require time and effort. It isn't enough to try it once and give up if it doesn't work right away. If that is your approach then you should probably look for professional help.Also, while the book gives you excellent ideas and methods, it is not a cookbook. You can't simply follow the instructions exactly and expect it to work perfectly for every dog.Dogs all have their own personality and likes and dislikes. While one of my dogs will do rolls until the cows come home, the other hates doing even one. The book requires creativity and sensitivity on the part of the owner. If you don't have those qualities, it's probably best to find a pro who does.I've loaned this book to a dozen people since I got it. Just about every one of them loved it and used it to either train their dog or rid their dog of a bad habit. If you are the type of person who likes working with your dog and wants to teach him to do more than just 'sit', this is the book for you!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I'm a deeply committed appreciator of dog companionship. I've read a lot of dog training books, and this is the best I've come across. John Ross helps the owner understand what it means to be the the dog's pack leader. He respects a dog's basic nature and helps owners understand that nature better.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "John Ross is vastly under-rated and under-cited; at least it seems that way with other trainers I've spoken with on the East Coast of the USA. This book provided the foundation for my training with my first dog that has led to my entry into professional dog training. While many people looking for house manners for their puppies seem to turn to the Monks of New Skete book, a fine work in its own rite, those who I encounter who chose *Dog Talk* typically seem to have better working relationships with their dogs.Perhaps it is his clear, concise, and straightforward method that makes the difference. Not only does he talk about his successes in dog training, he offers examples of his own failures in dog training to clearly demonstate to the reader better methods that he acquired as a result. Personally, I like to learn from someone who is likewise interested in learning, as well--I tend to be wary of those who seem to have never made mistakes.Not only does he get a dog owner through the basics of house manners, he includes solid instructions for expanding into a working relationship with a canine, and that includes a few fun tricks.This book is divided into two sections--the white section includes general stories, and anecdotally describes how to speak to your dog on a level he understands. In the central grey section he tells, step-by-step, how to train a particular behaviour (e.g., &quot;Sit,&quot; &quot;Stay,&quot; etc.), what to expect as your dog begins to learn, and how to address specific problems as they arise in the training process. He doesn't expect one to read his mind when he describes a process--he gives one all the necessary information, including photographs, so one will know if one is going about something the right way.The only potential drawback to this book is that he does incorporate a traditional dog training collar in some exercises. I contend, however, that if one has firmly followed his instructions on how to engage a dog--in language the dog understands--one will find that the dog performs such that corrections are not necessary. This is especially true if you begin work with a puppy (a dog under the age of two).If all humans engaged their new pups in *Dog Talk* from the day they brought them home, the dog shelters/dog pounds would no longer be over-flowing with discarded pets, and there would be virtually no such thing as a &quot;bad&quot; dog anymore.This book really is just that good.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I've read a LOT of dog training books over the years, from the earliest Koehler (traditional trainer) to the latest &quot;fad&quot; titles like &quot;Positive Puppy Training Works&quot; by Joel Walton. John Ross's book really boils down the basics to brass tacks, and makes it easier for the layperson to understand. I don't use a text for my classes, but if I did, this would be it.The thing I like best about this book is John's balanced approach. It doesn't take a rocket scientist to learn that dogs, since they can't learn our language, need for us to communicate in ways that are meaningful to them. Balanced training is just better communication, period. Dogs understand it, so they learn faster. The &quot;positive only&quot; folks out there want you to think all corrections are going to ruin your relationship with your dog, but that is simply not so. Humane, effective corrections are a part of teaching dogs, and if you train the right way, you don't need them very often. Ross explains how to train the right way, with praise, rewards, and yes, corrections if needed. He's not afraid to tell it like it is. I find this refreshing, and I know--it works.I do agree that there is no substitute for a good training class, including this book. Use them together (you do have to do your homework) and you will end up with a really well-behaved dog. Since training never ends, the book will give you something to refer back to to keep Fido in excellent form long after the class is over.You owe it to your dog to communicate with him in a language he understands. &quot;Dog Talk&quot; will show you how.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I checked this book out of the library five years ago (along with about seven other dog training books) when I got my boxer puppy. This book was so helpful I returned all the others and bought this one. I still refer to it when people ask me how I got such a well-behaved dog. I have lent it to other dog-owners numerous times. Everyone I have lent it to has bought a copy for her/himself as well. My dog is such a joy to my family, friends and even the neighborhood, and I owe that, in part, to this book. It is logical, easy to understand, and thorough. I do recommend reading several dog-training books so that you get a difference of opinion on training techniques and care. But you will find that the information in this one book will encompass what it takes several books to do. This is a must have reference book to own throughout your dog's life.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I got an invaluable insight on how to train my dog. My dogs are well trained because I applied John's basic methods and concepts of how a dog understands and thinks and should be trained. I recommended this book to any dog owner.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "on talking terms with dogs calming signals",
        "description": "One of our all time best selling books is now in its second edition with three additional chapters, color photos and descriptive captions. Turid Rugaas is a noted expert on canine body language, notably \"calming signals\" which are signals dogs give to other dogs and humans to denote stress and to attempt defuse situations that otherwise might result in fights or aggression. Written in practical, down-to-earth, logical language. Companion DVD, 'Calming Signals: What Your Dog Tells You",
        "authors": "['Turid Rugaas']",
        "infoLink": "http://books.google.com/books?id=tB7tONlHCVQC&dq=On+Talking+Terms+With+Dogs+:+Calming+Signals&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "This is a simple little book. It's cheap and doesn't look like much, but the content can revolutionize your communication with your dog. It's about dog language, but not about the &quot;big&quot; wolf postures of dominance or submission that many of us already know about. This book is about the wide range of subtle signals (about 28, I think) that dogs use to communicate &quot;please calm down&quot; towards other dogs - or their owners. Because owners stress their dogs a lot, unintentionally. Like when we practice obedience exercises. In the middle of training, the dog starts looking away, yawning or sniffing the grass! Bored? Stubborn? Dominant? No, it's probably sending you signals to ask you to calm down!I attended a weekend seminar with Turid Rugaas last year which opened my eyes and I know that this works. Since then, and also since looking at video recordings from dog meetings, I now understand that dogs &quot;talk&quot; all the time. When meeting us or another dog, every single move or glance can carry a meaning. The other dog understands, if he has been allowed to &quot;practice&quot; dog language in lots of meetings with other dogs, but we, the humans, the supposed alphas, don't understand. Instead we try to teach the dog OUR verbal language. How frustrating for the dog! Shouldn't we first learn the dog's language?This is a book that makes you understand that dog language is so much more than where the tail or the ears are. It's about signals that our own pets send to us daily. With this book we can start looking at our own dog and see much, much more than we saw before. We will actually start to understand what our dog tells us. And, even more thrilling, we can use the dog's language ourselves and be understood by the dog! We can use the same calming signals to help the dog for example in a stressful situation.There is a cultural diffence between the European look on dog training and the American look. In America there is much focus on teaching a dog through reinforcing behaviors, like operant conditioning. Clicker training is very good, and I'm all for it. But when &quot;Culture Clash&quot; by Jean Donaldson came, it was considered to be a revolution, because some Americans had actually forgotten that dogs are dogs, with dogs' needs and drives and motivations!In Europe, we've always been interested in dog behavior. Konrad Lorenz is a good example. Swedish &quot;dog psychologist&quot; Anders Hallgren wrote about a dog's calming signals more than ten years ago, inspired by Ms Rugaas. Unfortunately his books are not spred in the US. Turid is Norwegian and also represents the European way: to look at the dog as a dog and try to understand how it thinks and feels and acts in a pack. So therefore I think that this is a very good book for every single dog owner, but especially (no offense) for American clicker-trainers. This book will make them even better trainers, because it will probably give them an important missing piece in the training puzzle.I think I can make a promise: If you read this book and use it, you'll never be able to look at a dog again the way you did before. It's a simple little book, but, at best, it's breath-taking!",
                "review/helpfulness": "529/538",
                "num_reviews": 538
            },
            {
                "review/text": "For the first time, I am now able to understand my best friends, my dogs. Not only my dogs, but all dogs. This book should be read by all people not just by persons who love dogs. This book should be required reading in elementary or junior high schools. I am absolutely convinced that the number of dog bites in children and adults would be much lessened were we all to know what is within Turid Rugaas' Calming Signals.An example of my new wisdom: I walk my two dogs every day and every once in a while my one dog will stop and sniff at nothing. Now I don't mean she stops for a few seconds and sniffs at a bush or rock; she stops and refuses to move forward at all while she continues to sniff at an empty spot on the ground, all the while looking up at me. I would tug and pull on her leash, becoming more and more upset. Not realizing that when we had started the walk I was already tense and stressed, that I was hurrying and not paying attention to anything around me because I was concentrating on something disturbing. All this time she was telling me to calm down. Once I learned what she was saying, I forced myself to stop for a moment and take a few deep breaths and relax. Good for me, good for her and a much more enjoyable walk.Thank you Turid.",
                "review/helpfulness": "200/213",
                "num_reviews": 213
            },
            {
                "review/text": "This an exceptional book that should be mandatory reading for all dog owners. If you have a problem dog, or just want to understand why dogs do what they do, this book is for you. This book will make for more happy owners and dogs. It is a great book for those of you who dont like to or simply dont have the time to read a lot. It is a to-the-point, no-nonsense and easy to read introduction to canine communication that explains dog behavior and interpreting dog communication signals in an easy to understand way. This a a short but very enlightening volume, filled with a ton of great information. A bit off-beat and quirky at times, it is a wonderful resource no dog owners library should be without. And the affordable price makes it even more worth while! I will continue to buy it as a gift for my dog-training friends and students.",
                "review/helpfulness": "122/124",
                "num_reviews": 124
            },
            {
                "review/text": "Turid Rugaas' book is basically a simple book on one facet of canine body language.Most dog owners are aware of the concept of dominance: how dogs use growls, stares and other forms of ritualised aggression to raise their position in the pack hierachy. This is the other side of the coin: the language that dogs use to keep the peace in the pack and avoid conflict. Although Turid calls these postures \"calming signals\", most of us would probably call them signs of submission.Although the information in this book is interesting, I found the book unrealistically simplistic. Obviously, communicating with your dog in a format he can understand is immensely valuable for trainers and owners alike. However, Turid seems to think that any problem can be cured by using calming signals. There are numerous anecdotes in the book where dogs with behavioural problems are cured in a few minutes by the proper application of calming signals. Turid does not not discuss any cases where calming signals alone were insufficient to cure a dog's behavioural problems. I admit that calming signals are useful in many circumstances, but unfortunately they are not a magic cure for every dog's problems.I was also mildly annoyed that Turid discourages readers from ever using non-submissive body language with their dogs, no matter the circumstance: in her own words \"You have always a choice of being threatening or calming. To me the choice is easy.\" She seems to feel that using canine signals to convey anything except \"calming\" is tantamount to dog abuse. However, dominance and threat are just as much a part of canine body language as \"calming signals\" are. Why should we not occasionally use these as well, when they are appropriate? I might avert my gaze to calm a stressed dog, but if a dog is knowingly overstepping his bounds in the home a more appropriate reaction might be a hard stare. I recommend the Suzanne Clothier article \"Learning from the masters\" to anyone who would like to learn more about different uses of canine body language(http://www.flyingdogpress.com/pposa.html).Would I recommend this book? Yes. It is a good primer on one facet of canine body language, and most dog owners could probably benefit from a read of it. However, please keep in mind that calming signals are not the cure for every problem your dog might have!",
                "review/helpfulness": "107/116",
                "num_reviews": 116
            },
            {
                "review/text": "If you and your dog have never taken an obedience class, this book could be a basic tool for beginning to understand your dog's behavior. But I do mean a &quot;basic&quot; tool. If you have, however, gone through any type of obedience or behavioral training with your dog, this book might not be a good use of your time and money. The information it provides is rudimentary at best. That is not to say that it isn't interesting, nor that it might not help some people. Just be aware that it probably won't be a magical solution to your dog's behavior problem. Turid Rugaas gives few hard and fast answers. Many of her solutions rely upon using her own good-natured and well-behaved dog to help calm a problem dog. Since Ms. Rugaas' dog isn't available to the rest of us, not much help can be found from that quarter.Considering that &quot;On Talking Terms with Dogs&quot; is more of a booklet than a book, having only 20-odd numbered pages and a few more unnumbered introductory ones, the price is fairly steep. A good obedience class will cost you a little more, but you and your dog will get far more out of it in the long run.",
                "review/helpfulness": "41/58",
                "num_reviews": 58
            },
            {
                "review/text": "During my five, post-retirement years as a shelter volunteer, I've accumulated over six shelf-feet of dog books, most relating to behavior and training. Many were skimmed and forgotten; others required several readings to achieve maximum effect; some I kept only as examples of what I have come to consider bad practice.In contrast, OTTWD produced an immediate &quot;Ah ha!&quot; reaction, and I reread it occasionally as much to renew the sense of inspiration as to glean more information from its scant pages. (As other reviewers have pointed out, there are other, far more exhaustive treatments of the vocabulary of dogs -- such as those by Roger Abrantes and Stanley Coren.)I had barely finished reading the author's first, rather sketchy, case-study (which describes the role of her dog, Vesla, in communicating with the client's dog -- a recurring theme throughout) when I started to think about a pair of Border Collie mixes, Amelia and Cinder, at our shelter.They are as close to feral as any dogs I've ever been around. We suspect they grew up from puppies as junkyard dogs. Among the dozens of our all-volunteer staff who have tried to befriend them, only three of the most empathetic, female volunteers have progressed to the point where they can leash them for a walk. Amelia and Cinder always responded to me by barking and retreating, even though I already knew to avoid assertive body posture, eye contact, use of my deep, male voice, etc. I eventually quit trying to connect with them.The possibility that Ms. Rugaas opened for me was to use another dog as an intermediary. I decided to enlist the services of Mercedes, a young, high-strung, female Pit Bull that I was already teaching basic obedience. She will do anything she can understand to earn a quarter-inch cube of doggie salami.After Mercedes had learned the &quot;down&quot; command, both by hand signal and verbally, we began practicing it closer and closer to Amelia and Cinder's run. At first they barked constantly whenever Mercedes and I were within sight. However, after daily repetitions over a few weeks, &quot;the girls&quot;, as I call them, would stop barking and posturing within a second after Mercedes would lie down. After a few minutes of calm, sometimes the girls too would lie down -- often at a closer distance to me than they had ever approached when I was alone. I rewarded their calm by flipping tiny treats into their run.Within a few weeks I was able to approach the girls without Mercedes, enter their run and feed them by hand. Although they still approach me with great caution, I am now able to touch each of them around the muzzle.I don't know where my efforts will lead. I do know that what little progress I have made would not have been possible, were it not for the breakthrough I achieved with help from Mercedes -- and Turid Rugaas.",
                "review/helpfulness": "55/55",
                "num_reviews": 55
            },
            {
                "review/text": "Not a bad 37 page pamphlet as far as it goes . . . which is not very far. It came in a shipment of four books on the topic of dog to human communication, all about the same price. It has proven to be the least helpful by far. Dog Language by Abrantes is much more complete, is over two hundred and fifty pages with a seven page bibliography (vs. a ten item listing in this one.) This book thoroughly covers one word of the dogs vocabulary with dozens of variations. The anecdotal information is interesting but I expected more.",
                "review/helpfulness": "45/55",
                "num_reviews": 55
            },
            {
                "review/text": "I am an American who lives in Germany. My husband and I are training our Labrador to be a search and rescue dog with a German organization. This book comes highly recommended by our group. I am in the middle of reading it and applying its teachings to the training of our dog; I can't believe the difference in my relationship with him. It takes time and consistency to make it effective...patience too, but it is oh so worth it!A couple of things that I have learned are:1) If you think that your dog has messed up, look at yourself...99% of the time it's the trainer who has messed up.2) It is usually the trainer who has hindered the dog in speaking and understanding &quot;dogese&quot;, that is &quot;calming signals&quot;, and therefore it is the trainer who has to learn and &quot;re-teach&quot; this language to the dog. Calming Signals is just the book to teach this.During our search and rescue training, my dog used to get so wound up just before he searched a pile of rubble for a &quot;victim&quot; that he didn't work well. Calming Signals has helped me to effectively calm my dog down by using HIS language, and not mine. When I was stern with him, he would only get more wound up. Now, we sit down on the ground, I don't look him directly in the eyes, and yes, I even yawn at him. It works!Dog training is an investment of time (and lots of it). Dogese IS a foreign language for humans, and if our dogs are important to us, it is our responsibility to learn their language! Don't expect to give your dog a few signals here and there and have everything magically fall into place. You and your dog are learning to &quot;communicate&quot; with each other and Calming Signals is the &quot;phrase book&quot; to this language.I very much appreciate the insights from Gunilla Melkersson's review of Calming Signals and especially the cultural difference in American and European dog training. It is absolutely true!",
                "review/helpfulness": "50/50",
                "num_reviews": 50
            },
            {
                "review/text": "Having looked at other customer reviews for this book, I felt I had to write one of my own. I am a professional dog trainer, behaviorist, Delta Society licensed Evaluator, and Instructor, and I also train Service dogs.I always insist my clients read this book. I always show the video to clients.For the people who rated this book low in their reviews, I suggest you read the book several times again, watch the video several times.After reading, and viewing, go to a dog park (bring the book with for reference) and watch dogs interacting with each other. Try to predict what the dogs will do next by looking at their body language, and use of Calming Signals.Calming signals work. I look for them and use them myself when evaluating dogs for training, & when doing Delta Society Evaluations. I use them when working with aggressive dogs. The reason I am writing this today, is because I came to Amazon to order more copies of the book. One to keep for myself, one to lend to others. I have to do this, because I lent my first copy to one person too many, and it didn't come back. My next copy just became too worn out.",
                "review/helpfulness": "44/44",
                "num_reviews": 44
            },
            {
                "review/text": "The knowledge gained from reading &quot;On Talking Terms&quot; has enabled me to save the lives of dogs that would have been destroyed. As a Dachshund rescuer I have encountered dogs from terrible situations. The worst was Willie, a small, gorgious chocolate and tan, long haired Doxie. He had been a stud dog in a puppy mill with the only human interaction being of a negative nature.A fear biter, Willie was very difficult to handle when he came to our home. Unable to touch him we literally had to hurd him into the house and out of the house to potty. The only life he had known was in a cage and life in a house with humans was an extreme shock to him.Desperate to help Willie I ordered several books in search of information which would enable me to break through the wall of fear surrounding him. By using the body language outlined by Turid Rugaas, which Willie understood, I was able to put him at ease and touch him for the very first time. Honestly the boy seemed so surprized that I knew his language.Four months later we were able to place Willie with a special family who understood how far he had come from his puppy mill days. No longer frightened, he knew the kindness of and the love to be found in a dog loving home. He was and is a dog who owes his life to Turid Rugaas.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            }
        ]
    },
    {
        "Title": "the rosetta bone the key to communication between humans and canines howell dog book of distinction",
        "description": "Far too often, we humans expect our dogs to understand what we say to them. Though we may spend a lot of time talking to them, we're really not communicating. And without proper communication, it's impossible to train a dog properly-- let alone make your human/canine relationship a rewarding one. Packed with unique insights and gentle training advice, The Rosetta Bone provides average dog owners with the know-how they need to decipher canine meanings, communicate effectively, increase training success, and share a deeper bond. Focusing on the behavioral basis-- the \"silent\" symbols-- for learning, understanding, and communicating, expert dog trainer and competitor Cheryl S. Smith reveals how you can use your own body language to send a message and even teach a dog what specific words mean. She reveals how a dog's breed can affect his personality and explains how to decode-- and correct-- common behavior problems. With the knowledge and solutions this book provides, you will train more effectively, enjoy your dog more, and ease your own stress. What's more, you'll apply what you've learned immediately, with solid, practical advice on: * Learning the As, Bs, Cs, and Ds of human-canine communication * Teaching English to your dog-- and, in turn, understanding \"Doglish\" * Using body language to assist in communication and help your dog learn * Incorporating various kinds of touch to tighten your bond * Making rewards and reprimands real, relevant, and reliable * Understanding the relationship between kids and dogs Supplemented with enlightening, easy-to-do exercises with your dog, as well as quotes from trainers, behaviorists, veterinarians, and humane society workers, The Rosetta Bone is a revealing guide to making life better in your human/canine household.",
        "authors": "['Cheryl S. Smith']",
        "infoLink": "http://books.google.com/books?id=OMmeDAEACAAJ&dq=The+Rosetta+Bone:+The+Key+to+Communication+Between+Humans+and+Canines+(Howell+Dog+Book+of+Distinction)&hl=&source=gbs_api",
        "categories": "['Pets']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "The Rosetta Bone is the best dog training, dog communication, human/pet love stories book I have ever read (and I have a shelf full to which I often refer). Learning to read my dogs' body language and gaining an awareness of how they read mine, has opened a new dimension of fun and sharing in our relationship. They and I are more responsive to each other and take more joy in the time we spend together each day. This book is a must read for the person acquiring their first dog, experiencing behavior problems with a current animal, or wanting to communicate with their dog on a deeper level. Cheryl Smith's insights into how dogs communicate (top dogs give a disdainful look--they don't jerk misbehavig subordinates or roll them on their back) turns training into play time and enhances the dog's life with its people. Thanks to the Rosetta Bone the time I spend with my dogs is more relaxed and joyful. Thanks Cheryl Smith--you've done the dog loving world a great favor with this great book!",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "This book raised my consciousness about the two way communication between dog and owner. It doesn't give many step by step directions about training but that can be found in reference books at the end of the book. Perhaps understanding the relatiionship with our pets is a bigger step before attempting specific training. I found myself much more sensitive to my dog after reading this.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This was a superb book. It confirmed so many things I knew about dogs...the very same things I had a difficult time convincing \"expert\" trainers about! It also taught me quite a few things by clarifying the subtle differences between several canine messages, by explaining the different behaviors of certain breeds of dogs, and by clearing up the issues of common misinformation.This is a beautifully structured book. I was comfortable enough to read straight through it in two sittings. The sidebar exercises were fun and informative. The gentle training methods used in this book work with the dog's natural behaviors, easing stress on both species. Not to be forgotten, the book was a lot of fun, too.Included in the index is a nice resource section packed with websites, mailing addresses, and telephone numbers of noteworthy organizations. There are even sections in the book that touch briefly on canine massage techniques and the possibility of telepathic communication with dogs. Chapter 12 deals solely with various events and competitions dogs can enter and enjoy.This is a great book for anyone interested in strengthening the bond they share with their canine companion(s).",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    }
]