[
    {
        "Title": "the ultimate improv book a complete guide to comedy improvisation",
        "description": "Provides a curriculum consisting of twenty-four lessons, explaining what improvisation is, techniques, and how to start an improvisation team.",
        "authors": "['Edward J. Nevraumont', 'Nicholas P. Hanson', 'Kurt Smeaton']",
        "infoLink": "http://books.google.com/books?id=HIMrAQAAMAAJ&dq=The+Ultimate+Improv+Book:+A+Complete+Guide+to+Comedy+Improvisation&hl=&source=gbs_api",
        "categories": "['Performing Arts']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I had thought that this book would be a good guide for beginner or experience improvisors to improve their skills; however the book is written with advice on how to start an improv team at a high school and has a great deal of focus on competiting in the Canadian Improv Games (two areas i was just not intersted in). The chapters are very short and try to drop in every improv term without going into depth on any. The book does have a nice list of exercises and suggestions at the end, but many again focus on performating them with younger improvisors and some descriptions weren't complete enough to attempt to use them.This book would probably be most helpful to someone who is already very familiar with improv and who wants to teach it to high school students. But for the sake of those you are teaching, seek out more complete references like those by Viola Spolin.",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "ANYONE and EVERYONE involved with the Canadian improv games should own this book. Teams who are just starting out, teachers who are thinking of starting a team, and players who have been improvising for years can all benefit from the information. Great skill-developing games, lists of characteristics, genres, and so on to help teams practise, and conprehensive descriptions of each game. Outlines dos and don't of improv. I love this book more than life itself.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I'd recommend the Del Close book if you want a good read on improv. This is for kids",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "one great game two teams two dreams in the first ever national championship high school football game",
        "description": "For more than a century, no Number 1 and Number 2 high schoolfootball team had ever met -- until October 6, 2001 One Great Game This is the story of two teams -- Concord De La Salle, a private Catholic school in an upscale Northern California suburb, and Long Beach Poly, a proud public institution from a blue-collar SoCal seaport -- striving to achieve the same goal: the all-American dream. In this supercharged account of the first-ever national high-school championship game, acclaimed sports journalist -- and former Poly varsity football player -- Don Wallace goes out onto the field and straight into the heart of each team. One Great Game offers a rare look at the world of young-adult sportsmanship, featuring up-close and personal interviews with the team players and their families, coaches and cheerleaders, rabid fans and sworn enemies. The result is a powerful piece of sports literature in the tradition of the classic Friday Night Lights. More than a book about football, One Great Game is an engaging cultural history about twenty-first-century American life.",
        "authors": "['Don Wallace']",
        "infoLink": "https://play.google.com/store/books/details?id=mrNnKw_gjUEC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Don Wallace's ability to capture an essence of not only the emotions of what was truly a first in the world of prep sports, but the historical content that lead to a memorable event just a few weeks after this nation's 9/11 tragedy. The game was a temporary remedy for sports fans wanting to escape the horrors that occured in New York City. ESPN had named it one of the top sporting events in the country to watch for that week.Wallace is able to captivate an audience with his descriptions of the preparation that went into the game itself. His attention to detail as to how each schools football programs arrived at the point of their unforgetable matchup is outstanding. I am most impressed with how the book uses high school football as a metaphor for how life as viewed by those involved in the game.Don Wallace describes his own upbringing in Long Beach and the dynamics that have that have occured since he has moved away. His definitions of the suburban community of Concord, California, and how it somewhat evolves around the school with the infamous winning streak, actually makes the town sound interesting.I believe those choosing to purchase this book will realize it is more than just about one football game. It reaches more into depth of two contrasting communities, that despite the differences, are very similar. It is more about the country we live in today.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I confess I was intrigued partly because of the success of &quot;Friday Night Lights,&quot; H.G. Bissinger's classic look at high school football. However, I like Wallace's book better. While &quot;Lights&quot; drifted into long, rather dry sociological digressions, &quot;One Great Game&quot; is focused, beautifully written, and still explores--in a hard-hitting way--the fascinating contrast in two football cultures. It's an irresistible matchup: white, upscale Concord De La Salle, No. 1 in the nation and riding a 113-game winning streak, versus blue-collar, diverse Long Beach Poly, No. 2 in the nation and producer of more NFL football talent than any school ever. I was amazed at the access Wallace must have gotten to produce this book. He obviously spent a lot of times in the lockerrooms, absorbing the changing emotions and dreams of these young athletes, and he also proves himself an exceptional student of the two communities where these schools are based. It's worth the read just to glimpse into the mind and philosophy of De La Salle coach Bob Ladouceur, architect of the record winning streak, a guy who's apparently able to turn young men of good or even modest athletic ability into a juggernaut through discipline and commitment to the common goal. It's the kind of thing that's rare and makes an amazing story.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book chronicles the first-ever meeting between the #1 and #2-ranked high school football teams in America. In October of 2001, #1 Long Beach Poly, a Southern California powerhouse with a long, storied tradition, alma mater to a record 50 past and present NFL players, played host to #2 De La Salle, a Catholic all-boys school from the upper-class suburban town of Concord, CA, home of the nation's longest football (and perhaps all team sports) winning streak, which, before the Game, stands at an astounding 116 games.Prior to this game, no #1 and #2 teams had ever met in head-to-head competition, which always beggared the question, \"Who's REALLY #1?,\" since most, if not all of the USAToday's Top 25 high school teams would end up the season undefeated.Long Beach is the \"most diverse city in America,\" a sprawling city of 425,000 sandwiched between monstrous L.A. to the north, and the Pacific Ocean to the south. It has a long and rich history, much of it less-than-sparkling, where waves of immigration, first of blacks, Hispanics, and Japanese in the early part of the 20th century, then of Vietnamese, Cambodians, and Central Americans following upheavals in their respective homelands, made for a boiling brew of racial tension. Despite all this, Polytechnic High School, located in the decaying heart of downtown Long Beach, is a shining beacon for the whole community, not only as an athletic powerhouse, but as an academic springboard to prestigious colleges. in the 2001 season, the Poly Jackrabbits have perhaps their most talented team ever, with 5 players ranked among the 100 best high school players in the country.Concord, California, is a wealthy, mostly white, upper-middle-class suburb in the East Bay Area, populated by the professional, educated types who toil in nearby San Francisco. De La Salle is an exclusive all-boys school where tuition is $7,200 per year. The De La Salle Spartans are coached by a living legend, Bob Ladouceur, who since 1979, has lost only 14 games in his entire career, and none since December of 1991.The book takes two parallel stories, one of Poly, the other of De La Salle, focusing on the players, coaches, families, and overall atmosphere of each school and community, before intersecting them at the Game, which is described in bone-jarring play-by-play detail. You can almost imagine listening to the game on the radio, the play-by-play is so well-written.The Game was billed as a sort of David vs. Goliath, with De La Salle playing the part of David, traditionally undersized but winning on the basis of suberb coaching and relentless conditioning, and Long Beach Poly playing Goliath, with massive offensive and defensive lines and Division I college talent populating every skill position. However, when reading about each program, the reader gets the impression that instead of David vs. Goliath, it's more like Godzilla vs. Mothra, two unstoppable juggernauts heading toward a climactic Battle Royale. And ultimately, that is exactly what it is - simply one of the finest battles between two programs of the highest caliber in the biggest game of their lives, and possibly the lives of many others.I was very satisfied with this book. If you like football, sports in general, or just like a thrilling and consuming read, this book delivers.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "When I first picked up the book I was worried that the account would be bias toward the Poly side, especially considering it's the writer's alma mater. However, Mr. Wallace presents a fair, balanced account of one of the most anticipated prep sporting events ever. He starts off about a year prior to the game, when it was only a rumor and concludes with an action filled account of the game (portrayed play by play). Characters are well developed, and -- although I can only speak from experience on the De La Salle side -- seem to be very accurate. The introduction leading up to the game got a bit long winded at times, but outside of that the book was hard to put down. I recommend it to any fan of high school sports, as well as for people curious of how two of the most successful football programs in America opperate.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the complete idiots guide to basketball",
        "description": "\"Irreverent in approach, these guides include tips and advice from leading authoritimes, aiming to help with life's big decisions and challenges, as well as hobbies. This book should help readers how to watch and understand basketball. \"",
        "authors": "['Walt Frazier', 'Alex Sachare']",
        "infoLink": "http://books.google.com/books?id=KcIF8rb7g9MC&dq=The+Complete+Idiot%27s+Guide+to+Basketball&hl=&source=gbs_api",
        "categories": "['Basketball']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Classy Clyde Frazier covers the fundamentals of basketball: the vocabulary, the role of each position, the basics of offense and defense, and a few common set plays. His writing is fun to read if a bit dumbed-down (hence the title). He draws examples largely from his playing days, but knows well and comments aptly on players of all eras. He draws the distinctions between college and pro ball and includes women's and high school ball, but properly focuses primarily on the NBA, where the game is played at its highest level. He shows you what to focus on when you watch a game and demonstrates how each player's skills come into play in the course of offense and defense. This book will enhance the novice's appreciation for and enjoyment of the game; from what I have read of Digger Phelps' &quot;Basketball for Dummies,&quot; I'm glad I read Clyde's book instead.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Buy Basketball for Dummies instead.In search of a book which would get me up to speed about a sport which I had never played but which my sons have become increasingly passionate about, I bought and read both. You would be and idiot to buy The Complete Idiot's Guide to Basketball.The author appears to be more preoccupied with telling you how wonderful he and the players of his (long bygone) era were. The references to today's players are painfully few. His snipping asides against the work ethic of today's players should have no space in a book of this sort; it serves only to make him sound whinny. His writing is practically devoid of humour and his descriptions of plays and strategies are fairly tedious. The game just does not come alive under his pen. Had I been an absolute newcommer to the sport when I read this book, I would have encouraged my boys to take up more exciting sports like synchronised swimming. FOrtunately, I had watched several live and taped games and had my children's interest to help me realise that there was much more to basketball than I could find in the pages of this book.Try again Mr. Frazier",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            }
        ]
    },
    {
        "Title": "basketball skills drills",
        "description": "Basketball Skills & Drills is your guide to mastering the basics of basketball, including footwork, ball handling, player positioning, post and perimeter play, rebounding, plus offensive and defensive individual and team tactics.",
        "authors": "['Krause, Jerry V.', 'Nelson, Craig']",
        "infoLink": "http://books.google.com/books?id=WlFyDwAAQBAJ&dq=Basketball+Skills&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book is aimed at coaches who have had little or no expierence in the game of basketball. It includes all the basics of basketball and some players may benifit from it. The book is for the coach who is concerned about their players overall developement. This book will help the beginner but, it will be of very little use for the more advanced.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "Even the most experienced players will need to review basketball fundamentals if they decide to begin coaching. What is second nature for you is brand new to young players.You will be doing a better job than 99.9% of youth league coaches if you teach your young players the solid fundamentals in this book. I have coached youth basketball for many years, and this book is the first place I look at the beginning of each season.Some drills are too complex for very young players, but if you instill the basics found in the early chapters, your youthful players will reap the benefits for the rest of their basketball lives.Highest recommendation!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I found this book to be an excellent tool for running youth practices. It explains every phase of the game and makes it easy for you to pass this knowledge on to your players.What is contained in this book are rules you will use for your entire basketball career. A great reference book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I would highly recommend for any basketball coach at any level. I have been playing basketball for 30 years and found several new techniques, ideas and concepts in this book. Very well done.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Jerry Krause and Don Meyer really bring home how to teach fundamentals of basketball through progression. They break down defensive stance, passing, cutting, screening, and more like I've never seen before. The DVD brings any confusion to a halt by explaining drills and the exact sequence needed for players to fully understand how to play the game of basketball. This book/DVD combination is a must have for all coaches!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I had the distinct privilege of working for coaching legend Don Meyer for 16 GREAT summers at his Bison Basketball Camp when he was the coach at Lipscomb University. I got to meet Jerry Krause, the coach who mentored Coach Meyer on teaching fundamentals. Meyer is a master teacher of the basics of the game, but he learned a lot of it from the author of this book,Coach Krause.This book is a great tool for beginning coaches, youth coaches and recreational coaches who want to teach more than a play or two and how to run a zone defense.It is also a great reference for the serious high school coach who really wants to master teaching the essential fundamentals of the game of basketball. If the skill and how to teach it cannot be found in this book, it is not worth knowing about.Kevin Sivils - author of Game Strategy and Tactics for BasketballGame Strategies and Tactics for Basketball: Bench Coaching for Success",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the peaceful classroom in action a k6 activity guide on how to create one and how to keep it",
        "description": "This inspiring, practical and highly usable activity book shows how to create peaceful, productive classrooms from the first day of school. Teach students respect, acceptance and conflict resolution skills while also improving writing and language skills-important with today's emphasis on academics and accountability. The Peaceful Classroom in Action will show you how to: create a peaceful classroom from the first day of school build a climate of respect help kids resolve conflicts maintain an atmosphere of peacefulness throughout the year teach all your students, even your most difficult, how to be peacemakers improve your students' writing ability as you teach peacemaking concepts integrate literature and peacemaking build collaboration across the curriculum implement effective techniques for dealing with challenging students These simple peacemaking skills will enhance your students emotional competence and make classrooms everywhere caring and inviting places. (A companion book to \"Learning the Skills of Peacemaking\" by Naomi Drew) Grades K-6.",
        "authors": "['Naomi Drew']",
        "infoLink": "http://books.google.com/books?id=ogQBAAAACAAJ&dq=The+Peaceful+Classroom+in+Action:+A+k-6+Activity+Guide+on+How+to+Create+One+and+How+to+Keep+It!&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Let me just tell you that Peaceful Classroom has changed my life!! I am a totally different teacher today than I was 4 years ago. I feel that I am a much more positive and inspiring person and teacher. I want to thank you for helping that to happen. I am blown away by the response my children have taken to it. We read, write, discuss and role play each day to strengthen our understandings and passion for peace. It is just wonderful to be a part of it!I am so excited about the transformations and accomplishments that my school has made since adopting the Peaceful School concept. I cannot speak enough about it. I am constantly trying to refer other teachers to your books. I can't imagine teaching any other way now. I live and breathe peacemaking and my students are better friends and citizens because of it. So, again, THANK YOU!!!! I would highly recommend this book to any educator who strives to create a peaceful and productive learning environment for children.From my heart to yours,Stephanie WallaceMultiage Teacher(1st/2nd)Summerville, South Carolina",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "After using Naomi Drew's first book Learning the Skills of Peacemaking, I decided to try this one. I loved it! The Peaceful Classroom in Action helped me integrate writing and language arts with peacemaking. My students really enjoy the activities, they're getting along better, plus their writing skills have improved. I highly recommend this book. Not only is it helpful, it's laid out in a way that makes all the content extremely accessible. I wish there were more books out there like this one.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "faith facts for young catholics drills games and activities for middle school students",
        "description": "Names of saints, Catholic vocabulary, biblical passages and lessons come to life as students drill individually and in friendly competition with one another to learn important lessons of their faith. 25 easy-to-use drills, games, and exercises that can be used for individual review or in the classroom. Answers are included as well as adaptations for each game.",
        "authors": "['Kieran Sawyer']",
        "infoLink": "http://books.google.com/books?id=CnYFAAAACAAJ&dq=Faith+Facts+for+Young+Catholics:+Drills,+Games+and+Activities+for+Middle+School+Students&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Faith Facts for Young Catholics is a great way to get kidsinvolved. The games and activities are easy to explain and you getseveral different activities per topic. I like the fact that youdon't need a lot of preparation. A Xerox machine is all that isrequired ahead of time. The kids will be having so much fun that theywill forget they are learning. This is a fun way to teach. This is agreat tool for young middle school students.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Are you searching for a resource that makes learning the Catechism fun? Faith Facts for Young Catholics is an excellent resource for middle school Catechists. The activities for learning the ten commandments are engaging and encourage application to every day life. Scripture quote games are great tools for getting our Catholic kids to memorize and apply scripture. All in all Kieran has put together a great resource that I highly recommend for all middle school catechism classes.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I thought there would be more different topics for the drills, there are probably only 7 topics and each topic has 3 or more different ways of using the drills. I do like the Flash card concept. We have went away from memorizing and it is another good tool to learn with.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "levels of the game",
        "description": "This account of a tennis match played by Arthur Ashe against Clark Graebner at Forest Hills in 1968 begins with the ball rising into the air for the initial serve and ends with the final point. McPhee provides a brilliant, stroke-by-stroke description while examining the backgrounds and attitudes which have molded the players' games.",
        "authors": "['John McPhee']",
        "infoLink": "https://play.google.com/store/books/details?id=8PvaYZxLD-QC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Ostensibly this book is about a tennis match, Arthur Ashe versus Clark Graebner in the 1968 US Open Semifinals. The match was historic in itself:&quot;It has been thirteen years since an American won the men's-singles final at Forest Hills, and this match will determine whether Ashe or Graebner is to have a chance to be the first American since Tony Trabert to win it all. Ashe and Graebner are still amateurs, and it was imagined that in this tournament, playing against professionals, they wouldn't have much of a chance. But they are here, close to the finish, playing each other. For Graebner to look across a net and see Ashe--and the reverse--is not in itself unusual. They were both born in 1943, they have known each other since they were thirteen, and they have played tournaments and exhibitions and have practiced together in so many countries and seasons that details blur.&quot;But McPhee is actually after bigger game than this one match. He also provides insightful portraits of the two very different contestants. Ashe, the only championship level Black tennis player of his time, is single, liberal, mercurial, a finesse player and a risk taker. Graebner is married with kids, conservative, religious, a power player and risk averse. McPhee demonstrates how their personalities influence, indeed shape, their play and how their lifelong rivalry lifts their games to higher levels when they play one another, ultimately lifting Ashe's game towards perfection by the end of this contest.Ashe would go on to win the tournament, becoming the only amateur to win it in the Open era and together Ashe and Graebner lead the US to it's first Davis Cup in years. After that though, while Ashe went on to a respectable career, Graebner slipped into obscurity. But in this book, McPhee has preserved a moment in time when the two were evenly matched on the court, despite being polar opposites off of the court and in charting the lives that brought them to that moment, he provides a penetrating glance at two fascinating men.This is a real pinnacle in Sports writing.GRADE: A",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "To say John McPhee has written the best tennis book ever is to say too little. This is far more than a tennis book and, if you're looking for instruction, far less. The platform, if you'll excuse the tennis pun, is a U.S. Open final between Clark Graebner and Arthur Ashe, but it is a study of two men and what brought them to this point, athletically but especially sociologically. The reflective Southerner forced to be a pioneer because he is black. The more rigid son of the Midwest and privilege, with greater power and less versatility. The vagaries that make them human: Graebner, the more up-tight, gambling with a prepared point successfully at a crucial spot in the match. And at the end, there is Ashe, triumphantly whistling a winner off his suspect backhand to close out the match. You want to cheer. And you understand more about people than when you opened the book.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is so gracefully written that it isn't till the end that one realizes that McPhee's writing style(s) has been imitating the players' tennis styles, and that his language has moved effortlessly intune with the 'Levels of the Game'. Inlight of Arthur ashe's death, the book acheives a new poignancy.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This was my first John McPhee book, selected because of its subject matter (I'm an ex-serious tennis player). John McPhee was recommended to me as a writer/essayist who can take any subject and write about it intelligently and interestingly. After finishing this book, I would agree with that characterization, but clarify that the subject in this particular book is not professional tennis or even the game of tennis but rather two people and how they have managed their lives. That they play tennis is the point around which the book comes together, but it is not the point on which the book stands. If you're looking for insight into the game of junior/professional tennis, try David Foster Wallace's great essay about Michael Joyce in _A Supposedly Fun Thing..._. If you're looking for insight into two particularly interesting people--Arthur Ashe is one of them, but his compatriot and opponent, whose name, of course, I have forgotten, is worth equal time--in a particularly interesting time period and situation, check this book out.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Reading this book in 2011 was really interesting. 1968 was the year of the Big Bang for tennis with the onset of the Open era.The whole character of this match between Ashe and Graebner feels like a period piece. Imagine at the time, being 6 foot tall was pretty tall for tennis. Nowadays, if you are not at least 6 foot you are short for this game. Back then, serve-and-volley was the dominant style of playing. Nowadays, it has completely disappeared. When is the last time you saw a guy rush the net routinely on his second serve? Well, maybe Taylor Dent a couple of years ago. That's when playing against a modern returner like Robin Soderling, Dent hardly picked up a game per set in two consecutive devastating losses. In other words, the standard style of play in 1968 is now obsolete. That's probably because 3 out of 4 of the Grand Slam tournaments were played on grass. Now, only Wimbledon is. And, they changed the quality of the grass and the pressure of the balls to slow down the game. Also back then, they did not play tie breakers. Sets could go on forever (scores like 10-8, 12-10 were not uncommon). Additionally, out of the 128 men field I think only one of them had a two-handed backhand (Cliff Drysdale who had a most formidable backhand at the time).Despite the book historical interest, I felt like the book had a few weaknesses.First, why politicize the game in the most meaningless way. The concept of Graebner playing conservatively like a Republican and Ashe more deliberately like a Democrat was the most vapid framework.Second, McPhee picked up the wrong match. The 1968 US Open was among the greatest tennis tournaments of all time. The Ashe-Graebner match up was one of the dull ones compared to a cocktail of sensational match ups. The final between Ashe and Tom Okker was a far better match than Ashe-Graebner. Ashe ran into probably one of the most talented players of all time. Okker was a short, light footed, speedy, versatile, elegant Dutchman whose game most resembled Federer. Ashe barely won in 5 sets. If you wanted politics, you could get a lot more drama in the intense match between Cliff Drysdale from South Africa (in the days of the apartheid) vs Ashe. For a battle of the generations, the Pancho Gonzales - Tom Okker match must have been pretty great too. Okker won it in a tough 4 set battle. But, Gonzales must have been more than 15 years older. You never see such an age gap between pro tennis players nowadays.In summary, this book is historically interesting. However, it could have been far more interesting.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Written for the New Yorker magazine in 1969, this 150 page sports 'classic' has all the punch-and-jab terseness that makes John McPhee's writing both immediate and immediately recognizable. It's fun to read, no question. And it has a way of implying that more is at stake than the ostensible subject of investigation, although McPhee is often artfully cagey about declaring what that \"more\" might be.\"Levels of the Game\" is constructed around a point-by-point account of a single tennis match played in 1968 by Arthur Ashe and Clark Graebner, an African-American and a German-American who were the soul of the championship American Davis Cup team, playing both as singles and as doubles partners. Ashe and Graebner were as much friends as fiercely competitive rivals can ever be, despite their markedly different personalities and world-views. Graebner, the 'spoiled' scion of a conservative Christian dentist, plays stiff and predictable power tennis, \"Republican tennis\" as it were. Ashe, also a 'privileged child' despite his color and father's illiteracy, is \"bold, loose, liberal, flat-out Democratic.\" Several critics have made McPhee's point more explicitly than McPhee would ever do: \"You are the way you play.\"Like the volleys of an exciting match, the profiles of Ashe and Graebner - their childhoods, their fathers, their training in life and tennis, their quirks and virtues - are lobbed back and forth between the points of the game, from Ashe's first serve to Ashe's last winning stroke. McPhee is crafty; he depicts both men with implicit admiration and maintains as judicious an air of impartiality as an nominee for the Supreme Court under hostile questioning. But there's little doubt about whom he assumes HIS readers will root for, and his tone shows it. Ashe's victory - Ashe's whole career - was a triumph of Civil Rights in America over the forces of stand-pat hold-on-to-your own conservatism. Anyone who doesn't cheer when Ashe scores a point in this match has totally missed the point.When McPhee wrote this book, in 1969, it must have seemed that the societal match which it symbolized was almost over, almost won. Racism had 'charged the net' in the South of Wallace and Faubus, and the ball had been lobbed out of reach. Watching the ads on TV today, couple-watching on the streets of American cities, noting the approval ratings of the First Couple in the White House, one could indeed say that Ashe's victory was prophetic of America's racial Redemption. \"Game, set, match to Lieutenant Ashe,\" McPhee wrote; \"When the stroke is finished, he is standing on his toes, his arms flung open, wide, and high.\"However, if we take this historic match as an analogy for the cultural match-up between conservatism and liberalism, McPhee's success as an oracle is less clear. In 1969 perhaps, the egalitarian ideals of the New Deal and the Great Society might have seemed pervasive and permanent. The 'loose' liberalism expressed in Ashe's tennis was the preferred style of American youth, and the tight hind-end game played by Graebner didn't stand a chance.Ahh, that was before the Culture Wars, before the 'Southern Strategy', before Reaganism and Ollie North, before egalitarian idealism got lost in the Bushes. What McPhee didn't foresee was that Clark Graebner's 'Republican tennis' could claw and scratch, rage and pout, and make a comeback. After all, they play how they are.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "In Levels of the Game, John McPhee once again creates narrative structure out of his subject matter, in this case, a tennis match. The book is ostensibly about a single game of tennis played by Arthur Ashe, the first great black tennis player and one of the best tennis players of all time, and Clark Graebner, a white tennis player who was Ashe's rival for many years on the amateur circuit.McPhee develops the two men as the opposite of each other: liberal v conservative, black v white, calm v emotional. And the narrative takes this another step. Just as the tennis ball bounces back and forth in a match, so does McPhee bounce back and forth between his two subjects, Ashe and Graebner, race and tennis. McPhee wants to draw a parallel between a person's background and their tennis-playing style, and for the most part, he succeeds.As any reader of nonfiction knows, John McPhee writes perfect sentences, does unparalleled research, and crafts his books like a master carpenter. Levels of the Game has all these typical McPhee traits, is easy to read, and full of insight. On the other hand, by todays standards, the book is awkward. The shifts back and forth from Ashe to Grabner, from past to present, become jarring over time, and some of McPhee's sentences are unusually stiff and formal, almost academic.Levels of the Game is a book about sports the way that Friday Night LightsFriday Night Lightsis a book about sports. It uses the game as a window into something else, an attempt to describe two very different men, and all that they represent in America in 1968.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "\"Levels of the Game\" is, on the surface, an account of a single match between Arthur Ashe and Clark Graebner in the semifinals at the U.S. Open in Forest Hills. But as the title suggests, a game --- any game, at any degree of competition --- is not just about competence. How you play is a revelation of character; how you play is who you are.It's on all the other levels that this is a great book --- one of the greatest you may ever read, period. First, because of the subject. Arthur Ashe was not the Jackie Robinson of tennis; when he emerged in the 1960s, he was the only African-American player of note in America. Clark Graebner was a dentist's son and a ringer for Clark Kent. As it happened, Ashe and Graebner were both best-of-breed. It's not inaccurate to say that they were friends. But you can't miss the notion that they are also archetypes: privileged white kid from Ohio vs. against-all-odds black kid from Virginia.In a mere 146 pages, John McPhee --- you know his byline from a zillion profiles in The New Yorker, many of them mesmerizing, some beyond dull, but all meticulously reported and more carved than written --- has pulled off a literary coup. He has written an account of the match that's thrilling sports reporting. After, he clearly interviewed Ashe and Graebner at length, for he recreates what they were thinking and feeling at every key point in the match. And then he goes still deeper, talking to parents and wives, coaches and mentors, so he can deliver acute biographies of each player and a revelatory portrait of a sport --- and a nation --- in transition.A mediocre writer would construct this book with long passages in italics. Or chapters that pull us out of the match and take us back to Virginia or Ohio. Well, you don't write a book called \"Levels of the Game\" without being aware of the levels of your craft --- and knowing that, when you settle yourself at the keyboard, you can play at a championship level.Which is not to say that the book reads like \"great writing\". Just the opposite. It reads like great storytelling. There are no flights of language. It's just great reporting. And then, for a paragraph or a page, the telling of a story that takes place far from Forest Hills that helps to explain why Ashe or Graebner are playing a certain way or having certain thoughts about their match.The biographical, historical and psychological passages are surprising. And thrilling --- you will be amazed at what Ashe had to overcome, and who helped, and how it worked out. And the same for Graebner, though, of course, the challenges are considerably smaller. But what's most exhilarating is when the strands merge, and you're both in the match and inside the players' heads. Like this:Now the thought crosses Graebner's mind that Ashe has not missed a service return in this game. The thought unnerves him a little. He hits a big one four feet too deep, then bloops his second serve with terrible placement right into the center of the service court. He now becomes the mouse, Ashe the cat. With soft, perfectly placed shots, Ashe jerks him around the forecourt, then closes off the point with a shot to remember. It is a forehand, with top spin, sent cross court so lightly that the ball appears to be flung rather than hit. Its angle to the net is less than ten degrees --- a difficult brilliant stroke, and Ashe hit it with such nonchalance that he appeared to be thinking of something else. Graebner feels the implications of this. Ashe is now obviously loose. Loose equals dangerous. When a player is loose, he serves and volleys at his best level. His general shotmaking ability is optimum. He will try anything. 'Look at the way he hit that ball, gave it the casual play,' Graebner says to himself. 'Instead of trying a silly shot and missing it, he tries the silly shot and makes it.'Notice what's missing: the construction \"he thought\". McPhee has no need to step back from the moment and use that writerly qualification. He knows what Graebner thinks --- he's writing from authority. And so every word can drive the narrative forward. The writing has the power and velocity of the game it describes.Everyone who likes tennis even a little will savor and learn from this book. But even more, anyone who likes good writing --- or aspires to write well --- should clutch \"Levels of the Game\" like a lifeline. The way you learn to write, after all, is to read great writing and imitate it until you break through to a style of your own. If that's your game, start here.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "coaching youth hockey 2nd edition coaching youth sports",
        "description": "Packed with drills and tips for practice and game days The fun and easy way(r) to kick-start your soccer coaching skills Volunteering as a youth soccer coach can be a great experience, both for you and your squad. But what if you've never coached before? Don't worry! This friendly guide explains soccer rules, shows you how to approach coaching, and gives you practical pointers on improving your team's soccer skills and encouraging good sportsmanship. Discover how to Understand soccer rules Develop a coaching philosophy Teach soccer fundamentals Run great practices Lead your team during a game Communicate effectively with parents",
        "authors": "['National Alliance for Youth Sports']",
        "infoLink": "https://play.google.com/store/books/details?id=zBMGm3dNPz0C&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book offers a comprehensive set of introductory materials needed for the first time or experienced hockey coach. It is useful for either ice or roller hockey. I particularly appreciated the author's including the social, communication, and motivational aspects of coaching youth sports. Full of handy checklists and drills to emphasize the needed skills, this book provides a solid foundation for developing &quot;your own&quot; hockey teaching and coaching program. The drills and progressions are excellent. The book would be better with more technical emphasis on skating skills and techniques. But overall, I would recommend it for any coach or parent who is close to this fast-growing sport!",
                "review/helpfulness": "74/75",
                "num_reviews": 75
            },
            {
                "review/text": "I needed to understand how to teach children under 10 the game of Hockey and start towards gaining a coaching award in this age group. This book gives me a greater understanding of what turns on a childs interest and haw to maintain this interest.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "secondary stages revitalizing high school theatre",
        "description": "Secondary Stages combines in one volume everything a high school teacher needs to organize and implement a sucessful, dynamic theatre program. Bennett's approach is based on a simple premise: that exposure to theatre can be an utterly transforming experience for students - one that enables them to reach unimagined levels of personal, emotional, and intellectual growth. His book delivers hands-on techniques to make it all happen, illustrating how to: draw interested students into the program inspire students to act with truth and conviction establish the connection between good improvisation and good scene work carry passion for theatre outside the classroom and into the mainstream of school life choose material that's stimulating enough to attract a sizable student audience without creating unwanted controversy structure activities and lessons so that they encourage maximum sensitivity and awareness lay the basis for mounting memorable productions. With these goals in mind and with more than three decades of experience, Bennett presents strategies that have consistently proven effective for the broadest possible range of students.",
        "authors": "['Jeff Bennett']",
        "infoLink": "http://books.google.com/books?id=rRfuAAAAMAAJ&dq=Secondary+Stages:+Revitalizing+High+School+Theatre&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have had the pleasure of being a former student of Jeff Bennett's classes in high school. Mr Bennett has shared a wealth of knowledge about the theater industry with me, but I believe he has taught me much more than just the theater.Jeff Bennett is a sage of wisdom, and through our countless conversations he has guided me on the right paths, in life as well as my career goals. By being my mentor through the troubling years of high school woe, Mr. Bennett has been the most influential teacher I have ever had.People who are involved in theater, or teaching theater at the secondary school level need to read this book.Yet, life-long learners would benefit from reading Jeff's perceptiveness.Jeff Bennett has the uncanny ability to connect with students of any age. Through this book, others can now share the privilege I have had for years.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "How many teachers can you remember who have had a signficant influence on your life. You can probably count them on the fingers of one hand, which in itself says something about the math teachers we've all had. The one vital thing that most teachers never discover is that the greatest thing we can &quot;teach&quot;is the excitement of learning, the thrill of discovery.A great acting teacher is not one who can most effectively direct actors where on teh stage to stand and with what expression to recite their lines. A great teacher helps, directs, creates the environment wherein the students can make discoveries. And any discovery is part of self-discovery.Jeff Bennet's book, SECONDARY STAGES is a roadmap to the process through which disovery becomes possible. It makes the journey dangerously safe, instructively fun. It methodically conducts us through the maze of adolescent psychology to the lovely place where spontaneity is possible.It is able to be inspirational and simultaneously grounded in practical reality. It is pedagogical (in the best sense) and simultaneously personal. The book is logically organized. Its structure is a function not only of ideas but of the experiential progression of the teacher-student relationship.It sets inspirational and practical goals, it offers pathways to get there, it identifies problem areas and offers incisive and practical ways of understanding them and solving them.It is a great guidebook for any student or teacher of the craft of acting...and of teaching.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "coaching volleyball building a winning team",
        "description": "One of the most complete books on coaching volleyball ever printed - includes advice, tips, and cues that take the experienced coach years to accumulate. This comprehensive book covers every aspect of coaching volleyball - from the beginning basic skills to information on aiding the talented college-bound athlete. It guides the coach through the decision-making processes of tryouts, practice schedules, setting up the team's offense and defense, coaching a game, and dealing with parents and administrators. Here are the keys to creating a winning volleyball class or entire volleyball program from the elementary to collegiate level, based on the solid knowledge that comes with years of experience. Volleyball coaches and physical education teachers.",
        "authors": "['Carl McGown', 'Hilda Ann Fronske', 'Launa Moser']",
        "infoLink": "http://books.google.nl/books?id=dk0HQwAACAAJ&dq=Coaching+Volleyball:+Building+a+Winning+Team&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you buy ONE book on how to coach volleyball, make it this one. Carl McGown is the &quot;guru&quot; of volleyball and if you read this book, implement what it says, your team will be better RIGHT NOW!A book which goes beyond the x and o's to provide the coach with the correct skills and attitudes necessary to compete at a high level.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "As the subtitle \"Building a Winning Team\" implies, the book touches on the various aspects required to building a team. The authors do an admirable job of providing a wealth of information across a broad spectrum of topics. If you're interested in a general guide with the basics this is the book for you.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "McGowan is a master teacher. When you implement his ideas and theories you can't help but become an awesome coach and your athletes will improve their physical and mental skills at an incredible rate.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I played high school volleyball for one of these authors, so I grew up playing all of the drills and games in this book. I am now a college coach myself & I STILL use this book as a reference guide when I go to plan out a practice. Your athletes will love the different games included in the book that put a different spin on the regular game of volleyball.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "highperformance soccer techniques tactics for advanced play",
        "description": "Trapattoni has coached 6 teams: AC Milan, Juventus, Inter Milan, Cagliari, Bayern Munich & Fiorentina. In this book, he shares his philosophy of coaching soccer & offers invaluable tactical insight, drawing on years of success at the highest level of the game. He also provides an example of a complete pre-season conditioning and annual work plan for a high performance team. Learn from one of the world`s best coaches!",
        "authors": "['Giovanni Trapattoni']",
        "infoLink": "http://books.google.com/books?id=Bye2IP2_ZogC&dq=High-Performance+Soccer:+Techniques&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is fantastic book for the young soccer player. The book is written to the level of a high school player and details the passion and discipline it takes to make it to the next level. The tips and drills to perform with friends and on your own,are with out a doubt, excellent and should be done on a daily basis. I highly recommend this to all youth soccer players and coaches.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a great book for young players who want to take their game to highest level in high school and prepare for soccer at the college or even professional level. It teaches some advanced moves, but its real strength is helping young players understand the discipline and love for the game it takes to play at the highest levels.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "High Performance Soccer gave me great insight into the world of upper level soccer. All players that aspire to bigger and better things can learn a great deal from Paul Caligiuri. The information in these pages can apply to all age groups of competitive soccer. I can't wait to get on the field and teach these new found skills. I read it from cover to cover and then went back and hilighted all of the items that I believe to be useful. The inside of the book is now flouresant yellow!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "coaching youth football betterway coaching kids series",
        "description": "Handbooks in \"The Parent's Guide\" series serve as the perfect step-by-step introductory primers for parents and coaches. Written in an easy, conversational style, these books cover all the basic skill-building techniques, rules of the games, proper equipment, and first aid. in addition to the physical skills of the game, these guides focus on team spirit, the importance of fair play and overall fun. Special attention is paid to developing a child's confidence and self-esteem, as well. All books are heavily illustrated to help both the coach and child visualize the plays, drills and proper techniques. Filled with creative tips for working with children and personal anecdotes and suggestions, these books offer sound advice for all coaches.",
        "authors": "['John Mccarthy']",
        "infoLink": "http://books.google.com/books?id=b2JPrc-aimEC&dq=Coaching+Youth+Football+(Betterway+Coaching+Kids+Series)&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought this book as part of a series of books that I was going through for youth coaching. I have been coaching for a couple of years now and was looking for maybe something that I could add to my team's game. This book was both disappointing and scary at the same time. I'll explain.Early on in the book the author suggests that yelling at the kids to get them fired up, even if you don't mean what you're saying (i.e. \"Kill'em!\") was a good thing, part of the game and suggested in so many words that it would separate the grittier players from the weaker ones. I'm not sure what kind of game he played when he was growing up, but I have never had a coach like that, nor do I coach my kids that way, and I've never had a problem with getting my kids fired up. Furthermore, it's insane for any coach to assume for one second that the game should be one of win-at-all-costs. Although he didn't say it directly, it appeared like it was more about the coach then it was about the players. Sure, he goes over the \"teamwork\" concept, but it was vague at best.On more than one occasion there was the feeling that you should coach your better players and yell at the weaker ones. What ever happened to, you know, coaching? For starters it should never be about you the coach... ever! It should always be about the players and the TEAM. There were a few entries about how you put your slower players on the offensive line and at the full back position (which I completely disagree with) and that your smartest player should go at QB. According to the author, the QB should be able to identify the defense being played, the blitzes, and the weak slots by the time he reaches the line of scrimmage from the huddle. Of course there are no suggestions on how exactly you are supposed to coach this professional level concept to a child.The book is filled with nice suggestions, but with no hint as to how to execute them. The techniques are maybe 50% accurate at best, and offer little in the way of correcting on-going errors. It just says to look for them. Right, because my 6th graders are all NFL caliber athletes that understand the intricacies of the game. The plays in the book are poorly illustrated, have no real explanations and will never work on a football field, ever, which is why I assume the author never posts anything about his success as a coach; probably because he hasn't had any.There are far better books than this one out there. Try \"Coaching Youth Football (Baffled Parent's Guides) by Paul Pasqualoni\". It is a far better quality book and absolutely designed for the first time coach in mind. In fact, even if you have only been coaching for a couple of years, like me, there is still tons of information in there that is far superior.This book is as irresponsible as it is dangerous, not to mention a complete waste of money. Don't waste your time on this book when there are far better ones available.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is an excellent book for the first time coach. I was asked to coach a team after another coach bowed out after the first week of practice due to family crisis. I had not been involved in football for 20 years and was lost. This book saved me. Lots of good information, particularly on how to run a practice, useful drills and fundamentals. Does not include a lot of offensive or defensive strategy (See the &quot;Coaching Youth Football&quot; series by John T. Reed) but tremendously useful in helping a beginning coach get up and running.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "ready to use physical education activities for grades 56 complete physical education activities program bk 3",
        "description": "\"Over 500 ready-to-use fitness-oriented activities and games [per book] to help you prepare and teach interesting, fun-packed physical education lessons tailored to your students's specific developmental needs.\" --Cover.",
        "authors": "['Maxwell J. Landy']",
        "infoLink": "http://books.google.com/books?id=7f59uwEACAAJ&dq=Ready+to+Use+Physical+Education+Activities+for+Grades+5-6:+Complete+Physical+Education+Activities+Program+(bk.+3)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is full of age-appropriate activities for P.E. teachers to use. I have used it in my student teaching at the University of Arizona and plan to use it while teaching. It contains all the areas of a good lesson: intro activity, fitness, game skills, and closing. Give it a try, you won't regret it.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "A very good resource for educators that require suggestions on activities for PE. I suggest all my students in my elementary teaching physical education to purchase this resource.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "quotable wooden potent quotables",
        "description": "John Wooden was arguably the greatest college basketball coach of all time, a teacher as well as mentor whose handiwork produced a dynasty bridging the '60s and '70s. Quotable Wooden is a compilation of more than two-hundred inspiring quotes by and about Wooden. Other notables quoted include Kareem Abdul-Jabbar, Bill Walton, Denny Crum, and Rick Reilly.",
        "authors": "['John Reger']",
        "infoLink": "http://books.google.com/books?id=rI56mAEACAAJ&dq=Quotable+Wooden+(Potent+Quotables)&hl=&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "John Reger has done a masterful job in collecting a wonderful variety of John Wooden quotes and organizing them in a way that gives the reader doses of Wooden's wisdom on a variety of subjects. The book is a quick, easy read and the only negative thing about it is that it comes to an end so soon. After reading Reger's book, it makes it easy to understand part of what made Wooden such a great coach. He was also a teacher, a motivator and a man who believed and stood behind his principals. He taught about life as much as about basketball.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I highly recommend this great, little book to anyone. Whether you are already familiar with the extraordinary life and career of Coach Wooden, or you are looking for a quick biography-like synopsis of Coach Wooden's incredible story, or even if you have never heard about Coach Wooden, this book can inform, inspire, and entertain you.This book contains over 200 quotes by and about John Wooden, the greatest college basketball coach of all time (10 national championships in 12 years, including 7 in-a-row and an 88-game winning streak), and, more importantly, one of the greatest teachers of morals, character, and life values. As a long-time fan of Coach Wooden, I was impressed with how the selected quotes accurately captured the essence of Wooden the Coach, and Wooden the Man. The chapter titles provided a great working outline of Wooden's life and the teaching environments from which he has taught, and continues to teach, so many life lessons to so many people over the last 60+ years: Indiana Years, Early Westwood Days, Practices, Games, Dynasty, Teacher, Pupils, Philosophy, Retirement, Tributes, The Game Today, and Family.Although best known for his accomplishments on the basketball court, by far Wooden's greatest contributions have been made off the court. Reger's skillful selection of personal snapshots and anecdotes from and for Coach Wooden truly show how positively influential one person can be in the lives of others. Reger accurately assessed Coach Wooden's character and influence and paid the ultimate compliment to Wooden the Man when he wrote, \"This world would be a better place if there were more human beings like John Wooden.\"",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "learning to learn revised edition strengthening study skills brain power",
        "description": "Help students of all ages maximize learning and strengthen study skills. This interactive workbook is a powerful resource for students, teachers, and parents. Use the step-by-step procedures for improving organizational skills, time management, problem solving, power reading, test taking, memory skills, and more! Anyone who wants to \"learn how to learn\" will benefit from the wealth of activities in this engaging resource.",
        "authors": "['Gloria Frender', 'Marta Drayton', 'Janet March']",
        "infoLink": "http://books.google.com/books?id=MFXbngEACAAJ&dq=Learning+to+Learn,+Revised+Edition:+Strengthening+Study+Skills&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "If I could rate this book more than five stars, I would. I've been a study skills consultant for many years, and a high school teacher even longer. This book I recommend to both parents and teachers. It comes with duplicating rights for an individual teacher's classroom (but the amount of paper you'd use if you duplicated it all would be prohibitive for most schools). In my classroom, I've picked and chosen the units I felt would be most helpful for each class. The work is clearly explained with good examples and self-tests. The illustrations are whimsical enough that they are not offensive to high school students. What's even nicer is that the students see the value in these lessons--they don't have to be sold.",
                "review/helpfulness": "63/65",
                "num_reviews": 65
            },
            {
                "review/text": "I give a course on study skills and have read all the available literature. This one tops them. Worksheets are clear and easily understood by students of all ages. The advice contained includes the gamut of techniques. Only reservation is that it's longer than neccessary.",
                "review/helpfulness": "57/61",
                "num_reviews": 61
            },
            {
                "review/text": "I teach study skills to 7th and 8th graders--this is the text I prefer. It is clear and well-written, even if a little wordy. I teach it in units, having the students learn one skill, then building on it. Good Stuff!!",
                "review/helpfulness": "53/56",
                "num_reviews": 56
            },
            {
                "review/text": "This is a terrific book! The strategies in it are useful and easy to follow. In being able to understand how each student learns, you can better teach that child. Also, when the students themselves understand how they learn, they can adapt their studying to fit their personal style.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I buy and read alot of books, but have never taken the time to do a review, but after going all the way through this book, I knew I needed to share with others the help this resource can be. I am home schooling two 16 year olds this year. They have just come out of the public schools, and I'm finding they have limited study skills. After going through Learning to Learn, I have a list of 40 pages I'll present in the \"Learning Styles and Learning Strategies\" class we're doing this summer to prepare for our full schedule. The book is solid information, based on reseach and experience, and covers everything I had planned to present to the girls in this class. Having also worked with middle school students, I'm sure this book would be helpful for 5th graders and then on through high school. The forms and lists are well done and very usable and have saved me immeasurable time in creating comprehensive lists and forms. She even includes a one page summary of Howard Gardner's 8 Multiple Intelligences. Buying this book was the best money spent in a long time.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I am an ADHD coach, and I work with students of all ages. The common deficiency that links all of my clients is a lack of basic knowledge of the tools needed to learn. Of all the study skills books that I have used, this is by far the best. The simple elegance of the explanations, and the user friendly templates make this an invaluable resource for all ages. Whoever wrote this has taken the best of all fields: memory research, education research, and psychology, and blended it into the perfect one stop source of Learning How to Learn. Thank YOU!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book was easy to read. It provided clear, reasonable guidelines and suggestions for students to organize. read, take notes and generally improve study skills. Specific strategies and examples are presented. It is a practical blueprint that will be useful for struggling students and those who simply want to be more effective.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book arrived in three days. I was really impressed.I have had this book before, but I'm afraid another teacher liked it even more than I did. This has graphic organizers that really work for the everyone, not just the learning challenged. My high-schoolers, as well as my elementary crowd have found this book helpful.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book. I purchased it because I was going to teach an English class this summer. I included a unit on how we learn and then the students had a presentation by the schools learning specialist. She was proud that many of the students were ahead of the game and could identify what kind of learners they thought they are. Kudos to the team that prepared this book!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I use this for teaching a class on study skills. It is probably best for kids 7-9, but could be adapted for younger or older kids.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "arie selengers power volleyball",
        "description": "Describes the basic rules and skills of volleyball, explains team strategies, and discusses training and preparation",
        "authors": "['Arie Selenger']",
        "infoLink": "http://books.google.nl/books?id=zSN2QgAACAAJ&dq=Arie+Selenger%27s+Power+Volleyball&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I just returned from an Arie Selinger camp and it was terrific. The man is passionate about the sport and is obviously extremely knowledgable. He has spent the last 40 years thinking about the training and the teaching of the game. Whether it has to do with technique, strategy, training, mental game, or state of the game, he has an opinion which is more than backed up with experience and data. Lots of data.The book is a little problematic in that the explanations of the concepts are a little too involved for the beginning coach. But the man is obviously the foremost thinker on the game that the American game has seen in a long time. You may disagree with his conclusions, but his attention to detail and his arguements for his ideas are very strong. He is a great believer in statistics and measuring progress, so a lot of it has to do with measuring athlete accomplishments.If you are looking to get a book to help your kids with their intramural team, forget about this book. If you are out to learn to coach volleyball at a very high level, this could be the one book you need. Keep in mind that he has always dealt with the highest level of athletes and have had the luxury of training six hours a day seven days a week, so some of the offense are way too complicated, even for college teams. But they are good ideas which stimulated even more ideas.I wish he had put in more of his unique training ideas based on the Asian training methodology, but that is quibbling.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Arie Selinger is a legend among coaches, and this book won't let fans of the former coach of the U.S. Women's Olympic Team down. Whether you want to learn more about Arie's philosophy or to pick up some tips for your own game, this book is worth a read.As a high school coach, I've implemented many of Arie's ideas into the program I took over 3 years ago, a program that had struggled for decades. And this season, I'm proud to say, we posted only the 3rd winning record in school history. A complete turnaround in 3 years!Our girls now FEEL like winners, and players that's the first step toward becoming winners. Arie Selenger's Power Volleyball helped bring that change about, and that's high praise, indeed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I consider this book to be one of the best ever written.The detail is fantastic.I refer to sections every week.I was just reviewing the section on spiking.A few weeks ago I reviewed the team play on the down call.Every time I read it I learn more.I just want Arie to write a new book with his experience in JapanVic LindalCanadian National coach 69 to 72currently coaching club (16 and 17 girls)On Vancouver Island BC",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the game win your life in 90 days",
        "description": "The motivational speaker offers a game with prizes, rules, time limits, and coaches to help readers set goals, measure results, and achieve personal and professional objectives.",
        "authors": "['Sarano Kelley']",
        "infoLink": "http://books.google.com/books?id=jqxvOwAACAAJ&dq=THE+GAME+Win+Your+Life+in+90+Days&hl=&source=gbs_api",
        "categories": "['Body, Mind & Spirit']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I sat through a Sarano Kelley seminar a few years ago while I was employed with a financial services firm. He is a dynamic speaker to say the least. He is also incredibly manipulative. He has a way of convincing everyone in the room they are \"asleep\" and need his \"Game\" very urgently. His game, or the away from home motivational boot camp he puts together in San Diego, costs over $20,000.00! You get up early in the morning, go through high physical exhaustion, highly emotional conversations, and then you get to the training sessions. When you are exhausted and emotional you are at your most vulnerable to suggestion. This is classic nuerolinguistic programming, or NLP. NLP techniques are how cults brainwash people. Look it up!Sarano also loved to talk about the movie The Matrix and how it was like real life. I guess he likens himself to the character of Morpheus. He has the way, the answers, the road to being awake in life while others sleep. Classic hucksterism.I went away from his seminar convinced I was a piece of crap and needed fixing. I even considered the whole \"Game\" program. I also knew I was manipulated. I soon started to get phone calls from their sales department trying to pressure me into the program. \"Just put it on your credit card\" they would tell me. When I asked them to stop the calls the sales person said, \"Well, it's obvious you're not coachable.\" The high pressure stuff felt evil and insincere!I will never forget Sarano. I will also never look at the whole business of motivational speakers the same again. I'm sure some are great and sincere. Some are nothing more than mind games that feed off of the frailty of the human condition.Don't buy his book. Don't drink the Coolaid.",
                "review/helpfulness": "27/36",
                "num_reviews": 36
            },
            {
                "review/text": "I played the game as a participant in the coaching program. It forever changed the way that I look at life. During the game I cleaned and reorganized closets, drawers and rooms. I built a zen garden in my backyard, painted a garden on my bedroom walls, reduced my body fat by 15% and increased my reading speed from 300 words per minute to 2600 words per minute. I recorded over 21,000 concious acts of will during the 90 days that I played the game.The value of choosing a partner for this game is immeasurable. It's good to have another person to be accountable to. This structure was very effective for me on those days that I was tempted to let a work-out slide or if I just didn't feel like completing on a committment.The book stresses the importance of structure, community and affinity in achieving goals. It guides the reader through exercises that help to put these in place. There are many real-life examples in the book from past &quot;game&quot; players. This clearly demonstrates that anyone can achieve their goals by putting the principles of The Game to work.The tone of the book is conversational, making it very easy to read. This is not just another self-help or motivational book. If you truly have the desire to realign your priorites and live your life with passion and purpose, you will enjoy this book.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Kelley's book covers a lot. I hope to do it justice while giving you a sense of what you'll find in it. First of all, there really is a &quot;Game&quot; that the author challenges and instructs you to play for 90 days (The game is very much like goal setting exercises transformed into a game you play with a partner). Kelley provides the rules, the scoring system, the strategies, and even a grand prize reward of $50,000 for whichever partner-team he deems to have changed their lives the most in 90 days.So what is the game? Well as the title implies, you are playing to improve your life dramatically. You choose the three or four areas you want to improve the most -- you are choosing from: Balance, Body and Health, Money, Relationships, Spiritual Life, Mind, Tools, Environment, Education, Family, Work, Charities, Hobbies, Interests, and Art. There is a chapter on each of these areas, full of excellent advice and true stories of previous game players, so that you have loads of strategies and inspiration to make your improvement. Let's say you read the book but opted to never register at the official website to play the game -- these chapters would still be worth the price. I liked the combination of smarts, specifics and spirituality woven into each one. But the originality of the book lies precisely in actually playing the game from start to finish -- from reading the book to turning in your final essay that extols your breakthroughs -- because the game provides an added motivation and support system that other books lack.My final comment would be this -- the books easily worth the price. The question is, once you read it, will you have the determination to play for 90 days? Realistically most won't -- it is a big challenge. But the ones who do will undoubtedly make major improvements. How could you not? Conscious, concentrated, focus on improvement for 90 days will change anyone's life. I humbly submit that if you are interested in succeeding, you will also like my book, Major in Success, especially for career or college success, it would be a great complement to Sarano's excellent book.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Being a psychiatrist I am exposed to man theories, publications, and other forms of communication regarding improving ones's life. As you can imagine I have become rather skeptical about this genre of &quot;self help&quot; titles. I began reading The Game by Mr. Kelley with a fairly high degree of doubt whether it would have any meaning or standout from other works of its ilk in any way. I must say I was pleasantly suprised and found Part I of to be an excellent outline for the one thing we all strive for... some degree of CONTROL in our lives. Mr. Kelley gives a clear and consise plan to begin this process, followed by more detail in Part II &amp; III, on how to accomplish this life long task. Having been an athlete The Game strikes a cord prompting me to re-examine several aspects of my life and make some changes. This was no mean feat for a cynical physician. I am even going to offer The Game to the employees in my practice as a Holiday gift. One will not find the Holy Grail in any book of this nature, or anywhere else for that matter, but with The Game at least you can begin the search.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Mr. Kelley provides a great conversation about all those 'messes, what-tos and to-dos' rattle around in mind. Why do we carry these for years and never perform? You know the lists: I have always wanted to get in shape, I'd really like a better relationship with my daughter, I should learn those cell phone features... and the like. Where do these come from and why are they always so frustratingly just out of reach?More important than recognizing these frustrations, Mr. Kelley provides an elegant solution. In the form of a Game, a very special game, he challenges and empowers us to climb life's mountains whether actual or symbolic. This book is not about theory. It is a wake-up call and a will get you too to perform. In the end, like with all good games, there is a PRIZE.The book is well written and easily read. It is full of personal stories from both Mr. Kelley and from his clients built up over years of coaching successful people to even higher performance. And, along the way you will learn some timeless lessons about what it is to be human. A future Classic.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have been playing the game for over 90 days and the changes are amazing. I am more focused, relaxed and my business and perosnal relationships are being transfomred. Reading this book will dramatically change your life.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I recently had the ability to listen to Sarano speak, and I have read his book. Outstanding to say the least. He helps YOU realize what YOUR potential is and he helps YOU open your eyes to what is holding you back from being the best you can be. In all honestly, he made me face the things that I hated to face, and didn't want too, more importantly the truth. After you realize what is holding you back, he gets you on track to make the changes you need to make, not in the future, but in the NOW. I would recommend this book to anyone wanting to better themselves no matter if it professionally, personally, or spiritually.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Saraon is right we are all aslep. we get up, do our thing and hardly notice where we are and what we are doing. Very few of us reach our potential. Very few of us build on relationships and let friends help us. We all think we have to do it ourselves and end up frustrated because we know we have not reached our full potential. Sarano's insights into the humnan psyche are right on. He has found a way for us to wake up and reach for new levels of success. There is not a person on this earth that will not learn and grow if they apply just some of the ideas put forth by Sarano. Ted Fuller",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The Game is deceptively simple in construct. In chapter after chapter,busy people tell how applying simple disciplines worked in their lives when they competed in the &quot;game&quot;. The people are real. The changes in their lives are real, and some of them are dramatic. But the practical, simple, transforming work of the book is for each of us to decisively intervene on our own behalf in the sleepiness of daily life so that it becomes for us the miracle it really is. Yes, after a hundred pages or so the format of the story told is repetitive and even a little dull. The real news is however, that the book will do nothing in anyone's life who does not go to the website or call for help in setting up to play the game. Reading about the game will not do it! Only players savor the sweat and reap the benefits. If a prospective reader really wants to do something to enliven areas of her/his life then reading The Game combined with playing it with structure, affinity and community will alter the reader's level of awareness and increase the delight possible only in being present in the moment.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The title, The Game: Win Your Life in 90 Days couldn't be more accurate. I read this book in one evening. I found myself so excited to get into action and accomplish the things I had always wanted for myself. I began to play the game with a co-worker of mine and started to see results immediately. It was when I decided to take The Game Class through The Coaching Program that people around me started noticing the changes in me. They made comments like, 'you seem so much happier' and 'you have been so pleasant to be around'. I realized that by playing the game and getting out of life what I had always dreamed, I had a new vitality and it was clear to everyone around me. No amount of money could have bought this new lease on life.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "beat not the poor desk",
        "description": "This book offers a revolutionary inductive approach to teaching composition, in particular the essay.",
        "authors": "['Marie Ponsot', 'Rosemary Deen']",
        "infoLink": "http://books.google.com/books?id=L9hZAAAAMAAJ&dq=Beat+Not+the+Poor+Desk&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Writing is a process. An exciting way to communicate thoughts and emotions. Just as we learn a spoken language through practice without judgement, so must we learn the written language. Beat Not The Poor Desk is a teaching tool based on that philosophy. It is a compilation of lessons and projects presented in sequence as a guide for teachers of English. Written with input from English teachers,it gives instructors a sequenced set of writing lessons that make it easy for students to get past the anxiety they may have about producing 'perfect prose'. It includes student models of lessons presented in the book that are interesting to read and study. In a step by step approach, writers are encouraged to stretch their skills and do the 'playing' necessary to get good at expressing themselves with the written word. The authors start with a series of lessons about fables, then moves on to lists, essays and stories. On a parallel track in the book, Ponst and Deen address the grammar, syntax and semantics of writing. Although the book was written for use as a guide for teachers of college writing courses, I found it of great help in teaching multi-age groups of children (ages 8 through 13), and for summer tutoring of high school remedial English students. Beat Not The Poor Desk is a well-written text for teachers of written English. I found it to be one of the best I have ever used, and one of the most versatile in its success with diverse student populations.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book, along with Inside Out by Dan Kirby and Tom Liner, changed my teaching life. Using the ideas of these two authors, I have successfully taught high school, community college, and university students how to think and write for personal as well as academic audiences.This book should be required for ALL teachers of writing.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I first bought and began using this book in the early eighties, and just today took it off the bookshelf to browse through it again. Two other books and this one have had the most influence on my teaching since I began grad school in 1975. I urge all new and even veteran teachers of writing to read this wonderful book. If anyone's interested, the other two most influental books that I credit for the pleasure I take and success I've had teaching comp are William E. Coles, Jr. &quot;The Plural I and After&quot; and Roger Garrison, &quot;How a Writer Works.&quot; If you can get a hold of Garrison, try to get the teacher's guide that goes with it. Wonderful.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The best guide to teaching writing -- hands down! Next to \"The Common Sense\" (the student version of this book), this is the most valuable book I have ever owned. It is the guide and bedrock of my teaching life. A must have!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "more theatre games for young performers improvisations and exercises for developing acting skills",
        "description": "By popular demand, we offer a follow-up book of theatre games specifically for young acting students. Written especially for those who coach adolescent actors, this delightfully fresh updated workbook tells you how, when, what and why of theatre games for young performers. Starter scenes allow first-time performers to ease onto the stage in baby steps. Spontaneity is encouraged along with etiquette and basic acting principles. The concept of pantomime, improvisation, character development, voice and body control are all presented in game format with exercises. Anyone working with young actors in schools or recreational centres will find the book exceptionally helpful.",
        "authors": "['Suzi Zimmerman']",
        "infoLink": "http://books.google.com/books?id=A0UIAQAAMAAJ&dq=More+Theatre+Games+for+Young+Performers:+Improvisations+and+Exercises+for+Developing+Acting+Skills&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Zimmerman did it again! Her previous work, Intro to Theatre Arts was a clear, readable and comprehensive textbook for middle and high school theatre. Her present work is not only a collection of games and exercises for the classroom, but a creative, logical, and step by step approach to incorporating improv into any middle school or high school curriculum. She includes forms for the students to evaluate their own work. Many of the games are old hat to experienced teachers but there are a number of unique exercises and even non-acting theatre games that even the seasoned professional educator may find of interest. Zimmerman starts off each chapter with an inspirational story about a theatre educator.I must admit that this review may be biased since she uses one of my games in her book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Had this book been written in the mid 80's it may have been vaguely cutting edge. As a first edition published in 2004, it is sadly behind the times. It gives me the small town \"Waiting for Guffman\" feel, and NOT in a good way.The commentary in this book is not helpful and should be eliminated almost in its entirety. I also did not find any of the games listed as new material. These games were either old games that had been re-named or fragmented versions of other games. One google search on the internet would have brought me closer to a new game than the entirety of this book.Many of the scene examples in the book break the iron clad laws of Improv: 1) Yes, and 2) Don't ask questions and 3) No real time I.S.C. (Improv Stage Combat). As a teaching tool, especially for young children (is the target market for this book middle school children?) this book missed the mark. If a teacher wants to teach children to be polished and clever Improvisers, (s)he needs to make sure the children have a strong basic understanding of the Improv rules, especially for short form games.The author of this book needs to read the Pearls of Wisdom from \"Truth in Comedy\" by Charna Halpern, Del Close, Kim Johnson, the bulleted pearls are helpful for beginners. She should then read anything by Viola Spolin, \"Theater Games for the Classroom: A Teacher's Handbook\" or \"Improvisation for the Theater\". She should also read \"Group Improvisation: The Manual of Ensemble Improv Games\" by Peter Gwinn.I teach high school Improv and am currently putting together an Improv book list of items that will be added to the school library. Unfortunately, this book is nowhere on that list.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "soccer for dummies",
        "description": "Packed with drills and tips for practice and game days The fun and easy way(r) to kick-start your soccer coaching skills Volunteering as a youth soccer coach can be a great experience, both for you and your squad. But what if you've never coached before? Don't worry! This friendly guide explains soccer rules, shows you how to approach coaching, and gives you practical pointers on improving your team's soccer skills and encouraging good sportsmanship. Discover how to Understand soccer rules Develop a coaching philosophy Teach soccer fundamentals Run great practices Lead your team during a game Communicate effectively with parents",
        "authors": "['National Alliance for Youth Sports']",
        "infoLink": "http://books.google.com/books?id=CvzIAgAAQBAJ&dq=Soccer+for+Dummies&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is the first time I have reviewed a book for Amazon. I am doing this because I consider this book to be 100% garbage.If you are looking for a book full of annoying cross references (i.e. see page 118; see page 73) and for a book which repeats the same quotes or phrases in different chapters (was there really no editor?) BUY THIS BOOK.Also, if you are looking for cheap tid-bits and trivia about the US women's soccer team (was it really necessary to write three times about one female ripping her shirt off after a goal?) BUT THIS BOOK.If you want to have a general overview about the rules of Soccer but want nothing of strategy, technique, training, then BUY THIS BOOK. (or why not just go to the FIFA website and download the same rules which make up 50% of this book)But if you want to learn how to play or coach soccer, forget it. This book is a COMPLETE waste of time.",
                "review/helpfulness": "49/68",
                "num_reviews": 68
            },
            {
                "review/text": "This is the best soccer guide I've found yet! It begins with basics (rules, positions, equipment) that really helped this soccer dummy feel at ease with the game. It progresses through the fundamentals to excellent instruction on preparing and coaching, and includes additional information that will make the game more enjoyable to watch as well. The 28 chapters and two appendices are well organized into seven sections: Getting Started, Fundamentals of the Game, Calling All Soccer Moms and Dads, A Spectator's Guide, From Saturday Soccer to the World Stage, The Part of Tens (which includes several soccer &quot;top ten&quot; lists that help you &quot;talk the talk&quot;), and Appendices (a glossary and a list of soccer associations). The book is well illustrated with all the photos and diagrams needed to learn to perform those essential, parental soccer duties. It also includes useful annotations of tips and warnings (injury prevention, player's tips, etc.) you need to know. The 16-page index allows this book to be useful as a field guide as well. As a soccer-challenged father with four daughters, I love this book. It is helping turn what was a chore into quality time with my girls.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "If you have never played soccer this book might be 'just' OK for you. The book gives some basics of the game but then completely skips tactics and goes into all the different league types in the USA and the 10 best world players and than 10 best US players and then does reviews of certain great games. But once it lists the basics it misses tactics and goes straight to soccer History. If you play the game try the 'usborne soccer school' booklets instead. They're short but at least well written. I've bought 10 'For Dummies' books and have never been disappointed till now!",
                "review/helpfulness": "25/31",
                "num_reviews": 31
            },
            {
                "review/text": "Carries on the excellent tradition of the &quot;for dummies&quot; books: offers solid content and information for veteran soccer afficionados while organized as a well-written, well rounded introduction for the novice. Gives comprehensive overviews about all aspects of the game -- rules, strategies, the world of professional soccer (the leagues, tournaments, events), as well as an excellent history of the game and its development. It's refreshing to see a book for newcomers that doesn't strip things down - there is a wealth of well-researched information here that is useful for the experienced fan or participant.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "An excellent refresher for those out-of-touch with soccer as well as for those just learning the game. As the parent of a former high school and college soccer player, but that was a few years back, I thought I knew the game. Now with 4 grandchildren playing, I wanted a easy-to-read refresher. This is it. I applaud the writer and encourage all who are players, or spectators, to spend a few evenings with this easy, and fun to read, book. It is very well done.Phil",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I just wanted to know what the rules, plays, and basic strategies of soccer were. There's almost none of that here - I wasted my money.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "Soccer For Dummies is an excellent introduction for anyone who wants to understand the game of soccer. This book covers every aspect of the game, from the rules and the equipment used all the way up to soccer strategies and formations. This work also provides detailed information about international soccer and soccer clubs. The only improvement I could suggest for this book is that some of the illustrations are not helpful and that certain rules are not illustrated (the offsides rules definitely needs an illustration or two).",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book for my husband because my son started Soccer for the 1st time and my husband has no clue about the sport. He says that this book has helped him out a lot in understanding the game!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a sense of where you are",
        "description": "When John McPhee met Bill Bradley, both were at the beginning of their careers. A Sense of Where You Are, McPhee's first book, is about Bradley when he was the best basketball player Princeton had ever seen. McPhee delineates for the reader the training and techniques that made Bradley the extraordinary athlete he was, and this part of the book is a blueprint of superlative basketball. But athletic prowess alone would not explain Bradley's magnetism, which is in the quality of the man himself-his self-discipline, his rationality, and his sense of responsibility. Here is a portrait of Bradley as he was in college, before his time with the New York Knicks and his election to the U.S. Senate-a story that suggests the abundant beginnings of his professional careers in sport and politics.",
        "authors": "['John McPhee']",
        "infoLink": "https://play.google.com/store/books/details?id=RC2TZw-B0qQC&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "John McPhee's profile of Bill Bradley at Princeton is classic McPhee: the careful, meticulous observer;the passionate but objective reporter; the master wordsmith. For anyone who hasn't read McPhee, this is a great introduction to his work (it's also McPhee's first book, and has been in print every year since it was written in the mid-'60s).What do you call this book? Sports writing? A detailed profile? Both, I guess, and it really provides insight into Bradley's character, intelligence, and ethic of hard work and determination. McPhee has a great way of reporting the archetypical anecdotes to illustrate specific points--in this case, what a careful student of the game (and of life) Bill Bradley is. There's a great climax here, too, as we follow Bradley's career to his final game, in many ways the perfect ending to a stellar college career. Other nice touches are the photographs and the printing of an updated essay McPhee wrote about Bradley when he was campaigning for senate reelection. If enough people read this, Bradley will be a shoo-in for president.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Curious about Bill Bradley, the man? Sometimes a sense of the man can be had by looking at the youth. This book was written in 1965 after Bradley had finished his Princeton career and was on his way to Oxford. John McPhee's books pack powerful character studies into deceptively simple language. On the surface this is a book about basketball (it's a good book about basketball!), and about excellence through dedication and discipline . The ironic title refers to Bradley's always being aware of where he was on the court in relation to the basket, and to his deep sense of social responsibility for his gifts of privilege, intellect and ability. The portrayal is of a decent, conscientious young man, undistracted or affected by intense celebrity-- whose success in athletics and academics was as much a function of attitude and determination as any innate talent",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I'm writing this review because the fact that it didn't have a 5-star rating irritated me. I first saw the McPhee/Bill Bradley piece in the New Yorker Magazine about 30 years ago. After reading it I xeroxed the entire article and sent copies of it to every member of the University of South Carolina basketball team (which for those of you who are as old as I am was coached by the legendary Frank McGuire (the assistant coach was Donnie Walsh, now President and General Manager of the Indiana Pacers) and featured a cast of great college players like John Roche, Tommy Owens, Billy Walsh, Bobby Cremins, etc. All of the players (an unusually intelligent group) loved the article. We had many conversations about Bradley's approach to the game in the months to come. This is definitely a 5-star book for any lover of the true game of basketball. It's great and can't possibly be outdated. Highest recommendation.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Written when Bill Bradley was still a student at Princeton, the book is a synthesis of McPhee's interviews with and observations of the three-time All American. It creates a picture of Bradley as a person of character who brings his personal integrity to whatever he does and who succeeds as a result of hard work applied in accord with his personal principles. We learn, for example, that as a youngster Bradley apparently had no special basketball ability, but he decided he wanted to play and literally taught himself the game piece-by-piece, constructing his jump shot, for example, from five separate pieces and being so aware of his movements that when he missed a shot he knew which of the five pieces he had not performed correctly. And this same dedication shows through in Bradley's pursuit of his education and in his private conduct: while a student at Princeton he taught a Sunday school class for some of the town's children, and even after a Saturday night away game (followed by a six hour bus ride, reaching campus after 4 a.m.) there was never any thought of not teaching the class the next morning. This inspirational book, A Sense of Where You Are: a profile of William Warren Bradley, gives us a very clear sense of who he is, a man of honor.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Bill Bradley, a three-time basketball all-American at Princeton, Olympic gold medalist, Rhodes scholar, member of the New York Knicks and two time NBA champion definitely has a passion for basketball. This books helps show what goes into the making of a champion. Discipline, selflessness, respect, courage, imagination and passion are elements that made him a success on and off the court. I knew nothing at all about Bill Bradley before reading this book, but I have great respect for his personal code and his shining example.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This was John McPhee's first book, so it obviously holds a lot of interest as a glimpse at the man's later style. I'm happy to say that while this is obviously McPhee -- you can tell it's him within a page or so -- it's one of the weaker McPhees. Which is praising by faint damns: McPhee's style seems to have emerged fully-formed from his forehead at The New Yorker, and moved continuously upward in small, methodical steps. By the time we get to Uncommon Carriers, which I'll review soon, the McPhee style has been honed to a keen edge.A Sense Of Where You Are is also notable as a first glimpse at Bill Bradley: future Rhodes Scholar, future New York Knicks basketball player, future senator, future presidential candidate. One wants to say \"All of the future Bradleys were there when McPhee wrote A Sense of Where You Are,\" and that may be true: not only a great athlete, Bradley was the most admired man on the Princeton campus. And this isn't just retrospective I-knew-him-whenism: A Sense of Where You Are came out in 1965, before anyone could know what Bradley would become.If I tell you that this is a McPhee book, and if you've read McPhee, I can basically stop there. A McPhee book is characterized by a gentle forward motion propelled atop sentences that have no right to work as they do. The sentences are largely staccato, and in books other than this one they tend to feel like a sequence of random observations. In The Curve of Binding Energy, for instance, you feel like you're reading a mere litany of facts about nuclear fusion which seemed interesting to John McPhee, yet by the end you really have learned a lot about the construction of a nuclear weapon, and the sentences more than merely hang together; they flow. It's the strangest thing; McPheee routinely pulls off a nonfiction magic trick.McPhee studies men at work. He quickly falls into their lingo, which is both one of the greatest irritants of his books and one of their key charms. It's irritating because McPhee will often use a long string of disciplinary buzzwords before defining them; this reaches its nauseating pinnacle in Annals of the Former World, where we've absorbed a couple hundred pages of dense geological concepts before McPhee gets around to telling you what those concepts mean. It's charming because you feel like you're right in the thick of the action with citrus pickers in McPhee's Oranges; with truckers, ship captains, and UPS employees in Uncommon Carriers; and with basketball players in A Sense of Where You Are.McPhee follows Bradley on and off the court; when not watching Bradley -- the greatest basketball player, apparently, at the time McPhee wrote, and by some measure the fourth-best athlete on earth -- he's asking Bradley to walk, step by step, through how he negotiates difficult problems on the court. Standing in McPhee's kitchen, one imagines, Bradley pivots, feints, dodges and leaps to show McPhee exactly how his mind works. It's absolutely captivating.It's also a lot of hero-worship. It's a beautiful work, but a bit adulatory for my tastes. Orangemen, truckers, pilots, and nuclear engineers surely fascinate McPhee, and he respects them for the difficult tasks that they get done, and moreover he writes about them from the thick of the action, but somehow he manages in those later works to stay above the fray. By contrast, John McPhee is godfather to Bill Bradley's daughter.Don't let that dissuade you, though. If you love McPhee -- and if you don't, you must not have read him -- dive into A Sense of Where You Are and observe two great men at work.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "John McPhee starting out as a writer profiles Bill Bradley and his Princeton Tigers basketball team, through the Ivy League and into the NCAA Tournament, leading up to Princeton making it to the Final Four Bradley's senior season. In the background and unmentioned is John Wooden, whose UCLA team wins the tournament, Wooden's second of ten NCAA championships. Wooden praised Bradley, who along with Jerry Lucas and Wooden himself was the ideal student-athlete. All three were consummate team players.Included is Bradley's famous \"creed,\" \"When you are not practicing, remember, someone somewhere is practicing, and when you meet him he will win.\" (p. 65) Like Wooden, his success came from being far ahead of most of the competition on the crucial element of practice. Bradley, deeply analytical, is right out of The Talent Code by Daniel Coyle. He did have, as Lucas did, superior eyesight, but one meaning of the title of the book comes from his learning to make a shot without looking at the basket, which he frequently did--a shot for which there is no name.One of the greatest if not the greatest sports books I've read.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "improvisation for the theater a handbook of teaching and directing techniques",
        "description": "2017 Reprint of 1963 Edition. Full facsimile of the original edition, not reproduced with Optical Recognition software. \"An iconoclastic handbook of theater by the high priestess of improvisational theater in this country... The exercises are artifices against artificiality, structures designed to almost fool spontaneity into being--or perhaps a frame, carefully built to keep out interferences, in which the student-actor waits... Genius, unguarded, \"happens\" and stage fright, awkward movements, poor enunciation, phoniness, lack of characterization, in fact nearly every ill ever witnessed on stage, disappears... Those in theater, film makers included, will find this an important document in practice and theory; it is a bit like Natural Childbirth to obstetrics\"--Film Quarterly.",
        "authors": "['Viola Spolin']",
        "infoLink": "http://books.google.com/books?id=d1fxswEACAAJ&dq=Improvisation+for+the+Theater.+A+Handbook+of+Teaching+and+Directing+Techniques.&hl=&source=gbs_api",
        "categories": "['Performing Arts']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "It is important to realize, before purchasing \"Improvisation for the Theater,\" that it will not teach you the silly games and clownish humor you see on \"Whose Line Is It Anyway?\" Funny though many people find that show, it bears only a shirt-tail relationship to improvisation as Viola Spolin conceived of the concept.First of all, she probably would have been horrified to discover that many people now regard improvisation and comedy synonymous. In her system, improvisation could have been comedic, tragic, surrealistic, or anything in between. The label hung on the performance was secondary to its quality, consistency, and depth.In this, Spolin's classic textbook (newly updated and expanded by her son and daughter-in-law, her intellectual executors and heirs), she lays down the ins and outs of improvisation for performance. Activities listed in this book are designed to conduct a full workshop for improvisational actors. There are games listed for absolute beginners, orienting them to the demands of the stage, so there is no false expectation of prior experience. The games, moreover, are almost all adaptable to all ages, so a children's workshop won't feel you're going over their heads, and an adult workshop won't feel they're being condescended to.The chapters are arranged in the sequence Spolin felt would be most efficient in creating a fully-dimensional improv show that would capture audience attention and be satisfying for all involved. Not everyone will agree that this is the best sequence, and with a little time and consideration, the games can be reordered to suit an individual director's tastes. However, this should be undertaken with care -- many people have used this workshop pattern very effectively for over forty years with great success and enjoyment.The games, moreover, can be used individually, both in classrooms and in a theatrical directing environment. Many of the games teach important skills regarding vocal technique, character-motivated action, attention to environmental detail, and poise. Even when working with experienced actors, I have found many of these games useful in developing wholly realized characters and environments, and the group nature of the work is key in creating unity among cast members and ensuring everybody is playing off the same rules.I have worked with scarcely an acting coach or director who has not, at some point, used some activity from this book to achieve some goal. By having actors participate in these activities, the whole production is moved toward a unified and consistent goal, usually one that cannot be achieved by mere talking and finger-pointing. Complex variations of these games are used by improvisational troupes throughout the world, and Spolin's teachings have really been the benchmark for theatrical education and directing for nearly half a century now.No actor who wants to grow in skill, no acting teacher who wants to guide students toward higher ability, no director who wants to achieve results quickly and well, should ever be without this book. It is the measure of greatness in modern theatre.",
                "review/helpfulness": "66/66",
                "num_reviews": 66
            },
            {
                "review/text": "For serious students and teachers this is the basic bible of improvisation. It gives a strong, basic philosophy of improv for both teachers and actors. It contains methods, games and a variety of techniques to develop oneself both as a teacher &amp; and actor. Step-by-step approaches are offered as well as overviews for ones own creativity. The book is well-organized, too so that the teacher/actor can easily access a favorite warm-up,beginning game or advanced exercise. Not a book for skimming! One must study this book, that is if you truly love the theatre!",
                "review/helpfulness": "35/35",
                "num_reviews": 35
            },
            {
                "review/text": "Improvisation for the Theatre by Viola Spolin is an excellent introduction to the use of theater games with children, and for me the foundation of my exploration of children's games and play. Her &quot;Seven Aspects of Spontaneity&quot; in the theoritical part of the book is a most insightful introduction to play and creativity, and worth the price of the book alone.",
                "review/helpfulness": "16/23",
                "num_reviews": 23
            },
            {
                "review/text": "Obviously, it would be optimal if one could work in a workshop that put this book up on its feet. That way the teacher/director could experience many of these games and technique building excersises first hand, thereby making them even more vibrant and clear.That said, this third edition is extremely practical, detailed and very clearly written as it lays out hundreds of excersises which build not only acting technique, but group integrity as well. Spolin was a gifted teacher and director and her nearly seventy years of experience in the theatre pays great dividends to all who dare to follow in her footsteps,Even more helpful than the vast multitude of improvisational activities is her advice to the director of the scripted play. Like William Ball's A Sense of Direction (also a must have!) she stresses the importance of building the positive environment and details specific strategies on how to make it happen.This is a phenomenal resource for all teachers, students, actors and directors.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "In fact any other book you may buy will have most of spolins ideas.If you are guiding any one in an improvisational education. this is the best. It is very important for improvisers to learn about comedic improv through spolins techniques. all other forms of improv is about the joke which lets face it is only funny because you know the performers. but spolin allows you to discover the scene not the joke. and if you are naturally a funny person chances are your scene will be funny. this is not to say that the funniest guy wont have a serious scene .some times when an improv is a true improv you have to let it be what it is whatever it is.great book. great book .fun book. gauranteed to give you guru status if you follow her instruction. after all you will be giving the most wonderful gift to all your students. your students will develope as improvisers the correct way and will be able to work with anyone.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is the bible of improv!!!! It has everything you ever needed to know about improvisation. It gives you warm-ups and ideas for basic scene work along w/a list of games. If you've ever thought about or are doing improv you need to have this book in your library.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Not only useful for the &quot;serious adult&quot; improv artist--as a drama teacher who works with underprivileged kids I find this the best book out there for helping them develop a sense of &quot;mastery&quot; on stage, a drama more alive to them than memorizing lines. Recommended for anyone who works with young actors!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is the bible of improv!! It covers everything from warm-ups to sphere work to scene work... It also lists several games and ideas for creating your own games as well. If you have ever thought about or are doing improv currently then I highly suggest that you make this book a part of your library.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "heaven is a playground",
        "description": "In 1974, Rick Telander intended to spend a few days doing a magazine piece on the court wizards of Brooklyn's Bedford-Stuyvesant. He ended up staying the entire summer, becoming part of the players' lives and eventually the coach of a loose aggregation known as the Subway Stars. Telander tells of everything he saw: the on-court flash, the off-court jargon, the late-night graffiti raids, the tireless efforts of one promoter-hustler-benefactor to get these kids a chance at a college education. He lets the kids speak for themselves, revealing their grand dreams and ambitions. But he never flinches from showing us how far their dreams are from reality. The roots of today's inner-city basketball can be traced to the world Telander presents in \"Heaven is a Playground,\" the first book of its kind. Rick Telander is a senior writer for \"Sports Illustrated\" and the winner of the 1987 Notre Dame Club Award for Excellence in Sports Journalism.",
        "authors": "['Rick Telander']",
        "infoLink": "http://books.google.com/books?id=zqAmx_SNOV8C&dq=Heaven+Is+a+Playground&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I've read a few really good books on basketball -- David Wolf's &quot;Foul,&quot; and John Feinstein's &quot;A Season on the Brink&quot; immediately come to mind -- but Rick Telander's &quot;Heaven Is a Playground&quot; is the best, for my money. This book captures not only the spirit of the game, but also vividly recreates a time (the mid-70s) and a place (Brooklyn).Telander was in his 20s in 1974 when he went to Brooklyn to spend a summer, in part because he was in search of the elusive playground legend James &quot;Fly&quot; Williams, who figures prominently in the book. During the course of the three months he was there, however, he met, played with, interviewed and befriended a host of regulars at the courts in Foster Park in the Flatbush section of the borough. They were African-American boys and men for whom basketball was far more than recreation. For many of them, the game was a way of life and even more importantly a form of self-expression.Besides Williams, Telander also met Albert King, then an astonishingly gifted 14-year-old, who was to go on to a successful NBA career. Telander brings to life the court skills of King and others, but he humanizes them, and this is where the great strength of the book lies. For example, King agonized over his talent, which brought him attention and adulation that embarrassed him and sometimes made him angry and withdrawn. Williams' incredible pure talent was married to an unpredictable and sometimes violent temperament that ultimately shortened his career.Despite an obvious empathy for his subjects -- he wound up coaching a group of teenage park regulars, with mixed on-the-court success -- Telander does not romanticize them. Flatbush, Bedford-Stuyvesant and Brownsville, where the action of the book primarily takes place, were poverty-stricken, crime-ridden places. Many of the people Telander spent extensive time with were scarred by their environment, and he does not try to hide that. Though the book is refreshingly free of a sense of &quot;white guilt,&quot; Telander does agonize at one point over a boy he left off his team who succumbed to drug use and was later killed.At times funny, often poignant, and filled with a love for its subject, &quot;Heaven Is a Playground&quot; remains an engrossing, and still timely, read nearly 30 years after its publication.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I read this book around '93, just after having read the \"white version\" in both Larry Bird's biography and autobiography. What was interesting was these two very similar yet distinct experiences and how they related to my own experience, growing up it what would seem like a very safe and socially adjusted rural town.Heaven is a Playground was a departure for me in to a world where basketball had the utmost symbolic and cultural meaning - where legends were born and died and everybody else was willing to take the gamble. Was basketball more a sacrifice of a better future (missing school) or a one shot escape from certain poverty? Telander would probably argue the latter. What I found interesting was that only a few of the characters in the story actually had the potential for professional basketball, yet all the other young men seemed (unconsciously) willing to sacrifice their own futures for those players. Not so much blinded by their dreams they were living them.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Certainly some other reviewers have me beat in the department of basketball-related literature, but I count \"Heaven Is A Playground\" amongst the many social science books that I have read. And indeed, it matches up quite well with the best reads of the past few decades. On the surface, the book seems to be about inner-city basketball, but within the pages, it is a complete dissection of the (one segment) inner city African-American man.The amazing book \"Tally's Corner\" managed the same feat in its analysis of street corner men. Both have achieved great feats with their respective works. For basketball fans like myself, \"Heaven Is A Playground\" not only reads as great/sad/true/mystifying social commentary, but also as plain sports entertainment. Rick Telander, as a sports writer, was really able to hit home with the writing, really giving readers a feel of the 1970s game - which has many similarities and differences to the game of today.Another great aspect of the book is that it reads as if you there. Telander makes only the necessary analysis in the pages about what went on, and basically leaves the facts as they are. The book could have easily become a textbook lesson on sociological concepts, a lofty preaching on the ills of inner city life, or a rambling 200+ page play-by-play. Fortunately, the easy going style of writing is great journalism. Telander's style fit me well.Thanks Rick for a great read.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have read this book once a year since I first picked it up 14 years ago as a 16 year old playground junkie. It is a primer for learning the rhythms of America's premiere urban sport, basketball. It is also about Telander's love for the game. I always remember the manifesto on a sticker in Rodney Parker's Flatbush apartment - &quot;Basketball - it's a way of life&quot; One of the great thrills of my life was having the opportunity to interview Rick as an undergrad at DePaul University in Chicago for the student newspaper. He was encouraging to a young, aspiring writer to undertake such a project like this while still young if that's what I wanted to do. A couple of years later, I found myself living in Newark, NJ. While there in 1994, I went on a Saturday afternoon to Foster Park and hooped all day long. I remember being so happy going home on the subway, thinking, &quot;I did it! I played in the spot that has given me such happiness over the years.&quot; To anyone who wants to visit Foster Park to go play, I say do it! You won't be disappointed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "With this book Rick Telander has captured the sociology of inner-city basketball. These kids do not see basketball as merely a sport but as a means to an end. It is a ticket to a better way of life that can become an obsession for some (such as Clavin Franks). In this book Telander points out all that is good about basketball and some of the bad. This book should be read by all basketball fans, especially those who dream of playing in the NBA. If you liked this book you should also check out the movie &quot;Soul in the Hole.&quot; It is a movie about Brooklyn playground legend Edward &quot;Booger&quot; Smith.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is the best book on basketball I've ever read. First read it when I was a kid in the late '70's, and it still rings as true today. Just about the best sportswriting ever.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "readytouse sentence activities unit 2 includes 90 sequential activities for building sentence writing skills in grades 6 through 12 vol 2",
        "description": "A practical series that provides over 540 stimulating, ready-to-use activity sheets to help teach and reinforce writing skills in middle/junior high and senior high school students, grades 6-12. Each unit in the series focuses on a different area of writing skills and is complete and self-contained, including 90 reproducible activities in a variety of formats, a brief teacher's guide to effective use of the activities and full answer keys. The activities can be used in any order in any developmental or corrective writing program to meet the specific needs of individual students, small groups, or an entire class.",
        "authors": "['Jack Umstatter']",
        "infoLink": "http://books.google.com/books?id=27MNMnrtcjEC&dq=Ready-to-Use+Sentence+Activities:+Unit+2,+Includes+90+Sequential+Activities+for+Building+Sentence+Writing+Skills+in+Grades+6+through+12+(Vol+2)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The 90 activities in this book will stimulate students and help them to become more confident and proficient writers. Within these pages students can review parts of speech, utilize effective brainstorming and proofreading techniques, and become more acquainted with the various types of writings, including the descriptive, persuasive, classification, and definition essays. All of this is done in a creative and useful way. Middle school and high school students are the intended audience. The author effectively reaches both levels. A good buy!!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book contains 90 activity sheets that aid middle-high school students in fine-tuning their writing skills with particular emphasis on word selection & precision. Some of the covered items include parts of speech, pronoun problems, positive & negative adjectives, language conciseness, connotations, using words effectively etc. The added bonus is that the activities are brief [about a page long each],and fun.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As an English teacher I need many resources to help students write better. This book as given me multiple exercises that reinforce my lessons and really drives home the messages. I'm glad I bought it! It's saved me hours of putting together my own notes.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "readytouse paragraph writing activities unit 3 writing skills curriculum library",
        "description": "A practical series that provides over 540 stimulating, ready-to-use activity sheets to help teach and reinforce writing skills in middle/junior high and senior high school students, grades 6-12. Each unit in the series focuses on a different area of writing skills and is complete and self-contained, including 90 reproducible activities in a variety of formats, a brief teacher's guide to effective use of the activities and full answer keys. The activities can be used in any order in any developmental or corrective writing program to meet the specific needs of individual students, small groups, or an entire class.",
        "authors": "['Jack Umstatter']",
        "infoLink": "http://books.google.com/books?id=27MNMnrtcjEC&dq=Ready-to-Use+Paragraph+Writing+Activities,+Unit+3+(Writing+Skills+Curriculum+Library)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The 90 activities in this book will stimulate students and help them to become more confident and proficient writers. Within these pages students can review parts of speech, utilize effective brainstorming and proofreading techniques, and become more acquainted with the various types of writings, including the descriptive, persuasive, classification, and definition essays. All of this is done in a creative and useful way. Middle school and high school students are the intended audience. The author effectively reaches both levels. A good buy!!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book contains 90 activity sheets that aid middle-high school students in fine-tuning their writing skills with particular emphasis on word selection & precision. Some of the covered items include parts of speech, pronoun problems, positive & negative adjectives, language conciseness, connotations, using words effectively etc. The added bonus is that the activities are brief [about a page long each],and fun.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As an English teacher I need many resources to help students write better. This book as given me multiple exercises that reinforce my lessons and really drives home the messages. I'm glad I bought it! It's saved me hours of putting together my own notes.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "readytouse prewriting and organization activities unit 4 includes 90 sequential activities for building prewriting and organizing skills in grades 6 through 12",
        "description": "A practical series that provides over 540 stimulating, ready-to-use activity sheets to help teach and reinforce writing skills in middle/junior high and senior high school students, grades 6-12. Each unit in the series focuses on a different area of writing skills and is complete and self-contained, including 90 reproducible activities in a variety of formats, a brief teacher's guide to effective use of the activities and full answer keys. The activities can be used in any order in any developmental or corrective writing program to meet the specific needs of individual students, small groups, or an entire class.",
        "authors": "['Jack Umstatter']",
        "infoLink": "http://books.google.com/books?id=27MNMnrtcjEC&dq=Ready-to-Use+Prewriting+and+Organization+Activities:+Unit+4,+Includes+90+Sequential+Activities+for+Building+Prewriting+and+Organizing+Skills+in+Grades+6+through+12&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The 90 activities in this book will stimulate students and help them to become more confident and proficient writers. Within these pages students can review parts of speech, utilize effective brainstorming and proofreading techniques, and become more acquainted with the various types of writings, including the descriptive, persuasive, classification, and definition essays. All of this is done in a creative and useful way. Middle school and high school students are the intended audience. The author effectively reaches both levels. A good buy!!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book contains 90 activity sheets that aid middle-high school students in fine-tuning their writing skills with particular emphasis on word selection & precision. Some of the covered items include parts of speech, pronoun problems, positive & negative adjectives, language conciseness, connotations, using words effectively etc. The added bonus is that the activities are brief [about a page long each],and fun.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As an English teacher I need many resources to help students write better. This book as given me multiple exercises that reinforce my lessons and really drives home the messages. I'm glad I bought it! It's saved me hours of putting together my own notes.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "readytouse word activities unit 1 includes 90 sequential activities for building better word skills in grades 6 through 12 jb ed readytouse activities",
        "description": "A practical series that provides over 540 stimulating, ready-to-use activity sheets to help teach and reinforce writing skills in middle/junior high and senior high school students, grades 6-12. Each unit in the series focuses on a different area of writing skills and is complete and self-contained, including 90 reproducible activities in a variety of formats, a brief teacher's guide to effective use of the activities and full answer keys. The activities can be used in any order in any developmental or corrective writing program to meet the specific needs of individual students, small groups, or an entire class.",
        "authors": "['Jack Umstatter']",
        "infoLink": "http://books.google.com/books?id=r0uNRwAACAAJ&dq=Ready-to-Use+Word+Activities:+Unit+1,+Includes+90+Sequential+Activities+for+Building+Better+Word+Skills+in+Grades+6+through+12+(J-B+Ed:+Ready-to-Use+Activities)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The 90 activities in this book will stimulate students and help them to become more confident and proficient writers. Within these pages students can review parts of speech, utilize effective brainstorming and proofreading techniques, and become more acquainted with the various types of writings, including the descriptive, persuasive, classification, and definition essays. All of this is done in a creative and useful way. Middle school and high school students are the intended audience. The author effectively reaches both levels. A good buy!!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book contains 90 activity sheets that aid middle-high school students in fine-tuning their writing skills with particular emphasis on word selection & precision. Some of the covered items include parts of speech, pronoun problems, positive & negative adjectives, language conciseness, connotations, using words effectively etc. The added bonus is that the activities are brief [about a page long each],and fun.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As an English teacher I need many resources to help students write better. This book as given me multiple exercises that reinforce my lessons and really drives home the messages. I'm glad I bought it! It's saved me hours of putting together my own notes.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "brave new voices the youth speaks guide to teaching spoken word poetry",
        "description": "Utilizing student examples from their spoken word poetry workshops, Weiss and Herndon present their methods and outline a practical five-week course that fosters poetic awareness.",
        "authors": "['Jen Weiss', 'Scott Herndon', 'Youth Speaks (Organization)']",
        "infoLink": "http://books.google.com/books?id=eP95AAAAIAAJ&dq=Brave+New+Voices:+The+YOUTH+SPEAKS+Guide+to+Teaching+Spoken+Word+Poetry&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "YouthSpeaks is an amazing program and Jen &amp; Scott have done an excellent job putting together this guide, capturing the essence of their mission: &quot;the next generation can speak for itself.&quot;Too many writing programs take a hierarchical approach, attempting to define poetry as if in a vacuum, with no regard for individual experience and taste. This guide flips that tired, off-putting approach and instead, starts with the students' own work, introducing and clarifying poetic devices they already use, slowly slipping in the work of others. The exercises are many and varied, their recognition of and focus on performance is impressive and the inclusion of several poems and anecdotes by students of the program is crucial.If you teach poetry, or even if you just write it yourself, this book should be on your bookshelf.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I teach a poetry class to juniors and seniors at a private prep school in the Bay Area. This book is proving to be an invaluable resource, not just for teaching creative writing and spoken word, but for inspiring me as a teacher as well. The authors do a brilliant job of putting on the table the fears that both teachers and students bring to writing workshops. I felt greatly affirmed by reading this section, as well as deeply empowered and encouraged to keep expanding myself as a teacher. Thus, these writers are educators who know pedagogy, and who know the inner life of teaching.The guidance for teaching the 5 week workshop is excellent. The exercises and process have proved most successful in my class. This is THE perfect book for anyone who wants to thoroughly expose their studnets to spoken word; get ready too to grow as an educator and human being.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "spelling works grades 48",
        "description": "Teach Spelling So It Sticks! offers teachers in grades 4-8 an easy-to-use step-book format complete with instructions, assessment tips, a suggested weekly routine, games, activities, and word lists, plus strategies for teaching commonly confused words such as homophones and those dreaded \"spell-check nightmares.\" Use as a complete approach or choose the engaging games and activities you want. Great for all students--especially struggling spellers, English-language learners, and ESE students.",
        "authors": "['Jane Bell Kiester']",
        "infoLink": "http://books.google.com/books?id=9HmAysIq4EEC&dq=Spelling+Works!+(Grades+4-8)&hl=&source=gbs_api",
        "categories": "['English language']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Thought my rising 6th grader was just a poor speller. Bought this book in the hope that she might improve a little this summer before she started middle school. After just four chapters, I am feeling pretty optimistic that she will improve dramatically. She seems to be grasping the rules and really learning HOW to spell!The book moves through the rules of spelling systematically -- one rule per short chapter. She doesn't mind doing a chapter at a time since it doesn't take that long. It has also made it easy for me to help her practice each rule -- I just create our own spelling list for each chapter.I recommend this book highly!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is outstanding. We have recently begun to use this book in our home classroom for our 3rd, 4th and 7th grade students. The kids are excited when I pull it out because they find it fun, especially my 7th grader who has struggled with spelling. I was skeptical that a spelling curriculum that claimed to be for 4th-8th graders would really work for such a diverse age group, but the lessons are straightforward and the presentation of the spelling rules can be understood easily by most children. Best of all, I have seen results already in their written work, because they are understanding and remembering the lessons. While it is expensive for a softcover book, the pages are reproducible and can be used for many students. Still, if I had just one student I would buy this book and consider it a good investment, because I am seeing better results in this short period than I have seen with anything else we have used over the years.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "in the middle new understandings about writing reading and learning",
        "description": "Nancie Atwell reflects on the ten years of her teaching experience since writing the first edition of the seminal work, \"In the Middle.\"",
        "authors": "['Nancie Atwell']",
        "infoLink": "http://books.google.com/books?id=dXXuAAAAMAAJ&dq=In+the+Middle:+New+Understandings+About+Writing,+Reading,+and+Learning&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought two copies of this book from Amazon, for myself and my class aide, on the strength of the other teachers' recommendations here. The book is as good as the most enthusiastic reviewers say it is, but it is seriously flawed, and to some degree self-contradictory, because it talks too much. As good as are the author's approaches, she doesn't really need 484 pages, plus numerous appendices, to get the message across. In fact, she buries the message in verbosity.Note that other reviewers found the book easy to read. But if you are already convinced that you want to refresh your approach to teaching reading and writing, you may grow impatient with the overabundance of anecdotes, homilies and elaboration.Teachers know there is no itemized recipe for teaching, but a book on teaching writing could at least demonstrate the virtue of being concise. Mrs. Atwell should read her own quotes and not \"cloud the issues with jargon in place of simple, direct prose....\" (p. 16). (This is one of numerous quotes of Donald Graves, who returns the favor by endorsing her book in an exemplary brief foreword).As one who likes quoting great writings in every chapter, the author could have used and applied the Hellenistic Demos: \"I will be moderate in all I attempt and do Nothing to Excess.\"Summary: it's just too much of a good thing. I'm going to spring for the workbook (Lessons that Change Writers) and generate even more royalties for the author, in the hopes it is more to the point.",
                "review/helpfulness": "39/57",
                "num_reviews": 57
            },
            {
                "review/text": "Atwell's new IN THE MIDDLE outclasses the old text by a mile. She really has broken through the questions and concerns raised in the old &quot;cookbook&quot; style IN THE MIDDLE of the eighties to an outstandingly researched and written, comprehensive&quot; how to&quot; for teachers of reading and writing. I am applying her ideas to my high school English classes with astonishing results. This is a book for secondary school English teachers who really want to change what they do and how they do it..",
                "review/helpfulness": "41/44",
                "num_reviews": 44
            },
            {
                "review/text": "Atwell introduces her teaching experiences with chapters about how teach writing and reading to the fragile adolescent age groups. In the following chapters she describes, in detail, her procedure of the &quot;writing and reading workshop&quot; for teaching in her classroom. She goes into great detail about how she prepares herself before the students ever come to class, what she does in the first week of school and how she introduces the workshop technique to her students, her use of minilessons, how she responds to students' writing and how she values and evaluates the students' writing. This book is very thorough in its descriptions of how to teach the workshop style of reading and writing. Atwell walks the reader through every step to make this technique successful. She gives many examples of dialogue she, as a teacher, has had with students showing the reader how she handled particular situations that had come up. It leaves no question unanswered. I believe this book is very helpful to teachers who wish to teach this method. Atwell captures her audience by using real stories and references to experts in this field who have studied this technique for years. Although this is a very involved technique and some beginners may feel overwhelmed by the detail, I highly recommend it.",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "Nancie Atwell's &quot;In the Middle&quot; is a valuable source of material for setting up reading and writing workshops in the middle school classroom. I teach seventh grade language arts and the reading teacher on my team and I have used many of Atwell's ideas to prepare for the school year. I found it to be very useful and relevant to my teaching.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "Aimee Duncan Miami University Oxford, OhioIn the Middle. Nancy Atwell. 1998. Portsmouth, NH: Boynton/Cook Publishers, Inc.Remember middle school? Remember your first crush whenYou see him walk past you in the hall your eyes lock. Yours want to stay locked forever-Or your first dance whenYou knew it was right, and you knew much more when it was not- something clicked -Those days were so real. The crush so significant and the dance so memorable. And then remember when your crush didn't like you back? And the guy you clicked with on the dance floor turned around and danced with your best friend? Remember going home and writing about it in your journal; all those heart-breaking poems and hate letters. Just think about if your teacher allowed you to turn a piece in like that? Minus all of the bad words, that would have been powerful writing -- authentic and full of emotion -- I wish I would have been able to express myself like that in high school. Nancie Atwell in In the Middle knows that surviving adolescence is not easy. She gives teachers advice on how to go about the \"real\" issues that their students are going through. She gives her students freedom, the freedom to express all of the \"thorns.\" In chapter three the book came alive for me. She talked about how important it was to have a class of reality. Teachers need to know what is going on in the lives of the adolescents. The pain they feel is real, the \"thorns\" of adolescents cause hurt and teachers cannot overlook that. Atwell claims that it is important for teachers to spend their lives focusing on this \"fascinating\" and \"unpredictable\" stage. \"It's a stage of change - emotionally, physically, psychologically, and intellectually.\" (55) Atwell allows her students to write about their lives. She has them construct poems about their basketball heroes, their soccer game, their bedroom, feeling alone, etc. I think this is a wonderful idea. I hated writing about what I would do if I had a time machine or what I would do if I was Huckleberry Finn. I can't write with emotions when I have prompts like that. I need a real-life prompt. I need to write about something I care about, something that evokes emotion. Atwell allows her students to write about those \"real\" emotions. One of her expectations for writing is to \"find topics and purposes for your writing, that matter to you, to your life, to who you are and who you want to be.\" She wants her students to know who they are. She wants them to discover themselves through their writing. During adolescence I had no idea who I was. I needed to know more about me - my beliefs, who I was becoming, and what I wanted from my life. But instead I was stuck in a traditional classroom, writing five paragraph essays about things irrelevant to my life. As a teacher of beginning writing she had her students focus in on life stories about moments from their lives. Students like to write about their lives, giving them the chance is all they need. Atwell also had her class create memoirs in order for her students to look into their past and \"make sense of it.\" In this assignment her students had a chance to figure out who they were, who they want to become and they put life events into perspective. Atwell believes in the power of poetry. She believes that it gives shape to experiences. It puts things into words that are hard to say; like having your heart broken. Poetry can help one find comfort, it can make one think, laugh and even cry. Atwell encourages her readers to get to know their students. She encourages the reader to learn about the \"thorns\" of adolescence.One of the best things middle school teachers can do for our students is acknowledge that the thorns of adolescence are real and cause real pain. I'm not a counselor, but I can affirm that growing up is hard, and I can resolve to make it an exciting, confident, productive time. I begin by looking at my students as teachers who will instruct me about their lives. I'll spend the rest of my years as a middle school teacher learning about the lives of middle school kids. (55)I believe this. I believe that we can learn from our students. I think that the more \"with-it\" we are as teachers the smarter we will be and the more respected we will be. Students will find us more convincing and look to us as role models instead of \"an older person,\" - too old to understand adolescence. Atwell gives her students the freedom to choose topics they wish to write about. She believes that this does not take away from structure. I do as well. Students have thousands of ideas and as long as they are writing the teachers should be happy. Yes, there are times for the \"traditional\" assignments, but plenty of time for students to construct their own ideas. She allows them to choose topics, but she establishes her expectations first. \"So I think on paper about what writers and readers do, about who my students are, about what I believe, what I know, and what my priorities should be as a teacher of writing and reading.\" Atwell encourages her students to try different genres, reminding them to keep each of their pieces. She tells them that sometime during the year create a short story, three to five poems or songs, a book review, a memoir, and a profile of a local citizen based on original research, or op-ed piece or essay about an issue. I think these are wonderful pieces of writing that will allow students to explore their lives and different styles. These genres will keep the student from getting bored of the conventional essays and will better prepare for the world. In the Middle has many other great parts, however the writing part fascinated me the most. She has great ideas about reading as well. All of her ideas revolve around what is best for the student. She is a caring educator. She has made impacts. I hope I will make those impacts as well. All teachers can learn from her examples.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "For those entering the teaching field for the first time, changing schools or situations, or returning after a lengthly time off this book is a step-by-step guide for setting up reading/writing workshops in your classroom. It can be adapted for any grade level. It includes conversations, worksheets, tips, assessments and practical suggestions how to handle most situations with writing/reading with children struggling to define themselves. Nancie Atwell is an unselfish educator willing to share herself and what she has learned with her students and fellow teachers. An invaluable guide. I wish I could take a class or workshop with Nancie Atwell. She must be someone special.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "I very much enjoyed Nancie Atwell's book. Nancy's style of writing allows for easy reading. She presents many useful strategies for teaching reading and writing at the middle school and high school levels (the use of journals to discuss literature). Nancie joins the aspects of reading and writing in the English program to create an almost no-fail system to teaching literature. Great emphasis is placed on the idea that the more students are exposed to reading, writing, and literature, the more appreciative of literature they will become. Students will gain a sort of respect for literature if they are exposed to a steady, constant stream of reading.One aspect I really did enjoy in Nancy's book were her anecdotes and stories of her own experiences about learning and becoming a teacher. These stories gave a &quot;real flavor&quot; to the book. Nancy's book wasn't about presenting teachers with boring, mechanical information on how to teach reading and writing. Her book presented real strategies for real teachers and real students.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Atwell's research and dedication to the true teaching of literacy in classrooms of all levels has changed my philosophy of teaching forever. Those who judge her approach without attempting to understand it, are only missing out on an innovative and fresh approach to how English should be taught.In my own classroom of tenth graders, I have gone from yawns and glazed eyes to students who leave my classroom at the end of the school year saying &quot;I could write for pages and pages about how you've helped me become a better writer.&quot; I still address grammar, literature, &quot;5 paragraph&quot; essay writing, and the dreaded (and overrated)state tests. Instead of being students who force themselves to read and write for a grade, they are readers and writers who are proud of the accomplishments they produce in literacy.I recommend this book to anyone who is serious about changing the way literacy is taught in our schools, and creating not only engaged students, but people who love to read and write.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Nancie Atwell's book has changed the way I teach reading and writing; I'm a more effective teacher thanks to her. I just wish In the Middle were easier to use. None of my colleagues will take the time to read it, because the useful, practical stuff is burried in a huge volume of anecdotes, personal history, et cetera. I would love to see a condensed, &quot;practical&quot; version that was more of a reference book, without all the stories of how Ms. Atwell developed the workshop approach.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "This year, for the first time, I am using many of Atwell's ideas in my English classroom, and it is working a hundred times better than I had ever dreamed! Most specifically, I have patterned my writing instruction for my students, grades 6-10, after her writing workshop. Kids who hated writing before now cheer when they know it's a Wednesday or Friday--our writing days. My students are writing more than they ever did, and they enjoy it. I also love it, because their writing is suddenly interesting and full of life.Although this book makes a terrific handbook, be prepared to make some changes for your own classroom. As Atwell says, these are the methods that work for her in her specific situation. I have made up other forms and other guidelines that fit my school's curriculum and makeup. For example, I do the workshop two days per week. I also have specific types of writing required for the student portfolios, then they may work within those limits. I found this helpful so my students would try a variety of writing, and also fit the district curriculum requirements. Still, the premise, in both theory and practice, is extremely helpful and inspiring. Read the book, then adapt it to your own class.As for the reading section, I do some reading workshop, but it is not quite as successful. The weekly literary letters are quite cumbersome, for example. The theory is still interesting, and may work better for other classes.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            }
        ]
    }
]