[
    {
        "Title": "ap spanish w audio cds rea the best test prep for the ap exam advanced placement ap test preparation",
        "description": "REA ... Real review, Real practice, Real results. Get the college credits you deserve. AP SPANISH 6th Edition with audio CDs Completely aligned with today's 2007 AP exam Are you prepared to excel on the AP exam? * Set up a study schedule by following our results-driven timeline * Take the first practice test to discover what you know and what you should know * Use REA's advice to ready yourself for proper study and success Practice for real * Two audio CDs provide excellent preparation for the exam's listening comprehension session (book includes transcripts of CDs) * Create the closest experience to test-day conditions with 3 full-length practice tests * Includes pre-exam exercises that target key the key testing areas of listening, reading, writing, and speaking * Chart your progress with full and detailed explanations of all answers * Boost your confidence with test-taking strategies and experienced advice Sharpen your knowledge and skills * The book's full subject review features coverage of all AP Spanish areas that will appear on the official exam. * Smart and friendly lessons reinforce necessary skills * Key tutorials enhance specific abilities needed on the test * Targeted drills increase comprehension and help organize study Ideal for Classroom, Family, or Solo Test Preparation! REA has provided advanced preparation for generations of advanced students who have excelled on important tests and in life. REA's AP study guides are teacher-recommended and written by experts who have mastered the course and the test.",
        "authors": "['Erica R. Hughes', 'Suzanne Varner']",
        "infoLink": "http://books.google.nl/books?id=GIHpGAAACAAJ&dq=AP+Spanish+w/+Audio+CDs+(REA)+-+The+Best+Test+Prep+for+the+AP+Exam+(Advanced+Placement+(AP)+Test+Preparation)&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I really enjoyed using this book as a form of supplementary preparation for taking the AP Spanish Exam. I found it to be an excellent source of information for all of the material covered on the exam, and some of the practices excercises actually more than prepared me for the material on the exam. The audio CDs were essential in preparing me for the oral component of the exam, and made studying more fun. I Am grateful to the authors of the book, since their work helped me to score a 5 on the exam. I would strongly recommend this book to test takers.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "First, I should say that I didn't actually use the book as a review, but my teacher did use two of the practice exams (not sure how many come with it in total) in class. We did one full length exam on a Saturday morning (I got a 5) and there was another one that we did in sections over a few days. This morning, I took the real College Board AP Spanish Language exam and it was a little different. Not completely different, mind you-REA got all of the basics right-but something about the tone and feel of the exam was different. The reading passages weren't actual narratives, but factual writings, two of them were reprinted from newspapers. On the listening section all of the accents in this book were from Spain (use of &quot;ceceo&quot;) but none of them were on the actual test. This isn't a bad test, but some of the other review books are probably a little better. Again, I did not use this for review of grammar or look at the book at all, just the practice tests.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is the absolute best buy for AP Spanish Language preparation. It goes through every aspect of the test and has a very thorough review of all grammar tested in the exam (although I thought that they had a little more then what was needed). The practice tests accurately measure with the difficulty and format of the real test. Having a bad situation with an inexperienced teacher, I picked up this book and used it for self-study. It helped me greatly, and in the end, I received a 4 just by going through it myself and practicing.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Absolutely the best book around. The subject review is a big exhaustive, but well worth your money. Going through the entire book will guarantee you a 4 or a 5!",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Based on content this book is great, with 3 practice exams that are just like the AP. The reviews of topics are very thorough and most topics are easy to find. The one problem is the page size. The page flipping is a distraction for me, but that is a more minor issue.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I have a large collection of books for learning spanish and this book turned out to be one of the very best of them. I know that it is a book angled toward preparing students for the AP exam butit just so happens to be one of the most user friendly, well designed and comprehensive books for learning spanish out on the market today. I am an advanced college spanish student and therefor I didn't get the book to prepare for the exam. I got it because it offers a well structured and comprehensive review as well as many helpful drills and practice tests. I think a book structured like this is probably the best way to study a language on your own. So to all you who may have been put off by the fact that it is an exam preparation book please do yourselves a favor and buy this book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "cracking the ap spanish exam 20042005 edition college test prep",
        "description": "Profiles a variety of professions with information on day-to-day activities, professional responsibilities, college majors, and high school activities.",
        "authors": "['Jodi Weiss', 'Russell Kahn']",
        "infoLink": "http://books.google.nl/books?id=Mp0LRxu0ibsC&dq=Cracking+the+AP+Spanish+Exam,+2004-2005+Edition+(College+Test+Prep)&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought this book thinking that it would be a valuable resource for preparing for either the AP Spanish Language or Literature exam. I was wrong.Concerning the language exam:First of all, there are no listening CD's and nowhere in the text does it say that a friend or someone else has to read the text. I have another testprep book without the CD's but at least it states that someone must read the listening portiong. I kept hoping to see a mail-in offer for listening CD's in the Princeton Review. There was none.Second, the picture panels (only 2) are very illogical and nothing like a student would see on the AP exam.Third, although it offers one practice exam, there is no indication telling me how the exam is scored.Concerning the literature exam:The very few test-like questions are designed for the old reading list of 5 authors. The book does not even address the fact that there is a new reading list and what exactly that reading list is.As far as test prep books go, I'd actually give this one a zero but I was not given that opportunity. I would say that Cliffs AP or 5 Steps to a 5 or even the ARCO test prep book is much more informative. Princeton Review needs to do more than just change the \"test date\" on their cover.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "A good book - but would be better with more sample practice test questions and explanations for correct answers.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Likewise in the previous review, PR's review of Spanish Language AP is far too simplisitc to adequately prepare you for the AP test. I 'felt' ready, but come test day (2004), the exam was much harder than anticipated.Received a 4, only because of a unusally interesting essay prompt and easy speaking section.*Didn't try any other study guide (so you may take this with a grain of salt), but felt this one didn't do the greatest job of preparation.Purchase for basic review of verb tenses, outline of test format, mediocre coverage of listening and speaking practice.(FYI Spanish is one of the hardest AP tests)",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "pronounce it perfectly in english",
        "description": "ESL students, TOEFL and TOEIC test takers, and all others for whom English is a second language and who want to improve their pronunciation will find this book and compact disc combination especially instructive. The new edition presents many exercises that provide practice in every sound that is specific to American-style English. Emphasis is on the formation of the vowel and consonant sounds plus all of their possible spellings, the significance of correct pronunciation of grammatical markers, and stress and intonation patterns in conversational English. Recognition of these patterns is essential for fluent speech and listening comprehension. Four compact discs give students more than five hours of intensive speaking practice.",
        "authors": "['Jean Yates']",
        "infoLink": "http://books.google.com/books?id=6xoAMgEACAAJ&dq=Pronounce+It+Perfectly+in+English&hl=&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have gone through this book and still reading it regularly to keep on my practice. It has really helped me to know the trick of American English pronounciation by properly controlling the tongue and mouth movement. The pictures given in this book are of tremendous help to me. I would have liked to see some more words in the pronounciation list. Anyway, this is one of the greatest book for mastering the pronounciation of English.",
                "review/helpfulness": "43/45",
                "num_reviews": 45
            },
            {
                "review/text": "This is an excellent book for improving and mastering our pronunciation in this interesting language. I am a peruvian and as a Spanish speaker it was so easy to learn the English sounds, his rhythms and accents. All the book is perfect! :-) Now i can speak English better than before and I can understand English-speaking people better too. The voices recorded in the cassettes are very nice and clear. I like the voice of Julie because she have a sexy voice. The table of pronunciation symbols used by five international dictionaries is very important so we can compare and apply our learned symbols sounds in those dictionaries. This book use a standard English pronunciation...all English speakers will understand you! So i can say with a smile on my face: &quot;I really did a good buy!&quot;",
                "review/helpfulness": "32/35",
                "num_reviews": 35
            },
            {
                "review/text": "Finally, Jean Yates has taken something scary to so many, and made it so easy and fun--learning not just the words, but how to communicate! I was appalled by the previous review as I had been told how effective this book is prior to reading it...Upon seeing how this book helps people actually connect with, understand, and speak the language, it shows this reader 2 things: First, Jean Yates knows not only the language, but the art and importance of really communicating. Second, it shows the previous reviewer was simply pitching another book and didn't take the time to read this book and understand how it helps the confidence of those learning the language. Anyone trying a new language knows how frustrating it is to not only find the right words to say, but to find the right way to say them. Jean Yates comes across as a teacher of the language, and of confidence in those that want to learn it. Oh, and by the way, Jean Yates is a woman... Another observation missed by the previous reviewer.",
                "review/helpfulness": "20/26",
                "num_reviews": 26
            },
            {
                "review/text": "I tried many accent reduction series. This one is not so useful to me. The way she go over certain difficult sounds I have did not make sense (to my ears). It might work better for other accent (non Asian/Chinese). Very hard for me to distinguish some sounds from the tape.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am a student of languages and an ESL tutor. I like the \"Pronounce It Perfectly\" series for myself (French and Spanish) and for my ESL students (English).The material is a high quality mass-market version of professional ESL pronunciation workbooks. The audio is excellent and has a matching book. I like the following aspects: (1) each sound is covered in sufficient depth (variety and repetition) that a diligent student will acquire basic listening recognition and sound production skills, (2) there are examples of various spellings for a given sound (example: meet/meat) and again a diligent student will acquire basic skills at recognizing the probable spellings of a spoken word, (3) there are explanations of correct jaw, tongue and lip positions (very helpful!), and (4) important subtle details are covered (example: 'p' has a puff of air at the beginning of a word).For my ESL pronunciation lessons, I like to work with \"English Pronunciation Made Simple\" and to loan the student a copy of \"Pronounce It Perfectly in English.\"",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "holy the firm",
        "description": "In 1975 Annie Dillard took up residence on an island in Puget Sound in a wooden room - one enormous window, one cat, one spider and one person. For the next two years she asked herself questions about time, reality, sacrifice and death. In Holy the Firm she writes about a moth consumed in a candle flame, about a seven-year-old girl burned in an aeroplane accident, about a baptism on a cold beach. But behind the moving curtain of what she calls 'the hard things - rock mountain and salt sea', she sees, sometimes far off and sometimes as close by as a veil or air, the power play of holy fire. Holy the Firm is a profound and breath-taking book about the natural world by a Pulitzer Prize winner and one of the most influential figures in contemporary non-fiction.",
        "authors": "['Annie Dillard']",
        "infoLink": "https://play.google.com/store/books/details?id=WBGuCgAAQBAJ&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 6.0,
        "review": [
            {
                "review/text": "Annie Dillard is one of those writers who is all or nothing. Many people don't &quot;get&quot; her and find her bewildering. But to some of us, she speaks to some unspoken hunger in our souls that we never knew we had. The year after a personal tragedy I read Pilgrim at Tinker Creek and Holy the Firm incessantly, finding in Dillard's thoughts and imagery a necessary verbalization of my pain and spiritual confusion. She is able to capture in one short phrase the complex muddle of emotions found at certain times in one's life and the reader knows that she's been there. To filch a line from another book: &quot;When one walks in the shadow of insanity, the finding of another footstep on the sand is something close to a blessed event.&quot; I do not exaggerate when I say Holy the Firm saved my mind.This is not to say that Dillard is all gloom-and-doom. Many of her lines are extremely witty and can make you burst out laughing with her insight and sardonic humor.Either she clicks with you or she doesn't. But for those of us with whom she does, Dillard is wonderful.",
                "review/helpfulness": "113/116",
                "num_reviews": 116
            },
            {
                "review/text": "I don't like using words like &quot;perfect&quot; but I think it is warranted here. This is an incredibly literate piece of work, in which not one single word has been wasted. Each time I read it I come away exhililrated &amp; humbled by Dillard's mastery of language &amp; the enormous depth of scholarship that lies behind every line and every metaphor. This is writing by someone drunk on language &amp; learning, try not to stuff it into any pre-conceived notions of literature -this is music. Dillard has crafted a classical symphony for us in which certain movements come back over and over in variations of harmony and melody that will sweep you away. Now, that being said, I must also say that it seems that half my best students love Dillard &amp; half hate her. Very little in between. Yesterday one of my brightest (who loves Dillard) threw up her hands and said &quot;Now I hate her, I will have to spend seven years reading to know what she is saying&quot;. Yes, of course! but the joy of Dillard's immersion in Anglo-American theology and literature is that she draws you along -it isn't name dropping, thesefolks have been useful to her &amp; she wants us to come too. Read Holy The Firm with Eliot's Four Quartets in the other hand, then you can have a go at Johnson, Martin Luther.... AND YOU WILL!",
                "review/helpfulness": "63/65",
                "num_reviews": 65
            },
            {
                "review/text": "While attending Western Washington University I had the great good fortune to take a poetry class from Annie Dillard. My own poetry was abysmal and she gave me this advice, \"writing is like prayer; you sit and listen for the still small voice.\" She had won the Pulitzer prize for Pilgrim at Tinker Creek and was in the process of writing Holy the Firm while at Fairhaven College at Western. She read us the bits about the moth and the flame. This is her slenderest book, but the one in which she most takes her own advice. It's prose that reads like poetry.This is a book that makes me think that everything else I've ever read was only approximate use of language to convey some idea. In this book it seems like every word is carefully chosen, as if it comes from some place of meditation, of listening to a still small voice. It's a very human book, for all the sparks of the divine. By another accident I heard her read from it at the University of Washington. The final passage seemed to rise to a climax and hang in the air. No one spoke, no one left. It was one of those magical moments. Holy the Firm is all one piece and can be read through in one sitting as one experience. It's very much a writer's book, and I see most of the reviews are by writers finding some echo in a fellow writer. Some reviewers have put much better than I what it's about. I merely suggest that Dillardians (and other readers) may enjoy this oft-overlooked book.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "Annie Dillard has a special way of speaking to her readers. Her language is light and airy, yet filled with great significance and meaning. She blithely covers the most difficult and complicated of human subjects, with terrific contemplation. And what she yields is a treasure, a gem to be internalized and imbued.In this book, Annie discusses God. She is confused by the way in which random events that hurt and injure seem to be disconnected with the way in which we would like to live. If these random and terrible events take place, without willful malice; then how could it happen that God would let such terrible things occur?She describes a day in her life. In that day there is a young girl visiting, to whom she is attracted and vice versa. They have a chemistry that brings them within each other's spheres. This beautiful girl becomes the casualty of an airplane crash. No one else is hurt. No one is dead. But this girl for a random reason, is hit with a globule of flaming kerosene, and her face is totally burned away.This anomaly is the framework of the book. She could have chosen 1000 other examples that set up this question. But she chose this one of the girl, one that could be personal not just to her; but also to her readers. She reminds us that there is no everyday, omnipresent God directing things. And there is no way to figure out these random events. There are only DAYS. And those days are filled with things that we do or don't do. There is no God that will directly intervene and tell us what to do, or save us. He is as ruthless as he is merciful. His form, however, is quite another story. His form is spiritual, not worldly, and not mundane. And we must remember that we control most of the things in our lives directly. We need to assume that responsibility and leave the spiritual to whatever it is we seem to believe in as God.This book creates highly complex philosophical problems; which have no direct answers. Yet the book is highly recommended for critical thinkers. The book is a special treatment on the concept of the Divine.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "Pulitzer-Prize winning author Annie Dillard's Holy the Firm transcends the genres of poetry and essay as fluidly as it does the disciplines of philosophy and religion. Her writing is lucid and inspiring and this tiny volume contains more insight and wisdom than virtually any other modern text I've encountered. I'd highly recommend this book to any reader, in hopes that Dillard's unique writing style and her spirited intellect can bring to others the same inspiration they have brought me.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I was attracted initially to this book based on Dillard's other works and the idea that she holed herself up in the Puget Sound area for a couple of years to think things through. Wow. Maybe more of us should stop and watch and think and write for a couple years. There is an almost imperceptible inner longing that runs throughout this book. I imagine Dillard working very hard over every word and that effort comes through to the reader in the depth of each sentence. She's not always accessible and I know people who just can't get through her books. I don't argue - she's rarely breezy and always deep but I always find her writing to be satisfying and challenging. A rare gem.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Prose poetry -- a literary form that seems to be missing from the experience of many readers. It is the ambrosia of forms and I know of no one better to serve it than Annie Dillard.I envy her skill at evoking imagery and emotions through her rhythmic, metophorical language. It is a language of her own, honed through years of practice.She has fed my spirit and my soul. She has given me a desire to reside in a world of words that is unlike any other. She has lifted me to a new dimention -- a heaven of words dancing around and above and with each other --whirling in a dervish of linquistic rapture.If I could choose to imitate one writer who ever lived, it would be Annie Dillard.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is definitely not work that I would usually read for pleasure. However, it was entirely pleasurable. Beautiful images, words, skill, observation, and construction. I both laughed and, unexpectedly, cried. Perfect contemplative reading.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Someone has compared Dillard to Thoreau. They were right. The way this author fashions her words leaves me wordless. Poetic, poignant, evocative, smelling of life and love and tragedy... just buy it and see for yourself.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Amazing. I read this book for my AP comp. class(independant reading) and was swept away by Dilliard'simagery. She not only describes elaborate pictures of theinterworkings of life, but paints pictures with words ofemotion. She basis this book on the tragedy of a littlegirl, who was in an airplane crash--her personal torment athearing about this helpless little girl, is expressed throughout the book andfills the reader with a sense of pure and exposed emotions.Raw. This book is no novel, but the length should not foolyou--each page is packed with amazing analogies,metaphors, and awesome syntax. Each sentence is so wellconstructed, that whole paragraphs leave the reader tinglingfrom description, and epiphanies. I would recommend thisbook to anyone who was willing to try to see a differentview of life. Especially if you question people's thoughtsand societies norms and general beliefs--throughout thisDilliard ponders the existance of God. And anyone who lovesNature should definately look into this!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "400 musthave words for the toefl",
        "description": "For students whose first language is not English and who wish to study at a university with an English-based curriculum, no admittance test is more important than the Test of English as a Foreign Language (TOEFL). 400 Must-Have Words for the TOEFL helps you score well by arming you with the most important English vocabulary words commonly found on this crucial exam. This timely guide also encompasses the recent changes made to the test, including the emphasis on conversation and spontaneous communication to mirror the interactive nature of the classroom. 400 Must-Have Words for the TOEFL also includes: Activities such as paraphrasing, synonym and antonym exercises, and identifying prefixes and suffixes Strategies on how to incorporate new words into everyday vocabulary Chapters on identifying synonyms and paraphrasing sentences, roots, prefixes, and suffixes",
        "authors": "['Lynn Stafford-Yilmaz', 'Lawrence Zwier']",
        "infoLink": "http://books.google.com/books?id=PAOQqiPrbHsC&dq=400+Must-Have+Words+for+the+TOEFL&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "This book does offer a nice variety of academic vocabulary. The fact that it is not only organized by academic discipline, but also by theme is a real bonus since iBT TOEFL draws topics from various disciplines. It also provides grammar and usage in the context of a text. This allows the learner to experience the \"target words\" in context. It's well done.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "As soon as I received this book, I put together a proposal to develop 40 lesson plans, using these activities as a base for the plans. It made me look good and my boss gave me a promotion and a $2/hour raise in pay. (It may sound a bit unbelievable, but it's absolutely true!). Students really appreciate these lessons too. I highly recommend this valuable resource!",
                "review/helpfulness": "13/21",
                "num_reviews": 21
            },
            {
                "review/text": "I am a professional English teacher, and have used this book with two of my students who are preparing for the TOEFL. The level of the book is kind of upper-intermediate, and the 400 words are quite useful, and your students will encounter many of them again later when they take the real TOEFL. The headwords are explained well and become even more understandable after reading the example sentences. Also, different parts of speech are given.Sometimes it seems to me that some of the example sentences which are used to illustrate the words' use require either having lived in the US for some time (\"As usual, their holidays were ruined when their in-laws' views on politics collided with their own.\"- In my experience not many foreign students know about the US tradition of arguing about politics during Thanksgiving and Christmas), or heavy use of a dictionary (\"Before injecting a painkiller, the dentist rubbed CLOVES on a woman's GUMS to NUMB them.\"- I don't think things should be dumbed down, but these kinds of sentences limit the usefulness of the book for self-study), or simply a teacher to stand there and explain to you the context behind such sentences. Another nice thing is that the units are short- in self study, you could go through a unit in 35 minutes and learn 10 new words with good example sentences.To sum up, it is a good introduction to the kind of words you will see on the TOEFL if your level is not quite enough to independently sit down and start with practice tests, but is no substitute for the practice tests themselves. If your level is high enough, you may want to just take the bull by the horns.I hate to close with a complaint, but the cover of the book proclaims that there is a complete review of roots, prefixes, suffixes and more, and there is no such thing in this book. For that reason I subtract one star, and give this book a three.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is a very nice book for studying for the TOEFL. I agree that the 400 words that are listed in this book are must-have words for preparing for the TOEFL. But there are two things this book lacks. First, there are only one or two example sentences per each words. Secondly, there is not much practice problems. These two shortages make what's in the book so simple. To describe this book in two words: Too Simple.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "You should get this book, if you want to get successful in toefl.. It is nice.. Besides that, Barrons Essential Toefl Words book is very nice also, you should at least study this two books. But I never recomend Kaplan Vocabulary book(sthng like this)..",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "creole made easy",
        "description": "Two CD set pronunciation practice guide accompanies the book Creole Made Easy. Ideal for students of the Creole language, newcomers, and visitors to Haiti. The CD set covers: How to pronounce Creole letters and words, the basic elements of Creole grammar, sixteen easy 15-20 minute lessons, and easy practice exercises in English with Creole translation. The Creole words and sentences in each of the sixteen lessons of the book Creole Made Easy are spoken so that the student may listen and practice. The Creole words and phrases are first spoken slowly and deliberately for maximum pronunciation emphasis. They are then repeated at a slow speaking pace with slight inflection for better contextual practice.",
        "authors": "['Wally Turnbull']",
        "infoLink": "http://books.google.nl/books?id=tBqNPAAACAAJ&dq=Creole+Made+Easy&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is not appropriate for learning Haitian Kreyol on your own - it's some way between a phrase book and a useful reference on the more important grammar. What's really good about it is the glossary, more like a small dictionary, which is more than enough for most everyday purposes, including a little on computers etc.I'd say this book is best for someone visiting Haiti for more than a holiday and ready to put in more work - useful for phrases/terms and explanation when faced with a grammatical construct not obvious from listening.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "I am a student of Haitian Creole, and I found this book to be an excellent supplement to a course or other methods of study. It has an extensive glossary and easy to follow lessons. The only thing is book is missing is a phonetic pronounciation key. Other than that, this book will definitely help beginning speakers of this language.",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "&quot;Creole Made Easy&quot; gives the reader every day words and sentences. I keep this book with me while at work either in the office or field in order to get a better understanding of what is happening around me. It gives you a base that you can start to &quot;speak creole&quot; the same day you pick it up.However by learning these simple 16 steps and using them each day in some sort of converstion with the Haitian people, you can start to pick up on the meanings and uses that each word has. For example, most commonly used to refer to a person, place, or it, is li. This is spelled out and used in the first lesson.I will say that one of the most important thing to remember to learn is tann isit, wait here, this will help you out when you want your cab (top-top), to wait for you while you are either shopping or asking information.The dictionary in back of the book helps to explain different words and give you an idea of the English to Creole-Creole to English explaination.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I found this a very useful book to get an idea what Creole is all about. It is short and simple and each chapter makes you more eager to go on to the next. I had the advantage to have learned French in school. Without that I imagine it can be difficult to get an idea how the Creole words should be pronounced. A simple audio tape in addition to the textbook would be most welcome indeed.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Great book. A lot is covered in the 16 lessons, nice exercises to practice. The dictionary at the back is quite extensive and covers most of the words that I've wanted to look up, including some basic medical terms that I found lacking in other small dictionaries.If you get the pronounciation guide as well, you won't have spent much and you will be much further along in your quest to learn creole. I rarely have to call for a translator now when dealing with my patients.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I recently took a trip to Haiti, and in preparation for the trip I used the Creole Made Easy materials, including the Pronunciation Guide cd, and the Workbook. I used all three of them together, so I'll review them together as well.Creole Made Easy is an excellent introduction to the Haitian Creole language. It provides the basic building blocks in terms of grammar and sentence structure from which to go further. This book is not an \"emergency Creole\" book, and didn't have anything by way of greetings, phrases to use while traveling, etc. Being in Haiti, those things were very easy to pick up, especially with some of the basic grammar under my belt. The Workbook is split into two sections, the first with exercises that correspond to each of the 16 lessons in Creole Made Easy. The second half of the workbook has more practical lessons like: numbers/time, months/days/seasons/weather, colors, family/friends, marketplace/food, around the house, and health and medicine. Indispensable to learning any foreign language is listening to it, and the Pronunciation Guide cd was excellent in that regard. I found that it was great practice for listening to the native speakers (though even then, I was listening too slowly most of the time) and great for understanding how to pronounce all of those nasal sounds. There were a couple of moments of frustration in using Creole Made Easy: there were a couple of misspellings; sometimes a word or phrase was used seemingly out of nowhere and wasn't listed in the mini-dictionary in the back of the book; a couple times a grammatical structure or phrasing was used and I had no idea why it was used that way, and it wasn't explained. This happened very few times, and can sometimes be a good problem-solving exercise that you need good practice for when trying to have actual conversations with Haitian people.Of the eight people who went with me on my trip to Haiti, I was one of two who used Creole Made Easy, and the only one who completed all 16 lessons. I think some of the others used the Pimsleur cds (not any books). I was by far the best Creole speaker/listener and felt like I was in a perfect position to learn exponentially more while I was there. I was told over and over again \"ou pale Creole byen!\" (\"you speak Creole well!\") which I shrugged off for awhile until it began to sink in that this was true. Also, I wish I would have brought Creole Made Easy along with me instead of the Hippocrene Haitian Creole/English dictionary, because I think the dictionary in the back had a better selection of words and phrases I wanted to say. The Hippocrene has no phrases at all, and often didn't have the words I was looking for. All this said, I would strongly recommend the Creole Made Easy materials to anyone interested in learning Haitian Creole.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have taken a face to face course in Haitian Kreyol and this book was an excellent supplement to it. Anyone could use this book and learn to speak Kreyol quickly. The glossary is in depth and includes all the most often used words and the lessons are easy to follow and do.An excellent book!!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "It is the only Haitian Creole translation book that I have found which makes sense of this difficult language. I would recomend to anyone who wants to learn casual Creole in preparation for travel to Haiti or while there.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I just purchased the new edition of Creole Made Easy by Wally Turnbull. I must congratulate him for a job well done. The extensive dictionary is super and certainly long overdue for speaking Creole as a second language. I was tutored in Creole with the old 1945 book, the only one available when my husband and I went to Haiti 15 years ago. It is my humble recommendation that all new non-Creole speaking missionaries MUST have this book to get started on their road to learning the language. Bravo!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Haitian Creole is a fun language, especially if you know French and can see the correspondences. However, you'd be best served getting the entire package - this book plus the CD and the workbook. The workbook provides an excellent expansion on the meager detail in the book. No where does any of the books provide a section on greetings - these have to be gleaned from the dialogues (Bonjou, etc.). I guess that's what the Hippocrene phrasebook is for. Otherwise, it's a fun set of books that will give you the base you'll need if going to Haiti (or Miami) and want to start communicating in Kreyol.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the language of letting go",
        "description": "Concentrating on self-esteem and acceptance, this book offers meditations for men and women recovering from codependency and aids them in their attempt to gain control of their lives",
        "authors": "['Melody Beattie']",
        "infoLink": "http://books.google.nl/books?id=2njoCQAAQBAJ&dq=The+Language+of+Letting+Go&hl=&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": 16.0,
        "review": [
            {
                "review/text": "I had just read Ms. Beattie's famous/infamous \"Codependent No More\" and was inspired by her revolutionary ideas: I didn't have to depend on others for approval; I didn't have to base my self-worth on how helpful I was to friends; I didn't have to over-react to everything that happened in my life; I didn't have to think negatively about myself; if I didn't cause the problem then it wasn't my responsibility to fix it.As a teenager about to enter the \"real world,\" it seemed all I heard from others was what I was \"not\" doing right. I should know more than I did and be more grateful for what I have; what college did I want to attend? Why wasn't I more ambitious? What's more, I was odd for being frightened by the fact that the world as I knew it was about to fall apart when all my friends moved away to college. Apparently, if what teachers told me was any indication, life would only get more difficult as I took on the responsibilities of being an adult. Melody's book gave me something that I so desperately needed and could find nowhere else: compassion.\"Codependent No More\" was so comforting that I wanted to \"live\" in its pages. I felt I had entered a new world, and I didn't want to leave. I wanted a way to remember everything I had learned from Melody Beattie about \"owning my power\" and being compassionate with myself. I wanted a way to \"stay on track.\" I wanted a \"guide,\" something of a daily ritual to keep myself mindful of the liberation she had introduced me to. To that end, I sent Melody Beattie a letter thanking her for her work and asking if she knew anything about \"Codependents Anonymous\" groups. I was honored to receive a reply, and she directed me to the national headquarters for CoDA. I began to go to the meetings at the now closed \"Journey's Bookstore\" in Beaverton, Oregon, and that is where I found this book, \"The Language of Letting Go\". These meditations helped keep me focused on what I had learned, and the meetings allowed me to share what I had learned. And this all enabled me to do what I had wanted: \"live\" in the pages of Melody's compassion.Melody is a poet. These meditations are not \"scientific\" or technical, and they are not even really \"meditations\" per se - they are more daily reminders, notes from Melody, on how to find happiness within oneself, and how to be compassionate with oneself when such happiness seems impossible. There is no \"fancy\" language that will necessitate a dictionary, and no unattainable goals are suggested. There are no come-ons to suggest that your life will not be complete unless you buy her other books. These meditations feel like letters from a friend, a friend who enjoys her life and is happy to share her personal insights and situations she has learned from; that is one of the most enjoyable things about this book, the personal stories Melody shares. There is no \"finger pointing\" in this book. I very faithfully read one meditation per day during the remainder of my last year of High School, and it made life bearable and gave me hope that things would get better (they did). The underlying message of this book could be: breathe, smile, relax, let go.If you are looking for a structured way to practice what you have learned from Melody's other books, I would recommend these meditations.",
                "review/helpfulness": "232/239",
                "num_reviews": 239
            },
            {
                "review/text": "I had been thinking about buying a book on this topic for some time to further my self improvement process.This book is about so much more than letting go. It is also about personal power. When you let go of something, it loses its power to control you, and you move forward with your life in a more empowering way.This book is set up with daily meditations on different issues. If you were to open any page at random, you would probably find something very useful. It is easily read, and as you read can feel the shift in your perception, as these simple to follow principles make a lot of sense.If you are like most people, there are plenty of things you need to let go of, and you probably have no idea what some of these are. The first step is to identify that a change needs to be made.Here are many ideas you can use to improve your life. There are too many for me to list in a review, but here are a few biggies:Attachment, guilt, blame, seeking appoval, codependency, fear, doubt, controlling, family issues, perfection, martyrdom, denial, grief, anger, victimhood.You replace these non serving beliefs with something more empowering, as you start to practice detachment, self approval, develop an abundance mentality, an attitude of gratitude etc.There is a principle in psychology that if you do what you have always done, you will get what you have always gotten.So,let go and move forward. Imagine how pleased you will be when you have made a lasting change in your life. All lasting changes in your outer reality are accompanied by changes in internal perception.I highly recommend this book.",
                "review/helpfulness": "107/107",
                "num_reviews": 107
            },
            {
                "review/text": "I'll admit it -- I read this book through a crisis and a time of life that saw transitions everywhere. And while I'm still reeling from pain, and disbelief of the events that have happened to me in the past few years, I am already so much better from reading this book.When I find myself tempted by defeating behaviors, reading one passage reminds me why I don't want to continue down that road any longer.The funny thing is, I never saw myself as a codependent or as an addictive person. It doesn't matter what type of turmoil you're going through -- this book WILL remind you of a better way of life.It truly is a lifeline. I keep a copy at work and am discovering I'll need one at home to. If you struggle with any type of negativity, this book can help remind you that it's really going to be okay.",
                "review/helpfulness": "98/98",
                "num_reviews": 98
            },
            {
                "review/text": "This book of meditations gives you inspirational thoughts to begin your day with. A must read for anyone dealing with codependancy issues. In her words, Melody Beattie gives me a spoonful of wisdom every morning; a tonic to support me all day! For those busy people who don't have time: Slow down, relax, and take 5 minutes a day to do yourself some good!",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "I bought &quot;The Language of Letting Go&quot; when facing major loss, thinking it was a book about handling grief. It was one of the best mistakes I ever made. I am more grateful for this single volume than for my entire library of 3,000 other books, and daily experience more benefit.Melody Beattie's book of meditations is a guidebook for life. It's about holding on to what is meaningful, and letting go of that which can only continue to hurt us. The meditations, one for each day of the year, seem to be divinely inspired.No matter what pain you feel, these meditations are a healing balm for a wounded heart. Melody Beattie's clear and simple writing addresses the difficulties of living, loving, caring, surviving, being gentle with one's self, making mistakes, learning to detach with love, and finding balance.During a year in which I experienced major loss, and mounting stress, caring for several family members with major illness, and coping with my own, &quot;The Language of Letting Go&quot; was my lifeline. This book helped me regain a sense of perspective. In times of great despair, it has been a lifeline.Imagine reading one book for five minutes each morning or night, and literally having it change your life for the better. This is that book. &quot;Language of Letting Go&quot; is clearly written, accessible, and direct. I recommend it to anyone experiencing pain, confusion, despair, depression, loss, anger, frustration, and grief. It will help you find your way.A personal aside to anyone put off by use of the word &quot;God&quot; in books about recovery. For many of us, the word &quot;God&quot; was used to shame us as children, when hearing it or seeing it, we still cringe. A fixed belief in the limited view of God we received in childhood is not necessary to understand and benefit from the meditations. I use a phrase that has meaning and relevance for me: wherever a book says &quot;God&quot;, I use &quot;The Assembly of Higher Powers as I Understand Them&quot;.&quot;Language of Letting Go&quot; is appropriate reading for anyone desiring greater clarity of thought. I suggest that you will rediscover yourself within its covers, being loved, and recovering long-lost hope. This book can help you find peace of mind, and restore your courage to face each new day.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "I have owned a copy of 'The Language of Letting Go' since its original publication in 1996 and am still finding it useful and pertinent to my daily living. I bought the book at a time when I needed some guidance and this book provided this and more. It has allowed me to understand that what I feel is both normal and natural and that I should not deny emotions and thoughts that inevitably surface.I have suffered from post-viral depression, stress from studying, loneliness and yes, co-dependency. Melody Beattie, in this book has helped me to realise that I shouldn't try to push my fears and needy emotions aside. Rather I have come to realise I should just let the feelings go, and realise I can't control everything in my life.I am still using the book, not everyday but when I feel I need to. Inevitably I find what I need in each daily meditation. This has always been a daily tonic to me.Recently I lent my book to a good friend who is going through a very rough time - She was involved in a bad car accident she was told she should have died in. Since that time she has suffered from an eating disorder and has tried to push her closest friends and family away from her, afraid that she could hurt us with her pain. I know this book has helped her enormously, she told me so. Now I'm buying one for her. I think this is probably the best gift I could give her.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "If I could only have one book throughout my life, this would be the book I would choose because it has made me feel so good! I was given this daily meditation book by a friend in 1992 and it is the first book I have ever read EVERY day! No book has ever made me feel so good about being me. The short, daily meditations lift my spirits and let my heart soar. They have let me enjoy being just who I am and loving it. Most of us deny our true feelings and supress who we really are. This delightfully written book reassures us that our feelings were designed by God and are o.k. to feel. When God gives us a feeling, it is his way of preparing us to have that need met. This book helps your spirit soar and helps you become the person God intended you to be.I give this book as graduation, birthday, and anniversary gifts to those special people I love. I am now ordering another copy for me, too, as I have worn mine out from reading a short meditation every day that always makes me feel better! The author may not be an angel, but she definitely has connections that will touch your heart and soul!",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "I found this book not long after joining Al-Anon and establishing a daily devotional time. I was stuck in a long term emotionally abusive relationship and attempting to escape it. The Language of Letting Go showed me I deserved to be happy. It gave me so much hope for a better future. I still read it daily, its my bible. Thanks Melodie, this book helped me create a life!",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "Melody Beattie's book &quot;The Language Of Letting Go&quot; is a tender caring work of art.Gently she speaks to the spirit inside of us and lets us know that it is ok to be ourselves.Something most of us are not use to doing, something we need to be allowed to do.Her words are those of one who has tasted of the emotions that she shares and her advise is like sweet honey to the reader.Sometimes what we need is just someone to say, it's ok to be you! The author does this and more.A very well written meditation book that will soothe many that read the words between the covers of this work.Recommended!",
                "review/helpfulness": "15/19",
                "num_reviews": 19
            },
            {
                "review/text": "Hello All,I bought this book on the advice of a 27yr veteran in Alanon. I've never regretted purchasing this book. The readings are insightful, and go hand in hand with another great read &quot;The Courage To Change&quot;. I've yet to discover why Alanon has yet not recommended this book?! Trust me, this is one of the best daily readers you can get!I like this book so much, that I've given SEVERAL away as gifts to those that I love dearly. To this date, I've NEVER received a single complaint, only compliments on the depth and wisdom, of the words written by Melody Beatie. So, if you want a great daily reader, then I HIGHLY recommend this book. On yet another note, I just purchased &quot;More language Of Letting Go&quot; so, as soon as I've read a bit of it, I'll post my comments here.Ciao All!!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "barrons how to prepare for the ap human geography advanced placement examination",
        "description": "A study guide for the Advanced Placement exam in human geography that provides subject reviews, two full-length practice tests, detailed answer explanations, a diagnostic test to identify strengths and weaknesses, and a CD-ROM with two additional practice tests.",
        "authors": "['Meredith Marsh', 'Peter S. Alagona', 'Meredith Marsh Ph D']",
        "infoLink": "http://books.google.com/books?id=zGAejgEACAAJ&dq=Barron%27s+How+to+Prepare+for+the+AP+Human+Geography+Advanced+Placement+Examination&hl=&source=gbs_api",
        "categories": "['Advanced placement programs (Education)']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "This Human Geography book is pretty good, the only problem is if u read this from front to back, the best u can get is a 3. For me, I got a 4, because I bought other study guides, and studied from the released exam.The Test is not very difficult but there are many random questions about language and religion and geography, so beware because it is very difficult, in my opinion to get a 5.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I used this book in my class, and like many people here had a poor teacher, used the Rubenstein textbook, etc.. This book covers the material well, and while I am bound not to talk about any AP Test Multiple Choice questions, I will say that the questions in the review portion of this book may or may not be *very* similar to questions that may or may not be on the test.In other words, it's a good book to have. I got a five, probably because I used this book.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is the sole reason I got a 4 on the test. I read through only half of the book because I ran out of time. After the test I went back and looked through the book for answers and every question I remembered was somewhere in the book. Even some diagrams were exactly the same as on the test. This book is a must-buy for anyone taking the test.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is a great resource to use for the AP Human Geography Exam, and I also used it to coincide with the rest of the course. Our AP Human teacher was pretty pathetic, just about all he did was check his email all period, so I decided to take matters into my own hands and got this book. Well, did this change things or what. I realized I wasn't really even grasping the subjects, and gained a lot of useful information taking the practice tests and such. As a matter of fact, one of the questions on the test last year was in this book and I remembered it when I saw it! What a coincidence. Well, if you are debating on which book to get (there aren't many choices for this young subject) or whether to get it at all, I think it's worth it, I barely understood the material at first and I ended up with a 4.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a wonderful study guide. I hardly paid attention in class the whole year. Nor did I keep up with the reading. The weekend before the AP Exam, I read this book and did all the practice questions and essays. I ended up getting a 5 (the highest grade possible)! This book works miracles! Highly recommended.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Again I would have to agree with Riaz that this book is all you need for the exam. Seriously I didnt even take the class and read this book the night before the exam and made a 5. The vocab is very important to memorize as many of the essay questions will be based off of it. For that reason I would get the Barrons book for an easy 5.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I used this book as an extra preperation tool for the 2005 AP test. I was immediately amazed by the vast amount of vocabulary terms and I love the mini quizzes at the end of the chapters. I began using this book about 5 weeks prior to the test and guess what, I got a 5! This book is a great investment if you wish to really succeed on the AP test. You just need to study it thoroughly and be familiar with all the vocabulary and you should do great!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ap english language and composition 2004 edition an apex learning guide kaplan ap english language composition",
        "description": "Reviews the types of reading selections, reading techniques, and writing techniques, and provides test taking-strategies, practice questions, and three full length practice exams.",
        "authors": "['Stephen P. Burby']",
        "infoLink": "http://books.google.com/books?id=M3LA9IdTdpkC&dq=AP+English+Language+and+Composition,+2004+Edition:+An+Apex+Learning+Guide+(Kaplan+AP+English+Language&hl=&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you're interested in succeeding on the AP English exam then this book isn't the way to go. I took the exam last week and I can conclude from my newfound knowledge of the exam that if you have common sense, you can do the multiple choice section. The free response section, however, requires practice throughout the school year-if you have a good teacher then you have nothing to be worried about. The literary terms in the Apex book are out of this world-I'm serious too. Sorry, but I didn't see buildungsroman on the test. I can suggest the Cliff's notes book though (I didn't buy it but my teacher had it and they have a great literary terms list). I will give this book praise where praise is due: it has three practice tests-but you can get them free from your teacher. My final wise words of advice are-if you're going to study, start in late March at the very latest.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "\"AP English Language & Composition: An Apex Learning Guide\" is a multi-level course text, which transforms newcomers into intermediates in a very short time. Its syllabus is such that home-users would have little or no problems getting around it.The book is articulate; and combined modern communicative techniques with a thorough step-by-step coverage of grammar, Comprehension, and Composition. It makes learning joyful!Just like students, any teacher who relies on this book would value its broad coverage. It is very straightforward.Its good organization means that teachers who use it, could design lessons (and similar activities) with great ease. This book will suit anybody who is interested in improving his or her writing skills.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "colloquial hindi 2e the complete course for beginners colloquial series",
        "description": "Colloquial Hindi: The Complete Course for Beginners has been carefully developed by an experienced teacher to provide a step-by-step course to Hindi as it is written and spoken today. Combining a clear, practical and accessible style with a methodical and thorough treatment of the language, it equips learners with the essential skills needed to communicate confidently and effectively in Hindi in a broad range of situations. No prior knowledge of the language is required. Colloquial Hindi is exceptional; each unit presents a wealth of grammatical points that are reinforced with a wide range of exercises for regular practice. A full answer key, a grammar summary, bilingual glossaries and English translations of dialogues can be found at the back as well as useful vocabulary lists throughout. Key features include: A clear, user-friendly format designed to help learners progressively build up their speaking, listening, reading and writing skills Jargon-free, succinct and clearly structured explanations of grammar An extensive range of focused and dynamic supportive exercises Realistic and entertaining dialogues covering a broad variety of narrative situations Helpful cultural points An overview of the sounds of Hindi Balanced, comprehensive and rewarding, Colloquial Hindi is an indispensable resource both for independent learners and students taking courses in Hindi. Audio material to accompany the course is available to download free in MP3 format from www.routledge.com/cw/colloquials. Recorded by native speakers, the audio material features the dialogues and texts from the book and will help develop your listening and pronunciation skills.",
        "authors": "['Tej K Bhatia']",
        "infoLink": "https://play.google.com/store/books/details?id=ML1gCgAAQBAJ&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have been learning hindi for the past two years, and I have been using many books in the process, including Snell and Weightman, an older book by Misra and Fairbanks, another book by Surendra Gambhir, and this one by Bhatia. For those starting from scratch, this book is the best option.Snell and Weightman move way too fast and you quickly find yourself in way over your head (unless you already have a background in hindi). I found this Bhatia's romanization excellent because it emphasized the difference between english and hindi sounds, and most importantly, Bhatia was consistent throughout (though hopefully some of the typos towards the end will be fixed in a future edition). His pronounciation introduction is also the best I've seen as far as emphasizing and drilling Hindi vocal nuances. The pacing of the book is very comfortable for the complete beginner.Bhatia also does not take anything for granted. A lot of important questions left unanswered by other books are treated thoroughly in this text (like the compound use of &quot;lena&quot;, &quot;jaana&quot;, and &quot;dena&quot;; the frequent ommision of the &quot;a&quot; sound in the middle of words; and the fact that words like &quot;mahal&quot; and &quot;kahana&quot; are pronounced &quot;mehel&quot; and &quot;kehena&quot;; just to name a few...) You are really able to digest everything as you go along. Bhatia's word list and grammatical summary in the back are god-sends, and his mnemonics like &quot;nerd nouns&quot; and &quot;laal adjectives&quot; are clever and effective. He also puts his lessons in a cultural perspective that is crucial for using your hindi socially.One criticism I would make is the lack of emphasis on the devanagri script. If you use this book, you should really take the initiative and learn the script. It will help you as you progress to more advanced books.It seems like the few who gave this book a bad wrap are educators who are used to hindi being taught in a certain way. I think the things that make this book different also make it the best.My recommendation is start out with this book, then go through Snell and Weightman, using the early lessons as review, then go through Surendra Gambhir's pricey but excellent &quot;Spoken Hindi&quot; set. All these books have their lessons on cassette. I transferred all the lessons to CD, which made my studying much more efficient. Also get McGregor's beautiful Hindi-English Dictionary which will be a cozy campanion throughout. If you can even find the Misra and Fairbanks book, don't bother. It is quite antiquated and impractical, and the tapes are a nightmare. Happy studying!",
                "review/helpfulness": "142/144",
                "num_reviews": 144
            },
            {
                "review/text": "This book is clear and comprehensive, yet simple enough for a complete beginner. The reader can choose to learn just spoken Hindi or to also learn to read and write since all of the dialogs are written in romanized Hindi as well as in the Devanagari syllabary. The cassettes are necessary, but poor compared to the cassettes from other courses. The dialogs are read only once, very quickly, with almost no opportunity to practice repeating what you hear. The leftover space on the tapes are filled with discussion in English of questionable utility.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I actually looked forward to receiving this book. As English is my native tongue, and I had studied French/Japanese at school, I was looking for an easy book that would teach me the hindi alphabet and provide me with some easily referenceable vocabulary. Whilst this book provides some assistance on both, I didn't find the layout to be very useful. I would have also preferred more attention on how to write the characters.I'd still recommend this book, but a little more visual assistance (the book is a bit dry, as it is predominantly textual) would have enhanced my learning speed, as well as more romanization of hindi words, especially for beginners such as myself.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book uses one of the weirdest romanization schemes I've ever seen. In addition, it uses this scheme throughout, making learning the Devanagari script more difficult. The grammatical explanations ramble a lot and the vocabulary words tend to be unrelated to each other. This is one of the worst self-taught Hindi courses out there.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "As an indian wanting to learn my mother tongue, this course is amazing!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is clear and comprehensive, yet simple enough for a complete beginner. The reader can choose to learn just spoken Hindi or to also learn to read and write since all of the dialogs are written in romanized Hindi as well as in the Devanagari syllabary. The cassettes are necessary, but poor compared to the cassettes from other courses. The dialogs are read only once, very quickly, with almost no opportunity to practice repeating what you hear. The leftover space on the tapes are filled with discussion in English of questionable utility.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "If you have been learning Hindi by the Pimsleur language system, you may have wanted a book to answer your questions. This is the book. It is excellent. However, if you plan to use the book and tapes or CD's to learn to speak Hindi, it is lacking. The best of worlds would combine the two into a single system.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "If you are looking into learning Hindi, this book is super duper detailed. I was looking for something that was more conversational Hindi, and what i got was something that was way more than i bargained for, in turn, turning me off to the entire thing. This book is for those who really want to learn hindi inside out upside down.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Although it's a great intro with lively discussions and a great deal of vocabulary is introduced and incorporated, it's not all toghether \"the\" best primer available, especially since it lacks heavily in regards to verbs, conjugations, and other aspects. It's GREAT for complete beginners, but a speaker with some working knowledge may find it a tad bit unchallenging.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a certification test prep kit doswindows exam",
        "description": "Exam expert Ted Chandler provides an exclusive insider's point of view on exam content and test-taking strategies for the Core Module portion of the A+ exam. The CD-ROM includes interactive exam aid software from Beachfront Quizzer to simulate the actual test.",
        "authors": "['Ted Chandler']",
        "infoLink": "http://books.google.nl/books?id=Xb5E-1U8EHgC&dq=A++Certification+Test+Prep+Kit,+DOS/Windows+Exam&hl=&source=gbs_api",
        "categories": "['Computers']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am an entry level technician that had to get certified very quickly in order to secure a promotion. I studied for about three months from two other books and a practice test book and was still completely bewildered by the A+ DOS Windows exam. This book really brought things together. (I only wish I'd bought it first!) The books that I WAS studying from -and almost every other book that I saw- really disappointed when it came time to cover DOS/Windows and rightly so, I guess. Its much less intuitive to instruct a novice on the intangibles like win.com, system.ini. WHAT?Anyways, this book came through wonderfully in its focus on the hot topics as well as the detail. And it did so without reading like an encyclopedia. My only complaint: The cd-rom sample test software from Beachfront Quizzer (which is a great tool) simply didn't have enough questions. But then, they want to make money too.Oh yeah, another great feature: The WHOLE book comes in Adobe Acrobat format on the CD-ROM! VERY HANDY!Mr. Chandler: Please write a book or two on Novell certification. That's next.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "it is an excellent book for both the beginners and also for the detailed technician. Really i got much more benefits by reading this book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I started with the ALL-IN-ONE, M MEYERS book but only got half way. It is a good reference book but Too much information . I got the A+ Certification by IDG and studied it for five days along with Some test questions downloaded from the net and passed both A+ exams. This book gives you what you need without putting you to sleep.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "...I bought this book and studied it cover to cover. BEWARE!! It hasa lot of typos and mistakes in it. Worst of all, very few of thequestions from the actual A+ Exam (DOS/WIN) were in this book. Imemorized every darn question in this book (probably 200 or so) andthen took the test. Only 1 question from this book was even on thetest!! It was only by the grace of God that I passed it. I had toguess at 75% of the questions and thought sure that I had failed.Luckily I hadn't (NO THANKS TO THIS BOOK). I don't know if the testhas had a major revision since this book went to press or what, butthis book will NOT give you an accurate indication of what to expecton the test. Believe me, I just took the test on October 13th, 2000and was shocked at how little this book prepared me for it. I don'tknow what book to recommend for a study help but I would not recommendthis book to anyone I like, that's for sure. I was really surprisedas a fair amount of people gave this book a good review at the Amazonsite. That must have been before the A+ test went to the&quot;adaptive&quot; format in July. On page XI of the Preface, thisbook states that it gives you &quot;...the closest experience to thereal thing (the test). If you achieve an 80 percent on the practiceexam (in the back of the book).... you're ready to take and aceCompTIA's DOS/Windows exam.&quot; ... I memorized every singlequestion this book has in it and could ace this books' tests time andtime again. Yet only 1 of the hundreds of questions in this book waseven on the exam! If you buy this book, don't blame me if you failthe test....",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The book was really easy to read and understand. I practiced the tests using the enclosed CD-ROM and was passing every test with 80%-90%. However, when I took the test so many questions seemed foreign. I barely passed with a 70%. I don't know if the test has been updated or the material in this book was outdated?",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This little book is an excellent guide for anyone trying to pass the DOS/Windows module of the A+ Examination. It is very concise and to the point, easy to read and moves quickly. Especially helpful are the practice quizzes on the CD-ROM, which provides actual exam simulations for standard and adaptive tests as well as interactive study sessions. The one caveat is that this is an exam PREP book, and would better be used as a final review tool than as a primary study manual. One would do better to use a meatier book for the actual studying and use this a final review tool. But an excellent book, one of the best certification manuals available.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Certification books on any subject need to cover each exam objective in order to useful. This book certainly covers each objective and give information that will enable you have the best possible chance to pass the A+ exam and start you down the road to technical success.Covering only the DOS/Windows exam, which is the harder of the two exams you need to pass in order to become A+ certified, the book goes over areas like basic and advanced DOS, basic and advanced Windows 3.x and Windows 95 and Windows 95 networking.The book is only 200 pages and you will need other resources to help in the study. IDG has another great book by Joseph Byrne that makes an excellent companion to this book. Well written and easy to follow pages makes this book a great learning tool.Once you finish the reading you can use the Beach Front Quiz software to practice the test before you take a live exam. The exam is updated for the new adaptive format and also gives a historical look to show your progress. A little on the pricey side, but you may be able to find it cheaper on line.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "cracking the ap biology exam 20062007 edition college test preparation",
        "description": "Provides information on more than three hundred undergraduate majors, including related fields, sample college curricula, suggested high school preparation courses, and career and salary prospects for graduates.",
        "authors": "['Princeton Review']",
        "infoLink": "http://books.google.nl/books?id=l3p15V-ZKYUC&dq=Cracking+the+AP+Biology+Exam,+2006-2007+Edition+(College+Test+Preparation)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "once again the princeton review proves to be the best way to study! to get a 5 all you need to do is read this book...it gives you the right amount for info you need in terms of knowledge for the aps, after that it's just logic and common sense. although the practice tests aren't very good(get actual collegboard tests to practice), absorbing most of the info in this book will get you a 5!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "so i don't actually own a 2006-2007 edition of TPR's Cracking the AP Bio Exam, but I did use last year's version, and, I have to say, it was awesome. The book included all the important concepts covered in the exam, and the way the book was written makes it interesting and even the more difficult concepts lucid. I ended up with a score of 5 for the AP Biology exam, and without this book I don't think I'd be able to achieve this score.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I had this in conjunction with Cliffs. Read first two chapters fell asleep. Too general, doesn't give you the details you need for a 5. Get cliffs and you'll be really prepared. This says less in a lot more words. It is garbage.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is extremely helpful; it is informative and has saved me from hours of excruciating and painful blundering I would hope to call studying. It is organized well and easy to understand, not only would I recommend this but all of the Princeton Review books I have read so far have been great!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book was the key for me in getting ready to take the AP Bio Exam. I realized that many questions in this book are exactly like the ones you encounter on the real test. It was like the Princeton Review people knew what exactly was going to be on the test I took beforehand. This is a must buy for acing the AP Bio Exam! Amazing book, which helped me alot.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I agree with everyone who says this review book is TRASH. Honestly, it has so little necessary information for the exam, that you could've just taken the exam without ever studying. I just thank God that I used a Barron's in conjunction with this book. The Barron's makes complicated concepts so easy that a caveman could understand them. Not only that, but it goes into detail and highlights key concepts that you'll need to know for the exam, unlike the Princeton Review. This book does have practice tests, which are always good to do, but that's about it. If I recall correctly, the book has about a page on the Immune system. A PAGE!!! Barron's on the other hand had around 10. Seriously, this book does close to nothing in giving information essential to doing well on the exam.So, to summarize everything I just said, Princeton Review is horrible and I'll never use another review book by them again, AND go with either a Barron's or Cliff's because they actually know what they're talking about and will prepare you for the exam.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "saunders comprehensive review for nclexpn book with cdrom for windows macintosh",
        "description": "\"Reflects the new 2010 test plan\"--P. [4] of cover.",
        "authors": "['Linda Anne Silvestri']",
        "infoLink": "http://books.google.com/books?id=fwYRc6SX9EwC&dq=Saunders+Comprehensive+Review+for+NCLEX-PN+(Book+with+CD-ROM+for+Windows&hl=&source=gbs_api",
        "categories": "['Medical']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I FOUND THE BOOK TO BE A GREAT HELP TO ME AND MY STUDY GROUP. I EVEN USED THE BOOK TO PREPARE FOR MY FINAL EXAM AND FOUND IT TO BE AN ESSENTIAL TOOL WHICH HELPED ME A GREAT DEAL. I CAN HONESTLY SAY THAT THIS IS ONE OF THE BEST BOOKS I HAVE SEEN OUT THERE IN REGARDS TO NCLEX BOOKS. THE DISK THAT COMES WITH THE BOOK IS ALSO GREAT, WITH 3000 QUESTIONS THAT HELP YOU PREPARE FOR THE BOARDS. I HIGHLY RECOMMEND THIS BOOK TO ALL LPN STUDENTS ITS WORTH GETTING YOU HAVE NOTHING TO LOSE WITH A MONEY BACK GUARANTEE.",
                "review/helpfulness": "42/42",
                "num_reviews": 42
            },
            {
                "review/text": "I have purchased two other review books for the NCLEX and I can say, without a doubt, this is the BEST! This book covers everything you need to know. There are practice tests with answers after each chapter so you can review what you have studied and determine if you feel confident enough to go on, or if you need some additional time on the subject. The CD is very beneficial as well. You can take quizes, study tests and even a 100 question exam. The exams are timed, so you learn to pace yourself for the \"real thing\". I cannot say enough how impressed I am with this study guide. If you are still a nursing student, this book can be a real asset when studying for exams as well!!",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "Believe me when I tell you that this is &quot;the&quot; guide to study for NCLEX. You will pass your boards if you make dedicated reading time from this book and practice with the test disc. It will also help you if you combine it early on with your nursing studies. No other study guide compares to this one, it is worth your money!",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is a good book, good informational sections like \"Care of client with a tube\" Book is outline form, with \"pyramid points\" that the publishers think are the crucial elements to understand. I would buuy this book again if I had to go through nursing school again, BUT! the CD crashes on me everytime I try to complete a long comprehensive exam, WHICH IS VERY FRUSTRATING! And my faulty CD isnt an isolated incident, a few other students have had the same problem. The Book gets 4 stars the CD gets 1 star because it crashes. If you want to pass your board buy this book, buy Mosby's Book by Mary O. Eyles, use both CDs, take a month off work, study full time and youre almost guaranteed to pass the NCLEX. BTW the Mosby's Book and CD are better than this book (ie no crashes) but this book has some good info the Mosby's doesnt. If you can buy only one book, buy the Mosby's.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "I was making C's on all my tests. After I purchased this book and read the rationales for the questions and the sample test questions my grades went to A's and B's. This is a great tool for Beginning LPN students!!!!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book was definately the book that did it for me. I have bought many books and nothing prepared me better than this book and complementary CD. I think you will be pleased at how confident you feel after reading and doing the exercises . It was easy to understand and easy to read a chapter a day . I not only found it easy but enjoyable because of the way the material was written .It also contained alot of test taking tips that really gave me confidence .Try it you will not be disapointed.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book is great for boards plus I also found it helpful for studying for tests during the school year. I love the way the book seperates the reviews into the different systems.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I purchased this CD/book a week before a comprehensive final exam. I used it three times and raised my exam score by 10%. It helped me see where I was needing to focus my attention for for studying for this test. I was having trouble with the difference between studying for an A&amp;P exam, vs an LPN exam, vs an RN exam. I seemed to always be studying {memorizing} the wrong stuff. This helped me raise my critical thinking skills. Highly recommended.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "This study guide was amazing! I have 3 different study guides to practice for my PN board exam, and this book is by far the best. This book covers every body system and offers over 3000 practice questions. This book also has a CD with all new questions for each of the chapters covered in the book, including practice quizes, study guide, and practice exams. This book is better than the one offered in Canada, and I would strongly suggest that anyone who has an upcoming exam in Canada or the U.S to buy this book.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "As a new nursing instructor - I found this book extremely helpful and informative. I have used the outlines as a guidance and I have used the exercises for critical thinking examples and practice in the classroom. I would highly recommend this book to any and all nurse educators.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the clep history of the united states i wcd rea the best test prep for the clep test preps",
        "description": "Get those CLEP college credits you deserve! Our CLEP test experts show you the way to master the exam and get the score that gets you college credit. This newly revised edition of the CLEP History of the United States I comes complete with 3 full-length practice exams and 2 computerized exams on CD-ROM. Each exam question is answered in thorough detail. The book's review covers from the Colonial Period to the Civil War and Reconstruction. Follow up your study with our proven tips and strategies. DETAILS - The definitive, easy-to-understand test prep for anyone seeking college credit with CLEP - Comprehensive review of every topic on the exam - 3 full-length practice exams. All answers are fully detailed with easy-to-follow, easy-to-grasp explanations. - Flexible, smart study guidelines - Packed with test tips & strategies to help you master the test - CD-ROM containing 2 computerized practice exams SYSTEM REQUIREMENTS Pentium 75 MHz; Windows 95 & up; 64MB RAM; 100MB hard-disk space",
        "authors": "['Research and Education Association']",
        "infoLink": "http://books.google.com/books?id=-R8KOUnk2voC&dq=The+CLEP+History+of+the+United+States+I+w/CD+(REA)+-+The+Best+Test+Prep+for+the+CLEP+(Test+Preps)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I used just this book to prep for the exam, I read the material once, took the first practice test, then re-read the material and took the second and third tests. I then reviewed the answers and took the test. This was my first ever CLEP test. Be your own judge however when studying, if you are a good test taker then this book should do it all for you, if not then supplement with other material. The book does a great job of covering the material. I scored a 72 on the test. Hope that helps.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "This book was key in my passing of the CLEP US History I exam. I read it from cover to cover and did the practice tests repeatedly until I got the answers correct.The only shortfall of the book is that it doesn't cover the \"antebellum\" period to the level that matches the exam.I suggest supplementing this book with instantcert.com flashcards and I also used sparknotes US History flashcards and timeline. In the end I found an old high school history textbook and used it to cement all the facts I had learned. Pay key attention to the order things happened and who intitiated certain acts and movements.Overall, this book is a must-have for prepping. I passed with a 69.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "For my RN-MSN program I needed to take 2 history courses ASAP. I had no desire to waste time sitting in a class room so I decided to try the CLEP exams. I took the US History exam yesterday. To be able to look at each test question and think \" My gosh I know this\" is a great feeling.This book was the basis of my preparation; used in conjunction with Barons EZ 101 American History to 1877 and America A Narrative History. The REA CLEP book covered some topics in more depth than others but when used with the other references , I was more than prepared. The best part of this book is the practice exams and the answer explanations. Some of the practice questions were on my actual CLEP exam word for word others were rephrased but still strongly resembled the practice questions . This book is worth every penny and I have already purchased the REA CLEP book for the Western Civilization test that I will take in 4 weeks. When time is of the essence, you will find this book to be an excellent investment in your success.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I just took the clep exam and passed with a 68. HOWEVER!!! before you get excited and buy this book I felt grossly unprepared based on the material in this book. It was much harder then the practice test would lead you to think. If I had not researched on my own I don't believe I would have passed.My study plan. ..(over a period of about 4 weeks)I simply read the book completely then took the first test and got a 51. studied the \"explanations\" built into the test and then took test 2 and got a 60. Then I decided to make flash cards for all the questions within test one and two until I knew all of them cold. Then took test three and made a 80. I made more flash cards from test three. Then I checked out of the library a documentary on the civil war, and one on slavery. After that, I learned all the presidents, and what they did during their term in office (outside of this book of course).What was on the test...When I walked in I felt ready, yet when I saw the first question I thought \"I'm in trouble.\" There were at least 10 questions about the \"antebellum\" period which is not covered in the book. There were 5-8 questions about Indian chiefs and what tribe they lead, and where they were in the US, and \"what was 'x' tribe leader famous for saying\". NOT one word in this book or on the three test about Indian chiefs. Several questions on women's rights at different periods. There were also a lot of questions about books, authors and social life during the pre-civil war time and pre-revolution period then I would have ever expected.while I was studying I kept notes on where I got the information in case I wanted to go back. All and all I would say that if you know the book and practices test answers cold (as I did) and studied nothing else you will probably just barely make a 50 if you guess really well, as I felt I did (you may even fail).It was the outside sources I believe give me the best prep. I specially could answer more questions from outside sources then from my prep within this book which is disappointing.I give it three stars because I learned some interesting things about US History and for only about 100 pages of reading it covers a good bit of material. However, as a prep for the CLEP History, I don't think this book cuts it. You will have to study other material if you want to pass. One person said they had questions from this CD that were the same as on the actual clep exam. I just took it and there was only one question (out of 120) that I felt was similar to any of the 360 questions I had memorized. I may have just taken a different test.My final advice... \"DON'T BET YOUR SCORE ON THIS BOOK ALONE! A text book is probably your best bet, or at a minimal study the test questions, be familiar with all the treaties, which states are slave and free, famous authors, and know every thing there is to know about the colonies before the revolution in 1775!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "How do you cover American History from the late 1400's to 1877 in about 120 pages? It's not possible to cover it all, and this book doesn't do that. But it does cover the high points and many items that are important in passing the CLEP exam. Much of the material covered was on the version of the CLEP that I got, and the material was covered in concise form.The only complaint I have about this book is that the language is sometimes difficult and laborious to read. I guess I would classify it as \"poor sentence structure.\" However, the material is there, and if you take your time reading it, you should get out of it what you need.The tests on the accompanying CD were probably the best thing about this book. They are spot on as far as being similar to the material you should see on the real CLEP, and the format is similar enough that you will feel right at home when you take the real thing.This book and the CD were my best weapon in passing this exam.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is very good for a concise review of AH if you're planning to CLEP the course for college credit. The CD-ROM is worth the extra money because it gives the feeling of the real test and it actually helps you with your studying.You should use the book material as a main guide and complent your weak areas with a college level textbook.Good Luck!Laz",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is all you need to pass this CLEP. I'm horrible with History and this is all I used to study. I read everything twice, took some notes, took the practice tests and read the explanations. I studied for 3 days (about 24 hours total) and did just fine on the test.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Some of the other REA CLEP studies are just ok. I bought this book and studied it 3 consecutive nights. Took the test. 66. I hadn't studied any history since high school. It worked ok for me. Dont sweat the test either, its easy.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book was a fairly good resource for passing the CLEP. They do recommend supplementing it with a textbook and I suggest you do so as well. The practice tests are great. They give a good feel for what the test is really like. Between this book and a supplemental review of a college text, you should be well prepared for the CLEP. I have used other REA books and although they have some obvious editing errors, they have all served as great resources for CLEPs, especially the practice tests.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I recently took the Clep for US History I after only studying for a few weeks with only this book, and received a passing score of 62. The book is well worth the purchase, saving time and money.I recommend reading through all the chapters once, and then just focusing on the practice tests and answer explanations.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "ap calculus ab rea the best test prep for the advanced placement exam advanced placement ap test preparation",
        "description": "Are You Serious About Scoring a 5 on Your Advanced Placement* exam? Then Get REA's Test Prep for the AP* Calculus AB & BC Exams with TestWare CD REA's Calculus AB & BC test prep gives you everything you need to score a 5 on the AP* exam! This second edition of our popular Advanced Placement* test prep is completely up-to-date and aligned with the official AP* Calculus AB & BC exams. The book contains a thorough review of all the areas covered on the AP* exams, including Limits & Continuity, Derivatives, Integrals, Sequences & Series, and Vector Valued Functions. Each review chapter is packed with equations, formulas, and examples with solutions, so you can study smarter and score a 5! The book contains eight practice tests - five practice tests for Calculus AB and three practice tests for Calculus BC. The practice tests are composed of every type of question that can be expected on the actual AP* Calculus AB & BC exams, so you can \"practice for real\" and target your strengths and weaknesses before the test. Three of the practice tests (two for AB and one for BC) are included on CD in a timed format with automatic, instant scoring and detailed explanations of answers. Our interactive TestWare CD features on-screen answers, diagnostic feedback, plus an extended time function for students with disabilities. Book comes complete with a handy study schedule for each exam, plus confidence-boosting test-taking strategies. If you're serious about getting a 5 on your exam, then you need REA's test prep for AP* Calculus AB & BC! REA has helped more than a million students succeed on their AP* exams! Teachers across the country consider our AP* titles to be invaluable resources and consistently recommend our books to their students.",
        "authors": "['Norman Levy']",
        "infoLink": "http://books.google.com/books?id=WQuzPwAACAAJ&dq=AP+Calculus+AB+(REA)+-+The+Best+Test+Prep+for+the+Advanced+Placement+Exam+(Advanced+Placement+(AP)+Test+Preparation)&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is an awful book. An entire year's worth of calculus is compressed into 50 pages. As a result of this, the material presented is utterly incomprehensible. No simple example problems are given: all of the test questions are extremely difficult. Don't expect to learn anything from this book. Avoid it like the plague.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Knowing AP Calculus AB would be a tough class and that the exam would be even harder, I bought this book before the first day of class. I anticipated using it as a quick reference throughout the year and for extensive review and practice as exam day neared.I looked through the review section a few times during the year but it wasn't helpful when I missed a lecture or when I didn't understand a homework problem. Quite simply, my class notes were a much better source.I left plenty of time to take all six practice exams included in this book-however, because the exams in this book were unhelpful, I ended up taking only one of them. The multiple-choice questions are much more difficult than they are on the actual exam. The answer choices for the non-calculator portions of the multiple-choice are in decimal form. I just took out my calculator for the last step of changing the exact answer to a decimal approximation. However, this seems like an obvious error that should never have been allowed to go to publication. It's typical of the quality of REA's &quot;best test prep&quot; series.The free-response questions are closer to free-response questions on the actual exam, but the free-response sections of the practice tests are not divided into calculator and non-calculator portions as they are on the actual exam. Besides, you can download real past AP Calculus AB free-response exam questions from the College Board's website for free, so I wouldn't recommend paying for the ones in this book.I found the practice exams in the Apex Learning and the Arco books much more helpful, so I recommend either of those instead of this one. Do not waste your money on this book.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "now youre talking all you need to get your ham radio technician license",
        "description": "All you need for your first amateur radio license.",
        "authors": "['American Radio Relay League']",
        "infoLink": "http://books.google.com/books?id=ygjlAAAAMAAJ&dq=Now+You%27re+Talking!:+All+You+Need+to+Get+Your+Ham+Radio+Technician+License&hl=&source=gbs_api",
        "categories": "['Amateur radio stations']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am an extra class ham radio operator and teach introduction to ham radio classes. I have found this book to be the best on the market for both in class use and individule study. It covers all the bases and explains everything in simple, easy to understand terms. It also contains all of the possible test questions so that you can practice taking the exam on your own. If you want to become a HAM then this is THE BOOK for you! 73",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is the best book to read to become a Ham! It has easy to follow chapters with test questions as you go. Just read the book do the questions and you will be a ham in no time!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I studied Now You're Talking for one week, and passed the Technician test in 10 minutes. (That's the Novice and Tech written tests.) It makes it so easy with help and tells which questions to study after each section.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I read this book and passed my exams with no problem and I'm only 13 years old. So if a 13 year old can understand this book anyone can.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book encouraged me to get into ham radio and took me all the way through getting my license. I am now a tech plus and will soon upgrade to a general. I reccomend this book to anyone who wants to join in on the hobby.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I got a perfect score on the Novice and the Technician exams, since this book contains all of the ACTUAL test questions. If you go through a chapter a day (which is what I did), you can be ready for the exams in 10 days.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is a great intro to the wonderful hobbie of Amateur Radio. A how-to book , with all the how-to's. As an Extra class Ham, this is the book I gave to my own son and daughter. They both have their call signs, and actually learned something. This is not a cheap study guide with the questions and answers only. Now You're Talking teaches the whys and what for. Good luck!! DE KK5VN",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "&quot;Now You're Talking!&quot; is an excellent reference book, which I recommend to all of my students. I use my own cartoon license manual, &quot;Ride the Airwaves with ALFA &amp; ZULU&quot;, to teach ham radio, but when a detailed explanation is needed for a topic, there is no other book as clearly written and illustrated as NYT!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is the only book you need to get your Novice, Technician or Technician Plus license. The format of this book is so that you learn what you need to and then are referenced to the actual pool of exam questions as you go along. Just follow the format, don't skip around and you will easily pass your FCC exam. I passed mine 100% and was finished before anyone else.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "There are thousands of people of all ages who have said, &quot;I'd like to get involved with amateur radio.&quot; It's just as easy as buying this book, reading it through and working through the self-test questions (the same ones you'll see on the FCC exam for Novice/Technican class licences). There's no magic, just this book and a small regular commitment of time over several weeks. With a technician licence you can talk with people in your local area. It's the first step toward a general licence and you'll be able to talk around the world.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "microsoft excel 97 exam cram",
        "description": "Microsoft''s Office User Specialist Program i s designed to help companies with the training and assessmen t of computer users. This is one in a series of books offeri ng advice on how to pass the exams for the various Microsoft applications. '",
        "authors": "['Trudi Reisner']",
        "infoLink": "http://books.google.com/books?id=ZiUBAAAACAAJ&dq=Microsoft+Excel+97+Exam+Cram&hl=&source=gbs_api",
        "categories": "['Computers']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I found this to be an indispensable assistant in passing the basic and advanced MOUS Excel 97 exams. The book shows you step-by-step all the skills you need to pass either of the tests. On the MCSE tests, you just need to know the answers to multiple choice questions, and that's what the Transcender material is designed to do. The MOUS tests don't work that way. You need to know how to complete each project. While the MCSE tests are basically multiple choice, the MOUS tests are project based. True, you don't get the exact questions you might see on the test, but anyone who passes the exams in the book shouldn't have any problems with the tests. It would be nice to have the exact projects that would show up on the test, but that would defeat the purpose of the test and make it worthless. For my money, this is a great book, and I would encourage users preparing for the MOUS Excel 97 exams to buy the book!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Just by browsing through the table of contents and then the Introduction pages, in the shop where I bought my copy of Trudi Reisner's Microsoft Excel 97 (Exam Cram), I knew this was the book I needed for my Mous Certification(Excel)Exams even though I still checked out other books. My decision to buy this book for my Excel Exam was not only because it had straight to the point notes and tasks to reinforce what I already knew but also because it had sample tests for which ever level test one was preparing for. The confirmation of my feeling towards this book came a few days ago when I passed my Proficiency level Exam with a score of 926. My only regret is that I did not go straight for the Expert Level Exams which this book would have been perfect for. But as with every new thing, there is some level of skeptisim. A few of my friends have already bought this book due my results on the exam. This is the book to buy and study for your Excel Mous Excel and I'll recommend this book to anyone and also to go straight for the Expert Level. You are sure to pass the Exams. Thanks not only to this book but also to it's Author Trudi Reisner.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is an excellent review for taking the Excel M.O.U.S. test! I received the book about a week ago, spent approximately two full days reading and doing the exercises, and passed the Excel Expert Exam with no problems. Material is very hands-on, easy to understand, and provides review exercises to reinforce learning.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Trudi Reisner does a great job covering just what you need to know for the Excel Expert or Specialist Exam--nothing more, nothing less. Quick tasks reinforce the lesson, and practice exercises and tests have detailed answers. Another 3-book set I used belabored unimportant and confusing extra details and failed to cover crucial topics.I had a couple of questions on the material, so I e-mailed Trudi (e-mail address included with book). She was great about getting back to me and answering my questions. This book gives good test-taking hints, a last-minute cram sheet, and a personal touch!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "american pageant ap test preperations 12th edition fast track to a 5",
        "description": "Keyed to the 12th and 13th editions of The American pageant, this book includes a diagnostic test, practice questions, full-length practice tests as well as graphs and tables to help students learn to analyze data.",
        "authors": "['Mark Epstein']",
        "infoLink": "http://books.google.com/books?id=9uJfAAAACAAJ&dq=American+Pageant+Ap+Test+Preperations+12th+Edition+(Fast+Track+to+a+5)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Epstein's magnificent test preparation book is the smart way to supplement your AP US History class. In fact, you can get a 5 on the exam if you work closely from this book alone. While the book is thorough, careful, concise, and neat, the author is articulate, clear, and humorous from time to time. THIS IS THE BEST!!! Mark Epstein rules!",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I just bought this book a month before the AP US history exam. It gives good practice for the DBQs and free response. IT is a must have. It got me a five on the exam and it might work for you too.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "elementary turkish dover language guides",
        "description": "Revised and edited by Norman Itzkowitz. Superb grammar and exercise book enables students to quickly recognize, understand and begin to use the basic patterns of modern Turkish. Full glossary.",
        "authors": "['Lewis Thomas']",
        "infoLink": "https://play.google.com/store/books/details?id=mfnLSsSsgTUC&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Almost 10 years ago I went to Turkey for the first time as an exchange student with the Rotary Club. I was living with a Turkish family and I was determined to learn the language. One day I met another American woman in Turkey who spoke fluent Turkish. She sent me home with this book and a few words of advice. &quot;Elementary Turkish&quot; is truly a classic in the world of Turkish language acquisition. The book proved to be extremely helpful to me, especially as it gave me grammatical categories for all of the words and phrases that I was learning from the Turks around me. Lewis Thomas understands the language well, and his book explains it in very readable, but challenging lessons. After receiving the book, I spent about an hour with it every day for around 3 months. It was an integral part of my Turkish language acquisition.Now as a fluent Turkish speaker, I use this book often to help train people who are going to Turkey, either long-term or short-term. In some of the vocabulary lists and colloquial expressions it is somewhat dated, but overall this short textbook is still the best. It is packed with helpful vocabulary and language lessons and exercises. It can be used either to study over a long period of time (as I did), or to peruse for vocabulary and basic grammar (as I have used it to train others).If you have no exposure to spoken Turkish, buy this book along with one of the many cassette tape courses available. If you plan on learning Turkish in Turkey, then this book is all you need.",
                "review/helpfulness": "66/66",
                "num_reviews": 66
            },
            {
                "review/text": "I've lived in Turkey for two years now and have a collection of books on Turkish. This one I would rate at the bottom of the list due to several things. 1) The Turkish it teaches is out of date, most Turks who I show this to (including my teacher) agree on this and find many things about the book laughable. This shows itself in both the vocab and in the conjugations (the future negative is condugated as &quot;-miyecek&quot; for example). 2) The descriptions are incredibly obtuse and technical and I was only able to understand them based on a few months of private lessons about the same concepts. If I had tried to learn on my own from this book I can't imagine how long it would take. The only positive thing I can state about it is there are a lot of exercises at the end of each chapter, something missing in every other book I've found... but even the answer keys to these exercises are sometimes wrong, use outdated words and forms, and ask you about concepts not yet taught. Perhaps for linguists this might be useful but as a begining and intermediate student I have found it incredibly frustrating. Many other books such as Teach Yourself Turkish are much easier to understand and explain the concepts so much simpler.",
                "review/helpfulness": "42/46",
                "num_reviews": 46
            },
            {
                "review/text": "I have bought this book so my wife could learn Turkish.Turkish is my native language and from what I saw, there is no way to learn Turkish properly from this book. The example sentences make no sense. It looks like a computer translated the sentences to Turkish and nobody edited them. It definetly needs a native person's editing so the sentences make some sense.",
                "review/helpfulness": "39/43",
                "num_reviews": 43
            },
            {
                "review/text": "It's a Turkish grammar, rather than a primer for a complete beginner.It was written for Princeton students who must be a very intelligent bunch. Sometimes the English is hard to follow and you have to be smart to understand it.. It's full of sentences like &quot;the infinitives - common or light- may govern the objective definite suffix , or other appropriate suffixes, on preceding substantives, just as do finite verb forms.&quot; and &quot;the common infinitive with the following combinations of two suffixes (1) the ablative suffix (2) the conditional suffix, means.....&quot;It may be a little out of date. It says the lira contains a hundred kurus. Maybe things move slowly in Princeton.I think it might be helpful for someone who had learned to talk Turkish in an ungrammatical way - maybe lives in Turkey- and wanted to become more correct. There are no tapes.",
                "review/helpfulness": "19/23",
                "num_reviews": 23
            },
            {
                "review/text": "This was my first text book in Turkish (some 28 years ago). Despite many new and innovative techiniques in language teaching and acquisition, this little charmer is still one of my favorites.If one takes one's time to work through the exercises step-by-step -- the result will be an excellent basic command of Turkish sentence structure and verb system. Professor Thomas has a very systematic style which I appreciate as a student (especially when learning by oneself)Alas, no one has taken the opportunity to make recordings of the examples or exercises. This would make a great package -- Hint, hint if the publisher is reading.Anyway, affordably priced and fairly complete in itself (except for the lack of audio), you can't lose if you want to learn Turkish!",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "To prepare for going to Istanbul to attend the engagement party of my oldest son to the lovely &Ouml;zlem, I thought it might be helpful if I could speak a word or two of Turkish.There isn't a better book than this one on the market (actually, I don't think there are any other elementary Turkish language books ON the market). It is a great little book, with actual lessons laid out at the end of each chapter. You're given several sentences to translate from English to Turkish and vice-versa.I would have given it five stars, but the downside is they don't tell you that you MUST have a Turkish dictionary at hand. I didn't realize this until I was in Istanbul trying to do my homework.There's a short dictionary in the back of this book, but it is Turkish to English (which makes it hard to look up some of the words you're supposed to translate from English to Turkish - and some words just aren't there).The CD tape I bought simply wasn't enough, so I added this book. (You absolutely need a CD, though, so you can understand the pronounciation -- extremely important in this language!Highly recommended.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I use this book in combination with a simple tourist primer (for light studying while walking) and other more challenging books (that require more motivation). This book is excellent as a vehicle for steady (though not completely rigorous) acquisition of vocabulary and grammar.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a native Turkish speaker and I bought this book for my really good Canadian friend who got interested in the language. This book has been written by a person who have lived in mid 60's and hasn't been updated since apparently. There are phrases and words (mostly words that have Arabic or Farsi roots that got replaced by modernized Turkish ones) in this book, that are not used in daily life anymore. An example to such phrase is \"How many bulbs are there in your radio?\" The book still may be good for learning the grammar (can't comment on that since I only glanced through it), but in terms of learning recent vocabulary and phrases that wouldn't sound make you sound funny, it is not the best reference.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book teaches the fundamentals of Turkish grammar to the beginner in a very logical order. Most of the sentences in the exercises are not what you'd be saying when you arrive in Turkey, but they are very well chosen to illustrate the grammatical points, and review the grammar of previous chapters. Answers to all exercises are in back.Since there is no audio, you should do a few chapters in a book with CD such as Teach Yourself Turkish to acquaint yourself with the sounds before beginning this book.As well as doing the Turkish-English and English-Turkish exercises, I translated my English translations of the Turkish-English exercises back into Turkish. This allowed me to learn thoroughly, and now, after six chapters, I find vowel harmonization comes naturally.I typed my answers, which required representing the special characters of the Turkish alphabet with my keyboard. On the Mac, is c with the option key pressed at the same time (probably the alt key on a Windows machine). &uuml; is option key together with u followed immediately by u alone. &ouml; is option key together with u followed immediately by o alone. For the i without a dot and the soft g I could find no exact representation, but for i without a dot I print , option key together with i followed immediately by i alone, and for soft g I use ^g, i together with option followed by g alone.For learning vocabulary, I use mnemonic devices: I think of a memorable English sentence with combines the sounds of the Turkish word together with its meaning. For instance, the stem of the verb meaning find is bul. I think, \"I found the bull in its pen.\" The stem of the verb meaning see is g&ouml;r. I think \"I saw Al Gore on television.\" The word meaning glass is bardak. I think, \"I took the glass for the daiquiri from the bar.\" It is well worth spending time thinking up these sentences.There is no English-Turkish vocabulary, so a dictionary is useful (though you can find the words in the answer keys in the back). A few words are missing from the Turkish-English vocabulary, but missing words have occurred with every language text I have used. More importantly, a virtue of the book is that grammatical features that have not yet been taught do not appear in the exercises.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is more or less for advanced students of language who have a better capacity to absorb grammar and language structure than the average tourist wishing to learn a few words in the local language. Some of it is outdated as language is constantly changing, but the vast majority of the information is useful for today.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "cracking the ap calculus ab bc exam 20042005 college test prep",
        "description": "Make sure you're studying with the most up-to-date prep materials! Look for the newest edition of this title, Princeton Review AP Calculus AB Prep, 2021 (ISBN: 9780525569459, on-sale August 2020). Publisher's Note: Products purchased from third-party sellers are not guaranteed by the publisher for quality or authenticity, and may not include access to online tests or materials included with the original product.",
        "authors": "['The Princeton Review']",
        "infoLink": "https://play.google.com/store/books/details?id=PEOGDwAAQBAJ&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have used this book for extra preparation for AP Calculus AB exam, besides taking the course at school.I took my exam a few days ago (and I did very well), and I must say the book covered everything that was tested. A weakness, however, would be that it is hard to determine which of the chapters refer to AB and which - to BC (yet this is not impossible, since the book contains a list of topics where this info is indicated).The explications of topics are easy to follow and understand. Also, if you use this book, you'll sure have enough practice exercises for each and every topic, as well as 3 Practice AB Calc tests (full size) and 2 BC Calc tests.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "My school only offers AP Calculus AB as a class, but I wanted to take the BC test, so I decided to study up for it on my own. I tried using my school textbook, but its explanations of concepts were shoddy at best, and sometimes not related to anything on the AP test. I bought this book, and I can say with confidence that I would not have had a prayer on the AP test without it. In addition to providing invaluable test-taking strategies for both the multiple-choice and free-response sections, it goes over everything on the AP test, with special attention paid to the concepts that are most likely to appear on the exam. Its explanations are clear and concise, with numerous practice problems to help you make sure you've \"gotten\" a particular idea. The practice tests helped immensely, as well, and they were very realistic and quite similar to the real exam. One caveat: the book doesn't go over velocity and acceleration vectors, so make sure you learn these, too, for BC Calc, but that's not nearly enough to detract from the immense help that this book provides. I'm going to recommend that my school replace the Calculus textbooks with this book (or at least recommend that every student buy it).",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I got 5 on the exam and I found that the difficulty of the actual exam is similar with that of Princeton's practice tests.In free-response questions, there would be some questions that are harder than Princeton's.I also used barrons, but I found Barrons' questions wereexcessively tough.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is concise and easy to understand. It's not quite as good as the Princeton Review's AP Physics B&C, but it's pretty darn close. I'd recomend it to anyone who is serious about doing well in Calculus and on the AP.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is about all you'll need for the AB or BC Calc Test. As long as you're committed, and can do up to a chapter a day, you can easily kill this test. When i walked out, I knew i had gotten a 5. Its not that hard w/ this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I took AP Calculus AB and this book is an amazing review for it, it is very simple and easy to understand and there are so many practice problems to try. This book is great for review of the multiple choice section, the free response questions in this book were really easy. What I did I joined at www.apcentral.collegeboard.com and I used actual AP Calculus Free Response questions to practice all the way up to the test. Using this book and those free response questions I think it definitely helped me pass the AP Exam. I would definitely recommend this book to people who are serious about passing their AP Calculus exam.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "emtparamedic selfassessment exam prep review manual prentice hall success series",
        "description": "\"EMT-Paramedic Self-Assessment Exam Prep Review Manual, 3rd Ed.\" by Richard A. Cherry and Joseph J. Mistovich is \"the\" text to help students pass their National Registry and other certification exams. KEY FEATURES: \" All items are written and tested by educators and offer proven authoritative information. This review book blends a comprehensive collection of practice exam questions with helpful test taking tips and student hints. Rationales are provided for correct and incorrect answers. For Intermediate and Paramedic level emergency responders. * * * * *",
        "authors": "['Richard A Cherry']",
        "infoLink": "http://books.google.nl/books?id=p9b4AAAACAAJ&dq=EMT-Paramedic:+Self-Assessment+Exam+Prep,+Review+Manual+(Prentice+Hall+SUCCESS!+Series)&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "First of all, no Paramedic review workbook I have seen is the best. That is why I can't give the book 5 stars. Each review book has its ups and downs. I recommend buying two different workbooks to study (especially for Nat'l Reg.)This workbook is a perfect addition if you have the Brady text series. There are references to the page/book numbers in the answer section. This is helpful so that you can review the sections in which you feel you need more help.The answers to the questions in the workbook are sufficient, especially because the reference pages are provided. However, in studying for Nat'l Reg, the answers could be better. I wish that the answers would include the rational behind why the other choices are wrong.A downside is that the workbook goes into great detail. It has 56 chapters, including this sampling: ethics, gastroenterology, airway management, documentation, spinal trauma, neonatology, & HazMat. (If you are studying for NREMT-P test, you don't need to go into that great of detail.) But, if you are studying for quizzes in school, it could be helpful.The book includes a CD, which is an excellent addition. It contains 2 180-question tests, which are in two different formats. One down side to the CD exams is that the answers aren't as good as they are in the workbook. The CD also contains other helpful information, such as a glossary and D.O.T. objectives.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I bought this with the Marchetta book and the combo worked well (I passed on the first go around), although I was sweating going into the test because I could barely score passing scores on the subject sections in this book. This book is based on the Brady text and like most review books, it hits on the most archane details that when taking in such a large subject, unless you just read it, you probably would not remember it. It is a good review that, combined with the other book, if you study and study early on, should do OK. But do not expect to remember all this stuff.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I purchased this book and studied from it about 2 months prior to taking the NREMT-P Exam. I passed on the first try. Would highly recommend to anyone that is preparing to take the exam.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is not much better than having the Brady text. The answers are not explained and you can argue many of them",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is great if you need to review for a Paramedic Exam. The book is excellantly divided into sections based on the type of injury/illness etc. The book has many of the same questions as the National Registery Exam and state exams. The book also comes with a CD for further review. Thanks in part to this book I have my NREMT-P certification.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book has a lot of specific information, but the best part is it is tied to the reference book from class, when you miss a question, it tells you where to go in the book to get the correct answer. Very helpful!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "everything you need to score high on praxis ii core battery msat speciality area tests praxis ii exam",
        "description": "Provides sample tests and exercises for the subject assessment portion of the Praxis teacher education testing series",
        "authors": "['Joan U. Levy', 'Norman Levy']",
        "infoLink": "http://books.google.com/books?id=PwbeHAAACAAJ&dq=Everything+You+Need+to+Score+High+on+Praxis+II:+Core+Battery,+Msat,+Speciality+Area+Tests+(Praxis+II+Exam)&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book only contains sample tests, with NO explanations of the answers. It is very misleading to say that this book helps &quot;prepare&quot; you for the tests. The &quot;cassette&quot; that &quot;comes with the book&quot; is actually a coupon that you mail in with $7.95 to get the cassette. The title &quot;Everything you need to score high on Praxis II&quot; and the publishers' description of the book (parroted by Amazon.com) are fraudent. I felt that I was ripped off when I bought this book. One would be better off getting the sample test booklet sold by ETS.",
                "review/helpfulness": "83/84",
                "num_reviews": 84
            },
            {
                "review/text": "The book does give explanations of its answers, however it does not have any PLT exams in it. Therefore, it does not have &quot;everything you need to know.&quot;",
                "review/helpfulness": "48/49",
                "num_reviews": 49
            },
            {
                "review/text": "The book is outdated. The test has completely changed since the book was published. Study your Methods book if you want to pass the Praxis II Test.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "I bought this book to prepare for the school psychology speciality exam. It was useless for this purpose. The mock school psychology exam provided no explanations for the answers, nor did it mimic the actual exam offered by ETS in length or content. I ended returning the book to Amazon.com; it contained nothing that helped me prepare for exam that I had not already garnered from the ETS materials available for free.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "clep general exams w cdrom clep test preparation",
        "description": "Earn College Credit with REA's Test Prep for CLEP* Core Exams Everything you need to pass 6 CLEP* exams and get the college credit you deserve. CLEP* is the most popular credit-by-examination program in the country, accepted by more than 2,900 colleges and universities. For over 15 years, REA has helped students pass CLEP* exams and earn college credit while reducing their tuition costs. Our CLEP* test preps are perfect for adults returning to college (or attending for the first time), military service members, high-school graduates looking to earn college credit, or home-schooled students with knowledge that can translate into college credit. The CLEP* Core Exams test prep assesses the skills tested on 6 official CLEP* exams. Our comprehensive review chapters cover: College Composition, College Composition Modular, Humanities, College Mathematics, Natural Sciences, and Social Sciences & History. The book includes 1 full-length practice test for each subject area. Each exam comes with detailed feedback on every question. We don't just say which answers are right-we explain why the other answer choices are wrong-so you can identify your strengths and weaknesses while building your skills. Ten practice tests are offered on our interactive TestWare CD and give you the added benefits of timed testing, automatic scoring, and diagnostic feedback. We help you zero in on the topics and types of questions that give you trouble now, so you'll succeed when it counts. REA is the acknowledged leader in CLEP* preparation, with the most extensive library of CLEP* titles available. Our test preps for CLEP* exams help you earn college credit, save on tuition, and get a college degree.",
        "authors": "['Dominic Marullo', 'Rachelle Smith, Ph.D.', 'Ken Springer, Ph.D.']",
        "infoLink": "http://books.google.com/books?id=N7rpggfzmWkC&dq=CLEP+General+Exams+w/+CD-ROM+(CLEP+Test+Preparation)&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I recently took the Humanities CLEP exam. I used the REA CLEP general exams manual to study, review, and practice test exams to prepare for the exam. I found less then 10 questions on the exam, (out of 140) which were even close to the questions and answers in this REA test manual.Needless to say, I didn't pass the exam. I got close ..score 46, but needed 50. I highly recommend using the CLEP OFFICIAL test manual for your primary test preparation. I am going to call REA and advise them their test manual is not worth using for the Humanities exam. I spent $30 for this manual plus $60 for the exam and $15 for theTesting center; $105 spent, and nothing to show for it. I hope this helps othersThxJeff Zigeler",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "THIS BOOK IS GOOD FOR GETTING A GENERAL IDEA OF HOW THE TEST IS ADMINISTERED, AND THE REVIEW QUESTIONS WERE DISCUSSED IN GOOD DETAIL, BUT WHEN I TOOK THE TEST, THERE WAS MAYBE A HANDFUL OF QUESTIONS THAT ACTUALLY PERTAINED TO TO THE REAL TEST. NOT A GOOD BOOK FOR REVIEW, BUT GOOD TO GET AN IDEA AS TO HOW HARD THE TEST IS GOING TO BE.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book seems to be ok but I won't know for sure until I go for the English Composition Exam. But my real beef has to do with the CD-ROM that came with the book.The CD is designed to create for the student a feel for what the real test day will feel like. So I started working with the English Composition questions on Practice Exam 1. I studied for actually a couple of weeks before I sat down and took the first practice exam. According to the CD's score, I failed. Then I went back and started studying the questions that I failed. A few days later, after I felt that I had the failed questions studied, I took the test again and failed again. I repeated this over a period of 4 to 5 weeks. Each time I took the practice exam, I either failed or got a score that was so low that I didn't feel that I should take the real test yet. I want to walk in there and ace it so that I don't have to wait the mandatory 6 months before I'm allowed to take it again.So after weeks of studying I suddenly realized that many of the answers that the practice exam showed me as getting wrong, I had answered correctly all along. I started double checking. I started by taking the English Composition test and using the answer key in the book to record my answers. Guess what?!! The damn book failed its own test! I also discovered that many times I would click on the right answer as being \"A\" and the practice exam showed as my clicking on a different letter thereby getting the question wrong.But it gets worse! I soon discovered that there a number of questions that I got wrong that the practice exam on the CD showed me as having gotten right. YOU GOTTA BE KIDDING ME!! Now I've got to go back and basically start from scratch. This means that the combination of this book and the CD-ROM has taught me many, many wrong answers and now I have to UNLEARN. I just do NOT need this kind of confusion and this cannot be the goal of this book.Folks, the CD-ROM is absolutely WORTHLESS. Get the book, yes, but throw that damn CD straight in the trash before it really messes your mind up. I cannot believe how much time I've wasted with this total peice of trash. This is one of those times when giving my money back is no where near enough compensation for the time just pissed away!! Hell yes I'm mad.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Great resource, the CD was great because it was was identical to the test. If you can pass this this test you will succeed on the CLEP test. The answers are not the same but similar content. The point is that if you pass the sample test you can pass the real test because the actual test covers a broad range which is similar to the that in the CD. The study information is very useful and will help you to get a passing score. So study the book take the test and if you pass you can feel pretty good that you will pass the CLEP.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "norwegian in 10 minutes a day",
        "description": "Who knew learning Norwegian could be so much fun? Now with a new digital download, the ever-popular \"NORWEGIAN in 10 minutes a day\" Book makes learning Norwegian simply a breeze. It's the perfect blend of education and entertainment. Full of fun activities and useful study tools such as Sticky Labels and a Cut-Out Menu Guide, it'll have you saying \"god dag\" in no time. Whether you're exploring your Norwegian heritage or cruising the fjords, you'll have more fun if you can speak Norwegian. Perfect for travelers and students of any age. The \"10 minutes a day\" Program: The \"10 minutes a day\" proven methodology guarantees success--all you have to do is set aside 10 minutes and you'll be on your way. Why 10 minutes a day? Because 10 minutes is doable, it fits easily into your life and it's not overwhelming. The program is created so that you can work at your own pace. You set the pace and you decide when you're ready to move to the next Step. The book is purposely designed to look like a child's workbook--it's not intimidating or overwhelming. Instead, it's approachable and engaging for everyone at any age. The book covers material equivalent to more than a year of high school Norwegian or the 1st quarter of Norwegian at university. The vocabulary hones in on key essential words that you'll actually use when traveling. You'll learn Key Question Words so you can ask for what you need; money and numbers so you can shop and pay bills; directions so you can get to your destination smoothly, and so much more that will make your experience abroad enjoyable. Study aids and fun activities such as word games, puzzles and interactive modules are academically designed and strategically interwoven into the program to help you succeed. Contents include: The 132-page illustrated workbook: Use the book to guide you, step-by-step, through learning and speaking Norwegian. Full color throughout: Visually engages you and is conducive to learning quickly. Digital download of \"10 minutes a day\" language learning software: Use the interactive modules to hear the words, practice and play, track your score and have fun! (PC and Mac friendly) 150 Sticky Labels (both in the book and for your computer): Place the Sticky Labels around the house and office to learn new words without any extra time or effort. Use the interactive Sticky Labels module on your computer to hear the words, review, keep track of your score and improve. Ready-made Flash Cards (both in the book and for your computer): Take the ready-made flash cards with you and review your vocabulary on the go. Use the interactive Flash Card module on your computer to hear the words, practice and test yourself. Cut-out Menu Guide: Practice at your local restaurant and take it on your trip. Pronunciation Guide: With the Guide and simple phonetics above each Norwegian word, it's easy for native English speakers to begin speaking Norwegian with the correct pronunciation. Over 300 \"Free Words:\" Sounding similar to their English counterparts, these Norwegian words take no extra effort to add to your vocabulary. Glossary of over 2,000 new words, definitions, and pronunciation: So you can quickly look up a Norwegian word, its pronunciation and definition.",
        "authors": "['Kristine K. Kershul']",
        "infoLink": "http://books.google.com/books?id=dqQnjwEACAAJ&dq=Norwegian+in+10+Minutes+a+Day&hl=&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I teach English to immigrants and international students in the U.S., so I'm very familiar with techniques for teaching and learning languages. If you are not planning on actually taking a class, I would say that this book is excellent. It provides tips on pronunciation based on American English. (Most other books don't have the pronunciation tips, but you have to spend extra money on a cassette or CD.) The person who complained about the book missed one important factor. This book provides language than gradually integrates it into the &quot;directions.&quot; Most book give directions in English only, this one substitutes those words that you've learned already in Norwegian! It also does what is called &quot;Scaffolding&quot; - they introduce an idea or word in one place, then re-introduce it later. This book is also very colorful and offers flash cards, sticky-labels and more! Personally, I recommend the English as a Second Language version of this book to my beginning level students- because if you really are interested in learning the language, this is a very inexpensive and effective tool. The down side to this book is that some of the sticky-labels don't make any sense. For instance, where are you supposed to stick &quot;Good morning???&quot; Others, like &quot;Kitchen&quot; or &quot;glass&quot; are better. I would recommend doing this book first and then moving on to &quot;Teach Yourself Norwegian&quot; - or use both at the same time, because they reinforce each other.",
                "review/helpfulness": "50/51",
                "num_reviews": 51
            },
            {
                "review/text": "I can't say enough good things about this book. There's so much useful information, including common words and how to pronounce them. Best of all, it's presented in an entertaining, fun way that makes you want to use it. In addition to reading, you have to write the words and phrases, which as anyone knows from school is the key to remembering what you've learned. I particularly like the stickers for rooms and items around your house. Every time you look at the item or room you see the sticker and this helps to reinforce the Norwegian words. Before long you're counting to yourself or looking at things and mentally saying the Norwegian word. Finally, there are cut-out flash cards and a laminated pocket guide to take with you so that you can work at learning Norwegian wherever you are. I wish there were intermediate and advanced versions of the book. This truly does make learning fun. I highly recommend it.",
                "review/helpfulness": "51/51",
                "num_reviews": 51
            },
            {
                "review/text": "I see another review on this book and I believe that author missed the point of this book. The objective of this book is not to have you write a sentence in English then translate to Norwegian, nor be a comprehensive source for learning Norwegain, but expand your vocabulary used in learning the language.The book has several mutually supportive exercises in expanding vocabulary and proper word usage. There are sentences with fill-in-the-blank missing words. There are little stickers to help you memorize the names of common household items. There are also exercises that help with gender, numbers, and common expressions.This book is definately not going to teach you Norwegian except when used with other resources, but this is a great addition to the other tools that one uses to learn Norwegian.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Having been raised in Norway, I can say that a non-native speaker or someone without previous exposure to the language will probably have difficulty with pronunciation. The book tries to sound it out for English speakers, but that only serves to make you sound like a foreigner :) Nonetheless, it's a good, fun way to learn the grammar, vocabulary, and begin to put together some of the sounds. The variety of \"games\" and exercises help keep your attention while you learn.A good intermediate step as a refresher, most definitely.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book may not be the ultimate resource for learning Norwegian (it has no audio recordings to help master pronunciation), but it is an inexpensive and very helpful way to get started with the basics of vocabulary and grammar. It is like a child's workbook, with illustrations, games, exercises and lots of helpful guidance to make everything perfectly clear. I would say it is an essential starting point for anyone who has never studied a foreign language, and a great help to experienced linguists who are taking on Norwegian self-study. Match it with Einar Haugen's Norwegian English Dictionary, Pimsler's audio program to master pronunciation, and Norwegian: An Essential Grammar, and you'll be building a firm foundation for later intermediate study.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "\"Norwegian in 10 Minutes a day\" is designed for the person who is self-motivated enough to devote at least ten minutes a day to the lessons and who is familar enough with the study of foreign languages to pick one up without outside coaching. The study guide is highly portable and can be used anytime the student has the opportunity.The guide covers the basics of the Norwegian language in a self-paced manner. Dedicated study should enable the traveler to Norway to acculmulate a basic vocabulary sufficient to read signs, menus, and other public displays, handle money, and to ask and answer simple questions. The lack of an audio feature with this guide would make it pretty challenging to master conversational Norwegian without resort to other training materials, classroom instruction, or practice with someone already familar with spoken Norwegian.This guide is highly recommended to the beginner in Norwegian looking for a basic introduction to the language, and to the student with some pre-existing familarity with Norwegian who is looking for a refresher course.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was looking for Norwegian books that would help me improve my knowledge of the language as I've been studying it for over a year, so I went through all the available ones over there.With this book (taking me back to my beginner days of learning the language), I found it interesting how the writer wrote in English at the start of the book, but as you gradually progress through the pages, the words that you've already been taught were written in Norwegian (so, it was like a mix of English-Norwegian).You're also provided with stickers so you can label certain objects and a little pocket book found at the back so you can take it around with you and quizzes where you're required to fill in the blanks. I found that enjoyable.The disadvantage is, the book is without audio. It's no problem for me, as I already know the pronunciation of words well, but for the people who have had no previous knowledge of the language may find it difficult. There is a pronunciation next to the Norwegian word, but how do you know if you're pronouncing the word right or wrong?Overall, I found the book quite enjoyable and keeps you pretty occupied with the fun stickers and games.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was a good starting point to learn Norwegian. The biggest complaint is that without an audio tape, I wasn't quite sure about some of the emphases in saying sentences. I also didn't have a dedicated 10 minutes a day for the several weeks I had the book before going to Norway. Then, of course, everyone in Norway speaks English, so learning Norwegian wasn't that important after all. The stick-on labels should have the English on the back, because otherwise it was hard to remember what the words referred to long enough to go seek them out in the house.I think if you really apply yourself, it is a good system to learn by.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Love this book.............I would like to know this language because it is the language of my heritage...........this book makes it much easier than I thought...THANKS!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I bought this book for my boyfriend who had recently been to Norway and fell in love with the language and wanted to learn. He has told me only wonderful things about it and uses it every day. He says it is easy to follow and provides for great practice. He has even been able to hold a conversation with his Norweigan friend quite well since using it. I would highly recommend this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "cracking the ap chemistry exam 20042005 edition",
        "description": "Provides techniques for achieving high scores on the AP biology exam and includes two full-length practice tests.",
        "authors": "['Kim Magloire', 'Princeton Review (Firm)']",
        "infoLink": "http://books.google.nl/books?id=RRcB6si_wV8C&dq=Cracking+the+AP+Chemistry+Exam,+2004-2005+Edition&hl=&source=gbs_api",
        "categories": "['Science']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "So, being this the first year I took AP courses, I went a little over zealous and purchased 3 AP Chem books. Furthermore, a friend lent me another, and I skimmed through a few more. Let me say right out I got a 4. I was a bit disappointed, but I know I should have started studying harder and more rigorously. Even so, I believe that this book (Princeton's) positively contributed to my score.Princeton ReviewIf you purchase only one review book, this is definately the one to get. This was the only one I really read through. The content was worthwhile, not too long, and fairly easy to read. I did most of the questions at the end of the chapters, but only took a quick look at the MC and Free Response questions at back of the book. I was a bit pressed for time. I finished reading the book the day right before the AP test. Really bad, I know. However, I had been preparing for a few weeks by doing old AP tests and tons and tons of old FR questions. I did almost all of the FR's on collegeboard' website. This book is definately not enough to get a 5, or even a four on. You should definately get a hold of old tests and do them! Also, try to keep up with the text book during the year to make sure you at least have some idea of what's going on. With that said, I can add one more high point of this book... the REACTIONS SECTION. The best I've seen. Very thorough, and much better than the other books. There are a few more rules than those in the books though, so make sure you ask a teacher or do enough to recognize patterns.BarronsThis is definately one of the worse ones out of the lot. (Second worse.) I had read AP Euro review books before(since the test was a few days before) and was in the process of reading Princeton's chem book. How is this relavent you ask? Well, I've heard that some review books are notorious for huge, massive errors. I had personally never experienced this before and didn't notice any in the ones I had already read. Then there was the Barron's book. I looked at a few pages, and knew this was not worth the time. Specifically, I looked at the reactions questions at the end of the book. Some of the answers were WRONG! Very discouraging and wasted my time. Don't even bother with this book.REAThe absolute worst one out of all of them. A friend lent this to me since she had it laying around. Please note that this book was from a couple years back (though review books don't change too much). I read about 1/4 of the book. Waste of time. Hard to read, wierd diagrams, doesn't contain what's need for the test. Really makes me leary from buying more of their review books in the future.KaplanOne of the better ones. The periodicity section in particular stands out. It was well written. I did not read this as I had absolutely no time, but it looks like a good, reliable, review. Seems a lot thicker than Princeton's, but would probably be more thorough. The reactions section though is definately inferrior.This would be a good backup/ supplement to Princeton's version. Now I wish I did not procrastinate and instead spent time reading Kaplan's review.PetersonsI did not have personal experience, but a friend owned this review guide. I did however have a brief skim through it. Every thing looked correct, and I liked the format and tone. It reminded me of Kaplan's (around the same thickness too), and my friend expressed that this was quality. There weren't any reviews for this on Amazon, so unfortunately, I did not get this.All in all, I think I scored a solid 4 and not a 5 just because of the tricky multiple choice (I should have spread my time more evenly, but I did finish). And some dues go to my crazy chem teacher. He expected us to learn the material from reading just the really, really long text books and doing questions in the back. Most people didn't, and he often said he knew most of us would not pass. He gave a few lectures and stuff but not too indepth. I never comprehended the labs we did, but luckily there weren't specific questions on them. Also he said that some sections, like organic chemistry, weren't on the test. Except they were, and it wasn't just one question. Maybe if I had spent time doing the Princeton Reviews 2 tests, and reading through it again I could have gotten a 5.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Let me start off by saying that i had a terrible terrible teacher. He was extremely incompetent and lazy. So for anyone with a really bad teacher then my amazing review is for you. The high point of this book is that it has tons of practice questions. The book is split up into different sections such as gas laws, thermodynamics, nuclear chemistry and so on. At the end of each section there are 15- 30 questions on the topic and 3-6 essay questions. The questions are a little easy, but the essays are often challenging and cause you to see a new aspect on the topic. Each section is only a few pages and provides the bare bones on the topic. If you dont have any foundation this book probably isnt a good place to start. It is excellent at refreshing memory if you once knew chemistry. I had almost 0 foundation so i used my text book with this review book. It is even good if you use this book at the beginning of the year as you read each chapter. The practice tests were good but much easier than the actual test so expect a slightly lower score on the real thing. If you master this book you can easily get a 3 and maybe a 4. However if you want a 5, like me, USE MORE SOPHISTICATED RESOURCES such as your text book or the Barrons. This book is not good enough to alone get you a 5 unless you are already smart enough to get a 5.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is an excellent preparation guide for the AP chemistry exam, it includes hundreds of practice AP questions similar to the national exam itself. It is a quick read if you are preparing late for the exam and has a very organized and user friendly format dividing the sections in to the main concepts covered by the AP exam and offerring excellent preparation questions in those areas. The difficulty level of the questions however is open to discussion as some questions in the book are slightly less difficult or complex as the questions asked on the actual national exam, however the majority are equivalent in difficulty to the exam. As for the free response section of the exam, this book provides excellent sample essay questions very similar to the exam in its intricacies and meticulous detailing of the questions forcing one to think deeply in to an answer. The book however does not provide answers that explain the answer to the question in great depth however with the information provided by the answer, one who is knowledged in chemistry can conclude what a proper AP exam answer would read. A main dividing factor between the free response section of exams in this book and of the real exam is that the real exam's &quot;equilibrium problem&quot; has many more parts to complete than that of the samples. The samples provide only 4 or 5 parts to the mathematical problems, whereas on the exam you can expect to find problems with 7 to 8 parts, and some of the types of questions encountered in the 4 extra parts are never discussed in this book. The exam takes the mathematical questions to a higher level than this book and requires one to analyze further the situation of a problem and provide further calculations to demonstrate understanding, this princeton review book does not discuss this. However, all together this book has great value and i highly reccomend it for any brave enough to challenge the AP chemistry exam, it is an essential material for its practice questions and was a cornerstone for me to score my 5 on the AP chemistry national exam. My advice to those aspiring AP chemistry exammers is to buy as many books with practice exams as you can and take as many full length exams as possible, they are the most helpful tool that you can find, and the princeton review offers this exceptionally.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I took AP Chemistry last year and yesterday I just got my scores. I got a 5 in chemistry! I was shocked because I had a horrible chemistry teacher who told us nuclear chemistry, organic chemistry, and labs wouldn't be on the test which is why he didn't cover it! This book (the 02-03 edition) helped me significantly because of all its practice questions and nicely explained explainations. It makes chemistry seem so easy and if you memorize everything in that book (and know labs), you will ace the AP test. There were only 4 questions out of 75 on the AP test that I didn't know! Another excellent book was the CliffNotes book for those of you who are like me and had a chemistry teacher who did not do any of the labs. That book gives a lot of details on the labs so you will get all the lab questions right even if you've never done a lab. But one important thing to remember is you can not cram with APs. I started studying 3 months with this book before the test and I took a lot of real practice tests.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is the best study aid I've ever used before. I actually used the 02-03 edition, but the book has remained essentially unchanged for the past few years. I didn't have an AP Chem class, only Chem 3, which did only so much to prepare me for the test. Instead I read through this book 2-3 times (which actually didn't take that long after I read it the first time) and did a few practice free reponse tests. I devoted all my studying time to this test (and not to my English Lit or US History, both of which I got 4's on), and doing this got me a solid 5 on the AP Chem. There were maybe 2-3 questions on the entire test I didn't know. Overall, this book covers almost every aspect that the test can test you on, with the exception of something that has to do w/ absorbity (which is new to the test, and I chose not to do that free response problem), and some lab questions, which you must learn on your own in a real lab situation. If you are taking the AP Chem test, buy this book or rent it from your local library (like me). It will be well worth it!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "this was an awesome book. If you read it in conjunction with the lectures and prepare yourself decently this book will help you get a 5. It did for me.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book definitely saved my life. I was expecting barely a 3 on the exam; I got a 5, almost 95% due to buying this book. With barely a month left before the exam, with a teacher who had never taught the class before and an absolutely AWFUL, overcomplicated textbook, I bought this book and began looking through its sample questions and reading its review.Not only did the review contain information that showed up directly on the exam, the sample questions were formatted in nearly exactly the same way.My recommendation- DEFINITELY get this book, then study like mad. Do as many problems as you possibly can, and make sure to read over the explanations, since they REALLY help.Good luck, and don't stress too much!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book deserves credit for being concise, but comes up short on the coverage of some areas, such as descriptive chemistry. In addition, it has some material that is no longer on the AP test, such as root mean square speed of a gas molecule. Nevertheless, this review is about as good as it gets for any test prep company. Buy this book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book does a fair job at doing what it's supposed to do, and that's review. Basically you should already have challenged yourself by going through a textbook or something and really learning chem, then you can go through this book as a refresher. The set-up of this book is very good, but you can't just read through it for it to be worth your while. The essays in this book were pretty helpful, and some were practically the same as on the real AP test. If you actually take the time to write out actual essays like you would on the real thing, you can also enhance your BSing skills. If you are ever stuck, just talk about atomic radius or something. So somewhere in the book it says it has everything you need to know to get a 5, which may be true, but it doesn't have the detail for you to comprehend all the material just from reading what's practically an outline of the course. So get the book, use Barron's too because it's more detailed, and then really learn things from a textbook. Alright, so like all the other losers that wrote their scores for their credibility, I too got a 5. There.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was an ok book for me but it didn't seem like the real test. I received better test prep stuff from my AP Chem teacher. I would recommend this book if you had some serious learning to do before the test, not just as a study guide.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "cracking the ap european history exam 20042005 edition college test prep",
        "description": "Offers a subject review, exam strategies, and two full-length sample tests.",
        "authors": "['Kenneth Pearl', 'Princeton Review']",
        "infoLink": "http://books.google.nl/books?id=MBFuDXi9QqUC&dq=Cracking+the+AP+European+History+Exam,+2004-2005+Edition+(College+Test+Prep)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I made a five on the AP European exam in 2005, which was nice because it was one of my first APs, and our teacher was not particularly good. We skipped large sections of the textbook. However, this review book helped me immensely in preparing for the AP test.The material in this book covers most things, but very briefly. For example, each historical character might be favored with a sentence or two. For this reason, reading through this book alone will not get you a five, although it probably will gurantee you a four if you read carefully. However, if you sit down and memorize every proper noun in this book, it should be enough for a five.Our school administered a practice test about a month before the exam. During the day before and of this practice test, I read through the entire review book and actually scored a five. However, during the week of the exam, I went through the book again and took notes on everything I could not describe in enough detail. AP Euro FRQs are extremely detailed, but the multiple choice is relatively okay. I didn't leave any blank and was unsure of about ten.The practice exams are comparable, although the FRQs are somewhat easier, but it doesn't matter because College Board releases all old FRQ questions on their website.I also had two other books: Rea and Modern European History by Birdsall S. Viault. Rea is overly detailed. The questions are not realistic at all, being fact-based instead of cause-and-effect based. Modern European History is not a book written for the AP exam. It doesn't make sense to study from this book either, but I would recommend buying it as a reference during the year.Overall, Princeton Review's Euro AP is quite excellent.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book was great! I just got back my AP score, and I got a 4! I know that I wouldn't have gotten that score without this book.If you're looking for a review book that is easy to understand and comprehensive you should choose this book. The chapters aren't too long, so you won't feel overwhelmed. It also helps you to look at the big picture of things. The practice tests also helped me prepare for the real test because the questions were so similar. The essay section of the book also helped me to structure my writing and clarify my thoughts.I started preparing about 3 weeks before this test, and finished this book in a couple nights. Unlike the HUGE REA review book that most of my friends used, I actually finished my book. Most of my friends found the REA book so overwhelming because it went into TOO much detail. So, my friends barely got through the first 100 pages because there was too much to learn.So, if you're only a few weeks from the AP test, and you want a review book that is both concise and thorough, you should DEFINATELY choose the Princeton Review book over the REA book. I know that I would have been doomed without it. Believe me, before I got this book, I thought I was gonna get a 2.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is undoubtedly the best book to prepare for the AP European History Exam. I also bought REAs book, but found it to be filled with information that was unnecessary (pre-Renaissance) and incredibly unorganized. Not only that, but it did not include a sufficient section on James I through James II.Cracking the AP European History Exam is the best book for your money. I did not study the entire year and read only about half of this book a month before the test, yet I was still able to get a 4, a very high 4 at that.I recommend this book to anybody planning on taking the AP European History Exam. I would also recommend any Princeton Review product for whatever you may need. (I own a prep book for: PSAT, AP Physics, and AP Literature)",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Having just recently taken the Ap European History examination I must say that this book is extremely useful. To start off it presents perhaps one of the best historical reviews availible on the market. The book covers the major points in European history, and allows you to see the &quot;big picture&quot; as to how events relate to each other. Furthermore the practice tests offer questions that are of considerably comparable value to those on the exam, even coming close to the wording at times. However, some questions are just simply too obscure to be mentioned on the exam, such as a question about a department store, etc. Luckily unlike other review books such as Rea, the Princeton book has very few instances of this type of question. I also obtained Rea to use during the year, but in general it only really came in handy when my teacher presented us identification questions on detailed events. The AP exam is not going to ask you events that are that obscure. Essentially to date I have not seen a better book for the exam having tried both REA and seen the Barrons review.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "har har har. I got this book a week before the AP test, read it every night, and passed the test with a 4. I never paid attention during the school year, but I always did my work. I think this book is a good one and it probably was a factor in my passing the test. After I took the test, I returned the book to the public library. =)",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is such an awesome book for the AP European History test. I received a 4 on the test, thanks to this book and a good teacher. The book neatly summarizes everything but makes sure to include everything you need to know. It contains two full length AP tests that are right on par with the difficulty level of the real test.The information reads extremely well and easily. It doesn't seem like you're reading a text book, but more like you're reading a story- and that's the way history should be. The writers seem to be very witty and occasionally throw in jokes, for example: In the passage about Martin Luther, they talked about how he made a promise to God, and then wrote, &quot;Unlike many of you, who will pray for help on your AP exam, Martin Luther actually kept his promise.&quot; Little jokes like that will make you laugh right outloud because it's so unexpected for something to actually be amusing while studying.The only thing I would change about this book is that I would add more practice questions after each chapter. There's only 5 after each chapter, and some of the chapters are pretty hefty and contain a lot of information. But I would most definitely recommend this book, it's great!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Princeton Review is a very good resource, especially for AP and (P)SAT preparation. This book has some great tips, especially with the DBQ and free-response essays. The review is excellent (though rather implicit-not too much EXplicit). This is why I STRONGLY encourage you to utilize the Cliffsnotes (excellent prep book as well, great features: timelines after every chapter, but poor review questions) books as well. Some information may be presented in this title a little better to suit your specific learning style. Nevertheless, the review questions after each chapter mimic the College Board's questions. Undoubtedly, the best feature of this book is the two AP exams in the back. I'm not sure if these exams are past College Board releases, but they are very similar. All in all, buy the Princeon Review for the review and practice exams, and buy the Cliffsnotes for its great review as well, timelines, and comprehensive layout.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I used this in conjunction with a textbook (that is to say, when I outlined the text I had this right there with me and was following along there, too) and it is invaluable in offering key impacts and causes. The exams are just beautiful. I cannot say enough good things about this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a fantastic AP review book-ever since I bought this book-the only AP review book I use is now Princeton. I got a 4 on the test (even though I messed up my numbering and didn't have time to fix it). Its a great review-much more concise than REA. However, in all fair warning, the multiple choice was probably harder but the essays were about the same level of difficulty. If you're going to buy this-study it about one month ahead of time if you're aiming for a 5.. but anyhow, point is study throughout the entire year-actually know what's going on.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I just came back from the 2004 AP European History exam yesterday, and I can tell you now that this is a GREAT book. It contains just the right amount of information for one to do very well on the exam, and it doesn't contain extraneous details like the REA version. I struggled for a while trying to find the perfect AP Euro book, and this takes the cake. I read the whole thing through the day before the exam, and it helped tremendously. Get it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "barrons how to prepare for the ap french advanced placement examination",
        "description": "Provides an overview of the AP French exam, along with exercises and a series of practice tests to improve skills in reading comprehension, grammar, writing, and listening.",
        "authors": "['Laila Amiry']",
        "infoLink": "http://books.google.com/books?id=Yi5yMgEACAAJ&dq=Barron%27s+how+to+prepare+for+the+AP+French:+Advanced+placement+examination&hl=&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I am a student who used this book to study for the AP French exam . I found the review material excellent. The tapes prepared me for the listening comprehension well and the questions asked were similar to those asked on the actual exam. The book also gives you useful advice on what the examiners are looking for in your essay, which, along with the speaking section counts for 50% of your score. With the help of this book, I was able to receive a score of 5 on the exam!",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "One of the only study guides for the AP French Language Exam, Barron's does give sample tests and at least an idea about what the exam will be like. However, I have prepared for several other AP exams using &quot;Cracking the AP&quot; by the Princeton Review. These books are much more readable and take an approach of &quot;beating the test.&quot; Barron's, by Laila Amiry, seems to be written for AP teachers, not students trying to improve their score. She begins by suggesting ways to, over a long period of time, improve your listening and comprehension skills. While this is a noble thought, as a student right now I am much more interested in getting a four, not on watching numerous movies in French. Especially if the exam is approaching quickly, Barron's is not worth the cost. This is a plea for some book company to write an informative, fun book on how to &quot;beat&quot; the AP French Language Exam.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I'm French, although I haven't spoken French in a while. I decided to buy this book as a quick review for the AP French Language exam. I found it to be quite helpful, and it had a lot of practice. However, it was disturbing that the book made some egregious grammatical errors, mostly on the verb fill-ins.Nevertheless, a good prep tool. Cassettes will definately come in handy.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I personally detest the book. When I took the practice exams, I followed the steps that the writer suggested. The process made my results worse than if I had approahced the question in my way. The strategies are horrible. There also lacks PROPER explanations. I would highly reccomend a competitor book. Princeton Review is byfar the best.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I'm using this book at the moment to prepare for the exam, so I can't share how well I ended up doing in it. It *is* helpful, especially in the listening and reading sections, and it's always good to get the practice, but the grammar review could have been a lot better and I have seen what I am pretty sure are grammatical mistakes, which, along with some really sloppy editing, made me distrust the rest of the book. It's worth getting, but take it with a grain of salt.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "While this book does help the reader to understand how the AP Exam is set up and provides excellent questions for practice, it does not provide many explanations for the answers. I think that it would be very helpful if the reasons why the correct answer is the correct one would help students learn what areas they need to work on more. There have been several times that I have gone through the exercises and then checked my answers after and have been unsure as to why one answer was better than another, especially if more than one answer seemed to make sense.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a great book for teachers of any advanced course. We don't have AP French in my high school but we do have IB French and this book has many useful tips that will also help students with the IB test. It is easy to use and has many ideas about preparing students for speaking and writing.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Surprisingly, this book helped me to get a five on AP french. I usually hate Baron's, but this one is not so bad. However, i found some grammar mistakes. Some of the answers don't make sense at all. Overall, this book does help you with the AP test.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "teach yourself korean",
        "description": "Bestselling language courses! From Danish to Spanish, Swahili to Brazilian Portuguese, the languages of the world are brought within the reach of any beginning student. Learners can use the Teach Yourself Language Courses at their own pace or as a supplement to formal courses. These complete courses are based on the very latest learning methods and designed to be enjoyable and user-friendly. Prepared by experts in the language, each course begins with the basics and gradually promotes the student to a level of smooth and confident communication, including: Up-to-date, graded interactive dialogues Graded units of culture notes, grammar, and exercises Step-by-step guide to pronunciation Practical vocabulary Regular and irregular verb tables Plenty of practice exercises and answers Bilingual glossary The new editions also feature: Clear, uncluttered, and user-friendly layout Self-assessment quizzes to test progress Website suggestions to take language study further",
        "authors": "['Mark Vincent', 'Jaehoon Yeon']",
        "infoLink": "http://books.google.com/books?id=304DAAAACAAJ&dq=Teach+Yourself+Korean&hl=&source=gbs_api",
        "categories": "['Foreign Language Study']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I haven't progressed too far in the book, but so far I've been bothered by a few things. While it does a good job of presenting you with dialogues and vocab at an appropriate pace, its romanization is inconsistent at best - I've often run into mysterious vowels missing the appropriate marks, making me wonder whether or not they mean to use a different word, and the book reflects a stunning lack of editing and spellchecking, each of which ought to be done especially carefully in a book that's trying to teach a foreign language. Furthermore, questions and dialogues often include words that have not yet been taught and which are not in the glossary - one can only find them by flipping several pages forward to some other dialogue in which they're actually defined, though there's no way of knowing where this dialogue will be. Lastly, as other commenters have noted, there's not enough korean script, especially in the answers section. Given that I can't trust their romanization, it would be nice to see the correct responses actually written in Hangul as well.On the plus side, for the non-perfectionist, the book is small, portable, and has enough Korean in it that if you just sit down for about 2 hours a week with it, you'll pick up a good deal.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I think this book has a great approach to learning the language. There are three main streingths of this book. Firstly, it uses seemingly modern speech and phrases, so you don't sound like a complete idiot to a native-speaker. Secondly, there is as much opportunity to learn the written hangul as there is to speak it. All the dialogues are written out in hangul and rominazation (I would recommend using the hangul, not rominazation), so if you stick with it, you can get good at writing in hangul too. Finally, the dialogues are helpful because it helps you learn how to string sentances together. It's not like a phrase book where you'll never put more than two sentances next to eachother. This is very helpful in getting a feel for the language.I would recommend getting the CD set along with the book because although the narrorators speak slower than a native-speaker would, it helps reenforce pronounciation.Great book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "basic tagalog",
        "description": "Basic Tagalog is a friendly and accessible resource, providing beginning language learners with support, structure and thorough explanations. This is the most complete language course available for Tagalog--in one easy volume! This new edition has free online native-speaker audio recordings and dialogues in the contemporary Manila dialect spoken throughout the Philippines today. All materials have been thoroughly updated with current vocabulary, phrases and real-life expressions used by younger Filipinos. This textbook includes: Over 2,500 Tagalog words and phrases Online audio recorded by native speakers to help with pronunciation Bidirectional dictionary Updated cultural notes and sentence patterns Dialogues with manga illustrations Practical exercises at the end of each lesson Downloadable flashcards Clear and concise grammar explanations This comprehensive language learning course is ideal for both self-study and classroom learners who wish to learn Tagalog the way it is actually spoken.",
        "authors": "['Paraluman S. Aspillera', 'Yolanda C. Hernandez']",
        "infoLink": "http://books.google.nl/books?id=k2lSwgEACAAJ&dq=Basic+Tagalog&hl=&source=gbs_api",
        "categories": NaN,
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I guess I'm a little bit spoiled by some excellent material in other Asian languages. This isn't the worst language book I've ever worked through (Speak Cantonese, Book II, by Huang, unquestionably takes that honor) but it is definitely substandard in several areas that a language learner of even average interest and motivation would find important. I give it two stars mostly because one-and-a-half, which would have been my first choice, was not offered as an option.First, most of the exercises are of the &quot;do it yourself&quot; variety, where one starts with a word list and is told to make up sentences from there. Even when the book does give the reader sentences to translate, there is no key in the back that would give any idea of how close to a correct sentence one had come;Second, there are a number of sentences in the book where words are used which are not defined, either in the lesson or in the glossary in back, a particularly serious sin of omission since Tagalog dictionaries are not thick on the ground;Third, there are no conversations, just freestanding sentences and short narratives, so one is left with very little (if any) idea about how Tagalog is actually used;Fourth, very little about the book is cumulative: each chapter treats a separate area of Tagalog grammar topically, and only rarely, do the later lessons build on earlier ones.I would guess that when this book was written, it was aimed at an audience of people who had access to Tagalog speakers on a regular basis (e.g., Americans living in the Phillipines). For someone who has had to use the book as his primary Tagalog source material,(rather than as a support) it just doesn't make the grade. I'm writing this review mostly as an urgent plea to Routledge, Teach Yourself, Hugo and other publishers who have brought out first-class materials for other languages: Help! Help! Help! Tagalog is a fascinating language indeed and it deserves better treatment than it has had up til now- if anything, this is probably the best Tagalog book I have.",
                "review/helpfulness": "45/49",
                "num_reviews": 49
            },
            {
                "review/text": "Well, I have family who speaks tagalog, and they wont teach me a thing, so I took it upon myself to learn the native language of my loved one, and now she is able to speak to me in simple phrases and I understand. I even know when her and her friends talk about me! This book is great to learn simple phrases and to expand your vocabulary of tagalog if you are also exposed to it often. Its just a great book!",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is strictly a reference text or something to be used by teachers in combination with other material. On no account use this as a self tuition text. But if you've got a good grounding in grammar and a good basic vocabulary there's no better place that I know of to go back and revise those pesky verbs. They're all there. And when you finally know enough, you can agree with your Filipino friends that some of the Tagalog in the texts is pretty strange. But good basic stuff nonrtheless.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I bought an edition of this book in 1993 after my first two visits to the Philippines.I picked it up almost every day,which is an unusual thing for me to do with a book,however because of the teachings and systematic way the book is set out it made for very enjoyable learning. Even more enjoyable than learning from the book,is getting to put what I have learned into practise during subsequent visits to the Philippines.The filipino people are quick to encourage someone who they can see has put in an effort to learn their language.This book makes that effort worthwhile !",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "If you ever want to learn Tagalog, then this book is probably the one you should be learning from. I'm a native Tagalog speaker myself, but I have used this book to brush up on my grammar. This book is pretty much straightforward and easy to understand. I'd recommend this book to anyone who's considering learning Tagalog.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "There aren't many sources from which you can learn Tagalog, which is strange, since it's the second most widely spoken Asian language here in the US. In fact, the study of Japanese is the big fad right now although it doesn't even make the top ten list of most widely spoken languages (besides English) in the US, according to the 2000 census. Anyway, I'm currently in high school and studying ang wikang Tagalog recreationally, and I was fascinated when I polled my friends and familiy about languages spoken in the US...asked whether or not they were aware of the Vietnamese, Mandarin (Chinese), Korean, and occasionally even the Hmong languages, most responded affirmatively.However, when I questioned my friends and family members about their awareness of Tagalog language...only 1 of friends knew this language even existed (he's half Filipino). In fact, most of my friends and family didn't know where the Philippines even are, and a few didn't even know there was such a country.Not to mention the intimidation factor of the Tagalog language; yes, Chinese and Japanese have radically different scripts and grammar than English, but there are tremendous resources for both! Japanese has anime and manga as an enticing resource, and Mandarin Chinese has that whole top language in the world thing (1.3 billion speakers), but Tagalog is entirely scary when potential learners see sweet, innocent little words, like tiwala, meaning 'trust', heinously mutilated by prefixes, infixes, and suffixes to become: pinakapinagkakatiwalaan; which means, I think, 'the most trusted'. Who, among the Americans of my generation, so accustomed to instant gratification, would really care to learn the grammar of a language that would even attempt something like that, unless to get in touch with their roots?Not to mention the reassurance of \"oh, the Philippines had been under Spanish rule for hundreds of years, and the Tagalog language has been tremendously influenced by teh spansh language!3@!!#432!!\" Well, not really. There are actually several languages in the Philippines that are much more Spanish-influenced, but grammar-wise, Tagalog just didn't conform besides adopting stuff like numbers (veintedos as opposed to dalawampu't dalawa), some nouns, and words like mas (more) or o (or). Yes, learning Spanish would help...with about 400 words. Good luck from there.This book is a decent resource out of the very few affordable resources for Tagalog out there. It's updated, and contains reading material to practice on (or just freak yourself out with), and I hate to break it to you...but it's only a book. Basic Tagalog will not teach you words at an amazing rate, learn \"like a child would\", \"pass as a native\", or any other commonly guaranteed results if you don't do the excercises, and if you don't make an effort to make flashcards, or if you put no extra effort in learning whatsoever. Unfortunately, learning from a book-any book on language-will feel like work at one time or another, even if you're simply learning out of interest like I am. This is not the book's fault; it utilizes, most of the time, the drill-and-rote method of learning, which means if you only \"go by the book\" and not take the effort to say, watch any Tagalog-language movies or speak to Tagalog-speaking people, it might take years to master.In short, I was very surprised by the good quality of the book. I agree with other reviewers that it should contain answers, and it is INCREDIBLY annoying that there are typos within the book itself (!), but we're getting reading material from essayists and poets as opposed to trite little tourist phrases, and perhaps the lack of an answer key was to influence the reader to become more of an active learner...to study the writing provided, to study it's structure and affirm for oneself whether one is correct or not, or even influence the reader to (in the age of the internet) ask a fluent speaker, who would be incredibly happy to know someone else is attempting to master a language they love.Perhaps I'm overthinking it ;)Either way, Basic Tagalog is inexspensive enough where you can purchase it, take what you need from it, and leave it if you so prefer...or become interested in adopting a ruggedly lyrical, resilient language and connecting with the equally resilient people who've bothered learning it.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Thanks to this book, I'm now reasonably literate in a second language. I was stationed in the Philippines while in the U.S. Navy, and wish I'd had this book then. This book provides a nice working vocabulary, pronunciation guide, and basic grammar. This is THE book to have to start learning Tagalog.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a foreigner to the Philippines who had to learn Tagalog as a second language, this book helped me the most. The lessons are simple, clear, and easy to apply in your everyday conversations. Make this the first book you buy, and it may be the last.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "For the low price, this book is worthwhile even for beginners. however, the beginner should use this as a reference and jump into it once some foundations are grasped. And do the written exercises!The ideal beginning book for me, \"Beginning Tagalog; a course for speakers of English\", is an audiolingual textbook from 1965 that I just happened to find gathering dust in my university library (no luck finding the original reel-to-reel tapes!). I wish I had Aspillera's book as a reference when I plowed through this textbook, as all the tourist phrasebooks are useless.Though I had read \"Basic Tagalog\" cover-to-cover earlier this year, I put it in my backpack this summer, so that I could do some of the written exercises while living in the RP. I strongly recommend doing this, as it helps reinforce grammar. Also, speak out loud to yourself, and your understanding will also grow exponentially.BTW, I met one westerner in Taiwan who learned Tagalog from the Aspillera book, and raved about it. Since he was quite fluent, I took this as evidence that language learning is what you make of it. Don't blame the books, just be thankful they are out there!The subtitle of this book is \"for Foreigners and Non-Tagalogs\"; at the end of the summer my Visayan wife took this book home to Mindanao. She told me that the design of the book really is helpful to Pilipinos whose mothertongue is not Pilipino, despite the language training they get in school.In sum, this book is very valuable for the serious learner of Tagalog, the basis of the official Pilipino language. Save your money by buying this instead of any of the tourist phrasebooks that might tempt you. Mabuhay!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you buy one Tagolog book - buy this one. This is the most complete Tagalog book, especially if you want to learn the language enough to be understood.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "chemistry cliffs ap",
        "description": "Test prep for the AP Chemistry exam, with 100% brand-new content that reflects recent exam changes Addressing the major overhaul that the College Board recently made to the AP Chemistry exam, this AP Chemistry test-prep guide includes completely brand-new content tailored to the exam, administered every May. Features of the guide include review sections of the six \"big ideas\" that the new exam focuses on: Fundamental building blocks Molecules and interactions Chemical reactions Reaction rates Thermodynamics Chemical equilibrium Every section includes review questions and answers. Also included in the guide are two full-length practice tests as well as a math review section and sixteen discrete laboratory exercises to prepare AP Chemistry students for the required laboratory experiments section on the exam.",
        "authors": "['Angela Spangenberg']",
        "infoLink": "http://books.google.nl/books?id=yzLDrQEACAAJ&dq=Chemistry+(Cliffs+AP)&hl=&source=gbs_api",
        "categories": "['Study Aids']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I could go off and brag about how well I did on the exam and then say it was all because of this or that. I'm going to skip that and get straight down to it. It is like a formula sheet. This book is great if you understand what the equations are for. If you don't, you might consider another book. Currently I haven't found a book that contains a better description of the labs, so if you haven't had much experience in the lab before the AP test you might need this book. (BTW question 5 on free response is a lab question. It draws the questions from one of the 22 labs you were suppose to do in the course. If your school is anything like mine you won't do more than 14 or 15.) But again it is a bookl that focuses on the equations, which is silly seeing how the multiple choice section doesn't allow you to use a calculator. (Most of the questions on my test in the m.c. were concept. Those that were calculations were basic and the equations needed were so simple you'd shoot yourself if you didn't know them.) Buy the book for the labs if you need that review, otherwise don't buy it at all. In case you're curious i got a 4 on the test (i followed the crowd). It's always that equilibrium problem that gets you!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I got a 3 on the exam with a teacher and a chem program at school which had never had anyone even attempt the AP test. However, this book alone will not get you a 2. This book is excellent when it comes to teaching you how to do the math but horrible when teaching you concepts. The princton review is excellent at teaching you concepts, but horrible at teaching you how to do the math. So my suggestion is you do them together and with your college Chem book. I pretty much taught myself everything and am proudly probably the first student at my school to pass the Chem AP test. I've also been told Barron's is quite good so you could try that as well. So only accompanying princton review could this book be helpful, labs don't really help much unless you actually do them. Don't be mistaken, this book won't tell you how to do the lab specifically, only skims through them.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Don't use this book. The lab guy gives the wrong impression. First off, the lab questions on the AP test are the ones you need to least worry about, usually very straighforward since you can't do a lab in a written test. In terms of the rest of the stuff in the Cliffs book, we used some of it in class and it the book is so riddled with mistakes that we stopped using it. USE PRINCETON REVIEW. Awesome book, straightforward, clear, won't put you to sleep.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have been teaching AP Chemistry for 10 years. I started using Mr. Thorpe's book when it came out. I recommend it to all my students. This year I had a 96% pass rate and a large number of A's. I think the book was instrumental in preparing my students for the AP exam. I highly recommend it to any student of Chemistry.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book to help me, as I'm not the best in the chemistry department. If you are in a similar situation, do not buy this book. It has an extremely minimal amount of actual study material, and even skips over some topics completely, even after listing them in the 'key terms' section at the front of the chapter. Shouldn't a study book actually define the key term rather than leave you to look it up and study it from other sources? You might buy it thinking it looks kind of good, but then the week before a big intermolecular forces test, find out that it doesn't mention so much as a sentence on the topic.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is completely useless. Basically it is a formula sheet on recycled paper. Don't let fancy colors fool you, there is nothing in this book. Apart from the lab sections and the reactions sections, this book falls flat on its face when it comes to conceptual questions, (which the AP Exam deals a lot with). Not worth the money.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is not very good mainly due to the fact that it doesn't explain what it needs to when it comes to a topic. The book does not go as indepth as it needs to go to get the complete concept across. Instead I would request the REA AP Chemistry beceause it allows you to practice with 5 Practice Tests, and then goes over every answer individually to explain what you did wrong. It is a much better study aid.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "it has an awesome lab review section, but the review was nonexistant. I did not like how the book was put together or how it had a key terms section which did not explain the key terms. I am surprised that Cliffs would put out a book of this caliber. It's like the review was an afterthought compared to the lab section.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The best part about this book is that it teaches the reader 'to the test'. For example, it has a specific section devoted to the Writing Reactions part of the test, along with all essential labs. Every section has accurate sample AP questions, multiple choice and free response. Barrons lacks all of these previous elements, but Barrons reviews comprehensively. On the other hand, Cliffs barely reviews: each chapter has at most 2 pages of formulas and/or basic concepts. This makes Cliffs a perfect supplement to the Barrons.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I would only buy this book to supplement the Barron's AP Chemistry prep book. It really doesn't have any reading material on any of the subjects. It presents everything in bullet form and just lists the equations and key words. No explanations here. Plus the answers and work to the practice problems are shown right below the question, which I did not like. I did use it as a quick reference guide for qualitative analysis stuff, and the effects of ions on the pH of solutions. I used it to review for electrochem also. Some people like the extensive lab chapter, but I didn't really look at it. If I ever forgot the equation for something or needed to look something simple up I would go straight to the Cliffs AP. But for more in depth studying or preparing for tests, I would use the Barron's. I got a 5 and owe it more to the Barron's book then the Cliffs.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]