[
    {
        "Title": "sedona treasure of the southwest",
        "description": "A visual tour of Sedona's many attractions",
        "authors": "['Kathleen Bryant']",
        "infoLink": "http://books.google.com/books?id=IndCAAAACAAJ&dq=Sedona:+Treasure+of+the+Southwest&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is a great \"coffee table book.\" It's a nice gift to someone who has been to Sedona and misses it, as well it gives the pre-visitor to Sedona a decent idea of what to expect from Sedona visually. I only say \"decent\" because, well, Sedona is THAT beautiful. The book is done superbly and effeciently.While my husband and I honeymooned in Sedona for 5 days in October, the weather changed dramatically from sunny, windy, rainy, dry, wet, humid, crisp and refreshing and back to sunny again. Nothing was ever ugly, or less than jaw-dropping, about it. Additionally, it is simply an interesting place to be because constantly, all day long, Sedona offers 360 degree views of something curious to look at. Even the buildings, shops, architecture, private homes are all somehow tickling to the senses. What keeps you focused is where the mountains are placed. It helps you to remember you're feet are still on earth.This book, purchased while in Sedona, we felt was a good summary of that feeling. We hope you like it. ~~ Mr. & Mrs. G.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "This book is a must-have for every visitor to the Red Rock Country, resident, or lover of the majesty of this area. For $$$$$ this book is definitely the best deal out there! The full page, color photos are spectacular and the writing is intriguing. This is a memento of Sedona that will take you back to the beauty of this magical place no matter how far away you are.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "Sedona is one of those places on earth that when you visit, you are touched by its ever changing beauty forever. This lovely offering is filled with spectacular photographs and natural history, recreation and historical information. Having visited Sedona many times, this book truly captures the essence of this unique piece of landscape that attracts so many people for its beauty, its mystical power and its outdoor activities. Northland Publishing has produced a \"coffee table type book\" without the often lofty investment expense. If you have ever made a pilgrimage to Sedona or long to visit, this is the book that you must have in your home library. Truly, a beautiful book.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is a wonderful snapshot of the Sedona area! Just leafing through it brings back many memeories of being in the area. Wonderful photos and great information. At an unbelievable price! A wonderful gift at not much more than the price of a card!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Someone else described this as a \"coffee table\" book. that is exactly right. the pictures are nice, but there is not much information in it. If you are looking for a book about sedona to help you know what to do there or how to get around or just good basic information - you won't find it here. and it's too big to take it with you on vacation.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have bought several books on Sedona in the past and this is by far the best. The pictures are large and vibrant and the descriptions and information are accurate. The book covers formations, wildlife, flora and fauna, cultural history, etc.I am taking my third trip out to Sedona this month and this book gave me new insight to some places to go and the history that lies within Sedona. This is a great book and it is always on my coffee table for all to see the beauty of Sedona.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Excellent book. It captures the most beautiful scenery around Sedona. I keep it out on the table to remind me of some of my favorite spots in Sedona.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a large, thin paperback which would probably be a nice souvenir of Sedona (I haven't been yet!) but was not what I was hoping for. It's my own fault for not reading the reviews more closely. It's a little more useful than a (very) similar book called \"Secret Sedona\" which is also a large thin, paperback filled with nice photographs but not the practical information I am looking for as I plan our upcoming trip. I bought several books about Sedona from Amazon recently and none of them have been as useful as the information I can find on the web.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "tie dye the howto book",
        "description": "Learn the history and secrets of tie-dyeing and create your own beautiful fabrics This user-friendly book will show you how to create seven unique and beautiful designs. Clear, simple instructions including photos of each stage of the tying and dyeing process will guide you. Includes a source listing of permanent high quality dyes.",
        "authors": "['Virginia Gleser']",
        "infoLink": "http://books.google.com/books?id=ZN6wdX8LiEsC&dq=Tie+Dye!+The+How-To+Book&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was very let down when I saw this book. it is basically the same book she wrote a few years ago. It has more history and chit chat...but I couldn't find any new patterns. Her last book said that certain patterns would be available in her next book, coming out soon. Maybe I missed one? I am surprised that a spiritual community would be deceptive in their marketing of this book. While it is an excellent book, it is not a new book.",
                "review/helpfulness": "30/38",
                "num_reviews": 38
            },
            {
                "review/text": "This book has excellent illustrations on how to tie-dye but I was disappointed that there were no pictures illustrating the final product. For someone with limited knowledge of tie-dying, I had to guess what the project would look like after it was completed. Otherwise, it is a very helpful guide.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "This book was an excellent how-to book for beginners. I found the diagrams of how to tie the fabric very helpful. Great for school teachers, or camp because it also contains alot of history and origens of tie dye. This book gives specific directions and ingredients essential to successfull tie-dye.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "This book gives you a quick overview of tie-dyeing. It provides you with directions, five designs with color pictures and, best of all, sources for tie-dyeing. I read it in one night and was on-line ordering products.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book was the best starter book I've found on tie-dye. The steps are easy to follow and many resources are given on creating great tie-dye from scratch. I've met the author at craft festivals where they show the clothes. They are amazing people and create incredible artwork. Better than anything out there. The eldest son just inherited the business and I look forward to what new things they create. Their company is Harmony Enterprises and are located at: http://harmonytie-dyes.com",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I've purchased several tie dye books and DVDs, this is my primary \"go to\" book. Author does a fantastic job:1. Tells you at a high level the end-to-end process of tie dying2. Has text, accompanied by black and white photos on how to tie.3. Has at least one color photo of each finished tie dye project.You will understand how to tie dye several different types of patterns, and be successful at your first attempt, if you follow the information and advice.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I'm a beginner and I honestly got more information off of one internet site than I did in this book. It's okay, but not great.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I purchased this book and found the folding techniques to be very useful. I got tired of making the same tie dye circles and was looking for something different. This book shows several detailed folding instructions to get different results. This list of resources in the back was helpful as well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is pretty good, but if you really want to know how to tie dye and get really bright results, this is not the book for you...I was expecting some secret techniques for how to get the bright rainbow variations, how to keep the white areas white during a rinse and first wash...reviews of some dyes out there...and I didn't feel this book covered that area too well....butThe folding instructions are great!easy to follow and I got some amazing results...I was just frustrated with the actual dyeing recipes and techniques, I needed more detail in that dept.but all in allthis is a pretty good intro to tye dyeing book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I am a beginner tie-dyer who bought this book as I'm looking to start hand-dyeing. When I received it, I was impressed by some of the photos, particularly of the mandalas, but disappointed by the small number of ultra-simplistic designs she gave, the sketchy directions, and the poor design of the book (the photos showing pleating/folding, tying and dyeing are B&W; you have to flip to the back of the book for color photos of the tied and finished item).It wasn't until I received an amazing tie-dye DVD, extremely generous in the scope of its instructions and designs (\"Learn How to Tie Dye\" complete 3-volume set) that I realized how deficient this book really was. Another reviewer gave it as his opinion that Ms. Gleser would prefer you not to succeed; I would agree. Perhaps she's afraid of competition?--surely a groundless fear. Her extremely generalized instructions leave a lot to chance; you might end up with a decent item, but you're much more likely not to. She gives no tips to ensure success or make the process easier (and after decades of successfully selling tie-dye, she must know a lot). To add insult to injury, at the back of the book in the color plates are pictures of beautiful mandalas made by \"tie dye experts\" from her business. Yet there is not a word of instruction on how to make them. The implication, to me at least, is that she's happy to make money selling her unhelpful book to novice dyers who don't know any better, but she feels it's only the esoteric society of expert dyers like herself who are privileged to know the secrets of the more advanced techniques.Don't waste your money on this book. I returned my copy. Buy the DVD mentioned above instead; it's a bigger investment, true, but the amount of clear, step-by-step guidance, helpful advice and design inspiration make it worth ten times the purchase price. Tie-dye is an art form, and art is only passed on when it's taught and demonstrated by generous teachers, not jealously guarded.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "collectors guide to antique chocolate molds with values",
        "description": "Reiche as well as the lesser known American companies. It also gives today's market values for antique chocolate molds. Whether you're an expert collector or a novice, this book is a definite must have for your library. Book jacket.",
        "authors": "['Wendy Mullen']",
        "infoLink": "http://books.google.com/books?id=kHRGMg8GOXoC&dq=Collector%27s+Guide+to+Antique+Chocolate+Molds+with+Values&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was very impressed with this book. The pictures were beautiful and so vivid. I gained so much knowledge of chocolate molds, there was so much information. I display my book on the coffee table, it is a real conversation starter.I located the author's website at: [URL]. The site has great deals on your favorite chocolate molds.I would highly recommend this book.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was thrilled when I was able to get an autographed copy of this wonderful book! I was even more excited when I opened it! It is FULL of gorgeous pictures of antique chocolate molds! It gives us a wonderful history of these treasures! It also includes beautiful photos of antique post cards and other special memorabilia from the past, that correlate with these special molds. It is an exquisite book! I have shown it to others who have thoroughly enjoyed reading it, too! This book is a one-of-a-kind resource for valuing these wonderful pieces from the past! The author, Wendy Mullen, clearly went to great lengths to give us the information AND treat us to many extras! I am very impressed with this book and can't wait to see what else Ms. Mullen will give us!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Wendy's passion for these exquisite little works of art is evident in her first &quot;Collector's Guide&quot;!~ Fabulous photography and colorful antique postcards displayed with the moulds just add to this wonderful book's appeal~ I highly recommend it to anyone who loves chocolate moulds, antiques, or who just appreciates the fine workmanship in everyday items of a bygone era. I personally use it as my &quot;wish book&quot;, hoping to come across more of these great moulds in the future!~ Excellent!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a beautiful book with wonderful color photos of about 350 chocolate molds-includes pricing information--great for Antique Shops!Wonderful postcards and tradecards relating to the candy industry-they make the book really colorful. Buy the book as a gift or for use in your store--you will love it!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Whether you are already a passionate collector of these wonderful pieces of art and history or a novice just starting the adventure of collecting, Wendy's book is a treasure. As my love of chocolate molds and my collection grow, I find myself turning the pages over and over again. The book is well-organized, informative, and full of beautiful photographs. The author is obviously knowledgeable and very enthusiatic about her subject. Somehow the book has the ability to both sooth and excite. I truly can't wait until her next book is available. Enjoy.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "complete guide to united states army medals badges and insignia world war ii to present",
        "description": "The most complete guide to United States Army medals, ribbons, rank, insignia, and patches from WW II to the present day. Each medal and insignia shown in full color. Includes listing of respective criteria and campaigns.",
        "authors": "['Frank C. Foster']",
        "infoLink": "http://books.google.com/books?id=s9gVkgEACAAJ&dq=Complete+Guide+to+United+States+Army+Medals,+Badges+and+Insignia+-+World+War+II+to+Present&hl=&source=gbs_api",
        "categories": "['Technology & Engineering']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I make military shadow boxes for people all the time. When I first started I did my grandfathers. All we had was a picture of him in uniform and his discharge paperwork. When I received his info from the VA, it said he was part of the 213th Coast Artillery. I had never heard of such a thing. I spent 2 months writing to Army historians to find out what this was. It took me alomst a year to find the insignia on ebay. When I received this book, it had a section on Coast artillery and showed all of it's insignia! If I had had this book sooner it would've saved me a lot of time. It has lots of detailed information. There's one of these books for each branch of service. I plan to collect them all since people keep showing me civil war, WWI, WII photos with things on the uniforms I've never seen before. Now I just look at the book and there it is.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "An excellent book for any collector!! I've been a collector of Army patches, medals and badges for sometime now. There were a few patches and medals in my collection that I couldn't identify. When this book arrived I was quickly able to find the unknown patches and medals and identify them. It even had full color pictures and gave history on the medals. I would recommend this for any collector and it must be invaluable reference to any soldier in active duty or the reserves.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "roseville in all its splendor with price guide",
        "description": "Roseville pottery has become a popular antique ware to collect, and with this guide the patterns can be identified, variations seen, and values estimated. The alphabetical organization is easy to use.",
        "authors": "['John Bomm', 'Nancy Bomm']",
        "infoLink": "http://books.google.com/books?id=dRDaAQAACAAJ&dq=Roseville+in+All+Its+Splendor:+with+Price+Guide&hl=&source=gbs_api",
        "categories": "['Pottery']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is wonderful! As a novice in collecting Roseville, I don't know what I would do without it. &quot;Roseville In All It's Splendor&quot; has given me everything I need to buy wisely. The information is given in an easy to understand format. There isn't a day that goes by that I don't refer to this book. If you collect Roseville this book should be in your library. If you don't collect Roseville - buy the book anyway - it's a great art book!",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is a wonderful book for collectors, dealers, or even if you just want to learn about Roseville. The pictures are awesome, and the price guide in the back is a great help. I would recommed this book above any other Roseville book.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "As author of the book, I thank everyone for their kind response. I am sorry that some of the pictures are not real clear but you must remember that these company plates were salesman sample pages some from the late 1900's. The newest pictures are from 1954. Since the book has been selling for six years now and has sold over 20,000 copy someone must be satisfied with the book. Watch for our new Roseville book coming out by the end of the year. It will be a collectors size book with all the pictures and prices plus place for all your information.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is much better organized than the other Roseville books, and very comprehensive. However, the quality of the photos is much worse since most are pictures of catalog photos. And many have incomplete model numbers in the pictures. Too bad!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "The Bomms' have amassed the finest single historical description of Roseville's output ever compiled, period. Several other people have produced excellent books but none as complete as Bomm's. They managed to access and photograph a nearly complete collection of Rosevile's catalogue pages which, if not pretty, definitively reveal the item number (get a magnifying glass) of each displayed piece.I don't vouch for prices quoted, but the information is irreplaceable.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "the definitive guide to colorful insulators",
        "description": "Collecting insulators is synonymous with collecting history. Ever since the first telegraph line was constructed by Samuel Morse in 1844, glass, plastic, and other insulators have played an important part in our technological society. They have made it possible to carry telegraph, telephone, and electrical power lines over vast distances, connecting the nation and the world. This is the first book ever to graphically demonstrate the hundreds of beautiful colors to be found on insulators throughout the world. There are over seven hundred color photographs, each with a descriptive caption to guide both the beginner and advanced collector through a huge assortment of designs and manufacturers. Each photograph carries a current value for the item shown. No other book captures the beauty found within this colorful and historical hobby.",
        "authors": "['Michael Bruner']",
        "infoLink": "http://books.google.com/books?id=bLqbAAAACAAJ&dq=The+Definitive+Guide+to+Colorful+Insulators&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Wonderful photographs and extremely informative. The book itself is a wonderful addition to anyone's collection! Highly recommend!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Extremely well put together book with excellent pictures, research, values and general information. If you are looking for a book about insulators, then this is the book for you.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "So many people have antique insulators in their basements and attics but don't know what they are worth. Most insulators aren't worth much at all ($1-$5 a piece), but the rare few are worth hundreds to thousands of dollars to serious collectors. Before you get rid of the &quot;old junk&quot; in your attic make sure you know what its worth. This book is the definative authority on collectible insulators. Otherwise you'll never know if you have a &quot;diamond in the rough&quot; or just a box of junk.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I own this book and wish I hadn't bought it. It is basically just a collection of pictures of pretty colored insulators, with prices. There is NO ORGANIZATION WHATSOEVER!The insulators are not arranged by color, manufacturer, style, age, embossing, or anything else! It's completely random-- and there is NO INDEX so there's no way to find a particular piece except to page through it. This is very, very bad-- I've never seen a randomly arranged, indexless reference book before. That's because it's not a reference book, not a \"guide\"-- it's just eye candy.Which might be OK, but the photography is not good! The colors are not accurate-- often they are too saturated-- and the shots were up taken from far too close so the insulators all suffer from major barrel distortion.Definitely do not recommend this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "As my title indicates, this is an excellent coffee table book... colorful and full of information. To the avid collector however the book lacks the quality of a reference book. Without a index one has to page by page thumb through an entire section to find specific items.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "fossil collecting in the midatlantic states with localities collecting tips and illustrations of more than 450 fossil specimens",
        "description": "Describes the fossils of Pennsylvania, Delaware, Maryland, Virginia, and West Virginia, and how and where to hunt for them",
        "authors": "['Jasper Burns']",
        "infoLink": "http://books.google.com/books?id=5rAnVerOIbgC&dq=Fossil+Collecting+in+the+Mid-Atlantic+States:+With+Localities,+Collecting+Tips,+and+Illustrations+of+More+than+450+Fossil+Specimens&hl=&source=gbs_api",
        "categories": "['Nature']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "One of the few books that reveals actual fossil hunting locations--for good reason. Because of frequent visiting, some of these sites have experienced overcollecting or damage to the natural surroundings (undermining rock faces, etc.). If visiting, please be sensitive to the environment and the site's neighbors. Best to stick to quarries or big highway cuts, where environmental impact is not a factor. These happened to be more productive fossil-wise than the more scenic locations, anyway, so everyone wins!",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Before leaving Germany for my next job at Langley Air Force Base, VA, I discovered Jasper Burns' book and ordered it from Amazon.com (THE Bookstore that linked us to home while away and connects us to the world now that we are back). Suffice it to say, I was biting at the bit to see if Mr. Burns' words would bear fruit, or more importantly, fossils. In short, his location directions and pictures of fossils to be found there were spot on. If they were listed in the book, I have found and added them to my collection i.e sharks teeth (some as large as 6 inches),whale vertebrae, shells, etc... An excellent guide and reference! If you live on or plan to visit the Mid Atlantic Coast and enjoy spending time searching and finding fossils, this is THE book to own. Thank you Mr. Burns and thank you Amazon.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book contains information on over 45 fossil-collecting sites in Maryland, Delaware, Pennsylvania, Virginia, and West Virginia. Each site description contains detailed directions on how to find the site, what to look for when you get there, and drawings of representative specimens that the author has found there. The drawings help with an initial identification (e.g. &quot;shark's tooth&quot;), but the serious collector will want to consult a more detailed work for positive identification (e.g. &quot;tooth from a Galeocordo aduncus&quot;). The book also has very useful advice on what equipment you might need (not much is needed, but the advice and tips are excellent). Drawings",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "One of the best guides to invertebrate fossils hunting I have read. Drawing from his experience in the Appalacian region (mainly West Virginia and Virginia), the author offers many fine sites which are accesible to the professional and amature alike. Was well worth the 8 hour drive from New Jersey and the cost of the book ! Includes excellent annotated references as well.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I went to many of the fossil locations mentioned in the book and came home with a load of fossils. It was a great book, one of the best fossil books i've ever seen. I would recommend this book to any fossil collector.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was helpful for me because of the life-like illustrations. While I have only visited one site discussed by the author, his drawings have been a great comparison point against the typical fossil guides' pictures.The author's interest in his hobby is contagious - I recommend you read the book and share his passion.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The book is laid out well and is easy for the layman to understand. The localities are varied, and the directions to them, plus the drawings of the fossils, are accurate and beautiful. I highly recommend this book to anyone even mildly interested in hunting/collecting fossils.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "brilliant rhinestones vintage contemporary jewelry",
        "description": "A companion for jewelry lovers and rhinestone collectors searching for that special piece of jewelry, this book aids in identifying the good from the bad, and the valuable from the worthless pieces. Over 750 color photos identifying over 950 pieces. Designers include Coro, Lisner, Kramer, Haskell, Trifari, Judy Lee, Hattie Carnegie, Napier, Beau Jewels, and Gerry's. 25 vintage advertisements showcase the costume jewelry of the past, as well as signed sterling from the 1960s and 1970s, men's pieces, and other fun accessories. 2003 values.",
        "authors": "['Ronna Lee Aikins']",
        "infoLink": "http://books.google.nl/books?id=4NezpemWWK0C&dq=Brilliant+Rhinestones+Vintage&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Without a doubt the worst book on vintage costume jewelry ever published. Unless you're a newbie collector looking for a guide to what NOT to waste your money on, don't bother.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "Lots of nice photos in this book but there is very little information about dating jewelry. Vintage and contemporary jewelry are mixed together so a newbie will not know what is old and what is new. It looks like the author took pictures of all her jewelry and then added values that a seller could only dream of getting. There are many jewelry books out there that are very informative but this is not one. Don't waste your money!",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Little information, very inflated prices on low end costume jewelry. Misleading for novices, no information for seasoned collectors. I wish I could sell things at these prices!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I'm surprised to see this book has received such poor ratings because though I agree with other reviewers that it has its flaws, I don't think it is a bad book at all.I bought this book at the bookstore without first looking up any reviews online. At the time, I had to choose between Aikins' book and one other book that had better photographs and a sleeker look. The Aikins' book won me over because most of the pieces are dated and they are photographed in their entirety and on their own. There is nothing wrong with focusing on a portion of a necklace or photographing a piece surrounded with props, but I also think it is important to be able to see what type of findings were common at a particular period in time (although the backs of earrings and brooches were not photographed for this book).Most of the jewelry in this book is from the 1940s to 1950s. There are a few from the 1920s and earlier and a couple from the 1970s and 1980s. I like the variety of necklaces, bracelets, pins and earrings the author shows in this book. In fact, every time I open it, I seem to find a new piece that catches my attention even though I have read the book from cover to cover. This is not a book for those looking for historical references and explanations about the different styles and trends in jewelry fashion. For that, I would recommend such books as C. Jeanenne Bell's \"Answers to Questions About Old Jewelry\". \"Brilliant Rhinestones,\" on the other hand, is more adequate as a visual reference for those who want to familiarize themselves with the \"look\" of a variety of pieces of vintage rhinestone jewelry.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I got the book \"Brilliant Rhinestones\" as a gift several years ago, and I thought at the time that the prices were way, way off - I've never seen such high and uneven prices for costume jewelry. Plus, the book's written content is extremely amateurish and, frankly, irritating in the extreme. Well, to spare my good friend's feelings I didn't share this opinion with her - told her the book was great. So, what did I get for my birthday this year? Yikes!!!!! The next edition, (20th Century Costume Jewelry) even more irritating than the first!! I bear no ill will towards the author, I'm assuming the publisher reeled her in to do another book (this stuff is kind of like the old \"vanity press\", isn't it?) and is counting on the book to sell just because these books are hot right now. But beware - this latest book has prices for modern jewelry that is absolutely, totally based on fantasy (for stuff you can load up on at Goodwill)and the prices for real vintage jewelry is also way off, about like her first book.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I purchased both this book and the sister companion, 20th Century Jewelry and felt that it was on my list of one of the worst photographed books that I have seen. There are two others by this same publisher that are lackluster in photography. Little information about the jewelry history is included in both books. While I appreciate all that the author has going for her (no doubt the other review was written by her husband), a little more attention to photography detail would have made this book much more enjoyable. I felt that the prices were a little over inflated which is a shame for both books because gorgeous jewelry is featured, just lousy photography to show them off.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "98 degrees backstage pass",
        "description": "A full-color 50-photo scrapbook of the cutest boy quartet that has ever ruledthe airwaves.",
        "authors": "['Nina Zier']",
        "infoLink": "http://books.google.com/books?id=wfQRPFSh5PMC&dq=98+Degrees+Backstage+Pass&hl=&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book has some awsome pictures of some pretty awesome guys. It has fact, qoutes, everything. I think that every fan should have this book. I love all of them.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I thought this was a very good book. It provided good, factual information about each of the members of 98 Degrees. The pictures in this book were awesome all full-color. And it gave some of their famous quotes, interviews, vitals, and faves. It is a must-have for any fan of 98 Degrees. Some of the information you may already know, but at least here you'll have it all in one place. There was no typos or mistakes that I could find. So I hope by reading this review you'll be encouraged to buy this book. My best advice is to buy their official book in September! Thanks, Jill",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a great book if you are looking for pictures about these four hot babes ! The facts are quite useful if you are just starting to know these four talented guys . This is a good book to add to your 98 Degrees collection . Got to HAVE it due to the hot pics . But if you are looking for something better and with baby pics of the guys , I should highly recommand , their official book . It touches my soul deeply . 98 Degrees , God Bless .",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "vintage jewelry a price and identification guide 19201940s",
        "description": "Features more than 1,000 pieces of old white metal and rhinestone jewelry from the 1920s-1940s. Explains the fashion trends that influenced the designs and offers price and identification data.",
        "authors": "['Leigh Leshner']",
        "infoLink": "http://books.google.com/books?id=zWdNuQEACAAJ&dq=Vintage+Jewelry:+A+Price+and+Identification+Guide,+1920-1940s&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Sorry to disagree with everyone, but I am greatly displeased with this book. The pictures are beautiful! But there are only eleven pages of text, in very large type, and with a lot of pictures there too. Which means there is very, very, very little information. And in that small amount of information, I found several inaccuracies, therefore I can't TRUST any of the information I DON'T recognize as being inaccurate. There are very few mentions of famous designers, but two of their names are misspelled. An oval rhinestone is the same shape as a marquise rhinestone, it says. There are TWO pictures which each contain three similar-but-different items, where the captions in both cases say that the picture shows three IDENTICAL items. And the price listings are SO MUCH higher than what I see on even the highest priced web sites or jewelry shows in the New York area. Umm, pretty pictures though.",
                "review/helpfulness": "30/33",
                "num_reviews": 33
            },
            {
                "review/text": "This book is one of the best books for illustrations of the white metal/rhinestone forms of jewelry. All the photos are of high quality and show the pieces well. I found the price advisories to be questionable because the values listed seemed very high for local auctions and dealers and WAY high for the eBay world. Perhaps this is because the publication was over 2 years ago so the prices are even older. All in all a nice book - just get a second opinion on any $ values.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "&quot;Vintage Jewelry: A Price and Identification Guide, 1920-1940s,&quot; by Leigh Leshner, is a visually stunning reference work. The back cover notes that the book features more than 1,000 pieces. The emphasis is on pieces made with white metal and rhinestones. Included in the book are some special sections on the following topics: the history of rhinestones, cuts and shapes of rhinestones, settings used to hold rhinestones, types of metal used in jewelry, and suggestions for collecting jewelry. The bulk of the book is a price and identification guide: a huge gallery of full-color photos with descriptive text.Overall, this is a beautiful and informative book, but I felt that at certain points the text needed tighter editing. Pictured are many different types of jewelry: fur clips, brooches, necklaces, bracelets, earrings, etc. The pieces shown employ many different styles and motifs: birds, floral designs, Art Deco designs, filigree work, butterflies, whimsical human figures, patriotic motifs, etc. Rhinestones of different shapes, sizes, and colors are shown. And for aspiring collectors on limited budgets, the book helpfully shows a healthy number of pieces valued at less than $50. I recommend this book to anyone who enjoys looking at beautiful photographs of dazzling vintage jewelry.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Amazing photos of a terrific selection of Vintage Rhinestone Jewelry! However I was hoping for more variety, not only rhinestone. Maybe the title should be more specific. Over all and excellent guide that is very colorful and fun to look at.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "The author has wisely given us 400 beautiful pictures ofold white metal costume jewelry. Since so much is unsignedthe pictures will make it easier to evaluate pot metal pieces.This is the first book devoted entirely to white metal and isin a class all of its own. The illustrations make this a&quot;coffee table&quot; book. The author establishes all the variablestaken in when pricing. All the jewelry in the book is mintcondition. In few words she also explains that the book isdevoted to the beauty and value of the jewelry, minimizing theimportance of signed pieces. Thank you Miss Leshner.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "If you can only add one book on vintage costume jewelry to your library this year, this is the one! It is chock full of invaluable, well researched information, gorgeous photos, and an accurate, realistic price guide - not to mention a collection of beautiful jewelry I would love to have in my collection! This is a winner, hope more by this author will follow.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Without a doubt, one of the best books on this period of jewelry. I have all the books in Leigh Leshner's series and cannot rate them high enough. Brilliant photographs, excellent jewelry samples and wonderfully informative on jewelry from this period.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Leigh Leshner has created a visual feast for jewelry collectors. The book's 400 or so color pictures of a 1,000 pieces of vintage jewelry are simply beautiful. The combination of historical information, prices and page after page of spectacular photography make for a dazzling book. Even if you're not a collector you'll enjoy paging through this lovely book. And if you are a collector you'll cherish Leigh's work for years to come. Spectacular. This is a must for your library.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "An exceptional review and history of jewelry from the 1920s through 1940s. Leigh gives the reader a wonderful insight in to the beauty of jewelry from this period by sharing many pieces from her personal collection. Lovely book, gorgeous photos, excellent descriptions. If you are intrigued by rhinestone jewelry from this period, Leigh's book is definitely one for your library. Being both a collector and seller of vintage jewelry, this book has broadened my insight in to pieces from this period. A book that I highly recommend for your resource library. Exceptionally presented by Leigh.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the best of wood boxes",
        "description": "This craftsman's companion celebrates the woodturners, furniture artists, and elite craftsmen from around the world who have taken box-making to a higher level of aesthetic form. Little Book of Wooden Boxes features 31 of today's finest woodworkers and artisans--such as Michael Hosaluk, Steven Kennard, Richard Raffin, Jacques Vesery, Bonnie Klein, and Hans Weissflog--who share their amazing techniques, their inventive talents, and the inspiration that fuels their distinctive designs. Each artist's profile includes full-color, studio-quality photographs of their most spectacular work, including jewelry boxes, desk boxes, reliquaries, keepsake boxes and more, along with insights on their design ideas and objectives. Curated by nationally known historian and author Oscar P. Fitzgerald, this attractive hardcover book makes a wonderful gift for any woodworker.",
        "authors": "['Oscar P. Fitzgerald', 'Peter Korn']",
        "infoLink": "http://books.google.com/books?id=l7FouQEACAAJ&dq=The+Best+of+Wood+Boxes&hl=&source=gbs_api",
        "categories": "['Wooden boxes']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The book presents attractive photographs of a number of boxes that will stimulate aspiring beginning and intermediate box builders.Though offered to suggest &quot;how to&quot; construction guidance, especially with plans, the book has only the most meager detail of construction and nothing that can truly be called plans. The introduction warns readers that the boxes presented ought not be copied and if they are legal action is a possibility. The result is a book more bent on preventing copies of the displayed boxes than providing useful information for the box building reader.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "The other reviewer is correct. Certainly the title promises plans for these boxes. The plans are just one drawing of the box with a list of materials. So if you want to make these boxes, you'll have to do some figuring out. However, if you want to be inspired, check out this book. Even non-woodworkers will page through this book and find the boxes shown to be beautiful and neat. Boxes as objets d'art... who knew?",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I bought this book thinking that it contain info on tips &amp; techniques, as well as detailed plans; I was wrong.The 127 pages are filled with color photos of interesting boxes, but not much else. There is a materials list for each piece, but no plans or instructions beyond a stylized isometric sketch.If you are looking for a book on boxes to decorate your coffee table, this is the one. If you are looking for a practicle guide to box construction, look elsewhere.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "400 polymer clay designs a collection of dynamic colorful contemporary work 500 series",
        "description": "Unique creations by top artists such as Nan Roche, Cynthia Toops, Barbara McGuire, and Gwen Gibson make this the best showcase of polymer clay work ever assembled. With everything from jewelry and vessels to art dolls and sculptures displayed in superb color photos, the versatility and beauty of the medium is exquisitely evident. Mosaics, millefiori, canework, and molded, stamped, and embossed pieces: there's a little bit of everthing to please the eye. Dayle Dorowshaw's magical Egyptian Spell Book features carvings and image transfers that blend seamlessly with gold leaf, candles, branches, and silver. Luann Udell's faux-ivory artifacts take their inspiration from the prehistoric art in France's Lascaux Caves. It's the largest-and finest-book of contemporary polymer art available anywhere.",
        "authors": "['Suzanne J. E. Tourtillott']",
        "infoLink": "http://books.google.com/books?id=hbUW7zn5O0kC&dq=400+Polymer+Clay+Designs:+A+Collection+of+Dynamic&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "This book has nice photos of great creations by polymer clay artist. The photos are not small with only one or two items on each page. It gives the name of the artist, and some of the materials used. It has no instructions for any projects or techniques, so if that's what you want don't buy this. If you are already a great polymer clay artist, you will find inspiration looking at the pictures. Most are very complicated and are not for beginners. It's a great price for so many pages of photos.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "The pictures in this book are beautiful, but I will probably be reselling it on Amazon because it is just like looking at a coffee table book. Once through, and you're done. There are so few really good polymer clay books (The Art of Polymer Clay being one of them), and this one is not one of them. The photography is impressive, the designs are beautiful and innovative, but if you're looking for a book that teaches you something - forget it. This isn't it!",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book is a stunning gallery of what all is possible in polymer clay. I do have two of my own pieces on this book, and it is a huge thrill to be included in this book.This is a must have book for anyone who loves creating stuff from polymerclay. There are jewelry pieces, sculptures, wallpieces... Items vary from usefull to art pieces. This book probably has examples of any techniques that have so far been used with polymerclay. Really interesting, highly entertaining and very inspiring book.",
                "review/helpfulness": "20/23",
                "num_reviews": 23
            },
            {
                "review/text": "This was a book of brilliant, professional, and beautiful polymer clay designs and product. Unfortunately, I wanted to know how the designers made these pieces (at least a short synopsis) and there was not a hint of that in any one of the pieces that I liked. So if you want a book of designs and creations only of very, very talented artists -- this is the book for you.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "Within its 352 pages you will find unlimited inspiration and ideas for new and varied clay projects. Even if you are not an accomplished polymer clay artist, this book will inspire you to explore the wonderful, varied world of polymer clay.From cover to cover, feast your eyes on 400 breathtaking photographs, each one more stunning than the last. Every aspect of polymer clay design is explored in the pages of this book. If you need inspiration to start a new craft or if you are a seasoned polymer artist, the techniques and designs will definitely spark your creativity.Every technique is represented with close up, clear and colorful photographs. The exquisitely detailed photographs exemplify the works of many talented well-known clay artists with materials used and different techniques. Each and every page glorifies the experience of polymer clay design.It should definitely be in every polymer clay enthusiast's library.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "A friend of mine lent me this book she called it a \"cofee table book.\" I think this a very appropriate title. I found this book not only interesting but inspirational, there are a wide range of artists inside who use a large variety of different types of art using polymer clay. This book would be appropriate for someone who is fascinated by what is possible with polymer clay. Well worth a look.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "The book was surprisingly thick for the small cost it's being sold for. All the pictures are full color. No black and white photos. Images are large enough to see detail so you can learn new techniques and get ideas for your own projects. Overall, I'd say this book is a winner!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "All of Larks 400 and 500 series books are not instructional: they are inspirational. This book showcases some of the best polymer work being done. I have pored over and over it for the past year and I never tire of looking at it!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is not instructional. It's inspirational. The pictures are wonderful!If you need something to get you through those dry spells, this is the book for you. Just flip through the pages and get inspiration from the designs of these multitalented artists.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I really like the book and find it very inspiring. I am very disappointed in the quality of the book itself, many of the pages were torn at the edges and several were not cut apart.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "terrific tablecloths from the 40s 50s schiffer book for collectors",
        "description": "Terrific Tablecloths from the '40s and '50s is a must have book for anyone interested in textiles. These tablecloths take us back to mom's or grandma's kitchen and the colorful prints inspired by wartime victory gardens, mountain dogwood, and springtime bouquets. And who can forget the wonderful souvenir maps from vacations in Florida? More than 400 color photographs are here to be enjoyed. Captions and updated values make this an invaluable resource for collectors, designers, and antique dealers.",
        "authors": "['Loretta Smith Fehling']",
        "infoLink": "http://books.google.com/books?id=Ja9RAAAACAAJ&dq=Terrific+Tablecloths+from+the+%2740s&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Although this book beautifully catalogs hundreds of vintage tablecloths, it is virtually devoid of any solid information about them. Maybe I'm looking for something that doesn't exist, but I had hoped to learn more about when certain styles of tablecloths were designed and manufactured, who the designers and manufacturers were, the trends in tablecloths over time, the homemaking culture that went with them, how to care for them (and repair them), and maybe even a little about the vintage tablecloth market--what's hot, regional trends/specialties, etc. In short, I had hoped for something a little more scholarly and not just pretty pictures. Nonetheless, with very few resource books on the topic, this book does at least show the variety of vintage tablecloths that exists. And that's a start!",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "Being an avid printed tablecloth collector for many years, I was happy to see that a reference book for these lovely tablecloths had finally arrived. I was very disappointed by the fact that there was not much in the way of the history of the tablecloths in this book. I was appalled at the photos of tablecloths that had not been cleaned or ironed! I have yet to order her second book, and only hope that she has paid much more attention to details when it comes to photographing these wonderful old tablecloths!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book has beautiful pictures of a nice assortment of vintage tablecloths but absolutely no history or other information regarding them. It was almost like looking at someone's home videos. Rather than &quot;here's where I've been&quot;, it is a &quot;here's what I collect&quot;. In this case a picture is NOT worth a thousand words. Too expense for the final product.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Although I agree with the other reviewers about the lack of text and collecting information in this book I am very happy with the book overall. The photos are clear and are great for seeing what the various colors used during the time period should look like and what color combinations were used together. It would have been very helpful if there was information included on which colors were more desirable, and which sizes were more desirable or harder to find.I am a collector of so many varied things though, that I never feel like a book is &quot;too much&quot; for the final result. Yes, it is about $30 but it is a book that I have gone back to time and again to compare with things I've seen in person.Unfortunately just about ALL of the prices are exactly the same. It almost seems as if they were better left out than to be so unimportant.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "fifty years of fashion jewelry 19251975",
        "description": "Shows a variety of brooches, bracelets, pins, pendants, necklaces, and earrings, briefly describes the history of jewelry manufacturers, and explains terms dealing with jewelry",
        "authors": "['Lillian Baker']",
        "infoLink": "http://books.google.com/books?id=bAc4AQAAIAAJ&dq=Fifty+Years+Of+Fashion+Jewelry+1925-1975&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book was very informative. It gave the information I needed about some collectible jewelry I am accumulating. It gives a more in-depth history of the manufacturing of many collectible brands than other books I have seen. I would highly recommend this book for vintage jewelry collectors.",
                "review/helpfulness": "51/56",
                "num_reviews": 56
            },
            {
                "review/text": "I started collecting vintage jewelry about five years ago and I had no idea what I was doing. This book really helped me identify a variety of items and their value. Pamela D. Blair, Author The Next Fifty Years: A Guide for Women at Mid-Life And Beyond",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The value in this book is definitely for the beginner jewelry collector. Many jeweler names are mentioned, with colored pictures of some of their designs. This book is a good springboard for further detailed research by jeweler name recognition. The book also holds value for crafters, there are many excellent colored photographs, of unique designs. The book I purchased did have updated prices to 2001. I could not use this book to value any of my pieces except one, and that was worth the price of the book, because I undervalued the beads, shown in the piece.I would not overpay for this book, at a good deal, add this book to your order. Probably best as a library reference book. Quick read. Value is in jeweler name recognition, list, and for jeweler craft ideas.I have many vintage family pieces that I have no information on identifying from this book, and I don't think this book would aid me in collecting either. I think the prices shown are rather low.Mistreglo",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "creative bookbinding",
        "description": "A guide to hand book-binding.",
        "authors": "['Pauline Johnson']",
        "infoLink": "http://books.google.nl/books?id=leVomBC0QIsC&dq=Creative+Bookbinding&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "A must-have for your collection of books about bookbinding. In these pages you will be introduced to the parts of a book, materials, tools, and working procedures. Then the meat and potatoes of a variety of book forms well illustrated with photos covering simple pamphlets and note pads to wood covers, accordians, and binding with leather. There is a wonderful chapter on designing and creating your own unique papers using a variety of printing methods, stencils, marbling, paste, painting, 3D appliques, and more. There's even a section on book restoration. One of the pleasures of this book was the discussion of the tools and how to use them, especially book presses, adhesives, sewing frames, and cradles.",
                "review/helpfulness": "70/73",
                "num_reviews": 73
            },
            {
                "review/text": "Don't let the 1990 date fool you; this book was originally published in 1963, and the 1990 reprint made only minor updates to two pages of supply source listings. While the basic concepts in the book are pretty much timeless (book stitching, basic cover creation, etc.), the &quot;creative&quot; portion of the book -- suggested artwork techniques for book covers -- is distinctly '60s. This covers about 1/3rd of the book's contents. If you are interested in the &quot;creativity&quot; side of book cover art, I would suggest looking for a newer book on bookbinding. Better yet, leave the cover plain, buy Print Shop, and whip up a dust jacket for the artwork ;-)",
                "review/helpfulness": "29/35",
                "num_reviews": 35
            }
        ]
    },
    {
        "Title": "miriam haskell jewelry schiffer book for collectors",
        "description": "Miriam Haskell began selling beautiful costume jewelry in 1926, and her company continues to the present. The jewelry that bears her name is highly sought after and the prices keep spiraling up. Claims abound that this is a Miriam Haskell, but is it a Miriam Haskell? This important new book gives collectors the key information to make intelligent buying decisions. It provides specific details on the art, design, style, materials, construction, and signatures, all vital to the identification and dating of Haskell jewelry. It also dispels many of the myths that allow wanna-bes and fakes to flourish. Over 600 beautiful color photographs display the most extensive collection of Haskell jewelry ever brought together. The jewelry is categorized by designer, specifying notable eras. The text provides notations on innovations, style preferences, and in-depth descriptions pointing to key Haskell identifiers. Readers, from casual admirers to serious collectors and dealers, will find in this comprehensive book the essential information and breathtaking pictures they seek.",
        "authors": "['Cathy Gordon', 'Sheila Pamfiloff']",
        "infoLink": "http://books.google.com/books?id=IG4SPwAACAAJ&dq=Miriam+Haskell+Jewelry+(Schiffer+Book+for+Collectors)&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Not just a pretty picture book but a work of serious investigation and scholarship. By far the best book on Miriam Haskell jewelry, filled with n beautiful photographs AND a treasure trove of never before known information. For every level of collector. Extremely helpful in identifying older unsigned Haskell pieces. A top notch piece of work. I have well over 80 books on vintage costume jewelry and this ranks as one of the best!",
                "review/helpfulness": "42/42",
                "num_reviews": 42
            },
            {
                "review/text": "A superb book for the new or even seasoned Haskell collector. The photography is first class, the selection of pieces is spectacular and the descriptions are a pleasure to read. This book is worth its weight in gold for the knowledge it provides in assiting you in recognizing authentic Haskell pieces, dating them and placing a value on them. It has set a new standard in Collector books that hopefully the other writers will soon follow.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "If you love Haskell jewelry, you need this book. In fact, you need this book if you love costume jewelry of any kind. It is thoroughly researched, beautifully photographed, and with exactly the kind of information for which jewelry collectors hunger.Do you want a coffee table book full of beautiful pictures? Here it is. Need a price guide to Miriam Haskell jewelry? Here - with real insight and useful information about what makes pieces more or less valuable. Do you want to know more about the history of the company and of the people who made it? There is a wealth of carefully researched information, much of it never before published.Best of all, for fans of Haskell jewelry, is the detailed information about construction techniques, designs, lines, beads, findings, and all the details that allow us to separate the wheat from the chaff, and genuine Miriam Haskell jewelry from the mountains of lookalikes and wannabees.This is a masterpiece of a jewelry reference book. If only they were all this good!",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Impressive all the way around, Gordon and Pamfiloff have outdone themselves putting together a superior reference. When people ask me about this book (and they do!), I tell them the knowledge gleaned on unsigned Haskell pieces will more than pay for adding this title to a reference library straight out of the gate. However, poring over the entire text and perusing all the photos is a must for anyone enamored with vintage costume jewelry. Quite simply, don't miss this one! -- Pamela Y. Wiggins, Author of \"Buying and Selling Antiques and Collectibles on eBay\" and Antiques Guide for About.com (www.antiques.about.com)",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Whether you're a novice or a seasoned collector,dealer or jewelry historian, this book is a MUST HAVE for any jewelry lover's library. Meticulous research includes the history of Miriam Haskell and her designers,clear and concise detailing of construction, manufacturing techniques and how to spot the fakes.Beautiful photography of mouthwatering jewels show the front as well as the most important and often neglected backs of the jewelry, clasps, findings, etc. This book sets the standard that all books on costume jewelry should follow. Not just a pretty picture book, but the ULTIMATE jewelry reference. Thank you Cathy and Sheila for a SPLENDID job well done!!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "MIRIAM HASKELL JEWELRY A Schiffer Book For Collectors - With Price Guide by Cathy Gordon &amp; Sheila Pamfiloff just released is a must for all vintage costume jewelry collectors.This hard cover book with dust cover has over 600 photographsby co-author Sheila Pamfiloff unless otherwise indicated - other contributions duly noted on the acknowledgement page....text starting with the history of Miriam Haskell - to identifying and dating Haskell Jewelry - advertising and a fine example of Haskell Watercolors - on to the Haskell Designers , Frank Hess, Robert Clark, Peter Raines, Larry Vrba, to Camille Petronzio who will carry the Legacy Forward - into the future of Miriam Haskell.Each page of this 256 tome of work is aglow with text or pictures of this exquisite work of Miriam Haskell. Cathy and Sheilain their text and photographs have paid close attention toshowing detail plus workmanship and design even finding a groupof a collection of old Haskell filigree charts.Chapter 3- Advertising and the Haskell Watercolors - have matched the watercolor with an actual piece of the jewerly. Whatfiner attribution could be shown as with the ad and the pieceof jewelry.Great care was taken in the presentation and page set up ofthis publication. Jewelry collectors of all levels will findthis work of art a must for their jewelry library.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Dealing with jewelry is both to me, profession and hobby. So I also like reading books about the stuff I love, and this one really got past my expectations. It helps getting insight not only in a really interesting branch of the jewelry business, but tells also about the people behind the design. At the same time, the author manages to give a helpful guide to the ambitioned collector of that kind. The book reminds one how much fun it is to create and wear exceptional pieces and tells some stories that are connected with those. The pictures are magnificent. This book is motivation for new ideas and simply fun to read.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "The jewelry world has been waiting for this one. Cathy and Sheila have put togather the next Best Seller of collectable Jewelry Books!As you open the book you can see right away that the authors have done their home work on Miriam Haskell jewelry. The layout, information, and the pictures have been put togather in a Masterpiece of a book. Well done Cathy & Sheila......Sam Mitchell, Respected Member of \"Jewelry Ring\", Member of \"Vintage Fashion & Costume Jewelry\", Ower \"www.ourfavoritejewels.com\"",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "OK- I ordered 2 of these Schiffer books- this one and the Juliana one- and I'm blown away by how a publishing house can get away with such amateurish work in this day and age. Great collection of jewelry, but really, it's obvious that the author has spent many years and tens of thousands of dollars collecting this jewelry... Go ahead and splurge on a professional photographer, lady. I've looked at the author's web albums and it is pretty pitiful to say that these images look better on an amateur photo hosting site than on a $40 professionally published book. Lots of pictures, yes, but the resolution and color timing is horrible- these were obviously taken with somebody's consumer grade point & shoot without the aid of a macro lens, then cropped into the area where the actual subject is. And absolutely no color correction, so the colors lack definition and depth. The result is a nice, well informed book full of grainy, flat, poorly lit images of what I can only imagine are lovely pieces of jewelry.I've bought many of these \"collector guides\" for different kinds of jewelry & antiques and they seem always to be (obviously) self-published, with bad pictures and pie-in-the-sky prices. I'm a dealer and a collector, and I'm really just buying these to learn more, visually, about pieces I'll probably never get a chance to see in person. I'd like to see photos that show details of the design and construction. There's just no excuse for the poor quality images in this book. I've seen better close-up shots taken by drunks wielding an iPhone. I've seen better shots taken by dropping a necklace onto somebody's scanner for ebay. No excuse.My advice- next book you publish, track down some teenager on the yearbook at your local high school and just ask for help. It's not that hard.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "What a wonderful book! And eagerly awaited by fans of the fabulous Haskell jewelry. This book has quickly become THE encyclopedia of Miriam Haskell, showing amazing jewelry, fantastic watercolors, and up close and personal photographs of the jewelry, most especially the backs where construction is so important in identifying unmarked jewelry by this important designer. Every collector will want to add this book to their collection. Thank you to Cathy Gordon and Sheila Pamfiloff for giving us exactly what we wanted, and then so much more.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "growing orchids the complete practical guide to orchids and their cultivation",
        "description": "growing orchids The complete practical guide to orchids and their cultivation An inspirational encyclopedia of orchids, with guidance on the best orchids to choose Clear, practical advice on growing and displaying orchids indoors, under glass and outdoors Everything you need to know to grow orchids successfully, with step-by-step information on potting and mounting orchids; propagation; feeding, watering and light levels; and dealing with pests and diseases An easy-to-use Orchid Directory of over 200 fabulous orchids, with photographs of each orchid and vital information on habitat, size, flowering time and growing requirements Over 600 specially commissioned photographs.",
        "authors": "['Brian Rittershausen', 'Wilma Rittershausen']",
        "infoLink": "http://books.google.com/books?id=h-ecFCiL9qQC&dq=Growing+Orchids+-+The+Complete+Practical+Guide+To+Orchids+And+Their+Cultivation&hl=&source=gbs_api",
        "categories": "['Orchid culture']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is one of the best buy in its price range. It contains about the same information that you find in 40$ books and the quality of the colour pictures (there's is a zillion of them) is almost as good. I really can't understand why it scores so low in terms of selling rate. The beginner can use it as a starter. This book can be used by the intermediate orchid lover as well: it contains everything to get well established in this hobby. Highly recommended. An excellent alternative to this book is \"the complete guide to orchid's\" By Ortho books.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book combines spectacular photographs, practical growing tips, interesting orchid history/folklore, and adequate descriptions of evergrowing number of varieties. I am relatively new to the art of orchid-raising, and I found this book inspirational.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I agree with the reviews below. The book is helpful, educational, thorough. It clearly conveys the authors' passion for orchids and I can see it being inspirational. The photos are magnificent. The only drawback is that if one just wants a guide on keeping an orchid alive and blooming, this book might be more sophiscticated than one wants. This may be because there are SO MANY types of orchids, that tips on care need to be very specific, but there must be a resource out there just for care of the hearty, common hybrid orchids one is most likely to find at florists and garden centers.That said, all I wanted was a simple book, and I am glad I got more.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a big beautiful book with over 600 color photographs. Complete and easy to follow instructions for growing orchids inside or outdoors. The book also includes a directory of over 200 orchid varieties with growing requirements for each. This book enables anyone to successfully enjoy the rewarding art of orchid cultivation.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "elian mccreadys needlepoint",
        "description": "A glorious collection of this well-known needlepoint designer's best work to date. Artist and embroiderer Elian McCready has been one of the best-selling designers for Ehrman Tapestry for years, and this book includes work that has previously only been available in kit form, as well as six new creations. Elian's work is theatrical and larger than life, but her skill is to create highly colored yet subtle results. The projects are worked in tent stitch and long stitch, and superb colour charts and photographs make the instructions easy to follow. Materials for each project are listed and there is advice on stitching and making up.",
        "authors": "['Elian Mccready']",
        "infoLink": "http://books.google.com/books?id=jA6557TKYHgC&dq=Elian+McCreadys+Needlepoint&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a wonderful book, but be careful. It is the same book as the hardcover that Amazon is listing as a great book to get WITH this one. They have the same title, but the cover changed with the paperback.",
                "review/helpfulness": "38/38",
                "num_reviews": 38
            },
            {
                "review/text": "I really like Elian's artwork in needlepoint. She has a good sense of combining colours to bring out the most beautiful floral display. This book was not a disappointment. There are already a few projects that I would like to complete some day. It really is one of my favorite needlepoint book.",
                "review/helpfulness": "17/26",
                "num_reviews": 26
            },
            {
                "review/text": "I have books by Graham Rust, Candace Bahouth, Kaffe Fassett, Beth Russell among other notable designers in needlepoint and this is the only one that I want to do every design in the book. The charts are easy to read, with symbols in addition to being colored. I wouldn't recommend it for a true beginner, but it is a fantastic book.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I am very pleased with this book. The designs are very beautiful and colorful. I have purchased books in the past that did not inspire me to begin a project like this book.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "For those who want designs for flowers this book has many wonderful ideas to follow, I am sure that I will be using it often.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I was absolutely delighted when this book arrived. Not only are the designs superb, the general layout of the book is excellent too. There are full page close ups, so that you get a really good feel for exactly how the tapestry will look. The instructions and graphs are very clear and the photography is beautiful. I highly recommend this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "silver jewelry designs evaluating quality good better best",
        "description": "Beginning at the end of the Victorian period, this book takes the reader through the designs and relationships of Arts and Crafts, Art Nouveau, Art Deco, Mexican, Native American, Mid-century Realistic, and Modern Abstract styles right up to the 1990s. Over 700 beautiful color photographs show the details, makers' marks, and fine workmanship of each piece.",
        "authors": "['Nancy Schiffer']",
        "infoLink": "http://books.google.com/books?id=q8y5wAEACAAJ&dq=Silver+Jewelry+Designs:+Evaluating+Quality+Good+*+Better+*+Best&hl=&source=gbs_api",
        "categories": "['Silver jewelry']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As a coffee table book, 'Designs' is an excellent and pleasant pictorial example of silver jewelery from around the world. As a reference work for a collector 'Designs' at more times than is acceptable is a headache to read. Attempting to determine which of the illustrations fit the authors descriptions is time consuming and should be unnecessary.This problem is evident in the photos of multiple pieces and in the good, better, best sections. For reference purposes, order is lacking. For good, better, best selection, information is lacking.As a jewelery catalog, this book passes muster. As a reference work, I will return the book to its owner and will not purchase a copy for my own modest library.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "As a jewelry designer, I found this book to be incredibly valuable. While the text is not particularly well written, the photography is outstanding. Great detail shots. Many of the pieces have pictures from the back as well as the front, which is very valuable if you are trying to determine how a piece was made. Signature marks are shown as well. It is a good chronological view of the history of jewelry using spectacular examples of work. I learned a great deal from this book and would recommend it to other designers. As a book for collectors, I thought the assessment information (good, better and best) was without meaningful context and also had no monetary reference. Designers - this is a 5 star book. Collectors - this is a 3 star book.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I collect silver jewelry--mostly Mexican &amp; bought this book as a reference.I think the photos are great, especially the colorful ones in the first part of the book on Arts &amp; Crafts, Art Nouveau, &amp; Art Deco jewelry, however, the &quot;Values Reference&quot; price guide in the back is very poor. There are no prices listed for many of the pieces shown in the book &amp; the descriptions in the price guide often don't quite match up with the descriptions accompanying the photos, so it is hard to determine the correct price. Also, I think some of the prices quoted are way too high if you compare the prices in the book with, for example, prices on E-bay.If this book is ever republished, I think the &quot;Values Reference&quot; should be totally revamped &amp; I think the photo captions should follow a more logical order--such as from top to bottom or clock-wise. In the present edition they often don't.Buy this book for the lovely photos, but if you need a price guide I don't recommend it.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "1000 glass beads innovation imagination in contemporary glass beadmaking 500 series",
        "description": "They're the very best in contemporary glass beadmaking, 1000 dazzling and unique examples by an international array of artists. This color survey has it all: the beads come single or in multiples, in jewelry or sculptural pieces, flameworked and kilnformed; and their diversity and beauty are amazing. Julia Skop's intriguing Secret Surprise showcases clear glass beads with millefiori slices at the ends. Bruce St. John crafts his beads out of diachroic glass, then fuses and coldworks them at the lapidary well after completion. Nebula Black Necklace, from Rene Roberts, features an organic-looking focal bead adorned with fine metal leaf, glass shards, and a subtle dot decoration. An artist's comment and detail image accompany many of the photos. A Selection of the Crafters Choice Book Club.",
        "authors": "['Valerie Van Arsdale Shrader']",
        "infoLink": "http://books.google.com/books?id=t-cZdgnBZ4AC&dq=1000+Glass+Beads:+Innovation&hl=&source=gbs_api",
        "categories": "['Crafts & Hobbies']",
        "ratingsCount": 5.0,
        "review": [
            {
                "review/text": "If you're looking for a how-to manual,keep looking. But if you're looking for a book with beautiful photographs of glass beads, you're in the right place. Each page contains photographs of beads by talented glass artisans. What's especially nice about this book is that there are artists represented from many different skill levels. For an intermediate glass artist like me, it's good to see that I've come a long way, but there is still so much territory to explore. The photographs in this book catalog this evolution exquisitely.It's inspirational and almost overwhelming to see so many gorgeous beads together. It will provide me with inspiration for a long time.I would recommend this book for artists and collectors alike.",
                "review/helpfulness": "37/39",
                "num_reviews": 39
            },
            {
                "review/text": "Wow, what an amazing book! Whether you love glass beads and lampwork or you just love beautiful art, I believe you will be thrilled with this book. This book is definitely not a 'how to' book for those who want to make beads, but it is sure to inspire you beyond your imagination. There are over 400 pages in this book with very little text, however each page contains one or two, large, full color, highly detailed photos with a caption giving you the name of the artist and a very brief description of their technique. There are hundreds of different artists featured in the book with just as many different styles.... and these are not merely 'glass beads', these are absolute works of art which left me in awe every time I turned the page. (By the way, the price of the book definitely belies the quality, I honestly was not expecting such a high caliber book for this price.)",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "I'm actually a polymer clay artist, and I've gotten more out of this book than *any* other book I've purchased/read in the never-ending quest to inspire and improve my work. There aren't any instructions or biographies, just huge, detailed photos of many, many glass beads, and some information on technique and materials.For me, this book challenged me to get out my clay and try and re-create what I was seeing. It's impossible to have the same effects in glass and clay, so my results weren't similar, but I wound up discovering new canes, new techniques, and new ways to work with PC. This book is truly an education. I also dabble in watercolor, and the beautiful art inspired me to really try and get more a depth in my work.It's an amazing inspiration for anyone in the arts- especially those interested in jewelry and beads. Even guests who come to the house who are not interested in glass/beads/jewelry are stunned by the book. Total eye candy!Treat yourself!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book is a joy to gaze at. It is beautiful and elegant. The color photography is outstanding. Don't buy this book if you are looking for flamework instructions. But the images will stir your creative juices. I bought this book twice, one for my glass teacher and one for me!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is essentially a picture book of beads. If you're looking for a book to show you how to make beads, then this is not it. There is no instruction provided. If you make lampworked beads and you're looking for inspiration, then this is a must have. The photography is well done and in full color. The beads are just breathtaking and awe inspiring.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "knife tomahawk throwing the art of the experts",
        "description": "Great designs, great knives! In 101 Knife Designs, join master smith Murray Carter as he reveals the successful traits of knife designs that have lasted throughout history. Knife enthusiasts and knife makers alike will learn to: Identify common traits in great knives. Understand how to apply them to new knife design. For the first time ever, Carter shares details of his personal collection of successful patterns--created and perfected over decades of designing and making knives. Dazzling, full-color images of completed knives--from renowned photographer Hiro Soga--provide inspiration and direction as you apply these principles to create your own custom knife designs. With 101 Knife Designs, you, too, can make practical knives that will become cherished keepsakes.",
        "authors": "['Murray Carter']",
        "infoLink": "http://books.google.com/books?id=6BdPuQEACAAJ&dq=Knife&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I purchased this book from Amazon.com in May of 2000 and found it to be excellent. I have always wanted to know how to throw knives and after reading for just one hour, I took several kitchen knives and was sticking them in the backyard tree, eight out of ten times. I am ordering several professional throwing knives and recommend this book to anyone interested in the art of throwing knives or tomahawks. Towards the end of the book, the author shares a numbers of very interesting stories about professional knife throwers and those who hunt with throwing knives.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "I just got the book a week ago and this book is old and outdated, it is not hard to tell. There are very few pictures, and a distorted sense of organization. Half of the pictures were drawings of irrelevant knives. I thought I would get detailed information about throwing, but most of the book is dedicated to famous knife throwers, and not to helping you learn. It is short and overpriced. A real let-down. I would get a more up-to-date book on the subject.",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "An excellent treatise on the art of throwing things. I've been trying to throw knives for years now, unsuccessfully. After reading Harry McEvoy's first book &quot;Knife Throwing: A Practical Guide&quot; I had to read the follow-up. Terrific, alone or together, these books are a must read for anyone interested in throwing knives, or any weapon. The stories told by the author are fascinating as well as historical. Connect with knife throwers of the past and present, read these books.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is VERY interesting, it contains useful information about the throwing knife and the tomahawk (like the proper way to throw). it also contains great storys about spesific knife-throwing exprts and their extreme throws (like the longest known throw which is AMAZING), this is the kind of books that you start reading and cant stop, and after that youll find yourself reading through it agian and again (the storys told here are great for making people look at you funny and ask &quot;how the hell do you know all this cool stuff?!?&quot;). and with all that you will finaly understand how to throw the knife and make it stick! before i had the book i couldnt do it, but know i stick the knife more than miss it (btw the book also has info about making your own target board in your backyard)",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Harry McEvoy covers a wide range of knife throwing topics in this &quot;knife throwing classic&quot;. Hunting, targets, history, the military and the most sought after tips and secrets of &quot;throwing the steel&quot;. If this is your sport, buy it; read it once, read it ten times, I did.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Some reviewers have been disappointed with this book, but I must say that all you need is this book, a little time, some open space, and a tomahawk. While I prefer Coldsteel's Norse hawk, and Bad Axe, I have found that the lessons learned in this book, have given me the ability to throw a tomahawk in remarkably little time.In the past, many people have advised me on some truly terrible advice. But, this book has helped me actually throw a tomahawk, and it is filled with interesting adecdotes too. It is everything that I could want from a book on the subject, but I must admit I would be interested in a DVD on the subject as well. If digital photography and video were around when this book was first written, that product would be an exceptional find. But, it is a book that I am reviewing, and I must say that it is well worth the money, and well worth the time it takes to read it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "HARRY McEVOY WAS A DEAR FRIEND OF MINE LIKE HOWARD COLE.I NEVER MEET HIM IN PERSON,BUT TALKED AN CORRESPONDED WITH HIM FOR 15 YEARS BEFORE HE PASSED IN 1993.THIS IS THE MOST COMPREHENSIVE BOOKS ON KNIFE AN HAWK THROWING I HAVE EVER CAME ACROSS.I HAVE ALL THE BOOKS HE HAS WRITTEN,INCLUDING;SCAGEL THE MAN AND HIS KNIVES..I JUST RECEIVED.I ALSO HAVE TWO OF HIS THROWING KNIVES,A BOWIE AXE FROM THE 1970'S THAT WAS IN VIETNAM,BUT NEVER USED,HE GAVE ME.I ALSO BOUGHT A STINGER MODEL '91'BY HIS NEW COMPANY THROWING BOWIES BY McEVOY.IT IS #93 OF THE FIRST 100 MADE.AFTER YOU READ THIS BOOK YOU WILL BE ABLE TO THROW A KNIFE OR A TOMAHAWK LIKE AN EXPERT IN A COUPLE HOURS OF PRACTICE.I NEVER THRU EITHER OF HARRY'S KNIVES CAUSE I WANTED THEM MINT.BUT COLD STEEL HAS COME OUT WITH AN ALMOST EXACT COPY OF THE BOWIE AXE,AND A COUPLE OTHER COPIES OF HIS KNIVES.I WAITED A LONG TIME TO THROW A BOWIE AXE,NOW I HAVE ONE AS CLOSE TO THE ORIGINAL AS POSIBLE TO THROW.SO IF YOU WANT TO LEARN TO THROW,THIS BOOK IS GOLDEN,AND IS WORTH EVERY DIME,ESPECIALY AT THESE REASONABLE PRICES.MAY GOD BLESS HARRY'S SOUL..ROLAND DELAUNEY-RDR KNIVES",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Very interesting facts on the subjects of knife and tomahawk throwing as well as the people who made them famous. I recomend this to anyone interested in learning about the art/sport.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "shoes a celebration of pumps sandals slippers more",
        "description": "The Marabou Mule. The Chanel toe. Jackie O's pump. Marilyn's stiletto. And lotus shoes and fetish shoes, shoes made for coronations and inaugurations, Cinderella's slipper, shoes of tulle, brocade, rhinestone, python, fish scales, and feathers, and much, much, more, including the two-foot-high wooden chopines of the 16th century and their resurgence as the platform shoes of the 1960s and 1970s. Shoes, now with over 357,000 copies in print, is an obsessive, over-the-top extravaganza-chunky, full-color, and irresistible, it contains page after page of seductive photographs and information about women's shoes. Created for the woman who's a passionate shoe lover-and what woman isn't?--Shoes features over 1,000 glorious photographs, most of them taken for the book. Includes Footnotes (fascinating facts about shoes); Foot Soldiers (profiles of master shoemakers from David Little to Andrea Pfister); and The Shoe that Left an Imprint, focusing on one shoe that changed history-remember Courrage's futuristic go-go boot? Shoes is, as they say, to die for.",
        "authors": "[\"Linda O'Keeffe\"]",
        "infoLink": "http://books.google.com/books?id=gsBCn7K-7tcC&dq=Shoes:+A+Celebration+of+Pumps,+Sandals,+Slippers&hl=&source=gbs_api",
        "categories": "['Design']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "This book is so much fun! I bought a copy for my (equally) shoe-crazy aunt, and she and I cackled for hours reading about the scandalous sandals and far-out footwear displayed. The pictures were fabulous! The author has a great sense of humor, as well as of style. Some of those shoes are soooo snazzy! This book also was interesting in that we were able, by the shoes that they wore, to see the role of women in society in various ages and countries. This book also makes an excellent &quot;bathroom book,&quot; lotsa quick quips and eye-catching pics. Whether you are looking for a history of the shoe, an introduction into shoe styles or stylists, or an opportunity to seethe with shoe lust, this book fits the bill.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "A great coffee table book for shoes! Color photos with history on every page. Lots of trivia like showing Elizabeth Taylor's beautiful high heel shoes worn during Cleopatra, famous shoe designers favorite high heels like Ferragamo's fantasy shoes, Manolo Blahnik's amazing shoes for different eras, David Evins rhinestone &quot;stop and go&quot; mules for Ava Gardner in 1955 &amp; a twisted pearl sandal for Grace Kelly in 1959. Lots of interesting tidbits throughout and well worth the money to buy this book. If you enjoy shoes you'll love this book! :)",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This &quot;index&quot; of shoes shoes how people (particularly females) have gone through years and years with that one friend(or several in some people's cases). That one friend is &quot;the shoe.&quot; I have always had a shoe fetish, ever since I was a young child. And when I found a book on this subject, I was quite surprised that someone would actually write about the topic: shoes. Well I have come to realize that this author, Linda O'Keeffe is an extraordinary author, and I wish to read more of her books!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I've owned this book for a couple years now and am looking through it again. I've given this book as gifts and I show it to a lot of the people who pass through my life. It's just too much fun. As a wee \"coffee table book\" it has sparked countless conversations and has even helped settle a bet.The photography is incredible and the book is a real stomp through history's closet. If you have a passion for shoes (the book says that the average American woman owns 30 pairs), then you'll love this book. Fun, fun, fun!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is the proof--rare--that information, scholarship can be fun, interesting, page turning. I loved the format, the range (from the first shoes, to mules, to doc martins...) and in all the places I've searched, this is one of the few books, frivolous as it may first appear, that has photos of authentic &quot;lotus&quot; slippers worn by chinese women with bound feet. I wish I'd saved every pair of shoes I've ever owned after reading this, and that my family members had, too--history! That shoes are ART is evident here--yet they must bear the weight and gait of the wearer--unless it's Cleopatra, I learned. Or a rich daughter whose shoes are expected to wear out on their first, and last outing, to a dance. I hope there's a sequel--more pictures, more history, more shoes, shoes, shoes. I read every word and looked at every photo at least once, and would like to see more, particularly the historical shoes.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is worth the purchase just for the forward! It features wonderful comments and quotes like, &quot;When it comes to shoes, practicality and comfort are beside the point.&quot; And, &quot;...You look down at your feet and wink at yourself.&quot; But the photos are stunning and the information delightful! Terrific fun for the footwear fancier.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Being a shoe lover, I found this book very interesting and eye catching. I've read it several times and learn a new thing each time I pick it up! I would recommend it to any and everyone!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a cute little (literally) book about shoes, the history of shoes and the style of shoes. It's a great reference book in terms of different styles. I wonder how many women bought and wear the giraffe shoes? (which by the way is the most creative pair of shoes in the book.)",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "A quick overwiew of the shoe's history and lore, but it is not nearly as insightful as some of the other books that are available on shoes. I love shoes and collect them as fervently as the other readers of the book, but I didn't find it as fabulous as say, the book by Colin McDowell, which offers information that is more intriguing. I think what everyone loves about this book is the small size. But the really cool info about shoes is to be found elsewhere.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I never knew there were that many styles and shapes of shoes! I think it's a great book. Not an everyday viriety kind",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "shop drawings for craftsman inlays hardware original designs by gustav stickley and harvey ellis shop drawings series",
        "description": "Drawings are accurate, complete and fully detailed. Gives readers complete information for reproducing these signature motifs.",
        "authors": "['Robert W. Lang']",
        "infoLink": "http://books.google.com/books?id=f1PwAAAACAAJ&dq=Shop+Drawings+for+Craftsman+Inlays&hl=&source=gbs_api",
        "categories": "['House & Home']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is a great resource for those of us who wish to see in great detail various inlay patterns in Craftsman furniture. Most photo-oriented books really do not take the time to focus-in on the inlay, leaving the details a blurry mystery. The author has taken the time to reproduce authentic inlays using Autocad line drawings. This is a highly specialized kind of book and I was elated to find it! Leave it to Robert Lang to give us the expert's details.The book could be greatly improved by the addition of close-up color photos of the inlays the designs were taken from.A great addition to the Craftsman movement! A 5-star effort!",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "I bought this as an inspiration for my wife who makes boxes. We both love the book and have come away with some great ideas!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the complete book of knots",
        "description": "This text provides easy-to-follow instructions for selecting and tying more than 100 of the most useful knots. With knots for climbing, sailing and fishing, every knot contains information on its history and development, alternative names and its uses.",
        "authors": "['Geoffrey Budworth']",
        "infoLink": "http://books.google.com/books?id=rc_QngEACAAJ&dq=The+Complete+Book+of+Knots&hl=&source=gbs_api",
        "categories": "['Knots and splices']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Geoffrey Budworth's book is mistitled &quot;complete&quot; but does not miss the mark for this knot-tyer. &quot;Knots&quot; has a very clear layout, excellent graphics, and is supported by clear and concise descriptions, including some invaluable history. It doesn't miss a beat of the essential information for beginners and masters of the art alike. It certainly does not contain every knot known, but it is complete in the sense that every useful, most of the decorative, and certainly all of the essential knots have been included for all knot-tyers, be they climber, sailor, caver, angler, outdoorsman, indoorsman or scout. Geoffrey distinguishes between them all very nicely with a graphic tab that can easily be located. A great buy and well worth the small investment.",
                "review/helpfulness": "44/46",
                "num_reviews": 46
            },
            {
                "review/text": "I bought this book for my husband for Christmas, and we've both come to like it very much. Neither of us are &quot;knot aficionados&quot;, as it were, but wanted a book which would allow us to explore some knots we might need in our outdoor activities (horseback riding, camping, sailing, etc.) As the beginners at knotmaking we are, this book has proven to be excellent for us.At the very beginning the book has a directory of the knots contained, listed by name, page number, application (sailing, caving, climbing, and so on), and description. In the introduction the book covers a number of topics: knotlore; terms, tips, and techniques; ends; and tips on using the book. In the main part of the book, each knot has a small photo of a finished knot, an explanation of the application of the knot, numerous diagrams showing the knot being tied, a description of the tying of the knot, and a brief history of the knot itself.I really don't understand why some of the other reviewers feel so strongly about this book, as a neophyte to the world of knots, I found it more than adequate, and it served my needs well. And I find my husband returning to it again and again, as he slowly falls under the spell of knots, well on his way to becoming a true knot geek. If you're a beginner looking for a practical guide to knotmaking, this book will suit you well.",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "This book is very well put together. Knots are categorized by use: boating, outdoors, climbing, fishing and home. There is a handy chart at the beginning indicating the best use of each knot in the book. Each knot is illustrated with diagrams. These are generally clear though a couple were difficult to figure out. I have learned a lot from this book and heartily recommend it.",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "This is a quite good book that covers almost any knot that one would ever really need to tie. Most of the color illustrations give a clear depiction of the steps required to tie each knot, but they are nothing special compared with other guides.What gives this book added value, I think, is the brief discussion of the history and development of each knot. I also like the categorization as to sailing, climbing, and so on with the cross-references as to use.However, I think that the chart at the front of the book would be much more useful if were in alphabetical order rather than order of appearance. I must also take the author to task for failing to include the sheep shank. This knot has been a favorite of mine since Quint (Robert Shaw) asked Matt Hooper (Richard Dreyfuss) to tie one to prove his seamanship in the movie Jaws.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Just as there is no perfect knot, there is no perfect knot book. All have deficiencies of one sort or another. One common deficiency seems to be misleading or just plain wrong directions for tying a knot. Another deficiency is a failure to tell the reader when to use a particular, or more important, when not to use it. All the books suffer these deficiencies to one degree or another.Another deficiency is too many knots! But how could this be a deficiency, one might ask. Isn't more better? The answer is that the beginner needs to know the most useful knots that have the widest application. If the book contains knots that don't have wide application but doesn't tell the reader which ones are widely used and which ones aren't, how is the reader to know which ones to learn? Therefore, for a beginner, careful selection by the author is essential.Budworth, The Complete Book of KnotsOf all the books, this is my pick as the best for a beginner.What I like about this book is that it contains large, clear line drawings, and for the most part, the layout is pleasing to the eye. Drawings are superior, in my opinion, to photographs. One drawback of drawings is that the cordage you're trying to knot never lies as smoothly and gracefully as the one in the drawings. (This tends to be true of photographs, too, however.) But if you view the drawings more as a blueprint, then you get a conceptual understanding of how the knot is to be tied, and drawings allow a clearer conceptual understanding than photographs in most cases.Another plus to this book is that most of the knots Budworth picked for inclusion are useful and often \"best of breed\" knots. On pages 6 and 7, there is a \"directory of knots\" that shows the best or most popular use of each knot. In addition, for each knot, there is a summary called \"applications,\" and occasionally a warning when not to use a knot.A minus is that some of the drawings are wrong or misleading. For example, in the drawing for the double bowline (figure 8 on page 37), the arrow to show how the working end is rove (threaded) through the loops would have the working end going from the top of the loops to the bottom when it should be the reverse. After some frustration and referring to other sources, I was able to tie the knot. (Google is your friend.)A bigger minus is the terseness of the descriptions. In a number of instances, the author assumes you should be able to figure out the process from fewer drawings than I think necessary. I would like it if each and every step in tying the knots were shown. With some effort, I was able to figure out each knot that I tried to tie even though some drawings included several steps in one drawing. But why make the reader work? A book for beginners should make it easy.When I was starting with this book, I thought that it would be helpful if the author included pictures of the finished knot. After about a week, I realized that he did! But they are murky pictures that are either in a small space at the top of the page, above the name of the knot, or serve as a background for the entire page. There is no excuse for such bad pictures, which mar an otherwise excellent layout. Instead of putting some trivia about the history of the knot in a circle on each page, a clear monochromatic photo in the circle would serve the reader better.The book does not include decorative knots (Budworth having written a separate book on decorative knots).Because of the terseness of the descriptions, the lack of clear photographs of the finished knots, and the occasional errors, I downgraded this book from five stars to four.Pawson, Handbook of Knots (expanded edition)This book contains very clear color photographs, and the layout is quite pleasing to the eye. The problem with photographs is that it can be hard sometimes to discern when one cord is on top of another or below, and sometimes the hand can be hiding some important information. Compounding this is the fact that the book is small in format, and when you have four or five photographs on one page, each photograph ends up being small (say, 1.5\" by 2.5\"), too small sometimes.Although the book is soft-cover, the binding is stitched, and the book can be opened flat without breaking the binding. I found that it would stay open without much difficulty.Pawson, like Budworth, is a founding member of the International Guild of Knot Tyers. But his choice of knots puzzles me. For example, he has a number of stopper knots but does not include Ashley's stopper knot, which many consider the most important stopper knot. He also does not include any grip-and-hold knot (such as the midshipman's hitch, taut-line hitch, or the Tarbuck knot). This is peculiar in that a grip-and-hold knot can be quite useful. I almost had the feeling that Pawson had decided that he would avoid (when he could) duplicating what Budworth had done. Quite gentlemanly, but not what I want in a book for beginners.On the plus side, Pawson includes a number of lashings, plaits and sennits, and splices, which Budworth does not.For what it's worth, I was unable to tie the Turquoise Turtle knot following Pawson's description until I watched a video on the internet.Based on the fact that this book uses photographs instead of drawings (particularly in a small format book), the sometimes odd choice of knots, and lack of warnings about certain knot uses, I downgraded this book from five stars to three.The Morrow Guide to KnotsThis book contains very clear color photographs, and the pictures are larger than in the Pawson book which is helpful. But layout is off-putting. There are typically several pictures on a page, but the picture on the top of the page is not the starting picture; it's the one on the bottom of the page to the left.Like the Pawson book, the book is soft-cover, the binding is stitched, and the book can be opened flat without breaking the binding. I found that it would stay open without much difficulty.I found the choice of knots to be satisfactory in that most of the basic knots are covered. A plus is that several ways of tying a knot is shown for several of the knots. That is always helpful. Another plus is that it covers decorative knots, such as plaits and sennits.This book's depiction of the climber's method of tying the bowline knot took me an hour to figure out because two steps were (inexcusably) combined into one picture without an explanation.A minus is that the book is outdated. This comment would have come as a surprise to me before I started studying knots inasmuch as many knots are hundreds, if not thousands, of years old. But a number of improvements in knots have been made in the last twenty years, and these improved knots can't be found in a book published in 1981. Moreover, for the Tarbuck knot, the book states that the knot is used by climbers, but climbers have avoided this knot for decades because it tends to damage the kernmantel type of rope used in climbing.Another minus is the paucity of information about the use and misuse of knots.Based on the fact that this book uses photographs instead of drawings (particularly in a small format book), the odd layout, the lack of warnings about knot uses, and the dated nature of the information, I downgraded this book from five stars to three.Budworth, The Ultimate Encyclopedia of Knots & RopeworkThis book contains very clear color photographs, and the layout is quite pleasing to the eye.Of all the books that use photographs to depict the tying of knots, this is my pick as the best. Although the pictures are small, it's much more step-by-step than the others. In particular, it doesn't suffer from the terseness of Budworth's The Complete Book of Knots, and it shows a large picture of the finished knot. (It also correctly depicts the double bowline.)An important plus of this book, given its claim to encyclopedic coverage, is the inclusion of decorative knots. There are far more knots in this book than any beginner would need, and there is a paucity of information about the use and misuse of knots.My copy has an update date of 2002, making it the most recent edition of all my knot books.This book coupled with Budworth's The Complete Book of Knots would make a complete library for any beginner. But this book is too much, in my opinion, for the ordinary reader who just wants to learn a few useful knots.The fact that this book uses photographs would normally make me downgrade it, but number of step-by-step pictures for each knot offset that. Based on the fact that this book is intended as an encyclopedia and it fulfills that function very well, I give this book five stars. If this book were intended for a beginner, however, I would downgrade it to four stars because of the sheer number of knots, the lack of guidance to beginners as to which ones to learn, and the lack of warnings about knot uses (and misuses). The number of ste-by-step pictures keeps it from going to three stars.The Ashley Book of KnotsAs an encyclopedic work, The Ashley Book of Knots is not suitable for beginners. For knot aficionados, it's a must-have.Based on the fact that this book is intended as an encyclopedia and it is in fact the standard reference work for knots, I give it five stars. If this book were intended for a beginner, however, I would downgrade it to three stars because of the sheer number of knots and the fact that it was published in 1944, which means that it does not satisfactorily address modern synthetic ropes.ConclusionFor the beginner, that is, for the reader who simply wants to learn a few of the most useful knots, my pick is Budworth, The Complete Book of Knots. For an encyclopedia of knots, my pick is Budworth, The Ultimate Encyclopedia of Knots & Ropework. For the knot hobbyist or public library, The Ashley Book of Knots is a must-have.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Just as there is no perfect knot, there is no perfect knot book. All have deficiencies of one sort or another. One common deficiency seems to be misleading or just plain wrong directions for tying a knot. Another deficiency is a failure to tell the reader when to use a particular, or more important, when not to use it. All the books suffer these deficiencies to one degree or another.Another deficiency is too many knots! But how could this be a deficiency, one might ask. Isn't more better? The answer is that the beginner needs to know the most useful knots that have the widest application. If the book contains knots that don't have wide application but doesn't tell the reader which ones are widely used and which ones aren't, how is the reader to know which ones to learn? Therefore, for a beginner, careful selection by the author is essential.Budworth, The Complete Book of KnotsOf all the books, this is my pick as the best for a beginner.What I like about this book is that it contains large, clear line drawings, and for the most part, the layout is pleasing to the eye. Drawings are superior, in my opinion, to photographs. One drawback of drawings is that the cordage you're trying to knot never lies as smoothly and gracefully as the one in the drawings. (This tends to be true of photographs, too, however.) But if you view the drawings more as a blueprint, then you get a conceptual understanding of how the knot is to be tied, and drawings allow a clearer conceptual understanding than photographs in most cases.Another plus to this book is that most of the knots Budworth picked for inclusion are useful and often \"best of breed\" knots. On pages 6 and 7, there is a \"directory of knots\" that shows the best or most popular use of each knot. In addition, for each knot, there is a summary called \"applications,\" and occasionally a warning when not to use a knot.A minus is that some of the drawings are wrong or misleading. For example, in the drawing for the double bowline (figure 8 on page 37), the arrow to show how the working end is rove (threaded) through the loops would have the working end going from the top of the loops to the bottom when it should be the reverse. After some frustration and referring to other sources, I was able to tie the knot. (Google is your friend.)A bigger minus is the terseness of the descriptions. In a number of instances, the author assumes you should be able to figure out the process from fewer drawings than I think necessary. I would like it if each and every step in tying the knots were shown. With some effort, I was able to figure out each knot that I tried to tie even though some drawings included several steps in one drawing. But why make the reader work? A book for beginners should make it easy.When I was starting with this book, I thought that it would be helpful if the author included pictures of the finished knot. After about a week, I realized that he did! But they are murky pictures that are either in a small space at the top of the page, above the name of the knot, or serve as a background for the entire page. There is no excuse for such bad pictures, which mar an otherwise excellent layout. Instead of putting some trivia about the history of the knot in a circle on each page, a clear monochromatic photo in the circle would serve the reader better.The book does not include decorative knots (Budworth having written a separate book on decorative knots).Because of the terseness of the descriptions, the lack of clear photographs of the finished knots, and the occasional errors, I downgraded this book from five stars to four.Pawson, Handbook of Knots (expanded edition)This book contains very clear color photographs, and the layout is quite pleasing to the eye. The problem with photographs is that it can be hard sometimes to discern when one cord is on top of another or below, and sometimes the hand can be hiding some important information. Compounding this is the fact that the book is small in format, and when you have four or five photographs on one page, each photograph ends up being small (say, 1.5\" by 2.5\"), too small sometimes.Although the book is soft-cover, the binding is stitched, and the book can be opened flat without breaking the binding. I found that it would stay open without much difficulty.Pawson, like Budworth, is a founding member of the International Guild of Knot Tyers. But his choice of knots puzzles me. For example, he has a number of stopper knots but does not include Ashley's stopper knot, which many consider the most important stopper knot. He also does not include any grip-and-hold knot (such as the midshipman's hitch, taut-line hitch, or the Tarbuck knot). This is peculiar in that a grip-and-hold knot can be quite useful. I almost had the feeling that Pawson had decided that he would avoid (when he could) duplicating what Budworth had done. Quite gentlemanly, but not what I want in a book for beginners.On the plus side, Pawson includes a number of lashings, plaits and sennits, and splices, which Budworth does not.For what it's worth, I was unable to tie the Turquoise Turtle knot following Pawson's description until I watched a video on the internet.Based on the fact that this book uses photographs instead of drawings (particularly in a small format book), the sometimes odd choice of knots, and lack of warnings about certain knot uses, I downgraded this book from five stars to three.The Morrow Guide to KnotsThis book contains very clear color photographs, and the pictures are larger than in the Pawson book which is helpful. But layout is off-putting. There are typically several pictures on a page, but the picture on the top of the page is not the starting picture; it's the one on the bottom of the page to the left.Like the Pawson book, the book is soft-cover, the binding is stitched, and the book can be opened flat without breaking the binding. I found that it would stay open without much difficulty.I found the choice of knots to be satisfactory in that most of the basic knots are covered. A plus is that several ways of tying a knot is shown for several of the knots. That is always helpful. Another plus is that it covers decorative knots, such as plaits and sennits.This book's depiction of the climber's method of tying the bowline knot took me an hour to figure out because two steps were (inexcusably) combined into one picture without an explanation.A minus is that the book is outdated. This comment would have come as a surprise to me before I started studying knots inasmuch as many knots are hundreds, if not thousands, of years old. But a number of improvements in knots have been made in the last twenty years, and these improved knots can't be found in a book published in 1981. Moreover, for the Tarbuck knot, the book states that the knot is used by climbers, but climbers have avoided this knot for decades because it tends to damage the kernmantel type of rope used in climbing.Another minus is the paucity of information about the use and misuse of knots.Based on the fact that this book uses photographs instead of drawings (particularly in a small format book), the odd layout, the lack of warnings about knot uses, and the dated nature of the information, I downgraded this book from five stars to three.Budworth, The Ultimate Encyclopedia of Knots & RopeworkThis book contains very clear color photographs, and the layout is quite pleasing to the eye.Of all the books that use photographs to depict the tying of knots, this is my pick as the best. Although the pictures are small, it's much more step-by-step than the others. In particular, it doesn't suffer from the terseness of Budworth's The Complete Book of Knots, and it shows a large picture of the finished knot. (It also correctly depicts the double bowline.)An important plus of this book, given its claim to encyclopedic coverage, is the inclusion of decorative knots. There are far more knots in this book than any beginner would need, and there is a paucity of information about the use and misuse of knots.My copy has an update date of 2002, making it the most recent edition of all my knot books.This book coupled with Budworth's The Complete Book of Knots would make a complete library for any beginner. But this book is too much, in my opinion, for the ordinary reader who just wants to learn a few useful knots.The fact that this book uses photographs would normally make me downgrade it, but number of step-by-step pictures for each knot offset that. Based on the fact that this book is intended as an encyclopedia and it fulfills that function very well, I give this book five stars. If this book were intended for a beginner, however, I would downgrade it to four stars because of the sheer number of knots, the lack of guidance to beginners as to which ones to learn, and the lack of warnings about knot uses (and misuses). The number of ste-by-step pictures keeps it from going to three stars.The Ashley Book of KnotsAs an encyclopedic work, The Ashley Book of Knots is not suitable for beginners. For knot aficionados, it's a must-have.Based on the fact that this book is intended as an encyclopedia and it is in fact the standard reference work for knots, I give it five stars. If this book were intended for a beginner, however, I would downgrade it to three stars because of the sheer number of knots and the fact that it was published in 1944, which means that it does not satisfactorily address modern synthetic ropes.ConclusionFor the beginner, that is, for the reader who simply wants to learn a few of the most useful knots, my pick is Budworth, The Complete Book of Knots. For an encyclopedia of knots, my pick is Budworth, The Ultimate Encyclopedia of Knots & Ropework. For the knot hobbyist or public library, The Ashley Book of Knots is a must-have.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I picked this book up to learn how to tie a couple of the more obscure climbing knots like the trident and triple bowline and to have fun with the rest. The book is well organized (except for the utterly useless directory of knots), and the diagrams are large. My gripe is that he skips steps, and magically produces extra slack halfway through a knot. There are cases where I have thrown the book down and had to figure it out by trial and error (not what I paid $20 for). Furthermore some of the methods he uses to tie knots (such as the butterfly) are flat out strange, or clumsy. When I'm up 100 feet and my life depends on it I need more efficiency.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I found this book very confusing. In many cases, the illustrations and instructions showed you a straight rope for Step 1 and then the full knot completed for Step 2. I would not recommend this book.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is an interesting book and well worth the investment. The only reason I hessitate to give it more than three stars is that the book seems to skip a step here and there, or the illustrations are a bit confusing at times (at least for a beginner like me). Things that make this book worth buying are:layout according to the usage of the knots (ex sailing, camping etc) color coded sections for easy access effect of each knot on rope strength",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I bought this book in Escalante, Utah, when doing my first canyoneering excursion. I have seen many other books since, but this remains my favorite.1) It has very clear pictures that make it easy to follow the instructions2) As other reviewers have written, each knot has a little history blurb about it. Nice touch!3) The book is organized logically - by use (boating, fishing, caving, etc.)4) The book contains more knots than you could ever possibly want to know.Highly recommend to someone looking for a \"One Stop\" knot book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the treehouse book",
        "description": "It seems that almost everyone likes treehouses. Smiles of recognition turn into grins of enthusiasm as more people discover them and dream about making their own private retreats or family play spaces. And it's nice to remind ourselves that treehouses are built into the oldest and most forgiving, living things on earth. Also, history records treehouses as being built as deliberate follies, as challenges for arboreal designers, for merrymaking, and for keeping the spirit of fairy tales alive. But treehouses can also be social places. We will visit many that were built to entertain, to hang out with friends, or as guest houses. Trees come in all types. Master treehouse builders Peter and Judy Nelson, with David Larkin, have embarked on yet another treehouse-discovery expedition across America, this time adding the investigation of backyard playhouses to their agenda. Now, in The Treehouse Book, they reveal their findings, illustrated and described in the most complete volume yet. From casual treeshacks made from discarded lumber to multitiered feats of fancy, they found shelters representing myriad builders--interesting characters ranging from childhood fanatics grown up, to weekend carpenters, to those who want their grandkids to have the best clubhouse on the block. Detailed how-to information, including plans and drawings, is woven with behind-the-scenes tales of each structure's occupants and stunning interior and exterior photographic exploration.",
        "authors": "['Peter Nelson']",
        "infoLink": "http://books.google.com/books?id=hz-ooyr_czMC&dq=The+Treehouse+Book&hl=&source=gbs_api",
        "categories": "['Architecture']",
        "ratingsCount": 4.0,
        "review": [
            {
                "review/text": "This book might look good on a coffee table, but that's about all. It gives little information on how to build treehouses and lacks the genearal knowledge of other treehouse authors. If you want the best book on treehouses, check-out the original, The Treehouse Book, by David Stiles. His book gives detailed designs on how to build many different treehouses and helps you decide which one is best for you. Mr Stiles has written on the subject for over thirty years and has published several other books on treehouses, including, Tree Houses You Can Actually Build. These books enlighten and inform, rather than just visually stimulate. Anyone interested in learning about or building a treehouse would do well to pass on this book and go straight to the source--Mr Stiles--the treehouse guru.",
                "review/helpfulness": "117/146",
                "num_reviews": 146
            },
            {
                "review/text": "I have read every one of Peter Nelson's books, and he is not only a beautiful writer, but also a gifted craftsman. If you want to dream about living in the trees or even make it a reality...each of these books will give you a wonder-filled ride through the pages as well as technical information and all the motivation you might need to build your own. The stories and photographs are breath taking and alive. I have been lucky enough to witness Peter Nelson's craftsmanship in person, but it also comes alive through the pages of all three of his books. Go buy each one of the books right away and see for yourself the wonder of &quot;living out on a limb&quot;. Fantastic!",
                "review/helpfulness": "27/30",
                "num_reviews": 30
            },
            {
                "review/text": "This book has some excellent pictures of treehouses. I love it! It is one of my favorite treehouse books. It is not for someone looking to build a treehouse; for that, i recommend \"Home Tree Home\", by Peter Nelson. Back in 1999, I built my own treehouse, primarily using ideas from \"Home Tree Home\" and prior treehouse building experience. I lived in it for 5 years.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "This book opens up a world that for most of us has been closed since childhood, a world of playhouses nestled in and among trees. With brilliant photography the authors have arrayed for us a variety of unique playhouse conformations in settings that are startling in their beauty and bewildering in their design. Especially notable are the play structures by the artist, Barbara Butler. This book is a bountiful source of ideas and inspiration for those contemplating something special for their children. Or, for that matter, for anyone who has a hankering to spend some time a little closer to nature in a less than conventional setting.",
                "review/helpfulness": "19/23",
                "num_reviews": 23
            },
            {
                "review/text": "The book was very well writen. It was very descriptive and I would reccomend the book for anyone who wants to design a treehouse. It was packed full of information. I would read over and over again. It's really a great book.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is the third book from Peter Nelson of Treehouse Workshop. His previous two delved in depth into treehouse construction. This work is more a survey of the many wonderful treehouses to be found throughout the world. It is crammed with quality color photographs and, unlike a previously reviewed work, has a unifying narrative throughout.Peter starts you off with a very useful section entitled \"Choice of Tree\". There he briefly touches upon suitability of various tree species to treehouse construction and provides a mini sketch of each tree species with a treehouse. Immediately after comes some very accurate arboriculture advice from Jonathan Fairoaks. It's nice to find a treehouse book that gets this part right for a change.For me, the real value of this book is in the tour it takes you on of many notable treehouse. I bring this book to meetings with clients so they can see the many incredible things possible. And for those who've never considered it possible that a treehouse could be any more than a small, roughly built box, this book will blow their minds.What this book lacks is building advice. It's not a \"how-to\" book. There really is no great \"how-to\" book out there. Even so, highly recommended.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book along with Treehouses of the World are inspirational page after page. If you are a fan of treehouses, this book is a must in your collection.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is just as good as the front cover picture suggests: pie-in-the-sky treehouses. The kind that you dreamed about as a kid? Its obvious from this book that some adults still think about and make their dreams become beautiful structures in reality. If you ever wanted a pictoral book of treehouses representing your wildest imaginations, this is the book for you!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I bought The Treehouse Book as a gift, but couldn't resist reading it myself. It definitely made me want to build a tree house for my five year old son. He enjoyed the book as well. I wouldn't consider it a \"how to\" book - I purchased it for my brother, who builds custom homes. I do think it could inspire a higher level of creativity in many who read it, as some of the treehouses are flat out amazing!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I really liked the whole book, but I especially liked the part about kids treehouses. Some of them were homemade, and some of them were built by an artist. Before I read the book, I was wondering what different treehouses look like. I thought the treehouses with a loft and a ladder would be lots of fun to explore. Some of the treehouses were hotels. One of the treehouses was built by a robber! He had used it as a place to store his disguises. I thought it was a very good book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "charmed bracelets",
        "description": "Zabar's stylish charm bracelets helped kick off a craze. As she prepares to launch a collection of thematic bracelets for Kate Spade, \"Charmed Bracelets\" captures their allure.",
        "authors": "['Tracey Zabar']",
        "infoLink": "http://books.google.nl/books?id=u7kJAAAACAAJ&dq=Charmed+Bracelets&hl=&source=gbs_api",
        "categories": "['Design']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Having collected charms and charm bracelets for many years I am always on the lookout for books on the subject. This is by FAR the best, most comprehensive, stunningly photographed, and \"charmingly\" written book I own on the subject. I highly recommend this book for charm collectors or anyone who who just appreciates a well done and thought out book. You will not be dissapointed.",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "I started collecting charms and started a charm bracelet a few years ago, picking up charms from places we've visited, that's my theme. I loved this book, it's filled with photos of vintage charms, some of those bracelets are crammed full! Charms you wouldn't believe, little advertising charms that look like products, photo frames, mad money charms, and even vintage bra and panty charms! Photos are nice, and some are really creative, like the heart shaped box with charms in the empty candy wrappers. Uses for charms besides on bracelets, chart showing what certain flowers stand for, and some celebrities and their bracelets. I can go on but why spoil it for you? Even my sentimental husband enjoyed going through this book!",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "This book is a gem! The writing is wonderful, the photos beautiful, and the stories -- really vignettes -- are fabulous. The perfect size, it is also readable -- exactly what every woman wants to have on her bedside table.This book is sure to inspire women across the country to reach into their jewelery boxes and take out their own charm bracelets and wear them again and to start bracelets for their favorite girls to help them create their own \"personal histories on a wrist\" as Zabar describes these wonderful treasures.This book will my gift of choice for all my female friends for all their special occasions.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Beautiful little book with some terrific charm bracelets. As a charm collector, it was fun to read about the bracelets of their famous owners. I only wish that there had been photos of the bracelets worn by Jackie O and some of the other notable celebrities. My curiousity was piqued!Great tips for beginning charm collections, and overall, a fun read! This would make a great gift tied with a ribbon and garnished with a vintage charm from eBay!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "\"Charmed Bracelets\" is a delightful book, lovely to look at it and nicely written. The bracelets featured are amazing, especially the gem-set examples. I view jewelry books the way I do charms - you can never have too many. \"Charmed Bracelets\" is a visual feast and a stylish addition to any collector's library.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Having recently inherited my Mother's charm bracelet, I have a new appreciation for the \"charmed\" beauty of it. Each charm meant something special to her and I want to continue that legacy by adding to it for my daughter. Loved the book and reading about the history of charms. The pictures are great too.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "What a wonderful gift! I gave this book along with a bracelet with one single charm as a wedding present to a friend. The wonderful writing and photographs in this book have insipred her to create her own wearable art! She is expecting her first baby soon. I will surely check out Ms. Zabar's new book about Baby Names!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I was browsing one day at the Gardner in Berkeley, CA and saw this book. I bought it for a friend and it was so fun that we decided to start charm bracelets of our own. The fever caught on and now there is a group of us that are trading and swapping stories. My bracelet is becoming my history and its great to watch it evolve.The book is beautifully designed and written.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a nice picture book and fun to look through but when it comes to putting together charm bracelets the suggestion is to take it to a jeweler. Charm bracelet collectors, buy this book. Charm bracelet makers, look elsewhere.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you have ever had a charm bracelet, currently collect charms, or have ever wanted to start a collection - this book is for you! The ideas, history, and photos of the bracelets are all wonderful. It inspired me to clean up my old charm bracelets and, along with my current one, put them on display. They are works of art that tell a story. This book is also a great gift. It has inspired those I've given it to as it inspired me.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "charms and charm bracelets the complete guide",
        "description": "Virtually every American woman has a charm or two tucked away somewhere or has inherited a charm bracelet from a relative. Charm collecting has grown into a competitive and popular pastime with an international following. Consider the evidence - eBay lists over 20,000 vintage charms and bracelets daily, and prices for older pieces continue to escalate. This is a much-needed, comprehensive and entertaining guide to charms and charm bracelets, profusely illustrated with over 300 color photographs. It shows the wide variety of styles ranging from gold to plastic and from the 19th century to the present. Readers will learn to date and determine the value of charms and appreciate their history and uses over the years. Collectors, dealers, jewelry and fashion historians, and appraisers will enjoy the many beautiful examples. This new book is a great help for jewelry collectors everywhere.",
        "authors": "['Joanne Schwartz', 'Joan Munkacsi']",
        "infoLink": "http://books.google.com/books?id=zNDIAQAACAAJ&dq=Charms+And+Charm+Bracelets:+The+Complete+Guide&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have every book there is on collecting charms and charm bracelets. This book is the best written, contains the best history, best advertisements, etc. The book has over 300 color pictures of charms, bracelets and advertisements. Unlike other books, this one gives equal time to both gold and silver charms and bracelets. You get a wonderful history of charms, charm bracelets and how they are made - decade by decade.What really sold me on this lovely book is the fact that it has lots of additional information. There is an appendix explaining metal markings and one showing pictures of actual metal markings with explanations. You also get a nice glossary of frequently used terms, a bibliography, and a wonderful index.If you want to know the history of charms and charm bracelets, their metal markings, and you can only get one book - get this one. This is great for collectors and for people who actually sell charms and bracelets. The author has done an outstanding job of compiling a lot of useful information and photographs in a wonderful, easy to read guide to the world of charms and charm bracelets.",
                "review/helpfulness": "48/48",
                "num_reviews": 48
            },
            {
                "review/text": "Charms & Charm Bracelets: the Complete Guide is well researched and entertaining. This book gets it right! I read plenty of jewelry books and Charms & Charm Bracelets avoids most of my pet peeves. It is well organized and includes an accurate glossary, bibliography, and index. The photos are clear and well composed. Missing are photos that show more background than jewelry. You know the pictures I'm talking about. \"Gee, is that an earring, bracelet, or waste processing plant?\" Helpful information including measurements, prices, and circa dates is included in the captions. This is a fun and useful book.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "Charms and Charm Bracelets: The Complete Guide is a price guide to charm bracelets from the 19th century to the present, illustrated with over 300 color photographs and featuring jewelry ranging in composition from gold to plastic. Written by an enthusiastic collector of antique jewelry, Charms and Charm Bracelets discusses techniques in making charms, trends in charm and jewelry making throughout the decades, factors to consider when evaluating and appraising specific pieces of charm jewelry, and much more. A \"must-have\" resource for serious collectors, and a treasury to page through for art lovers interested in this unique form of adornment.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "A thorough reference book on charms as art, momentoes and talismans around the world and through the ages. Beautifully photographed, this book shows you that charms are not just decorative bits of silver and gold but also cultural tokens which remind us of people, places, things and significant events. It is clear that the number of charms that you can collect is limited only by your imagination!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is an extremely useful resource for any one who collects charms. The coverage of the subject is comprehensive and the illustrations are exquisite.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am a vintage jewelry dealer, collector and designer and I absolutely love this book! All the photographs are of highest quality and the information contained in the text is spot on. There are charms that are incredibly rare but a joy to see and there are ones that a collector can see on a daily basis if they look to a site like Ruby Lane. My only gripe is that there has never been a Volume 2 as there are so many more charms out there to showcase.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a great resource on English charms and charm bracelets. Very informative and interesting. If you like charms you will enjoy reading this all inclusive book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the big book of buds marijuana varieties from the worlds great seed breeders",
        "description": "This full-color guide showcases the diversity of cannabis varieties. Stunning close-ups from the world's great breeders are accompanied by concise information about growing characteristics and bud quality. Engaging essays offer insights into marijuana's special botany and the culture that surrounds this controversial plant.",
        "authors": "['Ed Rosenthal']",
        "infoLink": "https://play.google.com/store/books/details?id=-WsTuI271UEC&source=gbs_api",
        "categories": "['Gardening']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Ed Rosenthal's Book of Buds is a Big Book of Bad Bucks. A glorified Catalogue which contains photographs that we have all seen before. You would do just as good to order catalogues (which I already have) from famous seed banks to get the same thing. When I got this book in the post I was shocked to find that Ed had repeated every single picture from the seed catalogues. Not one picture was unique. Not one. So immediately I was very unhappy with this book but then it got worse. The descriptions are not accurate and do nothing to serve the reader with factual useful information. I later learned that Ed Rosenthal got the seed banks to pay him to do this book and he did not grow the strains and has not had any growing experience with most of them. This is the last Ed Rosenthal book I will be buying. This book is proof that Ed is far too overrated as a grower and his lack of experience shows in these writings.",
                "review/helpfulness": "28/35",
                "num_reviews": 35
            },
            {
                "review/text": "A field guide for marijuana...brilliant! Clever (and useful) icons make a great quick reference guide, making me want to run out into the fields to id them all. The descriptions are informative, intelligent AND witty with more information than you can shake a stick at. I had never heard the term &quot;couch lock&quot; but I've had the condition and now posses the adjectives to describe it. I learned about the major differences between sativa and indaca. The pictures are plentiful and pleasing to the eye. There are so many varieties out there and this book is the first step in helping people get to know them all. I look forward to the Big Book of Buds II and so on and so forth...until every variety is known to all who wish to know.Thank you again Ed Rosenthal and all your worker bees that helped make this book possible!",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "Ed has sort of gone downhill and things are more or less being presented here like they are in the catalogues with some extra graphics. It looks nice but I do not really think that this is a book for growers. It is more like a book for people who do not own the catalogues. So if you do not own the catalogues from the seed companies then you might like this book but I have seen a lot of the pictures before. It is good that the price has come down though. It was a bit expensive for what you get when it was more than twenty dollars.",
                "review/helpfulness": "12/16",
                "num_reviews": 16
            },
            {
                "review/text": "Everything about this book makes me happy...the full color photos from beginning to end, detailed information on varieties, essays about and by the breeders....did I mention the photographs? I say this is the &quot;Pot smoker's desk reference.&quot;I don't feel like I have the skill to write the review this book deserves so I'll finish with this: If you like marijuana you will LOVE this book.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "I love the great pictures in this book. The information is very helpful in describing each type of bud. It tells you what to expect from each one. I find this very helpful when researching buds. As a graphic designer I think this layout is top notch. Crisp, clear and easy to understand.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "P>Anyways, at first I THOUGHT it was like the seed company descriptions, but the truth is there is ALOT of information in this book...the photos are actually really good quality...and there's a whole bunch of them...the information on each strain is amazing: flower time, yield, taste/smell, type of high (really cool part), type of growing conditions, and in most cases what the PARENTS are....All in all a REALLY informative, fun book. Anyone I have shown it to hasn't been able to put it down until they are done....:)",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I really liked the way this book is set up. It is easy to pick up over and over again. Alphabetically arranged descriptions of 100 varieties in one place makes it helpful to compare and contrast what strains might work best for different tastes or growing situations. Many entries also mention medical uses that they've been recommended for. When you get past just staring at the pictures, you won't find the descriptions disappointing. they are full of information--to the point but not dry. most important, they tell you things you want to know. I like the icons because its easy to match up information by flipping back and forth between varieties. It seems like i run across an essay or something i haven't read yet every time i pick it up. this book is great, i feel like i know more about varieties. its easy to enjoy with herb and i think it is useful for anybody who dares to grow and wants more info on the different strains.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is fabulous. These plants are so wonderful to look at; they make my mouth water and bring tears to my third eye. If the stuff is legalized one day, this book will be our window into becoming master cani-culturists.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The only thing that would make this book tastier would be a scratch and sniff edition. I LOVED the photos and with the essays I learned a lot about this amazing plant along the way. Everyone that has taken a peek at my copy doesn't want to put it down. I would recommend it to anyone who has a curiosity about pot. Just make sure you have a smokable supply nearby--this book will make your mind water.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Ed Rosenthal has put together the most concise AND beautifully illustrated reference book for the marijuana connoisseur. Ed's easy icons and descriptions make this a very resourceful guide for anyone who wants to know about the many strains from around the world. Simply put, a MUST HAVE for anyone really interested in this amazing plant.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "steuben glass an american tradition in crystal",
        "description": "A wonderful presentation of the rich visual history of Steuben glass told through beautiful photographs, this volume presents the definitive guide for the glass collector or art historian. 3,000 illustrations.",
        "authors": "['M. J. Madigan']",
        "infoLink": "http://books.google.com/books?id=LifrAAAAMAAJ&dq=Steuben+Glass+:+An+American+tradition+in+Crystal&hl=&source=gbs_api",
        "categories": "['Design']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "If you are a Steuben collector or simply one interested in the history and work of America's preeminent producer of fine crystal, Ms. Madigan's book is an essential and interesting reference work. The book features many beautiful photographs of important works by Steuben's best designers. The book's most valuable feature for collectors is its comprehensive catalogue of some two thousand Steuben items produced during the years 1933-1981. Although most stock pieces are represented only by line drawings and key dimension (rather than by photography), the information furnished is usually sufficient to facilitate identification of Steuben products, if not especially helpful on issues of valuation. If you love Steuben, you will want to own a copy of this book.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "If you are a Steuben enthusiast this book is a necessary addition to your library. If you are a collector you will find the line drawings of all of Steuben's crystal pieces an absolute must as there are many fakes on the market. The photographs and text are outstanding. All in all, this is the Bible of Steuben glass.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Unfortunately the book entries end (was published) in 2004 and was not updated, while Steuben ended in 2011. I was told that the possibility of an update is NOT likely. So a lot of stuff is missing. However, one can learn from this book. For ex. Several smaller pieces which were once LE (limited editions) were being re-made as recently as 2011, and not as LE's. THAT was a real revelation. Several gorgeous larger pieces were made more recently in places like Portugal, and they are not in the book that way. Several larger pieces, more recently were stamped, pressed, and not made totally off-hand, although they apparently were hand-finished.Also, the prices in the book are soooo much lower that what Steuben was selling the stuff for during their MAJOR end-of-life sale. It was a shocker. And though Steuben kept lowering the prices, they were still so much more than what the book had them for.And, the organization of this book is odd. There are dedicated sections to certain types of items, but the definitions are not very clear as to what these distinctions are!? a bit hard to figure out unless you spend time going through carefully. It took me quite a while to figure out the re-issue of the LE's for example!Lovely, timeless photos of gorgeous glass make it a special book. Dear old Steuben...must be turning in his grave.Buy it if you want to see the classic, classy Steuben, which was once a big attraction on NY's Fifth Ave...the gift to kings, heads of state, and popes...as HAND-MADE IN AMERICAN, many pieces often unique.I myself bought some of these newer, and a couple of the older style pieces, and they're ALL still beautiful, crystal clear glass, with ATTITUDE!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "colt an american legend",
        "description": "No inventor in the history of American industry has captured the imagination the way Samuel Colt did. His revolving pistol became synonymous with American genius and invention, gave birth to a great manufacturing empire, and was legendary in the history of the Civil War, in the taming of the West, and in campaigns and adventures all over the world--wherever Colonel Colt's invention \"made men equal.\" With more than 3300 color photographs and 115 in black-and-white (all taken especially for this book), Colt: An American Legend illustrates and describes every model Colt produced between 1836 and 1986. There has never been a bigger, more beautiful, or more extraordinary book in the firearms field. The large format of the book allows many of the firearms to be shown full size, and the history, development, and importance of each model and variation are presented and described in authoritative detail. A unique appendix traces the complete serial numbers and year of manufacture of every Colt model -- making this book a remarkable and invaluable guide for every serious collector and dealer.",
        "authors": "['Robert Lawrence Wilson', 'Sid Latham']",
        "infoLink": "http://books.google.com/books?id=ePh_QgAACAAJ&dq=Colt+:+An+American+Legend&hl=&source=gbs_api",
        "categories": "['Antiques & Collectibles']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This is a book for your coffee table! It of course covers the history of Colt firearms, and was written by (who else?) the historical consultant to the Colt Firearms Division.Wilson is also a well-known collector, free-lance consultant and well-known author in the firearms field. This is his twentieth book, and perhaps his best.The book is well-written, of course, and the epitome of accuracy--deriving its facts and figures directly from the horse's mouth, so to speak--but its greatest value is the exquisite color photography with which it is filled.There are 406 gorgeous eight and a half inch by eleven inch (landscape) pages, almost all of them containing color photographs of great beauty, depicting historical firearms directly from Colt's own collection, as well as from other sources.If you are a firearm aficionado, or a Colt collector, or just a history buff who appreciates the role Colt firearms have played in American history, this is the book for you.It is one of my most prized books.Joseph Pierre,Author of THE ROAD TO DAMASCUS: Our Journey Through Eternity",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I bought this book sight unseen based on my interest in the subject matter and from seeing other offerings of RL Wilson and liking them. First off, this book hasn't been updated since it was produced in the late 80s. Lots has changed since that time. First off, I need to claim my biases. When it comes to Colt I am primarily interested in Single Action Armies, 1911s, and the Python/Diamonbacks. That said I couldn't believe how little photography was devoted to the 1911. By far the most numerous of Colts ever made due to WWI and II production. There were very few photos of standard production 1911s and those that were there were of well used and weatherbeaten ones. There were more of the decorative/unique 1911s. I am fortunate enough to live near a collection of Frank Phillip's (Petroleum) Colt's in the museum in Bartlesville, OK. I couldn't believe Wilson would not photograph their Colts. They're pristine, covering every major variant. The Peacemaker was given fair coverage. The Python and Diamondback were given very little coverage. At the time the Diamondback was current production and more blah in his opinion, I am sure. Looking back on it, it was a classic since it was the last affordable, working man's revolver made by Colt. Now, to me, it marks the end of an epoch. Yes, Colt still makes Pythons but they are so expensive, hard to find and production is so limited they are not hardly worth talking about anymore. If you are into the early guns primarily this is probably a great book. Based on my interests this book was a bit of a disappointment.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "Look, you can't get Wilson's seminal, collectible The Book of Colt Firearms because it is out of print, costs $1000 if you can find one, and your wife would kill you.Get this book. This is as close as you can get and is widely available. I use it all the time to look up the date of manufacture of any Colt's I might want to buy. The illustrations are quite outstanding.If you don't know, Mr. Wilson is the most famous Colt expert, who must be incredibly rich to have built his collection. Most of the items shown are from Wilson's own collection, worth millions. He doesn't need the money from this book. It is a labor of love.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "before buying used, consider the author's own web site &amp; other major bookstores - the book is available new for a very reasonable price.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "IF YOU ARE AN ENTHUSIAST OF FIREARMS OR AS I AM, AN ENTHUSIAST OF THE AMERICAN WEST, THEN THIS IS THE BOOK FOR YOU. I HAVE SPENT MANY AN HOUR JUST SITTING WITH A GLASS OF FINE AUSTRALIAN RED WINE IN ONE HAND AND THIS BOOK IN THE OTHER, JUST SUCKING IN THE HISTORY OF THIS FINE AMERICAN WESTERN FIREARM. AS I AM ALSO CONNECTED TO THE PRINTING INDUSTRY, I ALSO APPRECIATE VERY MUCH, THE FINE QUALITY OF THIS FANTASTIC PUBLICATION. COME ON ABBEVILLE, PULL YOUR FINGER OUT AND GET THIS BOOK REPRINTED. MY CUSTOMERS AT AMERICAN WILD WEST IMPORTS IN SYDNEY, AUSTRALIA, ARE ASKING FOR THIS BOOK EVERY MONTH, AS I AM SURE OTHER ENTHUSIASTS ARE IN OTHER COUNTRIES OF THE WORLD. IT TOOK RANDOM HOUSE 12-15 MONTHS TO HAVE LARRY'S BOOK, &quot;WINCHESTER: AN AMERICAN LEGEND&quot; REPRINTED, DON'T FALL INTO THE SAME TRAP. IF YOU WISH TO TAKE ME TO TASK OVER THIS COMMENT, PLEASE FEEL FREE TO E-MAIL ME ON wildwest@tpgi.com.au BRUCE McINTOSH - SHERIFF",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "An excellent book for Colt fanciers. It is lavishly illustrated with some of the best color photos I've seen. The text is filled with good information on all Colt firearms. The book also includes the dates of manufacture on all Colt firearms.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is chuck full of great high quality color and some black and white photographs, showing the detailed craftmanship of old Colt firearms, from the quality engraving and inlaying to metal and wood working. It gives a complete history of every gun Colt created.Great for collectors and gun enthusiasts alike! I am not a gun collector but I do appreciate great craftsmanship, and this book is full of examples to demonstrate both Arts and History.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is an invaluable tome for appreciators of the Colt lineage and for appreciators of the history of the Colt enterprise. In this volume R.L. Wilson chronicles as accurately as possible the real story of how Sam Colt perservered to finally deliver a quantum leap in weapons technology after being rebuffed at first. The marvellous high quality photographs of arms are a treat in themselves and this is a book you'll find yourself pickup up over and over again to enjoy.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    }
]