[
    {
        "Title": "the nanjing massacre in history and historiography asia local studies global themes",
        "description": "A compelling historiographic study of the Rape of Nanjing during the Sino-Japanese War of 1937-1945, one of the worst atrocities of all times, and of the event's repercussions.",
        "authors": "['Joshua A. Fogel']",
        "infoLink": "http://books.google.nl/books?id=8z6c6rTk0WUC&dq=The+Nanjing+Massacre+in+History+and+Historiography+(Asia:+Local+Studies+/+Global+Themes)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I am a Chinese and I have read some books and watched some videos about the Nanjing Massacre. I can't hold my angry towards the Janpenese who wrote some nonsense below.I'd like to ask some questions to him/her. Frist, how could he/she explain why there are plenty of survivers of the Nanjing Masscare who still live in China and can show uncountable injuries throught their bodies? Don't forget that it happened only 60 years ago and the survivers hasn't died out. If you want to lie, please wait to those people pass away.Secondly, what is the casue of the war? Did China invaded Japan? Tell me which one happened frist, Pearl Harbor or bombing of Tokoy? Why there are 3 million Japanese troops stayed in China during 1937-1945? What did they do? Were they in vacations?Third, why there are millions of Japanese \"residents\" lived in Machuran, or the northeast part of China? And Why they could occupy most of the land, forcing Chinese people to leave? Why the Japanese \"residents\" did not pay tax to local Chinese government but pay tax to the Japense troops? (The truth was the Japanese occupied the whole area, which is 5-6 times larger than Japan itself, and wanted to change the land as a \"new Japan.\")Could you answer these questions?Yes, the Nuke bombs killed thousands of hundreds Japanese, but Japanese killed at least 25 million Chinese during WWII. 25 million! Who was \"brainwashed\"? Why don't you say that it is a lie of Pearl Harbor, the truth is Americans attacked Japnese?We never refused to admit that the Japnese suffered by the nuclear weapon. But we can's understand why there always be some Japnese who refuse to grant the history? History is history. There is no need and to lie. If Japan wants to become a normal country and get respect from other nations, it should stop to \"modify\" the history. Please watch what the German did and compare to yourself!",
                "review/helpfulness": "32/39",
                "num_reviews": 39
            },
            {
                "review/text": "This is a lesser known source among published Nanjing Massacre literature, but is well worth acquiring due to the variety of perspectives it offers in one book. I would say that any criticisms lodged here against this interesting work, from the typical Japanese Nationalists trolls whose primary ambition is to share their confusion with others, should be completely ignored.Every legitimate WWII historian, including not a few brave scholars in present-day Japan, understand and accept the basic facts and figures surrounding the Nanjing Massacre and the trail of brutality that led from Shanghai in 1937-38. The documentation is extensive, from numerous Western eyewitness accounts to intercepted Japanese diplomatic cables. Magazine accounts of these events can easily be found in Western libraries and even on eBay. Yet Japanese nationalists want us to believe that a massive \"conspiracy\" has led to an \"untrue version\" of the Massacre. But the conspiracy rests solely with JAPAN, not the Allied Nations. Nationalists will point you to absurd Japanese press coverage of post-massacre Nanjing, which is nothing more than skewed occupation propaganda. Likewise, published revisionist accounts by Imperial Army officers in Nanjing, offered in defense of the nationalist position, are usually no more than denials or excusals for their own indifference during the Massacre.The fact that a member of the Imperial House is accused of being a primary instigator of the Massacre is of utmost concern to Japanese nationalists. But the Nanjing Massacre should not be considered as unusual conduct for a Japanese military that also brutalized Manchuria, Hong Kong, and Singapore citizens, killed over 200,000 laborers on the Death Railway from Thailand to Burma, and ravaged innumerable Philippine villages, culminating in the Rape of Manila. The Imperial Army's abandonment of their own conscripted settlers in Manchuria and mass slaughter of Okinawans in 1945 also speaks of the evil that pervaded Japan's military before and during WWII. You can go to any of these places, talk to the survivors and still see physical evidence of Japanese military atrocities. Yet Japanese nationalists, often motivated by insecure needs to believe in a delusional glory of the past, deny anything that would place Japan's military actions in a bad light. The question is why citizens of the world should trust such revisionists who essentially possess the same arrogance and racism of the former militant regime which they extoll and worship? We should not.While I have great fondness for Japanese culture and people, I am dismayed by the distorted histories that are still found today in their own schools. Many Japanese I talk to say they learn of Japan's real WWII past only in college. Japan today should not be judged by the ridiculous extremists who comment here and those old men in high places who try to suppress their national shame. The good news is that with more internationalization, young Japan is slowly coming to grips with their past. Recent TV doramas such as \"Song of the Canefields\" (reciting Imperial Army atrocities in Okinawa), have educated many young Japanese better than the heavily-edited history textbooks in ther schools. The recent actions of fanatical extremists in Hiroshima and anti-Japanese sentiments during football matches in China also have placed Japan on notice as to their obligations to resolve past offenses.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "The nonsense written by Hiromi is ridiculous.There are for a fact several surviving non chinese people who even recorded videos of the horror japanese troops inflicted against the people in Nanjing, and there are several photos also which can easily be verified as original non edited photographs by any photo lab today.And to say no foreigner actually witnessed the massacre is so naive, if you where going to execute 30.000 civilians and your the invading force, would you just allow some foreigner to sit by and watch? of course not even bringing such a point up is nothing less but stupid.And for the authors Higashinakano Shudo and Tanaka Masaaki, they are both know pro right wing LPD so of course they will deny that the nanjing massacre ever took place.And i wouldn't call it a brain washing program either, more true information program, since during the wartime the japanese government had total media control and most japanese had no knowledge what really happened overseas.It's just stupid to not take responsibility for past actions and try to deny such an obvious truth. It would be like if my country (sweden) tried to deny its invasion of norway, russia, and the majority northern europe. Or trying to deny the crusades made by christian knights to spread the christian faith using armed forces against those who did not convert.Face it, it did happen and i welcome any book that can help the truth thats why i give it 4/5.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "We need books like this to show the past to those brainwashed people, such as one of the viewers---Hiromi (a Japanese woman) (To Hiromi: Stop being so naive!)Learn from history. Don't let this kind of terrible things happen again! World peace!Nanjing Massacre upsets and stuns me every time when I think of it. Moreover, the fact of the Japanese government which distorted history and referred to the 1937-38 Nanjing massacre (an estimated 250,000 to 300,000 people were killed) by the innocuous title of \"incident\" is absolutely outrageous!!!!!!",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "In 1997, historian Iris Chang resurrected American memories of what was once a sensational scandal. In \"The Rape of Nanking,\" she gathered stories and pictures of the Imperial Japanese Army's conquest of that city in 1937, when it was the capital of China.Her book was a best-seller, and other Chinese-Americans also were documenting and publicizing these events, though with less impact than Chang's.But if Americans had almost forgotten the Rape of Nanking, neither the Chinese nor the Japanese had. \"The Nanjing Massacre\" brings together essays by three young historians exploring the historical interpretations of the event in China (by Mark Eyholt), in Japan (by Takashi Yoshida) and in the academy (by Daqing Yang).Chang's book was attacked by Japanese militarists. \"The Nanjing Massacre\" is a good place to start evaluating these criticisms, which were mostly unfounded.What Yoshida calls \"Japanese conservatives\" have denied the massacre, or, if admitting some small atrocities occurred, claim they were no worse than things done to the Japanese.None of the essayists doubts the Japanese slaughtered, raped, looted and burned their way across Nanking (or Nanjing) city and province. But they do doubt the honesty, clarity and reliability of the writing of the event's history on all sides.Eyholt reports that Chinese governments, both Nationalist and Communist, have generally found reasons to play down the massacre. The Communists have preferred to ignore it, and declined to seek compensation, because the regime has wanted economic cooperation with Japan.The level of cynicism displayed by the People's Republic government and the Chinese Communist Party is hardly surprising but nonetheless breathtaking: In the early '50s, the Communists blamed westerners in Nanking for aiding the Japanese. The truth was, any Chinese who survived did so because the Japanese were afraid of Western public opinion.In the '80s, Chinese students began investigating the massacre and publicizing it. Throughout the 20th century, from the May 5 movement in 1919 to the pressure on Chiang Kai-shek to resist the Japanese invasion of 1937, Chinese public opinion has been uniformly anti-Japanese and far more nationalist than the governments have been.The situation in Japan, as reported by Yoshida, is as would be expected. Japanese public opinion is overwhelmingly against admitting or apologizing for the massacre.The governments, the courts and what Yoshida calls \"progressives\" (a jumble of democrats, old socialists and decent people) hold the formal control of organs of \"public opinion.\" Government ministers who say the massacre never happened are forced to resign.But books exonerating Japanese war criminals outsell books telling honestly of the war in China by a hundred to one.Americans have invested a thousand times as much effort in understanding the Holocaust as they have in understanding Japanese war crimes. But editor Joshua Fogel warns against easy comparisons between the two forms of genocide. They are, the essayists agree, not directly comparable crimes.A great deal of the controversy has surrounded the exact total of rapes and murders. China has settled on a figure of 300,000 slain.Japanese revisionists have attacked this statistic. They argue that if they can show that the numbers were inflated, that would prove the massacre never happened at all.Anyhow, the relevant answer is not a number. The answer to \"How many Chinese were killed at Nanking?\" is \"all of them.\"All three essayists miss this point, which is, after all, the main one. Yang, in particular, surrenders to the fascists on the question of responsibility.Now that the story is falling out of the hands of the participants and into the hands of the professional historians, the fundamental problems not only do not receive better answers, they are being wrongly answered.The most egregious example concerns the extent to which higher levels of the Japanese army and government were aware of and tolerated or ordered the rampage.Historian Yang looks for a piece of paper either implicating or exonerating some group or other, though the answer is obvious to anyone. The fact -- and it is a fact -- that the Japanese exterminated almost a whole province, except about 200,000 Chinese who managed to crowd under the shelter of American and European flags, proves as much as anyone could want that the Rape of Nanking was calculated, deliberate policy of the army and the government.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "kuhaku other accounts from japan",
        "description": "Sixteen stories and essays by different writers destroy the many stereotypes about Japan.",
        "authors": "['Bruce Rutledge']",
        "infoLink": "http://books.google.com/books?id=G7dkzem8yTgC&dq=Kuhaku&hl=&source=gbs_api",
        "categories": "['Education']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Kuhaku is a difficult book to classify. Part cultural observations from long-term foreign residents in Japan, part translations of essays and stories by Japanese authors, and part insight into a street populated with cartoon rabbits and a family of cubes. Canned coffee, extra-marital affairs, a kegger at a buddhist temple, a stay at a hotel that caters to dogs, a man writing his way to a Nobel Prize by doing articles about sex shops in Tokyo; Kuhaku is nothing else but varied in the stories it tells.But the one thing that Kuhaku systematically achieves is a vision. The vision is to capture a feel, an attitude -- the zeitgeist if you will -- of contemporary Japan. This vision however is never truly fulfilled, and it was never meant to be; this the book never makes any apology for being what it is. Kuhaku invites the reader into a niche of a culture and lets the reader take away what the reader wants to from it. For the most part it is an attempt to break away from the typical foreigner-stuck-in-Japan literature, (Which tend toward quirky anecdotes about old ladies, packed train rides, sexual escapades, funny English, and superficial observation just beyond tourist insight masquerading as brilliant nuggets of anthropology, et cetera.), and tries to offer a more lucid, a more respectful and honest appraisal of life in Japan, here and now. In this aspect, Kuhaku is one of the best books -- with a foreign slant -- on contemporary Japanese life available; and I have read many. It can be appreciated by somebody who has never been to Japan, and yet very elucidating to those who call Japan home.Kuhaku is a compilation of the works of fourteen authors and artists. Some stories appeared elsewhere in magazines or in their original Japanese in other books; other sections were written and designed specifically for this book. The section on Japanese canned coffee convinced me to try some after two years of living in Japan without one sip. The ten page cartoon-like spread on a typical Japanese street is a delight of graphic design. And the three stories of Japanese housewives engaging in affairs at first seemed like an over-tapped subject used for the sake of naughty literature, but ended up being the most insightful part of the book. All three tales were devastatingly penetrating in their insights into the world of marriage, love versus lust, and the pressures of society on one's life and well being. They read better than most novels and were at times more fulfilling. The essay that explores contemporary problems in Japanese society, that starts with the concept of youths beating up businessmen, is a brilliant short exploration of a very large issue. But it is the glossary at the end of Kuhaku that makes for a perfect capper to these stories. More than just simple definitions, some words have full stories of love, betrayal, and slice of life fables that even after three or four readings still put a smile on my face.Even the weakest parts of Kuhaku still offer nuggets of wisdom that make them worth the reading, if not exactly memorable. The short story about the man who takes his dog to a hotel that caters to dog owners teetered close to the over-assumption of Japanese social mores based off of very simple anecdotal evidence that foreign authors are helpless to exercise. But it is a story about dogs and dog hotels and Japanese names for dogs, so I should let my high-handed Lafcadio Hearn proclivity rest every once in a while. And the one-page ditty about an editor's lunch break seemed unnecessary, but in hindsight, even the occasional mediocre moments of Kuhaku (and they tend to be the shorter stories anyway) add a nice seasoning to the total meal the book offers.I fear this book caters more to the experienced visitor to Japan, but thanks to the glossary and and inviting attitude of the design, I think Kuhaku would make a welcome edition to anybody's collection of Japanese cultural literature. Plus it comes with a bookmark thread, and I appreciate that.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "What does infidelity have to do with recycling? And what does canned coffee have to do with suicide?The obvious link between the widely varied stories within Kuhaku is the backdrop - all the events and stories take place in contemporary Japan. While sex and consumerism show up in more than a few tales, bigger themes - like loneliness and modern alienation - penetrate further. Kuhaku's paradoxical collage - the vivid forms of commercialism, sex, and modern technology combining to form an empty grey - tells a sometimes beautiful, sometimes bleak story of a society whose humanity appears in jeopardy.Its not all so serious, though - between a journalist's romp through Tokyo's red light district and a foreign woman's very un-Japanese reaction to getting groped on the subway, there's a good deal of material to amuse as well as enlighten.The Japanese-style design is worth noting - it makes the book a pleasure to read.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "japan unbound a volatile nations quest for pride and purpose",
        "description": "Explores the cultural changes that have taken place in Japan throughout the last decade as demonstrated by various economic groups and institutions, predicting what Japan's changing world role will mean for the future.",
        "authors": "['John Nathan']",
        "infoLink": "http://books.google.com/books?id=o9VEYgEACAAJ&dq=Japan+Unbound:+A+Volatile+Nation%27s+Quest+for+Pride+and+Purpose&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "While Alex Kerr's \"Dogs and Demons\" harped on about the travails of the Japanese construction industry, John Nathan picks on a social axe to grind. Which makes for an indulging read indeed, although the supporting evidence is occasionally lacking and the inferences about the future are to the tune of \"It's unpredictable, time will tell.\"You've probably read other authors crunch economic data or political misgivings of the sushi nation, but Nathan turns his gaze to schools, novels, manga comic books, and the minds of young entrepreneurs and maverick local politicians. Is Japan's notoriously conformist society finally giving in to the longstanding recession? How is this affecting national identity?We first take up the issue of social corrosion. No surprise there, Japan is in a crisis. An incisive lens is directed at the schooling system, which is now a hotpot of truancy, felonies, alienation, angst amongst increasingly wayward kids. Sadly, parents are woefully underprepared to handle these issues, as are school authorities.Next we take the jingoistic extremism and of course, as people close to Japan may expect, the whacky governor of Tokyo Ishihara comes up, contrasted to the softer Tanaka of Nagano. A third person in the fray, the popular cartoonist Kobayashi, contends that Japan should in fact drop its US-linked past and become more self-assured. All of this makes for a very pithy discussion, but there may be little here that's new to people who follow Japanese news. To others, these essays alone alone are reason to grab the book.Now for the minor gripes. The section that highlights the growing capitalism cites the same pseudo-successful entrepreneurs to claim that Japan is becoming more entrepreneurial: Masayoshi and Oki Matsumoto (sigh, Monex!). To be fair, Japan does have a growing list of people stringing out on their own, but a recent Nikkei Weekly article did a much less sycophantic job of enumerating more convincing and down-to-earth examples.The author also gives in to sweeping statements such as his claim of America's encouragement to Japan to beef up its nuclear arsenal in order to egg China into getting involved with the North Korea issue. Where did this come from?Finally, be warned that the tone of the book in general is somewhat murky, and there is preciously little in terms of What Next, or How To Deal With It.Forgivable weaknesses? May be. For me, the book was an insightful read. At the very least, it'll equip you with interesting little tidbits for those Oh-Japan dinner conversations. In particular people who don't have the time to follow Japanese news on a regular basis will probably find this book eye-opening.A worthy purchase.",
                "review/helpfulness": "34/35",
                "num_reviews": 35
            },
            {
                "review/text": "Let me start by saying that I am a big fan of Prof. Nathan's biography of Yukio Mishima, especially Nathan's lucid prose and \"insider's\" knowledge. However, I am of two minds with his latest venture Japan Unbound.On one hand, I revel at Prof. Nathan's clarity, keen observations, and passion for his subject. (If nothing else, it is fast paced and interesting: I, a slow reader at best, read it in two sittings.)On the proverbial other hand, I have two (perhaps petty) axes to grind. First, his use of \"case studies,\" such as the \"typical\" family in Osaka, seems more geared to proving his own thesis about changing societal values than shedding any light on contemporary realities.Second, and this may indeed be a small gripe, I was both shocked and dismayed at Nathan's depiction of the bully Shintaro Ishihara (Gov. of Tokyo) as a macho, caring guy full of sensitivity for the general public (a real \"sun king\") while lambasting the hugely popular Yasuo Tanaka, a down-to-earth grassroots reformer, as effiminate and foppish and describing how (for what reason, I dunno) the tips of Tanaka's fingers shake like Tiny Tim's during times of stress. I suppose Prof. Nathan is just trying to realign the scales a bit, that is, to go against the norm (i.e., the typical American academic and media representation of Ishihara as a \"facist\" and Tanaka as a \"freedom fighter\") which is fair enough, but it struck me as yet another \"case study\" to prove a (seemingly) nonexistence point.Though it is a page-turner in its own right, I kept wondering throughout the book what exactly were Prof. Nathan's motivations for writing it: what is his point after all is said and done? Is this book meant purely as personal asides and self-promotion? (How many times do we need to read that he went to Tokyo University?) Or is it in fact a personal attempt to really understand \"his\" notion of modern Japan?As good as this book is, and as easily as it reads (and remains a fine general background for the lay reader), I cannot help that thinking that the former is true, and hence, my somewhat harsh rating. I suppose most readers will find something of value in it, though, and probably enjoy it more than I did.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "The central question that \"Japan Unbound\" explores is why the Japanese collectively are obsessed with their identity. Nathan makes an interesting point that one could argue that at the center of the individual and collective psyche is a void. He profers up some examples of different perspectives of people that he interviews -- troubled youths, tormented educators, happy families, dysfunctional families, etc. He devotes a chapter to each of the governor of Tokyo prefecture and the mayor of Nagano, both very interesting and inspiring characters in their own light, whose profiles (and the public reactions they illicit) shed a very intimate light on different and distinctive aspects of the Japanese character.That being said, the question of from where the void emerged and what might fill it is never satisfactorily explored on its own. We wanders in a rather unfocused manner from one Japanese obsession to another: American-worship, materialism and consumerism, ultra-nationalism. Answers are only hinted at through examples that Nathan uncovers through journalistic interviews. I admittedly have my own thesis which colors my review, however, which is that the void is the result of the destruction of Japan's religion at the end of WWII -- a state religion based on Emperor worship as the devine entity of the unique Japanese people. This reality should not be underestimated. The void at the center, I would argue, is a spiritual, and the spiritual hunger that longs for fulfillment has found collective expression in Japan through various attempts at \"Americanization\", excessive consumerism, extreme fad-ism, and nostalgic ultranationalism. Nathan somewhat blithely assumes the confidence that Americans have is a result of our culture of individuality. But I think that ignores the important and defining role that the judeo-christian tradition played in defining the western psyche. By missing that connection, he missed an opportunity to explore in greater depth the question that he tackles in this book.Another oddity about the book is some equally blithe comments in the epilogue about how Japan is turning away from America and towards Asia, particularly China, in its continuing search for identity. And he draws the fact that Chinese tea shops are popular as an example (even though Starbucks, he admits, is even more popular). Again, Nathan misses the irony in his assessment. China also once had a society organized around a emperor who was considered devine. The Confucian order that Japan imported from China fit dovetailed nicely with the Shinto basis of Japan's imperial-religious system because it provided a social order as an expression of the spiritual \"reality\" of the state devine organization. However, China cast off its system much earlier than Japan did (aided by the fact that the last dynasty was of foreign invaders). China, too, has gone through a similar identity crisis which continues to this day, which often manifests itself in ultranationalism as well.Thus, I would argue that the feeling of the void is the continuing expression of a sense of loss that occurred after the emperor was discovered to be mortal, which turned on its head the entire religious system which the state was based on. So Nathan may have benefited if he had explored this further, and perhaps explored the appeal (or lack thereof) of cults and alternative religions.I would recommend for the serious student to also consider reading \"Embracing Defeat.\" I found that to be one of the best books I've read about understanding Japan today, even though it only covers the immediate post-war era.A general observation: \"Japan Unbound\" is hybrid of literary criticism and journalism. That's not a bad thing though. I thought it interesting that author repeatedly draws reference back to the writer Yukio Mishima (regarding whom Nathan also wrote a biography, which I have not read). I did in fact learn a lot from this book about Japan, and I think Nathan's perspective and thoughts will benefit anyone trying to better understand Japan. In particular, he illustrates the Japanese celebration of the bittersweet beauty of impermanence quite well. Moreover, he does a good job of bringing to life the characters that he covers, and he selects them well. I would recommend this read for anyone interested in expanding their understanding of Japan, although it is far from a definitive account.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "John Nathan has written an interesting book. In a way, this book shows how academics have lost control of the debate about Japan. It's no longer necessary to be a Harvard Ph.D. (like Nathan) in order to get an insider's view of the Japanese public school system. Nathan's chapter on what he discovered at a mediocre public school on the outskirts of Tokyo will seem like yesterday's news to any young American, Canadian, Australian, etc. who has taught within the confines of the system. Nathan also writes at length about how, in the 1960s, Japanese were shocked by his fluency in their native language. But times have changed, and Japanese today are much more accustomed to non-Japanese possessing at least a degree of proficiency in their language. The book's best chapters (they all deal with different subjects, so you can skip around rather than reading straight from page one to the end) deal with Yasuo Tanaka and Shintaro Ishihara, two writers-turned-politicians. This isn't surprising, since Nathan is a literature expert. The book contains many minor factual errors, but overall it's worth reading. I found it quite balanced and objective, a good antidote to those books that claim Japan is about to sink into the Pacific Ocean.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have met many visitors to Japan who are extremely impressed with the hospitality and the politeness of the people. The society itself is also a highly advanced technologically and its people enjoy a high standard living that most enjoy. However, what Nathan does is that he takes his readers to a troubled Japan that is seldom seen by the outsiders. Nathan does his best to present the reasons why Japan is in the state it is in. Although it has one of the world's strongest economies, there is a sense of despair that many Japanese feel despite its modernity.As Nathan points out, it is a country that is still seeking to define itself in many ways, and this is clearly seen among the young adults in Japan. I believe that Nathan's views Japan's societal problems mostly stemming from a spiritual void (although he does not use this term). This void exists in Japan largely due to its defeat of the Pacific War and the Emperor renouncing his claims of deity. Nationally, during the Pacific War, the Emperor was the rallying cause for the country and there has been no cause to arise from that time.The generation that grew up after the war had a clear goal in mind which was to rebuild the country. Now that the country has been rebuilt, there appears to be no national cause to give oneself. The pursuit of most Japanese is individual prosperity and its people have adopted a materialistic philosophy that has not adequately filled that void. This is displayed in the lives of many broken families, absentee fathers, and a growing number of purposeless young people that Nathan documents in this book. Despite this though there are a few individuals in various stratas that are seeking to influence the future direction of Japan.Although many of the examples that Nathan provides are extreme, such problems and people are commonly known in Japan. It was a very perceptive and informative read, about a country that is still attempting to redefine itself amongst its own people and in the modern world at large.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Japan's history and culture is deeply rooted in its 1400 years of interaction and trade with its Asian neighbors, and especially with China during after the Tang dynasty of 618 to 907. This Asian orientation was the basis and has strongly influenced the development of Japan and contributed to the Japanese \"identity\". This Asian orientation continued until 1853 when Japan embraced both its past and while simultaneously embarked on a new path to absorb and adopted western or modern technology and culture during the so called Meiji period named after the emperor of that period. This continued until 1945 when its empire crumbled in war. With a fresh start but with its industrial infrastructure and with many government agencies and educational system still somewhat in tact after the war, it entered the second phase of its modern development becoming the world's leading financial power and creditor nation by the late 1980's. But after this financial run up the economy stalled, stocks and real estate prices fell sharply, and Japan entered a decade and half long period of economic stagnation and adjustment.That brings us to this new 250 page book. The author is a Japanese speaking Harvard educated American scholar with four decades of Japanese experience. He has lived in Japan for many years and is eminently qualified to write the book. The book is short and uses a combination of interviews, personal observations, and references to Japanese writings to provide a sense of a country in transition.He discusses the issue of the \"unique\" cultural identity, the politics, youth violence, the modern Japanese corporation in a state of flux, the family, and a number of other subjects. It is clear from the book that Japan is in the midst of another change or renewal. The people are turning again to nationalism, seeking pride in their country, and have a desire to re-establish Japan as a country respected by China and America but working more independently. In the background are lurking many social changes and a breakdown in the school systems, unemployment, changes in the family, and a dramatic increase in youth crime rates - all that are new for Japan that was previously a strongly structured and a more predictable society.This is a well written book. It manages to be both educate and entertain with many stories, insights, and humor. It brings up to date on what is happening in Japan today in 2004.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "turning japanese memoirs of a sansei",
        "description": "\"The poet David Mura brings an intriguing perspective to the New World quest for enlightenment from this ancient and ascendant culture\" (The New York Times). Award-winning poet David Mura's critically acclaimed memoir Turning Japanese chronicles how a year in Japan transformed his sense of self and pulled into sharp focus his complicated inheritance. Mura is a sansei, a third-generation Japanese-American who grew up on baseball and hot dogs in a Chicago suburb where he heard more Yiddish than Japanese. Turning Japanese chronicles his quest for identity with honesty, intelligence, and poetic vision, and it stands as a classic meditation on difference and assimilation and is a valuable window onto a country that has long fascinated our own. Turning Japanese was a New York Times Notable Book and winner of an Oakland PEN Josephine Miles Book Award. This edition includes a new afterword by the author. \"A dizzying interior voyage of self-discovery and splintered identity.\" -Chicago Tribune \"There is brilliant writing in this book, observations of Japanese humanity and culture that are subtly different from and more penetrating than what we usually get from Westerners.\" -The New Yorker \"Turning Japanese reads like a fascinating novel you can't put down . . . Mura's story is a universal one, and one that is accessible to everyone, even those whose experience in the U.S. is not that of a person of color.\" -Asian Week \"[Mura] paints a portrait of Japan that is rich and satisfying . . . a refreshingly kindly and tolerant study, a powerful antidote to the venomous anti-Japanese mood that seems, distressingly, to be seizing some corners of the American mind.\" -Conde Nast Traveler",
        "authors": "['David Mura']",
        "infoLink": "https://play.google.com/store/books/details?id=GLDSDwAAQBAJ&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I was drawn to this book because I'm interested in the issue of cultural identity of immigrants and their descendants. The subject of the book is an important one and I admired the author's brutal honesty. However, it has to be said that this just isn't a book that compels you to keep reading (not for me, anyway). We read about countless, mostly banale conversations in bars, and the book's 'revelatory insights' are underwhelming to say the least. There are a few interesting nuggets but they are few and far between. I'm not quite sure why I waded through the whole thing.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "I can't comment with any authority on this book regarding its literary merit. However, I can say that, having lived life as a sansei just as David Mura has, I found this book a compelling read -- a book whose feeling and emotion was/is quite consistent with mine. This is so even though for the most part we seem to have lived very different kinds of lives. Our principal commonality appears to be that a stay in Japan during young adulthood played a pivotal role in helping us learn something about ourselves. Trivial and obvious? Perhaps. Anti-white and/or anti-American (as has been stated by other readers here)? I don't think so.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I am in the midst of Mura's book and already feel compelled to defend it. The book was a gift from a friend who attended a reading by Mura that I was unfortunately absent for. I regret not meeting him. I too lived and wrote in Japan during the same period covered by Mura, and I want to assure all readers that he is right on the money about the gaijin experience in Tokyo during the 1980s. I am not AJA, so I can't vouch for his correctness about the sansei experience, but I suspect that he is equally on the money in this regard. (I have noted the supportive reviews by other AJA male reviewers: curiously, his detractors seem not to be AJA, meaning their opinions of his experience are probably invalid.) Mura's honesty may have come as an embarrassment to the AJA community: good. The complacence of the older AJA generation needs a good shaking up. This much I feel I can say as an American. It is high time AJAs shake off the dubious honor of &quot;model minority.&quot; As for the writing, again, Mura's detractors elsewhere in these reviews don't seem to have much of a grasp of good writing. He is eloquent, authoritative, acutely observant, relentlessly honest, and achingly authentic. I would suspect that his poetry is first-rate as well, and I intend to read it next. Thanks Dave! Wish we could have met in La Jolla. Maybe next time!",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a Japan-born Japanese who lives in Boston for over 10 years and it is my strong pursuit to learn cultural encountering points between East and West especially, to name, Japan and US. The book caught my eyes immediately when I first saw it in a bookstore since I thought I can read about this Japanese American who know more about US than Japan although he must have been exposed to a some level of Japanese-ism over the course of his upbringing. My expectation from the book was to see the complex mosaic of his feeling toward Japan and its culture now that he lives in the country Japan. Unfortunately, it was not what I retrieved from the book since he was rather in a rare subculture of Japan and read little about his interaction with Japanese as cultural encountering. However, it was certainly a personal memoir of an expat who lives in a foreign country but knows the intricacy of Japan. This will not be a book for those who want to read his statements of Japan. But it will certainly be an interesting reading if you want to read the life of this expat who can describe his personal experience in more Japanese familiar terms.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "As an Asian American who has lived in Asia, I could certainly identify with some of Mura's insights. As for his writing, he is a poet, but also an intellectual, and so his insights do at times appear to be excessive self-brooding. While I don't dislike the book, I found myself having trouble agreeing with some of his conclusions. For one, Mura links problems with his sexuality with his racial identity. Fine. But then he links it with his parents' silence in the internment camps, a more tenuous and less convincing argument. After all, many Asian American men feel anger and resentment about emasculation in society, but why does Mura focus mainly on the internment camps and not on other factors? But I'm nitpicking here. Mura is a progressive liberal intellectual who has come up with a well-written memoir. I must say that it did lose steam, however; after awhile I began to wonder if Mura spent most of his grant money going to bars and having intellectual dinner parties with his Japanese friends.I appreciate Mura's brutal honesty. He admits his sexual frustrations and fetishes of even his white wife. At times, one might wonder why Mura feels compelled to be so revealing, but it becomes clear that it is because his pain as a racial minority has been so extreme. Interestingly, I sympathized with his parents, whom he describes as having been somewhat taken aback and hurt by his words and actions (he discusses this more in his next book). While I can understand why Mura felt he had to include the private details of his life, his parents maintain their stoic dignity. Whether you like him or not, ultimately, he writes about something few others are willing to write about. For that, this book should be given some credit.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an important and honest look at the Japanese American experience in this country. As a nisei with Japanese parents, I did not experience the impact of the internments through them, but David Mura's honesty about his experience truly resonates with my experience. The negative Kirkus review of his other book &quot;Where the body meets memory&quot; here on Amazon makes me angry and I suspect that the person who wrote it has no understanding of the experiences of Japanese American men in the United States",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I appreciate Mura's contribution to Asian American literature and his courage to reveal himself, which is very atypical for Asian/Asian American men. His struggles with his racial identity and journey to find connections with his grand parents' homeland were fascinating. Being a person of Japanese ancestory, I believe Asian/Asian American men can personally relate to Mura's story. I also recommend his other book,&quot;Where the Body Meets Memory&quot;, which reveals further on his issues and helps to complement this book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree with the reviewers who found the book repetitive, a little boring and more about his family than Japanese culture. While he attempts to provide many insights I fear that most of them are dated now 16 years later. Also the author makes such a big deal about seeing the hometown of his grandfather and when he finally gets there after 300 pages there is absolutely no payoff.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the chrysanthemum and the sword",
        "description": "\"One of the best books ever about Japanese society . . . [A] thoughtful, nuanced study of the Japanese character.\"-U.S. News & World Report \"A classic book because of its intellectual and stylistic lucidity . . . Benedict was a writer of great humanity and generosity of spirit.\"-from the foreword by Ian Buruma Essential reading for anyone interested in Japanese culture, this unsurpassed masterwork opens an intriguing window on Japan. The World War II-era study by the cultural anthropologist Ruth Benedict paints an illuminating contrast between the people of Japan and those of the United States. The Chrysanthemum and the Sword is a revealing look at how and why our societies differ, making it the perfect introduction to Japanese history and customs. \"A classic of Japanese cultural studies . . . With considerable sensitivity, she managed both to stress the differences in Japanese society of which American policy makers needed to be aware and to debunk the stereotype of the Japanese as hopelessly rigid and incapable of change.\"-The New York Times \"An absorbing account of Japanese culture . . . almost novel-like readability.\"-The Journal of Abnormal and Social Psychology",
        "authors": "['Ruth Benedict']",
        "infoLink": "https://play.google.com/store/books/details?id=16_qDwAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Anthropologist Ruth Benedict was asked by the US government to research and compile information about Japan in order to understand the enemy they were fighting and the country they would soon be occupying. She did this surprisingly well considering that she had never set foot in Japan! Instead she conducted her research by interviewing Japanese who were living in the US during WWII and by gathering as much information on Japan as she could find. Having lived in Japan for ten years myself I found her observations to be accurate but also a bit outdated considering that we are now in the 21st century and Japan has become the second largest economy (not military). But Ruth did predict that Japan would refocus it's efforts and become a strong country again. The only criticism that I have personally is that Ruth had a very positive and understandably objective view of Japanese society, a society that I find somewhat childish, ignorant, and racist. But obviously one cannot completely understand a society until they have lived in that society for a while and learned the language so that they can get under the surface. I recommend this book for anyone interested in the origins of Japanese culture. As one reviewer remarked, the US should have done this kind of research before invading Iraq so they could have seen the mess they were getting into. One line from the book that I totally agreed with is that Americans tend to think that deep down inside people around the world are all the same but we are not all the same. Unfortunately (or fortunately) this is very true.",
                "review/helpfulness": "25/34",
                "num_reviews": 34
            },
            {
                "review/text": "I am an oriental who is familiar with Chinese, Japanese, and Korean culture. This really hits the nail. Many people may say that this book is outdated - not so. The fundamental cultural undercurrent of Japan still remains as the book describes. In my opinion, this book holds key to understand motivation and reason in why Japanese do and say things that would be hard to understand by Occidental standard. Also for Chinese and Korean, the idea of 'repaying debt,' and 'duty' may not be specific as Japan and may not have strong vengeful element, but still is very much tied in with idea of filial piety creating more similar result to that of Japanese then that of the first world Western culture in terms of what is proper conduct, who to respect, how to show or not show respect, and saving the face (although some Chinese and Korean may claim that they much are different from Japanese in many respect. I would say by all means it is not identical, but similar from western standard). I have seen many westerners study Zen and Japanese tea ceremony to understand Japanese culture - this will not do. This way will never quite bring genuine understanding of Japanese because they will still be considered as a foreigner thus exception to regular application of Japanese hierarchal rule.Many readers say that this book is not creditable because Ruth Benedict had not lived in Japan. That is irrelevant. This book cuts through craps and shows you the core of Japanese cultural mechanism.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "In 1944, the Allies landed in Normandy, forcing the German army to fight on two fronts; on the Pacific the counteroffensive against Japan gave the Americans one victory after another. The war was almost finished and the new world order was only a matter of time.The losers, Germany and Japan, not only had to be punished, but these nations needed to be revived and given a fresh start.In this political situation, the American government decided to get advice not only from the military and politicians, but also from the anthropologists - in an attempt to understand foreign, now subordinate, societies. The Japanese culture, so alien and distant from the American one, which is firmly rooted in Europe, was analyzed by Ruth Benedict, an anthropologist from Columbia University. The goal was to learn of the strengths and weaknesses of the Japanese in order to assume the best strategy towards the end and after the WWII.Benedict writes with rare objectivity, describing Japanese traditions and customs, the habits, which are obvious in Japan, but weird, extreme or unheard of for an average Western person. She describes the situations, when the Japanese expect politeness and respect, and when they cannot count on any; when they feel shame, confusion and embarrassment; what they demand from their family, friends, co-workers and themselves. She discusses their roots, symbols and ideas on which the society is based (this is not a book about religion or art, so they are only mentioned when necessary).The fact, that Benedict had never set foot in Japan, was nothing special - it was believed that it is possible for an anthropologist to use means other than personal experience in their work. She interviewed the Japanese immigrants and expatriates, and used written texts - books, newspapers and letters, to recreate the picture of the Japanese society and familiarize the Americans with the Japanese life attitude - to the certain extent. She succeeded in presenting the Japanese as people different, but equally civilized and developed to the Americans, and despite her objectivity she managed to sneak in some personal attitude - for example, although she mentions the defeat of Japan and American victory, she does not mention the nuclear attacks on Hiroshima and Nagasaki, which she did not approve of. Interestingly, she compares the Japanese to teh Americans, which, to non-American reader, is also a good insight into the life of the average American in the 1940s.\"The Chrysanthemum and the Sword\" remains the staple for those interested in Japan. It still gives the basis of the knowledge of the Japanese and provides a starting point. Of course, there is no mention (how could there be?) of the economic boom and the technological revolution, of karoshi and sararimen (but how to understand the latter two without any knowledge of bushido and samurai culture?). But nearly every new book, which describes these phenomena, mentions Benedict's work.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "Any westerner who's ever been to Japan may have felt at one moment or another that he or she has landed, not only in a different country, but in quite a different planet. If you're taking a trip to Japan, the cultural tips you find in a quick reference tourist guide might suffice for travel, but if you're planning to live in Japan or study any particular topic of its culture, you'll definitely have to dig way deeper.\"The Chrysantemum And The Sword\" is a classic text of Cultural Anthropology written around the end of WWII, and althought its author, Ruth Benedict, wrote it whithout ever setting foot in Japan, it's remarkable how far she went to understand the underlaying values of a culture like this, at times fascinating, and at times shocking. It was written in 1946, but it's still a book some people in Japanese universities suggest as a reference to understand some key aspects of this amazing culture. I'd also say this book is a must-read for anyone interested in humanity in the middle of war.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Certain chapters in Ruth Benedict's book are easier to read than others. In some chapters, her writing style is terse, heavy, prone to constructions that reek of a style common 50 years ago that no one uses anymore. This occasionally made it difficult getting to the useful information.Other chapters read in a much lighter, easier to digest fashion. The chapters on obligation (\"on\") and child rearing were very interesting and easy to read. These were also probably the chapters I found most enlightening for understanding the Japanese character.I recently began working for a Japanese firm and became very interested in understanding more about the unique Japanese character, and how I could communicate best with my co-workers and perhaps understand them better when they said certain things or acted in certain ways. In this respect, this book has been invaluable, especially when dealing with individuals born from 1940-1970.This book has helped me understand why the Japanese say or do certain things that seem superfluous or hypocritical to an American. Also, this book has opened me to having true cultural understanding (not \"tolerance\" which is not the same thing, but truly understanding the roots of culturally distinct behavior and psychology) for the Japanese.Recommended for anyone working with or living with the Japanese.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the japanese",
        "description": "Memories of World War II exert a powerful influence over Japan's culture and society. In The Japanese and the War, Michael Lucken details how World War II manifested in the literature, art, film, funerary practices, and education reform of the time. Concentrating on the years immediately before and after (1937 to 1952), Lucken explores the creation of an idea of Japanese identity that still resonates in everything from soap operas to the response to the Fukushima nuclear disaster. Lucken defines three distinct layers of Japan's memory of World War II: the population's expectations at the beginning, the trauma caused by conflict and defeat, and the politics of memory that arose after Japan lost to the Allied powers. Emphasizing Japanese-language sources, Lucken writes a narrative of the making of Japanese cultural memory that moves away from Western historical modes and perspectives. His approach also paints a new portrait of the U.S. occupation, while still maintaining a cultural focus. Lucken sets out to capture the many ways people engage with war, but particularly the full range of Japan's experiences, which, he argues, the Japanese state has yet to fully confront, leading to a range of tensions at home and abroad.",
        "authors": "['Michael Lucken']",
        "infoLink": "https://play.google.com/store/books/details?id=8MkdDgAAQBAJ&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I found Jack Seward's book valuable for the amount of interesting insights it contained, but I think that many of his views and assessments are outdated. In addition, he occasionally gets sidetracked by passionate feelings on certain subjects (America's high crime rate, prejudice against biracial children). These long monologues are extremely angry and at times offensive (Seward claims that crime is an activity engaged in primarily by 'Negroes' and that those who would rehabilitate criminals are 'bleeding hearts'), and I felt that they detracted from the book's credibility. I think Seward's book might have been revolutionary when it was first published, but I didn't find it very helpful in the year 2000.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have read a lot of books on Japanese society and culture and this was one of the most interesting and entertaining. The author lived in Japan for many years, is fluent in Japanese and has operated as an active participant in the Japanese culture. So while gaijin will always be on the outside looking in to some extent, this author got a whole lot closer than most. The tone of the book is informal and occasionally irreverent (laughed out loud on several occasions). The author went more in depth in explaining some issues than I have seen in other works. The previous reviewer's comments are unfounded in my opinion, as the angry tone and the alleged comments about crime and punishment were not in the book (at least the edition I read). The author does make some critical comments about Japanese culture, but overall is very sympathetic and positive toward the Japanese. Perhaps this reflects the fact that the book was written at a time when people were more realistic about cultural differences -- good and bad -- and felt more comfortable candidly talking about them. Overall, this is a very good introduction for beginners, or follow on book for aficianados of Japanese culture.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Jack Seward covers the spectrum of Japanese Life and Thought in his book 'The Japanese: The often Misunderstood, Sometimes Surprising, and Always Fascinating Culture and Lifestyles of Japan. With a jaunty air he covers the need for hot springs and communal baths, matters sexual, crime and punishments and the colourful ways you can leave this world by disembowelment. He also looks at the humor in mis-translation and the Japanese thought on our miscreant Western ways.Its a good read and a must for anybody visiting Japan or a hard core arm chair traveller.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "even monkeys fall from trees the wit and wisdom of japanese proverbs vol 1",
        "description": "The original collection of wise, funny Japanese proverbs in an expanded edition.",
        "authors": "['David Galef', 'Jun HashiPoto']",
        "infoLink": "http://books.google.com/books?id=z-z-wAEACAAJ&dq=Even+Monkeys+Fall+from+Trees:+The+Wit+and+Wisdom+of+Japanese+Proverbs+(Vol+1)&hl=&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I just finished going through this book, and I enjoyed it very much. Today I read the other reviews, and I can understand their opinions, but think another perspective should be added. I'm sure my Japanese is not nearly as good as the other reviewer, and I don't live in Japan. Still, here is my opinion.Translations are difficult in any language. Working on some very simple translations I found them most challenging. For example, the word Kobunboku I translated as Plum Blossom. If you translate the Kanji singularly and literally it would be Nice Prefered Wood. But if you understand the symbolic compounds it reads \"The famous tree of Chinese literature\" the flower of peace, the plum blossom. Most Japanese people would not recognize this literary compound. In reality no translation is perfect. In the version of one of these proverbs I have: \"Fallen blossoms don't return to the branch. . .\" It includes: \"There is no sense in crying over spilt milk.\"As far as testing them on Japanese friends, and average Japanese people having not heard them. . .would this be less common with English idioms? The South has many idioms people in the North have never heard. \"He's drunker than Cooter Brown\" \"Penny wise, Pound foolish\" I never heard till I was 40.I would add I don't think it is a good idea to try and use these proverbs to impress Japanese speakers. Contrivance is rarely respected.I greatly appreciated the author including the Kanji, Romanji, Hiragana, and English, and I think the book is helpful and a lot of fun to read with some nice thoughts to reflect on their wisdom.PS: The title \"IS\" Even Monkeys Fall From Trees :)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I live in Japan and I am here to tell you that these proverbs are rarer than an uncooked steak. 80% of the proverbs my Japanese friends have never heard of, and the rest they are not sure what the proverbs actual mean. My advice is master the easier Japanese first!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "nisei daughter",
        "description": "Tells the story of a Japanese-American woman growing up in Seattle in the 1930s who was subjected to relocation during World War II",
        "authors": "['Monica Itoi Sone']",
        "infoLink": "http://books.google.com/books?id=kIjY38NMOnEC&dq=Nisei+daughter&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Part of Nisei Daughter's charm is the way Sone is able to weave entertaining anecdotes throughout her tale, a story which is essentially about what being Japanese American in the time around wartime America meant to her. Specifically, her position as a Nisei daughter -- child of first generation Japanese Americans -- is the focus of this tale.The disappointing thing about this book is how obviously self-censored the book is. Sone very briefly reveals deeply felt rage and resentment at intervals during the book, only to shake them off and quickly change to a more light-hearted topic. Granted, there is an ironic tone to many of her comments and situations, and again granted, she is writing for a post-war audience that probably would not be receptive to outspoken criticism of the Internment, but still Sone seems to sugar coat the experience just a bit too much for my tastes. By the end, with the patriotic speeches that make it sound like the Internment was as much the fault of the Japanese Americans as it was the government, I was getting a little tired of Sone's carefree and apologetic tone, especially after the highly charged preface. In the book, Sone all but thanks the government for interning her and her family and giving them this character-building experience.If you are truly interested in the internment and the impact it had on the Japanese Americans, try a book like Joy Kogawa's &quot;Obasan.&quot; It's written about the Japanese Canadian experience, which was even more extreme than the Japanese American one. Kogawa also experienced internment first hand, but &quot;Obasan&quot; is written far enough after the fact that Kogawa is able to give the story more perspective and is able to put a more honest face on what really happened.Nisei Daughter is not a bad book by any means ... but it did not live up to my expectations either. Sone's self-conscious editing makes the story seem much more like a novel than the autobiography that it supposedly is. I kept wishing she would drop the mask she was wearing and let the reader see what she was really thinking!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Both my wife and I thoroughly enjoyed reading this wonderful story about growing up in America as a 2nd generation Japanese-American. It is an important book to read so that we can better appreciate how fortunate folks are in the USA, and the importance of continued acceptance of other cultures and future citizens of the USA.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is the story told by a daughter of Japanese immigrants growing up in pre-World War II Seattle. She was in college when Pearl Harbor struck.I think the best parts of this memoir deal with the description of Japanese culture and the conflict between the Americanism of the Nisei and their Issei parents most of whom heavily maintained Japanese customs. Perhaps the funniest part of the latter in the book takes place during the wedding reception held for her brother Henry and his bride in their camp in Idaho during the war.I'd have to say that the best written, the most vivid part of the books is the family trip to visit relatives in Japan where her little brother Kenji fatally contracted dysentery. I'm guessing that this trip must have taken place around 1929.The author gets released from camp mid-way through the war to go live with some former missionaries in Chicago who are very nice. She works for a dentist who is, however, a real pain in the butt and she eventually quits.She then gets the opportunity to go attend Wendell college in Indiana where she lives with a nice old widow and she says that this college was full of alot of diverse foreign students. She made many close friends. During her post-camp period, her faith in American democracy was largely restored because she met so many nice white Americans who weren't racist louts. The book ends on a sort of patriotic note which I can't follow completely. In Chicago she was often mistaken for Chinese and people told her how much they respected the Chinese people, America's ally and she was sometimes mistaken for various Chinese celebrities.It's obvious, that the author, who at the time of this 1979 edition, was still a clinical psychologist, knows how to write. She is a very gifted descriptive writer, though sometimes she lays it on too heavy. She tells her life story with a great deal of sentimentality; at times I think she pours it on a little too sweetly. But heck it's her story and she crafts it very well.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Nisei Daughter is a one woman's account of what it was like for her to grow up in Seattle being a second-generation Japanese girl. Her story provides a glipse of historical Seattle, the struggle between 1st and 2nd generation Japanese Americans, what it's like to be a girl in Japanese-American families, and how Japanese/Japanese Americans were treated during WWII. (Her family was sent to an internment camp). Very moving, I read this book in college as part of a WA state history class but it was so touching that I plan to reread it for pleasure.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a real Japanese daughter in Tokyo of Today, I very much enjoyed Ms. Sone's narrative. This is a story about prewar Seattle and the life of Japanese-Americans, as well as her identity struggle during the war time.With the eyes of an observant Nisei girl, Ms. Sone tells us about people around her, and school life, both local and Japanese, in a positive (somewhat humorous, sometimes sappy..) way.This is amazing. No one told me such an interesting story like this. Travel guide books only show us lovely views or baseball stadiums. Japanese school textbooks NEVER mention Japanese-American history and heritage. What a waste. We could share their feelings...I could have been a Nikkei(JA) daughter if my great-grand parents had emmigrated to the West Coast. (Actually, they once lived in Manchuria instead.)Since I found this book, I also have searched my heart and wondered where I had come from... It's so stimulating.ARIGATO, KAZUKO-san ! Seattle does not only mean Ichiro Suzuki.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very nice memoir about being a first-generation Japanese American (\"Nisei\"). My biggest criticism is that the flow is not quite right. I attribute that to the fact that the author is not a writer by trade. The very extensive details that pepper the story detract to the overall flow of it, but nonetheless, this book is very interesting. Monica Sone explores the dichotomy that many \"hybrid\" people experience: the contradictions of culture, the generational gap made even deeper because of the cultural differences. In her case, these differences were quite extreme: from the demurred and modest Japanese ways to the boisterous, assertive American. She describes many examples of where these differences were patent, and does a very god job in the process. Another excellent area of the book is her analysis of the conflicting emotions she experienced. Here she is, feeling very American, and sent to a concentration camp, labeled as \"the enemy\". She and her fellow camp-mates experience a collective rage, but it is during these years and after her release that she finally comes to terms with her at times contradictory cultural heritage. The end has very patriotic overtones which I thought were quite sappy, given her circumstances. I wish she could have gone further into describing her family life after camp, and the reassimilation of Japanese into American society post WWII.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very nostalgic and many mutual experiences and shared neighborhoods. Keep me turning pages until I finished. Well done!!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Nesei daughter is quite an intriguing narrative based on an autobiography of a Japanese-American woman who lived in Seattle during the 1920's and 1930's.The author presents an illuminating account of the complexities surrounding being a US citizen of Japanese descent and how this affected them after the outbreak of World War II when they had to be evacuated from Seattle, isolated and kept in concentration camps without trial.The book is useful for understanding issues of identity, racism, social justice, citizenship and gender. It is an invaluable tool for understanding the history of orientals within the US and can serve as memoir for them.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "strange but true stories from japan",
        "description": "Strange but True Stories from Japan is a fascinating collection of vignettes, ranging from historical to the personal. Here you will be exposed to the goings-on of Americans serving time in Japanese prisons and the many who claimed the identity of Tokyo Rose. And learn about the bizarre habits of the eels that roam the Chikugo River. In this eclectic and, well, strange, book you'll relive-from a distance-Kamakura's hara-kiri bloodshed and discover the surprising fate of the armless geisha, Tsuma-kichi. Seward also weaves touching memoir pieces between chapters that recount hilarious instances of fractured English and shocking-to-the-average-American Japanese cuisine. Written with an eye and ear for the theatrical and for the rhythm of Japanese life, this delightful but serious romp through modern Japan brings Seward's wide and varied cultural and military background to center stage.",
        "authors": "['Jack Seward']",
        "infoLink": "https://play.google.com/store/books/details?id=hCTRAgAAQBAJ&source=gbs_api",
        "categories": "['Literary Collections']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Jack Seward, the author, lived in Japan for many years as an army officer and CIA agent after the occupation. He has written 44 books on Japan in both English and Japanese and now makes his home in Texas. This book is a compilation of an eclectic array of vignettes.The title gives it away. &quot;Strange But True&quot; lives up to it's expectations. The point of view of all of these stories is targeted so that an American audience can click its lips in wonder at the weirdness of these people.Many of the stories are retelling of historical battles, including the rite of hari kari. Other stories give unique glimpses of history, such as the story of the geisha who married into the J.P. Morgan family or the Russian duke who was wounded while visiting Japan. There's a long confusing story about the trial of Tokyo Rose who did radio broadcasts to American armed forces in the Pacific during W.W.II and a story about an American who became a Japanese citizen.Another piece focuses on the odd way that Japanese is sometimes translated into English, making fun of some of their attempts. Of course he barely mentions how the Japanese might view some English-speaking people's attempts to speak JapaneseFor someone who has lived for many years in Japan and written so extensively Mr. Seward doesn't like sushi and describes Japanese food in a way that makes it seem rather disgusting. It's a good thing I know better.His tales all focus on their strangeness and even though a few of the historical details were interesting, Mr. Seward has a rather parochial and one-sided point of view of the Japanese. There's a sense of mockery and ethnocentrism throughout as he seems to raise an eyebrow over and over again at traditional Japanese ways.What I, as a reader, find &quot;strange but true&quot; is the fact that Mr. Seward could have lived so many years in Japan, written so many books about the language and the culture, and stills sees the Japanese through a prism of cultural barriers and prejudice.Definitely NOT RECOMMENDED.",
                "review/helpfulness": "33/52",
                "num_reviews": 52
            },
            {
                "review/text": "I loved it, as I have all the previous Jack Seward books I've read. He talks of the real aspect of a Gaijin living in Japan. I've spent 21 of the last 34 years in Japan and can identify with the situations he's experienced. The above reviewer has obviously spent little if any time in this unique country. Sushi is one thing (believe it or not) some Japanese, my wife included, do not like. Foods such as basahasi (raw horse meat), and gyuusashi (raw beef) are also common in the izakayas among other items such as raw venison, how does the above reviewer feel about these. Nor I doubt, has she experienced driving down the road in the pouring rain with the driver in the car next to you yelling \"punk\" at you, only to find out you have a flat (punctured) tire. Also if she'd read some of Mr. Seward's other books, such as \"Japanese in Action\" she'd know he talks of the mistakes/mispronuciations Americans make in Japanese, such as koomon (anus) vice komon (advisor), joosei (situation) vice josei(female) and o-na (vegetable) vice onna (woman) and the embarassing situations mispronuciation can get you into. If you're an ex-pat living in Japan, or just curious, buy this book and others by this fine author.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            }
        ]
    },
    {
        "Title": "silent honor danielle steel",
        "description": "From #1 New York Times bestselling author Danielle Steel, a moving novel of families separated and lives shattered by prejudice during one of the most shameful episodes in American history. A man ahead of his time, Japanese college professor Masao Takashimaya of Kyoto had a passion for modern ideas that was as strong as his wife's belief in ancient traditions. His eighteen-year-old daughter, Hiroko, torn between her mother's traditions and her father's wishes, boarded the SS Nagoya Maru to come to California for an education and to make her father proud. It was August 1941. From the ship, she went to the Palo Alto home of her uncle, Takeo, and his family. To Hiroko, California was a different world. Her cousins had become more American than Japanese. And much to Hiroko's surprise, Peter Jenkins, her uncle's assistant at Stanford, became an unexpected link between her old world and her new. On December 7, Pearl Harbor is bombed by the Japanese. Within hours, war is declared and suddenly Hiroko has become an enemy in a foreign land. On February 19, Executive Order 9066 is signed by President Roosevelt, giving the military the power to remove the Japanese from their communities at will. Takeo and his family are given ten days to sell their home, give up their jobs, and report to a relocation center, along with thousands of other Japanese and Japanese Americans, to face their destinies there. Families are divided, people are forced to abandon their homes, their businesses, their freedom, and their lives. Danielle Steel portrays not only the human cost of that terrible time in history, but also the remarkable courage of a people whose honor and dignity transcended the chaos that surrounded them. Silent Honor reveals the stark truth about the betrayal of Americans by their own government . . . and the triumph of a woman caught between cultures and determined to survive.",
        "authors": "['Danielle Steel']",
        "infoLink": "https://play.google.com/store/books/details?id=nfwVgK34WZgC&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "This novel is so wrong it is actually funny.The cover design alone should be enough of a warning that this book is wide of the mark, it's red and gold, which are popular in the Chinese palette, but not Japan.I bought this book for my Japanese wife and from the very first sentence she started giggling at the ridiculous errors.The first character introduced in the novel has the alleged family name of Takashimaya.Takashimaya is not a family name in Japan, but it is the name of a very well known upscale department store chain.(The suffix ya means shop, btw).Maybe the Japanese translation of this novel has a lead character named Mister Nieman Marcus?I could go on but I am laughing too much to type properly.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a moving story about the unbelievable pain and prejudice faced by the Japanese in America during WWII. It tells about the life experiences of Hiroko, a Japanese girl, who arrives in America right after the bombing of Pearl Harbor in 1941. It tells of her life detained in an internment camp and her life after she is released. It tells of her romance and losses. The story is fictional, but could be real... The historical backdrop is convincing and very realistic. It reveals many of the injustices imposed on the Japanese during this time. A powerful and thought-provoking novel.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is the story of one of the most shameful times in American history, the internment of the Japanese Americans. As a half-Japanese, I know I would have been rounded up during this time and stripped of my Constitutional rights, treated as a prisoner. As such, I try to read whatever I can about this important part of America's story. &quot;Silent Honor&quot; is hardly the most &quot;distinguished&quot; or important books available on the subject. It tells the story of a Japanese girl, visiting her cousins (who, as Steel goes to great lengths to remind us, again and again, are AMERICAN, so much that they giggle at her traditions that they don't understand) in California during the time of Pearl Harbor. She gets stuck there and is placed in an internment camp. Along the way, she meets an amazing American man and has an affair with him. If you can disregard the affair (which you should cause it's pretty ludicrous, but I guess standard for this kind of book), you might get a lot out of this novel. The depictions of camp life and the hell that the internees faced is pretty well done. Steel does her research and tries to incorporate important Japanese mores such as &quot;shikata-ga-nai&quot; and historical details like the &quot;no-no-boys&quot; in to her story. You will learn a lot about the camps. I enjoyed the characters and the attention to historical detail, but it must be said that Steel is a pretty horrible writer. She begins almost every sentence with &quot;And...&quot;. I think it's trying to sound dramatic, but mostly it sounds like she needs an editor. If you've never read Steel before, this might drive you insane (look past it, if you can). If you are a big fan, I think this (along with Wanderlust) is probably her best work.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a Japanese living in Kyoto, where the Japanese girl actually came from. I found this story to be entertaining but so unreal. First of all, a Japanese girl in the 40s will NEVER have premarital sex, let alone with a white man. Being pregnent out of wedlock is the most disgraceful anyone can ever imagine. Plus having a child of white man is unthinkable.I recall in the book, the Japanese girl's father spoke to his children in English. This is a bit silly too. Also at the end when she goes back to Japan to find her parents dead from an air-raid is very dissappointing. First of all, Kyoto was never air-raided because there are many ruins of Japan. Where her parents evacuated, Maizuru is in middle of nowhere, a one-horse town, so I can not imagine any reasons for Americans to air-raid there either. I don't think such thing happened. The fact that the girl returning to Japan with mixed blood son without father is ridiculous. However, this is, after all an entertainment book so I can accept it. But I truly wished her parents were still alive and Steel wrote the conclusion in another way. The family seemed to be very modern for that time and I was very interested in finding out how they resolved the problem. But like her other stories, she killed the characters and ended the book without any real settlement.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I liked this book. I think there shuld be more books written about this subject. It is painfully overlooked. Being of Japanese decent, I have many relatives who survived just the kind of experiences mentioned in this book. I think the parts about the camps are very realistic and spectacularly written, but I shake my head at the boy/girl relationship this book is based on. I really don't think a sturdy, well-bread girl like Hiroko would just jump into a relationship so fast, much less with a white man. It gose against everything she was raised to believe. I think this book gives a very stereotypical view of the Japanese women and their morals. Steele really tried, but I think more study into traditional Japanese culture is necessary.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I found this a wonderful love story between a young lady from Japan and a young man from America. They have to face prejudisim from others but they managed to survive...read more to find out.I wasn't dissapointed with this book because she was able to grap the readers attention. Danielle Steel is the best author I've read in a long time! I liked her other novels too, The Ring, The Promise and A Perfect Stranger.Happy Readings!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I liked this book because I found it very interesting. I was able to read about a culture that I didn't know, and get a better understanding. It was a sad, horrible time for Japanese Americans, something that I think many of us forget- this story makes us remember.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Although I agree with the other individuals that have reviewed this book (that many parts seemed very unfeasible) overall it was an excellent introduction to American History. Having been entirely educated in the American school system - we barely glazed over the US treatment of Japanese during the war. I had no idea until I read this book the extent of the mistreatment and injustice that Japanese immigrants and citizens of Japanese decent were subject to during the war. As a story, this book is fabulous, as a tool for education it is a start. Today's youth will pick this up out of interest and they will learn something new. Of course if they want more accurate facts they will have to try the dryer literary works in the history section!! But, at least they will learn a little more about where our country has been and what we have done to our own citizens.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My parents are both native Californians of Japanese descent. They both were interned in concentration camps located in Arizona. Both families were farmers and lost everything as a result of being sent to the camps. My mom said that most of Steel's descriptions of this horrible incident were accurate. Since they couldn't own land, I don't think the family in Silent Honor owned their home as the author wrote, though. I also found it hard to believe the part about the illicit lovemaking, etc. A traditional Japanese girl in the 1940s would NEVER have done that. I have enjoyed Steel's books for many years and am pleasantly surprised when she writes about historical events like in this book and &quot;Message from Nam.&quot;",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is absolutely beautiful. There is so much in it that we can learn, I just don't know how to put it into words. I just barely finished it and I loved it. Good insights into Pearl Harbor and what the Japanese citizens/immigrants went through.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "audrey hepburns neck",
        "description": "Infatuated with actress Audrey Hepburn, young Toshi comes of age in Tokyo, where he tries to make a living while balancing family secrets, American friends and lovers, and his own burgeoning identity",
        "authors": "['Alan Brown']",
        "infoLink": "http://books.google.nl/books?id=PgDYx3ro9uoC&dq=AUDREY+HEPBURN%27S+NECK.&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 6.0,
        "review": [
            {
                "review/text": "Whenever I have an opportunity, I recommend this book to foreign residents of Japan, or anyone else who has an interest in Japan. While this book has a wry sense of humor and fantastic events occur all the time, it still has a ring of plausability to it. Things may not happen in the real Japan the way Brown describes them, but if you have lived here for a while, you certainly can imagine that they might. The characters are brilliantly developed. Your first impression is of a cardboard-cutout stereotype, but as the novel progresses, each reveals personal quirks and characteristics that give them depth and make them interesting. The range of feelings the book covers are fantastic, going from slapstick to poignancy and everything in between. Some people talk about &quot;Memoirs of a Geisha&quot; as *the* novel to understand Japan, but even though it is excellent, it describes a Japan that no longer exists. The Japan in Audrey Hepburn's Neck is alive now, and it shows no signs of disappearing. If you want to know about the modern Japan, and be highly entertained while doing it, this is the book.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a terrific book. Although I enjoyed the story, the crisp prose, the wry comments on sexual politics, and the deft portrait of contemporary Japan, I most liked the book for its depiction of Americans as seen by Japanese -- it beautifully captured how peculiar and inexplicable the Western style is to someone from outside its orbit. I was also impressed by the author's bravery in moving into subjects, such as the treatment of Koreans during the Second World War, that the Japanese deal with either by denial or in the most glancing, oblique way possible. My only complaint is that it seemed to me that by making the Japanese protagonist someone from such an isolated, rural chunk of Hokkaido the writer tinted the book with the kind of nostalgic \"Japanoiserie\" (if that's a word) that he otherwise so smartly avoided. Being American, I can't say if this book captures the Japanese mind, but as someone who has visited the country a number of times I can say that the book _feels_ right -- and, more important, is great fun to read.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "A really good read with a good story. Having just moved back from living in Japan a few months ago, the book prompted a rush of memories -- visual, ofactorial, and auditory. I've walked the streets Brown writes about.What Brown does pretty accurately is capture the essence of Japanese mindset. Detractors overlook this aspect, however, the thoughts of Toshi have been mine at various times of my childhood. The way families communicate, the personalities, the interactions between mother and father, and, later, mother and Taro play real.Detractors just don't get it or are expecting a mere &quot;geography recitation.&quot; Don't go here if you merely want descrption of places Japanes (though Brown proves adept) or you want a neat book where protagonists (and others) think American.But *do* get this book if you want a glimpse into the Japanese psyche *plus* the bonus of a virtual tour of Tokyo during the days of the bubble economy.Lyle Ishida Tysons Corner, VA",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a very nice, different novel that is difficult to put down and in its course illustrates some of modern Japan. There are two parallel stories going on, all centered around a young man finding his place in society. One of the stories shows the manner in which young Japanese, reared still in a very traditional manner, adjust and adapt their lives to a Global modernity, and particularly an American-influenced world. The other story shows how despite the long shadow of WWII the Japanese are slowly coping and dealing with their past, their losses, and their own prejudices. So our hero stands in fact at a turning point. He and his generation by extension are the link between these two worlds.The world of Toshi, our hero, an exceedingly creative guy, is the source for much amazement to the Western reader, from the loneliness of the mega city, to the megaphone messages in the subway. Pets and coffee houses are also the source for much wonder.The book deals overtly and covertly on prejudices. Prejudices the Japanese have about Americans and those that Americans have about the Japanese. Prejudices against homosexuals, against Koreans. But all of it is done deftly, with amazing humor.Alan Brown's observations on how others can perceive Americans, in Japan or out are very keen, funny and true. But he is a master in finding quirky juxtapositions, and more than that in making all his characters three-dimensional and believable.This is certainly a novel worth reading. If you have a weekend coming up and would like something offbeat, occasionally hilarious, and fascinating to read, give this one a try, you will not regret it.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Depressing as it is to agree with the Kirkus Review, I do. This is an elegant take on an uncomplicated, emotional story. A young man learns to forgive his parents their frailities and, in the process, understands his attraction to white chicks. A gutsy move for the author, since according to the jacket photo, he himself is a white guy, choosing to write from the point-of-view of a young Japanese artist with a troubled family history. Nonetheless, Alan Brown uses humor and beautiful descriptive sentences to make it work. Does he stereotype the Japanese? I think a more important question is: Do we care about Toshi or do we put the book down? I did... and I didn't. Plus, the &quot;Epilogue&quot; is perfect. (But then, I'm white and own my own copy of &quot;Breakfast at Tiffanys&quot;.)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I took a gamble when this intriguing title caught my eye since I had not read any review or heard any recommendations from friends. I found myself drawn into this book, captivated by its magic which compelled me to finish it in a 24 hour period.This American author looks at the westernization of Japanese culture and shows us American characters from a Japanese viewpoint. His writing style provides a witty perspective, imbued with subtle and ironic humor. The nuances of human emotional interactions and interrelationships are not lost, even with characters so far fetched they border on the absurd. They are astonishing and unusual,a strange and motley mix. They transport the reader to fascinating and unexpected places and times. The plot intertwines past and present.The intriguing title is appropriate,linking geographically separate settings and times with a unifying theme , the Japanese fascination with the West.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Audrey Hepburn's Neck tells the story of young Toshi and his personal growth, and his discovery of his family history. Scenes from youth are interlinked with the present to form believable characters, a good plot, and a convincing picture of Japan (at least to a foreigner who has never visited, but who has some modern Japenese fiction). I have only one criticism, and that is the grammatical `quirks' (read `problems' if you like) which I kept finding. The story itself made me overlook that. Alan Brown is someone to watch; he's got talent. All in all, it is a charming story that appeals in a similar way to that of Haruki Murakami's fiction. GET IT - IT'S GOOD!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This positively breathtaking novel explores foreign cultures (specifically American) through the eyes of the Japanese. Toshi grew up in a remote area of Hokkaido in a silent and tense household. Captivated by Audrey Hepburn in the movie &quot;Roman Holiday&quot;, he begins a lifelong love affair with American women. He moves to Tokyo to live with his friend Paul, a gay American. Toshi doesn't always understand his American friends, and sometimes feels out of place in his relationships, and it is only through the revelation of his parents' tragic past that he is able to climb out of his stifled history and embrace unencumbered joy. Alan Brown's style is quite magical, and eloquently expresses Toshi's story. Such a wonderfully beautiful book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book was above and beyond all others I have read. Alan Brown is a creative genius, winding an intruiging tale through family chaos. To be honest, the title and beautiful cover made me open it, but from the first page I was hooked and could not put it down. Reccomend this to everyone you know - it made me appreciate how great it is to sit by the fire with your (new) favorite book. This book is truly a genuine MASTERPIECE.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book has provoked some very strong responses here. How can a first novel that is structurally so accomplished get 1's and 2's? If there is stereotyping, it seems to me that it's in the white female characters, the understanding Lucy and the carnivorous Jane (who should have been inspired to go to Japan by &quot;In the realm of the senses&quot;!). The American sprawl (emotional and other) contrasted to Japanese containment is particularized, not stereotyped. Perhaps things are resolved too facilely, but I found the book amusing (sometimes painfully amusing) and touching, somewhat like the film Okog&eacute;.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "nihongo in defence of japanese",
        "description": "The Japanese language is often under attack by linguists, translators and even amateurs for having a seemingly vague set of rules, making it near impossible to ever fully grasp all of the language's facets. Roy Andrew Miller guides the reader through these often contradictory allegations by evaluating Japanese in the light of linguistic science. He also pays particular attention to the problems inherent in certain systems for describing the language, and to questions posed by published translations from Japanese literature.",
        "authors": "['Roy Andrew Miller']",
        "infoLink": "https://play.google.com/store/books/details?id=lY7VCgAAQBAJ&source=gbs_api",
        "categories": "['Language Arts & Disciplines']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As Miller is the first to point out, to any sensible person or linguist who has not been told about Japanese, the title of this book makes it seem utterly superfluous: unlike threats in this century to such languages as Catalan and Korean, nobody appears to be contemplating a prohibition of Japanese -- so why the need to defend it? Answer: because of the tissue of misunderstandings about it that have been passed on from one generation of linguists, litterateurs and practitioners of *nihonjinron* (Japanese-identity-obsessed obscurantism) to another. Both westerners and the Japanese have contributed to this.In this book, Miller sets things straight, explaining certain aspects of the Japanese language in a way that make perfect sense to people who know something of it, and, I think, would also be comprehensible to a non-speaker.Readers of Miller's earlier book, *Japan's Modern Myth*, may wonder how this differs. While *Nihongo* complements the earlier book, they differ considerably. First, the older one is much more concerned with the *nihonjinron* angle; the newer one with the actual syntax and lexicon of the language, and the allegation (which he roundly refutes) that somehow it is inherently vague. Secondly, while the older one was great fun to read (at least if you weren't one of Miller's targets), it was intemperate; and its repetitiveness and roundabout way of arguing made one wonder whether Miller was satirizing his targets as well as debunking them, or whether their illogic had simply gone to his head. By contrast, *Nihongo*, while it pulls no punches, is utterly convincing and admirably straightforward.The price of this hardback will probably limit its appeal to libraries. Any library that has half a dozen or more books about Japan should certainly buy this one as well, for its good sense about the language. And the publisher might consider a belated paperback edition for a wider market, for example learners of Japanese seeking inoculation against some of the sillier things said about it by the most highly respected authorities.(Now please move on to a second book that complements this: Peter N Dale's *The Myth of Japanese Uniqueness*.)",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Roy Andrew Miller is the old angry curmudgeon of Japanese linguistic scholarship, and after years of the Japanese refusing to accept his theories of Japanese-Altaic relationship, the Professor uses \"Nihongo\" as an opportunity to kick ass and take names. He head butts the wacky fantasy world of the Transformational-Generative School and drop kicks the dreadful scholarship of Japanese linguists like Ono Susumu. His willingness to single out the mistakes of other academics makes for an interesting read, but Miller's criticism off drifts into pages and pages of terrible backseat translating.\"Nihongo\" is a caustic book, filled with venom towards rightfully guilty enemies, but all of these criticisms hinge on the reader's trust in Miller's command of the language. Therefore, the venerable Professor's embarrassing mistakes with verb tenses (page 150-151) almost derail the entire episode. How can I believe that this man really KNOWS modern Japanese when he thinks that \"let's write\" is written \"kakeyou\" instead of \"kakou\"? Or that \"if (someone) writes\" is \"kakereba\" and not \"kakeba\"? Furthermore, overconfident statements like, no one would ever say \"asu kara gakkou ga hajimaru\" (page 79) - which is absolutely grammatically and socio-linguistically correct - only serve to weaken his arguments.This book is meant for linguistic scholars, translators, and advanced students of Japanese. Anyone would else would be bored. Miller makes some very interesting points, and his defense of the Structuralist method is important, but embarrassing intermediate-level mistakes clearly undermine the authority under which this book is written.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "japan sinks a novel about earthquakes",
        "description": "A collection of essays and stories by Japanese writers on the devastating disaster, its aftermath, and the resolve of a people to rebuild.",
        "authors": "['Elmer Luke', 'David James Karashima']",
        "infoLink": "http://books.google.com/books?id=zUQZ_44LN8QC&dq=Japan+Sinks:+A+Novel+about+Earthquakes&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "It's a classic convention of literature - and perhaps life - that people reach their clearest insight only when death is at hand. By creating a model of Japan's death, Komatsu deftly exposes the how the Japanese see themselves, how they believe the world sees them, and who they are. As a foreigner in Japan for nine years who has read copiously on this country, this novel is among the most penetrating I've read. For those who aren't interested in dissecting the Japanese, they'll still be thrilled by this compelling tale of an entire nation's doom.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I first spotted this book in the late 1990s. I recently got it because of my interest in the release of the recent film version from 2006 called \"Nihon Chinbotsu\".Is this book worth it? Yes. It is not only a fantastic work of Japanese science-fiction--which is very rarely translated and brought to the US--but as a disaster novel, it manages to capture the confusion and outright terror brought about by the sinking of Japan. This event, brought about by a major shift of the tectonic plates, causes a series of devastating earthquakes and volcanic eruptions, including the eruption of Mt. Fuji. The book is a fast read, with the last few pages being the equivalent of a punch in the gut as the Japanese struggle to deal with the inevitable outcome. Other issues are brought up, such as, what will the Japanese be without their home country? How will the world react to such an unprecedented disaster? And how does one go about evacuating over 110 million people?Ironically, I finished the book right before a major quake struck Japan recently. To say that I got one hell of a chill down my spine is an understatement. Strangely enough, this 1995 translation has an introduction written by Sakyo Komatsu that spoke about the tragic Kobe earthquake which had occurred earlier that year.In the end, I highly recommend this book.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I read this book a couple of months back with pleasure and excitement. It's extremely well written and translated, and its scenarios of disaster are only excelled by what we watched yesterday on the television as the tsunami generated by a real version of this book's events took place. Wikipedia wrote that the novel \"represented the growing discontent in the minds of many Japanese people during the 1970s, as their cultural, economic, and political identity and stability had become under attack from international pressures\" -- now, perhaps, we can see that the author was instead engaging with predicting the impact of a literal geological event.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "contemporary japan second edition contemporary states and societies",
        "description": "Now fully revised and updated, this widely-praised introductory text explores Japan through the prism of three alternative perspectives: mainstream, revisionist, and culturalist. Beginning with the noting of Japan as a \"contested territory\" the book focuses on debates about the real nature of Japan's successes and shortcomings.",
        "authors": "['Duncan McCargo']",
        "infoLink": "http://books.google.com/books?id=qPaiQgAACAAJ&dq=Contemporary+Japan,+Second+Edition+(Contemporary+States+and+Societies)&hl=&source=gbs_api",
        "categories": "['Political Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is just a marvellous description and explanation about how Japan is nowadays, and why it is like that. It addresses all the key points and gives all the hints for understanding Japan. I am living in Japan and needed some gide for understanding Japanese politics, society, working environment, culture, and others... I found that in this book. It contains many useful and updated information, but not in excess. Just marvellous! It is a pleasure to read it. Handy and easy.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Contemporary Japan by Duncan McCargo is an exceptionally well written and succinct overview of Japan today perfectly suited for use in a course on Asian politics. The book is particularly helpful in that it begins with an overview of the various perspectives and approaches which characterize the debate among Japanese experts today. In the following chapters McCargo refers often to the differing viewpoints of particular writers and scholars. McCargo also provides a concise historical overview--something often omitted by other texts. The book does not provide any detailed analysis of the current economic crisis. Nevertheless, Contemporary Japan is recommended for its clarity and good writing.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the abacus and the sword the japanese penetration of korea 18951910 twentieth century japan the emergence of a world power",
        "description": "\"Drawing on a diverse range of new source material, this careful and informed study casts light on a wide array of topics in social, economic, and diplomatic history and contributes to a better understanding of modern Japanese imperialism.\"--BOOK JACKET.",
        "authors": "['Peter Duus']",
        "infoLink": "http://books.google.com/books?id=0a8wDwAAQBAJ&dq=The+Abacus+and+the+Sword:+The+Japanese+Penetration+of+Korea,+1895-1910+(Twentieth+Century+Japan:+The+Emergence+of+a+World+Power)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The author reviews the history behind the annexation of Korea and presents it in the context of the industrialization of Japan. On a conceptual level the book is intriguing, but I feel that it trivializes the ethnic cleansing performed by the Japanese on the Korean race. The author admittedly knows that his research was biased by the generous amount of Japanese documents and not only the lack of Korean documents but his inability to read Korean language. All in all its worthwhile for readers interested in recent Asian history, Japan's industrial movement, or understanding Korean political history.",
                "review/helpfulness": "27/35",
                "num_reviews": 35
            },
            {
                "review/text": "This is a scholarly work and not \"popular history.\" I say the book is important because this is really not a covered subject. Aside from being a bit boring and confusing for people not an expert in Japanese political hisotry during Meiji, I found it disturbing that the author cited only Japanese and English sources. And the majority of English sources are old (1960s). In the intro, the author freely admits he neither speaks or reads Korean (!)So, this is a one sided version of history (from the imperialist side). We will have to wait for some of the very good Korean accounts to be written or translated into English. In the meantime, try Bruce Cumming's work on Korean modern history.",
                "review/helpfulness": "15/22",
                "num_reviews": 22
            },
            {
                "review/text": "The reviews for this book here on Amazon are divided, and you can understand both responses, respect and rage.This volume is what it claims to be: an account of colonization, Japan of Korea from the late 1890s to the early 1920s (but ending before the more brutal culling of the Imperial War Machine in the 30s and 40s).The first half collects the various arguments made in Japan from the 1860s onward: cultural, racial superiority, expansion and capitalism, contending and competing with the West, in the creation of justifying colonization. Particularly useful if the reader has the basics on the ideology of colonialization, Albert Memmi, Franz Fanon, Edward Said etc. Or the other way around: for the reader who is reading up on colonial writings would find the non-Western discourse on colonialization interesting, the discourse on racial destiny and the Japanese \"burden\" to enlighten Asia, compared to the \"White Man's burden.\"The second half of this book catalogues, with official figures and many personal accounts of Japanese life in Korea, for the middle-class and aspiring middle-class entrepreneurs who sought to take advantage of the colonial government and the expansionist policies of the time. And it is particularly useful as a (scholarly) portrait of people, history written from the bottom up, instead of mainly from governments policy and war.The book is written by a Japan scholar, from Japanese documents, so the reader must take into account the sources (and sympathies) involved, the author's lack of current Korean, Korean sources and scholarship, and the text's (near) absence of Korean agency alongside the efforts at Japanese economic absorption. It offers only a hint (in the occasional phrase) at the tolls of economic policies on \"normal\" Korean people as people (human beings with lives and names), in its report of the lives of \"normal\" Japanese. But perhaps that is not this volume's purpose.For a volume written 10 years ago, it's a valuable and readable resource, more useful when read with the collected essays in \"Colonial Modernity in Korea\" that was published around the same time (Eds. Gi-wook Shin and Michael Robinson, 1998) for a fleshed out view of life in the late 19th century and early 20th.Hopefully, almost 10 years after this volume, and with the emerging generation of East Asian scholars, trained in Korean, Japanese, and Chinese, we'll find fuller, more nuanced and complex accounts of history.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I wrote a thesis in college about the Japanese seizure of Korea, and my main argument was that there was no nefarious plot to take over Korea; rather, the annexation was the result of conflicting elements within the Japanese government. (The annexation was, of course, a victory for the reactionary elements.)This book illustrates that there WERE elements within the Japanese government who wanted to help Korea reform. They certainly had ulterior (read: self-centered) motives in doing so, namely economic/financial gain. But there was, at least according to this book, a noted absence of imperialistic/expansionist attitudes by Meiji Japan towards Yi Choson Korea, at least for a time.It is a challenging examination of that time from the Japanese point of view, and it certainly merits a reading from the serious historian.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lonely planet journeys lost japan",
        "description": "An enchanting and fascinating insight into Japanese landscape, culture, history and future. Originally written in Japanese, this passionate, vividly personal book draws on the author's experiences in Japan over thirty years. Alex Kerr brings to life the ritualized world of Kabuki, retraces his initiation into Tokyo's boardrooms during the heady Bubble Years, and tells the story of the hidden valley that became his home. But the book is not just a love letter. Haunted throughout by nostalgia for the Japan of old, Kerr's book is part paean to that great country and culture, part epitaph in the face of contemporary Japan's environmental and cultural destruction. Winner of Japan's 1994 Shincho Gakugei Literature Prize. Alex Kerr is an American writer, antiques collector and Japanologist. Lost Japan is his most famous work. He was the first foreigner to be awarded the Shincho Gakugei Literature Prize for the best work of non-fiction published in Japan.",
        "authors": "['Alex Kerr']",
        "infoLink": "https://play.google.com/store/books/details?id=GPexBQAAQBAJ&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": 7.0,
        "review": [
            {
                "review/text": "When Alex Kerr talks about &quot;Lost Japan,&quot; it is clearly his own personal Japan that is being lost. He speaks fondly of the &quot;literati&quot; of old Japan, a group of well-off leisure class who whistled their days away creating art and appreciating beauty, free of toil or earthly constraints. Oxford and Yale educated, coming from money, Kerr firmly sees himself as the last vanguard of the literati, and his lifestyle is leaving him. The lifestyle of the educated elite.Composed of a series of unrelated articles, the book tells the tale of Kerr's life, of things that happen to capture his fancy, and of the intersecting lives of wealthy art dealers, artists and artisans. Everyone in the book is a genius. Everyone, the last embodiment of their vanishing breed. The world has become too cold to appreciate them. This is the Japan that is lost.The book is incredibly well-written, and Kerr sees with the eyes of an artist. He has insights into parts of Japanese culture that would normally be closed, such as the back stage scene of Kabuki theater. His writing is strong enough to make you long for that vanishing Japan. Secret places and unappreciated nooks will appear as interesting as the most famous temple in Kyoto.Worth reading and enjoyable, but ultimately a grain of salt is needed. Kerr's elitism leaves him blind to anything modern, any new artistic innovation or art form. He sees only the past, and wants to capture Japan like a photograph, and preserve it forever.",
                "review/helpfulness": "52/57",
                "num_reviews": 57
            },
            {
                "review/text": "I have mixed feelings about this book. There is a central thesis to the book - that Japan's culture is &quot;lost,&quot; and worth saving. However, the episodic nature of the book, and the fact that his most impassioned writing comes at the beginning, distracts from the thesis. Instead, the book comes off as an extended one-way conversation with the author, which I must admit wasn't entirely a good thing. While he's obviously intelligent and sensitive, and intimately involved with what he writes about, I found myself a little turned off by the constant name-dropping, claims that anybody mentioned anywhere in the book is a genius, and the tangential anecdotes and facts which seemed entirely self-serving. At one point, he mentions being accepted into an Oxford school society so elite that undergraduates haven't been allowed in for two hundred years. Impressive, but it doesn't have anything to do with the book, and comes off as posturing.Having been born in Honolulu, with similar problems such as ugly, sprawling hotel districts and a kidnapped culture, I'm extremely sympathetic to Alex Kerr's anger at the uglification and cultural deadening of Japan. However, his attitude towards modern Japan is one of instant revulsion. The revulsion lends the book a bitter-old-man sentimentality, that everything has gotten worse. That's not a minor gripe - the author has made it his goal, both in this book and in personal life, to prove that the traditional ways of Japan should be more a part of modern Japanese life. Waxing on about Japan's traditional arts, while unilaterally rejecting modern Japan, just furthers the book's counter-thesis: that the modern and traditional aren't compatible.Perhaps I'm being too negative, and for those interested in the current state of the traditional in Japan, Alex Kerr knows the subject well. Regardless, I found myself disheartened that the book has such a strong thesis, has such an intelligent and undeniably knowledgable author, makes so many good points, but still ends up being an extended bitter rant.",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "I was hooked by &quot;Lost Japan&quot; immediately and could not put it down until I finished the last page. This book should be required reading for anyone who's lived in Japan, anyone who's interested in Japan, or even anyone who thinks all there is to Japan is samurai and geisha (or alternatively, anime and Pokemon). Lost Japan is very reminiscent of Jun'ichiro Tanizaki's &quot;In Praise of Shadows&quot;: they are both works lamenting a disappearing Japan, and both are told in a series of seemingly unrelated essays and anecdotes. Unfortunately, as several reviewers have mentioned already, sometimes Kerr goes to the point that his stories are so self-focused that they detract from the big picture. The entire chapter on literati, for example, did not add much to the story for me at least. However, overall Kerr's style is a success.What impressed me the most with this book is how well Kerr was able to avoid falling into the easy traps of Japan Bashing or Japan Worship. It is obvious that he loves Japan, but at the same time his vision is clear enough so that he can view Japan objectively and speak hard truths. Most likely, any reader of this book who has been to Japan for any period of time found themselves nodding along to many parts of this book that were both critical of and in praise of modern Japan. Kerr says so many things that seem so obvious, and yet they feel so novel because the Japanese themselves have not publicly admitted that there are serious, fundamental problems in contemporary society. The sad thing is that it has been about a decade since Kerr's essays were published in Japan and it is questionable whether Japan has made any real progress in that time. To that end, I look forward to reading Dogs and Demons to see how Kerr's thoughts have changed in the interim after writing Lost Japan.I did not agree with everything Kerr had to say, but I found his arguments and ideas stimulating and fresh. I hope Japan pulls itself out of its cultural and economic recession soon, but as Kerr hints at, a mere decade is no cause for panic in a country where events are measured in centuries and millennia. Japan has suffered worse destruction in its past; here's hoping that the difficulties of the past decade will be made worth it with the rebirth of a new Japan that is able to combine features of its past with the realities of the present.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "Alex Kerr has authored the best book I've read on contemporary Japan. I lived in Osaka from 1992-1994. Mr. Kerr's observations on everything from the arts and environment to business and education struck familiar chords. This book is excellent for foreign nationals currently living in Japan, and for anyone who's ever lived there. The book was originally written for a Japanese audience so some points may be lost on readers who've never made the trip. However, if you're planning to go to Japan and want to learn about more than cultural stereotypes, Lost Japan is your ticket.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This was one of most superb books I have ever read on Japan. Having lived in Western Japan for two years, I found Kerr's insights right on. I have read and kept up on a number of Japanese analysts and Kerr's assessment of the beauty and losses of Japan is subtle and genuine. Ignore the readers on this page who gave it 1-star. This book is best for those who have actually lived in Japan for a significant amount of time, have studied various works on Japan, and better yet, have been to the Kansai region. I have lived in Kyoto and I absolutely LOVED the chapter &quot;Kyoto hates Kyoto.&quot; No one who has ever been to that historical city can deny that glass-box architecture-loving Japanese-futurists promoted the 'uglification' of the most important city in Japan. I didn't find Kerr elitist; he is interested in different art forms than many regular citizens in Japan, but I urge anyone who loves and has lived in Japan to consider this book. Awesome.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "The chapters on Kansai are original and by far the most enjoyable elements in this book - but, overall, give me Alan Booth any day for a fresh and insightful view of Japan. Kerr's book is a very personal (and not unsympathetic)account written, it might seem, to counter criticism he received as a student of Japanese. The book is littered with name-dropping to no apparent end and the very title (in Japanese) which draws parallels with Proust, is ludicrous. The fact that it won a Japanese literary prize is enormously revealing about the Japanese public in itself (and not very flattering). Kerr is undoubtedly very knowledgeable but I'd rather not have this rammed down my throat!",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "\"Lost Japan\" is a fascinating book on several levels.In some respects, \"Lost Japan\" is the thinking reader's companion follow-on to James Clavell's \"Shogun\", minus the sex and fighting, which means several hundred pages lighter.. The swashbuckling Blackthorne of the blockbuster novel is replaced by the fastidious, aesthetic author in \"Lost Japan\". But in both cases the reader has the pleasure of accompanying an outsider as he develops an insider's view of Japan's unique culture. In both cases, the tone is ultimately elegiac as the outsider mourns the passing of a nobler Japan. And in both cases, being an outsider with deep insider insights enables the protagonists to stand head and shoulders above the locals. But let's not push the comparison too far - \"Shogun\" is cliched while Kerr's book is full of original thoughts and observations, based on lengthy immersion in Japanese culture.On another level, there's an historical irony. Throughout the 70s and 80s, the myth of Japanese superiority grew to enormous proportions - their products were wonderful, their companies bestrode the world and their management, production methods and social practices were held up as examples for the rest of us, with little regard to the downsides. Kerr gives his view of what this effort actually cost the country and how the deadened aesthetic sensibilities of Japan Inc overwhelmed the finer culture of earlier times. Yet by the time \"Lost Japan\" was first published in 1993 (Kerr wrote it in Japanese), the mighty post-war Japan of concrete and ugliness was also on the wane.On yet another level, this book is an engrossing study of one man - the author. His cultural sensibilities are honed to a samurai sword edge far sharper than the average salariman could aspire to. He gives us some very selective insights into his cultural passions such kabuki and household decoration. His idea of a fun evening is to get a few drinks in ,do calligraphy and watch the fireflies. The overall impression is of a hugely refined and cultured individual unburdened by mundane considerations. In the absence of any reference to significant others in his life (unlike Blackthorne in \"Shogun\"), he often comes across as being deeply self-indulgent. His insights are precious in every sense of the word.\"Lost Japan\" is often compared with \"The Road to Sato\", which I subsequently bought. I haven't yet finished it after two years, whereas I polished off \"Lost Japan\" in just a few sittings. Strongly recommended.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book had an unusual origin. The author is an expatriate American and long-time resident of Japan, and this book was written originally in Japanese for a Japanese audience. It was translated subsequently into English, but not by the author, who apparently found it difficult to reformulate his book in English. The theme of the book is the decay of traditional Japan. Kerr is an aesthete, and both devoted and clearly knowledgeable about many aspects of Japanese culture. He is also a man who worked for almost a decade for a large American corporation and became knowledgeable about business. He came to Japan in the early 70s, just as the final remnants of traditional rural Japan were being swept away by development. He explores his theme from a number of angles. Each chapter is devoted to an aspect of traditional Japanese culture that is vanishing or under siege; Kabuki, traditional urban architecture, rural beauty, Zen temples, the city of Kyoto; the traditional rambunctiousness of Osaka. These topics are explored in the form of brief memoirs of Kerr's initial encounters with each aspect of Japanese life and/or travels in Japan. Kerr is a good writer and each chapter is both well constructed and contains interesting information. He does a very good job of conveying the unique features of traditional Japanese culture and the rather bland, pseudo-Western culture that has replaced it. He is not entirely pessimistic either; he clearly views Japanese society as possessing considerable capacity for responding creatively to external challenges and internal decline. What this book lacks is a really good analysis of what causes this phenomenon. He identifies the conformist nature of Japanese society as a major culprit but this is an incomplete answer. Homogenization of culture is a worldwide phenomenon, perhaps more obvious in Japan because of the very distinctive nature of Japanese culture. While the loss of traditional culture is regrettable, to some extent it is an inevitable consequence of marked rises in the standard of living and the erosion of a largely authoritarian, defence based society. These are not phenomena unique to Japan though the speed of the transition is very rapid.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I found the subtle convincing argument style of the author to be quite remarkable and effective. He leads his reader through a series of interesting personal experiences occurring over the many years he has lived in Japan - each one making up a single chapter within the book. He carefully explains the essential characteristics of each experience as to why it has had a profound positive or negative lasting affect on him. He describes how his friends, his educational background and his teachers, all of the highest caliber, helped him to appreciate the artistic values he encounters within the scope of the experience. Finally, when least expected, he hits the reader with a profound, but obvious, truth or conclusion that helps to explain deep aspects of Japanese culture of surprising significance.It should be noted that the original text was written as articles submitted to a Japanese magazine, and that this series of articles was so well received by Japanese readers that they were incorporated into the original version of this book that was written in the Japanese language. Again the book was well received. The only criticism that I might venture to make was that I didn't find this compilation of articles to provide me sense of inevitability to make me feel that the book as a whole was going to reach a timely conclusion and final ending. On the whole, though, I think it's a really nice piece of work.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Having lived in Japan for almost 15 years and read about everything worth reading (and much more not worth reading) on the topic, Alex Kerr's book remains the most intelligent description of modern Japan in recent memory. This is not fiction; not some ennui for a Shogun inspired cultural Disneyland, but a look at what is being lost now. This moment. Beauty and loss are central to Japanese arts. No book on Japan by a foreign resident has ever succeeded as well at making felt both elements. As a supplement, any writing by Alan Booth is to be recommended (yes more beauty and loss).",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "in the miso soup",
        "description": "The Follow Up To In The Miso Soup, Piercing Confirms Ryu Murakami As The Master Of The Psycho-Thriller Every Night, Kawashima Masayuki Creeps From His Bed And Watches Over His Baby Girl S Crib While His Wife Sleeps. But This Is No Ordinary Domestic Scene. He Has An Ice Pick In His Hand, And A Barely Controllable Desire To Use It. Deciding To Confront His Demons, Kawashima Sets Into Motion A Chain Of Events Seeming To Lead Inexorably To Murder&",
        "authors": "['Ryu Murakami']",
        "infoLink": "http://books.google.nl/books?id=XS3QwAEACAAJ&dq=In+the+Miso+Soup&hl=&source=gbs_api",
        "categories": "['Detective and mystery stories']",
        "ratingsCount": 25.0,
        "review": [
            {
                "review/text": "I think that too many reviewers are expecting this book to be too much like American novels, and this is where the above reviewers are mistaken. Fans of Murakami or not, the above reviews take in none of the fact that Murakami is NOT American. This is a short 180-novella by a master of his art. Having lived in Japan for the past 7 years (and still living here), I can without a doubt in my mind say, that this book is dead on in its characterization of both American and Japanese characters, its vivid scenery, its execution, and its portrayal of the Japanese society at this current point in time. And why shouldn't it be? It was written by a Japanese author who is in the midst of it. If you are expecting Steven King, move on. If you are expecting Hollywood, move on. If you are expecting something to make the hair on the back of your neck stand up, read! This book is as realistic as it gets. After all... what would you do if you were confronted with a serial killer? Go to the police? Are you sure?",
                "review/helpfulness": "23/28",
                "num_reviews": 28
            },
            {
                "review/text": "With all of the sex and violence in In the Miso Soup, it would be easy to miss or dismiss Murakami's central purpose in writing this book - to highlight the severe problems and harshly criticize modern Japanese society. America lies within Murakami's cross-hairs as well, but Frank's function is as much to personify America's problems as it is to serve as the \"outsider's eye\" on Japan's issues.Much like Coin Locker Babies, In the Miso Soup builds up to a single act of violence, and allows the reader to draw his conclusions from the aftermath. Like most other Murakami stories, violence is both destructive and cathartic, and it is in the scene at the club that the reader fully comprehends Murakami's message. Japan, like Kenji, is empty, lost, materialistic, detached, and passively voyeuristic. America, like Frank, is brutal, naive, judgmental, and schizophrenic. Both have a mutual attraction toward the other as Kenji has always wanted to go to America, and Frank is happy to finally be \"in the miso soup\". Both have a mutual distaste and distrust for the other as well. There is a fundamental gap between the two as well, one that surpasses language and culture, rooted perhaps in the fact that both cultures are both paradoxically fearful and ambivalent toward strangers and outsiders. It is only after the act of violence that both achieve a kind of understanding and peace, and seek the ideal that is represented by the New Year's bells.In the Miso Soup is full of the annoying blanket statements and conclusions along the lines of \"We Japanese are like this\" \"You foreigners/Americans are like this\" that will probably vex most readers (and especially those of us who lived in Japan and confronted these superficial stereotypes daily) but the points Murakami makes are well taken. Agree with them or not, Murakami has created a chilling parable where he lays bare his thoughts on the pressing social problems of Japan and the US. Whether one looks upon Frank as a mere \"virus\" or an agent of change also depends on the reader's viewpoint. The scenes of violence will offend many (if not most) readers, but it is my hope that people can and will read past the violence and sex to see the social commentary that lies at the core of Murakami's story.Frank asks Kenji, \"Did that scare you?\" but the question stands for the reader as well. If your answer is yes, then Murakami's mission has been accomplished.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Ryu Murakami has never written about violence, but about the causes of violence - and not direct, ordinary causes, but the underlying psychological tensions in human beings which lead to violence. The psycopath in the novel, Frank, describes violent tendencies in children as the product of anxiety, an attempt to prove that the world will not collapse when some horrible act is perpetrated. 'Anxiety' is certainly a good term to describe the book, or any of Murakami's - every scene vibrates with an eerie strangeness, and human relations take unexpected turns. In the end, the product is somewhat mystifying, but provides a good read and ample food for thought. What it does best is pair images of extreme innocence and extreme violence, produce alternate reactions of sympathy and disgust, and force a reader to suspend all kinds of belief and judgement until the page-turner narrative is over. Still, what it isn't is a thriller, a character study, or a book with any clear message. The character of Frank could be taken to represent many things - the destructive effect of confused intentions on an insular culture, or a human loneliness common to both this American and the Japanese protagonist, or any misfit lashing out against a restrictive society. In any case, it's one of the most fascinating contemporary novels I've discovered.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "\"In the Miso Soup\" is my own first try of \"the other Murakami\", who is also famous for his work. I have to say that \"In the Miso Soup\" was a pleasant, fast paced read and one that had a lot to say.The main characters are Kenji, a nightlife tour guide in Tokyo's seedy sex-spots such as Kabuki-cho, and Frank, a modestly dressed American tourist that sets off Kenji's alarms. Set over a 3 day period, the story follows Kenji's decent into Frank's world of violence.Written in the first person, the book is flooded with Kenji's observations about Japan's culture, society and what he sees as the blatant woes of it all. Kenji is not one to mince words, and deals out a fair amount of criticism on everything from materialism to \"compensated- dating\". The wry observations often have their catalyst in Frank, or his activities. The observations and even Frank's monologues are quite insightful at times, and give one plenty of food for thought. However, Kenji offers no real solutions to the woes he observes.While there is no mystery regarding who the killer is, there is some mystery as to what the ending will be and how Kenji and Frank will resolve things, if they do. This sense of unknown was what kept me hooked to the very end.I thoroughly enjoyed Ryu Murakami's journey into the dark side of life, and I was not easily able to put it down to sleep. For those craving something a little different, this is nice book. And at only a couple of hundred pages, it won't consume so much time. I, for one, will be hunting for more of this Murakami.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "While not usually a fan of the &quot;slash and trash&quot; genre, Murakami's newest gives a reason to explore the subject of the serial killer. Examining both Japanese and American stereotypes and ideosyncracies, the book gives a fascinating portrayal of the &quot;man on the edge&quot;. The book moves quickly and was over way before I was ready for it to end. While not his best work, this was worth waiting for. In many ways I can see this as &quot;American Psycho&quot; done correctly. The violence is a little over the top in some sections, but in a kind of quirky style, so not really offensive. Nice translation, no real issues there.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book will not please everyone. The journey is dark, and gripping, and it explores things that some may not want to admit its existence. However, I do think that if you are able to stomach the description of the happenings, it is a great book, a story that grabs your attention and make you think about today's society. I guess it helped that I don't formulate visuals in my mind when I read. :)",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a good thriller, and though it features an American deranged serial killer and Japanese victims, it avoids typecasting Japanese Good Foreigner Bad by including Kenji's thoughts Japanese society. Prepare to stay up reading, be shocked and frightened.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "It seems like I have been waiting for years, since reading Coin Locker Babies, ATB and Sixty-Nine, for another Ryu Murakami story to read. Now that I have it, I can neither say that I am dissapointed nor wholly satisfied.I guess that \"In the Miso Soup\" is categorized as a \"psycho-thriller\" and other reviews have been negative due to the amount of violence in the book. The story is based in the seedy world of the Tokyo sex trade, so naturally the overall theme is dark and the subject matter for adults. Although there is violence, none of it seemed overly gratuitous to me, and is there mainly to flesh out the characters.The book is relatively short, which is a let-down after the great saga of Coin-Locker Babies that I enjoyed so much. \"Miso Soup\" is a good and solid thriller-type story that although not spectacular, is very enjoyable and full of seemingly factual information (on Japanese club/sex/night life).This book is a must-read for Ryu Murakami fans, since who knows how many years it will be until the next story comes along.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Tight, well-written thriller that takes you into the underworld of the sex industry in Shinjuku, Tokyo through the eyes of a tourist guide who gets involved with a psychopathic visitor. Beware of the extremely graphic climax about 2/3s of the way through, not for the faint-of-heart, but if you can handle it, an excellent read.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the devil of nanking",
        "description": "Obsessed by the past, a young Englishwoman arrives in Tokyo to seek a long-lost piece of film footage dating back to the 1937 Nanking Massacre, journeying from the decadent hostess bars and palatial apartments of yakuza kingpins in Tokyo to deep inside the secret history of the massacre in her pursuit of the truth. Reader's Guide available. 50,000 first printing. $50,000 ad/promo.",
        "authors": "['Mo Hayder']",
        "infoLink": "http://books.google.com/books?id=JCejnQEACAAJ&dq=The+Devil+of+Nanking&hl=&source=gbs_api",
        "categories": "['Fiction']",
        "ratingsCount": 19.0,
        "review": [
            {
                "review/text": "I am stunned by some of the reviews here for this novel. Gripping? Rare art? Masterful? Deeply felt? Did these reviewers read the same book? This is a hackneyed, cliche-ridden piece of fluff and nonsense that is vaguely offensive. I was shocked by the stereotypical Japanese characters - wacky Mama-san, glib entertainer, silent and deadly gang boss - until I realised everyone in the story is a stereotype, regardless of nationality. I try not discuss the plot in reviews, but in this case you will thank me. A woman, Grey, comes to Tokyo and meets a young guy, Jason. Jason gets her a job in his club, a club that coincidentally is frequented by a yakuza boss who coincidentally is the historical enemy of a Chinese academic who coincidentally has the film Grey wants to see. She meets Jason in a park, quite a coincidence in a city of 23 million people. So much coincidence in a \"masterful\" novel... I wasn't scared, aroused, excited, challenged, enlightened or moved once by this novel. I was, however, highly amused on one occasion. Grey, working in a hostess bar in Tokyo, lets us know that she gave a long account of the Japanese atrocities in Nanking to her salarymen customers. When she was finished, they said nothing, but they `rewarded' her with the biggest tip of the night. That little anecdote had me in tears of laughter. Japanese businessmen cowed and humbled by a Brit waitress's account of the war atrocities committed by their grandfathers? And Japanese `tipping'? The very thought of it has me in giggles again....",
                "review/helpfulness": "35/49",
                "num_reviews": 49
            },
            {
                "review/text": "A disturbed, young British woman, known only as Grey, arrives in Tokyo after a long hospitalization in a psychiatric unit. She has been hoping for nine years to find a piece of film recording the Nanking Massacre in China by the Japanese in 1937, a massacre of 300,000 people, which the Japanese deny happened. Needing a very specific bit of information that she believes is in the film, Grey contacts Shi Chongming, an elderly Chinese professor at a Japanese university, whom she believes has the missing film. She eventually agrees to try to unearth information he wants about a life-saving medicine used by an ailing Japanese gangster in exchange for information about the Nanking film.Grey is a fragile and interesting character, bearing both physical and emotional scars, and when she is accepted as a hostess at the \"Some Like it Hot\" nightclub, run by the unforgettable Strawberry Nakatani, who believes herself a Marilyn Monroe look-alike, she meets the ailing gangster, Junzo Fuyuki. Other intriguing peripheral characters add to the drama: Jason, an American with a pre-occupation with death and a sexual fetish for \"weirdos\" like Grey; a pair of Russian twins, who are also hostesses; and Ogawa, the transvestite nurse of the gangster, who lurks in the background and acts as an enforcer. The various settings, especially that of a falling-down house occupied by Grey, Jason, and the Russian twins, showcase the bizarre characters and their actions.The point of view alternates between Grey, as she tries to gain control of her life by finding this mysterious film, and that of Shi Chongming, who recounts in painful detail his memories of the Japanese invasion of Nanking and the attempts that he and his wife Shujing make to to stay alive. The author's ability to present both internal action and external terror is admirable, creating both tension and heart-stopping suspense, though she does resort to obvious foreshadowing to keep the reader going: \"I knew that the answer I wanted was very nearby,\" for example, and \"I was sure, without knowing why, that just behind those blinds....\"The plot and characters are intriguing for the first two-thirds of the book. Then, as the exact nature of Grey's quest on behalf of Shi Chongming becomes clearer, the plot veers into stomach-turning sadism and perversion. Sensational deaths and ankle-deep gore increase as Grey's shocking \"crime,\" Fuyuki's pathology, and Shi Chongming's \"sin\" come together in dramatic fashion. Not for the faint of heart, this pop novel is nightmare-inducing, filled with pathological behavior and grotesque deaths, minutely described. (3.5 stars). Mary Whipple",
                "review/helpfulness": "31/34",
                "num_reviews": 34
            },
            {
                "review/text": "I was recommended this by my brother, who described it as one of the more moving books he'd read last year. I didn't find it to be quite up to the level he put it at, but nevertheless it was a fascinating, and at times heart-stopping, read.The book follows `Grey', a young British girl with too many social anxieties to mention, who travels to Tokyo to confront a Chinese professor (Shi Chongming) who, she believes, possesses a film of the Nanking massacre (where Japanese troops murdered thousands of Chinese civilians when they invaded the city).The books is split between Grey's naration, and Chongming's war-era `journal' (which is written in such detail, one wonders where he found the time when he was weak from hunger and escaping with his wife from Nanking). The writing is suspenseful, but laboured in parts - Hayder tells a captivating story, and the twists are certainly suspenseful, but don't expect it to scale literary heights.Would I recommend this? Oh yes - if you like chillers and thrillers, this will be right up your alley; and you may, like my brother, be touched by it. Just don't expect a classic.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "\"The Devil of Nanking\", published as \"Toyko\" in some countries, is not your typical novel. For a start, the heroine is flawed with some mental and physical scars. Grey, the heroine, is obsessed with finding a film on which horrific footage of the Nanking massacres exist. As we find out during the course of the book, for Grey this is a particularly personal quest.During her efforts to find and view the film, we are taken through 1990 Tokyo, with a well written cast. Jason the weird guy, the Russian girls, the Chinese professor who witnessed the crimes perpetrated in Nanking, and a mysterious Japanese gangster and his \"Nurse\", although only a couple of these are sketched out in great detail. The author isn't afraid to leave certain elements and characters of the story relatively vague, which makes for a more mysterious and dark feel to the story.\"The Devil of Nanking\" is very well written, the author brings to life both the bright lights of 1990 Tokyo (her own experiences of night clubs in Tokyo no doubt proved useful material to draw upon in the writing of this novel) as well as the desperate dark period of December 1937 in Nanking. At the conclusion of the book, despite the revelation of what is revealed on the film (which I actually thought was fairly well signposted) Grey seeks and ultimately finds, you are left in an almost contemplative mood. I haven't read many books that have left me like that.I don't normally read fiction, but I have developed a fascination with East Asia, having lived in Korea and visited both Japan and China, which attracted me to the book. I was not disappointed. The Devil of Nanking is defintely worth a read. Highly recommended, especially if you like more unusual novels and settings.Postscript: If you are after some historical background information to the Nanking massacre, I recommend \"The Rape of Nanking\" by Iris Chang for a well written but controversial account (judging from the number of reviews for the book on Amazon) of the horrors that occurred in Nanking December 1937.",
                "review/helpfulness": "20/25",
                "num_reviews": 25
            },
            {
                "review/text": "A disturbed, young British woman, known only as Grey, arrives in Tokyo after a long hospitalization in a psychiatric unit. She has been hoping for nine years to find a piece of film recording the Nanking Massacre in China by the Japanese in 1937, a massacre of 300,000 people, which the Japanese deny happened. Needing a very specific bit of information that she believes is in the film, Grey contacts Shi Chongming, an elderly Chinese professor at a Japanese university, whom she believes has the missing film. She eventually agrees to try to unearth information he wants about a life-saving medicine used by an ailing Japanese gangster in exchange for information about the Nanking film.Grey is a fragile and interesting character, bearing both physical and emotional scars, and when she is accepted as a hostess at the \"Some Like it Hot\" nightclub, run by the unforgettable Strawberry Nakatani, who believes herself a Marilyn Monroe look-alike, she meets the ailing gangster, Junzo Fuyuki. Other intriguing peripheral characters add to the drama: Jason, an American with a pre-occupation with death and a sexual fetish for \"weirdos\" like Grey; a pair of Russian twins, who are also hostesses; and Ogawa, the transvestite nurse of the gangster, who lurks in the background and acts as an enforcer. The various settings, especially that of a falling-down house occupied by Grey, Jason, and the Russian twins, showcase the bizarre characters and their actions.The point of view alternates between Grey, as she tries to gain control of her life by finding this mysterious film, and that of Shi Chongming, who recounts in painful detail his memories of the Japanese invasion of Nanking and the attempts that he and his wife Shujing make to to stay alive. The author's ability to present both internal action and external terror is admirable, creating both tension and heart-stopping suspense, though she does resort to obvious foreshadowing to keep the reader going: \"I knew that the answer I wanted was very nearby,\" for example, and \"I was sure, without knowing why, that just behind those blinds....\"The plot and characters are intriguing for the first two-thirds of the book. Then, as the exact nature of Grey's quest on behalf of Shi Chongming becomes clearer, the plot veers into stomach-turning sadism and perversion. Sensational deaths and ankle-deep gore increase as Grey's shocking \"crime,\" Fuyuki's pathology, and Shi Chongming's \"sin\" come together in dramatic fashion. Not for the faint of heart, this pop novel is nightmare-inducing, filled with pathological behavior and grotesque deaths, minutely described. (3.5 stars). Mary Whipple",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "What can you say about a writer whose central image for her novel seems to be . . . (I'm sorry but I think it's fair to warn you, and you'll get it anyway in the first few pages) EVISCERATION AND DISEMBOWELMENT? If you don't like graphic depictions of viciously administered death, just stop now and don't put yourself through the ugliness. The two stories of Nanking in 1937 and Tokyo in 1990 are cleverly intertwined. The young woman, Grey, obsessed with proving that her own desperate act has had a true historical antecedent, is a well-imagined character. And yes, there is a moral difference between doing something destructive in a state of ignorance, and doing other destructive and cruel things for pleasure. But any fool can tell the difference between the two main characters, with their lyric sorrow and their obsessed mission to rescue the dead, and the depraved ghouls they fall among. The suspense in the novel depends almost entirely on prurient interest in horrible acts. And horrible as the atrocities are, the idea that we have never heard of such goings on is, alas, pitifully absurd. There's something a little meretricious at the bottom of this barrel of scary times.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "Mo Hayder is one of the finest contemporary writers. Her books take you squirming and screaming to places you have never been. With a literary style, her damaged, but persevering, characters explore the depths of evil. The Devil of Nanking is an excellent novel. If it's possible, the book is even more gruesome than The Birdman and The Treatment. But this is an author who tackles the most difficult subjects. The Devil of Nanking is a fast-paced thriller into the exotic lands of Tokyo in the 1990s and Nanking during World War II.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "The author did an excellent job writing a book that combines an excellent history of WWII China, the Rape of Nanking, and a look at modern Tokyo Nightlife. I was surprised that the writer was able to pull off combining all of these things, but she did and did it well. The book was hard to put down. I highly recommend it.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "My jatlagged mind must have led me to include this book, under the blander latter title of \"Tokyo\", among my purchases at Narita upon departure after a whirlwind 1-week professional tour of Japan. Little did I know what a gem I would discover on a sleepless journey back to Atlanta! Impossible to put down, \"Devil of Nanking\" exposed me to Mo Hayder, an author of impossibly tormented powers of description and plot-building. After \"Devil\", I moved quickly to her only other two books available, \"Birdman\" and \"The Treatment\". How I suffered until I got my hands on \"Pig Island\" this year! I am currently savoring the novel as if it were the finest foi gras, to be rolled over and swallowed one morsel at a time... not for the faint of heart tho'; I am 47 and have had to sleep with the lights on!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Mo Hayder does not have much in the way of formal schooling, but she has become an accomplished storyteller with a better-than-average writing skill. This novel is comprised of two stories intertwined to make a shocking whole. First and foremost, Hayder provides a realistic and accurate picture of what the IJA's (Imperial Japanese Army) destruction of Nanking, China must have been like.Then the second story: Gray is a young woman who grew up only reading books--her parents did not have a television, nor were there other young people around while Gray was a child. She was reared on books; and somehow, a rare and terrifying account of Japan's genocide in Nanking comes under her intelligent adolescent scrutiny.She becomes obsessed with viewing a film that shows torture and murder perpetuated by a perverse monster in the IJA--the Devil of Nanking. She finds help in Tokyo from the elderly man who brought the film back from China back in late 1937. Eventually, we as readers get the portrayal of Nanking's destruction through snippets from the elderly man's journal as well as by information Gray gleans while privately investigating as a \"hostess\" in a Tokyo nightclub.This was well worth reading. I miss Jack Cafferty, the detective who stars in her first two novels (Birdman and Treatment) but Mo Hayder is not an author to be ignored. Her works are shocking and unique, and they deserve attention from anyone with the courage to stomach their contents.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "lost names scenes from a korean boyhood",
        "description": "In this classic tale, Richard E. Kim paints seven vivid scenes from a boyhood and early adolescence in Korea at the height of the Japanese occupation, 1932 to 1945. Taking its title from the grim fact that the occupiers forced the Koreans to renounce their own names and adopt Japanese names instead, the book follows one Korean family through the Japanese occupation to the surrender of the Japanese empire. Lost Names is at once a loving memory of family and a vivid portrayal of life in a time of anguish.",
        "authors": "['Richard E. Kim']",
        "infoLink": "https://play.google.com/store/books/details?id=EvnCAgAAQBAJ&source=gbs_api",
        "categories": "['Literary Criticism']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "As an avid student of Asian history and culture, I've read many accounts of the Japanese occupation of Korea. This is the best so far.As I have lived in Korea for 10+ years, I have Korean friends in the same age group as the author, Richard Kim. From the first-hand accounts I have heard from my friends, I believe Lost Names accurately describes conditions for the common Korean citizen during the Occupation period.Through the entire book, I believed I was reading the author's autobiography. I didn't realize that was not the case until I read the Author's Note on the last page. I kept wondering why, since these were his memoirs, the author didn't write in the past tense.For me personally, the book would have been easier to read if it had been written in the past tense. In any case, I highly recommend this book for those who love to learn about the tragic history of the beautiful Land of the Morning Calm.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "This was probably my favorite of the books we read in the Japanese History course I took my senior year of college. Young Richard Kim spent the majority of his childhood in his native Korea while it was under occupation by the Japanese, who were not very nice to or tolerant of his people, no matter they were the majority and the occupying Japanese were the minority. There are many hardships and much prejudice he faces growing up, from neighbors, the government, teachers, and schoolmates, but he never loses his sense of pride and Korean nationalism, constantly being reminded by his parents (who are ministers) and his grandmother to remain aware of where he comes from, his identity, the sustained hope that the Japanese won't always be in Korea, and to do well in school and set a fine example to the Japanese, since he mustn't let those Japanese boys at school think they're better than he is. When WWII comes along, everyone suffers the normal wartime deprivations, such as food shortages and bombing raids, but it is especially hard for the Koreans in the midst. Young Richard is forced, along with his classmates, to bow in the direction of the Emperor each morning, recite an ode of allegiance to the Emperor and Japanese government, and, worst of all, to even change his family name. All Koreans are forced to change their surnames to Japanese surnames, although Richard's father is clever and changes their family's name to one with the root meaning \"rock,\" which of course is a reference to Saint Peter and the family's religious faith, a reference the Japanese won't get. It's enough to take away and try to usurp one's culture, traditions, customs, language, and way of life, but when you take away someone's name, that is in a way the ultimate erasure of their identity. Even when forced to, at least on the surface, speak a foreign language, submit to foreign leaders, and follow alien customs, there's still the comfort of knowing your base identity, your name, is still the same, but taking it away makes this prejudice and attempted usurpation of Korean culture incredibly personal and insulting.It didn't really bother me that some of these memories and thoughts are very complex and detailed for a child as young as Richard is in the beginning. Many times memories of traumatic defining events are stronger and more vivid and real precisely because they were so awful and traumatic, leaving more impact than something as mundane as, say, eating breakfast or walking the dog. And even if some gaps in Richard's memory may have been filled in by what he imagines happened or what his family have told him happened, it doesn't lessen the emotional impact of these events in the slightest. And I like how it was told in the present tense; since discovering quite some time ago that books can be written in the present tense and there's no rule written in stone saying you must only and always write in the past tense, I've much preferred books written in the present tense. It makes the events seem more real and gripping, full of suspense and tension, like constantly wondering what's going to happen next, living right in the moment.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I collect books about Korea, and have read many novels, poems and non-fiction works. But Lost Names is certainly one of the best. Small details and major characters both help to build an accurate, emotional depiction of Koreans and the struggle to live during the brutal Japanese occupation of World War II.I read this book in one sitting, mailed it to one of my sisters, and have bought a copy for another sister. Some passages are humorous, and others are painfully sad...but the author infuses the entire work with hope and forgiveness. The main character's father is a memorable study of dignity, wisdom and strength.My 13 year old son has read this book four times! It is slightly mature for a young reader, but if you or your child have any interest in Asian history, Korea or warm stories of childhood, you'll love it. A must-read for any Korean-Americans wanting to understand the deprivation, tenacity and social conditions forced upon their parents or grandparents, who survived the harsh conditions of life in Korea during WWII.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "How could such a young child have such complex thoughts? That's what I was thinking the whole time I was reading it. If author was going to incorporate historical information, maybe he should not have used the first-person narrative.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "A beautifully written book that places you in Korea during the second world war. Fast reading, and well paced told from the POV of a very (maybe too!) wise young boy. Only thing that got me down was knowing that it ended just before the next war again wreaked such damage and havoc, and there was no post script. Definitely worth reading.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "liquid life abortion and buddhism in japan",
        "description": "Why would a country strongly influenced by Buddhism's reverence for life allow legalized, widely used abortion? Equally puzzling to many Westerners is the Japanese practice of mizuko rites, in which the parents of aborted fetuses pray for the well-being of these rejected \"lives.\" In this provocative investigation, William LaFleur examines abortion as a window on the culture and ethics of Japan. At the same time he contributes to the Western debate on abortion, exploring how the Japanese resolve their conflicting emotions privately and avoid the pro-life/pro-choice politics that sharply divide Americans on the issue.",
        "authors": "['William R. LaFleur']",
        "infoLink": "https://play.google.com/store/books/details?id=nkT_DwAAQBAJ&source=gbs_api",
        "categories": "['Religion']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I can heartily recommend this book. I once took a course taught by LaFleur which was one of the best courses on understanding Japanese Buddhism and the practice of abortion. This book matches his good lecturing style.What is interesting is that in the West abortion is viewed in primarily negative terms, as is infanticide. LaFleur's initial attitude was: How can Japanese engage in this kind of activity on such a large scale? What role does belief in reincarnation (according to Buddhism) play?Rather than bringing in Western moral preconceptions that might prejudge his discussion, LaFleur treats this sensitive topic with great insight and sensitivity. This book will be a very interesting read for those interested in Japanese society and Buddhism.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "William R. LaFleur gives us a book which is well made. Piece by piece Mr. LaFleur goes over the history of abortion, buddhism, family planning, sexuality attitudes and even woman's lib in Japan. By the time he reaches his conclusion, you can't help but feel like you, yourself, have also researched and processed all the information.Near the end, when he compares the Japanese ideas to American ideas on the issue, you can't help but feel that maybe it was all a well placed trap, to get you to look at the whole mess from a different point of view, not just the pro-life/pro-choice, good/bad, yes/no, on/off American way (where every issue only has two sides and the winner gets total victory, so no mercy!)You might not like some of the points made, but it will sure force you to think.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is, of course, a book about Japan and Japanese attitudestoward birth, death and the fragility of life. Because it isalso a book about abortion, it also touches on an issue thatis incredibly hot in America even as abortion has becomean uncontroversial fact of life in most of the rest of theworld.So it is a tribute to the author's scholarship as well as tothe scope of his world view that he stays true to the businessof explaining a Japanese Buddhist take on the world withoutovertly indulging in taking sides in the American controversy.It' a tribute to his depth of understanding that in spite ofthis lack of partisanship, this splendid book has something toteach us all and some light to shed on the American debate.It would oversimplify LaFleur's arguement to sum it up, but onethread is something like this. The Japanese view of a newbornis that it is a potential life. This view is even more emphaticin the case of an unborn-a foetus. People become people inthis view by a gradual process of socialization.Rather than being heartless, this way of looking at things hasa great deal to recommend it-especially in days when infantmortality was high. Parents who lost a new-born or an unbornchild could pray for the return of that child in a subsequentpregnancy. The ritual system, which provided no funeral forone who died so young, affirmed the tentative nature of thedead one's membership in the human community.If it takes socialization to make a human and a family to makesocialization, then it is also up to the community and thefamily to decide if that's going to happen at all. In thisview, life in infancy is a liquid that hardens into indiv-iduality with time.So infant death and miscarriage are sad, but not final. Theunborn child gets to come around again, maybe with better karma.This, of course, removes abortion from the realm of murder/choice. It also forces all of us to see our various positonsin the American debate as products of our social and religiousassumptions just as the Japanese view is the product of theirs.Again, this is not a book about the American abortion wars.It is instead, a splendid book about Japanese religious beliefsacross a swath of history and how they affect attitudes. Bystaying true to his topic, LaFleur teaches us a great deal.--Lynn Hoffman, author of THE NEW SHORT COURSE IN WINE andthe forthcoming novel bang BANG from Kunati Books.ISBN9781601640005",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "ruins of identity ethnogenesis in the japanese islands",
        "description": "Many Japanese people consider themselves to be part of an essentially unchanging and isolated ethnic unit in which the biological, linguistic, and cultural aspects of Japanese identity overlap almost completely with each other. In its examination of the processes of ethnogenesis (the formation of ethnic groups) in the Japanese Islands, Ruins of Identity offers an approach to ethnicity that differs fundamentally from that found in most Japanese scholarship and popular discourse. Following an extensive discussion of previous theories on the formation of Japanese language, race, and culture and the nationalistic ideologies that have affected research in these topics, Mark Hudson presents a model of a core Japanese population based on the dual origin hypothesis currently favored by physical anthropologists. According to this model, the Jomon population, which was present in Japan by at least the end of the Pleistocene, was followed by agriculturalists from the Korean peninsula during the Yayoi period (ca. 400 BC to AD 300). Hudson analyzes further evidence of migrations and agricultural colonization in an impressive summary of recent cranial, dental, and genetic studies and in a careful examination of the linguistic and archaeological records. The final sections of the book explore the cultural construction of Japanese ethnicity. Cultural aspects of ethnicity do not emerge pristine and fully formed but are the result of cumulative negotiation. Ethnic identity is continually recreated through interaction within and without the society concerned. Such a view necessitates an approach to culture change that takes into account complex interactions with a larger system. Accordingly, Hudson considers post-Yayoi ethnogenesis in Japan within the East Asian world system, examining the role of interaction between core and periphery in the formation of new ethnic identities, such as the Ainu. He argues that the defining elements of the Ainu period and culture (ca. AD 1200) can be linked directly to a dramatic expansion in Japanese trade goods flowing north as Hokkaido became increasingly exploited by core regions to the south. Highly original and at times controversial, Ruins of Identity will be essential reading for students and scholars in Japanese studies and will be of interest to anthropologists and historians working on ethnicity in other parts of the world. Text adopted at University ofChicago",
        "authors": "['Mark James Hudson']",
        "infoLink": "https://play.google.com/store/books/details?id=tZ0BEAAAQBAJ&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This book is excellent for those who want a survey of Japanese archaeological literature for the Jomon and Yayoi periods. The author reviews the development of archaeological theories in Japan, as well as among the few Western scholars specializing in Japanese prehistory. If you don't know much about Japanese archaeology, and especially if you don't read Japanese and can't go to the primary sources, this book is a great place to start.Although the title sounds postmodern, in fact this book is cultural-historical in its emphasis. The author advocates a multidisciplinary approach to the question of Japanese ethnogenesis and supports his opinions with an extensive bibliography.Particularly interesting to me is the way that (according to the author) Japanese archaeological theory has mirrored the nation's recent political history. Too bad archaeologists so often fail to be reflexive about the history of theory in their OWN countries.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Fans of Japanese archaeology and pre-history may like this book. The book covers the conflicting academic accounts of the early migrations of Yayoi and Jomon peoples in pre-historic Japan. If you are very well-versed in these subjects you may well find much to interest you. There is a great deal of commentary of the different academic interpretations of how the Japanese people have come about from different populations that may have entered Japan from the Korea, China, and from the islands to the south.Having said that, I got completely bogged down in the middle of the book, which gets mired in excessive details and charts referring to various stone implements unearthed and their relation to Yayoi and Jomon culture. Unless you are extremely interested in these things, you can comfortably skip to the final part of the book which actually contains some of the authors own conclusions once he has surveyed dozens of other academics' theories.This book is certainly to be recommended to the academic but should be avoided by the casual reader interested in Japan. I have yet to finish the book 6 months after purchasing it.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "japanese tattooing now memory and transition classic horimono to the new one point style",
        "description": "Over 530 color photos display the vast range of Japanese tattoos, from traditional full-body forms to modern One-Point style. The text provides a glimpse of Japan's youth culture and recounts stories of Japanese masters of the tattoo art, including Senseis Horihide, Horiyoshi III, Horitoshi I, Horiyasu, Horikoi, and Horiuno. Readers will see some of the most intricate tattoo art in the world.",
        "authors": "['Michael McCabe']",
        "infoLink": "http://books.google.com/books?id=2BJNAAAACAAJ&dq=Japanese+Tattooing+Now:+Memory+and+Transition:+Classic+Horimono+to+the+New+One+Point+Style&hl=&source=gbs_api",
        "categories": "['Art']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Michael McCabe is by far one of the finest cultural anthropologists our generation has seen. His experience as a professional tattooist and his ability to tell a wonderful story make his books both relevant and enjoyably readable---which is not always the case with the THOUSANDS of published books that are supposedly about the tattoo culture.I buy EVERYTHING and ANYTHING with his name on it, and I've never been disappointed.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a terrific book full of great Japanese tattoos. There are tons and tons of photos and cool ideas. If you are thinking about getting a tattoo and like classic images, this is well worth it.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "If your looking at getting a Japanese style tattoo but want to do research on the culture first this book is a must have! I bought several Asian history/tattoo books to learn the history first and this was one of the most helpful book! It goes from the tradtional japanese tattoos to the new Western style Japanese tattoos",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Beautiful tattoos in both eastern and western styles, done by Japanese artists. If Mike puts his name on a book, you can pretty much trust that its going to be a winner.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "What a show stopper: when I brought it in as a guide, nearly everyone at the tattoo shop had to come around to see this book. All of the tattooists were impressed by it.I'll start with the cover; by far the most deceiving part of the book. In no way does it convey the feeling of the book, nor does it even match the design of the inside images and contents. It almost looks like it was taken from another book (or it is the author's girlfriend.) Either way, once you open the book and view some of the amazing images inside the book, you will agree that the cover is cheesy and needs to go.The images are a little inconsistent, but then again, they kind of have to be due to the nature of the book. It looks like there were numerous photographers, and many sources from which they got these pictures. I think some of them look like a camera phone took it (for example, pages 36, 38, 58, and cover.)The back story of the artists is worth the read. Some are hilarious while others are a bit enlightening, especially about Hardy and Jerry and others that are the pioneers of our era. I had no idea purple ink was such an exotic luxury.Anyway, get this book; you will not be disappointed.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Great book. I was surprised by the depth of the content. It turned out to be more than just a picture book of Japanese tattoos, which was really all I'd expected. It's full of terrific photos, but also provides a lot of information on the tattoo artists and the tattooing sub-culture in modern Japan. Anyone into tattooing, Asian art, or Japanese culture would love this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "japanese cabinetry the art craft of tansu",
        "description": "the first truly definitive volume on tansu, this book provides a broad representation of cabinetry designs along with contextual history, gleaning insights from the cabinetry itself. The book chronicles not only the physical characteristics and details of tansu, but also the historical eras and societal factors that influenced the craft.",
        "authors": "['David Jackson', 'Dane Owen']",
        "infoLink": "http://books.google.nl/books?id=XTDUs5K2_kYC&dq=Japanese+Cabinetry:+The+Art&hl=&source=gbs_api",
        "categories": "['Design']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "I have fortunately been able to read an advance copy of this book . The book is well researched with more relevant detail on wooden Japanese Furniture than all previous publications combined. I was able to identify and date several pieces in my collection , as well as find out that I had been misled by some Japanese dealers with regard to age and origin . Now it is much easier to identify Tansu in it's historical context . Who would have guessed that Politics played an important part in Tansu usage and design , or that streets became clogged with Tansu during emergencies , causing many more deaths and the rewriting of local laws . This book tells it all.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I am biased; I am a woodworker. This is actually a terrific book offering a huge collection of beautiful photos, and an extensive commentary about the role of Tansu in Japanese lifestyle and culture. However the craft of making Tansu was not well represented. From the title I would have expected more on tools, techniques and joinery.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "If you are fascinated by the creation of handmade Japanese cabinetry, this is one of the few books you can find on the subject because for some reason, the cabinetry of Japan is one of the least recorded aspects of Japan's woodworking history. Throughout this guide, you will find lush photographs of opaque and transparent lacquered chests, their hand-forged iron handles and the tools of the trade. I especially enjoyed the hand-colored photos of family life, rice fields and the textile sellers. Not only do you get to glimpse this magical world of Zen temples and street merchants selling sweet rice drinks, you will be able to view page after page of stunning merchant chests, bedding chests, clothing chests and mizuya-dansu (kitchen cupboards).I've always been intrigued by chests filled with magical little drawers in which anything could be stored. This book has made me aware of the wide variety of chests that can be purchased and most of the pages are filled with pictures and descriptions so you can know what to look for online. Before finding this particular book, I was at a loss for what to look for. Now I have the names of items like the sea chest (funa-dansu) and realize the difference in the woods used. I think the cho-dansu made of keyaki with the distinctive iron fittings on page 111 is just stunning. The cho-bako funa-dansu (ship chest) is also very interesting as it features tortoise, a symbol of prosperity and longevity.The detailed descriptions of the lockplates are presented with photographs. If you are a student of this craft (or looking for pictures of things like a cherry blossom motif), the pages on the components of a tansu will encourage you to explore all the essential details in your own selections. They also explain how all the L braces and iron-edge strapping are not only decorative, but highly functional.As a person who has refinished a desk upon which I am typing, my appreciation for furniture went through an entire renewal process while reading \"Japanese Cabinetry.\"Contents:The Realm of Tansu: An IntroductionTansu and Allied TradesThe Craft of TansuTansu for Mercantile UseTansu for Household UseTansu for Personal UseLiving with TansuCollecting and Restoring TansuNot only does this book present early mercantile tansu designs, there are pictures of contemporary desks and even a section about books, magazines and catalogues for further research. The index, glossary of terms and chronological list of exhibitions make this book very easy to read and understand. There are also ideas for how to set up your tansu collection in your bedrooms, bathrooms, living rooms and kitchen. You might even want to put a kitchen chest (mizuya) in your living room. This book also features entry tables, entertainment centers, coffee tables and bookcases and so much more.Back to dreaming of owning the cho-dansu from the late Edo period (1615-1868). Not only can you view items from this period, you can read about the history and lifestyle of the people living in this era. This book would make a perfect gift for anyone who has lived in Japan or is interested in Japanese history. It would also be an amazing gift for anyone interested in Japanese movies. I have often wondered about various items and this book has provided more information than I could have ever dreamed about finding.A note about the authors: David Jackson has been collecting tansu since 1990 and has studied sculpture and woodworking. He developed his passion for Japanese woodwork and then was involved with one of the first exhibitions of tansu in the United States. Dane Owen founded a gallery of Japanese antique furnishings and is also a frequent visitor to Japan. He can be found searching for objects for his customers and his own private collections. Together they have written the ultimate book on the Japanese craft of tansu. If you love tansu, your heart is going to beat a little faster while reading Japanese Cabinetry. I am beyond appreciative of David and Dane's knowledge of this subject. If you own one book on tansu, this would be an excellent choice.~The Rebecca Review",
                "review/helpfulness": "12/16",
                "num_reviews": 16
            },
            {
                "review/text": "Not even sure where to begin other than to say that as mentioned above, the cover alone should be plenty to strike your interest. As a true lover and collector of Japanese art, this book goes above and beyond to show just exactly why it could be labeled as a &quot;coffee table book&quot;. It has been on mine for weeks now. It is such a great sourcebook for Japanese cabinetry/tansu and goes even further to show pieces actually used for daily use in people's homes. The size of the book and the photography are SO worth the price. It truly is a fabulous book. I strongly recommend it. Whether you are an obsessed collector of Japanese art or not, it is definitely a great book to have in your collection.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "tokyo underworld the fast times and hard life of an american gangster in japan",
        "description": "In 1945, as part of the Occupation forces sent to postwar Japan Nick Zappetti, a native of Italian East Harlem, entered a world as strange as any he had ever know, In postwar Tokyo, however, he realised there were certain opportunities. He had a failed stint as a professional wrestler, and participated in a fumbled (but famous) diamond heist. He was deported but managed to return with the assistance of the Mafia. Then Nick opened a pizza joint in what would be the centre of Tokyo's nightlife and became \"the king of Roppongi and Mafia boss of Tokyo,\" and the intimate of some of Japan's most notorious underworld figures as well as many of its political and business leaders. Following Zappetti's rising and falling fortunes, and his love-hate relationship with his adopted country, Robert Whiting show us the sinister (and sometimes ridiculous) goings-on among Tokyo's traditional criminal gangs as they developed from local racketeers and gamblers into lynchpins of international finance, politics and corruption. Here is a fresh perspective on postwar Japan and how it went from being a defeated nation to an economic player, with a little help from some less than diplomatic friends.",
        "authors": "['Robert Whiting']",
        "infoLink": "https://play.google.com/store/books/details?id=11qeBAAAQBAJ&source=gbs_api",
        "categories": "['True Crime']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Nick Zappetti sounds like a proper name for a Mafia boss. What is unusual about this particular capo is his territory-the Roppongi district of Tokyo-as well as the time of his ascendancy-the fall of 1945, in occupied Japan. Tokyo Underworld is a half-century survey of the dark side of the Japanese economic miracle, the criminal empire born of the corruption which riddled the Marshall Plan. Part postwar history and part gangster movie, Tokyo Underworld is unfurled by its author with a melodramatic flourish:It is an alternate, separate layer of reality, a shadowy universe of characters-gangsters, corrupt entrepreneurs, courtesans, seedy sports promoters, streetwise opportunists, intelligence agents, political fixers, and financial manipulators-who have perhaps done as much in their own right to influence U.S.-Japan affairs as their more refined and respected peers. Significantly, it has not always been easy to distinguish the latter from the former.Drawing on police and press reports as well as personal interviews (Zappetti himself was interviewed extensively for this book between 1989 and his death in 1992 at age seventy-one), Robert Whiting, one of the few western journalists to live and write regularly in Japan, depicts an awesome cancer of corruption metastasizing behind the rigid veneer of Japanese society. From the smoldering ashes of postwar Japan (where things were so bad the Japanese had to fight for scraps with the Korean slaves they'd imported during the war), to the CIA's backing of yakuza gangs in the `50s and `60s as anti-Communist thugs, to the ruinous scandals of the `90s, where prominent Japanese executives and politicians were implicated in vast criminal rackets as the economy plunged into a tailspin, crooked and straight men mingled freely across previously impermeable caste lines in an ever-expanding criminal sphere which Whiting calls \"Japan's first experiment in democracy\". And where was Nicola Zappetti during these halcyon days? Hailing from Prohibition-era East Harlem, Zappetti had chosen crime as a career during adolescence, skipping school to learn instead from thugs and racketeers like his cousin Gaetano \"Three Finger Brown\" Luchese. Whiting contends that Zappetti actually joined the Marines to give his budding criminal instincts room to expand, and delighted in the hell of postwar Tokyo, where he quickly made a stake running contraband whiskey, cigarettes, and military scrip to-who else?-Allied soldiers and small-time Japanese gangsters, the only people in Japan with money or goods to trade. Zappetti shrewdly played the gangs off one another, recognizing their tribal hatreds and the burgeoning Japanese market for narcotics. He did so on his own initiative, using his own brains and brawn, not relying on the American Mafia (except to get back to Japan after being deported by the authorities in 1950). Zappetti also made a smart long-term investment early on, introducing the Japanese to pizza in the up-and-coming honky-tonk district of Roppongi. He made some erroneous investments as well, including a fur factory, several Japanese wives, and Japanese citizenship, for which he sacrificed his U.S. passport, thereby stranding himself in Japan. Crime and politics make for interesting bedfellows, and Zappetti's circle read like a Who's Who of both worlds. There was the famous Rikidozan, a psychotic sumo wrestler who met his end on the point of a yakuza thug's knife in a men's room. There was \"Killer\" Ikeda, a notoriously violent thug with whom Zappetti once went knife-to-gun, and won. There was Hiyasuki Machii, head of the Tosei-kai, Tokyo's most powerful Korean gang, which controlled the clubs and rackets of the booming Ginza strip (Machii also worked for the G-2 intelligence unit of the occupying American force, as a strikebreaker and anti-Communist thug). There was Yoshio Kodama, right-wing political fixer and yakuza money man (also a onetime G-2 operative, rooting out Communist groups in Japan). Much of the mingling between these men took place in Zappetti's Roppongi restaurant, Nicola's, or at the New Latin Quarter, a nightclub straight out of a James Bond movie: \"It was a favorite hangout of the international intelligence community, agents from the KGB, CIA and MI6 often vying with each other for the same hostess.\" Zappetti died alone and penniless, unable to return home, broken by alcohol and diabetes, the victim of a new order of corporate criminals who used Japan's laws against him and his empire (known as keizai yakuza). Zappetti, who had survived knives, guns, and bombs, was mortally wounded by the sort of white-collar criminals who would carry the lessons of the street all the way up to the highest levels of the Japanese government, using corporate cutouts, money laundering, bogus investments, and the like. Zappetti had come up as the Mustache Petes in the American Mafia were going out; by the time of his death in 1992, Zappetti himself was the dinosaur. An exchange between Zappetti and one such new-wave crook showed the writing on the wall:\"What the hell is the point of being a yakuza,\" he asked one well-tailored mobster, \"if you act like everyone else? You guys use electronic calculators instead of swords. You talk about derivatives. Your name cards say corporate vice president instead of captain or elder brother. You're trying too hard to be respectable.\" The mobster gave Nick a strange look and said, \"What about you?\" Then he asked for the wine list.Whiting's book often veers away from Zappetti himself, panning out to focus on the big picture of Japanese crime during a given period. A far more concise summary of Zappetti's life and exploits appears in the book's acknowledgments, along with a thorough source list and bibliography. But the story tells itself, and it is a disturbing, thrilling account of U.S.-Japan relations and Japan after the Second World War.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "5 stars to Japan-journalist Robert Whiting (of \"You Gotta Have Wa\" fame). The title of the book says it all - a documented account of the life and times of an American gangster, Nick Zappetti, in Roppongi, Tokyo from the Occupation in 1945 to Zappetti's death in 1992. This is not fiction, nor is it a straight history book. It is more like a biography, but focusses almost exclusively on Zappetti's life in Japan, with asides on the political and criminal background, including the Lockheed scandal. This is serious journalism, written with panache and wit. Whiting has done an excellent and difficult job, which only someone fluent in Japanese could do (the footnotes and references are just as fascinating as the main story). And what a story! Despite the violence and scams, and Zappetti's final embittered years, Whiting had me laughing out loud in several places. An ageing, impotent Zappetti, embroiled in endless lawsuits, is losing money on his flagship restaurant while the ones he was forced to hand over to his wife are making money hand over fist. His shrewd wife offers her free advice - \"change the decor, adapt to Japanese tastes, turn up the lighting\" - which Zappetti consistently ignores. Finally, at his wits' end, he does as she suggests and invests his last millions in a complete overhaul. The new shiny restaurant opens - just as Japan's bubble economy bursts!This book will appeal particularly to people who live or have lived in Japan, but also to anyone who enjoys a lurid and seedy tale!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "First off, I believe that this book is definitely worth the price of admission as it is an engaging encounter with a part of urban Japanese society that one rarely has the opportunity to become acquainted with. Having said that, the book suffers from some structural problems that leave the reader a little bit at loose ends by the time he reaches the end. This book, although ostensibly about the 'Tokyo Underworld' is actually composed of three distinct threads of discourse. Thread one is a semi-biographical tale of an extraordinary character from blue-collar New York City who, as a result of a post-world war II stint in the Army lands in and adopts Japan as his home and destiny for the rest of his life. The book is semi-biographical because the biography seems to be a fusion of a free association telling of a life's story to the author by this character, and the author's own haphazardly researched, yet thoroughly entertaining description of the characters and events that crop up in the course of this story. The second thread is an off-the-cuff social history of an area of Tokyo that went from urban blight to some of the most renowned and expensive real estate in the world, and is now somewhat equivalent to NYC's 'Great White Way,' or at least what an outsider imagines the GWW should be. The third thread is an anecdotal description of the notorious Tokyo Yakuza and its alleged massive influence and sway over Japanese society from dark alleyways all the way up to the halls of power.If this sounds like an awful lot of material to fit into one teeny tiny book, it is, and because it is the author has to make some compromises. The compromises come in the form of cursory treatments of all three subjects, but done in such a glib and insousciant manner that the reader forgives the author his dilatory story line in return for the verbal ride. This really is not a book about the 'Tokyo Underworld' so much as it is a fun topical read about a colorful 'GaiJin' of questionable character who, against all odds, becomes a notorious and successful figure during a particular era in a discrete section of Tokyo's entertainment district.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "As you are reading this book, you will get the feeling that it can't be real, that it's all a fantastic work of fiction. However author Robert Whiting has provided an extensive list of notes and references in the back of the book to support his work. And the information that his book contains is frightening, and perhaps to those who are new to Japan, surprising.Corruption in Japan runs deep, and this book dives all the way to the bottom. Whiting has done a remarkable amount of research and has had amazing access to those people who really run Tokyo and by extension Japan, namely organized crime. Using a relocated New York Mafioso as his catalyst, Whiting exposes how deeply ingrained the Yakuza are, with influence extending as high as the Prime Minister's office and as far afield as the US and Indonesia.Nicola Zapetti knew and worked with some of Japan's most powerful Yakuza, and in Japan, many argue that the Yakuza are the most powerful group of all. Yoshio Kodama, a pardoned Class-A war criminal, ultra-right wing politician and well-known Yakuza once referred to himself as &quot;the worlds richest fascist.&quot; LDP kingmaker Shin Kanemaru was found with millions of dollars in cash, bearer bonds and gold boullion in his house, much of it bribes from the Yakuza.New Prime Minister Koizumi has been labelled a &quot;reformer&quot; by the media in the West. Those who have read Whiting's book know enough to doubt both his sincerity and his chances of legitimate success at changing this system which is corrupt at its very core.If you want to understand the Japan that they don't teach you about in Polical Science and Business classes, you need this book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This entertaining book delves into the seldom analyzed large parallel underworld of Japanese gangs and their links to politicians and \"legitimate\" businesses. It does so through the remarkable life of Nick Zapetti, a small-time American hood who found his niche in post-war Japan. Whiting sometimes has to stretch to connect Zapetti with the various themes and events that he describes (Zapetti's links to the Lockheed bribery scandal that brought down a Japanese government are pretty tenuous, for example), but he manages both to describe institutions such as sokaiya (corporate extortionists) who are important to the workings of the Japanese economy, and give the reader a sense of daily life in modern Japan.The amazon.com website is replete with scholarly studies of Japanese politics and economics. This book is an interesting and important companion piece to \"serious\" analyses of Japan and would be an excellent addition to undergraduate syllabi on modern Japan.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A wonderfully gripping book. As a gaijin who grew up in post-Occupation Japan and witnessed the scene which the author describes so vividly--and having had an encounter (thankfully, a positive one!) with Nick Zapetti, the King of Roppongi--I'd say Robert Whiting has captured the time and place and wooly cast of characters perfectly. A huge plus is the excellent commentary and cogent explanation of the backstage politics and the righteous criminal mentality of Japan, Inc. I give this book five stars and a haramaki.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "An extremely engrossing look at a side of history most Japanese--and Americans--don't like to talk about. This book is not your usual take on the U.S.-Japan relationship and that's all for the better; it is so entertaining, you don't realize you are learning something as well. I can personally vouch for its accuracy as I knew many of the characters written about in this book. Robert Whiting has done a first rate job in describing the many seedy operators who inhabit Tokyo's underside. This is history the way it should be written and I highly recommend it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The sub-title of Robert Whiting's fine book is a bit misleading. The American gangster in question often disappears from the narrative for long stretches while Whiting explains the long history of collusion between Japanese politicians and the yakuza. Nevertheless, the result is a fascinating social history with plenty of entertaining anecdotes and colorful character profiles. Chief among the latter are Nick Zapetti himself, the \"gangster\" who made a fortune with pizza parlors that became the hangout of choice for expatriates, entertainers, and, most significantly, those who make their living on the wrong side of the law, and then lost that fortune through a combination of stubbornness, bad luck, and ignorance. Another highlight is the career of Rikidozan, the former sumo wrestler who became a national hero and single-handedly established professional wrestling in Japan by defeating foreign wrestlers in scripted bouts, all the while hiding his Korean heritage. Often very funny, this book appeals to both a taste for the prurient and seamy and the desire for a serious, even-handed analysis of the role of organized crime, political selfishness, and short-sighted anti-Communism in Japan's rise to power and wealth.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a hoot to read. The author got sidetracked on his expose of the yakuza and ended up focusing on the life and times of a second-rate US dimwit who made and lost a fortune in post war Japan through a string of pizza parlors. His fortune rode high on the money spent by the expanding criminal expansion of Japan's underworld, only to as quickly be lost due to his inept understanding of Japanese divorce laws. A real enjoyable book, the story was so amusing that I actually visited the locale while in Japan while on business. If you are looking for a compilation of the rise of Japan following the war, the expansion of the criminal underworld, and a personal touch from an American viewpoint, you will enjoy this book immensely.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The author draws convincing connections between the US occupation and the corruption in the Japanese business/political world. Some of the things that the author discusses are crucial to a full understanding of modern Japanese history, but you will not find them in &quot;official&quot; American or Japanese sources. Examples: US occupation rationing system giving yakuza their black market niche in all goods; Americans getting wealthy by illegal means during the occupation; and much info on minority-status Koreans in Japan and their relations with both North and South Korea. This is an excellent book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the secrets of mariko a year in the life of a japanese woman and her family",
        "description": "With Bumiller's intimate, beautifully written portrait of a middle-class Tokyo housewife, readers finally penetrate the mysteries of the Japanese people to see how they differ from us, and how they are alike.",
        "authors": "['Elisabeth Bumiller']",
        "infoLink": "https://play.google.com/store/books/details?id=KcenoSWpGkMC&source=gbs_api",
        "categories": "['Social Science']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The best books about other cultures are those that start at the bottom and work up. In this book Elisabeth Bumiller interviews a Japanese women and her family, friends and others linked to the family to give a very detailed picture of a Japanese family from 1991 to 1992. We get to join festivals, sit in at PTA meetings, visit mobsters, learn about local politics, find out what family issues the Japanese have and even the family's view on America and international events.NOTE: The author has very strong views of her own and will state them, but don't let that get in the way of the rest of the book. She digs up a LOT of information and makes it clear that while the Japanese might have different ways of thinking or doing stuff, they do have some of the same goals, dreams and fears.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Like many African American women, I haven't had many intimate contact with women of Asian ancestry so I was really excited about this book when I found it at the local college library. The author does a fantastic job of observation into the life of a &quot;typical&quot; Japanese housewife. The book gave me a deeper understanding of one aspect of Asian culture that I couldn't have learned otherwise. At times, the reading lags a bit because of its ordinary-ness but at the same time it is the ordinary day to day struggles that Mariko encounters that makes the work so engaging. I recommend it highly to anyone that is willing to spend a day reflecting on something other than themself.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book takes a personal look at Mariko, who is a wife, mother, and daughter in modern-day Japan. This book cuts through typical Japan-bashing rhetoric, and provides an intimate look at Japanese family life during a time when familial roles are being challenged and re-defined almost daily. This behind-the-scenes view of family life is one that few non-Japanese get to experience.I particularly enjoyed how the book illustrated the rhythm of Mariko's daily life over a year's time. The book shows how Japanese women have much more freedom of expression and independence than men which is quite contrary to what most westerners believe.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book provides glimpses of the lifestyle of an average Japanese housewife. Written by a journalist rather than an anthropologist, the author explores the life and important events of Mariko over the course of a year. Through the author's interviews, we learn the history of the family and the views of Mariko, her husband and children on such topics as family life, parenting, and work. As a journalist, Bumiller is quite interested in Japanese opinions and attitudes about current events, so Mariko and her family explain some of their complex feelings about the U.S. We visit the children's schools and work places, and see where they go on vacation. Along the way, Bumiller also interviews prominent Japanese who are in some way connected to aspects of Mariko's life, such as politicians, the head of the mob, and a talk show host. By the end of the book, readers are familiar with many details of average Japanese family life, something that would be unattainable unless one were to either grow up in Japan or live for long enough in Japan to develop close friendships with locals. But even Bumiller points out that she has only scratched the surface, and there is much about Mariko's life that we can never comprehend just by reading a book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "After having lived in Japan for almost twenty years it was a pleasure to read The Secrets of Mariko. Most books portray the Japanese with an overdose of stereotypes and generalizations so people who are not familiar with Japan can get innacurate ideas. By interviewing Mariko and her family and acquaintances in depth, the author of this book managed to come up with a fairly accurate portrayal of modern Japanese life. @@Even though the interviews took place in the early 1990's@and Japan has changed since then, a reader can get a pretty good idea of what life is like for many Japanese families today. Mariko's family situation is, of course their own and is unique in many ways. The family's attitudes and ideas, however are not unique. If a reader wants to get a good understanding on modern Japanese life this is an excellent book to read. @",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "True, this book is written from a Western perspective, but as most of the readers are coming from that same perspective, this did not bother me. This book examines the life of Mariko and herfamily and gets beyond the surface to examine work, love, gender roles, growing up, school, traditions, and more in modern-day Japan. It is fascinating and will make you want to know more about Japan and Japanese culture.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have just finished this book, and found it thoroughly enjoyable in a sober sense. Each chapter gave me something to think over; the book left me with a deeper understanding of Japanese culture and the way relationships are intertwined in that nation.As I am studying Japanese, I may have found this book much more interesting than someone who has no particular interest in Japan. That said, if you have an open mind and interest in the culture, there's a good chance you'll love this book as much as I did.At times, it seemed the author was a little too self-seeking. I would certainly hope she has kept in some form of contact with Mariko, and perhaps passed on some royalties from the book - given the massive amount of time Mariko and her family spent with the author (she did give Mariko's family a gift at the end, but to me that didn't seem enough).Aside from that, the book was a real eye opener and I couldn't put it down.Bear in mind the author spent time with Mariko between 1991-1992, so by now there will certainly be some cultural discrepencies and perhaps attitude changes.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the siege of rabaul",
        "description": "Details the ordeal of abandoned Japanese units in Rabaul on New Britain Island. Includes many rare photos.",
        "authors": "['Henry Sakaida']",
        "infoLink": "http://books.google.com/books?id=ZScFAAAACAAJ&dq=The+Siege+of+Rabaul&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The book is an interesting read. I finished it within 2 hours. Although the topic is heroic (and sometimes sad), i especially found the antics of one Japanese pilot in particular, Masajiro Kawato, funny. The author seems to share this same view, and never hesitates to aim barbs at (and debunk) Mr. Kawato's outlandish claims. I think the word \"mentally unstable\" was used numerous times to describe Mr. Kawato.I especailly liked the voluminous photos that accompanied the book. Each page has on average 2 photos, and that helped tremendously to tie human faces to the characters the author is relating. The interviews that the author conducted with the survivors was especailly interesting. It is clear that Mr. Sakaida is a fan of Japanese aviation.I would have given the book 5 stars except for the fact that the book did not have an index. This made it extremely difficult to refer back to the book and catch references to various persons. But given the brevity of the book, I suppose it would not be difficult to flip back and find the references I wanted.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is a good book for anyone who wants to know details and insights into one of the most misunderstood operations of WWII. Loaded with pictures and personal accounts, Henry Sakaida has done a great job illustrating exactly how the aerial siege of one of Japan's mightiest bastions unfolded. The Japanese were convinced a ground assualt on New Britain was inevitable and fortified it in anticipation of the \"coming of MacArthur.\" But it turned out to be a wasted effort as the Allies simply cutoff and bypassed Rabaul, leaving it to wither on the vine for the remainder of the war without an American having to wade ashore. It's unfortunate that Rabaul doesn't rank among the names of the easily recognizable spots in the Pacific like Tarawa, Gudalcanal or Midway. But this book helps remind you of how pivotal this place was to the war effort. An easy and informative read that will have you \"Google-ing Rabaul\" after you finish.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "tokyo friends",
        "description": "This multicultural children's book is a a kid-friendly introduction to Japanese culture! Katie is a young American girl living in present-day Tokyo. One day, as she walks her dog, she meets Keiko, a young Japanese girl, and her brother Kenji. Join Katie, Keiko and Kenji as they explore the city and its surroundings as they learn about cultural diversity and the customs of their respective countries. Whether eating soba (buckwheat noodles) or spaghetti, studying kana (the alphabet), or dancing at the O-bon festival, the friends discover just how much their two cultures differ-and how much they are alike. Vibrantly illustrated by the author, Tokyo Friends is a wonderful Japanese children's book that introduces young readers to Japanese traditions and customs and also serves well as a valuable beginner's guide to the Japanese language.",
        "authors": "['Betty Reynolds']",
        "infoLink": "https://play.google.com/store/books/details?id=LBDQAgAAQBAJ&source=gbs_api",
        "categories": "['Juvenile Nonfiction']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "My name is Jenifer Reynolds, and first, I'll admit that I am the author's niece. Actually, the redheaded Katie character is based on me as a child! This book is an EXCELLENT children's guide to Japanese culture...I know because I was there myself! This is a definite must-have for any young child who is either visiting or learning about Japan. The book is gorgeously illustrated w/ watercolour by my aunt, and is humourously written.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "I am a Japanese Chinese American. (Yes, we speak all three languages at home.) I like this book because(1) it introduces people to Japanese traditions, customs, and the simple Japanese language (by English-Japanese glosses.)(2) the drawings are excellent. They catch young readers' attention.My mother, who is 100% Japanese, finds that some of the traditions and customs described in this book are in greater details. She says she doesn't even know some of the information listed. She still finds the book interesting, although she wouldn't recommand it to beginner readers (whom she recommands to get \"1st Thousand Words Japanese\" and \"Let's Learn Japanese Picture Dictionary\")",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I am not related to the author and I love this book. I am an expat living in Tokyo and have bought several copies as gifts for my children's friends back home in the States. It gives a nice comparision of typical American living and Japanese living through the eyes of childhood friends. It is a great way to show that although there are cultural difference, we are all friends. The illustrations are wonderful giving both the Japanese and English words for the items in the pictures. Simplistic, but cute.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the lady and the monk four seasons in kyoto library edition",
        "description": "An account of the author's stay in a monastery in Kyoto, Japan, in order to learn about Zen Buddhism, introduces readers to Sachiko--a well-educated English-speaking, Japanese housewife locked in a traditional marriage but drawn to the author and to Weste",
        "authors": "['Pico Iyer']",
        "infoLink": "http://books.google.com/books?id=BX5xAAAAMAAJ&dq=The+Lady+and+the+Monk:+Four+Seasons+in+Kyoto+(Library+Edition)&hl=&source=gbs_api",
        "categories": "['Travel']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "Having lived in Japan for seventeen years and visited Kyoto in all seasons, I think that Iyer glosses over much that is representative of Japan today. And too, he portrays Sachiko as a hapless housewife, one who cannot function on her own or who is an emotionally challenged adult. How well could Iyer really understand her or the culture since he had such a poor compre- hension of Nihongo? And too, if this is a true account of his life in Kyoto, then he has done a terrible wrong to Sachiko's children. Divorce in Japan still leaves a deep stain on the honor and social position of those involved. And children from a broken marriage face ostracism in later life when seeking employment or even a marriage partner of their own. Iyer ignores much reality as he plods along with his romantic notions and fascination with Gion beauties. The book reads like something gleaned from a reading list of publications about Japan. And all that stuff about 'Zen'! The average Japanese salaryman or housewife would scoff at all of his 'insight'. They devote most of their waking lives to being good corporate citizens and pay only lip service to temples and Buddhist tradition. And children can be brats in Japan, like everywhere else, watching hours of tv, playing video games, and reading manga. Iyer is a bit 'chotto' coy and sentimental.",
                "review/helpfulness": "33/44",
                "num_reviews": 44
            },
            {
                "review/text": "I bought this book used last summer and filed it away on a bookshelf, and finally picked it up two days ago. Even though these days, I read through most books slowly, I was sucked into Iyer's Kyoto world, and plowed through the book in two very enjoyable sessions.I was baffled to read some of the criticisms readers at Amazon gave this book. I found the accusations that Iyer is condescending to be the most perplexing. I've read lots of travel writing, and have found that many travel writers spend most of their time analyzing their chosen destination with a God-like impersonal analysis of the place's foibles that certainly does often come across as arrogant or ignorant.What struck me about this book was how much Iyer does *not* do this. He certainly spends a lot of time analyzing and trying to figure out both Japan and the people he encounters there, but he is no more critical of others than he is of himself, no more critical of Japan than of his own culture(s). He does not watch from a distance, but participates in what he writes about, from interacting with 'The Lady' to dipping his foot into the waters of a monk's life, and exposes his own floundering. He criticizes not only that which he participates in, but also his own foibles and inability to realize the rigor and discipline of Zen, his own inability to understand Sachiko and give her what she needs and wants.I came away from the book seeing Sachiko *not* as someone who is helpless or hapless, but rather, as someone who, like all of us, struggles between dreams and duties. Yet unlike most of us, Sachiko taps into a well of deep inner strength and vision and breaks through the restrictions of her cultural conditioning to realize her dreams. I thought Sachiko came across as much stronger, with more grace and understanding, than Iyer, who often is reduced to clumsy assurances as he tries to fathom her rich inner world. Yet this is not to say that Iyer comes across poorly, but rather that he comes across as an honest and likable narrator unafraid to expose the personal hues and struggles of his journey.The analysis of Japan and the people he meets in which Pico engages is a usual feature of travel writing, and as always, his analysis may or may not be accurate. But unlike many travel writers, he exposes his own biases and inaccurate perceptions often by comparing his idealized visions of Japan to the idealized visions of others about other cultures. He clearly shows how his preferences shape his experience, instead of presenting snippets of literature or cultural observation as if they were gleaned from an impersonal textbook about Japan. This is a very personal experience, and I find Pico to be a very warm, likable, and human narrator, whose personal sense of magic and wonder fills this book and transports the reader.",
                "review/helpfulness": "37/39",
                "num_reviews": 39
            },
            {
                "review/text": "Subtitled &quot;Four Seasons in Kyoto&quot;, this 1992 book by the British travel writer, Pico Iyer, is more than just a book about a place. Mr. Iyer spent a year in Kyoto to learn about Zen as well as Japan. Along the way he met a very special woman, Sachiko, and learned more about the essence of being Japanese than he ever expected. I was particularly interested in this book because I have a wonderful Japanese daughter-in-law and have been to Japan myself. I remember the few days we spent in Kyoto with fond recollections and smiled at the author's vivid descriptions. I also found myself nodding in agreement at some of the discoveries he made about Sachiko and her way of thinking as I, too, have had my eyes opened in similar ways.Mr. Iyer has the ability to paint a complex portrait in words. I found myself sharing his discoveries, from his experiences in the temples to the very modern music clubs. The center of the book, however, is Sachiko. She's 30 years old, the mother of two children and married to a Japanese businessman who spends 18 or more hours a day at work. She speaks English with difficulty but has read a lot of classic literature and is also an aficionado of a wide variety of pop music icons. In spite of her traditional upbringing, she yearns for a larger life, beyond the confines of her home.Mr. Iyer becomes her friend and they do a lot of sightseeing together. She's free all day and so is he, which makes their friendship easy. Some of the most interesting scenes are when he tries to speak Japanese and she tries to speak English and misunderstandings follow, both because of the language itself and also because of different ways of thinking.I'm a romantic and fully expected their relationship to blossom into an intimate one, but Mr. Iyer is so evasive that even though they do become very close, he avoids those kinds of topics. Instead, he focuses on what he perceives to be her feelings and his growing understanding of her. It seems a little strange to me that only in the later part of the book did he drop a gentle hint that their relationship was a bit more than that of just friends. But even then, I never was sure.This is a great travelogue. I not only learned a lot but also recognized things I have come to understand about the Japanese character. There are long sections about literature, both Japanese and Western, which I found to be boring. And the relationship between Iyer and Sachiko left me annoyed. But for a unique picture of Kyoto and a deeper understanding of the cross-cultural differences between Japanese and Westerners, I do give it a definite recommendation.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "I first flipped through _The Lady and the Monk_ ten years ago in a bookstore, well before the era of Amazon and online reviews. I liked Iyer. The book made its way onto my list of books that I might someday buy. I finally bought it last week and read it, groaning all the way. My initial attraction to the book and his particular brand of travel writing seems to have had more to do with my status ten years ago as a study-abroad, graduate-student returnee than his skill as a travel writer. Iyer presents a wide-eyed, Byronic pastiche of his year in Kyoto, trotting out cultural stereotypes of the Japanese and everyone else. Yes, he goes briefly to some hostess bars, wangles his way into a teahouse with geisha, and views the cherry blossoms. But these are experiences that once could have in a much shorter trip.It was apparent almost from the start that a romantic relationship was evolving between him and Sachiko, but he remains coy about it in the narrative, and continuously comments on Sachiko's pathos-filled attempts to express herself in English. Sachiko makes many late-night booty calls to him at his guesthouse asking to see him and crying on his shoulder in the street in the moonlight and he still \"cannot fathom what it all means\"?! (He \"cannot fathom\" quite a bit during his year in Kyoto.) Representing Sachiko as he has does a disservice to her as a person. Now that I've finished the whole overwrought story, I \"cannot fathom\" that Iyer returned from a year abroad, fresh off an international tryst, to capitalize on his former lover's personality in such an analytical way, mocking her English and judging her choices as dictated by her culture, finally ending up with her in foreign hotels where \"bodies speak without language.\" I fail to see how Iyer is any different from the other Western men whom he mocks for traveling to Japan to find Japanese girlfriends.As the book went on (I hesitate to say \"progressed\"), I felt myself becoming as judgmental of him as he was with the people who entered and left his life. Iyer is introspective at the expense of seeing the culture around him. The book becomes more about his feelings about being in a relationship with Sachiko than about Kyoto, Japan, or Japanese culture. I prefer my travel writing more honest, insightful and engaging, along the lines of Bruce Chatwin, Patricia Storace, or, yes, Paul Theroux. Liza Dalby's _Geisha_ is a far better book about traditional Kyoto culture by someone with a steadier hand and a more studied eye. I almost - almost - want to go back and read _Falling Off the Map_ again to see if it too strikes me as myopically introspective. Really, save your time and money. Check your library before buying this. I should have, and saved myself from the feeling of obligation to finish it.",
                "review/helpfulness": "17/23",
                "num_reviews": 23
            },
            {
                "review/text": "Sorry Pico, I wasn't able to finish this one! It swings between being cliche and condescending to outright fantasy! &quot;A high mountain clarity sharpened the October air&quot; (talking about Narita Page 3). There isn't a mountain within about 100KM of Narita, it's situated in rice fields! He makes another reference early in the book about street vending machines full of every kind of fruit juice you can imagine. I wish it were so! The only fruit juice you can buy in a vending machine is from an American soft drinks company, sometimes! I use these two early points to illustrate the distortions of living in Japan which continue throughout the book (on almost every page). Mr. Iyer has written a fantasy, which really gives an unclear picture of life in Japan.",
                "review/helpfulness": "15/22",
                "num_reviews": 22
            },
            {
                "review/text": "The title of this book is a bit misleading. Yes, Pico Iyer does live in a monastery for a few days but his main emphasis is an exploration of Kyoto, one of the holiest cities in Japan.The title comes from a Buddhist story about a beautiful woman who tempted a monk, much as Buddha was tempted by an evil god as he sat under the Bodhi tree searching for enlightenment.Pico is an essayist for Time magazine and he is far more interested in the somewhat schizophrenic nature of the Japanese people than he is in Buddhism. His main subject is a housewife named Sachiko who is married to a Japanese &quot;salary man,&quot; who works from six in the morning until eleven at night. His family life is an afterthought. Sachiko loves everything foreign from the Beatles to Mickey Mouse. She calls Pico a &quot;bird&quot; because he is free to wander all over the globe while she is a slave to her husband and two young children.According to Iyer, Japan is close to a utopian society and Kyoto is the cleanest city he's ever seen. Sachiko is a fascinating character. When she introduces Pico to her children she apologizes for their misbehavior although they are much more well-behaved than western children Pico has known.Pico and Sachiko's relationship is perplexing at first. She hints that she might want something more than a platonic relationship. He's wise enough to know that it's the dream of a romance, the romance she's seen in the movies, that she's after.There are some wonderful moments in THE LADY AND THE MONK: Sachiko's mangled English with the occasional Japanese word thrown in and the lack of articles; Iyer's description of cherry blossom time; the albino monk Pico meets when he stays at the temple; the Hanchu Tigers last game of the year when Randy Bass, their American homerun hitter, bows to the fans fifteen times. The fans are just as enthusiastic as they would be if this were a World Series team and not a team thirty-some games out of first.The main emphasis of the book, though, is Sachiko's story arc; we see her beginning to grow away from her salaryman husband, we see her trying to make her dreams become a reality, despite the censure of her mother and friends. We get the impression that the more Japanese women are exposed to the West the more Sachikos there will be.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I was fortunate enough to visit Kyoto for a week during a three-month internship in Japan two years ago and instantly fell in love with the city. The harmony between the ancient and the modern in Kyoto and Japan in general is both astounding and captivating, and it was with great sadness that I had to tear myself away and head back to my job.After returning to America, I bought this book and read it twice, without putting it down, it so brought me back to Kyoto and Japan. I've not read any of Iyer's other books, but this one was excellent. He conveys a definite emotion in his writing, and one that is quite suited to discussion of Japan I think. A sort of tragic interpretation of the events he experienced, which fits in very well with the Japanese psyche, where the greatest heros are the ones who come to tragic ends.The reviews here which note that Iyer paints with too broad a brush, so to speak, I feel are unfounded. I don't think it was ever meant to be an encompassing guide to Japan or any sort of critique of its dichotomy-filled society, though he does note with care all of them he encounters. Instead, it is simply one man's experience in Japan, take it or leave it. Sachiko is a real person he met, with real problems, and she went about solving them in a real way. I know Japanese women in similar situations, so to say they either don't exist is silly.I don't want to say too much about what happens, so I'll just finish by saying that I personally found this book very moving. I miss Japan a lot and I hope I can go back soon. Five stars easily.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "There is no doubt that Pico Iyer is a masterful writer: his descriptions of Kyoto and Japan are breathtakingly gorgeous. He does have a tendency to ramble at times, but the passages that are good are worth slogging through the ones that drag.However, there are parts of this book that do not seem plausible. Never once does he get frustrated by the language barrier or long for a cheeseburger. (I lived in Japan for three years and can attest its only natural to feel homesick or lonely.) He spends his year in Japan in perfect harmony with everything around him, has no troubles with the shabby guesthouse he lives in or the woman that (he admits) uses him to fulfill her warped idea of romance. He is guilty of his own criticism of how the Japanese seem so innocent, so willing to look at the bright side all of the time.Furthermore his relationship with \"Sachiko\" seems almost unbelievable. (PS - why does he even bother to change the name when he dedicated the book to Hiroko on the first page?) How does this Eton, Oxford, and Harvard-educated world traveller (who loves dropping names about all the great authors he reads) manage to fall in love with a woman who hardly speaks his language and who's never been outside of Kyoto? He goes on and on about all the deep conversations they had, when really I don't see how it's possible. He paints Sachiko like the kind of girl people go to Japan for all the time: always agreeing, never arguing, always dressing up and buying presents. He looks down on all the guys who come to Japan to find a girl and yet never admits he did the same thing. Furthermore, their relationship is so painfully selfish and childish that I can't help but hate the guy at times; he talks about his \"great\" romance but never discusses the subsequent divorce, financial difficulty, toll on the children, etc. As far as I remember, he only played with the kids a handful of times, instead stealing away with his \"lady\" at all hours of the night. I'm asking myself the whole time I read this book, \"Who's watching the children?!\" I'm sure these two love each other and all (as they are still living together. Are they married?) but I just think his recollection of their relationship is a bit too melodramatic, too \"magical\" to be believed. It's too innocent, too, by Iyer's definition, \"Japanese\".As a work of fiction this book is stunning, but as a memoir, I feel it's a bit too farfetched. But regardless his prose really is a work of art.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "I have two responses to this well-written travel narrative. First, I greatly enjoyed Iyer's observations and thoughts about contemporary Japan. Even though the book was published in 1991, much of it still seems accurate to me, someone who has traveled to Japan three times. Iyer, is a very good travel writer, one who is neither acerbic in the manner of, say, Paul Theroux, nor prone to the gauzy romanticism one sometimes encounters in western responses to Japan (like Cathy Davidson's \"Thirty-six Views of Mount Fuji\"). He is alert to subtleties of culture and behavior that most travelers would never notice. So that's what I liked about \"The Lady and the Monk.\"On the other hand, the account of his relationship with Sachiko, the Japanese woman who longs to break free from her constrained life by cultivating relationships with foreigners, does not wear as well over the almost two decades that divide his experiences from the present. It seems dated and (since it is interwoven throughout the text) ultimately a little tiresome. Iyer's decision to render Sachiko's awkward English as he heard it (as opposed to conveying what she was saying in standard English) works at first, but eventually has the effect of making her seem much less thoughtful than she probably was. Iyer's graceful prose and Sachiko's stumbles as she tries to express herself in English are set side by side, even though he probably, to her ear, sounded even worse in Japanese. This flaw makes it hard to see their relationship as one of equals; there is a teacher-student quality to their conversations that becomes irksome. (I think it is this rendering of language inequality that makes some readers see Iyer as condescending, even though I don't think he means to be.) Do read this book for its many good parts, which almost make up for too much Sachiko.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Can't believe how everyone raved about this book. I read it when I lived in Japan and it came across as a typical western male fantasy of Japanese women, and Japan in general. Maybe I should have left the big city..maybe I should read it again.. maybe I should ask my Japanese women friends why they're not like The Lady in the book. Sorry folks, I thought it was one big cliche!",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "embracing defeat japan in the wake of world war ii norton paperback",
        "description": "Chronicles the events that took place in Japan at the end of World War II and explores the effects they have had on the development and shaping of the Japanese society, from immediately after the war to the present day. Reprint. 40,000 first printing.",
        "authors": "['John W. Dower']",
        "infoLink": "http://books.google.com/books?id=hae0dC_NaiUC&dq=Embracing+defeat:+Japan+in+the+wake+of+World+War+II+(Norton+paperback)&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": 13.0,
        "review": [
            {
                "review/text": "Embracing Defeat is an authoritatively researched and beautifully written account of the U.S. occupation of Japan by a leading specialist on World War II, Japan and the U.S.-Japan relationship. This is a work that pulls no punches. Like no earlier study, it brings to the fore the ironies and contradictions of the era and casts fresh light on several of the great political issues of the era: the making of Japan's postwar constitution, U.S.-Japan relations, the reconstruction of economy and society, the role of Japan in the making of the U.S. order in Asia, and the role of MacArthur. It also offers the first cultural history of the occupation.It is particularly valuable in bringing out Japanese contributions to shaping occupation outcomes. Embracing Defeat is a pleasure to read.Dower takes the reader on a tour that reveals ambiguity, irony, fallibility, vitality, dynamism, messianic fervor, theatre of the absurd, the world turned upside down, fall and redemption, flotsam and jetsam on a sea of self-indugence, cynical opportunism, top-to-bottom corruption, delicacy and degeneration, despondency and dreams, tragedy and farce, boggling fatuity, and carnival, to mention a few of the polarities that run through this beautifully written and astute volume.",
                "review/helpfulness": "115/123",
                "num_reviews": 123
            },
            {
                "review/text": "As a company commander in far SW Honshu and Kyushu I would say Prof. Dower's scholarly work widely missed the mark when he attempted to discuss the life of the Army man in Japan. Occupation life in Tokyo and the rest of Japan were entirely different. Dower makes it sound very cushy. He has a photo of a Chief Petty Officer in Tokyo sitting down with his wife and children at family dinner. The Chief has on his full uniform, the children are scrubbed and brushed, the boys wear neckties and behind them are two Japanese maids in kimono and obi. As an officer commanding 200 men, I had no maid, our messhall had no maids, meals were served cafeteria style. Our enlisted men were pampered by Japanese who served as KPs. Instead of peeling potatoes, my men and officers were entirely free to perform training and reconnaissance missions. In that part of Japan I never saw homeless people squatted on the sidewalks, I never saw people who looked starved or in rags, I never saw the labor unions demonstrating. My company lived in the country 40 miles from division headquarters. There were no bowling alleys, there were no movies. We did have an E.M. club with slot machines and on occasion we used those profits to hire a Japanese show, a magician, a very unsophisticated musical with dancers. In a small nearby town in Shimane Ken there was as best described, a Japanese beer joint; this place had no girls but it did have a Wurlitzer juke box and served very cold, excellent Japanese beer that we paid for. After I was in Japan almost a year I was allowed a vacation to Tokyo and to see friends in Sendai. Tokyo was like a different world. There was the Ernie Pyle Theater, there was traffic, the Ginza was exciting but it in no way compared to the little town with railroad station located 4 miles from our isolated camp. Sendai was 10 times larger than our town but with little to offer for entertainment. So, in my view, the professor's reporting of the Occupation Forces was clearly distorted unless you lived in Tokyo. His reporting on politics and personalities in Tokyo was well researched but Tokyo was NOT the occupation. Harlan G. Koch",
                "review/helpfulness": "75/85",
                "num_reviews": 85
            },
            {
                "review/text": "This book is essential reading for those interested in the history of Japan as well as for those with an interest in how Japanese society came to be what it is today. While I am not qualified to comment on its historical scholarship, it certainly seemed very solid to me - the author's documentation is thorough and impressive and his treatment is painstaking and precise. It certainly rings true.However, my sense was that the book started off as an excellent read and then began to drag somewhere after the first 200 pages. While I have no doubt that the latter half of the book is as accurate and important a history as the first half, it seemed to make for less compelling reading. The first third or so of the book concentrated primarily on the societal impact of the Japanese surrender and its immediate aftermath - and I found it absolutely fascinating. The latter portions of the book dealt more with political issues, including a very thorough treatment of how the occupying forces (i.e. the US under MacArthur) drafted and pushed through the new Japanese Constitution. Very interesting, but in my opinion not as compelling as the early material in the book.In summary, if you are interested in the history of Japan and/or World War II this book has to be on your reading list. A very impressive piece of work.",
                "review/helpfulness": "49/52",
                "num_reviews": 52
            },
            {
                "review/text": "'Embracing Defeat' is a Pulitzer prize winning portrait of Japanese society after the defeat in WW2. It is a wide ranging survey, which, despite some guiding themes, often feels more like a collection of essays than a unified work.There are, I think, several questions of great interest to the contemporary reader about Japan. One would probably be most interested in learning about how Japan dealt with the devastation of Hiroshima and Nagasaki; how Japan turned from a racist, imperialist country into a democratic and pacifistic one; and how Japan not only recovered from the economic devastation of the war, but finally became one of the world's leading powers.Strangely, Professor Dower seem to give peripheral attention at best to the first and third question, and pays most attention to the second, as well as to minuet study of the interactions between the US occupation force and the Japanese population. He also focuses mostly on the early years of the occupation, up to 1949 or so, as if a chapter or two on the outbreak of the cold war were planned but later discarded.Much of the book is 'social history' - a depiction not so much of the leading characters and figures, but of sociological and economic trends. All too often, Dower fall into the trap of this kind of writing - describing things that, for any observer with the slightest knowledge of the society, would be patently obvious. Who could fail to anticipate poverty and corruption in a country devastated by war? Given the existence of rationing, every one who ever took any economic course can predict the appearance of a black market. And obviously, a country that lost millions of its young population in war would pay more attention to its own casualties than to those of the former enemies.One of the great advantages of social history is that it lends itself to quantitative, statistical analysis. Surprisingly, Dower hardly ever mentions public polls, and rarely attempts to quantify his observations about opinions as expressed in media articles. His use of economic statistics is only somewhat better. There is an old historian's maxim which goes \"don't guess, try to count, and if you can't count, admit that you're guessing\". Unfortunately, Dower fails to conform. I think that his analysis is robbed of much of its power because of this.The central theme of the book is the paradoxes of 'Democracy from Above' - the US enforced an authoritarian rule to make people free. It is' of course an interesting paradox, but Dower's exploration of it is only as good as the specific topics in which he engages.By far the best part of the book deals with American 'wedge strategy', the attempt to distinguish between the Emperor and the military government headed by Tojo. Most of part 4, dealing with the wedge strategy and the formation of the Japanese constitution are nothing short of breathtaking, as they explore the intrigue and politics of occupied Japan, and of Japan vis a vis the United States and the world. The image of McArthur, strangely aloof from Japanese culture, and yet also admired and dedicated for change, is an intriguing and well realized one.Also interesting is Dower's report on (and especially criticism of) the War Crime trials. Although I was left unconvinced that the Japanese would have done a better job judging the war criminals themselves, it is a powerful demonstration of the great problematic nature of international law, which is in essence, as Dower calls it, Victor's Justice.Ultimately, though, it is hard to see a clear plan in the book, and Dower's afterward, in which he attempts to pull everything together, feels shallow (but interesting). In it he for the first time engages fully the economic leap forward Japan took in the 1960s. Dower argues that the key to Japan's industrialization lies in the '15 years war', starting with the commencement of hostilities with China in 1931. Japan in the second half of the twentieth century, having renounced its militarism, came to excel in the other field open to it - economics.For people who, like me, are trying to understand how Japan became the leading economic power it is today and how other countries could learn from its example. Dower's book supplies no answer. Its failures of narrative prevent it, in my opinion, from reaching the status of a classic. Yet for all its faults, Embracing Defeat is an interesting, informative and readable study of Japan after the war.",
                "review/helpfulness": "35/39",
                "num_reviews": 39
            },
            {
                "review/text": "The beginning of this book is great. It provides a very readable and informative look at the state of Japan at the beginning of the US occupation at the end of WWII. However, later in the book I feel it drags too much and tries to present too much information. So, while I enjoyed the first 300 pages very much I did not like the 2nd half. The author I feel is also a little to sympathetic to the Japanese. Yes, Its reasonable to feel bad for all the displaced Japanese soldiers in Korea, China etc....but i the author i feel overlooks why those soldiers were there and what they did. Again, the book is well researched and at times brilliant. But I feel it is too long and at times just a bit too Pro-Japanese. I recommend after reading this book that you read the novel &quot;The Emperors General.&quot;",
                "review/helpfulness": "27/38",
                "num_reviews": 38
            },
            {
                "review/text": "Dower's book has been widely praised among Japan hands and that admiration is justly accorded. He gives a balanced account of the American occupation of Japan and makes often provocative, though well thought out points that have often been neglected in earlier accounts of this period in the Japan-U.S. relationship. His thoughts on the emperor's war responsibility and the dubious nature of war crimes trials are especially salient. Moreover, being something of a fan of Japanese pop culture, I found his discussion of how popular media of the time reflected evolving Japanese attitudes to be fascinating. The only place where this lacks for me is that he doesn't really go enough into broader diplomatic questions about the Japan-U.S. relationship. For those like me who like to read several books at the same time, I would suggest that one read Shaller's ALTERED STATES: THE UNITED STATES AND JAPAN SINCE THE OCCUPATION concurrently with Dower's book to get a more robust assessment of that issue. Nonetheless, for anyone interested in Japan, this is essential reading.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I'm more of a historical novel reader, because great novels like &quot;The Triumph and the Glory&quot; or &quot;The Emperor's General&quot; usually more interesting than history volumes. But Embracing Defeat is very well-written and commanded my interest from start to finish.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book gives quite a lot of information concerning the motives of both MacArthur's post-war occupation and of the Japanese government as well as the thoughts and condition of the Japanese populace. Dower provides a very convincing argument the the Emperor was excused from prosecution as a war criminal, and explains why the U.S. helped cover up his probable guilt. His book is one of the first popular book which addresses crimes committed by some of the occupation forces. There is a wealth of information in this book which should interest any serious student of modern Japanese history. It is not likely to be of a lot of interest to those without an interest in the post-war Japan.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "John Dower's recent offering is a lively page-turner as well as an all-embracing account of MacArthur's presidency after WWII. It deals with almost every aspect of Japanese society following the cessation of hostilities and then goes on to chart how life changed over the course of the Occupation. It's sympathetic look at Japanese society and doesn't shy away from pointing the finger at US hypocrisy when the Cold War changed American attitudes towards Japan's burgeoning political parties - particularly those on the left of the political spectrum. Embracing Defeat is a very, very good book.Some reviewers believe that Dower has whitewashed the fact that Japan never publicly admitted its war guilt. I don't think this is fair since it is common knowledge that they haven't - at least as a state. There seems little point in repeating what everyone already knows.Where Dower does break new ground is his analysis of why there has never been an admission of guilt. A deal was done to pin the blame on the militarists and absolve Hirohito and, by extension, his loyal subjects too. Moreover, at the time, it was widely touted that Japan had been defeated by science and not the Allied forces. The Americans were just as guilty as the Japanese when it came to spreading disinformation about who was to blame.On a wider scale, Embracing Defeat looks at a vast array of topics. We see how society changed once the Emperor declared an end to the war. Japanese became entrepreneurial almost over night after spending almost twenty years as yes-men to the militarists. There was a burgeoning of political, artistic and lifestyle movements that formed the basis for today's world-wide love affair with Japanese comics and cartoons. Dower takes us through the formation of the new constitution and leaves you fully congiscent as to why the 'Convoy' system so derided by Washington is in fact an American creation that the Japanese have never tried to change.Then there's an account of the war trials where Tojo went through the trap door. In Dower's opinion, the show trials were cleansing act of revenge without a proper trial or any attempt to round up those really responsible. This is probably correct, although some readers will find it hard to stomach given the staggering atrocities committed by Japanese forces throughout the Pacific Rim.The one area that is badly lacking, however, is economics. Japan experienced chronic hyperinflation before the Pacific War and remains highly reliant on imports of almost every raw material. The economy was absolutely knackered by 2nd September 1945. Its railways and maritime capabilities had been almost totally destroyed.So, how did Japan manage to stabilise its economy and then go on to become the world's second largest economy? I know since I'm an financial economist in Asia. But most readers probably aren't and I'm sure they'd like to know. Dower makes a stab at it, but this part reads more like an add on written by a historian with little knowledge of the Dismal Science.Still, I really liked Embracing Defeat for its broad sweep coverage of MacArthur's reign. Four stars.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is an exhaustive yet finely wrought history. It is the best book in any language on post-war Japan. It is one of the finer books ever written about the impact of sudden and massive change on culture, language and the way people view history, themselves, and the world around them.A great strength of the book - but also, perhaps, its only weakness - is the enthusiasm, and (there is no other word for it) innocence of the author. Dower is a sophisticated scholar immersed in the delicacies of inter-cultural and inter-racial exchange, as well as in Japanese language, history, and culture. But he retains a child-like delight in laying-bear the mental universes, attitudes and foibles of the Japanese and their American occupiers. In this, despite Dower's intimacy with the Japanese, the book has an attractive and profoundly American feel.The enthusiastic welcome Dower gives to all his source material is a strength. It allows him to remain open to information from a huge range of sources, many of them untapped by other historians. But - if only rarely - it also makes him less critical than he needs to be. Dower accepts at face value the near-instantaneous post-war 'conversion' of many Japanese from ultra-nationalist chest-thumpers to apostles of 'peace' and 'democracy'. In many cases, as Dower manages to explain, these conversions were genuine. But many of them were not. In particular, it is impossible to accept the post-war protestations of many artists and writers and who, only weeks before, were pillars of the war-time Imperial propaganda machine.From his writing, Dower is obviously a deeply humane man with a belief in the value of democracy and the ability of human beings to change their worlds for the better. This attitude is one of the things that makes his book so good, and such a joy to read. But is also limits Dower's ability to see as deeply, or to judge as harshly, as he sometimes should.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "japans big bang the deregulation and revitalization of the japanese economy",
        "description": "Japan's national economy: understanding the history of the current crisis and proposing a path forward The consistent failure of the Japanese bureaucracy and business establishment to meet proper management and regulatory standards has made America's premier ally in Asia a major source of financial instability in today's world. Japan has the world's biggest everbad-debt burden Japan has allowed organized crime to systematically infiltrate its financial institutions Japan's national pension system faces imminent bankruptcy Japan's banks, brokerages, and insurance houses are near insolvency and welded to obsolete practices that hold the entire country and region back Japan's Big Bang traces the hurdles Japan must overcome to once again reign as one of the world's preeminent financial powerhouses. With an academic's analytical eye and the tenacity of a financial beat reporter, Declan Hayes explores the tangled mess that was and is Japan's economy, and explores the remedial action Japan must follow to regain and sustain its position as the economic engine of Asia.",
        "authors": "['Declan Hayes']",
        "infoLink": "https://play.google.com/store/books/details?id=hY3TAgAAQBAJ&source=gbs_api",
        "categories": "['Business & Economics']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This is a very good book. Prof. Hayes explains everything about Japan's business very well. Sometimes his English is hard to follow for me (I am Japanese) but his argument is not. It starts at the beginning about the marriages and mergers between Japanese and non Japanese companies. It tells that there are too many Japanese working in stupid jobs - like construction (10% of all Japanese workers, shops sales (another 10%)) and so on. It explains why this is silly, what Japan is doing to change it and the other problems. Prof Hayes is a gaijin but he understands Japan very well. I like this book very much.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This is a good book, written in simple English by someone who knows his area well. He has a good piece on the Osaka Mafia and other blots on the Japanese corporate landscape. This is a book that tells it as it is. Informative, amusing, a book worth reading and buying.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a book that will be read for many many years to come. Prof. Hayes has summed up the whole economic experience of Japan in this great book. He shows the llogic of the Japanese position from the Japanese side and why Americans fail to understand Japan. Nor does he fall into the trap of the professional Japanologists - creating mysteries where none exists. Prof. Hayes cuts through the mists and gives us a clear explanation of what is going on in Japan and as to why Japan will continue to be America;s major competitor. If you want a book explaining Japan like no other has done, this is the book for you.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a good book about an interesting topic. I bought it here in London for my Japanese Studies Course and got my first Distinction ever. Thank you Mr Hayes. He really knows his stuff and how to put it across. Would that the SOASS had more lecturers like him. He explains the different logic Japan has moved to and how it is now slowly accepting our own. A good and worthwhile book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Declan Hayes should be proud of this tome. He throws light where, all too often, the professional Japanologists - &quot;it's the unique 5,000 year old culture, stupid&quot; - shed their self serving darkness. Dr Hayes cuts through their cliches - about the unique Japanese snow, intestines and financial system. He firmly positions Japan in hte neomercantilist school - that's what economists do,they correctly categorise - and he shows how and why that catch up policy can no longer work. As a result of mismanagement, Japan is now poorer but far wiser and Dr Hayes has painted this process quite well. He is on slightly weaker ground when he paths the road ahead - perhaps because he is an economist, not a clairvoyant. Because this book wil bring you bang up to dfate on Japan's economy, it is worth buying.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is the best book by a gaijin on Japan. Most of them only write rubbish or what they think the Japanese want to hear. Prof Declan does not do that. He explain what Japan's problems are and what we must do to solve them. I got this book as a present but now i went out and bought another copy. You should do the same if you want to know about Japan.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is the best available book there is to bring you up to date on Japan's current reforms. I had the author for Money nad Banking last year as an exchange student in Sophia and he helped to show me how Western logic does not apply to the Japanese system. It has its own logic which he explains. He shows how the Bubble occurred, how it wrecked Japan's financial houses and ordinary investors as well. He brings the tale right up to date by showing the costs and benefits of the mergers and acquisitions sweeping the market and the chances the foreign concerns operating in Tokyo have for ultimate success.He cuts through the hot air and mists of the Japanologists and shows you the real economy and the real people beneath it. If you are interested in learning about the real, modern Japan, read this book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is an easy read -especially for such a potentially dry subject. The book had me laughing aloud at times. Prof Hayes does not worship the tin gods and tired cliches of others working in this field. He calls the Japanese mistakes for what they are - massive screw ups. The Japanese mandarins could learn a lot from this. So oculd you - and get a few laughs along the way.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Japan's Big Bang explains the reasons Japan is changing so fast and why it must change as well. Prof Hayes has a good sense of humor. This helps us to read this book on this important area and to learn much as well. This book should be read by every person who wants to understand modern Japan.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a well crafted book going through, in turn, the major parts of the modern Japanese economy: Japan Inc, a genral overview of the Japanese economy and why it is reforming with the Big Bang; 2. The Tokyo land and Share Price Bubble - why this mess led to the changes; 3 Japan's sullied mandarins: how and why Japan's former mandarin rules in the MOF etc have lost their power; 4 Japanese Financial Institutions - an excellent review of how all of Japan's DIs (banks etc)and NDIs (insurance companies etc) have lost their muscles - and tens of billions of dollars too; 5 Land of the Rising Liabilities: how Japan's famous savings pot is in trouble and how Japan's aged are putting a big strain on her resources; 6 The Japanese bond market: how it doesn't share up to intenraitonal standards, even thoguh it is now the world's biggest; 7. The Asian Contagion, self explanatory + two smaller chapters to round it off. The end result is Prof Hayes eases you in to Japan's problems and Japan's logic and shows how it is at oods with the Big Bang reforms. All and all, you will earn a lot from this cleverly crafted book. Buy it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    }
]