[
    {
        "Title": "mah jong handbook",
        "description": "Master the game of Mahjong with this must-have game strategy guide for Mahjong beginners and enthusiasts. Originally played with cards, and then piece carved from ivory or bamboo, the Chinese game of Mahjong or \"Mah Jongg\" is well over a thousand years old. Said to have originated in the court of the Emperor of Wu, for centuries Mahjong remained a diversion exclusively for the royal class of China. Mahjong has been called \"the game of a hundred intelligences.\" When played by experts it can be fast and subtle-even difficult to follow. A Mah Jong Handbook is the all-comprehensive Mahjong guide, offering a clear and concise introduction to the classic Chinese, Western, and Japanese rules of the game and outlining its many variants. A great way to learn Mahjong-it presents the complex rules in a clear format, introducing those unfamiliar with the game to its rules and techniques. It will also allow more experienced players to expand their understanding of winning strategy quickly. Part One covers the rules of the game. Part Two provides alternatives, variations, and additions to the game. Part Three explores the fundamentals of successful strategy. With illustrations of sample hands, scoring charts, and a glossary of terms, A Mah Jong Handbook is an invaluable resource-a complete guidebook to the ancient but always fascinating game of Mahjong. This Mahjong guidebook includes: 176 page, full-color book Play basics like scoring, wall-building and rules Essential tools to improve and enhance game-play skills Winning strategies to be on the offensive and play defense Tips to master the game through actual examples and scenarios A Mah Jong Handbook is the book that readers will need to become a knowledgeable, confident and winning Mahjong player.",
        "authors": "['Eleanor Noss Whitney']",
        "infoLink": "https://play.google.com/store/books/details?id=jzTRAgAAQBAJ&source=gbs_api",
        "categories": "['Games & Activities']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "How many times have you wanted to play a game of Mah Jong but you you are bombarded with different rule books on the subject - each one giving a more confusing set of scoring instructions There are many times when I have encountered this problem especially when teaching newcomers the game We play using Eleanor Noss Whitney's &quot;A Mah Jong Handbook&quot; as our rules which we find of all the other books on Mah Jong the easiest and most understandable set of rules compared to all teh others which clutter the field with a multitude of sets and scoring tables that make the game a nightmare to play Her rules are Clear, Concise, Unambiguous and simple to use I use her book to teach all newcomers the game and everyone agrees that her rules are the best I show them the scoring from the other books and their examples and explain to them that there are many other variations regarding the scoring and everyone opts for the simple version without any complicationsI would heartly recomend this book to everyone if they want to get into playing the game within inside a hour of opening the book There is plain simple concise instuctions that dont confuse you with umpteen different names for the same Mah Jong scoreing handIf there is one book you should get to learn and play Mah Jong - It should be this one - You wont regret it",
                "review/helpfulness": "45/46",
                "num_reviews": 46
            },
            {
                "review/text": "A great book for anyone wishing to become familiar with all aspects of the game. Describes and illustrates in great detail all that the beginner needs to know to play. Extensive strategy sections with illustrations and scenarios show offensive and defensive techniques. The book covers the Japanese, American, and Chinese versions of the game. My only complaint is that it focuses on the Japanese, and to a lesser extent the American version of the game. Nice tables are provided for both. In order to learn the rules of the less complex Chinese game, one must read through pages of detailed text to reverse engineer the Chinese rules by removing all of the irrelevant bits. No tables are provided for the Chinese rules. It would be better to have started with the original Chinese version of the game and work up to the other two. However, the book is extremely complete, even with a very extensive glossary of terms in Japanese and English. Highly recommended book.",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "After learning the basics of Mah Jongg, Eleanor Whitney's book is the next step. Although most of the book actually covers the basics of the Japanese version of the game (along with most of the world wide variations), and the basics of scoring, Part Three, &quot;Strategy,&quot; is what moves this book to its true value. In this short, 50 page chapter are the basic, fundamental strategies which allow the raw beginner to become an informed, reasonably good player medium level player. Though this section is short, it is very dense, and bears reading several times. My own play has improved many fold by following Whitney's sound advice. I highly recommend this book to anyone who is interested in the stratigies of Mah Jongg and in playing the game as it really should be played.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is an excellent book for the Japanese mah jong enthusiast! If you want to learn to kick some ...in Japanese mah jong definitely buy this book. It is well worth the money. I think that the strategies for offense and defense are really good. It has really helped me improve my game. I have returned to the book over and over for more help. Read and learn and then immediately apply it to your game....",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "The best book there is in English on the game. Organized as follows:Part One: The Official Game.1. The Mah Jong Set2. Preliminaries3. Playing4. ScoringPart Two: Alternatives, Variations and Additions.1. The Mah Jong Set2. Preliminaries3. Playing4. Scoring5. American ScoringPart Three: Strategy.1. Luck and Skill2. Offensive Strategy3. Defensive Strategy",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is well written and organized. The writing is clear and understandable and the rules and scoring of the game are presented in a manner that makes them very easy to reference. A must have book for anyone playing the Chinese or Japanese version of the game.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Though the book is quite old. there are many good points in it, most of which would interest a beginner and get them to play more Mahjong. Parts of the book talk about a wide known rules and some forgotten ones.Clearly, a good book for any Mahjong player.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lacrosse technique and tradition",
        "description": "Publisher Description",
        "authors": "['David G. Pietramala', 'Neil A. Grauer']",
        "infoLink": "http://books.google.com/books?id=uRwAEAAAQBAJ&dq=Lacrosse:+Technique+and+Tradition&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book is a must for any lacrosse player. It covers all aspects of the game from its history, to its play.As a player one learns all of the fundamentals of the sport. Equipment, rules, plays, defensive and offensive strategies and techniques are all covered.As a coach one gets a good foundation from which to build. It includes drills and practices to follow.Table of Contents-Section I: The Game and Its History1. the game of lacrosse. 2. a brief history. 3. the rules. 4. what makes a player.Section II: Techniques and Tactics5. fundamentals. 6. individual offence. 7. team offence. 8. extra-man offense. 9. individual defense. 10. team defense. 11. man-down defense. 12. goal tending. 13. clearing. 14. riding. 15. fast breaks. 16. faceoffs. 17. drills.Section III: Lacrosse at Johns Hopkins18. the eighty-seven-year record 19. my twenty Hopkins teams.I hope that this was of help",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "This book is best for all players, beginning through advanced. The book focuses on both individual and team play. Great for coaches and players. The best Lacrosse manual I have ever read.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            }
        ]
    },
    {
        "Title": "27 men out baseballs perfect games",
        "description": "The first in-depth look at baseball's nirvana -- a lyrical history of pitching perfection. There have been only fourteen perfect games pitched in the modern era of baseball; the great Cy Young fittingly hurled the first, in 1904, and David Cone pitched the most recent, in 1999. In between, some great pitchers -- Sandy Koufax, Catfish Hunter, Jim Bunning, and Don Larsen in the World Series -- performed the feat, as did some mediocre ones, like Len Barker and the little-known Charlie Robertson. Fourteen in 150,000 games: The odds are staggering. When it does happen, however, the whole baseball world marvels at the combination of luck and skill, and the pitcher himself gains a kind of baseball immortality. Five years ago, Michael Coffey witnessed such an event at Yankee Stadium, and the experience prompted this expansive look at the history of these unsurpassable pitching performances. He brings his skills as a popular historian and poet to an appraisal of both the games themselves and of the wider sport of baseball and the lives of the players in it. The careers of each of the fourteen perfect-game pitchers are assessed, not only as to their on-the-field performances but with a regard for their struggles to persevere in an extremely competitive sport in which, more often than not, the men and women who run the game from the owners' boxes are their most formidable adversaries. Along the way, Michael Coffey brings us right into the ballparks with a play-by-play account of how these games unfolded, and relates a host of fascinating stories, such as Sandy Koufax's controversial holdout with Don Drysdale and its chilling effect on baseball's owners, Mike Witt's victimization by the baseball commissioner, and Dennis Martinez's long struggle up from an impoverished Nicaraguan childhood. Combining history, baseball, and a sweeping look at the changing face of labor relations, 27 Men Out is a new benchmark in sports history.",
        "authors": "['Michael Coffey']",
        "infoLink": "https://play.google.com/store/books/details?id=OwA6pvM8gOgC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Perfect games had always left a sour taste in my mouth since I first watched Don Larsen of the Yankees twirl one at my favorite team, the Dodgers, in the 1956 World Series. The Dodgers came within inches several times of breaking up the perfect game and winning the contest. I was disgusted when the game was over. The Dodgers hit him hard all day and had nothing to show for it. Well, since there had only been three earlier &quot;perfect games&quot; at that point, I could rack it up to a quirk of fate. But it began to become annoying when two other pitchers also had perfect games against the Dodgers (Tom Browning and Dennis Martinez) while only one Dodger, the great Sandy Koufax, had one to his credit.Perfect games seem to happen all of the time now. There have been 7 since 1981. Seeing that Bill James had written a foreword to this book, I thought perhaps I could learn more about what makes these unusual performances happen. What I learned was an eye-opener and I recommend this book to all baseball fans.First, I had forgotten that you have to be the winning pitcher in a complete game that goes at least nine innings to have a perfect game. Poor Harvey Haddix (12 perfect innings), Pedro Martinez (he came out before the game was complete), and Ernie Shore (27 perfect outs in relief). Their remarkable efforts don't count.Second, I didn't know very much about most of the games. This book filled me in. Some of the efforts seem to have been helped by players who were in a hurry to get out of town, umpires with enormous strike zones and meeting up with weak-hitting teams at the end of the season. So not all perfect games are equal.Third, some of these pitchers names didn't mean anything to me. How well do you know Addie Joss, Charlie Robertson, Len Barker and Kenny Rogers? I was glad to learn more.Fourth, there are some great pitchers who have finished perfect games. It was a nice treat to read more about them, especially Cy Young who doesn't come in for much discussion these days.The unexpected surprise in the book was that Mr. Coffey also made connections between the developments in the game of baseball and these pitching masterpieces. So I had a chance to learn more about when 60 feet six inches became the distance from the plate to the rubber, when underhanded pitching ended, and the early battles among start-up leagues. I also learned many interesting things about the development of Latin American players. You will probably have other nice surprises as well.The games themselves are described in interesting detailed ways, without becoming too developed. You find out about the close calls (3-0 counts, hard hit shots that are almost fair, balls that are snagged by lunging infielders and close plays at first) as well as the demeanor the players and fans. It's a little like being there.Speaking of being there, Mr. Coffey was inspired to write the book after taking his young son to see David Cone's perfect game in 1999. That game is especially interesting to learn about since it includes Mr. Coffey's personal reminiscences.With the all-star break coming up soon, I recommend that you read this book during off-days. I found it so fascinating that I doled out the chapters to read only one a day. It was more delightful that way.Play ball!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "One of the great things about this book is its survey of American history during the years each of these perfect games was pitched. Perhaps those that complain about the high salaries of today's ball players might benefit from learning about how earlier great players were indentured servants to greedy owners. Too bad the book was published just weeks before Randy Johnson's perfect game.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Michael Coffey has written a fascinating book about one of baseball's rarest feats -- the perfect game. Coffey is at his best when he surveys the events of each perfect game and as he identifies the place of such a game in the context of each pitcher's career. Along this way we gain delightful little tidbits and trivia, such as Cy Young walking off the mound after his perfect game, not fully understanding the significance of his accomplishment until his first baseman commented, &quot;Nobody came down to see me today.&quot; Coffey creates memorable images of superstars and journeyman alike: the beloved yet tragic figure, Addie Joss, the carousing Don Larsen, the studious and intense Jim Bunning, the talented and enigmatic Sandy Koufax, and the Nicaraguan hero, Dennis Martinez.So why only three stars? The problem with this book is that Coffey overextends when he tries to connect the perfect game with the labor history of major league baseball. The former is full of joy and serendipity. The later is dark with elements of greed, bitterness, and envy. Quite simply, the two don't mix well within the same book.But this should not stop most baseball fans from enjoying the stories behind each perfect game. Too bad this volume is already published, for I would have liked to have read Coffey's insights into the character and career of the newest member of the perfect game club, Randy Johnson.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Ordinarily I am not a big fan of sports books. But every now and again I will come across a book that piques my curiosity. Such was the case with Michael Coffey's \"27 Men Out\". This one grabbed my attention on page one and never let go. Coffey recalls, in remarkable detail, each of the 14 perfect games in major league history. More importantly for me, he manages to put the accounts of these pitching gems in the context of what was happening in the baseball world at that time. Furthermore, Coffey asseses the careers of each of the 14 perfect game pitchers. It is an improbable group. From Hall of Famers Cy Young, Sandy Koufax, Jim Bunning and Catfish Hunter to talented hurlers like Dennis Martinez, David Wells, Mike Witt and Don Larsen to mediocre pitchers Len Barker and Charlie Robertson, these gentlemen all share a remarkable legacy. I seem to recall from my reading that the odds of tossing a perfect game in major league baseball are something like 1 in 12,000!! And as a huge baseball fan, I also enjoyed reading the names of those players who were fortunate enough to be a part of these historic games. Many of these names I had not seen in many moons. There is one more noteworthy fact I will throw out as a tease. Incredibly, one rather average receiver caught all 9 innings in 2 of the 14 perfect games. Can you name him? Somehow I doubt it. I had absolutely no clue. Learning his identity is just another great reason baseball fans should read \"27 Men Out\". Highly recommended.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "street fighter eternal challenge the art of street fighter",
        "description": "\"This special 15th anniversary collection contains 2 major sections covering the expansive world of Street fighter. The Art works section showcases illustrations chosen from the series' beginnings with Street fighter all the way through to the ultimate 2D fighting game, Street fighter III: 3rd strike. The History section analyzes the series' evolution over the years with in-depth observations and information.\"--P. [3].",
        "authors": "[\"Devil's Due Publishing, Incorporated\"]",
        "infoLink": "http://books.google.com/books?id=-uQvPQAACAAJ&dq=Street+Fighter:+Eternal+Challenge+-+The+Art+Of+Street+Fighter&hl=&source=gbs_api",
        "categories": "['Comics & Graphic Novels']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "So I own both this version and the Japanese version, and I must say, I like this book. The art is phenomenal. I only have a couple of complaints, and they wouldn't have really been complaints if I didn't own the Japanese version, too.Firstly, the paper. They used magazine paper. BLARGH. I hate that kind of paper; it feels way too flimsy. The Japanese version has a nice heavy paper that feels solid (and isn't SEE-THROUGH).Second, the font and layout used in the US version just seems less professional than the Japanese version. I don't really know how to explain it, but if you see the two, you'll see what I'm talking about. Especially in the titles of the interviews. They're in huge block fonts; some of the words with outlines, some without; in like 10 different colors. It really takes away from the aesthetics. I wish they were simpler and cleaner. To be fair, the Japanese uses big block text in the title of this same area, but the characters aren't outlined - the outlines are really a drawback for the US version, IMHO - and the overall layout of the title is just cleaner.That being said, as its own book (not in comparison to the Japanese version), this is a great purchase for any Street Fighter fan. I would recommend it without reservation to anyone who likes some good ol' fashioned HA-DOU-KEN.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a must have for anyone who loves Street Fighter. As the title implies this book showcases some seen and unseen art created over the years. The book covers Street Fighter, Street Fighter II and it's upgrades, Super Street Fighter II, Street Fighter Alpha and Street Fighter III. Also included are character bios, interviews with artists & programmers, and articles on each Street Fighter game. The articles are a great read for those who want to know details like why Chun Li was given a fireball attack in SFII: Turbo and other cool trivia like that.But the fun is in the art. Capcom has some of the greatest character designs in the world and Street Fighter is one of their greatest masterpieces. Who would've thought that a chinese girl with buns in her hair or some military dude with a \"brush-cut\" would become so iconic. It was also a hoot to see some of the art from the old strategy guides I used to read constantly until I perfected that special move. I could go on and on about Street Fighter but I won't (because there's not enough room). Overall, this is a nice hunk of nostalgia to have around and don't be surprised if you end up playing a Street Fighter game after reading this. I know I did. If the goal of this book was to reignite that spark between the player and the game then it has suceeded.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "first, i would like to say that this book is awesome.However, there are two versions of this book. this version (published in January 2006) has thinner paper than the other. The other book has the same cover, same everything, BUT the quality of the pages being printed.Bottomline: get the other book listed (which is published in October) over this one.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is the most complete Street Fighter item I have in my entire collection (which is pretty impressive by most standards). Though it is an art book at heart, don't write it off as just a bunch of pretty pictures (though there is plenty of that too), this book is full of interviews, character bios, full descriptions of almost every Street Fighter game (excluding the VS series) in it's 15 year history, other Street Fighter related products and more, I really can't tell you everything that's in this book, you have to see it for yourself.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was a really good buy; it's full of stunning artwork, interviews, and full of interesting SF info. It's a must for any SF fan. The only reason I gave this book four and not five stars is because it's not a hardcover book with thick premium quality pages (as you would expect from an artbook) but a softcover book with a thinner kind of pages. In its physical appearance the book is almost identical to your standard $14.99 Brady games strategy guide (quality wise). Apart from that the book is a great buy for everyone who is a fan of the reknown fighting game franchise.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "If you're a fan of Street Fighter then you have to have this book.You get to see all the art probably ever professionally made for Street Fighter. You get to see how the series developed and the profiles of every Street Fighter character ever made. They give you an explanation on each Street Fighter game ever made. They even have a section with what each game case looked like and even different products, like statues and dolls, made for Street Fighter.Get this book!!!! Or I'll Shoryuken you!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the game",
        "description": "Classic and cutting-edge writings on games, spanning nearly 50 years of game analysis and criticism, by game designers, game journalists, game fans, folklorists, sociologists, and media theorists. The Game Design Reader is a one-of-a-kind collection on game design and criticism, from classic scholarly essays to cutting-edge case studies. A companion work to Katie Salen and Eric Zimmerman's textbook Rules of Play: Game Design Fundamentals, The Game Design Reader is a classroom sourcebook, a reference for working game developers, and a great read for game fans and players. Thirty-two essays by game designers, game critics, game fans, philosophers, anthropologists, media theorists, and others consider fundamental questions: What are games and how are they designed? How do games interact with culture at large? What critical approaches can game designers take to create game stories, game spaces, game communities, and new forms of play? Salen and Zimmerman have collected seminal writings that span 50 years to offer a stunning array of perspectives. Game journalists express the rhythms of game play, sociologists tackle topics such as role-playing in vast virtual worlds, players rant and rave, and game designers describe the sweat and tears of bringing a game to market. Each text acts as a springboard for discussion, a potential class assignment, and a source of inspiration. The book is organized around fourteen topics, from The Player Experience to The Game Design Process, from Games and Narrative to Cultural Representation. Each topic, introduced with a short essay by Salen and Zimmerman, covers ideas and research fundamental to the study of games, and points to relevant texts within the Reader. Visual essays between book sections act as counterpoint to the writings. Like Rules of Play, The Game Design Reader is an intelligent and playful book. An invaluable resource for professionals and a unique introduction for those new to the field, The Game Design Reader is essential reading for anyone who takes games seriously.",
        "authors": "['Katie Salen Tekinbas', 'Eric Zimmerman']",
        "infoLink": "http://books.google.nl/books?id=aZv6AQAAQBAJ&dq=The+Game&hl=&source=gbs_api",
        "categories": "['Computers']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Although I enjoyed this book's leisurely stroll through one man's relationship with baseball, I was disturbed by some serious screwups.First, Benson gets wrong the year Roger Maris' single season record for home runs was broken. Mark McGwire and Sammy Sosa pursued and passed Maris in 1998, not 1999. This is an almost unbelievable error. Only three seasons after the fact, a baseball author making this mistake is like an American historian writing about the original twelve colonies.Six pages later we read about the famous home run hit by&quot;a light hitting infielder named Bobby Thomson&quot; in 1951. Thomson was an outfielder and finished tied for fourth (with Stan Musial) in the National League in home runs that year with 32.Since Benson's book is built on his lifelong love of the game, mistakes like this diminish our trust even if they don't make us doubt the depth of his feeling. His sincerity seems very real, and his writing is smooth, personal and appealing.Mistakes aside, it's nice to read a baseball book by a fan who is a writer first.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is one of the best baseball books out there, for my money better than books by the likes of Bob Costas and George Will. Why? Because this is a book about the actual pleasures of the game: playing it, teaching it to children, watching and keeping score of live games, and so forth. Most books about baseball become treatises on the metaphysics of the game. This one is about the sport itself, as it is actually played on sandlots and in professional stadiums. Robert Benson writes about just a few ordinary games and a several extraordinary memories and thus avoids the tedious abstractions that infect the prose of many writers on the sport (excluding the likes of Gammons and Boswell, and a few others). There is no other American sports book quite like this one. The closest book I can compare it to would be Nick Hornby's FEVER PITCH, which is a classic exploration of what life is like for a sports fan (in this case, an English soccer fan). Benson's book does the same thing, in my opinion, for baseball, which is the highest praise I can give it.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I eagerly awaited this new release from Robert Benson, having savored his two previous non-fiction books and the prayer book he had published. At first, though, I was disappointed: I was waiting for some of his customary spiritual autobiography based on baseball themes, but did not get any. Instead, Benson charts the understanding of his life through the plot of a nine inning baseball game that he sat through at Greer Stadium in Nashville. Each chapter reports what Benson saw at the game, and proceeds to record his ruminations about his life, sparked by the events of the game. Also thrown in are several quotations from Bartlett Giamatti, the esteemed former commissioner of baseball. A word of caution: If you are seeking to buy this book for spiritual insight, you might stick with a rereading of Living Prayer or Between the Dreaming and the Coming True. But if you want to read a book for the pure pleasure of Benson's masterful prose, then you cannot go wrong with this selection; his prose gets better and better the more he publishes. After getting over my initial frustration (which was my fault; not Benson's), I read the book in one night and was very satisfied. I strongly recommend this book to all baseball fans and to fans of Robert Benson. I gave the book four stars instead of five only because I felt that when Benson applied his insights to life he became too moralistic and determinative, instead of the usual open-ended application I have come to expect from him.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The Game is a romantic novel depicting high school lovers Kristina Abney's and Jake Taylor's tumultuous attempt to find true love and sustain it. This books draws the reader into cheering for the two main characters to get past personal difficulties and ultimately win the ever challenging game of love. The Author, Erin Moore artfully sets up the story by keeping the reader guessing as Kristina, now a young adult, explains circumstances surrounding her first sexual experience. This Reader cried, hoped and finally cheered as Kristina and Jake struggle to find true love amid the rigors of daily living and personal tragedy. A great read, readers will revisit the awkward teen years and emotional upset surrounding their first love experience and wonder 'if only'.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the rookie a season with sidney crosby and the new nhl",
        "description": "Sidney Crosby has already been hailed as the NHL's next saviour. Young, bright, photogenic, personable, and a media darling, the only question that remained was whether he could handle the big time. From an international advertising deal with Reebok to a season that seems to go from triumph to triumph--with a little argument from Don Cherry along the way--Sid the Kid has proven that he already is the man. In the tradition of A",
        "authors": "['Shawna Richer', 'Roy MacGregor']",
        "infoLink": "http://books.google.com/books?id=mirlAAAACAAJ&dq=The+Rookie:+A+Season+with+Sidney+Crosby+and+the+New+NHL&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "An objective review of this book from me is impossible. But a fair one, the book more than deserves. Late in the text, Ms. Richer gives a speech, or at least an anecdote, some advice she was given as she wrote this book, on objectivity in writing: \"But objectivity ... is not necessarily a worthy goal. To be objective in the literal sense would be to remove all emotion from the coverage, and sportswriting at its best can only be worthwhile by embracing and exposing emotion and all the things that fuel it. Fairness ... is the tone you want to strive for.\" So I give Ms. Richer and her book a fair deal, but not an objective one, as I am emotionally attached to the subject matter.I lived in Pittsburgh for over 30 years and am a die-hard Penguin fan. I know the entire cast of characters in this book, what they look and sound like, including the indefatigueable Tom McMillan, Penguins Vice President of Communication, who is a major player in the story. I can hear Mike Lange's voice calling out the plays, and Phil Bourque's commentary, on the air or not. I can picture the Igloo (the Pens' home arena) with snow on it, or the rolling hills of Upper St. Clair (Ryan Malone's home neighborhood). From Molinari to Mario, Sewickley to the Steelhead Grill, whether you are from Pittsburgh or not, you too will settle into this story as if you were hearing it from a friend in your own neighborhood.Shawna Richer gained the enviable assignment of chronicling Sidney Crosby's first year in the NHL with the Pittsburgh Penguins. This is a significant season for two reasons - Sidney Crosby is not just another hockey player, and this wasn't just the mere beginning of another hockey season. Crosby, a native of Nova Scotia, was the most anticipated rookie since 1984, when Mario Lemieux was taken first overall (also) by the Penguins, the same draft in which Crosby's father was selected. The NHL was also making a debut of sorts. After an owners' lockout of the players had cancelled the previous season in its entirety, the revamped league was back for business.A new collective bargaining agreement had finally been reached by the owners and the player's union. The owners had conceded to revenue sharing which would allow small market teams to survive financially. The players conceded to a salary cap, which would allow owners to survive financially. The league would benefit from the parity that this arrangement breeds - all 32 teams able to compete with each other, year after year.League executives restructured and reinforced the rule book during the unfortunate lull. Their intent was to free the game from the stifling \"clutch and grab\" style of defensive hockey and allow for a faster, more skilled, offensive game. Showcase the league's more talented players. Give the old fans something to cheer about, and try to lure new fans to the speed and grace of the game. As a player with \"once-in-a-generation\" ability, 18 year old Sidney Crosby would be shouldered with the mantle of the \"new NHL\". From the time before he was even drafted, Crosby had been labeled as \"The Next One\", and after a full lost season, the league looked to him to win fans, old and new, to the game. Even though he didn't ask for it, the youngster understands his role and carries it out with a gentle passion as fierce as the one he brings to the ice.Ms. Richer tells the story well. The Pittsburgh Penguins, like most of the small market teams in the NHL, had been losing millions of dollars every year. Unable to pay premium salaries, one by one, their star players left or were traded. At the conclusion of the previous season, the Penguins had finished last overall. Under the new arrangements, the Penguins would be able to surround Crosby with veteran talent. And they did so, turning into a contender within a few weeks.The league literally took off and the fast, exciting pace of the games silenced every pre-season criticism of the rule changes. Crosby's season took off too, but had several unimaginable bumps. His coach was fired in December. There was a slight but sustained backlash from some fans and players against Crosby. In one six day span, both of his linemates retired, and the team was put up for sale by the owner, Lemieux. The same Mario Lemieux who was 1984's once-in-a-generation rookie was now, not only the team's owner, but one of the retiring linemates.Richer was there for everything and delivers each high and low in a straight, readable narrative. She quickly (p15) pays homage to Peter Gzowski's exemplary hockey book, The Game of Our Lives. (Anything written on the subject since 1981 should.) The Rookie is given a similar form by the author, announcing the time and venue of significant games, going through the Penguins roster with a short paragraph for each player, and weaving her experiences and inferences into the text.The book falls short of the insider's look and analysis I expected from the subtitle (A Season With Sidney Crosby and the New NHL). It seems like Ms. Richer is barely below the surface of Crosby the individual, the Penguins as a team, the \"new\" league as a whole, and Canada's reaction to all of the above. I, however, do not know what is acceptable to print about the inner workings of an NHL locker room, so it remains to accept Ms. Richer's coverage and interpretation of events.Even after the Penguins are disappointingly eliminated from playoff contention, Ms. Richer is able to keep the reader's interest with drama appropriate to the tale. How would Crosby handle playing on a loosing team? Would he be voted Rookie of the Year? Would he be able to achieve certain milestones like being named to the Canadian Olympic squad or reaching 80 points on the season? How would Sidney Crosby's first season and the \"new\" NHL turn out? You'll want to read this book to find out.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This behind the scenes book about Crosby's struggling, but amazing rookie year is very well-written and interesting. However, I did find myself grimacing over recapping what a terrible season the Penguins had, but in the end I think it was a very fine read.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I loved this book! Richer provides great detail and has a keen aspect on every situation. I couldn't put this book down and finished it very quickly. I highly recommend this book to any Sidney Crosby fan that wants to learn more about him, or anyone that thinks he is just a hot-shot in order to find out how hard he has worked for this.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "japanese baseball a statistical handbook",
        "description": "This book-the first in the English language to contain an exhaustive collection of Japanese baseball data-presents basic statistical information and listings for every Japanese professional baseball season from 1936 through 1997. The first part contains yearly breakdowns of team standings; qualifiers for batting and earned run championships; leaders in home runs, runs batted in, wins and strikeouts; all-star game results; Japan Series results; Best Nine selections; Gold Glove selections; and award winners. Sections on career records and single-season records are provided in the second part of this work. Appendices list no-hit, no-run games, Japanese Hall of Famers, and records of foreign tours of Japan by professional teams.",
        "authors": "['Daniel E. Johnson']",
        "infoLink": "https://play.google.com/store/books/details?id=gg1eCgAAQBAJ&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Dan Johnson has spent a great deal of time collecting data in English on Japanese Baseball. This book is a must for anyone interested in the history of Japanese baseball. No other book like it written in English.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Batter stats included in this book are games played, at bats, runs scored, hits, doubles, triples, homeruns, rbi, stolen bases and batting average. Does not include strikeouts, walks or positions played. Pitching stats include games, wins, losses, winning percentage, saves, innings pitched, hits, strikeouts, walks and ERA. The entire roster of players on each team is not included, only the players who qualified for the batting or pitching championship (usually 4-7 per team). Season-by-season stats including team and individual player stats. Also includes the leaders in 18 categories (including the top five in batting average, home runs, rbis, era, wins and strikeouts), MVPs, Sawamura Award winners, All-Star game results and Japan Series results (as well as series award-winners). Also includes career record holders, but does not contain comprehensive career player stats. Given the dearth of Japanese baseball statistical books written in english, this book is very informative and interesting and the best I have seen to date. I would like to see a &quot;Neft and Cohen&quot; type book in the future.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "palestra pandemonium a history of the big 5",
        "description": "Looks at the history of the Philadelphia Big 5 college basketball rivalry, from its beginning in 1955 to the present day.",
        "authors": "['Robert S. Lyons']",
        "infoLink": "http://books.google.nl/books?id=V3DTYJ0GYgYC&dq=Palestra+Pandemonium:+A+History+Of+The+Big+5&hl=&source=gbs_api",
        "categories": "['History']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "This comprehensive and compelling book makes me long for my playing days again. I never followed the Big 5 (except for ESPN highlights), but now I am a fan because of it's richness and depth. The rivalries in the Big 5 are fascinating and hearty. This book captures how deep basketball waters run in Philadelphia and how deep collegiate loyalty can be. The author has crafted a rare treat that any fan of sports, history, and life will love. If you want to read about sports in its finest, purest form, then read this book.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Having grown up in the suburbs of Philly, I have memories of going to the Palestra to watch Big 5 basketball doubleheaders on Saturday nights.For those of us who lived it, it is nostalgic book....For those of us who love the game of basketball, it is a historical account of an amazing time, with amazing players, and a passion that is too seldom seen in today's game ..",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "strength down the middle the story of the 1959 chicago white sox",
        "description": "Presents a game-by-game description of the 1959 baseball season, in which the Chicago White Sox won the American League championship.",
        "authors": "['Larry Kalas']",
        "infoLink": "http://books.google.com/books?id=CvWjuaSkf5IC&dq=Strength+Down+the+Middle+-+The+Story+of+the+1959+Chicago+White+Sox&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I grew up in South Texas in the 50's and 60's and related to the author's personal reflections throughout the entire book. I recall the White Sox and their pennant run while admitting to being a die hard Yankee fan not unlike most boys of those times without our own team to cheer for. I played many a sandlot game with my neighborhood buddies using the same broken and mended bats and decaying baseballs. I could recall my mother calling me in for dinner from our street playing fields as I read Larry's fond memories of the mongrel dog and his brother's game-winning home run. The baseball trading episodes left me wondering where my own boyhood treasures rest today. What a respite from my day ending pressures that I bring home from the office today. The day to day account of games also brought back memories of my early introduction to major league baseball by Dizzy Dean and Pee Wee Reece. I envy the author's fond recollection of sleep time radio broadcasts of his heros exploits; my experiences were relegated to Saturday afternoon television. The author nonrtheless took me back with him to where I thought I was in the room with him on those joyful radio celebrations. This book is a wonderful recall to days of joy and fun for boys and girls lucky to grow up in good family neighborhoods with caring parents and many friends. Thank you Mr. Kalas; I will read the book again soon to take me back again to a time lost for a middle-aged man with deep rooted baseball dreams.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Author Kalas has provided the reader with pretty much a game by game summary of the 1959 Chicago White Sox season. I went through the book in two sittings. The book contains too much game summaries with no real in depth information. Occasionally, he provides some nostalgic information from that period of time. I was in high school when the Pale Hose won their first flag in forty years so I am well aware of this time period and the players that were on each team's roster. The author concludes the book with a biographical summary of each player and mentions if they are now deceased. I guess I expected more. If you want to read a book on the 1959 White Sox I would suggest &quot;'59: Summer of the Sox.&quot;",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I was expecting quite a bit more from this book. Essentially every game that the White Sox played in 1959 is summarized in a paragraph or two with both highlights and lowlights. What's lacking is current interviews by the author with the men who played the game. The few quotes mentioned are easily obtainable from other printed sources.Another thing that I found somewhat annoying was the author's nostalgic trips into his own childhood. If I was interested in his little league activities and visits to Comiskey Park with his dad I wouldn't be looking for a book titled &quot;The Story of the 1959 White Sox&quot;. Enjoyed the extensive stats in the back of the book and the game chronologies but was left wondering, &quot;Is that all there is?&quot;.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "ultimate basketball nba",
        "description": "The Ultimate Basketball Trivia Book tests and expands your knowledge on the sport of basketball-from the NBA to NCAA and more! In this collection of 600 questions, seasoned basketball writer Sam Amico tests your level of expertise on all things basketball. Some of the many questions that Amico poses include: Who was the inventor of the game of basketball (called \"Basket Ball\") and how many original rules were written by the game's founder? What player scored the most points in an NCAA Tournament Game? Who was the first international player to be inducted into the Hall of Fame? Can you name the four ABA teams that joined the NBA in 1976? Every era of basketball history is represented from Bob Cousy to Chris Paul, Moses Malone to Joel Embiid, Michael Jordan to LeBron James, Wilt Chamberlain to Shaquille O'Neal and everyone in between. The Ultimate Basketball TriviaBook is the definitive test for knowledgeable basketball fans!",
        "authors": "['Sam Amico']",
        "infoLink": "http://books.google.nl/books?id=Gbj8wwEACAAJ&dq=Ultimate+Basketball+(NBA)&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "THE BEST BOOK OF THE YEAR!!!!!!!!!!!!!!!!!NBA's Greatestby John HavlicekThis book is about the greatest NBA players of all time. It is also about the greatest games. Also it tells about the best teams in the league.I think an interesting part is when Scotty Pippen told about Dirk Nowitski. Here are some words he said, `' He's definitely shown me a different dimension in the power forward game,'' said Pippen.''He's probably the only power forward that I've seen that can do the things he does being a 7 footer.''I think that people who like basketball would like to read this book. Also if someone just wants to read about certain players in basketball , and he's a legend, this would be the book for them. Finally if you want to find out about the greatest moments in basketball look at this book.I would give this book a 10 out of 10 because it is a good book to read. If you want to learn about the NBA's Greatest check here.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I always enjoy reading what other Players have to say about Other Players through out time&also who they personally feel are the Greats of the game&all the details involved.this Book is a Must for any Hoops fan from start to finish it's very detailed.cool Photos&Moments that you will never forget if you follow the game like myself.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "An awesome basketball book. I just love it. Informs one about the best players ever in the NBA, from guys like Cousy, to Wilt, Jordan, to Ewing, and Duncan to Kidd. Also, shows the best NBA duels from Bird vs. Magic, to Iverson vs. Carter. Don't forget about the best teams ever assembled in the NBA like the 95'-96' Chicago Bulls. Then, read about the best guys to ever lead their team to glory . . . the coaches. Daly, Jackson, Auerbach, Wilekns, Riley . . . you can find them all here. And finally, catch up on the best momenets ever. Remember \"Havlicek stole the ball\" and the year Oscar Robertson AVERAGED a triple-double. Well, there all here in this book.Definitely a book that all basketball lovers should own.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the joy of keeping score how scoring the game has influenced and enhanced the history of baseball",
        "description": "Discusses the history of scorekeeping from the 1840s to the present, showing actual scorecards from some of baseball's most famous games, and looks at basic and advanced scoring techniques",
        "authors": "['Paul Dickson']",
        "infoLink": "http://books.google.com/books?id=1kt-sTwdSowC&dq=The+Joy+of+Keeping+Score:+How+Scoring+the+Game+has+Influenced+and+Enhanced+the+History+of+Baseball&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Don't expect this book to teach you how to score games. The book lacks a full-size sample scorecard to use, which I would have liked. It doesn't go into enough detail about scoring; being a beginner I was flummoxed attempting to score double-switches, bunts and teams batting around in an inning. It will get you going, but if you're like me and don't know how to score a game yet, you'll be looking for more. That aside, the anecdotes and illustrations make this a fun book to read. The subtitle &quot;How Scoring the Game Influenced and Enhanced the History of Baseball&quot; is an accurate description of the gist of the book. It's less of a how-to and more of a why-to.",
                "review/helpfulness": "35/35",
                "num_reviews": 35
            },
            {
                "review/text": "Unfortunately, I purchased this book looking for detailed instructions on how to keep score. While there is a section for this, it's very brief and did not suit my needs. 4 stars however, for the informative history of scorekeeping. Very interesting and entertaining to read.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "An excellent source for those interested in the history of scoring and famous incidents involving scorers. Unfortunately, several errors relating to the scoring rules appear. Intended more for those who already know how to score than those who are trying to learn.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "The subject more difficult than it looks, mainly owing to the variety of scorecard layouts and symbols involved (all entirely subjective). But whatever the system, the scorecard should document the the game sufficiently to record the statistics of the players, and in this, the book fails. Not a word about fielding averages, e.g., but still fun.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "... I bought this book when I became my son's youth leagueasst. coach/scorekeeper. The advice that scorekeeping can become individualized to suit the needs of the scorekeeper and team led me to incorporate several techniques and created what I think was more interesting and revealing portrait a game on the page. This book reveals the many ways of keeping score and the true reason for the existence, to recreate the game on paper. The author offers baseball history and many interesting and funny anecdotes (LL Bean devised a scorekeeping method). Well illustrated, a must for all baseball fans.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you enjoy keeping score when you go to a baseball game then you should readthis book. The book follows the history of baseball scorecards from the 1800'sthrough the present day by using photographs and reproductions of filled outscorecards from actual games including the longest minor league game in history,Don Larsen's perfect game in the World Series, and Babe Ruth's famous &quot;calledshot&quot; game in the 1932 (?) World series. Along the way you will learn varioustechniques for filling out your own scorecards and hear some interestinganecdotes about score keeping (such as the Yankees Phil Rizzuttos &quot;WW&quot; notationfor wasn't watching!). All in all, the book is too short (~100 pages, mostlypictures) but nicely crafted and packaged. As a die hard scoring fan, I enjoyedthe book and the vintage photos and reproductions, but I was expecting more formy money.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I agree with the reviews already written. This is a nice book and reasonably priced, but not fully satisfying. It is an outline for an outstanding book, but it is not itself outstanding. Use it as a mid-winter meditation on the game or lend it to friends who don't understand why you bring pencil and paper to the ballpark.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought this book for help me keeping score, but really I don't feel I learned all that much. The best thing about the book is that it goes into the history of keeping score. Overall I wouldn't recommend this book.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "There are so many things that make this book interesting and fun to read. Learn how the scoring of baseball evolved over the years, and how you can create your own scoring system. I now score every game I watch...pro, little league, tv, radio, at the park and on my sofa...keeps my head in the game and lets me experience the thought and strategies coaches go through sitting on the bench. The book helps make us part of the game, without stepping on the field.Examples of the most historic games ever played are on these pages...snap shots of sports history. Books within a book...read each score card and experience the game as if it finished only moments ago.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I rarely take the time to write reviews here but when I read something this enjoyable, I have to make time. Baseball, as the author points out, is the only sport(oxymoronicly)in which the spectator can participate -- by scoring. While the title sounds trite, it couldn't be more apt. In short this is not a &quot;how to&quot;, it is a &quot;why to&quot;. And the answer is that it is such inscrutable fun. Loved it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "basketball skills drills",
        "description": "Basketball Skills & Drills is your guide to mastering the basics of basketball, including footwork, ball handling, player positioning, post and perimeter play, rebounding, plus offensive and defensive individual and team tactics.",
        "authors": "['Krause, Jerry V.', 'Nelson, Craig']",
        "infoLink": "http://books.google.com/books?id=WlFyDwAAQBAJ&dq=Basketball+Skills&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "This book is aimed at coaches who have had little or no expierence in the game of basketball. It includes all the basics of basketball and some players may benifit from it. The book is for the coach who is concerned about their players overall developement. This book will help the beginner but, it will be of very little use for the more advanced.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "Even the most experienced players will need to review basketball fundamentals if they decide to begin coaching. What is second nature for you is brand new to young players.You will be doing a better job than 99.9% of youth league coaches if you teach your young players the solid fundamentals in this book. I have coached youth basketball for many years, and this book is the first place I look at the beginning of each season.Some drills are too complex for very young players, but if you instill the basics found in the early chapters, your youthful players will reap the benefits for the rest of their basketball lives.Highest recommendation!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I found this book to be an excellent tool for running youth practices. It explains every phase of the game and makes it easy for you to pass this knowledge on to your players.What is contained in this book are rules you will use for your entire basketball career. A great reference book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I would highly recommend for any basketball coach at any level. I have been playing basketball for 30 years and found several new techniques, ideas and concepts in this book. Very well done.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Jerry Krause and Don Meyer really bring home how to teach fundamentals of basketball through progression. They break down defensive stance, passing, cutting, screening, and more like I've never seen before. The DVD brings any confusion to a halt by explaining drills and the exact sequence needed for players to fully understand how to play the game of basketball. This book/DVD combination is a must have for all coaches!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I had the distinct privilege of working for coaching legend Don Meyer for 16 GREAT summers at his Bison Basketball Camp when he was the coach at Lipscomb University. I got to meet Jerry Krause, the coach who mentored Coach Meyer on teaching fundamentals. Meyer is a master teacher of the basics of the game, but he learned a lot of it from the author of this book,Coach Krause.This book is a great tool for beginning coaches, youth coaches and recreational coaches who want to teach more than a play or two and how to run a zone defense.It is also a great reference for the serious high school coach who really wants to master teaching the essential fundamentals of the game of basketball. If the skill and how to teach it cannot be found in this book, it is not worth knowing about.Kevin Sivils - author of Game Strategy and Tactics for BasketballGame Strategies and Tactics for Basketball: Bench Coaching for Success",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the great one the life and times of wayne gretzky",
        "description": "\"For 20 years, Wayne Gretzky inspired awe in fans and opponents alike. His sportsmanship, dedication, and supreme desire to play every game to the best of his abilities will always be remembered by the millions of fans who saw him play even once.\" The Great One: The Life and Times of Wayne Gretzky celebrates the 20-year NHL career of this century's greatest athlete. From his early days as Brantford, Ontario's whiz kid, to his three games in Peterborough and lone full year in Junior with the Soo Greyhounds, from his Stanley Cup and Canada Cup glory to his years in Edmonton, Los Angeles, St. Louis and finally New York, Wayne Gretzky has epitomized the word \"hockey.\" A recipient of the Order of Canada, he has served as Canada's unofficial ambassador in tournaments around the world. The Great One includes an unparalleled compilation of #99's records of achievement and game-by-game statistics for his two decades of excellence. Expertly written and researched by hockey historian Andrew Podnieks, the book is enhanced by more than 100 spectacular full-colour photographs, some of which have never been published before. This magnificent tribute to Wayne Gretzky also includes rare interviews, anecdotes, and little-known facts about The Great On",
        "authors": "['Andrew Podnieks']",
        "infoLink": "http://books.google.nl/books?id=PR_wAAAAMAAJ&dq=The+Great+One+:+The+Life+and+Times+of+Wayne+Gretzky&hl=&source=gbs_api",
        "categories": "['Hockey players']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I bought this book for my 3rd grade son to write a paper with, and found myself completly engaged in it. For someone who didn't know much about &quot;The Great One&quot;, I am now as big a fan as my son! Tells a lot about his younger years and doesn't just focus on the goals. AWESOME",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I admire everything about Wayne Gretzky and everything he has done. But i also think Andrew did a poor job reflecting how much wayne gretzky has really accomplished. He is not just a great player , he is a great person. The book lacked certain detail and as the other reviewer said. It probably is only meant for a 3rd grade level =)",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "legends cincinnati bengals the men the deeds the consequences",
        "description": "Boomer Esiason still holds the Cincinnati Bengals record for most passing yards in a game and is tied for the most 300-yard passing games. Jim Breech is the teams all-time leading scorer in points and remains a beloved figure more than twenty years after his retirement. Cris Collinsworth led the team in receptions and receiving yards several times in the 1980sand topped the team in receiving touchdowns three times. But these great players and many others arent in the Bengals Hall of Fame, and its for a simple reason: It does not exist. That needs to change, according to die-hard fan Mark Powell. By creating its own Hall of Fame or Ring of Honor, the team would be paying tribute to its great players and personalities. But it would need to determine who is eligible and who should be honored first. Get a detailed look at one of the NFLs most interesting franchises, discover its rich history, and decide for yourself who deserves to be among the Legends of the Jungle.",
        "authors": "['Mark Powell']",
        "infoLink": "https://play.google.com/store/books/details?id=Xu2gDgAAQBAJ&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Chick Ludwig does a very nice job taking you through the history of the Bengals via firsthand looks at the players. He covers the key franchise players, even if they weren't there all that long.There is a nice summary of where they are, gametime recollections and ample pictures from his Dayton Daily News reporting trove.Evoked a lot of great memories and filled in some of the holes from the early Bengals era for me. Stofa, Cook, Esiason, Anderson, Munoz, Ickey, Gregg, Wyche and a lot of recent historyrather forgotten. There aren't many books about the Bengals but this one definitely is worth putting on your bookshelf.Now if Nflfilms would start bringing out some Bengals dvds of the Bengals 80/81/88 seasons. Need something to tide us over until they reach the pinnacle again.Thanks Chick for a great book!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book. As a life long Bengals fan I can read this book over and over. It's well written and provides lots of interesting information on the clubs greatest ever players. This book should be of interest to all Bengal fans, particularly if you are a young fan or have recently began supporting the team and have never heard of great players like Bill Bergy, David Fulcher etc...It is not very expensive and is definately worth 20 dollars",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "get your own damn beer im watching the game a womans guide to loving pro football",
        "description": "Year after year, Sunday afternoons and Monday nights during the NFL season have belonged to men. While they cheer and argue play calls, the women in their lives are relegated to beer and chip detail. It's time for these women to join the action, and Holly Robinson Peete, star of 21 Jump Street, For Your Love, and Hangin' with Mr. Cooper, and wife of NFL quarterback Rodney Peete, has written this hip, smart, cheerful guide to help them do so. In Get Your Own Damn Beer, I'm Watching the Game!, Peete shares her infectious enthusiasm for pro football and takes the complexity out of the game by breaking it down to its component parts. She explains the role of each position player, provides a rundown of all on-field penalties and referees' hand signals, and offers an illustrated guide to some of the most common plays in the NFL. She gives her take on the most memorable plays in NFL history and dishes some inside dirt-in a breezy, girl-talkin' narrative that promises to turn the novice spectator into a well-informed football fanatic.",
        "authors": "['Holly Robinson Peete', 'Daniel Paisner']",
        "infoLink": "https://play.google.com/store/books/details?id=POaTFVx3xjQC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "After reading many of the reviews on Amazon, I decided to purchase this book thinking that it was the best choice for an intro to football for women, or rather, for people who don't know much about football. Generally, when something is written about sports and \"for women\", I tend to think that what the writer really means is that they start at the beginning with no assumptions about things you already know (or should know) about the sport because women are generally thought to be less knowledgeable about sports than men are.The book has loads of knowledge about the history of football, the rules, and plenty of top 10 lists to acquaint you with players, coaches and games. There's plenty of terminology and strategy included as well. However, there's also an entire chapter devoted to football wives talking about their husbands schedules (and so on) as well as comments about how \"cute\" football huddles are and gushing over the ties to Holly's love of ice cream and the game.Over all, I would say that the amount of knowledge in the book is good for a beginner's guide. But, I would also say that if you are A)someone who likes to cut to the chase or B) not a \"girly girl\" who wants to hear about Holly Peete's childhood, family life, and lists of things that she finds cute when you are buying a book to learn about football... go with another book.If, on the other hand, you do find that heart warming anecdotes and and off topic discussions of a football player's family life do help you to stay interested in what you are reading, then by all means buy this book. That's just not what I am looking for in a book about sports.Books like this one make me understand why women may not be as interested in sports as men are. Books like this one assume that women can't be interested in a sport the same way that a man is... that she has to be convinced that sports are worth while. I'm just waiting for a beginner's guide to a sport that isn't cute and cuddly to \"appeal to women\" and, alternatively, isn't titled \"the idiot's guide to ...\". What I want is a book that respects me as a person who is truly interested in the sport *for what the sport is* but is also aware that some people just never learned about a particular sport and don't have any knowledge base that can be assumed.Holly Peete's book is definitely informative, but also has a lot of superfluous information that has nothing to do with football for anyone other than herself. I give it three starts for having to sift through all of that off topic info.",
                "review/helpfulness": "41/45",
                "num_reviews": 45
            },
            {
                "review/text": "I love basketball and ice hockey. Those I understand well. I love NFL but I understand (understood) it less. This clarified all the parts I needed clarification on and now I'm understanding it fully. Holly made this a fun read, but she knows her stuff too. Now I don't look so blank when I watch a game on ESPN on pay tv. She knows she's aiming this at intelligent women who are NFL'y challenged, so this is really well written and I highly recommend this to anyone.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "As a true b-ball fan, I never really appreciated the great american sport of football. I became more and more intrigued by the sport as I followed our Carolina Panthers to the Superbowl, season before last. Although I religiously watched all of the playoff games, I certainly couldn't hold my own in a conversation about the games. But now I have to say I believe I can. Holly, girl, you did the dog gone thing. Men even seemed to be the impressed by the mere fact that I was reading a book about football (as I found at the airport earlier this week).This book is fun, sassy and informative. I can hardly wait until this season's opener. Bring on the beer, wings and yes, even ice cream. I'm lovin' it!",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "The most dreaded time of the year for a lot of women is football season. During this time, the men in their lives disappear and attention is solely focused on \"THE GAME.\" However, for some women, this is an exciting time because they too love all things football. One such woman is Holly Robinson Peete, actress and football player's wife. A die-hard football fan from childhood, Peete has taken a complex game and broken it into an understandable guide that will not only benefit women wanting to get closer to their men, but also for anyone wanting to know more about football...and she's given it a \"girlfriend\" slant.The author pulls play lines from her famous husband, NFL quarterback Rodney Peete, includes cheat sheets, historical data, and great moments in the sport. She also includes some of her own experiences with the game, those involved in it, and a special point of view session from other football wives which I found down to earth and informative. Peete concludes with a glossary of football terms to round out this great reference book.Peete has created a wonderful book that takes the \"ho-hum\" out of football for those of us who aren't necessarily fans. The writing is light and conversational and makes you want to know more about the game. At the same time, she educates hard-core fans; all in this neatly packaged book. From the catchy title to the overall concept of the book, many women will be drawn to GET YOUR OWN DAMN BEER, I'M WATCHING THE GAME in their efforts to become more football savvy.Reviewed by Tee C. Royalof The RAWSISTAZ Reviewers",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "Good Book, not only gives technical info about plays, etc, but also gives some basic history, who's who, etc. Very easy to read and understand. She outlines the very basic (sometimes too basic) elements of offensive and defensive lines, and then talks through various types of plays. I'm a big a fan of Holly's, and thought the book was very helpful. My male friends do a double take when can I call the play before they can! Fun!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I'm a die-hard NBA fan, and could always tolerate hockey and baseball, but my whole life I was adminant that I hated football, and always would.To me it seemed boring, confusing, slow-moving, and dumbed-down compared to other sports. Every play looked the same - the ball was snapped, a bunch of guys ran into eachother and the play stopped. I once laughed out-loud in disbelief when my husband told me that football perhaps had the most strategy of any sport.I come from a football-loving family, and married a football lover, and when I heard about this book I figured it couldn't hurt to remotely understand what was going on during the many football games I'm forced to endure.This book is EXACTLY what I needed. It's not a total chick's guide but it's not purely educational either (there's a list of the top 10 football butts!). Holly Robinson Peete is obviously a real football fan (and was long before she married Rodney Peete) and she knows what she's talking about. She presents all aspects of the game clearly, intelligently, and with humor.I finished the book this afternoon, and (with shock) it occured to me that I was looking forward to this Sunday so I could watch a game and apply some of all that I learned. I have totally come to appreciate the game due to Holly's smart and clever analogies and examples (and insider info).Thank you Holly!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Veronica White, the author of \"Deadline Murder\", a thriller surrounding the Detroit Lions, a female sportswriter, and the Lions first Super Bowl win in 25 years.Like Holly, I fell in love with football through early childhood conversations with my father, an all-around athlete, who was the first black to play for his high school football team and was recruited by the Negro Baseball League.Although I have been following football for years, Holly's book has provided me with wonderful knowledge of the inner workings of the sport, both on and off the field.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is adequate for complete novices, its intended audience, IF you can overlook Holly's exceedingly annoying potty mouth throughout the book. A little less print wasted on her luxurious media room and gameday fanaticism, and more devoted to insider info would have increased the book's value. (She alludes to political maneuvering in the sport, but does not elucidate one whit.)If you're looking for more information that's just as understandable to the novice, I recommend Howie Long's \"Football for Dummies.\" Bonus: Long delivers exponentially more info in a completely professional way, without resorting to one profanity. He answers more of the beginner's questions without boring a more experienced fan.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "My brother and I grew up collecting the minature helmets from all the NFL teams and I always watched games with my dad and brother (Go Redskins!) but I've never known much about the game. Now when I watch with my husband I ask a lot of questions, like why does the clock continue to run down even when nothing is happening?! Holly's book has answered so many questions and truly explained the game and its origins. I love all the little tidbits, like knowing about the great Super Bowl moments and legendary players. This book is easy to read and I'm giving it to all my girlfirends who refer to themselves as \"football widows\" since their guys disappear (mentally and physically) when the game is on.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I recently started dating a guy who LOVES football. I felt so left out-I understand and can talk baseball and basketball, but football has always been the one sport I could never understand. I wanted to find something to help me understand my new loves other love and Holly's book has been wonderful! It's funny, a light read and she makes football actually make sense! I can watch the game with my guy and even though I'm still learning, I'm understanding it more and more and can't wait to read more so I can share with him all that I know about the game now. (Plus, it doesn't hurt that he finds it incredibly hot that I can talk football!;)If you're wanting a good resource to learn about the sport, or just need a refresher, this book is a great fun read to help you along the way.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "game art the graphic art of computer games",
        "description": "A comprehensive guide to computer game art includes some five hundred full-color examples from the most popular games, tracing the history of the art form from such early pioneers as Space Invaders and Pac-Man to such advanced designs as Tomb Raider, Everquest, Diablo, and others.",
        "authors": "['Dave Morris', 'Leo Hartas']",
        "infoLink": "http://books.google.com/books?id=oE3hAAAAMAAJ&dq=Game+Art:+The+Graphic+Art+of+Computer+Games&hl=&source=gbs_api",
        "categories": "['Games & Activities']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I've never been an avid computer games player (wrong generation, mostly), but their progressive development, and especially the continuing quest for verisimilitude, fascinate me. I remember when Asteroids and Pac-Man and Space Invaders first appeared (in the lobbies of movie theaters, when &quot;arcade&quot; still meant pinball), and how addicted my adolescent kids quickly became. But that level of 2-D was nothing, of course, compared to the MYST series and to god/simulations like SimCity 3 -- not to mention keyframe animation and real-time interaction and detailed storyboarding that wouldn't be out of place in Hollywood. This is the first book I've seen that really gets into all aspects of video game art and design (there wouldn't have been enough to say even a few years ago), and it succeeds nicely both in its glossy-paper graphics and in the discursive text, which includes numerous interviews with designers.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is far more than a book of glossy game art pics, and certainly not a coffee table prop. Appropriately the book has a number of layers and themes which together provide an absorbing insight into the history of computer games. The text is free from the gushing sycophantic praise that blemishes many of the genre art books. Instead the authors produce a clear categorisation of games with illustrations in support. Comments from game designers are likewise intelligent, thoughtful and devoid of self agrandisement. What the reader gets is a book of useful illustrations, clear game categorisation by features, useful insights into game creation and an indication of where the genre is probably headed. Overall there is a subtle intellectual tone to the book which makes it both a pleasure to flick through but a much more profound pleasure to read.If the book as any underdeveloped theme it is arguably the absence of game postmortems. What went right? What went wrong? This would have rounded out the book very nicely. However, if you are interested in game design and the role of art in creating various immersive experiences, then this is a book to buy and revisit from time to time.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Game Art by Dave Morris and Leo Harris is one of the best ways I have found to learn about the history of video games. There are great drawings and pictures of many different games from Pong to Halo. This book has a lot of great information.There is a whole section about a game called Fable, which is the second most popular on X-Box. Fable allows the player to make choices and each choice leads to a different destiny. It's possible to take over the world and rule with an iron fist or you can save it. This is somewhat like the book, The Pearl, because the main character must choose between the pearl and his family. In this book, the pearl represents greed and evil, and the family is happiness.Overall, this is a nicely done book. I would recommend it to anyone that likes video games, or wants to know more about them. This is not just a book with a lot of pictures. It's like portal that shows you about lots and lots of video game and information for every one.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "undefeated untied and uninvited",
        "description": "In 1951 the University of San Francisco football team (the Dons) went undefeated and untied. Yet, despite being among the best college football teams of all time, the squad was not invited to play in a post season bowl game because two of its players were African-American. The team was offered the chance to compete without the players, but they unanimously refused on principle. \"The story of the 1951 University of San Francisco football team is a remarkable tale. I heard Pete Rozelle talk about it many times. It is a story that transcends football into the realm of the human spirit. I know it made a lasting impression on Pete, and the team clearly had a major impact on the NFL.\" -Paul Tagliabue - NFL Commissioner",
        "authors": "['Kristine Setting Clark']",
        "infoLink": "http://books.google.com/books?id=rgazoQEACAAJ&dq=Undefeated,+Untied,+and+Uninvited&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Kris Clark wrote a sincere and truthful version of a story that has been told to me numerous times by my husband, Gino Marchetti.The loyalty of these teammates is something to be admired, and that loyalty exists to this day. When Gino and the guys meet----the years melt away. It is wonderful to see their story in print and to remember the football years at USF.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book has a &quot;Field of Dreams&quot; and &quot;It's a Wonderful Life&quot; feel to it due to the courageous selflessness and undaunting unity displayed by the players on the unbeaten University of San Francisco gridiron juggernaut. I am also delighted to see a book about some of the great and often unheralded teams of the old Catholic Conference of California.My cousin Fran Hare played three times against USF, including the brilliant 1951 squad led by the running heroics of the incomparable Ollie Matson and the defensive excellence of Gino Marchetti and Bob St. Clair. Fran's older brother, the late Vern Hare, was on the 1948 Santa Clara team which upset Oklahoma in 1948. He was a teammate of the great Hall of Fame end Tom Fears, who played both at Santa Clara and UCLA.When I lived in Los Angeles and was a sports editor I talked to all kinds of people associated with Loyola football, a school which put on the field stellar future pros such as Gene Brito, Skippy Gincanelli and Don Klosterman. Loyola had a great team in 1950 which lost only one game, a 28-26 upset at home in Gilmore Stadium against Santa Clara.Yes, and there was also St. Mary's located in the San Francisco suburb of Moraga. In the thirties the Gaels had one of the nation's premier football coaches in Slip Madigan. In perhaps the school's finest gridiron hour, the Gaels defeated USC in 1931 at the L.A. Coliseum, 13-7, the only blemish on Howard Jones's team's record as the Trojans recovered from that reversal to win the national title with what historians called one of the premier college teams of the early era.The competition was intense and many of the players from these schools went on to National Football League glory. What galled a lot of us was that many of these players and their schools failed to receive the national credit they deserved. This fine book detailing a superb team from a richly endowed grid era corrects that aforementioned deficiency. The recognition is highly deserved!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "As a USF alum, I was familiar with the 1951 football team. When I first announced to my dad that I was going to the University of San Francisco, he responded with, &quot;Burl Toler, Ollie Matson, Gino Marchetti, Bill Russell, K.C. Jones.&quot; Over the years, I have had the opportunity to meet some of these gentlemen, their teammates and classmates. I was excited when I first heard about this book. The &quot;word of mouth&quot; history would finally be documented. In most instances, the spoken word has a tendency to be exaggerated. However, as I read about the feats of this team, I discovered that the words never adequately addressed the accomplishments of these gentlemen. I have observed first hand the cohesiveness that is the hallmark of this team. They like each other and that is the one attribute that is stressed throughout the book. Their admiration for each other is evident. They were a unit that worked together to carve out their own niche in the annals of history. They achieved what the rest of the country in that era could not fully comprehend - equality, humanity. Most of the story is a compilation of the news clippings which may disappoint some readers. However, for this reader, it was an affirmation of the reality. When I finished the book, I smiled a bit broader and stood slightly taller. I am so proud to be a USF alum and to know that those who preceded me at the University were men of honor, morality and courage.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Kristine Clark has captured the spirit of a football team that stood up against the racism of the 1950's and said &quot;NO&quot;,to theBowl Game invitation that predicated it's bid on leaving the twoblack players behind.This true documentary should stand as amonument to those players on the 1951 UNIVERSITY OF SAN FRANCISCOfootball team who put their principles against racial discrimination before their individual athletic careers. Theauthor brilliantly brought out the unknowing effect that thisdecision would make on the rest of their lifes.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "Run - don't walk - to the nearest bookstore and get your copy of this dream of a book. Kristine Setting Clark's latest is not only a great read, it's an inspiration...and a reminder to all of us living in these troubled times that each moment one of us bravely steps forward and takes that seemingly lonely High Road, that he or she not only models the heroic, they relight the fire in our hearts that events in this world so often extinguish; even 51 years down the road. A must-read.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I read this book in one sitting. I could not put it down. It covers the end of a forgotten and lightly regarded era of college football. In the 16 years between 1936 and 1951 five independent California colleges (Santa Clara, St. Mary's, College of the Pacific, University of San Francisco, and Loyola University of Los Angeles) ranked in the Associated Press top 20 a total of 11 times. Santa Clara won two Sugar Bowls, an Orange Bowl and was the only team to defeat Bud Wilkinson's 1948 Oklahoma juggernaught. The 1949 COP team had a backfield of 3 future pro players (Eddie Le Baron, Eddie Macon, and Tom McCormick), was undefeated over an 11 game schedule, and averaged 52 points a game. The 1950 Loyola team put 7 players into the pros including Gene Brito (a defensive end for the Redskins, Richard Nixon's favorite football player, and an NFL Hall of Famer). But the crowning achievement of the era was the 1951 USF team. And this book is about them.No other college team in history even comes close. Ten players made it to the NFL. Three are in the NFL Hall of Fame: Ollie Matson of the Cardinals and Rams and the only man other than Jim Thorpe to achieve All-American in football and win an Olympic Medal in Track and Field, Gino Marchetti of the Colts - the greatest defensive end of all time, and Bob St. Clair the greatest tackle in the history of 49er football. If this team had been named Oklahoma, Notre Dame, or Florida State they would still be singing songs about them.But the real story in the book is about courage and integrity.The football program at USF was in danger of being discontinued because the small Jesuit school could not afford the cost of maintaining a big time football enterprise. A bowl bid might have saved the program. But even though the team was undefeated and untied no bowl bids were going to be offered unless the two black players on the team stayed home. This involved the contemporary racial politics of the South. The school and the team declined the condition and the next year USF dropped the sport.Kris Clark has done an absolutely beautiful job putting this book together. It is well written, wonderfully researched, and engaging. I really recommend this book even if you are not much of a sports fan. The story and the characters will stay with you forever.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is easy to read and is organized chronologically with some background on the school and the program and then a a game by game rundown of the magical '51 season for the dons.The book uses newspaper clippings to summarize parts of the season and some great photos of the games and programs are also part of the book.The book indicates that the dons were excluded from a bowl bid more by the color of two of their stars than by a weak schedule and that the team decided to accept this rather than play without members of their team.If this is accurate, they are heroes for their integrity and not just their athletics.The book tells a wonderful story of one of the teams that was truly great and that few fans have ever heard of. It also will give you a trivia question that will stump most of the experts: What is the only college team to ever have three members in the hall of fame?",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the complete idiots guide to understanding football like a pro",
        "description": "Discusses the rules and lore of football along with information on the players' positions, coaching, strategies, the impact of television on the game, and the joys of being a football fan",
        "authors": "['Joe Theismann', 'Brian Tarcy']",
        "infoLink": "http://books.google.com/books?id=ghYCAAAACAAJ&dq=The+Complete+Idiot%27s+Guide+to+Understanding+Football+Like+A+Pro&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Duh, He talks to you like you've had a concussion.This book seems OK at first, but after reading through the first few pages I discover how immature Thiessman's writing is. Half the time he either talks to you like a three-year-old or like your an NFL Play Coordinator.It does explain some misconceptions but for the most part is either insultingly stupid or flatulently complicated.&quot;YARDLINES: These are the long white lines running accross the field with numbers on them.&gt;&gt;&gt;&gt;Thank you, Sherlock Holmes.&quot;ENCROACHMENT: This penalty is defined when a member of the offensive line enters the neutral zone.&quot;&gt;&gt;&gt;&gt;What the hell is the neutral zone? There is no previous explanation.&quot;To execute this play have the quarterback snap the ball watching for a blitz, and looking for an open wide reciever in the red zone, but prepare himself for a rush.&quot; &gt;&gt;&gt;&gt;Huh? Can I get this in English?",
                "review/helpfulness": "21/33",
                "num_reviews": 33
            },
            {
                "review/text": "I'm hesitant to be seen buying, never mind actually READING, any book that's for &quot;Complete Idiots&quot;. But, I bought this book, and I read it, and -- cool, I now understand football.The book starts with the absolute basics. How big is the field? What's a &quot;down&quot;? How many players are there on a team. That sort of stuff.The book quickly progresses into more detail. You learn the responsibilities of each position on the offense and defense. You even get some reasonable insight into offensive and defensive strategies. You get the jargon. You really understand the game.All through this, Theismann keeps the tone light and pretty amusing. He writes very well (though, I've gotta say by way of very minor critisism, that the writing could be better edited).If you didn't play football in College, and you want to understand the game better, this is definitely the book for you. It was for ME. Even if you're NOT a Complete Idiot.",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "Even though I've been watching football (on TV and in person) for a couple of decades, I knew there was a lot I didn't understand. Never having played the game above the playground level, I never really learned the roles of different positions, and didn't understand the depth of planning that goes into designing an offense and defense.Theisman and his co-writer Brian Tracy certainly know both the big picture and the intimate details of football. They've also found a clear writing style and organization with which to make their presentation. From the very basic rules of the game to more complex dissertations on players' roles, play construction and coaching strategies, the authors provide concise, useful information. Theisman's asides about players and game history provide good context and will enhance your appreciation of games that you watch.Football experts may not glean much from this book, but even those who've played (or play) the game may find it useful to read up on other positions and areas. Those who are new to the game or just passing fans will find this to be very educational.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I agree with the previous rec - i bought it and enjoy it even though I already know and love the game. it has a lot of historical, anecdotal information about the game.Mr. Theisman's humor and ego, however, get old quick. The problem with the book is that HE treats you like an &quot;idiot&quot; and he never misses an opportunity to talk about his awesome intelligence and capabilities and Superbowl championship.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "I found this book funny and entertaining. There are idiot proof diagrams and easy to understand concepts. Joe Theisman teaches you lots of things in this book. I loved it and I'm sure you would love this book too.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Joe Theismann a former Q.B for Notre Dame and Washington Redskins and now a espn commentator knows everything about football. He uses his skills in football and writes about it. He talks about everything from what a touchdown is to five parts of coverage. This book is exellent for idiots all the way to heisman.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "romo my life on the edgeliving dreams and slaying dragons",
        "description": "Off the field, Bill Romanowski was a caring father and devoted husband. On the field, Romo was unstoppable, terrorizing the NFL for sixteen brutal years. Some players called him a throwback, some called him mean, some called him dirty. But they all respected him and would much rather have played with him than against him. Coaches loved Romo for the heart and soul he gave to the game. He was rewarded with two Pro Bowl appearances and four Super Bowl rings, but it all came at a heavy price: dozens of concussions that have led to dizzy spells, memory lapses...and questionable choices that undermined his integrity. Would he do it all over again? Romo the intimidating linebacker would in a heartbeat. Bill Romanowski, however, would do things differently today.",
        "authors": "['Bill Romanowski']",
        "infoLink": "http://books.google.com/books?id=zm6lkRFD3qUC&dq=Romo:+My+Life+on+the+Edge--Living+Dreams+and+Slaying+Dragons&hl=&source=gbs_api",
        "categories": "['Biography & Autobiography']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The Medium-Sized Train That Could.\"I think I can, I think I can\" is a theme that comes to mind. \"Romo\" is like most sport auto-biographies: It's a quick and simple read. Plenty to get out of it, if one was a little inquisitive to begin with. You find out things you didn't know before reading, but were latently curious about. In \"Slaying Dragons and Chasing dreams\" you can learn more about the life and tenacious inner and outer drives, of Bill Romanowski.Romanowski's drive, determination, and focus, began early, like most professional athletes. One of the first motivating factors that influenced him was a \"Sport Illustrated\" article about Herschel Walker's workout regimen that he read in the early 1980s.After high school, he received scholarship offers from some big-name schools and chose Boston College.While his teammates at BC were chugging beers, Romo was chugging milk. While his team-mates were up late partying, Romo was sleeping for rest and recovery, which to him, (and correctly) was just as important as training. When drafted into the 49ers, the book suddenly turns to the nutritional, supplemental, and intense physical and mental aspects, of the ultra-competitive, NFL.Romo focused on keeping his body in the best shape nutritionally and physically as possible. During the mid and late 90s, he educated himself about vitamins, supplements, and Eastern Medicine, much more so than most other NFL players.Interestingly, one of the factors that motivated his hard-core intense training ethics, diet, and nutrition, was: fear.The fear of being cut. The fear of younger players who were faster and stronger that came into the league every year. The fear of knowing that in a split second, your career is over because of an injury, even in practice. He noted how many NFL players conceal injuries from trainers and team physicians because of the fear it can undermine their market value.NUTRITION AND SUPPLEMENTS:The most interesting aspect of this book for me was his self-education, research, and consultations with doctors, nutritionists, and trainers on: vitamins, minerals, anti-oxidents, hormones, Bach Flowers, food, natural Chinese herbal medicines, Trauma IVs, daily massages, and oxygen chambers. He did consider the possibility of drinking his own urine for the nutritional benefits.Also noted in \"Romo,\" is Bill Phillips of the EAS supplement company and Balco's creation of the natural ZMA, a Zing and Maganesium mix.TRAINING:One of his top priorities - a fixation on survival in the NFL and staying in the game he loved - was staying healthy. Being in the best physical shape possible. Optimal training, nutrition, and keeping the mental edge.Interestingly, it seemed that for an NFL football player his weight training methods were not up to par. One example, is that he didn't do squats, but did leg presses instead, (because of previous back problems) until persuaded to do squats again. Rep. ranges were changed from High reps, to low reps to maximum failure.SPEED:Speed: all-important, in the NFL.His speed workout focused on acceleration and speed endurance. After carefull research and exhaustive training Romanowski was actually *faster* in the 40 yard dash in his 30s than he was at Boston College.Near the end of the book the daily physical struggle with concussions, soreness, and basically -beatings - what football is about, began to take it's toll.How many players have lasted as long as Romanowski did? 16 years. And, without missing a single game.Other things explained in the book for example, is the \"spitting incident\" caught live on Monday Night Football, with picture perfect clarity due to high definition TV technology.The Marcus Williams career ending assault, and why many in the NFL consider Romanowski to be a \"Dirty Player.\" Sometimes he was....a dirty player. Squeezing testicles and breakin fingers while players are stuck in the bottom of a pile. Cheap shots in practice.Like most auto-biobraphies it is at times, self-serving. It is worth the read.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "I'm not sure why anyone would put down Bill or this Book. I thought it was one of my best sports reads this year and I've about read them all. Bill makes it known he was an aggressive player and it showed on the field and in the book. Hey, it's FOOTBALL......Great insight into the life of a great player. I have turned all of my friends on to this book.Bill write a follow-up soon",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "Some of this book does not come as a surprise: everyone knows Bill Romanowski plowed through other players during his 16 years as a pro linebacker in the NFL. And many suspected he had some kind of chemical help. He was too aggressive, too buff and downright too mean. Testosterone alone cannot take you to where he was!The juicy part of the book is his candid exploration of drugs that could help him perform better. There are no holds barred here--you get to hear it all. It's startling that he tried so many things and yet stayed \"under the radar\" from the media--unlike Jose Canseco.Though I liked the gossipy style of the book, and the candor about how these men are so heavily pressured to perform, the part about \"fear of failure\" was a little hard to swallow. Okay, maybe he did have that. But the angry, aggressive, mean way he played does not just come from that. To some degree, he's a brute. At least this sports book is interesting! So many of them have too much replay of games (el dullo to read) and too many stories that are just for the hardcore sports fan. This book has action and surprises beyond the locker room that make it good--or at least good enough.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "If your looking for a memoir focused on football stories that revolve around games, practices, and office politics between management and the players, this is not the book for you. Romanowski focuses nearly exclusively on the physical preparation required to play in the NFL and more specifically, play for a long period of time.In fact, Romanowski provides even a narrower look than that by only occassionally discussing weight and speed training and insted focusing nearly exclusively on nutrition, supplements, recovery methods, and the selfishness required by him that he believed neccessary to operate at a competitive level. This provides the reader with a unique insight that elevates this book beyond the typical cliche-ridden, ego-centric memoir of most professional atheletes.As a long-time weight trainer, I found his insight on fighting inflammation and his recovery methods very interesting and worthy of attention. I have put several of his suggestions into play and have already benefitted by decreasing my recovery time.I also enjoyed Romo's honesty regarding his sharing game experiences where he admits being beat by his opponents and his mea culpas when behaving badly.Is this a book for a 13 year old? I would suggest not, is it book for a parent of an aspiring athelete, I believe its a great book for that target audience.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Bill Romanowski's autobiography is often looped in with Jose Canseco's as party tales from the big leagues, but the two athletes really have little in common. What will strike the reader as obvious is that Romanowski possesses a Spartan disposition while Canseco was a Madonna loving celebrity. The famous linebacker was very much a purist who absolutely loved the game of football, and much of the pharmaceutical memories sprung from a desire to remain a player. The major number in this story that determines much of the plot is \"4.8\" because that's what Romanowski ran for scouts in the 40 yard dash at the combines. Despite his excellent career at Boston College, I remain amazed that a guy that slow could have ever been in the NFL. It is a testament both to his dedication and desire. Romanowski is a true obsessive who, if he can't be serious about something won't bother doing it at all. His dream in life was to be in the NFL, and he put every once of energy and ability into making it happen.Some of his tactics, of course, crossed the intensity line as he degraded other players and committed acts of horrendous sportsmanship. I truly believe such behaviors were totally unnecessary, and I agree with Shannon Sharpe that apologies running for 16 years should not be given any credence. However, his participation in the NFL was more a medical that attitude miracle. Romanowski took every sort of drug available to ensure that he was capable of suiting up. Indeed, his last season, he was given painkiller injections before every game. The irony about the situation is that the linebacker really was a health nut who treated his body like a temple-when he wasn't taking all kinds of drugs, IVs, and controversial live cell injections. It is important to note that Romanowski was never a recreational drug user, however. It was all done with his job in mind and his need to stay competitive in a league he was too slow to play in from the beginning. Regardless of how one may negatively judge the means, the results were amazing. He is a living testament to the way in which Will affects life. His accomplishments are amazing. The man has four Super Bowl rings and will remain a legend until he dies. The only tragedy was the concussions. The damage to his brain is forever and its impact will only get worse. Already, his sense of smell and taste are almost completely gone. Did he paid too much for glory and riches? He'd be the first to say he didn't.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "I loved this book because it was more of a struggle for identity, than it was about someone who was insane for a couple hours a day, and a few on Sunday. Everyone will read this book because they want to hear about the crazy hits and the lengths that Bill Romanowski would go to for the benefit of himself and his team. But at the heart of this story, understand this is a person who feared that one slip up or bad game would cost him his career and future. Anyone who thinks that Romo wasn't the hardest working guy in the NFL during his tenure is insane and knows nothing about football. Although he dabbled in some questionable methods of training and helping his body, Romo put in blood, sweat, tears, and many concussions to be the best. Once his career was over, he used his drive for football and put it towards his famiy. From many other books I have read about star athletes, I have noticed one difference. Bill never consumed his life with many off the field guilty pleasures, such as drugs, affairs, and alcohol. This book shows someone who is ultimately trying to find himself after putting his entire life into the sport of football.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "A good book, but not a great one. Romanowski has written from his heart and that's what appealed to me. The journey of his life so far is all about him - no bashing or tattling on others. He has an incredible amount of drive that's inspiring and he's constantly trying to improve himself. Interestingly, his motivation came from insecurity, and it seemed to me that he wrote the book partly for his own emotional therapy. There's a lot of good nutritional information for active people of all ages, but as a whole, the book might be of more interest to a high school or college level reader and/or athlete.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "\"Romo\" is an interesting enough read if you're into getting to the root of someone's supressed problems that play out in real life.Yes, I get that Romanowski was driven by a fear of failure -- not a hard human concept to relate to -- and that's part of what makes this book a compelling read because we get the hindsight perspective.But I can't believe how many reviewers are calling him inspirational or worse yet, the hardest working guy in the NFL.What am I missing here? Had this guy overcome his \"4.8\" speed and physical shortcomings by simply outworking his competitors -- which is the only moral way of getting ahead -- I'd say more power to him.But this guy took shortcuts and basically cheated -- he was a human experiment who took all sorts of performance enhancing drugs to gain that edge.That's makes him a DRUG CHEAT just like Barry Bonds!No, it's NOT okay to cheat and expect not only financial compensation but adoration and respect when your card is pulled. That's the wrong message to be sending up & coming athletes.This book is indeed an interesting read, like I said, if you want to get inside this guy's head and figure out his rationale in an otherwise all-or-nothing-win-at-all-costs mentality.But it's also a bit too self-righteous to rank up there with what I'd consider great sports books because it's as equally insightful as it is repulsive.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I found this book to be well written and very interesting. Romo was clearly obsessed with being the best and not being beaten. He took this to insane heights. To the point of needlessly hurting people and by the time he got to the end of his career he had built quite a legacy of \"cheap shots\" and verbal abuse. What I found most interesting was his study and practice of \"repairing\" and preparing his body. Obviously he is a very intelligent man and I am fascinated by what he was able to accomplish",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I followed Mr. Romanowski from his rookie season with the 49ers.He was always intense,and fun to watch.He tells his story well.I liked his brutal honesty.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "think to win strategic dimension of tennis the",
        "description": "A Davis Cup winner and Pepperdine coach has written the first book on the strategy and mental dimension of the game since the bestselling The Inner Game of Tennis.",
        "authors": "['Allen Fox']",
        "infoLink": "http://books.google.nl/books?id=Lpbr-13lx7sC&dq=Think+to+Win:+Strategic+Dimension+of+Tennis,+The&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "I'm not fond of tennis books that tell you all about grip and how to swing the racket for top spin, slice, etc. You can't learn that from a book. It's like reading a book on how to swim the crawl. And besides, that's boring stuff that takes up the majority of every banal tennis book. This book is so very different. It doesn't mess around, but tells you that, when the ball lands here, you've got these options, etc. And it goes into detail, with illustrations, letting you know why, based on physics, that certain shots are low percentage shots. There is a wealth of info on net play, baseline play, approach shots, all with a concentration on placement, instead of racket swing. If you have the ability to play and be competitive, I suggest this book.",
                "review/helpfulness": "49/49",
                "num_reviews": 49
            },
            {
                "review/text": "This book is ideal for those of us who have the strokes; however don't know what to do with them. The ideas of keeping the ball crosscourt, attack down the line, keep the ball in play, utilizing your strengths and weaknesses, as well as information on strokes can only help a player improve. My success rate in turning matches into victories has increased tremendoulsy since applying the ideas. Most coaches and players mainly concentrate on strokes which are important; moreover this book tends to avoid situations which can cause potential problems down the road. I have worked hard on my game over the years with mixed results; however I know realise if you do not use strategy properly it all does not work! Rarely do coaches teach this information to players as one parent put it &quot;...all we ever get is forehand and a backhand &quot; I feel more coaches should be aware that progress is a lot more effective when strategy is taught. The results of the players that I h! ! ave coached have improved immeasurably since applying these principles; the game is easier to handle! Fox looks at it from a players perspective who needs direction-there are a lot us around-I ask the question why this information was not provided earlier! You also get advice on doubles in this book which makes it unique in both singles and doubles play. This book is for those who have the strokes. There is high level of credablity in the pages, Fox who is a former professional player, a high level college coach, and an academic writes from the battlefield. I do recommend the video version of this book as the concepts are put into practice. This one is a treasure for anyone who wants to improve from beginners to professional level players.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "Having throughly enjoyed Brad Gilbert's book, I hoped to learn even more from his former coach who shaped Brad into the world class player he was. Unfortunately this book is written in the typical how to play tennis and be better at it. There are pictures showing the different strokes and grips. It's actually not similar to Brad's book at all although it does have a couple examples of how Brad and other players used mental advantages to win matches against better players.If you are a beginner and want to read a good &quot;how to&quot; book, this would be fine. But if you already play and are looking for some useful tips from a master, this doesn't quite fill the bill.",
                "review/helpfulness": "21/28",
                "num_reviews": 28
            },
            {
                "review/text": "&quot;Think To Win,&quot; is the best book I've ever read on tennis strategy-and I've read a bunch of 'em. Allen Fox doesn't just tell you how to stroke the ball, he shows you how to PLAY TENNIS! Fox's book has done more for my game than many (too many, I'm sorry to say) years of lessons. His insights on the subtleties of court geometry were a revelation to me, and have improved my winning percentage immeasurably. Buy &quot;Think To Win,&quot; along with Brad Gilbert's &quot;Winning Ugly&quot; (who, by the way, was coached by Fox at Pepperdine) Between the two, you'll find the majority of the information you'll need to play successful, competitive tennis.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "This book specializes in strategy from a geometric point of view. This means that it helps you analyze your options and explains why an option is best. It also explains what is the best spot to recover to after hitting a certain shot. I find this very useful because the author throughly explains why. I don't often apply something to my game unless I know exactly why I am doing it. This way I won't feel reluctant or unsure about doing something. This book takes away my reluctance because the author explains exactly why what he preaches is ideal. It is ideal because he explains how what he says is the best based on angles, court coverage, and percentages. I also enjoyed the chapter on strategy of past champions and current champions such as McEnroe or Becker, and the chapter on game plans. I didn't like his advice on tennis strokes though, but it is still worth the read just for another opinion because no one knows everything. I'd give this book a 4.5 star rating and I believe it is a must read for any tennis player.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "This book very clearly explains the purposes of various shots, how to decide on a winning style for yourself, and how to construct winning points from the baseline and from the net. For a college player or old timer most of this will be old hat, but for the vast majority of intermediates who have learned the strokes but can't win against experienced players, this is mandatory reading. The diagrams are clear but they do require a few seconds of thinking and visualization; this is strategy after all.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Mr. Fox is very detailed in his explanations. His insights are very interesting, sometimes a little too scientific. He covers all the aspects of the game, from technique to strategy and court positioning. I find this book suited more for coaches than for players, although players can benefit from it, too. If you are a player, like me, I would reccomend Gilbert's &quot;Winning ugly&quot;. Although Fox was the one to coach Gilbert, I think Brad's book is more practical and it can help you win more immediately and against specific types of players.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm a clay court tennis player 6.0-6.5This book is a contribution to the strategic view of the tennis game undoubtedly.However, the groundstroke instructions are a little \"old style\" or \"antiquated methods\". Today the biomechanical research, have shown that the wrist must to be involved in all the groundstrokes, like a kinetic chain. This is the reason of the tremendous power in the modern game. Nevertheless, this book is a very \"educational book\" of the world of strategic tennis. HIGHLY RECOMMENDED.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "one great game two teams two dreams in the first ever national championship high school football game",
        "description": "For more than a century, no Number 1 and Number 2 high schoolfootball team had ever met -- until October 6, 2001 One Great Game This is the story of two teams -- Concord De La Salle, a private Catholic school in an upscale Northern California suburb, and Long Beach Poly, a proud public institution from a blue-collar SoCal seaport -- striving to achieve the same goal: the all-American dream. In this supercharged account of the first-ever national high-school championship game, acclaimed sports journalist -- and former Poly varsity football player -- Don Wallace goes out onto the field and straight into the heart of each team. One Great Game offers a rare look at the world of young-adult sportsmanship, featuring up-close and personal interviews with the team players and their families, coaches and cheerleaders, rabid fans and sworn enemies. The result is a powerful piece of sports literature in the tradition of the classic Friday Night Lights. More than a book about football, One Great Game is an engaging cultural history about twenty-first-century American life.",
        "authors": "['Don Wallace']",
        "infoLink": "https://play.google.com/store/books/details?id=mrNnKw_gjUEC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 1.0,
        "review": [
            {
                "review/text": "Don Wallace's ability to capture an essence of not only the emotions of what was truly a first in the world of prep sports, but the historical content that lead to a memorable event just a few weeks after this nation's 9/11 tragedy. The game was a temporary remedy for sports fans wanting to escape the horrors that occured in New York City. ESPN had named it one of the top sporting events in the country to watch for that week.Wallace is able to captivate an audience with his descriptions of the preparation that went into the game itself. His attention to detail as to how each schools football programs arrived at the point of their unforgetable matchup is outstanding. I am most impressed with how the book uses high school football as a metaphor for how life as viewed by those involved in the game.Don Wallace describes his own upbringing in Long Beach and the dynamics that have that have occured since he has moved away. His definitions of the suburban community of Concord, California, and how it somewhat evolves around the school with the infamous winning streak, actually makes the town sound interesting.I believe those choosing to purchase this book will realize it is more than just about one football game. It reaches more into depth of two contrasting communities, that despite the differences, are very similar. It is more about the country we live in today.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I confess I was intrigued partly because of the success of &quot;Friday Night Lights,&quot; H.G. Bissinger's classic look at high school football. However, I like Wallace's book better. While &quot;Lights&quot; drifted into long, rather dry sociological digressions, &quot;One Great Game&quot; is focused, beautifully written, and still explores--in a hard-hitting way--the fascinating contrast in two football cultures. It's an irresistible matchup: white, upscale Concord De La Salle, No. 1 in the nation and riding a 113-game winning streak, versus blue-collar, diverse Long Beach Poly, No. 2 in the nation and producer of more NFL football talent than any school ever. I was amazed at the access Wallace must have gotten to produce this book. He obviously spent a lot of times in the lockerrooms, absorbing the changing emotions and dreams of these young athletes, and he also proves himself an exceptional student of the two communities where these schools are based. It's worth the read just to glimpse into the mind and philosophy of De La Salle coach Bob Ladouceur, architect of the record winning streak, a guy who's apparently able to turn young men of good or even modest athletic ability into a juggernaut through discipline and commitment to the common goal. It's the kind of thing that's rare and makes an amazing story.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book chronicles the first-ever meeting between the #1 and #2-ranked high school football teams in America. In October of 2001, #1 Long Beach Poly, a Southern California powerhouse with a long, storied tradition, alma mater to a record 50 past and present NFL players, played host to #2 De La Salle, a Catholic all-boys school from the upper-class suburban town of Concord, CA, home of the nation's longest football (and perhaps all team sports) winning streak, which, before the Game, stands at an astounding 116 games.Prior to this game, no #1 and #2 teams had ever met in head-to-head competition, which always beggared the question, \"Who's REALLY #1?,\" since most, if not all of the USAToday's Top 25 high school teams would end up the season undefeated.Long Beach is the \"most diverse city in America,\" a sprawling city of 425,000 sandwiched between monstrous L.A. to the north, and the Pacific Ocean to the south. It has a long and rich history, much of it less-than-sparkling, where waves of immigration, first of blacks, Hispanics, and Japanese in the early part of the 20th century, then of Vietnamese, Cambodians, and Central Americans following upheavals in their respective homelands, made for a boiling brew of racial tension. Despite all this, Polytechnic High School, located in the decaying heart of downtown Long Beach, is a shining beacon for the whole community, not only as an athletic powerhouse, but as an academic springboard to prestigious colleges. in the 2001 season, the Poly Jackrabbits have perhaps their most talented team ever, with 5 players ranked among the 100 best high school players in the country.Concord, California, is a wealthy, mostly white, upper-middle-class suburb in the East Bay Area, populated by the professional, educated types who toil in nearby San Francisco. De La Salle is an exclusive all-boys school where tuition is $7,200 per year. The De La Salle Spartans are coached by a living legend, Bob Ladouceur, who since 1979, has lost only 14 games in his entire career, and none since December of 1991.The book takes two parallel stories, one of Poly, the other of De La Salle, focusing on the players, coaches, families, and overall atmosphere of each school and community, before intersecting them at the Game, which is described in bone-jarring play-by-play detail. You can almost imagine listening to the game on the radio, the play-by-play is so well-written.The Game was billed as a sort of David vs. Goliath, with De La Salle playing the part of David, traditionally undersized but winning on the basis of suberb coaching and relentless conditioning, and Long Beach Poly playing Goliath, with massive offensive and defensive lines and Division I college talent populating every skill position. However, when reading about each program, the reader gets the impression that instead of David vs. Goliath, it's more like Godzilla vs. Mothra, two unstoppable juggernauts heading toward a climactic Battle Royale. And ultimately, that is exactly what it is - simply one of the finest battles between two programs of the highest caliber in the biggest game of their lives, and possibly the lives of many others.I was very satisfied with this book. If you like football, sports in general, or just like a thrilling and consuming read, this book delivers.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "When I first picked up the book I was worried that the account would be bias toward the Poly side, especially considering it's the writer's alma mater. However, Mr. Wallace presents a fair, balanced account of one of the most anticipated prep sporting events ever. He starts off about a year prior to the game, when it was only a rumor and concludes with an action filled account of the game (portrayed play by play). Characters are well developed, and -- although I can only speak from experience on the De La Salle side -- seem to be very accurate. The introduction leading up to the game got a bit long winded at times, but outside of that the book was hard to put down. I recommend it to any fan of high school sports, as well as for people curious of how two of the most successful football programs in America opperate.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "big game small world a basketball adventure",
        "description": "Alex Wolff canvasses the globe and travels to 16 different countries (and 10 states in the U.S.) to find out exactly why basketball has become a worldwide phenomenon. Whether it's in a pick-up game on the Royal court in Bhutan, in the heart of a former female college player of the year turned cloistered nun, in the tragedy of the legendary junior national team in war torn Yugoslavia, or in the life's work of one of the greatest players to ever play in the NBA, Alex Wolff discovers that basketball can define an individual, a race, a culture, and in some instances even a country. Fusing John Feinstein's talent for finding the human drama behind sport with Bill Bryson's travelogue style, Wolff shows how the power and love of basketball extends to the four corners of the earth and engages people of all cultures, races, genders, and generations.",
        "authors": "['Alexander Wolff']",
        "infoLink": "http://books.google.com/books?id=lXPepy2Z3gYC&dq=Big+Game,+Small+World:+A+Basketball+Adventure&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "The book is a basketball travelogue that takes the reader around the world to illustrate the global nature and universal appeal of the game of basketball. As a fan of Ivy League basketball two chapters in particular stood out to me: &quot;Philadelphia: Quaker Meeting House&quot; and &quot;Princeton, New Jersey: Through the Back Door&quot;As you might have guessed, the &quot;Quaker meeting house&quot; in question is the Palestra. The first half of the chapter recounts the past glories of the building while the latter half brings to life the famous Penn-Princeton game that took place on February 9, 1999.The Princeton chapter deals with the legendary &quot;Princeton offense.&quot; It uses the context of lunchtime pickup games at Princeton's Jadwin Gym to make its points and gives a wonderful look inside the family atmosphere that permeates Princeton basketball like few other college basketball programs.I would add &quot;Big Game, Small World&quot; to a list of recommended basketball reading that includes John Feinstein's superb &quot;The Last Amateurs.&quot;",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "'Big Game, Small World' is a modern bible of basketball. The NBA has never been more popular, and just one look at any team's roster will tell you how global the game has become. At the World Championships this summer, more than thirty players on international teams will have NBA experience on their resumes.'Big Game, Small World' documents the intercontinental journey of Alex Wolff, in pursuit of his self-stated goal: rediscovering the game of basketball. From Ireland to Angola, Wolff provides us with unique and often amusing anecdotes showcasing how universal basketball has become.Alex Wolff only further establishes his already unquestioned position as the premier sportswriter in America. His prose is always clear and concise, and he never fails to get the story everyone can appreciate. His mastery of the craft is as evident in this book as anywhere.For all fans of modern basketball, young and old alike, 'Big Game, Small World' is the one piece of basketball literature you must own.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This may be the most far-reaching basketball book I have ever read. Wolff chronicles the game's impact and value in such disparate locations such as a modernizing China, the backwaters of Eastern Europe, and even within Bill Bradley's aborted 2000 presidential campaign!Since the author visits such a long list of out-of-the-way places, you would expect his prose or reporting to suffer as the book progresses. Rather, Wolff keeps the story light and full of offbeat humor, while using his sharp skills to sniff out a story. For example, the author learns much about the Phillippines' national league and even meets the country's greatest player. Yet he is not satisfied with basketball's role in the country until he wanders the streets and unearths the tale of a local's fight to build a community court.The story is broken down into epsiodes, as Wolff devotes each chapter to one of his stops. This makes it easy, should a particular subject or country interest you, to read the book slightly out of order. Yet the author does tie together many of his threads, and makes Big Game, Small World an informative look at the ways the game of basketball is shaping (and being shaped by) the world, as well as doubling as a minor commentary on many countries' natures and traditions.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "watching baseball discovering the game within the game",
        "description": "The Boston Globe's number-one bestseller is back, revised and updated for the 2008 season and presented in a new trim size. Jerry Remy's name and face are already known to millions of fans. During baseball season 400,000 or more households tune in to listen to his broadcast of Red Sox games. But many learned to love him years ago when he was traded to the Sox, earning a trip to the 1978 All-Star Game in his first year with the team. Remy hit .278, scored eighty-seven runs, and stole thirty bases that season. Injured in 1984, Remy never played another game. In 1988 he began his work as an announcer, working color commentary for Red Sox broadcasts on NESN, a basic cable channel available throughout New England and by satellite across the country. In Watching Baseball Remy explains America's favorite sport by going inside the minds of coaches and players to reveal the game within the game. He takes readers around the diamond, pointing out the positioning of infielders, what's really going on during batting practice, how catchers and pitchers call a game, the difference between high cheese and a knuckler, and much more.",
        "authors": "['Jerry Remy', 'Corey Sandler']",
        "infoLink": "https://play.google.com/store/books/details?id=a625CAAAQBAJ&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I have enjoyed Jerry Remy's astute analysis during Red Sox games for many years and anticipated that Watching Baseball would offer the same depth that he provides as a color commentator. Unfortunately the book, while enjoyable, proved to be a bit of a let down.Watching Baseball seems to be aimed at the fan who has a basic understanding of the game but may not appreciate all of its nuances. For these readers -- such as my wife -- Remy's book will be extremely helpful in deconstructing the proverbial game within the game.For those like myself who have been watching and playing baseball for several decades, Remy's book comes up a little short. In particular I found that his analysis was somewhat shallow; he would begin to get into a topic and then move on to something else just as things were starting to get interesting.While Remy provides anecdotal examples from his own playing days, I would have appreciated more emphasis on strategy. It would have been more interesting if, for example, he had picked one game from the past season and broken it down &quot;pitch-by-pitch&quot; from batting practice to the final out.The book is also very Red Sox-centric -- with a particular emphasis on the 2003 season. This is understandable given Remy's connection to the team, but a lot of his insight might be lost on a casual fan from Kansas City or Oakland or New York. A second edition of the book would do well to try to appeal to a broader audience.Watching Baseball also suffers from spotty editing (the organization is choppy and there are several typos -- as if the book was being rushed into print) and is filled with what I consider gratutious quotes in praise of Mr. Remy himself. I found the latter in particular to detract from the book: I didn't need to find a quote every tenth page telling me what a scrappy ballplayer Remy was, or what a great broadcaster he is.My final analysis: Watching Baseball is good for the casual fan who wishes to improve his or her appreciation for the game; serious fans will find the book lacking, however. Still, 3 for 5 ain't a bad day at the ballpark.",
                "review/helpfulness": "33/43",
                "num_reviews": 43
            },
            {
                "review/text": "Baseball is such a simple game. Someone throws the ball, someone else tries to hit it, if he does he runs around .... Well you know.But what's really going on. In this quite large (367 page) book, Jerry Remy, a former second baseman explains the game as the players see it. There are hundreds of little tips: playing in the rain is to the advantage of the hitter, should the cutoff man jump if necessary to catch a ball, what about contract negotiations. And of course there's the discussions about people. As a player and then a baseball broadcaster, and a chat room moderator he knows all the principals in the business/game. If baseball is your thing....",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Remy is the best. His analysis of the game and insights into why players do what they do are second to none--and he's always entertaining, too. I loved this book.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I bought this book for my son. It's a little less anecdotal and more technical than I expected. If you really want to understand the strategy of the game, this book is for you. It is light-hearted and there are also some funny baseball stories and info on the Red Sox, but that's not the main part of the book, and if that's what you're looking for this probably isn't the book for you. Overall, I very much recommend this book for those who are true students of the game, and especially for kids about age 12 and up who want insights into how to become a better player MENTALLY, or those interested in coaching. Jerry doesn't explain how to hit a fastball, but he explains the STRATEGY of the game exceptionally well.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "First off, I'm a huge Red Sox fan and have watched the Sox play hundreds of games on TV just in the past several seasons alone, with Jerry Remy as the color commentator. I like him as a commentator. He has a great sense of levity and brings good natured humor to the game. Also, he often has insightful things to say about many aspects of the game, and doesn't over-talk, although he does self-promote a bit much. So maybe I've heard Remy so much that I've already learned all he has to offer.However, to use a baseball game analogy, much of this book is filled with routine groundballs and fly balls, while you have to wait a long time for hits and runs. By the 7th inning, you need to stretch because things are getting a bit long. There's just not a lot of insight or \"discovery\" here, unless you really don't watch much baseball.The book is broken up by these \"Rem Dawg Remembers\" excerpts, separated in the text and bolded. One such is \"You don't see many great hitters that are strictly pull hitters. There have been some: Ted Williams, for example, and Barry Bonds. But they are rare.\" That's it. Is that really \"inside information?\" How about talking about David Ortiz and describing his success against the shift? A Williams story? No - no mention if Remy even ever saw Williams when he was a kid. Nothing. Hardly a homerun of insightfulness.One reviewer noted that Remy said the hitter has the advantage in the rain. Pretty much all Remy says about this is that the field is quicker when wet (no kidding) and the ball is wet when they pick it up, maybe causing errors. Hmmm... and how much does this book cost?The bottom line is that if you watch baseball even casually on every other weekend over the summer, you already know 95% of what's in the book. As for inside information, Remy doesn't name any names unless he's kissing their butts, has nothing negative to say about anyone (how can you be insightful and skip over criticism?), passes over the steriod scandal, and for whom I thought was a humble guy, devoted lots of the book to himself. What other author has quotes about himself all over the inside of the book? Maybe the jacket, but please.The best chapter was \"Hitter's Counts.\" It was the one chapter that had stats to back up Jerry's hunches and feelings. Learning Kevin Millar led the 2004 Sox with a .383 BA when ahead in the count was interesting. But if you already know \"inside info\" like that on a 3-1 count the pitcher is probably going to throw a fastball, you may end up feeling like you haven't learned \"the game within the game\" that is advertised on the cover.The last 100 pages are filled up with boxscores from the 2004 playoffs and World Series (not written at all from Jerry's point of view, but co-author Corey Sandler) and then Jerry's favorite current players, and finishes with an brief account of each of Jerry's 7 homeruns. No big deal.Want to know what it was like to play for years with Yaz? To bat against Nolan Ryan? What's the dugout like? What goes on in player meetings? Want to know inside info about broadcasting Sox games, or funny stories about being on the road? You've come to the wrong book.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "play your best nine ball",
        "description": "To round out your complete course in pool you'll find chapters on the mental game, competition and how to improve that will tell you how to think like a winner and compete successfully in tournaments, leagues and money games.",
        "authors": "['Philip B. Capelle']",
        "infoLink": "http://books.google.com/books?id=SKyUmnoda9gC&dq=Play+Your+Best+Nine+Ball&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Phil Capelle takes you inside the mind of a Pool Master as he discloses anything and everything you need to know to excell at 9-Ball. Why he even tells you how to beat players of all levels (in his chapter on strategy) without even having to improve your skills one iota, simply by playing a smarter game. But make no mistake about it, Capelle covers the toughest aspects of the game like no other book, in big chapters on position play, pattern play, kicking, safety play and so much more. If you seriously want to take your game to a new level, (and the sky's the limit) Then this is the book. Bravo Phil!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Phil Capelle has done a great justice for those who want to take their 9-ball game to the next level. He hasn't cut any corners in this definitive work. He covers all the angles (pun intended): english, throw, pattern play, safeties, kicking, competition strategy, realistic self-assessment, practice routines, you name it. What I find remarkable about this book is the completeness in which all of the subjects are covered. As a stickler when it comes to reading, my only complaint would be the odd typo here and there. Certainly not enough to distract from the rich and very useful material, however. I have read at least fifteen books on pool and none comes close to &quot;Play Your Best Nine Ball.&quot; Very well done, Mr. Capelle!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The diagrams used in this book are clear and concise. However, the explanations of the shots depicted on the diagrams are very cumbersome, with references to degrees of angles, shot ratings, and player ratings. Half of the book contains diagrams with shot routes, but no explanation as to where to apply English on the cueball. The best section of the book is the chapter on position routes The book is very comprehensive and would help pool players who are at least a B or A rating.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I own all pool books from Mr. Capelle. This one is loaded with great information about nine ball covering every aspect of the game. A must own for every serious nine ball player!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "tennis confidential todays greatest players matches controversies",
        "description": "Presents essays and interviews profiling a variety of tennis greats, including John McEnroe, Arthur Ashe, Pete Sampras, Martina Navratilova, Bjorn Borg, and Rod Laver.",
        "authors": "['Paul Fein']",
        "infoLink": "https://play.google.com/store/books/details?id=4x3fQ920EUMC&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 3.0,
        "review": [
            {
                "review/text": "Paul Fein's new book, Tennis Confidential, is a wonderful book filled with interesting facts, great interviews and profiles, accounts of his choices for the 10 greatest matches, and intriguing discussions of tennis's current and past controversies. I bought the book on a Friday evening and spent most of the next two days reading it. I found it completely engrossing.The book is divided into 6 major sections: Portraits of the Stars, Memorable Interviews, Topical Trends and Burning Issues, The Great Controversies, 20th Century Retrospectives, and The 10 Greatest Matches in Tennis History. This collection of articles, many of which won journalism awards, runs the gamut of the current players such as Venus and Serena Williams, Andre Agassi, and Pete Sampras, to the stars of the late 1970s and 80s such as Bjorn Borg, John McEnroe, Martina Navratilova, and Jimmy Conners to several of the games legends such as Rod Laver, Arthur Ashe and Bobby Riggs. Yes, there are some players missing, mostly due to space limitations, I suspect. I would have enjoyed profiles and/or interviews with Chris Evert, Steffi Graf, Martina Hingis, and Monica Seles on the women's side. On the men's side, Ken Rosewall, Stefan Edberg, Bill Tilden, and Don Budge. However, he writes about several of these players in the section on the 10 greatest matches, so perhaps I'm just greedy.Regarding the controversies and burning issues, he writes about the problems with the advancing technology in racket manufacturing, and the effect these advances have had in the power game, especially in the men's game. He also discusses such critical issues as the role parents (especially fathers) have taken in developing their child's game. He deals with most of the famous \"Bad Dads, \" only really missing the recent addition of Jelena Dokic's father. He talks about the need for the Grand Slam to be accomplished in one calendar year, why we should keep the let serve rule, the use and possible misuse of the tiebreak rule, the ranking system problems, why Wimbledon should remain a grass court tournament, the problems that occur with letting teens play early and often, the issue of equal pay for men and women, and the effect that more black players could have on the game, including the inherent problems in attracting and keeping black athletes in tennis.I don't have any complaints about the book. There are several items I might have liked to read about, but I fully recognize the limitations and choices one needs to make in such a work. One extra I would have enjoyed is a brief player update after the original profile and/or interview. Although most of these are from 1997 on, there are few from earlier that an update would have been nice. For instance, there are two interviews with the late Arthur Ashe. Many people who have become interested in tennis in the past five years or so, may not have much of a sense of his contribution. The interviews help in that regard, but it would have been nice to have a brief obituary about his death. The same would have been nice in regards to Bobby Riggs and Ted Tinling who have died since their interviews were done.Also, to no surprise, there are several matches I would consider in the last few years that could rank among the best. One, in terms of historical importance, would be the Bobby Riggs/Billie Jean King \"Battle of the Sexes\" in the Astrodome in 1973. This match helped to put women's (at least American women's) tennis on the map. In a period where the women's game is so much more vital and interesting than the men's, this match's importance cannot be overstated, even though it was nearly 30 years ago. Also, there have been three great women's matches in the last three years that I would place somewhere: the Graf/Hingis French Open Final in 1999 (I thank Paul for reminding me of this one), the Clijsters/Capriati French Open Final in 2001, and the Hingis/Capriati Australian Open Final in 2002. But these are quibbles on my part.All in all, I found this a wonderful read. I had a lot of trouble putting the book down. Anyone who appreciates tennis and good writing cannot go wrong in purchasing this book. I am a big fan of tennis and there aren't a lot of great books available. Through the years, there have been some, but not nearly the wealth as there is for baseball. Do yourself a favor, buy it, read it, tell others. Let's encourage those who write and write well about tennis. I'd love to see more by Paul Fein, and will be looking forward to more.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "As a tennis fan, especially in a family with few tennis fans, I enjoy reading outside material about the game. Not tips on playing, but about the pros, especially stories, history, analysis, etc. So I figured this book would fit right in with my appetite, especially from the subtitle, 'players, matches, and controversies.' I was right!Tennis Confidential contains all of this and more! I was excited to read about events that happened before I was around, and also enjoyed reading about events that happened while I was around, and Fein brought a fresh and inside perspective to dozens of topics. Chapters I particularly enjoyed include the Burning Issues section, in which Fein examines modern topics like power, blacks' domination, new stats, and more; Controversies, with topics such as equal prize money, women's tennis superiority, the let rule, and more; and all time top 10 matches, with many surprises, but deep analysis.No wonder my 2nd favorite sport is baseball. Both it and tennis, my favorite, invite analysis, discussion, controversy, have rich histories, and no clock. Reading this book allows me to appreciate the game more, want to discuss it more, and proud to be a tennis fan.Plus, the author is very friendly and happy to discuss his work. I met him at a tournament, and we took a picture together.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "As a former coach of several world-class players and also former National coach for the French, Swiss and Hellenic tennis Associations, I most appreciated the originality and expertise in Tennis Confidential. Pro tennis has plenty of controversies about on-court coaching, the scoring system, equal prize money, ranking systems, doubles reforms, the service let, etc. The essays analyze them with more thoughtfulness and fairness than I've seen before. Your opinions about certain issues will undoubtedly change after you read these essays. Interviews and features with Agassi, Serena Williams, McEnroe, Ashe, Navratilova, Borg, Sampras and other champions are also eye-openers. History fans will definitely enjoy the six retrospectives and the 10 greatest matches. On a light note, everyone will have fun with \"True Confessions\" and the amusing and sometimes shocking trivia that is sprinkled throughout the book. Several of the articles received writing awards. This is a book you will want to read and re-read.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Although I first read this book on loan from my local library, I will soon add this title to my bookshelf. Why? Because it passes the test of whether or not I would read it again. It's that good and it is filled with elements of tennis lore that every tennis fan will want to have access to. But beyond a list of who won what grand slam, it has the authors heartfelt opinions about where the game of tennis was, is, and will be going. Informative and thought-provoking.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "If tennis is your passion, or if you are just beginning this wonderful sport, you will certainly enjoy Paul Fein's TENNIS CONFIDENTIAL. It is filled with interesting tidbits about current tennis pros as well as champion players from the past. I especially liked the &quot;Fascinating Facts&quot; section at the conclusion of each chapter. Where else could you find out that &quot;Parents who send their children to Pat Cash's new tennis academy in Australia are required to attend behavior classes.&quot; Paul Fein's detail-oriented style of writing produced a thoroughly entertaining book and reveals his love for the game of tennis.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "The game of tennis has been in Paul Fein's cloth for many years, not only asa writer, but as a teaching pro, referee, and television commentator. He hasan insightful way of taking his readers inside the covers of his books to givethem a behind the scenes look at the world of tennis.Paul's book, &quot;Tennis Confidential&quot; is another excellent example. He providesyou with the inside scoop about Agassi, Serena, Martina, and a host of starsin full-length stories. The Q&amp;A interviews with Ashe, McEnroe, Connors andSampras are real eye-openers.Paul Fein analyzes, with unusual depth and fairness, the tennis issues andtrends in the game. You'll especially like his authoritative perspectives onthe power crisis, equal prize money and on-court coaching.History buffs are treated to the ten greatest matches in history withdetailed explanations why they were so thrilling and momentous. I gleaned lots ofnew information in Paul's 20th century retrospectives, especially that metalrackets and open-throat frames first appeared in the 1920s? Sprinkled throughoutthe book are amusing trivia and startling significa that you'll really enjoy,too.Bottom line, &quot;Tennis Confidential&quot; is a terrific read.Jim WesthallTournament Director and founder of the Volvo International Tennis, voted thebest in the world in 1987.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Paul Fein's \"Tennis Confidential\" is quite simply a `tour de force.' As a former sports reporter, editor and now documentary filmmaker, I have a professional and personal passion for this game. As such, I have read more than my share of tennis books. Seldom have I encountered a more incisive or entertaining analysis of the contemporary game, its personalities and controversies. This collection of award-winning essays and articles, gives you far more insight into the lives of the game's top figures, than encountered on television or in magazines. When you actually meet a celebrity, they are often quite different from their public persona. This book shows the kinds of interesting things, which don't get through the filter of the day's sensational sound-bytes. You will meet a funny, often witty Sampras, a thoughtful, sensitive Martina Navratilova. Kournikova, for instance, who is friendly and down to earth in person, was by all accounts an unbelievably brash kid. Fein relays a hilarious anecdote told by Gene Scott, the publisher of Tennis Week and a tournament promoter about how she was discovered. Scott, who ran Russia's first pro tennis tournament, decided to showcase Russia's emerging junior talent in an exhibition prior to the Kremlin Cup. Kournikova was so talented and cocky that as a 12-year-old girl she would serve and volley and try to peg her older male opponents with the ball. The crowds would go wild. This young girl threatened the tournament director that if she was not allowed to be on center court every single night, she wouldn't play -- period....And so the officials caved in. Anna was discovered at the event and brought to the Nick Bollettieri Academy in Florida, where she further developed into teenage sensation. As a twenty-five year veteran tennis reporter, Fein also has the experience and ability to make the past come alive. He discusses the greatest matches of all time and delves deeply into the reasons the sport has changed so much. He astutely analyses the game's trend toward sheer power and makes interesting arguments about how (and how not) to reform the game. True fans will find his brief chapter explaining the ranking system, and how it encourages players to \"tank,\" alone worth the price of the book. If there is a tennis fan in your life (or even a former enthusiast turned-off by the modern game), this is a highly informative, lucid, can't-put-it-down kind of read.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I'm a longtime tennis player and avid fan, and through the Fantasy Tennis Camp I owned in the early 1990s, I have even known quite a few tennis champions, including Roy Emerson and Rod Laver. Because of the hype surrounding \"Tennis Confidential,\" I wanted to read it. It definitely delivered the goods and was even better than I expected. What I liked most about it was its consistently interesting and often fascinating stories and interviews. In-depth interviews with McEnroe, Connors, Sampras, Ashe and others revealed a lot about their off-court lives as well as their tennis careers. Irascible stars McEnroe and Connors, for example, are devoted family men. Sampras is much more interesting than is commonly believed and cares deeply about tennis issues besides being a man of integrity and high intelligence. Portraits of Agassi, Serena and Venus, Anna Kournikova, Martina Navratilovaq and bygone champions like Bjorn Borg and Rod Laver unearth little-known but important facts about them as well as put their lives into a broader and deeper context. Few books analyze tennis controversies, and \"Tennis Confidential\" does that with considerable originality and insight, whether it's the rightly criticized ranking system, equal prize money, on-court coaching, the Grand Slam concept, etc. I guarantee you that you will change your mind on at least one controversy after reading Fein's essays. I also learned a great deal when I read the retrospectives about the evolution of playing styles and rackets, teen queens and how Open Tennis belatedly but happily arrived. If you like tennis history, you'll love the 10 greatest matches because they provide vital player context that makes the rivals and their most famous matches really come alive. This is a tennis book to savor. I read a story a day to spread the enjoyment.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I highly recommend this book. The author has a tremendous knowledge of the game but what I found most interesting is that he is a true original thinker about the game. He has refreshing and very interesting takes on a number of tennis issues and questions. Whether you are interested in the modern game or want to know about the history of tennis, you can not go wrong in purchasing this book.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Tennis Confidential is not an encyclopedia, but it IS encyclopedic. There's a lot of substance within its covers: player profiles, interviews, controversies, history, greatest matches, and even a brief history of racquet design.Fein's passionate concern for the sport is evident throughout. He writes, \"If tennis tries to be all things to all people, it will lose its brilliant uniqueness and end up being nothing much to anyone.\" His book, however, comes close to being all things to all tennis fans.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "ichiro on ichiro",
        "description": "A collection of personal and intimate interviews provides a rare glimpse into the mind and soul of media-elusive Seattle Mariners baseball player Ichiro Suzuki, from his memories of his childhood to his feelings on arriving in America for spring training.",
        "authors": "['Ichirō Suzuki', 'Narumi Komatsu']",
        "infoLink": "http://books.google.com/books?id=1Oa3wAEACAAJ&dq=Ichiro+on+Ichiro&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Ichiro recently broke the Major League Baseball record for most hits in one season, a record that had stood for 84 years. On the evening in Seattle when he had a chance to tie the record with a hit, or break it with two, he promptly hit safely his first two times up. His record number of 262 hits was nearly 50 hits better than the runner up in the American League this season.This book gives a very personal glimpse into the mindset of the man who not only has set numerous Major League records, but is a national hero in his native Japan after winning seven consecutive batting titles there. The book is laid out entirely in Q&A; format and covers his entire playing career, his childhood, little league, his move to America and his first three seasons playing for the Seattle Mariners. While most biographies tell a story, what is surprising about this book is how direct and honest he is. It is fascinating to read about the mental and physical preparation he puts into the game.Recently a Sports Illustrated writer attempted to discount his hits record. This was a huge miss. Ichiro is the real deal, a major leaguer who respects the game in every way, plays his all for the fans, and earns every hit he gets. The hard facts are that for 84 years thousands of players have failed to break that record for a reason. An amazing athlete with gold glove fielding ability, an arm like Roberto Clemente, and the ability to turn a soft infield ground ball into two bases with a single and a stolen base.This book is worth reading if you are at all a fan of the game. It is refreshing in an era of ego-maniacs and over paid prima donnas, that we have an athlete who takes his craft seriously, wants to work to earn every penny, and is humble in the process. If you are not a fan of his records, then this book will likely make a fan out of you for his professionalism, respect for the game and attitude. An unfortunate rarity in sports these days. A class act all the way.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "The superlatives are well known: hits, fielding, 3.6 seconds to first base, stealing bases - everything. Less well known is the man behind the bat. From his life in Japan, his family, the big change from living in Japan to living in Seattle.But above all this book is on baseball: how it is played in Japan, how it is different here; the relationships among the players, negeotiating salaries with the team; the consistent and unrelenting pressure from the press. Perhaps the best though is the serious analysis of the game that he gives every aspect of the game. Excellent, even if you're not a Mariners fan.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Mr. Philip Gabriel is magnificent in putting together of the most interviews Ichiro has ever had with one media member. Mr. Komatsu's questions are straight to the point, and they are easy to understand. Ichiro really opens up and really lets the reader understand how he ticks. The Sultan of Swat! Go Ichiro - 257!A great buy for the casual fan wanting to really know who Ichiro is - and for the serious fan who wants to know exactly what that skinny guy slapping singles and beating out infield grounders on the diamond is really all about.Great addition to the library! WELL worth the $30 it was on it's first day!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "can't say enough about Ichiro. He is already a Superstar Baseball Player&the scary part He is just getting started.this Book details His upbringing,His family Life&of course His Playing career. you get a really good insight to Him but believe Me there are still many more chapters left to His Great playing career that haven't been made yet.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is a fascinating set of interviews between Ichiro Suzuki, one of the world's best baseball players, and reporter Narumi Komatsu. I'm a Seattle native and Mariner's fan who has always been fascinated with all things Japanese. Naturally I'd be drawn to this book yet you don't have to be like me to thoroughly enjoy it. You don't even have to be a Mariner's fan, or a baseball fan to appreciate this excellent work. I highly recommend it.Ichiro is not only one of the game's great players but he's a classy, hard-working guy as well. It's nice to know that the guy who broke the major league single season hit record is a truly worthwhile human being rather than just another steroid freak. To illustrate his character, it states herein that he was surprised by how shabbily the American players treat their equipment. Rather than letting the staff clean his shoes and take care of his gloves, Ichiro prefers to do such tasks himself, demonstrating a greater respect for the game. I liked this book much better than David Shield's collection of media quotes and cryptic comments published in 'Baseball is Just Baseball'. In this tome, you really get to know Ichiro not only as a great player, but as a great person as well.You can learn a whole lot about Ichiro, his family, and his transition form Japanese baseball to the American system. You find out how he learned to bat so well and the game where his technique finally clicked into place (on 04/11/99). And, you can learn some practical real life wisdom from his struggle for perfection. An example quote: \"Win the MVP and everybody says you're great,\" Ichiro says. \"Everywhere you go people make a fuss over you... But once you get used to that and get carried away by it, you lose a sense of who you really are.\" Sage advice I think.Lawrence KaneAuthor of 'The Way of Kata' and 'Martial Arts Instruction'",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The book appears mostly a direct translation of Japanese version. Although I am in a previledged position of being able to understand both English and Japanese, I have not had access to the Japanese version. This seems irrelevant to most readers who would be reading this book, but my point is that at times it is apparent that the target audience is not *American* baseball or Ichiro fans. How you feel about reading about a person yet he is not necessarily communicating with you depends on the reader, I guess. Some readers may get bored about his Japanese league endeavor simply becaused the vantage point is that of an avid Japanese Ichiro fan. Yet, Ichiro would not have gone into technical discussions of hitting, for example, unless he was talking to a Japanese writer (otherwise the subtleties of what he really wants to say would be lost in translation; he even struggles to make it into words in his mother tongue anyways), so the fact that the interviewer was not an American who would have been writing for Americans may well made the book more interesting.One thing that I wish to point out is that many Americans, after reading this book, are surprised how eloquent Ichiro actually is. Most atheletes are not really known for their eloquence, so there is nothing interesting there, but for Japanese ballplayers language barrier is often the reason why they appear even more quiet. They fear of getting misunderstood using little English. Even someone like Hideo Nomo, who has been described as a sourpuss, does actually talks substantially to the media, if you can understand Japanese.If you wish to know Ichiro the baseball master in depth or wish to know a bit about the Japanese baseball, I highly recommend this book. For casual observers, the book might just be a curious read into the mind of baseball *geek* from a land where attention to subtleties is appreciated.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is an amazing book! Ichiro is extremely informative, and I have learned a lot about baseball, both Japanese and American. Ichrio seems to typically be fairly reserved, but this book let's you discover what he's like. At first I thought that a book that was basically just one big interview would be boring, but this is far from that! I highly recommend this book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "freak",
        "description": "Scrabble may be truly called America's game. But for every group of \"living-room players\" there is someone who is \"at one with the board.\" In Word Freak, Stefan Fatsis introduces readers to those few, exploring the underground world of colorful characters for which the Scrabble game is life-playing competitively in tournaments across the country. It is also the story of how the Scrabble game was invented by an unemployed architect during the Great Depression and how it has grown into the hugely successful, challenging, and beloved game it is today. Along the way, Fatsis chronicles his own obsession with the game and his development as a player from novice to expert. More than a book about hardcore Scrabble players, Word Freak is also an examination of notions of brilliance, memory, language, competition, and the mind that celebrates the uncanny creative powers in us all. A Book Sense 76 pick.",
        "authors": "['Stefan Fatsis']",
        "infoLink": "http://books.google.nl/books?id=sWueIE-gCWQC&dq=Freak&hl=&source=gbs_api",
        "categories": "['Games & Activities']",
        "ratingsCount": 30.0,
        "review": [
            {
                "review/text": "Though nothing could be as good as Leguizamo's performance in his one-man Broadway show Freak, this short book comes close. If you've seen Freak, you will definitely want to own this print version. It is not exactly the same, but it is very similiar. Outstanding!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Like Augusten Burroughs' hysterical autobiography \"Running With Scissors,\" Leguizano's family of loose screws made him a screwball, for better or for worse.At turns morose and gross, and gutbusting and bitingly real, you will transported by a family, though superficially unlike your own, eventually begins to resemble your childhood memories.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the complete idiots guide to basketball",
        "description": "\"Irreverent in approach, these guides include tips and advice from leading authoritimes, aiming to help with life's big decisions and challenges, as well as hobbies. This book should help readers how to watch and understand basketball. \"",
        "authors": "['Walt Frazier', 'Alex Sachare']",
        "infoLink": "http://books.google.com/books?id=KcIF8rb7g9MC&dq=The+Complete+Idiot%27s+Guide+to+Basketball&hl=&source=gbs_api",
        "categories": "['Basketball']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "Classy Clyde Frazier covers the fundamentals of basketball: the vocabulary, the role of each position, the basics of offense and defense, and a few common set plays. His writing is fun to read if a bit dumbed-down (hence the title). He draws examples largely from his playing days, but knows well and comments aptly on players of all eras. He draws the distinctions between college and pro ball and includes women's and high school ball, but properly focuses primarily on the NBA, where the game is played at its highest level. He shows you what to focus on when you watch a game and demonstrates how each player's skills come into play in the course of offense and defense. This book will enhance the novice's appreciation for and enjoyment of the game; from what I have read of Digger Phelps' &quot;Basketball for Dummies,&quot; I'm glad I read Clyde's book instead.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Buy Basketball for Dummies instead.In search of a book which would get me up to speed about a sport which I had never played but which my sons have become increasingly passionate about, I bought and read both. You would be and idiot to buy The Complete Idiot's Guide to Basketball.The author appears to be more preoccupied with telling you how wonderful he and the players of his (long bygone) era were. The references to today's players are painfully few. His snipping asides against the work ethic of today's players should have no space in a book of this sort; it serves only to make him sound whinny. His writing is practically devoid of humour and his descriptions of plays and strategies are fairly tedious. The game just does not come alive under his pen. Had I been an absolute newcommer to the sport when I read this book, I would have encouraged my boys to take up more exciting sports like synchronised swimming. FOrtunately, I had watched several live and taped games and had my children's interest to help me realise that there was much more to basketball than I could find in the pages of this book.Try again Mr. Frazier",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            }
        ]
    },
    {
        "Title": "a day in the bleachers",
        "description": "From the subway ride to the ballpark, through batting practice and warm-ups, to the game-winning home run, A Day in the Bleachers describes inning by inning the strategies, heroics, and ineluctable rhythms of the opening game of the 1954 World Series. Here are the spectacular exploits of the Indians and Giants, and of a young player named Willie Mays, who made the most-talked-about catch in baseball history.",
        "authors": "['Arnold Hano']",
        "infoLink": "http://books.google.com/books?id=fEFhswEACAAJ&dq=A+day+in+the+bleachers&hl=&source=gbs_api",
        "categories": "['Sports & Recreation']",
        "ratingsCount": 2.0,
        "review": [
            {
                "review/text": "This is the only baseball book that I have read in every decade of my life, from the first. I'm 54, and I first read this book in 1959, with awe and rapture. It captures the flavor and the intensity of the experience of baseball before television as no other pages do and, as it happens, it tells the story of one of the transcendent moments of real baseball history. When Willie Mays was given an honorary degree at Yale this year, they specifically cited &quot;the catch&quot; fifty years ago as his most distinct single moment of on-field performance, for all that he was never less than a captivating performer. Hano's book is one to read and reread, with ever-renewed pleasure.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Although I was still 10 years away from being born when Mr Hano attended the first game of the 1954 World Series, I thoroughly enjoyed his telling of his experiences attending the game. As a baseball fan, I couldn't wait to get my hands on this book, and it doesn't disappoint. I could imagine myself being there.The book is a classic and one I will read again. My ONLY disappointment with the book is that it ends so abruptly. The last out is made. He looks around for the lady in the red hat. She's gone and he mentions the fact that he never got a look at the face of the Cleveland fan and basically, that's it. Book over. I was hoping he would end the book with his getting home and speaking to his wife about the game, the way the book opened.My other disappointment was in the afterword. I was pleasantly surprised that Mr. Hano is still living. He ran down the list of where are they now from the '54 Giants, which I enjoyed. I kept waiting for any other recollections he might have had about that game, the way baseball was then compared to now, etc. And I was also hoping he would mention what happened to his wife; if she's still living or not. But he did neither, but that's ok.All in all, this book is one that will stay on my shelf for a good long time. Well worth the read!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book captures what it is to be a fan better than anything else I've ever read. I often read this book in the Spring, to cleanse my mental palate of a long dreary Winter of football, basketball, the off-season noise of player contracts, and all else that is life without baseball actually on the field and in the stands. This book always does the trick. I once lost my copy (probably loaned it to someone who never returned it) and had to live without it for years until I found another used copy. Those were hard times. Now it's readily available and I can give it as a gift. Glory, glory, glory!I know, this doesn't actually tell you about the book, but I'm too thrilled to bother with all that now. Just get it. I've never lent my copy to anyone without them coming back singing its praises...except for that mystery s.o.b who apparently liked it too much to return it.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Did you ever wonder what it was like going to a game at the Polo Grounds? This is an inning by inning description of Game 1 of the 1954 series that covers getting to the park, who was sitting nearby, and of course the game itself. It is told from the view of a fan who knows and loves the game, but avoids windy philosophy and theory. It is especially grand to read in the depths of winter when baseball is either a memory or anticipated. I can't recommend it too highly.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "ARNOLD DOES A GREAT JOB DESCRIBING GAME 1 OF THE 1954 WORLD SERIES PLAYED IN THE POLO GROUNDS. READING THIS BOOK I CAN PICTURE VERY CLEARLY, THE EVENTS THAT TOOK PLACE THAT DAY. FROM THE TIME HE LEFT HIS HOUSE TO THE GAME ENDING HOMERUN, I WAS TOTALLY CAUGHT UP THIS DETAILED ACCOUNT OF &quot;THE CATCH&quot;. HIS DESCRIPTION OF THE PEOPLE AROUND HIM, THE GAME ACTION, AND HIS THOUGHTS ARE PUT TOGETHER IN THIS GREAT READ. A MUST READ FOR ALL GIANT FANS AND BASEBALL HISTORIANS.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "game development essentials an introduction",
        "description": "GAME DEVELOPMENT ESSENTIALS: AN INTRODUCTION, 3E is an authoritative, industry-driven introduction to the world of game development, with updates that keep readers current and well-prepared for a successful career in the field. This book not only examines content creation and the concepts behind development, but it also give readers a background on the evolution of game development and how it has become what it is today. GAME DEVELOPMENT ESSENTIALS also includes chapters on project management, development team roles and responsibilities, development cycle, marketing, maintenance, and the future of game development. With the same engaging writing style and examples that made the first two editions so popular, this new edition features all the latest games and game technology. Coverage of new game-related technology, development techniques, and the latest research in the field make this an invaluable resource for anyone entering the exciting, competitive, ever-changing world of game development. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
        "authors": "['Jeannie Novak']",
        "infoLink": "http://books.google.com/books?id=NIMIzgEACAAJ&dq=Game+Development+Essentials:+An+Introduction&hl=&source=gbs_api",
        "categories": "['Computers']",
        "ratingsCount": NaN,
        "review": [
            {
                "review/text": "I teach Survey of the Game Industry, Game Design & Game Play, and Project Management at the Art Institute of California: Orange County. Being a frugal person myself, I have not required my students purchase a textbook for any of my classes until now. Ms. Novak's book has become the single source of required reading for ALL 3 of my classes. Breezy, intelligent, and designed from the first sentence as an instructional tool, you will learn a great deal about the game industry from it. I could not possibly recommend this book any higher than to commit my classes to it.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "First of all, who is this book for?When I first bought this book I thought I was in for a mind breaking tutorial or insight into game development, and considering all the great reviews, I think these expectations were completely normal. Reality is: the book will only teach you very, very essential stuff. So, if you already have any sort of experience in game development, or you have been a hardcore gamer looking to become a game developer, you probably know this stuff already. This book is great for teenagers who would love to become game developers or professionals in other areas looking to cross over. Still, if you are knowledgeable in gaming or game development, you may want to buy this book for formalize your knowledge into comprehensible data sets in your mind (this is how this book has served me the most), for the writing is clear, easily digestible, and the presentation of the whole deal is beautifully done.What does this book talk about?A lot of things! And this is one of the very best features of the book: it will guide you to every detail of game development, even if offers very little information on some topics, so you won't stay completely ignorant with this book. It talks about: the target market, history of games, gameplay, storytelling, characters, marketing, development process, the development team, etc... By the end of this book you will feel good about your understanding of games, even if it is at a small extend, because now you fell that you have your feet on the ground. This is another great feature: it never talks about game development as something easy. Actually, on the ending chapters, where the author talks about the development process, she makes a clear point on how crazy the whole deal can be, doing justice to those people who thought they were in for an easy way to make money.The book has lots of \"developer side notes\". Some are really bad, coming from developers completely oblivious for me: they teach only what is obvious, and sometimes repeat what the author has already taught. But then again, some are brilliant, coming from either random guys or very famous developing houses like: Infinity Ward, Ensemble Studios, Obsidian Entertainment, etc. This little side notes offer guidelines on what to avoid, pursue or do while creating or thinking a game.What I disliked.Game Development Essentials Second Edition teaches its topics viewing gaming mostly as business and not as art. This was very disappointing for me. It constantly talks about knowing your market, and creating a good game for them. They always try to teach you to see games as a product and not as a creation to deliver a message. For a person who loves all games (me) that try hard to be art, or at least, to get a message across, it was hard to come to terms with all this (gaming as art is what inspired me in the first place).Moreover, when the author talks about the importance of storyline in some games, she really bashes linear storytelling, saying games are supposed to be non linear. It weird but she stresses that the best games have non linear storylines and she creates this feel on her text that linear stories are a crime. But I asked myself, what about: Halo? Half Life? Gears of War? Max Payne? Metal Gear? Grim Fandango? The Longest Journey? Resident Evil? Killzone? Resistance? Silent Hill? Most of my favorite games tell linear stories! I believe that creating a linear story is a better way to developing characters; very few games have offered non linear storylines without making characters of such game look generic. But what bugs me is this: she openly talks about how great the story for some these games is, but nearly in the same paragraph she bashes linear storytelling. I think the author should rewrite that whole chapter, explaining which storytelling methods work better with the different genres in games.All in all this is a great book, and definitely the best intro to game development. While it has a share of short comings, most of the time you'll be entertained and impressed by the learning scenario that author has created. She is not exhausting, she never punishes the learner with tons of questions, and the technical stuff is kept to a minimum. If you are looking to get into the business, look no further, this book will do you great justice indeed.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I'm a professional game designer with 7 years experience and found Ms. Novak's book to be a great introduction to the process of game development. It is well-organized and covers a wealth of relevant topics. The lucid writing and full color screenshots make it easy to read.Unlike many other introductory books, Ms. Novak's text does not mislead the reader into thinking that becoming a game developer is an easy path, where a great idea and good pitch can allow you to create your dream game. It is a responsible and accessible text that anyone interested in game development would find helpful and insightful. Obviously, as an introductory text, its content is not particularly useful to industry professionals, though I found the profiles and the section on history to be enjoyable.I don't understand Mark Baldwin's objection to the profiles, because I feel that they provide insight to the industry that is immensely valuable to those new to the field. Ranging from industry greats, such as Louis Castle and Richard Garriot, to current students, a wide variety of perspectives and thoughts are presented. As an aside, I can understand some of Mr. Baldwin's comments from an academic perspective, but from a practical point of view, I must disagree with his harsh appraisal.I would recommend Ms. Novak's book to anyone who wants to learn the basics of the game development process.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is as good an introduction to the game development process as I have come across. Incredibly current, peppered with wonderful interviews and comments from major professionals in the field. I especially like the CD-ROM which includes a wealth of demos and development tools.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book creates a good foundation for learning about the modern game development process. Overall, I am happy with the book, and would recommend it to a beginner or as a quick read to fill in the gaps of an intermediate developer. I do have three complaints, however.First off, it reads like a textbook. Take a few minutes to read the sample chapter. I thought the nature of that chapter forced the dryness of the reading, but the entire book reads this way. Be prepared for this, and structure your reading time accordingly.Second, the author frequently includes quotes from various people in the field. I think this is excellent, and I wish more authors would do this. However, the author also includes a paragraphs with the person's credentials in-line with the text before the quote. The completely destroys the flow of the content, and severely distracts from the subject matter being presented.Lastly, the frequent references to other books in the series makes this book feel like a marketing pamphlet. I understand this Introduction book is limited in scope, but a single page at the beginning of the book that references the other in-depth books would be more helpful. The in-line self-advertisements were irritating, and just make it harder to find them later if I actually want to dig up that book.As I said previously, I would recommend this book. It's a solid intro to the topics at hand. If you go into it prepared for the above distractions, and with the understanding that this book is an overview and not a deep-dive, you should be able to maximize what you get from this book.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I've been making games for 19 years and I couldn't disagree more with Mark Baldwin's criticisms of this book. Jeannie Novak has written a fresh, all-encompassing book on the subject of game development. The industry is rapidly evolving and this is one of the few texts to keep up with current thinking and present it in a manner that is easy to digest.I really enjoyed the sidebars and interviews. Jeannie went all out - interviewing some of the brightest stars in this business. OK, so you can dismiss my interview (pg.300), but the rest are informative and interesting.It's disappointing to see such nit-picky criticism. If this is the same Mark Baldwin that did Empire (I loved that game) then you've been around long enough to know how useful a book like this is. Students of game design and anyone eager to learn more about this industry will get a lot out of this book.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is a great introduction to the game industry in general. It doesn't delve deeply, but does a flyover of what is becoming an increasing complex medium. It hits the points someone seeking to enter the industry needs to know - everything from features of the companies creating games to current styles of development.It would work great for an introductory class for students entering the industry, and as a good overview for non-students who find themselves called upon to understand the industry as it grows and challenge other media.If there are any faults, they are in the book covering so much territory that it can't provide detail. This is OK for an introductory book, but to get to specifics one might look at other books in the same series by Thomson Delmar Learning, e.g. the newly published Game Story & Character Development.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Growing up in the late 80's and early 90's, all kids my age played video games. The video game industry was just beginning to boom, thanks to the Mario's and Sonic's of the world. Twenty years later, millions of people, all ages, play video games around the world. Who knew something so fun as a kid would turn out to be a legitimate career option? If we had textbooks like this in my school, maybe I would have chosen a different career path.Game Development Essentials is a wonderful, informative book written by Jeannie Novak. On the outside, it looks like any normal textbook you'd find at a school, but the inside is full of all the answers one could possibly have about how video games are developed.Novak's books is nearly 500 pages and also contains a DVD that includes game demos, software trials, videos and more. Chapters in the book discuss everything from the history of game development, the different types of video games (everything from console, to PC, to mobile), how the gameplay experience is created, how levels are created, what goes into bringing the games to life (plot, voice acting, music, graphics, etc...) and so much more. It also contains colorful pictures (and video) to keep your eyes satisfied.Bottom line, if you're at all interested in learning about video games, this is the book for you. It has more information than you can possibly imagine about the past, present and future of video game development. If this were available at my school, I might have enjoyed going to class more.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was published in 2005, and at the pace the game world changes it's now slightly dated. The book is a good source of information about game creation if you are very much a beginner and have no idea about how to go about designing, marketing, or the elements that go into creating a good game and want to know what's in store for you as a game designer.The book is well-written, textbook-style, and a reasonably good overview of the gaming world as it existed in 2005. It's an interesting scan-through for older gamers and a very good tool for the younger, inexperienced gamer/designer.I got the book remaindered for less than $4 and feel it was probably worth that, but I wouldn't advise spending anything more for it at this time. The accompanying disc has only trial versions and includes GameMaker, a newer version of which is available on-line from Yo-Yo Games for free.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Having written for games over the past few years, I found Ms. Novak's book to be an essential part of understanding the professional game world. The book takes the reader on an informative journey through the ins and outs of the game development industry, starting from the beginning of electronic gaming. This book is not only a good learning tool for students, but also for anyone interested in game design as a profession. Further, the clean and understandable language is pleasure to read. Simply a must-have for any aspiring game designer.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    }
]