[
    {
        "Title": "supposing",
        "description": "When you're a kid, there are lots of things you're not supposed to do. But what if you didn't really do any of those things, what if you just imagined them? Then it wouldn't matter if your supposings were silly, impossible, or even a little naughty-because they're all just in your head. Alastair Reid's book is a monument to the liberating power of unfettered thought. Here he reunites with a frequent collaborator, the famed illustrator and designer Bob Gill, to muse on the possibilities: Supposing I read a book about how to change into animals and said a spell and changed myself into a cat and when I climbed on the book to change myself back I found I couldn't read. . . Supposing I had a twin brother but we never told anyone and only went to school half the time each. . . Supposing a very beautiful lady fell in love with me and wanted me to marry her but I just yawned and said Maybe . . .",
        "authors": "['Alastair Reid']",
        "infoLink": "http://books.google.com/books?id=K8BvDwAAQBAJ&dq=Supposing&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a crazy book with lots of weird ideas that, while it may not actually lead children to commit mischief, should at least encourage them to think about it. It will also encourage adults (I hope_ to shed their facades of responsibility to pull pranks. It will make you laugh. In short, it's a classic.Great illustrations and outrageous &quot;supposing&quot; scenarios tug at the joker in us all..(For some reason, there was a copy in my college library, no doubt because the author has published a variety of learned books as well. I used to check it our every few months or so.)",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "&quot;Supposing&quot; is one of those books that adults look at and wonder if it's appropriate for children because they've forgotten what it's like to be a child. It's a funny book that presents some slightly skewed one-page &quot;what if&quot; scenarios that are guaranteed to engage the imagination of anyone who has an imagination.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I too remember this book from my childhood. It's with fond memories that I recall hours spent at pre-school with my best friend, in stitches laughing at the sheer ridiculousness of &quot;Supposing&quot;. We still quote silly passages even now. It's one of those books that makes a young person LOVE to read.In fact, I'm trying to get hold of a copy for future generations, if anyone knows of a copy - please do let me know where I can purchase it. Viva la difference!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I remember this book from my childhood. This book is great. Totally off the wall. Filled with quirky what ifs...The previous reader is way off base...this is a wonderfully imaginative book for children...yes children. Unless you're a bit unstable or too simple minded to grasp the humor in this book, taking it at face value and missing the point (always a problem with over pc parents), you will enjoy this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This really isn't a book for a small child but is written more for the adult reading to the child. It like Jack Handy for children and the illustrations are hillarious. Its a book you'll quote for life.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "supercompletely and totally the messiest",
        "description": "Olivia, who is very neat and practically perfect, despairs because her sister Sophia is super-completely and totally the messiest person, no matter where she goes or what she does.",
        "authors": "['Judith Viorst']",
        "infoLink": "http://books.google.nl/books?id=V9TZAAAAMAAJ&dq=Super-Completely+and+Totally+the+Messiest&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "How you will rate this book depends on your personal habits.Neat people will love it. Those who are a little clumsy and disorganized will feel hurt by it. Parents should be very careful in choosing whether or not to buy and read this book to their children. If you have a clumsy child in your household or neighborhood, avoid this book!I graded the book down for the gratuitous put-downs aimed at those who have accidents!Think of this book as Ms. Neat's view of Ms. Awkwardly Messy.&quot;My room is very neat -- like me, Olivia.&quot; The feeling of superiority begins there and becomes supercilious as the book progresses.Her younger sibling, Sophie, gets excited and makes messes of almost everything. She is either clumsy, forgets to be careful, or is plain unlucky. Although there is token affirmation in the end (&quot;mom says . . . Sophie's a kind and very nice person,&quot; &quot;dad says . . . Sophie's a smart and funny person,&quot; and &quot;Jake [her brother] says . . . Sophie's great at puzzles and dancing . . . .&quot;), clearly the real message is that a klutz should be a butt for jokes. Come on! What kind of message is that to send to children?Development rates vary a lot with children. Some are still a little awkward well into their teenage years, while others have wonderful small and large muscle coordination early. Children don't choose to be clumsy. They just are.The perspective in the story could have been shifted to be Sophie's and emphasize how well she means. Then, it would have been a positive story. Having the &quot;perfect&quot; older sister explain her shortcomings makes it just a painful putdown.The illustrations in the book rise well above the story. Sophie is a delighful-looking carrot-topped child with a smiling eager face in a colorful home and family. I liked her. I also liked the enthusiasm and warm heart behind her well-meaning mayhem. Maybe I feel that way because I'm Mr. Messy in our household.Think about when intent counts and when results count with children. With children, if the intent is good, the results will eventually follow.Is neatness always an advantage? When is it? When isn't it?Enjoy everyone in your family, for all of their characteristics!",
                "review/helpfulness": "23/31",
                "num_reviews": 31
            },
            {
                "review/text": "Sophie is super-completely and totally the messiest girl that ever lived! That assessment, by Olivia, her perfectly neat big sister, just about says it all. And no matter where she is or what she's doing, be it school or parties, the beach, the farm, the circus or even the bathtub, she's a whirlwind of activity and impending disasters. But, as Olivia also tells us, she's kind and very nice, smart, funny and great at puzzles and dancing. She's one of a kind and her family loves her, just for being herself. Judith Viorst really captures the essence of an ever inquistive and busy youngster with places to go, people to see and things to do. Her wonderful hip text, told exasperatingly by older sister and neatnik, Olivia is only outdone by Robin Preiss Glasser's busy and detailed pen and ink line drawings with only Sophie and her mess highlighted in bright colors. Together, they've authored a picture book that will amuse and delight everyone in the family. Perfect for youngsters 5-9, Super-Completely and Totally the Messiest is a winner!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "We just love the cheerful and happy illustrations that make this a really meaningful Judith Viorst book. Here, the beautiful pictures' exuberant humor, joy, and color add another dimension, almost another story, to a tale of how different 2 sisters and a brother can be. They really do embody &quot;the genuine spirit of animation, the breathing to life, the swing into action,&quot; that Maurice Sendak says he considers &quot;an essential quality in pictures for children's books&quot; in &quot;Caldecott &amp; Co.,&quot; his book of essays on books and pictures. In fact, the pictures are so wonderful that you should look at the charming, wordless books Robin Preiss Glasser, the illustrator of &quot;Super-Completely,&quot; has made with her sister: &quot;You Can't Take a Balloon Into The Metropolitan Museum&quot; and &quot;You Can't Take a Balloon Into The National Gallery.&quot;",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I originally purchased this book for my four-year old niece, who is a big fan of \"Fancy Nancy.\" However, before I wrapped the book I decided to read it and I am glad that I did. Consequently, I did not give it to her. In a culture where our children are increasingly competitive, I believe siblings should be more supportive of each other. My niece has a brother, four years older than she, who presents the \"Olivia\" persona analogous to my niece's \"Sophie-like\" tendencies. To give a four year old a book which exemplifies more \"you should be like me\" than \"just be the best you can be\" is, in my opinion condescending and lacking in building a child's self-esteem. This book will be shelved and perhaps used as \"what not to do\" in a child psych class.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I really want to recommend this book for anyone to read - grownups and kids alike. maybe it's because i'm an elementary education major, but i just found this book delightful and quite an enjoyable read. the illustrations are beautifully done, and the story is funny. i like the way the entire book is from the sister's point of view. it gives the book a depth that kids can relate to. i definitely recommend you pick this one up!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "My 4 year old daughter loves this book so much, while already loving books, I believe this one has made her a book lover for life. The artwork is hilarious and the story itself is really funny. We can't help but crack up each time (like 4 x's a week) we read it. Great stuff.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "My granddaughters are named Olivia and Sophie. I had to buy this book for them. If you love Eloise you will love Olivia and Sophie. The illustrations are wonderful. Lots of laughs within the pages of the book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Older sister Olivia shares stories about her incredibly messy younger sister Sophie. The tales of Sophie's misadventures are humorous, and tempered by the obvious fondness between the practically perfect Olivia and impetuous Sophie. The pictures are wonderfully drawn in black and white, with Sophie painted in vivid color. Watch for a mortified Olivia in the background of most pictures. Sophie tries to emulate her older sister, but her own individual style always comes through. And while Olivia lists her sister's faults, she does not neglect to mention her strengths and virtues as well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Got this book just because it was a Viorst and because I love her alexander books. The first time I did read it before reading it to my daughter I was not sure how my daughter would react to the book. She has not siblings as yet and can't really categorize her into either category ( neat or messy - she is a little of both)but loved the way sophie makes a mess of every thing and how the older sister is as hoity-toity as older sisters get.but would have loved it more if there was more of sophie's good qualities described that way there would be a greater balance to sophie's character.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "stuart little a yearling book",
        "description": "The adventures of the debonair mouse Stuart Little as he sets out in the world to seek out his dearest friend, a little bird who stayed a few days in his family's garden.",
        "authors": "['Elwyn Brooks White']",
        "infoLink": "http://books.google.nl/books?id=M8u_twEACAAJ&dq=Stuart+Little+(A+Yearling+book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I had just finished reading &quot;Mrs. Frisbee and the Rats of NIMH&quot; and &quot;Charlotte's Web&quot; to my 5 year old son (who thoroughly enjoyed both of those books) and was looking forward to reading him Stuart Little. But as I read a chapter each night, I kept thinking &quot;it has to get better! Didn't I like this book as a child?&quot; I noticed my son wasn't begging me to read more each night, as he had with all the other books.After we finished the book I asked him his thoughts about it. &quot;I didn't really like it. I just didn't get what they said!&quot; I had to agree. The language and especially the sailing jargon was not clear. Yet this 5 year old &quot;got&quot; the much more complicated concepts in Rats of NIMH? I was disappointed that this book didn't spark conversations from my son, like the other books had. Though we did talk about how interesting it was that the same person who wrote &quot;Charlotte's Web&quot;, a book he truly loved, could also write a book like &quot;Stuart Little&quot;, that he didn't enjoy at all.We're happy to leave Stuart Little behind and be several chapters into &quot;Charlie and the Chocolate Factory&quot;. Now I'm hearing &quot;just one more chapter PLEASE...&quot; again.",
                "review/helpfulness": "24/39",
                "num_reviews": 39
            },
            {
                "review/text": "The most common complaint about Sutart Little is the ending, or lack of ending. I disagree. The story is one of growing up, and sadness, and yearning for something just out of reach. The brilliant E.B. White denies us a happy-Disney ending, avoids &quot;closure&quot;. The story is just like life; it is a journey, not a package. The loose ends don't need to be cleared up with a sequel. Stuart has grown up and struck off on his own, the end. When I first read this story as a young boy, it gave me my first taste of melancholy. This should be the first &quot;profound&quot; book that a child reads, for it leaves you feeling sad, but hopeful.",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "Stuart Little is about a mouse who was born to a normal human family. Stuart must overcome large obstacles as a small being. One day Margalo, a bird, entered Stuart's life. They became instant friends. One day the family cat, Snowbell, and an alley cat came up with a plan to kill Margalo. Another bird overheard the plan and sent a note to Margalo. Margalo left and almost falls in love, but nothing cound keep Stuart from searching for Margalo. Stuart Little is a wonderful novel that appeals to children because of its curious blend of fantasy and reality. Children can relate to some of the obstacles Stuart encounters because of his size. This story helps children to learn to use determination in order to overcome obstacles they might face in life.",
                "review/helpfulness": "30/33",
                "num_reviews": 33
            },
            {
                "review/text": "I fell in love with White's &quot;Stuart Little&quot; in the 4th grade, when my teacher read this gem of a book out loud to us. Even today, as an adult, the clever, jaunty Stuart Little is a favorite of mine. The book is about the adventures of Stuart, a small mouse who was born to human parents. From driving a model car given him by his dentist friend to his run-ins with the family cat, Stuart's innocent hi-jinx and fun-loving nature will keep kids and adults laughing. &quot;Stuart Little&quot; is a lively getaway from our sometimes violent and tumultuous world.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I've just read all 99 reviews and can't believe no one mentions how bizarrely Stuart treats Harriet Ames! He goes out of his way to invite her down to the river at sunset for a boat ride. He tells her he's well-proportioned and and also suggests she not tell her parents she's coming to meet him. weird. But stranger yet- she does come to meet him, and when Stuart discovers his canoe has been damaged, he speaks bitterly, sulks, screams, and acts like a rude jerk toward his guest. When she keeps trying to encourage him to make the best of it, he acts selfish, spoiled, and abusive. He refuses a peppermint she offers him. She invites him to come with her to dinner and out dancing and he says no I have to leave early in the morning. Finally she leaves. Is this book a primer for children to explain how men treat women badly? How bizarre!!!",
                "review/helpfulness": "10/15",
                "num_reviews": 15
            },
            {
                "review/text": "&quot;Stuart Little&quot; is a very, very good book and he is the cutest mouse. My favorite part of the book was when he got stuck in the refrigerator and when he got into the trash can. And I liked when the man at the dentist's office talked silly. And when Snowbell said, &quot;The little chippy flew the coop!&quot;",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "I was moved to write this review after reading some of the negative comments made about the book being boring, difficult to understand, or containing values that the parent did not want to pass on to the child. Stuart Little represents an important example of the some of the challenges of selecting reading materials for our children and tests us as parents in many ways. I didn't know how my boy would respond when I began reading it, since I knew it was one of those children's books that has been enjoyed by adults because of its adult humor, archaic language, few pictures. My 4 year old absolutely loves this book. We are on our second reading and a few nights ago, while he was laying in bed after our bedtime reading, he broke out laughing about how Stuart's brother, George, wanted to pour applesauce down the mousehole!The book was written in 1945, so many of the cultural references are dated, including how gender roles are perceived. But part of our responsibilities as parents is to expose our children to the evolution of thought in our culture, and that includes finding ways to explain how people's behavior has change over the years. A young child has already likely experienced many different behaviors in the children around them from daycare, preschool, or even playgroups. What better way to have an opportunity to prepare your child for the many different views he or she will encounter.But the message of Stuart Little is a powerful one that can be so useful to a child. Here is a 2-inch tall \"person\" who \"looks like\" a mouse, yet he is part of a human family. He has the most amazing obstacles in his life, yet he overcomes them with enthusiasm and joy. The use of actual sailing vocabulary is a wonderful choice by the author. What a great opportunity to expose our children to other language and to show them that specialized language exists for all fields of study, even hobbies. Doesn't even Winnie the Pooh have its own specialized vocabulary (smackrel, blustery day, etc.)?Stuart doesn't always make the right choices. This provides another great opportunity for discussion, regardless of the child's age. I am a parent who doesn't want to reinforce some of the stereotypes of our past that get in the way of people connecting, whether they be gender inequities or other issues. But it is important that my child get a framework for understanding how the way people have acted toward one another. In the last chapter of the book, Stuart meets a very self-assured girl who, by the way, he asks out on a date is an outdated, but respectful and wonderful way. He winds up being unable to continue connecting with her after his carefully imagined plans don't go as he dreamed. He is upset because things didn't go his way and couldn't get past his disappointment. What a great thing to discuss with a child.We also have to give our children credit for their intellectual abilities and imagination. I was quite surprised how my boy listens intently through the archaic language and vocabulary and finds the story.Stuart Little is a great book for that next step for the young child who has only had picture books read to him or her so far. It is a good beginning book for parents to learn how to introduce their child to the varied, challenging, sometimes confusing world out there in a very non-threatening, interesting way. Don't underestimate this book.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "&quot;When Mrs. Frederick C. Little's second child arrived . . . the baby looked much like a mouse in every way.&quot; (pg.1) In fact, her second child is a mouse; however, the family treats him like a member of the family. They never even say the m-word (mouse), as to not hurt Stuart's feelings. Throughout the book, Stuart encounters numerous exciting adventures, unknown to his protective family. Children love the idea that even though Stuart is 2inches-tall he still overcomes many obstacles. Stuart Little's emotions and adventures he experiences in this book are very similar to what children face every day; for example, going to the dentist, first love, being homesick, and bullies. One underlying theme I found within the book was accepting children for their differences and not sheltering them from lifes' experiences.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "The fact that the hero of the story is a mouse does not make this a good book for young children. The language is difficult and the humor is rather understated, i.e. \"The doctor was delighted with Stuart, and said that it was very unusual for an American family to have a mouse.\" At its heart, Stuart Little is a comedy of manners, and the fantasy takes a back seat to the witty dialogue and neat prose. Children will enjoy it at ten and love it in adulthood.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is perhaps my favorite children's book. Stuart's adventures and his zest for life make him one of children's literature's most memorable characters. I thought that \"Stuart Little\" was E.B. White's best book, far better than \"Charlotte's Web.\"My favorite parts of the book include the epic sailboat raise between the WASP and the LILLIAN B. WOMWATH in Central Park, with Stuart heroically helming the WASP to victory, especially Stuart's interview with the dentist who owns the WASP. \"Do you drink?\" \"I do my work,\" said Stuart dryly.Another great tale within the story is his date with the tiny girl, that he plans so mightily for only to have it be a disaster. . .his philosophical talk with the telephone repairman along the road. . .I felt that the ending of the book was just right, Stuart motoring off in his little car, looking for Margalo, not knowing where to find her but sensing that somehow he was going in the right direction. Like all great children's literature, \"Stuart Little\" I think also strikes a deep chord with adults. The book meant a lot to me, having read it as a child, when I read it for the first time to my own son.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "the missing piece meets the big o",
        "description": "The missing piece sat alone waiting for someone to come along and take it somewhere.... The different ones it encounters - and what it discovers in its helplessness - are portrayed with simplicity and compassion in the words and drawings of Shel Silverstein.",
        "authors": "['Shel Silverstein']",
        "infoLink": "http://books.google.nl/books?id=koJSzgEACAAJ&dq=The+Missing+Piece+Meets+the+Big+O&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a great book for kids from one to ninety-two! I read this book with my friend's children in mind and I found that this book has an important message about recognizing who your true friends are and finding that one true best friend who &quot;fits&quot; your personality and lifestyle. I recommend children of all ages and children at heart to check this book out. As always, Shel Silverstein has a very innocent, colorful and fun way of looking at life and this book reflects it. It's a breath of fresh air. For a better understanding of this book however, I would check out Shel Silversein's &quot;The Missing Piece&quot; before reading this one -it's also a very cute book.",
                "review/helpfulness": "28/32",
                "num_reviews": 32
            },
            {
                "review/text": "Whether simply a children's book or an adult self-help book, this one is a gem! Adorable simplistic line drawings that make you wonder how an artist is able to create such an expressive characters out of basic circle shapes. Matched with a story that can be taken lightly or taken to heart.Really, this is the journey of a character becoming a \"whole\" person...independantly being able to \"roll\" by itself. It also hints that to be happy in a relationship you must be your own independantly happy person...you can't rely on others to complete your deficiencies.Anyone who is a \"relationship leapfrog\" needs to read this book. It may even make you cry-and probably will make you laugh-at the similarities with your own experiences. It is also appropriate for children...it is never to early to introduce someone to lifelong happiness, independance, and stability.Rolling along...",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "Three days after ending a relationship where I was constantly trying to be someone or something else in order to please my partner, I took a vacation that changed my life. On the first night of that vacation, while I was out with friends and family and the last thing I was looking for was another boyfriend, I met the most amazing person to enter my life so far. The next day, I found this book and decided to live my life like the big O. The man and I keep the book on our coffee table, and when we aren't rolling through the streets of the city, side by side, we go home to that wonderful story. Shel Silverstein has amazing insight. Every human should read this book.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "My girlfriend just gave me this book for Valentine's Day yesterday and I think it is one of the most beautiful books I have read. We had talked once about how we were looking for the piece that would fit with us, like that Lego piece that would finish the construction perfectly. It made her think of this book, which she had read when she was younger. The story is so sweet, but also very meaningful, because the Missing Piece learns to be complete all by itself and not have to fit itself into some other whole that isn't quite perfect. And I like to think that the Piece and the Big O live happily ever after. It is a great lesson for everyone.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "In comparison to older versions of the book, the latest publishing of the book is missing half a phrase. When the Big O gets introduced, the left side of the page should say, \"Then, one day...\" while the right side say something like, \"another came along who looked different.\" The publishing I have found at book stores is missing the \"Then one day...\"",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "I bought this book along with &quot;The Missing Piece&quot; almost 10 years ago, when I was in college. My friend introduced me to those books, and I had to get my own copies. In fact, a good number of people among my circle of friends got their own copies as well.I think those two books are the only &quot;children's books&quot; I have in my possession, but they are among the most touching and most memorable of all the books I own and read. And even though they're labeled as children's books (and they sure look that way too), I feel they're a better fit (haha, no pun intended) for grown-ups.If you plan on getting this book (as you well should), then definitely get &quot;The Missing Piece&quot; as well. I don't think the story and the message of The Missing Piece fable is complete with just one book. You gotta get both books to fully appreciate it.Highest utmost recommendations. God, I love this book.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Shel Silverstein, by writing books for kids, has shed a new and beautiful light over some of the most typical adult problems. In &quot;The Missing Piece Meets the Big O&quot; he goes into the basics of a relationship. Simply put, you can't love others until you love and accept yourself.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I was given this book as a 23th Birthday present by a man who is more than just a friend. He is the most gentle,kind and loving person I have ever met.We were having a great time together. Even though it was too short , it was so sweet. I like this book not only does it entertain but it educate us too to see how things are.This book means a lot to me as a reminder of the time we had. I am sure that I will never forget the meaning of the book as well as the person who gave me this book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "My Grandson and I read this book at the Standford University Book Store. We thought it was a very insightful book on human relationships and self esteem. What a delight when a 56 year old and a 6 year old can share and benefit from the same message! We recommend it for people of all ages",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Not only are the flow and details of this book amazing, but also the spirit and the hope that the story brings, my mother found this book in a box of things for hurricane katrina victims. I begged her to let me have it, because it had writing in the back of it. It apparently had been a wedding present for someone and now they were sending it to hurricane volunteers(how kind). This is an amazing story and I will cherish it for the rest of my life.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the pain and the great one",
        "description": "A six-year-old (The Pain) and his eight-year-old sister (The Great One) see each other as troublemakers and the best-loved in the family.",
        "authors": "['Judy Blume', 'Debbie Ridpath Ohi']",
        "infoLink": "http://books.google.com/books?id=WIKmAwAAQBAJ&dq=The+pain+and+the+great+one&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There are remarkably few authors that have managed to write for almost every single age group. Judy Blume is one of the few. Though admittedly she has yet to write a baby book or large print text for the elderly, Ms. Blume has somehow managed to write picture books, young readers, full chapter books, teen novels, and even an adult title in her day. We all know who Judy Blume is, but we probably know her for very different reasons. As a kid, I knew her primarily as the author of \"Tales of a Fourth Grade Nothing\". My husband, on the other hand, associates her with that deliciously forbidden text, \"Forever\". For some kids out there, though, \"The Pain and the Great One\" is going to be their first impression of this undeniably great author. As of this review, it is the only picture book ever written by Ms. Blume. Be that as it may, it shares with all her books the frustrations and confusions that all kids can relate to on some level. Ms. Blume, the great empathic, should consider adding a few more picture books to her repertoire. This first book demands it.A white page with a pink border. In black and white print are two words: The Pain. A sister then begins to relate to us exactly why it is that her little brother is a pain. Right from the start, you see where she's coming from. This is the kind of kid who insists that his mother carry him to the breakfast table every morning. Unlike his big sister, if The Pain doesn't finish his dinner he still gets dessert. A truly shocked and probably envious sister watches, broccoli perched on her fork, as her brother dives into a delicious bowl of what looks to be strawberry shortcake. One night, she gets to stay up later than The Pain, but comes to the almost immediate conclusion that, \"without the Pain there's nothing to do!\". The cat seems to prefer him and she finishes with the thought that when it comes to her parents, \"I think they love him better than me\". Suddenly we're looking at another white page with a pink border. In black and white print are three words: The Great One. Suddenly the perspective has shifted 180 degrees. We're in the head of The Pain and he's talking about his older sister. Sarcastically referring to her as The Great One, the boy talks about all the stuff she gets to do that he doesn't. She feeds the cat, so it must obviously like her better. She knows how to do all sorts of stuff without messing up. She swims with pleasure and isn't afraid to put her face in the water. The boy's final thoughts refer to his own parents as well. \"I think they love her better than me\". The end.The book was originally published in 1985. Reading it, I had to wonder if it could be published today. In the current publishing market, I can see well-meaning but oblivious department heads trying to convince Ms. Blume to give the story an ending where the boy and girl become best friends and everything ends up hunky-dory by the last page. I was a little shocked that on a first reading, this is exactly what I found myself expecting. No, what I expected was worse. Because when I got to the pink bordered \"The Great One\" page I suddenly thought that the story would show how much the little brother really and truly admires his older sister, even if she thinks he's annoying. There's probably a book like that out there somewhere. This book is not it. This is a book that tells it like it is. Sibling rivalry has never been so clear. Cleverly, Blume inserts tiny (I hesitate to call them) lessons into the story so that in the midst of each kid's litany of complaints, they learn things as well. The Great One learns that staying up late isn't fun without her horrid little brother. The Pain learns that playing with his sister's blocks all alone isn't fun in the least. If you're looking for anything more sappy than this, however, you're out of luck. This is Blume telling children what they already know, and kids will appreciate the honesty.Illustrator Irene Trivas puts her back into this book. It's funny, but depending on who's telling the story, the illustrations shift ever-so-slightly in their favor. When The Great One talks about The Pain, everything he does is understandably annoying. When the boy talks about his sister, on the other hand, she suddenly becomes infinitely competent, intelligent, and skilled. She's annoying in an entirely different way. Trivas also gives each kid some remarkable characteristics. The Great One tends to sport a cowboy hat with a bright green or red feather planted in the brim. The Pain wears a wide variety of hats ranging from goggles, winged helmets, and baseball caps to his own cowboy hat and football helmet. Trivas hasn't done any picture books quite as prominent as this one since its publication. Let us hope she gets rediscovered in the coming years.The obvious book to pair this one with would be, \"Alexander and the Terrible, Horrible, No Good, Very Bad Day\" by Judith Viorst. Both books are legitimate complaints from kids who feel woefully put-upon. Ms. Blume's books tend to have one thing in common: They know how to show unfairness from a kid or teen's perspective. Nobody does righteous indignation like Judy Blume. \"The Pain and the Great One\", a kind of he said/she said book is the ultimate example of this. For some kids it'll teach them that there are two sides to every story. For others, it'll just reinforce previously unsubstantiated claims that their other siblings have got it better. For me, it's just a great book that needs to get rediscovered. That's all.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "My son (8 yrs old) read this to his sister (6 yrs old) while I was combing her hair. We all laughed so much, he had to read parts over. This is a school library book and I am ordering it now to keep on our library shelf. It will be the book I give to ever child I know.My children are exactly at the age of the characters with reverse gender. They could readily identify with the situations and could laugh at very 'real' conversations. I am sure they recalled how many times they have each said, &quot;You love him/her better than me.&quot; I know I could. I want them to read this book once a month so they can remember the joy in having each other.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "My 8 year old daughter and I loved reading this book together and then with her grandmother who found it as enjoyable as we did. Judy Blume's story telling through the mind of children is astoundingly precise! The illustrations add to the story so well I felt as though I were in the head of the children -- siblings -- who tell their perspective of why they think their parents love the other better. A must have for siblings... Well, actually ALL kids should read this one, just in case a sibling comes along someday!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Wordsmith Judy Blume uses more verbal magic in this illustrated children's book about a little brother and a big sister. Another book that, at age 12, seemed &quot;too kiddie&quot; and beneath me.I don't care if you're 60, 16, or 6 years-old! Even if you did not have the experience of growing up with siblings, or, in my case, I was the youngest, but had a smaller niece that acted as a baby sister.Read so you know the title. Read so you know better than any Child Psychology book on the structure of Sibling Dynamics!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "We have six children--ALL of them have identified with this book at some time or another. It truly gives both perspectives...&quot;I think Mom and Dad like him/her best.&quot; It is cute, but elicits a compassionate understanding from both older and younger children. My nine year old thought it would be a great shower gift for her friend who is expecting a little brother!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I found this book hilarious for entire families. It was a true description of the different mindsets from youngest to oldest. Judy depicted the characters so perfectly and realistically. I'm sure every child, parent, grandparent,etc can identify and ring home good lessons from this lifelike story.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a great book, especially for kids with siblings! It shows how both children feel like the parents like the other one better and that they don't like each other but realize that life isn't as fun without the other sibling around. Highly recommend this!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is one of my all-time favorites from childhood, when you would have bet money that your parents loved your brother (or sister) more than you! Written in cute prose by the wonderful Judy Blume, this book puts sibling rivalry into a funny and sweet manner.I only wish I could find the one from childhood, when each kid had their own \"side\" and the book flipped over!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I am actually purchasing this book as a gag gift for my baby brother. I believe we were nine and five when we first read this book and now, eons later, it has evolved into a family/cult classic around our homes. The book is fantastic and it most definitely captures some of the siller moments that go along with sibling rivalry.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a delightful tale of sibling rivalry with a comedic twist. Young children of this age group can immediately identify and empathize with &quot;the pain&quot; and &quot;the great one.&quot; I read this book 16 years ago and still think it is a marvelous example of how childrens' books should be written.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ruby the copycat book and audiocassette tape paperback",
        "description": "Ruby keeps copying her classmate, until she learns how much fun it is to be herself. From Peggy Rathmann, the author of the bestselling GOOD NIGHT, GORILLA!Ruby is a copycat! On the day Angela wears a red bow in her hair, Ruby returns from lunch with a red bow in her hair. When Angela wears a flowered sweater, Ruby returns from lunch wearing a flowered sweater. Ruby even copies Angela's poem!Fortunately, Ruby has the patient and perceptive Miss Hart as her teacher. Miss Hart helps Ruby discover her own creative resources, which keeps Ruby literally jumping for joy!In this sensitive and endearing tale, Peggy Rathmann reveals, with charmingly offbeat illustrations, the universal struggle of a child trying to discover her own individuality.",
        "authors": "['Peggy Rathmann']",
        "infoLink": "https://play.google.com/store/books/details?id=xV1BEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I have mixed feelings regarding this book. On the one hand the book is funny and deals with a real life problem of kindergarden and primary school children (\"he is a copycat\" is a regular accusation at my house). However, reading this story after reading Peggy Rathmann's three other books: \"Gorilla\", \"Officer Buckle and Gloria\" and \"Ten minutes till bedtime\" is a little disappointing. The three books mentioned are totally hilarious and I feel they are all unique and special works of art. This book however, although very good, does not come to their masterpiece level.\"Ruby the Copycat\" is written with a neutral voice without \"taking sides\" - just telling the story as it is. Reader can understand both Ruby, the copycat, and in a way even understand why she is copying (Ruby is the new kid and Angela's ribbon is so very charming) but also see the point of view of those being copied - as Angela, whose every act (red ribbon in hair, rainbow painted shirt) is copied by Ruby. At first this is nice and Angela whispers back at Ruby \"I like your ribbon\" - but after a while Angela does not whisper any more... Ruby is stripping her of all individuality. These are an adult words but the book is written in a language every child can understand and the pictures are there to strengthen the words. Ruby wins the readers heart in the end when following the teacher's advice (don't we all wish for such teachers) finds her own unique \"thing\" and now the children copy Ruby's \"hopping\".",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "I am 13 years old and I remember that Ruby the Copycat was the first real book I have ever read on my own. This is not counting &quot;Jane ran...&quot; books, so I was about six or seven when I read this book. My mom told me I used to read it over and over and over and over to her. It was such a great book, and still is, and untill this day I still have it!!! I recommend this book to any beginning reader. Ruby is so cute and I LOVE her hair!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "When I was 9 years old, I read this book at a daycare where I stayed. I read it every single day. One day, I remembered it, after forgetting for years, and came here to amazon.com. I was overjoyed to learn that yes, they had this book. Its a great story your kids or even you will love for years to come. I recommend this book for ages 1-100. You'l love it!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I can't believe any reviewer would criticize the illustrations in this book! As in every Rathman book, the quirky and humorous pictures are half the fun. We love all of Rathman's books, but this is my favorite one to read to my children. In fact, it's one of my favorite books in our entire collection. Highly recommended.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Even now in Middle School, I get this book out and read it! I bought it when I was in the 2nd grade and I still have the copy.. as a matter of fact I was reading it not too long ago,and I suggest you read it as a family. It has a good storyline :-)",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "We read Ruby the Copycat in my second-grade classroom, and the kids really gravitated toward it. The illustrations are appropriately stylized to clearly deliver character emotions, and there are subtle details in the pictures that breathe more life into the characters. Ruby reminds me of the nervous child in all of us that seeks to fit in. I highly, highly recommend this book for in-class reading. Buy a class set!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "In response to the Kirkus review, I don't understand why it's &quot;a shame&quot; that a teacher has to point out the effects of Ruby's behavior to her. In case the Kirkus reviewer has forgotten, children do need to be taught values and DON'T always understand how their actions impact others. Any parent can tell you that. Ruby's need for adult guidance seems realistic to me.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Wow, I think Hornbook is a great publication, but their reviewer was way off on this one: &quot;Ruby the Copycat&quot; is a funny, endearing book and the illustrations add immeasurably to its quirky charm! Some reviewers seem to think that kids need the complexity of Dickens in their story plots, but what seems &quot;forced&quot; and &quot;pat&quot; to one reader seems neat and effective to this one. Highest recommendation for this story (and be sure to check out Rathmann's other great titles, &quot;Officer Buckle and Gloria&quot; and &quot;Ten Minutes to Bedtime&quot;).",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I like this book! It gets five stars because whenever my teacher reads the book to us at school, I want to take it home with me!!!! I want to read it to my mom so she can listen to me. I think she would like the story too! I like it when Ruby and Angela copy each other, especially when they like each other's bows. I like it when they are friends at the end of the story, and they hop home for lunch!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "goodnight moon",
        "description": "In this classic of children's literature, beloved by generations of readers and listeners, the quiet poetry of the words and the gentle, lulling illustrations combine to make a perfect book for the end of the day. In a great green room, tucked away in bed, is a little bunny. \"Goodnight room, goodnight moon.\" And to all the familiar things in the softly lit room-to the picture of the three little bears sitting on chairs, to the clocks and his socks, to the mittens and the kittens, to everything one by one-the little bunny says goodnight. One of the most beloved books of all time, Goodnight Moon is a must for every bookshelf and a time-honored gift for baby showers and other special events.",
        "authors": "['Margaret Wise Brown']",
        "infoLink": "https://play.google.com/store/books/details?id=dJNoDQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Until I started reading to my older son, I didn't really understand what was this book's unique hold on people was. However, from my first reading to him, I did! There must be something magical about this book and the way children love it. It's very comforting to them, with the easy to memorize lines and the gentle arrival in the great green room of nighttime. However, it's also full of little details for them to notice and delight in--the hidden mouse, the dollhouse with lights on, the pictures on the wall. It's the perfect book to start kids &quot;reading&quot; themselves---leave out the crucial word in a line and wait for them to say it---&quot;a bowlful of....&quot; &quot;MUSH!&quot;, they scream with delight! And they all love the &quot;Goodnight Nobody&quot; page best---I think it really gets kids thinking in a philosophical way---How can you say Goodnight to Nobody? This book is a true, true gem and belongs in every library.",
                "review/helpfulness": "148/153",
                "num_reviews": 153
            },
            {
                "review/text": "I got this book (in the board version) for a shower gift for my now 2-year-old daughter. I didn't remember reading this book as a child and at first it seemed a little odd -- the pictures weren't tremendously appealing and the rhyme scheme seemed strange. I have, however, been converted. After reading the book several times to my newborn daughter, I noticed how soothing it was to her. She seemed to be able to see the pictures and, as she got older, would reach out to touch elements in each. We read it every night for months, because it seemed to set a good tone for bedtime. After learning a little more about how children think, I began to understand what made it so appealing -- the ritual of saying good night to familiar objects helped reassure her when she had to say good night to her mom and dad, which can be scary for tiny kids.Now, of course, she's a big girl and says it's a &quot;baby book&quot;. However, it's still by her bed and I've overheard her &quot;reading&quot; it to herself or to her baby brother many times. It's an excellent choice for a baby you love.",
                "review/helpfulness": "113/119",
                "num_reviews": 119
            },
            {
                "review/text": "This is a book that I read every night to my children. For years, I could not quite put my finger on its appeal. Finally, it clicked one day. There is a cadence to the story that is like a mediation mantra, quietly and gently calming you and your child down. In addition, the book's text and illustrations are matched in away that it is natural to point out the words and pictures to your child, and for them to do the same as they grow older. This means that you are also starting to teach reading in natural, relaxed way. In addition, we all tend to see the glass as half empty rather than as half full. Goodnight Moon encourages a sense of gratitude for whatever is around us. That is a profound and wonderful lesson for everyone to have. Finally, children are fascinated by how another child's room might look. So you also help them to understand the differences among families. How many other books do you know that accomplish so much? Best of all, you and your children (and grandchildren, perhaps) will have wonderful memories to share. That's fantastic! Enjoy!",
                "review/helpfulness": "83/88",
                "num_reviews": 88
            },
            {
                "review/text": "At the risk of sounding redundant, &quot;Goodnight Moon&quot; succeeds in entrancing every toddler (and every toddler's parent) who sees and hears it. Unlike many other books suitable for children at an early linguistic level, &quot;Goodnight Moon&quot; manages to capture both adult and child in its charms. The repetitive structure never bores, as it constantly surprises with its rhymes and subjects (I still laugh at the blank page where it goes &quot;Goodnight nobody&quot;). My daughter is now three, and she isn't quite as excited by the book as she was when she started hearing it at one, and when she insisted on it every night when she was two, but she still likes to take it out every once in awhile. I still love &quot;Goodnight Moon,&quot; however, and look forward to reading it to my next child, and to my grandchildren. I only wish my mother had known about this book when I was a child!",
                "review/helpfulness": "70/77",
                "num_reviews": 77
            },
            {
                "review/text": "We received this book/plush bunny set as a gift. We love the Goodnight Moon story, and read it almost every night. Our 8 month old daughter, while she thinks the board book is delicious, has adopted the 5\" Bunny as her very favorite Lovey, and won't go to sleep without him. He is just the right size for an infant. He has a grey faux-fur head and \"hands\", and wears blue-striped pajamas with textured feet. His eyes are the bead-type, rather than embroidered, but they are very well attached. The ears are long enough to get into her mouth for serious sucking, and the arms are well-stuffed, making for good gnawing. His body is stuffed with the microbeads, and my only complaint (thus 4 stars, not 5) is that he is labelled \"surface wash only\". I have, due to the daily baby-spit, given him many baths, and he seems to dry out just fine.",
                "review/helpfulness": "37/37",
                "num_reviews": 37
            },
            {
                "review/text": "A few weeks ago i was looking for a copy of this book for my 6 month old cousin, and my boyfriend just happedned to be in the store with me, and he said he had never heard of good night moon. I told him he was seriously deprived as a child not having read this book, it is a must have for all children, it will lull them to sleep before you know it. I remeber fondly my parents reading this book to me as a child, and since that time i have been deovouring everybook i can get my hands on, but this one always brings back the magic of our childhood.",
                "review/helpfulness": "21/29",
                "num_reviews": 29
            },
            {
                "review/text": "My 18 month old son absolutely ADORES this book. I'll have to admit, I find the colors garish, and the illustrations I might have doodled myself, but this is by far my kid's favorite book. The cadence is soft and musical, and I can't believe that my son can point out the mouse on every single page. Point it out? He practically bashes the book out of my hands trying to show it to me. He always wants this book before he goes to sleep at night, and it's a joy to read to him. An absolute MUST for any nursery shelf. I highly recommend it.",
                "review/helpfulness": "21/27",
                "num_reviews": 27
            },
            {
                "review/text": "This book and I met when I was a child...that's a long time ago , and now that I have 3 children of my own , ages 9 , 5 &amp; 2 years , I made sure they each had their own copy. Hardcover is best , because it lasts...I still have my childhood hardcover copy...talk about growing up together! Although my 2 older kids have sort of &quot;outgrown&quot; their copies , my 2 year old loves reading hers. She wants to &quot;read together&quot; all the time , as she calls it , and she loves to search for the little mouse on all the colored pages! Her older brother and sister enjoyed doing that , and , yes , so did I! It's great for spending quiet time before going to sleep , or just anytime! A timeless classic!",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "I have a friend who has recently become an elementary school teacher and is teaching kindergarten. She talked me into coming in to read to her class--any book(s)I wanted to bring with me.My reading gig is coming up this week so this past weekend I asked my 16 year old daughter to go through her old children's books (she has 50-60 of her old favorites still on a bookshelf in her room) and she emerged with 2 or three books for the kid's but also with Goodnight Moon--which she wanted me to read to her.As Miss Zoe was growing up we'd read every night and Zoe (my daughter) got to choose what we read. She'd usually pick 2 to 3 books and, for years and years, Goodnight Moon was always one of them.The book itself is somewhat inexplicable--mostly it's just a silly little poem, really--but for my kids it really struck a chord. All I know is that if your sixteen year old daughter wants to curl up on the couch and have you read one of her childhood books to her, that's quite a book.I always give this to friends when they have a first baby, and I have always found that a few years later they are still telling me it is their kid's favorite book.So don't try to figure it out, just buy it and read it to your kids. It'll be a treasure you share for years.",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "I bought this book as a gift for my sixteen month old and hefell in love with it. I also have a five year old that really enjoysit too. When they go to the book shelf they always bring this one back first,and we have to read it two or three times before they go get another book. I would recommend this book to anyone looking for a good children's book.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            }
        ]
    },
    {
        "Title": "a big ball of string",
        "description": "After winding a large ball of string, a young boy has fun finding ways of using it.",
        "authors": "['Marion Holland']",
        "infoLink": "http://books.google.com/books?id=C_-NzgEACAAJ&dq=A+Big+Ball+of+String&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This was my favorite book growing up. I love the drawings and the ideas the boy came up to do with his string. I decided to go online to look for a copy I could read to my own kids. Now that I see how rare it is, I think I'm going to beg my parents for my old book back. Its a well worn book and has had its spine taped since it was read so much. But that's ok -- I still love it. (Besides, its all ready personalized for me -by me- in big red crayon &quot;Kerry&quot;)",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "A wonderful rhyming story of Imagination and CAN-DO ability of a 6-9 year old child. The story begins with things to do with string out of bed. It ends with how many things can be done from bed. My decrepit copy begins at page 19, however is still enjoyed by, and hopefully inspires, first graders to step away from the TV. A MAGAZINE company advertises String a ma Thing a toy that had to have been inspired by this inventive boy. My copy is an orange-red hardcover, written and illustrated by Marion Holland and precious.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a wonderful rhyming book that falls back time and time again on the refrain, \"...I can do anything, anything at all!\" and is much more than a beginning reading book. It is thrilling to a child (and to an adult for that matter) that with something as simple as string they can do so many different things, even while sick in bed (part of the theme of the story). My next-to-youngest child of four children begged me to read this book aloud over and over long after his beginning reading days were over. I think it struck a chord with him in regard to his natural mechanical abilities, and he started around then taking things apart and fixing them. Now at 25 he can fix just about anything. Our copy is falling apart, but I plan to keep on gluing it, taping it, or whatever is required to be able to keep on reading it, including to my grandchildren who are now under my homeschool tutelage and my great-grandchildren and great-great-grandchildren, should I be blessed with so many years.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is a wonderful read-aloud book for very young children. I have an original copy which I now share with my four children. The repetition and sing-song lyric make it easy for very young kids (2-3) to &quot;read&quot; along. My copy is 36 years old and still going strong!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I have the original book, &quot;A Big Ball of String&quot;, that was written and illustrated by Marion Holland (copyright 1958). This book, a family favorite, has been enjoyed by three generations of our family. It has been used so much that it is literally falling apart. Even at 22, I find myself picking it up for a good laugh.The curious little boy in this story goes on an adventure, finding a &quot;good thing&quot; to do with his big ball of string. I laugh every time I read it. Especially funny, is that he spends a lot of time out of bed, using the string to help him stay &quot;in&quot; bed. The rhymes and phonetics of this book are clever and catchy. I give this book a two thumbs up!!!!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am now 21 years old and I still remember this book being read to me as a child. My parents' copy is torn, colored in, and warped from humidity. If you are lucky enough to have this book for your kids, you can be secure in the fact that this is one that we (kids) remember fondly.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "The book is in rhyme and tells the story of a little boy finding out many ways of using his &quot;big ball of string.&quot; The illustrations are terrific and what captivated me as a child.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My husband used to have this book as a child and wanted a copy as a memory!! He was so excited when he opened his gift on Christmas that he sat there and read the whole book to the family!! Thank you for having this book available for me to purchase!! It is now on display at his office because this book brings back special memories of his childhood.Thanks",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is definitely my favorite book from my childhood...I read it over and over and over...still have it (very worn!) and it has resonated through my whole life! As a kid, I also had a ball of string and loved making things out of whatever I could find, too! I have been motivated by this book's powerful and positive message to explore many mediums of creativity throughout my life. Like the boy in the book, you can just see how fun it is!!! My latest creative venture is passing the torch to the next generation of creative kids through a recycling and creativity-inspiring TV show called \"Ms. Mola's Make-ola!\" - find us on Facebook or at [...] & join the creative fun! My hope is that every child receive this book's message in their life - \"I can do anything...!\" - and be inspired to create all kinds of wonderful inventions that can change their world and ours!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is a favorite of my daughter and especially my son. We can all relate to our own childhoods --playing with ordinary household items to bust the boredom. In fact my kids like it so much we are giving it to cousins for presents this year!This book is a warm fuzzy ---forever in one's memory like the smell of homemake chocolate chip cookies.Each time my son takes string, old film canasters, and various found &quot;treasures&quot; including my furniture I feel this book has been a major part in sparking his creativity. This book encourages children to find ways to play they may never thought of before!Although 1958 model, it's a classic.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "feathers from my nest a mothers reflections",
        "description": "In a collection of vignettes, the bestselling author of \"Things Pondered\" reflects on items belonging to her daughters as they leave the nest for college. While these \"feathers\" are seemingly insignificant, each item holds special memories and spiritual insight.",
        "authors": "['Beth Moore']",
        "infoLink": "http://books.google.com/books?id=TJWcLkiX3CsC&dq=Feathers+from+My+Nest:+A+Mother%27s+Reflections&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As my nest is emptying (our youngest went off to college this fall), I look at those &quot;empty nest&quot; books with a combination of hesitancy, desire to know someone else's experience, and disbelief that I am really at this stage. It seems we just brought our first baby girl home from the hospital (it was only 22 years ago, which often seems more like 22 months!).I'm thankful to the Lord for my children and for my dear husband - that after all these years, we still have things to talk about, experiences to share, and plenty of love left for each other.So I opened this book, not real eagerly, I must confess - after all, this was about a book that I really wasn't ready for! The 4-page introduction &quot;Feathers from My Nest&quot; alone is worth the price of this book! Talk about telling it like it is! Mr. Sparrow is talking to Mrs. Sparrow as she's trying to gather feathers from her nest - memories to take with her on their new journey together.I have to thank Amazon for making it possible to get a better look inside the books we buy from them - the pages you will see are part of the first chapter of the book AFTER the intro I just mentioned. You'll get an idea of Beth Moore's writing style.Each chapter talks about a certain &quot;feather&quot; that's been left behind in Beth's nest when her two daughters flew away. One chapter is &quot;The Crumpled Kleenex&quot;. Mom spends some time in her daughter's bed after the daughter leaves home and she finds this kleenex and she wonders what the tears were about. &quot;The Binders&quot; talks about one of her daughter's method of proclaiming that she was making a new start with her schoolwork - this chapter has lessons for us all on the grace of God. &quot;The Magazines&quot; chapter discusses the family's struggle with how our society values skinny women and how it impacted one of their daughters and their fight to pull her from the clutches of an eating disorder. And &quot;The Green Cap and Gown&quot; is about graduation, of course.The last chapter is entitled &quot;One Slightly Gray, Well-Seasoned Man&quot; and is about her husband Keith. A perfect ending for this story of feathers left in their nest. Beth is looking forward to the rest of her life with this wonderful man who was there at the beginning - before there were little chicks to leave feathers behind!This book is a fabulous book for moms of all ages. Don't think that it's just an &quot;Empty Nest&quot; book. If you have children getting ready to try out their wings, this is a must-read.I haven't read Beth Moore's other books (most notably &quot;Breaking Free&quot; and &quot;Praying God's Word&quot;), but I would like to.If you have a child in high school or college, you simply must read this book. My other very-favorite book on parenting older kids is &quot;Give Them Wings&quot; by Carol Kuykendall, which covers parenting from driver's license to leaving home. Excellent book!You might want to check out my reviews of other Christian books and music.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is another winner from Beth Moore but very different from her other Bible study writings. This is a more personal look into her own family life and is an absolute must read for any mom. It is written from an empty-nester's point of view, but as a young mom of a two and four year old, I found it so comforting, inspiring and uplifting. I know their time with my husband and me is short, but this book helped me have some perspective. When you have young children close in age, sometimes the days are long and tiring, but this book has helped me see things in a new light. I want to have many feathers to reflect upon when my precious ones leave this nest. Well, blessings to all who read this; I hope it has been helpful, and please do read this sweet book!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is so wonderful, a perfect read and gift for Mother's Day. Beth Moore ministers to me in a new way every time I read something of hers. I truly loved this book, it is a keeper and one I will read over and over. Read it--you will not be disappointed!!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I read Beth Moore's book after experiencing two miscarriages and trying to get pregnant for the third time. Her Godly approach to motherhood made me realize that God gives us children as gifts and blessings - regardless if it is for a few months in utero or for decades on earth! She gives a personalized insight on how to try to raise children to love Christ - in a world that often makes that difficult! I would highly recommend this book to any woman - moms, daughters, moms-to-be, or as I was when I read it, a mom wanna-be!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The book is a great pick me up to remind all moms what will be left behind if we are careful to keep the little things intact. It will make you laugh a little and also cry. Beth Moore is a great individual for letting us in on some of her very own secrets from family endeavors. It makes the author seem more real and up close to us as individuals. I enjoyed it because as a woman and mom, I can see myself inside her circle of heart beats and feel the warmth. She is a blessing. Another book I must tell all Beth Moore lovers to quickly grab at the very first chance is another Christian mom, parenting columnist and author, &quot;Mommy-CEO,&quot; by Jodie Lynn. Not only are they strong in comparison towards mother feelings, life and children challenges, but also in sharing their own mistakes and claiming to let go and let God direct our spirits.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I took this book with me on vacation and read it while on the beach. It is a great book about being a parent and seeing your children grow up and away. The book offers much insight into the Moore's personal family life. In one of Beth Moore's other books, &quot;Praying God's Word: Breaking Free from Spiritual Strongholds&quot;, you realize that she and her family have had to deal with many family issues or personal crisis. This book looks at those same crises from a different angle by giving the details behind the challenges and explaining how they were dealt with in their family. If you are a Beth Moore fan, you will certainly want to pick up this book. Her family isn't perfect but is an inspiration.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This wonderful little book about Beth and her husband going thru empty-nest made me feel a wide range of emotions. She is a brilliant writer and always amazes me how she can be a faithfull follower of Jesus but still have so much FUN!! What a refreshing christian woman..Buy the book.. you won't be disapointed.. Beth allows you a 'peek' into her private life. If you have taken a bible study that she wrote you will get snapshots of her life.. this book fills in the holes a bit..Great reading!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "As usual, Beth Moore is speaking from the heart. She is such a joy and blessing to share her insight into her personal family life. It makes us feel normal and safe to read small and large challenges she has gone through. It also reminds me of a couple of other good readers - Prayers on My Pillow and More Prayers on My Pillow.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Very touching...touches all emotions. I bought three more to share with other family/friends who are mothers. Great choice as a gift for moms whose children are leaving for college.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "never talk to strangers",
        "description": "Discusses different situations to help make important distinctions between people who are \"safe\" and people to avoid.",
        "authors": "['Irma Joyce']",
        "infoLink": "http://books.google.com/books?id=siZpHjMbeZ0C&dq=Never+Talk+to+Strangers&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I purchased this book at the same time I purchased Protecting the Gift: Keeping Children and Teenagers Safe by Gavin De Becker. I read Never Talk to Strangers first, and was very disappointed. What do camels with bony knees, grouchy grizzly bears, parachuting hawks, a rhinoceros waiting for a bus, coyotes asking the time, and cars with whales at the wheel have to do with teaching my child about strangers - other than their ability to rhyme with the phrase &quot;Never talk to strangers, please.&quot;?After reading Protecting the Gift, I decided to return this book rather than share it with my 3 1/2 year old daughter, especially after the author specifically mentioned the book Never Talk to Strangers in a chapter about why merely teaching children not to talk to strangers doesn't work. I would rather teach my children that it is *strangeness* (inappropriate behavior that's relevant), not strangers, that can be dangerous.",
                "review/helpfulness": "24/35",
                "num_reviews": 35
            },
            {
                "review/text": "I was so excited to find this book, it had been a favorite of mine as a child. Unfortunately when it arrived I was horrified to find that it was published with a new illustrator. The old book had the most beautiful, colorful, magical illustrations. This new addition is drab, and lacks any of the charm of the previous edition. Im sending this book back. Although the theme of the story is an important one, its a shame that they had to change the illustrations.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "This was one of my favorite books as a child. It was very clear to explain how children should be aware of strangers. This book gave a good description of some of the &quot;animals&quot; children should be aware of by using animal pictures. Considering some of the problems going on with children missing today this book should not be out of print!!!!! I would love for every child in my family to have access to this book.",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "So who WAS the stranger, was it the bear, or was it the Camel, or was it the bee playing a bassoon? My kids couldn't tell you.Unfortunately I read this story with my kids the first time. I was horrified as I read through it with them. They enjoyed the silly humor, but I bought this book to teach them about strangers and strange behaviors.This book completely missed the mark! How often does a Camel or a rhinoceros barge in to their lives? I had to explain to them, after the story, the whole stranger theory. And the first thing out of my child's mouth was \"Ya, and you got to watch out for camels too.\"To make matters worse it suggests that because your friend or family knows someone, they are \"OK\". Most sexual offenders are by people your friends or family know.I don't think this is really a book for young children. I think it is too confusing to distinguish WHO the stranger is and how to handle a real life situation. Such as getting away quick and telling a trusted grown up.All and all, I might be over reacting a little bit but when it comes to such a difficult subject, I want to make sure they CLEARLY get the message I am trying to teach them.",
                "review/helpfulness": "11/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is an old-time favorite book of mine, published the year I was born. I've waited a long time to find a copy for me to share with my child. The illustrations are fabulous and the rhymes keep kids giggling. It's a sweet message, but not one that's meant to teach all aspects of personal safety. I'll always love this book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "A reality based approach to teaching children to avoid strangers is best. Kids NEED to know that a grandmotherly lady may in fact be a threat and the nice man given out candy is to be avoided. NOT 'don't talk to the pushing rhino or the grumpy bear' What young kid will get the point of this book? And NO, the Easter Bunny is not to be trusted 'because everybody knows him'! This book gives kids the wrong idea completely. Be honest with your kids. A little fear of strangers is a good thing. Look into John Walsh's \"Stranger Safety\".",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was a part of my childhood collection and I loved it. Can't wait to see the updated illustrations. Strangers were always a tremendous and constant concern to my parents and I can say that this book was a great help in starting conversations and showing us the difference between a stranger and other people we encountered. As a teacher, mom and former child, I highly recommend this story. It is both effective and enjoyable.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Finally I found someone else who has heard of this book! This is a fun little rhyming book for children. It teaches lessons about not talking to strangers, but the book seems a bit naive by todays standards. Read it to a child for the just for the joy of it. You may find it a great opportunity to start up an important conversation with him about strangers. You may just like the rhymes.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree with some of the points that previous reviewers have made about the world that we live in today and that not everyone can be trusted ... HOWEVER ... there is something to be said for misleading statements. Pages such as \"everybody knows the Easter Bunny\" can open the lines of communication between parent and child at an early and CRITICAL stage in a toddler/preschool childs life.TALK TO YOUR KIDS ABOUT SAFETY -- don't wait or wish that a book will do it for you!!! If you expect a book to teach your child right from wrong or about not talking to strangers, you are sadly mistaken.Reading to your children is a fundamental and entertaining way to continue to build the bonds of trust between you and your child. You SHOULD read this book to your kids and then explain to them that not all can be trusted but that it is worth the time to know and understand the difference and proper manners.The excellent illustrations and clever rhymes will build a continuity for your child. I remember reading this book when I was in kindergarten and now years later, I still believe that it is a good read. Times haven't changed much when it comes to who you can and can't trust.Be smart, take the time to talk to your kids about who can and can't be trusted, but don't blame the message and disregard it completely. That is one thing that won't change ... \"NEVER TALK TO STRANGERS\".",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My parents bought me this book when I was a kid, and I read it so many times I almost had it completely memorized. It taught me to be careful about strangers -- it actually scared me a bit, because I was afraid that if I talked to a stranger, he might kill me and chop me up in little pieces. But, it is a good lesson for kids to learn (especially nowadays), the pictures are fun, and the story is fun to read (and be read to).Edit:Thanks for the alert from other posters, I purchased from one of Amazon's resellers and got the old edition with the charming illustrations that I loved. My son is still too young to understand the lessons of this book (and now I'm having some reservations about that, he's such an outgoing, charming child and I don't want that to change ... maybe I'll temper that lesson with \"don't talk to strangers if mommy or daddy isn't with you\") and we enjoy sitting and looking at all the funny creatures in the pictures. If you can find an old edition, buy it instead.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the amazing bone",
        "description": "It's a bright and beautiful spring day, and Pearl, a pig, is dawdling on her way home from school. Most unexpectedly, she strikes up an acquaintance with a small bone. \"You talk?\" says Pearl. \"In any language,\" says the bone. \"And I can imitate any sound there is.\" (Its former owner was a witch.) Pearl and the bone immediately take a liking to each other, and before you know it she is on her way home with the bone in her purse, left open so they can continue their conversation. Won't her parents be surprised when she introduces her talking bone! But before that happy moment comes, the resourceful bone must deal with a band of highway robbers in Halloween masks and, worse, a fox who decides that Pearl will be his main course at dinner that night. And deal it does, with gambits droll and thrilling. William Steig, incomparable master of the contemporary picture book, has never been better than in The Amazing Bone. The Amazing Bone is a 1976 New York Times Book Review Notable Children's Book of the Year and Outstanding Book of the Year, a 1977 Caldecott Honor Book, and a 1977 Boston Globe - Horn Book Awards Honor Book for Picture Books.",
        "authors": "['William Steig']",
        "infoLink": "https://play.google.com/store/books/details?id=S0wTAgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book based on the fact it was a Caldecott Honorable Mention and based on the reviews. I have to say my son loved the book until we got to the part where robbers in Halloween masks jump out of the bushes and put a gun to Pearl's head. Hello? You reviewers out there. My son (3, almost 4) was shocked. He asked a zillion questions about the robbers. Weren't they bad? Did they hurt Pearl? Why (how come) they were robbing her? The next day the questions continued. I bought 10 Caldecott books and we were reading the books right out of the box and I failed to preview the story. Big mistake. This book is charming and wonderful except for the robbery scene which is graphic and extremely disturbing. That scene also seems out of place. In my opinion, it does not belong in a children's book. Parents of young children--beware of this book. Adults, enjoy it.",
                "review/helpfulness": "55/69",
                "num_reviews": 69
            },
            {
                "review/text": "Why hello book of my youth! And may I say, how pleasant it is to read you once again. I know it's been at least 20 years since I was but a wee tot on my mother's knee. She would read \"The Amazing Bone\" to me time and time again, and I really did find it a delightful story. Now, years and years later, I read it again. There's something about a good Steig book. And to me, this is the most evocative of his stories. Oh, there are people firmly devoted to \"Sylvester and the Magic Pebble\". And I daresay \"Shrek\" and \"Doctor De Soto\" have their fans as well. But give me \"The Amazing Bone\" over these trifles any day. It's a warm ribald thoroughly satisfying tale of a young pig, a talking bone, and the troubles that ensue.Pearl is a sweet young pig winding her way home one day. Enjoying the people around her, the clean crisp air, and the softness of the flowered glens, Pearl is a bit like Little Red Riding Hood. She is in no particular hurry to get home. When Pearl stumbles across a magical talking bone, she is delighted. The bone too is quite happy and the two make a delicious pair. When robbers (frightfully dressed in scary masks and carrying guns & knives) attempt to rob little Pearl, the bone successfully drives the bandits off with scary sounds. Some parents find this an inappropriate portion of the tale and will make a very big deal about it. Honestly? It's just a little too weird to seriously freak out a child. I daresay parents are the ones frightened by this part of the book. Not kiddies. Continuing in the story a dapper fox is less gullible than the silly robbers. When he decides to make Pearl his meal, the bone's cries are in vain. It is only through a series of fortunate turns of fate that Pearl and her bone may return safe and sound to her home and her parents.Don't get me wrong. The story is doggone bizarre. One of Steig's weirdest by far. Steig was a fan of the small common object (bone, pebble, etc.) containing great grandiose powers. His stories often focus on the little fellow outwitting the big (sometimes literally). And foxes were his favorite villains. Often elegantly dressed, they have the capacity for pity. They just ignore it. This particular story is especially disturbing because of the nature of Pearl's abduction. The fox forces her into his abandoned shack, leaving her cowering on the floor of a room. Want to drill into your children the horrors of strangers and the dangers of going anywhere with them? I can't think of a better method of getting this point home (though, admittedly, I don't remember getting that message when I myself read this story as a child). Though the book certainly contains creepy possibilities, the story is a good one. You're safe with Steig. And just a word on the beauty of his illustrations. Though Steig obviously preferred to grow messier and squigglier in his creations as he aged, no scene in children's picture books is more perfectly pastoral than the shot of Pearl reclining amongst the flowering trees and fields. All in all, a great story couched in a great book.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Before talking generally about the book, let me share my reaction that children who are sensitive and easily develop fears may find this book to be too much for them. Read this book first before reading it to your child. The sections in question have robbers threatening to kill Pearl the Pig and a fox planning to do the same thing prior to eating Pearl. I found both situations a little rougher on the emotions than the standard Little Red Riding Hood fare in this regard.This story was a Caldecott Honor book in 1977 as one of the best illustrated children's stories of that year. The book has many outstanding features. First, the watercolors and ink outlines nicely convey bright, spring colors and create a light mood. Second, the story has a very funny plot device in having a major character be a talking bone. Third, the plot reversals are quite sudden, dramatic, and emotionally laden. This book will make quite an impression on its readers. Fourth, the book raises very nice questions about all kinds of human relations that will keep you and your child talking for years.Pearl the Pig dawdled in town after school. Her purpose was to watch the grownups doing their work, in order to think about what she might do when she grew up. She watched street cleaners, bakers, and &quot;old guffers&quot; pitching horseshoes.Then she headed home through the forest. Once there, &quot;she could almost feel herself changing into a flower&quot; as she looked at the beautiful scene around her.&quot;I hear something.&quot;&quot;So do I,&quot; a voice answered. &quot;I'm the bone in the violets near the tree by the rock on your right.&quot;&quot;You talk?&quot;&quot;In any language . . . .&quot; &quot;And I can imitate any sound there is.&quot;&quot;How?&quot;&quot;I don't know. I didn't make the world.&quot;The bone reports that it fell out of a witch's basket in August. The bone didn't want to return. &quot;I'd be happier with someone young and lively like you.&quot;From out of nowhere, three armed highway robbers wearing masks rushed them, and threatened to shoot Pearl. The bone hissed like a snake and roared like a lion in her purse, and the robbers bolted.Next a fox grabbed her. &quot;You will be my main course tonight.&quot; The bone claimed to be a ravenous crocodile, but the fox was not fooled. The fox found the bone and put it in his pocket.Just when the fox is about to do away with Pearl, the bone starts in incantation. The fox starts shrinking! Pearl is saved.&quot;I didn't know you could do magic!&quot;&quot;Neither did I.&quot; The words &quot;just came to me.&quot;They went home and told Pearl's distraught parents about their adventures. The bone stayed and became part of the family. The bone rested in an honored place on a silver tray on the mantlepiece, except at night. Then, the Pearl took the bone to bed, and they talked and talked. They also sang.The bone always kept the house full of music and sounds, even when the family didn't want them.As you can see, without the extreme threats of violence, this is a very funny and original story. So if your child likes things a little on the scary side, this will be a five star book. If you child is timid on those issues, avoid this book until that changes. I averaged that perception out to four stars, assuming that most children around 6 could handle the threatened violence and the abductions well as fantasy.The benefit, of course, of a story like this one is to open up the subject of what your child should be doing when alone, when in the presence of strangers alone, and how to handle the kind of events that parents don't like to even think about happening. A good way to begin this discussion is to ask your child what Pearl should have done differently. What could the bone have done differently? If the bone were another child, what should the other child have done? And so forth. You get the idea.Would you like to have a talking bone as a friend? Personally, I'd like to find out more about what kind of music the bone likes to make first.What would you like to do when you grow up?Travel to the limits of imagination to find the potential for good in the world around us!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "These words are spoken by a fox, one of the villains of this book, to a talking bone, one of the heroes. The bone is not inanimate - it is a sentient creature with feelings and a sweet disposition.There is no doubt that Steig is brilliant, but in The Amazing Bone he seems to have lost his bearings. How can a book purportedly written for children include a character that takes pleasure from inflicting pain, and describes it in this graphic way?The fox also menaces Pearl, a darling piglet who is the other protagonist of the book. Her trouble starts, as it might for any child, as follows: \"It was a brilliant day, and instead of going straight home from school, Pearl dawdled\".As she slowly makes her way home through idyllic scenery, Pearl happens upon the talking bone. \"'May I take you home with me, wonderful bone?' Pearl asked\".But the happy scene is soon interrupted by three masked robbers who put a gun to the head of the innocent child. With the help of the bone Pearl escapes, only to fall into the clutches of the even more sinister fox. The shocking threat of torture follows as the valiant bone tries to rescue its new friend for a second time.\"When they arrived at the fox's hideaway, he shoved Pearl into and empty room and locked the door\". While there are many such scenes in the Little Red Riding Hood genre of fairy tale, there is something particularly violent and dark in Stieg's portrayal. The image of Pearl cowering on the floor of the locked room awaiting her fate is disturbing to the extreme.Notwithstanding a happy ending it's clear that this book can't be recommended for children, and that it isn't intended for adults. This being the case it is surprising that in 1977 it was recognized by the American Library Association as a Caldecott Honor Book. Certainly Steig's artful and evocative illustrations are remarkable, but should not have been sufficient, in and of themselves, for the conferring of this prestigious award.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I almost didn't buy this book after reading some of the reviews here. Of particular concern was the gun scene. It gets a lot of press here. I'm not sure why really. More explicit gun scenes can be found in Animalia. I guess my take is this: If a book is glorifying guns, encouraging children to use them as toys, and you happen to be a non-gun-owning hippie like me, you'd avoid that kind of book. But this book isn't doing that. It's bad guys with guns. Guns that really are an aside from the plot. They aren't even that scary either. Hmph... Big deal. Turns out the scariest part of this book is fearing for poor Pearl's life when she's in the the fox's house. At least it had me on the edge of my seat. All turns out well in the end.My daughter loved this book too, and was ready for the second read just an hour later. She didn't seem troubled by the twists this tale takes. I think she knows it's just a story. She went to sleep without a hitch tonight. I guess she's just not scared. Except for the fear of the air conditioner vents and the flashing alien lights inside them. Yep. And she didn't even read that in a book. Come to think of it, we don't have any children's books about aliens or air conditioner vents. Hmm...I don't think I'd define this book as being bizarre. I'm a little disappointed really. I was expecting something far more... well... bizarre. Thinking alien lights are in the air conditioner vents is bizarre. Maurice Sendak's \"In the Night Kitchen\" is bizarre. I mean a talking bone isn't much less believable than a pebble that grants wishes, right? Bad things happen to good pigs? Not bizarre. Ironic statements? Wily foxes? So not bizarre.If you're a fan of Steig, this story is a nice add to the collection.If your child is already scared of animals wearing Halloween masks and brandishing pistols and/or sinister foxes who confess they aren't ashamed for being carnivores because if foxes aren't supposed to eat pigs then why are pigs made of meat (even nice pigs), no need to heighten their fear.This is a fairy tale. It isn't any scarier than a Grimm's tale, and probably less than most. If it provokes conversation with your children, talk, and pat yourself on the back for reading them a book that made 'em think, rather than just handing them a remote control.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Steig is my favorite children's book author and The Amazing Bone my favorite of his books. I love the characters and the sense of evil conquered by the lovely piggirl. His depiction of spring is wonderful, like a breath of fresh air. Steig transports the reader with his sweet magic, but always maintains a balance with his evil characters lurking just around the corner. Read all of his stuff, you'll truly be a better person for it.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "What if you were to find a talking bone? Well, you would be shocked too, just like a little pig named Pearl in The Amazing Bone by William Steig. Pearl was walking and then she stumbled over a talking bone. She liked the bone very much. In The Amazing Bone I liked when the bone started saying strange words. They were not even real words. The author's message is to never wander around too long. What will the fox do to Pearl after he finds her? Read this book to find out.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Our two children, ages 3 and 6-1/2, absolutely LOVE this story, and we love reading it to them, as it is a very fun book to read aloud. I suppose it contains some edgy elements for a children's book: violence is threatened several times, and Pearl (the darling protagonist/pig) is almost eaten by a fox -- but is this any more violent than, say, The Three Little Pigs? As William Steig says several times in this beautiful, enjoyable tale, \"I didn't make the world.\" That being said, I suppose this story isn't for everyone, and I wouldn't recommend it for children who are especially young or easily scared, but having read a TON of children's book over the last six years, this is one of the few for which I've been moved to write a recommendation. Honestly, just hearing my kids running around exclaiming \"Have you no shame, Sir?!\" to each other (and everyone else) and then bursting into giggles was worth any talk explaining why foxes want to eat pigs. I'd give it six stars if I could, but then, I didn't make the world.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "While this book is often only found in the children's section, &quot;The Amazing Bone&quot; is in my top three favorite books of all time, (along with &quot;Tiffky Doofky&quot;, by the same author...)and should rightfully be shelved in every section of the library or bookstoreThis book has all the elements of a literary masterpiece and pulp combined; taut suspense, life-threatening dilemmas, love, life, drama, humor, insight. Simply fabuluous, a must have for anyone, literate or otherwise. Buy now before it's out of print...or regret it the rest of your life.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This children's book is about a young pig who finds a magical talking bone and how the bone helps the pig named Pearl getting out of predicaments. Children really enjoy hearing this tale. The book was a 1977 Caldecott Honor book (i.e., a runner-up to the Medal winner) for best illustrations in a book for children.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "did i ever tell you how lucky you are classic seuss",
        "description": "Dr. Seuss's irrepressible optimism is front and center in Did I Ever Tell You How Lucky You Are? \"When you think things are bad, when you feel sour and blue, when you start to get mad . . .you should do what I do!\" So begins the terrific advice of the wise old man in the Desert of Drize. This classic book provides the perfect antidote for readers of all ages who are feeling a bit down in the dumps. Thanks to Dr. Seuss's trademark rhymes and signature illustrations, readers will, without a doubt, realize just how lucky they truly are. This Read & Listen edition contains audio narration.",
        "authors": "['Dr. Seuss']",
        "infoLink": "https://play.google.com/store/books/details?id=2bw4DwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Theodore Seuss Guisel is, of course, one of the best known children's authors today. Though he left us in 1994, his legacy lives on and his books are still produced, bought and loved as much now as anytime in the past. When we think of him, we immediately think of &quot;The Cat in the Hat&quot; or &quot;How the Grinch Stole Christmas&quot;, but we can easily forget some of his wonderful, lesser-known works. &quot;When I was quite young and quite small for my size I met an old man in the Desert of Drize...&quot; So begins &quot;Did I Ever Tell You...&quot; where the narrator finds an old man sitting atop a prickly cactus in the middle of the desert. The man tells the boy narrator that whenever HE feels like his life isn't going well, he reminds himself how lucky he really IS. He could be, for example, a construction worker on the impossibly rickety Bunglebung Bridge, where workers are toiling over the water to finish the impossibly crooked structure. Yes, things could be far worse!! You could be a Poogle-Horn Player who has to honk away on your complex, tuba-like Poogle-Horn while descending a flight of stairs... on a two story unicycle, no less!! The absurdness of people less fortunate splash across each page, Seuss-like, as Mr. Bix wakes up at 6 in the morning to find that his Borfin has schlumpped over, or Mr. Potter who has to dot i's and cross t's on endless, miles-long spools of paper! Yes, things could be far worse than they are, Ducky, so count yourself lucky! Published in 1973, &quot;Have I Ever Told You...&quot; is a wonderfully funny book with some subtle messages. Written during a period of time when parents were still forever admonishing their children, &quot;you're so lucky to be able to eat those Brussels sprouts!! Why, there's children starving in Africa...&quot; the book can be seen as a lesson in morality and thankfulness OR as satire of those very parents who encourage children to think of those less fortunate than them when they crank about life's inequities. Satire or morality play, &quot;Have I Ever Told You...&quot; is classical Seuss at his best. The illustrations are properly absurd and colorful, splashing across the page in Seuss's perennial style. There's humans assembling bridges as well as odd creatures getting stuck in 4-way traffic jams. The illustrations are uncluttered and the text is easy to read, making it an excellent choice for beginning to intermediate readers. A wonderfully fun book, and highly recommended!!",
                "review/helpfulness": "65/67",
                "num_reviews": 67
            },
            {
                "review/text": "Researchers constantly find that reading to children is valuable in a variety of ways, not least of which are instilling a love of reading and improved reading skills. With better parent-child bonding from reading, your child will also be more emotionally secure and able to relate better to others. Intellectual performance will expand as well. Spending time together watching television fails as a substitute.To help other parents apply this advice, as a parent of four I consulted an expert, our youngest child, and asked her to share with me her favorite books that were read to her as a young child. &quot;Did I Ever Tell You How Lucky You Are?&quot; was one of her picks.If my daughter picked the book, you may be wondering why I rated this book at four stars. That is an average rating of five stars for adults and three stars for children. Although my daughter liked the book, I think that most children won't get it. On the other hand, they will think it is funny, and that's a fair benefit from any book. But the moral will be missed.This book is the most humorous variant on the admonition that every parent uses with children: Don't you know there are people starving in Blank! Because someone is worse off than you is supposed to make you feel better. It never worked for me when my parents tried that. After you have lived a while though, you begin to count your blessings. Having seen the downside as portrayed by Dr. Seuss will make you feel even more relieved by poking fun at your self concerns.In this book, you will meet people with all kinds of thorny problems, starting with an old man sitting on top of cactus in the Desert of Drize. Ouch!No job could be as bad as putting the Bunglebung Bridge together. No commute could be as awful as the one on Zayt Highway Eight! If you live in Ga-Zair, your bedroom could be at the top of one tall house and your bathroom at the top of another. Anyone who has ever taken something apart and had difficulty putting it back together again will sympathize with poor Berbie Hart and his Throm-dim-bu-lator, which he has taken apart. Gardening comes in here, too, for poor Ali Sard makes so little money mowing his uncle's grass that he has to moonlight by painting flagpoles.Just to tell you how effective these images are, I found myself practically having frustration daydreams by just looking at them again. Dr. Seuss knew his audience of older children well.If your child loves the book, don't hold it back. But if you love it more, just borrow it from time to time when you need a morale boost!After you have finished reading and enjoying this book, ask yourself how you could take your now-perceived good luck and turn it into even greater luck. If you are like me, you will often have resources and capabilities that you take for granted. How else could you be using these blessings to your advantage as well as the advantage of your children, those you love, and others?...",
                "review/helpfulness": "47/51",
                "num_reviews": 51
            },
            {
                "review/text": "Adults as well as children appreciate this book. The message that we should all consider how lucky we are is delivered in classical Seuss style with rhymes and nonsensical words - but is still a powerful message that most of us need to hear now and then. I consider this one of his best works because it not only delivers a good message, reading it is delightful entertainment. Read it aloud to both young and old.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "When one mentions 'Dr. Seuss' the cat in the hat, Green Eggs and Ham and of course, the Grinch who Stole Christmas come to mind, yet this has always been considered a classic. Why you are asking, just why is that? Is it because it is good, or bombastic? Why is this book considered a classic? Could it be it's marvelous jokes, or it's enjoyable little mischevious pokes, at the world around. Is it because it is so implausible, in fact applausible, in it's own right? Could it be that it is more fun to read at night? Why isn't it here or there? Why isn't it anywhere? The content of the book at charge, is amazingly hysterical, the enjoyment was large. If I had to choose one book by Seuss, this would be the only one to NOT say, vamous. It is philisophical, optical, practical, and factual. It can be enjoyable for 3-year-old Sally or 30-year-old Sam! After reading such a great book, I personally took a second look, at how lucky I really am.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "From my childhood to today, this is by far at the top of my &quot;best book&quot; list. I watch in amazement as my 5 year old ponders the situations and realizes how nice it is to feel secure and loved right in her own home. The philosophy in our house comes from the simple line, &quot;....Thank goodness you're not something someone forgot....&quot;.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This was, by far, my favorite book growing up. I loved trying to figure out how to say the strange words and eventually, I could almost recite the entire book from memory. I still can the first few pages. I don't know that I was helped psycologically, but it sure was and is a fun book!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Did I Ever Tell You... has inspired my children (and me) for 20 years. When we recently discovered our old copy of it, our 3 year old was just as enamoured as our 20 year old was when he was that age. A classic for a positive outlook on life. I have often counted myself fortunate not to be &quot;Poor Ali Sard!&quot;",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "While it is one of Dr. Seuss' more obscure works, it is possibly one of his finest. I have enjoyed this book greatly since my early childhood; so much that I have come back to it several times when life seemed lousy. It mixes an important message with whimsy in true Seuss form.I certainly recommend this book. It is a wonderful and entertaining example of his literary and lingual mastery.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The moral of \"Did I Ever...\" is as much for the adults reading the story as for the kids who're enjoying it as part of a bedtime ritual. Dr. Seuss paints a picture of silly places and people we're lucky we're not, adjusting our point of view to show that we've got it pretty darn good. Probably not a lesson that a 2 year-old will immediately grasp and write a masters thesis on, but a good seed to plant in his mind. And while the deep meanings of life are flying over their heads, the rugrats will enjoy the brilliant Seuss-ian rhymes and illustrations of ridiculous situations (With your bedroom up here... And your bathroom up there!). Definitely a top-ten book for small human people.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I purchased this book for my daughter (a 33 year old 1st grade teacher) for her birthday. It was her favorite book as a child. She read it to her classroom and the kids loved it. No one in her class had heard of this book before. Even the school librarian had not heard of it. It is a great book and of course the illustrations were wonderful. I think the best part of the book is the true meaning of the book that no matter how bad you think you have it or how bad things are, there's always someone worse off than you are. It teaches positive thinking for all ages. My grandsons loved the book too so I know it will end up as worn out as the original book I purchased 30 years ago.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "what about heaven little blessings",
        "description": "A rhyming text consisting of a child's questions about heaven, the responses given, and scriptural references to support the answers.",
        "authors": "['Kathleen Long Bostrom']",
        "infoLink": "http://books.google.com/books?id=JjwKS7h4qgYC&dq=What+about+Heaven%3F+(Little+Blessings)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a comforting book for all ages; I am a 46-year-old grandmother. My grandchildren lost their great-grandmother (my Mother died August 4, 2000). My daughter purchased this book from the Christian bookstore in our town because my 3 1/2 year old grandson is having a very difficult time over the loss of his Nanny. This book immediately comforted my 6-year-old granddaughter. I read the book to them and noted the 3 1/2 year old seemed less angry about the Heaven deal and less resistant to any reference of Heaven. The book helped him in that he began asking, &quot;Where is Nanny?&quot; He had not asked about her at all. He is still slowly coming out with his feelings. When asked what he was getting for Christmas, he replied,\" I need to go to Heaven and check on Nanny.&quot; This may seem like a strange comment, it is not. It shows how much she is still on his mind after 4 1/2 months and that before reading the book to him he didn't know what to say to get his feelings out. Hopefully reading the book to him again will help him realize he can't go there now, he will have to wait. I AM SO THANKFUL FOR THIS BOOK. I cry every time I read this little book. It is such a simple comfort, so plain and explains all I have ever believed about Jesus, death, dying and heaven along with scripture references to back up my beliefs. I read excerpts from the book to introduce it to a hospice support group I attended for coping with loss during the holidays. They raved about the book. I purchased Maria Shriver's book &quot;What's Heaven?&quot;. I rate her book a &quot;1&quot; compared to the &quot;5&quot; I gave &quot;What about Heaven?&quot; and would have in fact given it a &quot;10&quot;.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "My kids love this book! This is a sweet and rhythmic book that answers children's questions about heaven based on scripture (the scripture is in the back). The words are lovely and comforting and paint a beautiful picture of heaven. The illustrations are bright and friendly. I recommend this book to anyone with young children or to anyone who has ever suffered the loss of a loved one.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I applaude the author and her desire to keep this a faith based book. I have been disappointed in other books by well known authors who didn't teach the truth about heaven they just made up feel good scenarios. I think a child can be most comforted with the facts, they are more glorious than anything we could make up. The book is beautifully done.I try to keep an eye out for Christian grief material for children and adults because I teach grief classes. I do recommend this book and a video I...I wish the best to this author and thank her for her work. I know her book will help families and especially children who are grieving.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I had a child who had cancer, and was not doing well. We were told to be prepared. I had been looking for a book about heaven. I fould this book ,and it had everything that I had been praying for. I read it to my children, they found comfort in it. When my daughter passed away, her little brother brought me this book , and asked to read it to him. He knew where his sister was. I have shared this book with many others, young, old, healthy, and ill. They all have loved this little book with a great, and comforting message.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is the best and sweetest book I have read in a LONG time. My 17 month old and 4 year old love it and I enjoy reading it to them so much. I even made my husband sit through a reading the other night. It is a precious book you won't be disappointed you purchased!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a book all parents need to read for themselves and then read to their children. Too many books about heaven have no biblical basis or give wrong impressions. This book is just about everything a parent needs to know to explain heaven and the biblical concept of it to their children.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "For little ones inquisitive about Heaven, \"What About Heaven?\" is a great place to begin to answer the question.Kathleen Bostrom and Elena Kucharik team up to put Heaven in terms and pictures a child will relate to. They keep it simple, but never water it down.Wonderful watercolors by Kucharik frame the charming outline what Heaven really is all about. It'll be more than sleepy bedtime reading as you'll hear your kids beg to hear it again, as they dream.I fully recommend \"What About Heaven?\" by Kathleen Bostrom....",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "what do you say dear",
        "description": "What do you say when: you bump into a crocodile on a crowded city street? a nice gentleman introduces you to a baby elephant? the Queen feeds you so much spaghetti that you don't fit in your chair anymore? This is the funniest book of manners you'll ever read!",
        "authors": "['Sesyle Joslin']",
        "infoLink": "http://books.google.com/books?id=-E__REdog-AC&dq=What+Do+You+Say,+Dear%3F&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I read this book in 1963 when I was 8 years old (for all you math wizards, yes, I'm 45) I was a voracious reader and this one book stands out above all the others as my most memorable read. I read it over and over and laughed just as much each time. I read it to anyone who would sit still for me and even now, when I hear some ask some insane question like &quot;Would you like me to shoot you in the head?&quot;, I think back to my early training and say, &quot;No thank you!&quot; I credit this book for helping form my young personality and believe in all sincerity that I have the warped sense of humor that I do because of my exposure to this book. Get it, read it and then, if they are very polite, share it with your kids!",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a cute book on manners. My kids, ages 3 and 4, enjoy the book and request that it be read regularly. This book gives several scenarios and then asks what the polite response is in those situations. You turn the page, and it gives the answer: \"May I be excused?\", \"I beg your pardon\", etc.The scenarios are really silly, which is probably what my kids like. However, I have not seen them applying the responses to real life situations without my direction, and I think it is because the situations in the book are so humorously outrageous. I know, humor is great for kids and it does make the book enjoyable. It just makes the book hard to apply for the kids I think.It is a little more verbally graphic than what I care for, too, i.e. If someone asks you 'do you want me to shoot a hole in your head' what do you say?So, in summary, it's cute, but not great.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "My 6 yr. old son loves this book and thinks it is hilarious and so do I! He loves to guess the answer after each funny instance and then see if he guessed it right. He's old enough to know that these are not real situations (like dropping in on the dutchess from an airplane through her roof or cutting off a dragon's head!) We just think it's very funny and actually helps him remember what to say to be polite. I think some of the other reviewers should lighten up and not take this so seriously!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Years after reading this book from cover to cover, over and over again as a child, I still smile when I think of the appropriate response to Bad Bart's inquiry &quot;Would you like me to blow a hole in your head?&quot; (A polite smile, and a simple &quot;no, thank you!&quot; as you ride off into the sunset...) The author presents one scenario after another of children in adult &quot;dress up&quot; trying on the roles of appropriate adult interaction in a surreal world of bad guys, bears, and top-hatted talking alligators, made even more interesting by the eccentric behaviors of the &quot;adults&quot; (walking backwards downtown, landing airplanes in parlors, and so forth). Somehow, it all made hilarious, yet deep and satisfying sense to me when I was a little girl. Sendak's illustrations are half the fun!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I loved this book the moment I read it. Maurice Sendak's hilarious and wonderful illustrations are a perfect match with Joslin's words. Humor is a great way to help children remember lessons, and \"What Do You Say, Dear\" is filled with funny /memorable scenarios that you and your loved ones will never tire of reading over and over again.(...)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Without a doubt the most sublime of all manners books are the classic What Do You Say, Dear? and What Do you Do, Dear? by Sesyle Joslin with sly and witty illustrations by Maurice Sendak. No matter how improbable or bizarre the circumstances, good manners should always prevail. Kids today do not hear this book as often as they do franchise character manner books. This should be mandatory reading for all children. It is too much fun to miss.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I am so glad to find this book on Amazon.com! I believe this book went out of print for a few years and was near impossible to find. This was my favorite children's book as a little girl. I used to make my older sister read it over and over again (Actually, I was the little sister, so I couldn't make her. She's just a good big sister.) The illustrations by Maurice Sendak are great, and the story is very witty. However, children will still get a health dose of good manners. I can't recommend this book enough!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I love this book I remember reading it over and over again as a child and now am getting it for my children to read. It is funny and cleaver and leaves me thinking of my childhood.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "A classic book of manners for children of all ages, using outlandish situations to make the point. You accidentally crash your plane into your friend the duchess's house. What do you say, dear? &quot;Pardon me; I'm terribly sorry.&quot; And so on, hilariously. As some of the other posts note, our little hero is threatened at gunpoint by Black Bart, but since the hero also buys a baby elephant on a street corner and hobnobs with royalty, children are able to recognize this as fiction--they only take with them the laughter and good instruction in proper manners. Thank heavens this book is still in print! Your children will adore it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book as well as The Blueberry Pie Elf were the two books I remember from my first grade experience. When my sister-in-law's baby shower came along with the request we bring a copy of our favorite childhood book, I bought this as The Blueberry Pie Elf is impossible to find. My sister-in-law was tickled pink as she, too, remembered this as a child. And, yes, those of you who cringe at anything approaching \"violence\" even in a comedic situation will not find this book acceptable, especially with the question about what to do if a cowboy asks you if you want to get shot in the head, but remember it was a different era when this was written. And since most of us do not have cowboys riding horses wildly down the street while swinging guns around, I think most children will take this in the light it was written. Besides, I didn't even remember this passage until I re-read the book. The one I remember most from my childhood is the one referring to somebody asking you over for a spaghetti dinner and what to say after every course has been spaghetti, and then they bring out spaghetti for dessert. (I'll leave out the answer, as I don't want to ruin the suspense for those who wish to read the book.)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "odd velvet",
        "description": "Velvet is odd. Instead of dolls that talk and cry, Velvet brings a milkweed pod for show and tell. She wins the class art contest using only an eight-pack of crayons. She likes to collect rocks. Even her name is strange-Velvet! But as the school year unfolds, the things Velvet does and the things that Velvet says slowly begin to make sense. And, in the end, Velvet's classmates discover that being different is what makes Velvet so much fun.",
        "authors": "['Mary Whitcomb']",
        "infoLink": "http://books.google.com/books?id=qPG8wAEACAAJ&dq=Odd+Velvet&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book because I know a lot of kids like Velvet and I thought they might enjoy the book as a Christmas present. But I ended up taking it back. All the positive things the other reviews say about the book are true--wonderful, bright, engaging illustrations, good message overall. I think this book might be helpful for kids who are like Velvet if they are having trouble with teasing at school. But if they're not, why tempt fate? I found it annoying that &quot;odd&quot; was the continual word used to describe this little girl who has simple tastes, is not caught up in our materialistic consumer culture, finds joy in life's natural beauty, is warm and friendly, and has a positive self image. Why put the idea into young kids' minds that this is odd behavior! I find nothing &quot;odd&quot; about it, and so I didn't appreciate the subliminal affect of the &quot;odd&quot; moniker being repeated over and over. I'm sure this wasn't the author's intent, quite the opposite. I may be wrong, the book might be an excellent tool for supporting kids who are feeling &quot;odd&quot; in comparison with their peers. I didn't &quot;field test&quot; the book. It might encourage and reinforce Velvet's unique perspective on life. I think I would have liked the book better if the title had been, &quot;Unique Velvet.&quot;",
                "review/helpfulness": "13/20",
                "num_reviews": 20
            },
            {
                "review/text": "Velvet has a golden childhood. She finds beauty and joy in the smallest things and the simplest pleasures. Seemingly without any concern for peer group criticism, she carries on unaffected by the observations and mild teasings of the other children in her class. Eventually, of course, they come to appreciate Velvet's perspective, and the class princess even considers her a friend (no small feat in real life). The skewed perspective of the illustrations works to bring the focal point to the fore. Squatters at the back of the classroom's reading rug can easily see the most important detail without being distracted by other detritus on the page. This book is one of those high-demand repeats in our kindergarten and first grade classes. On a larger scale we adults yearn to meet the parents of this special child. We are left to wonder if the family is of lesser means, or if they have discovered the richness of a simple life by having had that &quot;other life&quot; before children came along. Either way, they must clearly have one of those home environments of love and acceptance that thoughtful parents strive for.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book was given to my daughters (then ages 2 1/2 and 5) as a gift and continues to be a favorite a year later. They LOVE the pictures, which are charming and oddly appealing. The faces are multi-cultural as well. The books two messages are offered subtly but clearly. Velvet is confident in who she is and what she likes in spite of the other children -- what parent could hope for more! The other children, at first inclined to whisper about how &quot;Odd&quot; Velvet is, quickly become intrigued by, then enchanted with and eventually start to emulate Velvet and her so-called 'odd' (e.g. not like EVERYONE else) ways. This book is a simple yet a great way to open up discussions with children about the importance of both of these values. It's a favorite now on our 'to give' list.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "When I was a full-time nanny for a little girl who felt that she \"didn't quite fit in\" with her peers, I found this book to be so very helpful. We discovered it by accident at a local library - and we borrowed it so much that we had to purchase it.The book simply depicts an imaginative, slightly \"odd\" young girl who at first is resisted by her classmates and then - without having to change who she is - eventually becomes accepted by them. Most tales of this kind have the \"odd\" character performing some kind of special deed in an effort to redeem themselves in the eyes of those who resist them (i.e. Tacky the Penguin). But what I love about this book is that Velvet does not have to \"save the day\" in order for her classmates to accept her. She just remains her - and they eventually come around to thinking that she is pretty cool just the way she is.I understand the criticism that the story is boring. I conceed that it is not particularly adventurous, humorous, etc. But it is a story of validation for those who are different.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "There's a Velvet in every kid's classroom... and this is a book that every kid should read! First of all, the illustrations are great--full of rich, bright colors, and the characters are just so cute! But also because this book holds a message that every kid should hear. Well, two messages, actually. First, be confident in who you are. Velvet sees the simple beauty of an apple; she sees worth in a common rock; and she understands that when you haven't got anything else, you've got your imagination. Even though the other kids don't understand her, that doesn't stop Velvet from being who she is and sharing her &quot;magic&quot; with the world. The second message comes when the other kids start to get to know Velvet and find out that she is really a lot of fun after all, even if she sees the world in a slightly different way than they do.This book, along with its wonderful illustrations, shows kids that it's okay to be yourself, and that it is rewarding to get to know others (even if they're different!)... there's a lot of buried treasure out there hiding under a bit of Odd Velvet!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Odd Velvet is a beautiful story to discuss with children. In fact, if you don't discuss it with your kids, they may miss some of the point of the story or even misunderstand it.One of the messages in this book is simply that material things (like the biggest paint set, the most crayons, or performers at your birthday party) don't make you the best person. The little girl in this story comes from a family that doesn't play the materialism game, and she turns out to be a wonderful, bright, and special person after the kids get past staring at her hand-me-down clothes.It's a great discussion starter for a conversation about how your child sees his or her classmates, what it really takes to have fun, why castles have moats, why a volcano produces ash, what makes a drawing of an apple look \"real\" (my 73 year-old mom had a 30 minute conversation with my 4 year old boy about light and shade in books and around the house after reading this book!).Don't just read this book with your child, use it as a springboard for a wonderful conversation.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Beautifully drawn, and the message is important. The ironic tone may be lost on some children - it was certainly lost on some of the reviewers! Told from the perspective of an anonymous child in her neighborhood, Velvet is 'odd' for choosing quality and beauty over quantity and conformity. Her classmates ultimately learn by her example. The narrative style will be confusing to younger readers, but it's a hell of a better read for the parents than 'Sheep in a Jeep'! Good for a five year old.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "There's a Velvet in every kid's classroom... and this is a book that every kid should read! First of all, the illustrations are great--full of rich, bright colors, and the characters are just so cute! But also because this book holds a message that every kid should hear. Well, two messages, actually. First, be confident in who you are. Velvet sees the simple beauty of an apple; she sees worth in a common rock; and she understands that when you haven't got anything else, you've got your imagination. Even though the other kids don't understand her, that doesn't stop Velvet from being who she is and sharing her &quot;magic&quot; with the world. The second message comes when the other kids start to get to know Velvet and find out that she is really a lot of fun after all, even if she sees the world in a slightly different way than they do.This book, along with its wonderful illustrations, shows kids that it's okay to be yourself, and that it is rewarding to get to know others (even if they're different!)... there's a lot of buried treasure out there hiding under a bit of Odd Velvet!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I liked this one from the first page on. Now I have to admit to being a bit predjudicial here, as the little girl in this story could quite well have been my wife years and years ago when I knew her as a little girl. We have been married 44 years now, and she has not changed much...thank goodness. That being said, this is a wonderful little book to read with those special children (who actually will probably be the ones who end up running the world for us in a few years from now) that have problems fitting in with the other children at school The author and artist do a wonderful job here and both art work and text fit perfectly. This is not a thriller/page turner/bang, bang type book, and more power to it for being as such. The story is well told and leaves plenty of space so that the situation can be discussed with the child. I understand that this is the first work by both author and artist and I certainly hope we will see more like it coming down the line. Recommend this one highly.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "stuart little",
        "description": "The classic story by E. B. White, author of the Newbery Honor Book Charlotte's Web and The Trumpet of the Swan, about one small mouse on a very big adventure. Now available as an ebook! Illustrations in this ebook appear in vibrant full color on a full-color device and in rich black-and-white on all other devices. Stuart Little is no ordinary mouse. Born to a family of humans, he lives in New York City with his parents, his older brother George, and Snowbell the cat. Though he's shy and thoughtful, he's also a true lover of adventure. Stuart's greatest adventure comes when his best friend, a beautiful little bird named Margalo, disappears from her nest. Determined to track her down, Stuart ventures away from home for the very first time in his life. He finds adventure aplenty. But will he find his friend? Stuart Little joins E. B. White favorites Charlotte's Web and The Trumpet of the Swan as classic illustrated novels that continue to speak to today's readers. Whether you curl up with your young reader to share these books or hand them off for independent reading, you are helping to create what are likely to be all-time favorite reading memories.",
        "authors": "['E. B. White']",
        "infoLink": "https://play.google.com/store/books/details?id=pQN4BgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I had just finished reading &quot;Mrs. Frisbee and the Rats of NIMH&quot; and &quot;Charlotte's Web&quot; to my 5 year old son (who thoroughly enjoyed both of those books) and was looking forward to reading him Stuart Little. But as I read a chapter each night, I kept thinking &quot;it has to get better! Didn't I like this book as a child?&quot; I noticed my son wasn't begging me to read more each night, as he had with all the other books.After we finished the book I asked him his thoughts about it. &quot;I didn't really like it. I just didn't get what they said!&quot; I had to agree. The language and especially the sailing jargon was not clear. Yet this 5 year old &quot;got&quot; the much more complicated concepts in Rats of NIMH? I was disappointed that this book didn't spark conversations from my son, like the other books had. Though we did talk about how interesting it was that the same person who wrote &quot;Charlotte's Web&quot;, a book he truly loved, could also write a book like &quot;Stuart Little&quot;, that he didn't enjoy at all.We're happy to leave Stuart Little behind and be several chapters into &quot;Charlie and the Chocolate Factory&quot;. Now I'm hearing &quot;just one more chapter PLEASE...&quot; again.",
                "review/helpfulness": "24/39",
                "num_reviews": 39
            },
            {
                "review/text": "Stuart Little is about a mouse who was born to a normal human family. Stuart must overcome large obstacles as a small being. One day Margalo, a bird, entered Stuart's life. They became instant friends. One day the family cat, Snowbell, and an alley cat came up with a plan to kill Margalo. Another bird overheard the plan and sent a note to Margalo. Margalo left and almost falls in love, but nothing cound keep Stuart from searching for Margalo. Stuart Little is a wonderful novel that appeals to children because of its curious blend of fantasy and reality. Children can relate to some of the obstacles Stuart encounters because of his size. This story helps children to learn to use determination in order to overcome obstacles they might face in life.",
                "review/helpfulness": "30/33",
                "num_reviews": 33
            },
            {
                "review/text": "The most common complaint about Sutart Little is the ending, or lack of ending. I disagree. The story is one of growing up, and sadness, and yearning for something just out of reach. The brilliant E.B. White denies us a happy-Disney ending, avoids &quot;closure&quot;. The story is just like life; it is a journey, not a package. The loose ends don't need to be cleared up with a sequel. Stuart has grown up and struck off on his own, the end. When I first read this story as a young boy, it gave me my first taste of melancholy. This should be the first &quot;profound&quot; book that a child reads, for it leaves you feeling sad, but hopeful.",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "I fell in love with White's &quot;Stuart Little&quot; in the 4th grade, when my teacher read this gem of a book out loud to us. Even today, as an adult, the clever, jaunty Stuart Little is a favorite of mine. The book is about the adventures of Stuart, a small mouse who was born to human parents. From driving a model car given him by his dentist friend to his run-ins with the family cat, Stuart's innocent hi-jinx and fun-loving nature will keep kids and adults laughing. &quot;Stuart Little&quot; is a lively getaway from our sometimes violent and tumultuous world.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I've just read all 99 reviews and can't believe no one mentions how bizarrely Stuart treats Harriet Ames! He goes out of his way to invite her down to the river at sunset for a boat ride. He tells her he's well-proportioned and and also suggests she not tell her parents she's coming to meet him. weird. But stranger yet- she does come to meet him, and when Stuart discovers his canoe has been damaged, he speaks bitterly, sulks, screams, and acts like a rude jerk toward his guest. When she keeps trying to encourage him to make the best of it, he acts selfish, spoiled, and abusive. He refuses a peppermint she offers him. She invites him to come with her to dinner and out dancing and he says no I have to leave early in the morning. Finally she leaves. Is this book a primer for children to explain how men treat women badly? How bizarre!!!",
                "review/helpfulness": "10/15",
                "num_reviews": 15
            },
            {
                "review/text": "&quot;Stuart Little&quot; is a very, very good book and he is the cutest mouse. My favorite part of the book was when he got stuck in the refrigerator and when he got into the trash can. And I liked when the man at the dentist's office talked silly. And when Snowbell said, &quot;The little chippy flew the coop!&quot;",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "&quot;When Mrs. Frederick C. Little's second child arrived . . . the baby looked much like a mouse in every way.&quot; (pg.1) In fact, her second child is a mouse; however, the family treats him like a member of the family. They never even say the m-word (mouse), as to not hurt Stuart's feelings. Throughout the book, Stuart encounters numerous exciting adventures, unknown to his protective family. Children love the idea that even though Stuart is 2inches-tall he still overcomes many obstacles. Stuart Little's emotions and adventures he experiences in this book are very similar to what children face every day; for example, going to the dentist, first love, being homesick, and bullies. One underlying theme I found within the book was accepting children for their differences and not sheltering them from lifes' experiences.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I was moved to write this review after reading some of the negative comments made about the book being boring, difficult to understand, or containing values that the parent did not want to pass on to the child. Stuart Little represents an important example of the some of the challenges of selecting reading materials for our children and tests us as parents in many ways. I didn't know how my boy would respond when I began reading it, since I knew it was one of those children's books that has been enjoyed by adults because of its adult humor, archaic language, few pictures. My 4 year old absolutely loves this book. We are on our second reading and a few nights ago, while he was laying in bed after our bedtime reading, he broke out laughing about how Stuart's brother, George, wanted to pour applesauce down the mousehole!The book was written in 1945, so many of the cultural references are dated, including how gender roles are perceived. But part of our responsibilities as parents is to expose our children to the evolution of thought in our culture, and that includes finding ways to explain how people's behavior has change over the years. A young child has already likely experienced many different behaviors in the children around them from daycare, preschool, or even playgroups. What better way to have an opportunity to prepare your child for the many different views he or she will encounter.But the message of Stuart Little is a powerful one that can be so useful to a child. Here is a 2-inch tall \"person\" who \"looks like\" a mouse, yet he is part of a human family. He has the most amazing obstacles in his life, yet he overcomes them with enthusiasm and joy. The use of actual sailing vocabulary is a wonderful choice by the author. What a great opportunity to expose our children to other language and to show them that specialized language exists for all fields of study, even hobbies. Doesn't even Winnie the Pooh have its own specialized vocabulary (smackrel, blustery day, etc.)?Stuart doesn't always make the right choices. This provides another great opportunity for discussion, regardless of the child's age. I am a parent who doesn't want to reinforce some of the stereotypes of our past that get in the way of people connecting, whether they be gender inequities or other issues. But it is important that my child get a framework for understanding how the way people have acted toward one another. In the last chapter of the book, Stuart meets a very self-assured girl who, by the way, he asks out on a date is an outdated, but respectful and wonderful way. He winds up being unable to continue connecting with her after his carefully imagined plans don't go as he dreamed. He is upset because things didn't go his way and couldn't get past his disappointment. What a great thing to discuss with a child.We also have to give our children credit for their intellectual abilities and imagination. I was quite surprised how my boy listens intently through the archaic language and vocabulary and finds the story.Stuart Little is a great book for that next step for the young child who has only had picture books read to him or her so far. It is a good beginning book for parents to learn how to introduce their child to the varied, challenging, sometimes confusing world out there in a very non-threatening, interesting way. Don't underestimate this book.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "The fact that the hero of the story is a mouse does not make this a good book for young children. The language is difficult and the humor is rather understated, i.e. \"The doctor was delighted with Stuart, and said that it was very unusual for an American family to have a mouse.\" At its heart, Stuart Little is a comedy of manners, and the fantasy takes a back seat to the witty dialogue and neat prose. Children will enjoy it at ten and love it in adulthood.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Initially, I found this book charming. Stuart's home life and the problems he encountered were amusing. I found it particularly funny when he got into a dispute with the cat about the abilities of his stomach muscles. And when he tried to prove his strength, he ended up rolled into the window shade. I could easily relate to Stuart's character at this point because I have often put myself into an embarrassing situation by trying to prove my point to someone.I appreciated the developing relationship between Stuart and Margalo. However, by the time I finished the book, I decided that Stuart was pround and arrogant and his character annoyed me. Perhaps I read too much into his search for Margalo, but I was upset when he halted it in order to pursue Miss Harriet. I felt like he was cheating on Margalo. If I had been Harriet, I would have found the letter Stuart wrote offensive. He solicited her without ever having met her and attempted to convince her to hide his efforts to woo her from her parents, not a good start to a relationship in my opinion. I was embarrassed by the tantrum he threw when his canoe was destroyed and by the way he quickly gave up on fixing it. His character seemed unstable and did not develop through the book.The ending was disappointing, cutting off abruptly while Stuart was still in the middle of his search for Margalo, but I'm not sure if E.B. White ever actually finished the book. If you want to read a book by E.B. White, I would recommend Charlotte's Web, which is fantastic.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "higglety piggelty pop or there must be more to life",
        "description": "A daring imagination has woven a simple rhyme into a brilliantly original tale about Jennie, the Sealyham terrier, who seeks Experience and becomes the star of the World Mother Goose Theatre.",
        "authors": "['Maurice Sendak']",
        "infoLink": "http://books.google.com/books?id=UFeZCgAAQBAJ&dq=Higglety+Piggelty+Pop!+Or+There+Must+Be+More+To+Life&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book belongs on every shelf, possibly next to The Little Prince or Sendak's Where the Wild Things Are. This beautifully illustrated fable (Sendak wrote to deal with the death of his beloved Sealyham Terrier, Jennie) stars the always hungry, always selfish and always charming little dog Jennie. Though Jennie has everything, she decides there must be more to life and sets off to find it.Along the way, there are feline milkmen, job applications to theatre companies, babies who won't eat, lions and the bit of Mother Goose rhyme from which the book takes its title. Somehow, the ending manages to be both uplifting and very sad at the same time, and when you're done, the little voice in your head will plead &quot;read it again!&quot;.Sendak's art is brilliant, carefully rendered black and white illustrations with charming characters and whimsical details that add to the text of the story. Sendak's storytelling as at it's peak here as well. It's much wordier than Wild Things, and also aimed at an older audience. If your kids are too young for this, buy it anyway. That way, it's there when they're ready.",
                "review/helpfulness": "35/35",
                "num_reviews": 35
            },
            {
                "review/text": "I have read this book to my daughter since she was about 3 and we return to it at least 3 times a year. The language is simple and witty, with a wonderful depth of feeling for Jennie and her desire to gain &quot;experience&quot;. The darkly humorous chapter with Jennie attempting to placate the Baby is one of Sendak's best pieces of writing and both child and parent will find themselves imitating Baby's shouted speech with glee. This is a wonderful book to read aloud, but take time to savor the illustrations. Their off-kilter warmth caps a great reading experience.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I loved it as a kid and had my husband read it years ago. Some of Jenny's quirks became permanent jokes between us (like when she passes out yet still wants syrup on her pancakes...)My 7-year-old son, a tough customer, also thinks the book is hysterical. It's funny on so many levels and the illustrations are beautiful.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "An &quot;adult&quot; book disguised as a children's book, children will love the illustrations and silly phrases, but only adults will truly appreciate the basic &quot;message&quot;. A favorite gift for friends who have everything! I have it shelved along side my tattered copy of &quot;Jonathan Livingston Seagull&quot; - the interpretation changes yearly. Enjoy it with your children!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I read this book when I was a child and have vivid memories of certain sections. I was telling my daughter and son about &quot;Jenny&quot; the other day when we saw a dog that looked just like her. I haven't read the book for 20+ years (my mom bought the hardcover when it first came out), but I still remember it like it was yesterday. I thought the story within a story would appeal to my daughter.This book will appeal to the precocious young reader and to the parent who wants to read along. I just wish I could get it in hardback as my childhood copy seems to have vanished...",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is my absolute all-time favorite book from childhood. When I got pregnant the first book I bought for my little guy was this one. Every child must have one. It doesn't follow the usual guidelines for children's literature, which is usually boring and has some obvious moral theme. Higglety Pigglety Pop can be thought of as somewhat nonsensical and stimulating to the imagination. Your little one will love it! The characters are genius.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "\"Higglety Pigglety Pop! Or, There Must Be More to Life\" by Maurice Sendak was not my favorite book as a child. Truth to tell, I was too old for this when it was first published, and only discovered it when I was looking for books for my own child. This book became a touchstone in my journey of self-discovery, and Jennie became my own personal heroine. If a Sealyham Terrier can go out into the world and not know where her next salami sandwich is coming from, how can I do less?I find the entire story delightful; it has much to teach us about living the life you want, not the one assigned to you.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I loved my LP recording of this book to death as a child - I highly recommend this enchanting story.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I purchased for my grandkids ages 4-6. They like chapter books now so they have something to look forward to. This book has a sort of sing-song rhyming theme they really seem to like. My only objection was I thought it should have more illustration. I love the dog !!!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a gorgeous little book is (the printing is beautiful) highly recommended to anyone who appreciates a good classic book and the dog is just charming!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "manners can be fun",
        "description": "Stick figure drawings and a brief text tell why good manners are important and how to have good manners at home, at play, and on visits.",
        "authors": "['Munro Leaf']",
        "infoLink": "http://books.google.nl/books?id=PnobAQAAMAAJ&dq=Manners+Can+Be+Fun&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Oh, how I have missed this book. My grandmother passed my mother's edition on to me when I was little, and its illustrations and funny stories have stayed with me all this time. I was heartbroken when I lost it, but as I didn't know the title or the author, I wasn't able to find it anywhere. This reprint has made me SO happy!",
                "review/helpfulness": "47/47",
                "num_reviews": 47
            },
            {
                "review/text": "I was so happy to see this book back in publication. I remember it VERY well, but when I bought my new copy for my kids, there seems to be a page or two missing!!! Something happened to The Burpers, The Coughers and the Sneezers!!! The pages that said \"Be Kind to Animals, They Have Feelings,Too\" was in the middle of the book instead of at teh end, and there were pages at the end to put notes of \"my own manners\" and I don't remember those pages ever being there before.I miss the Burpers, etc. I should notify the publisher, too.But still, this book is wonderful.",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "Mr. Leaf's book was one of the cornerstones of our household, and my brother and I were constantly instructed to &quot;sit down and read the manner's book.&quot; This book is very easy for children to comprehend, and it is an excelent way for parents to get their kids to a more &quot;civil&quot; state. I still love this book!",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "Lost in a sea of new-age mumblings, half-congealed PC semi-truths and &quot;value-neutral&quot; nonsense? Then, if you never do anything else for your kids, find a copy of this and Leaf's other gems and use them as often as you use the TV's remote control. They're full of the no-nonsense, boiled down &quot;rules to live by&quot; that so well defined the simpler ages gone by. To agree with another reviewer, this and the others probably would be banned today. But, when you consider who it is that bans books along with what's acceptable and what isn't by today's standards, it might be time to resurrect ol' Munro and let him have another go at our kids. Until somebody with the wisdom and resource to do that comes along and does, a well-used copy suits me just fine, thank you.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "I remembers this book as a child, when my mother bought it for me at the Book Fair. At the time, I didn't like it, for I didn't appreciate the funny cartoons and splendid way of managing manners and being nice, but now that I have a scroungy little 6 yr. old, I wish I could find it and give it to my son, I think he'd think it was hilarious, which it is. If you find this book, grab it!",
                "review/helpfulness": "17/22",
                "num_reviews": 22
            },
            {
                "review/text": "I fondly remember this book that I read as a child over fifty years ago. I was looking for a way to address issues about manners with my five year old grandson and rediscovered this book. He clearly got the messages Leaf imparted and thoroughly enjoyed it. The author did an excellent job of succicntly and imaginatively presenting the rules of getting along with others and the consequences of not doing so. The terminology and pictures Leaf used to describe poorly mannered children was indelibly printed in my mind and has lost none of its charm.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "munro leaf's books in this series are excellent but before i bought it i checked it out at the library and i am glad i did. the concept is great but even for my 3 yr old daughter who will sit still for a book with great patience, she was losing interest. So i am just reviewing to share with others that you may have to shorten it as you read it to toddlers but it is a terrific series and would be perfect for children age 4 and up.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Oh joy! I have searched for this book and here it is again, back in print. I broke the record for checking it out of the Mission Hills, San Diego library as a child. It worked. 50 years after reading it, I'm one of the politest people I know!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I love this book! My grandmother had it when I was a child, and I remembered the pictures. I am a Foster Parent, and have found that with some children this book is much loved and a good tool for learning manners. One in particular found these books by Munro Leaf to be favorite bedtime stories along with a review of the day. Sometimes it is good to be reminded of good old fashioned manners.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I am 65 years old and this was one of my first books. The revisions along the way have not changed the drawings that much. It is simple, but well illustrated, and gives a basic idea of good manners. I recommend it for every child - it makes them think about behavior. The way the author demonstrates \"me first\" and \"whinney\" have stuck with me all these years.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "transforming the difficult child the nurtured heart approach",
        "description": "This book enables parents and carers of 'really difficult' children to help their child succeed and flourish. The nurtured heart approach has helped thousands of families in America who previously felt their child was stuck. This new UK edition reflects parents' increasing need for effective ways of parenting their intense children without needing to turn to medication.",
        "authors": "['Howard Glasser', 'Jennifer Easley']",
        "infoLink": "http://books.google.com/books?id=O9dbRAAACAAJ&dq=Transforming+the+Difficult+Child:+The+Nurtured+Heart+Approach&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My son was diagnosed ADHD (severe -- and I mean SEVERE), bipolar, and ODD (oppositional defiant disorder) nearly four years ago; shortly after he turned 7. Those first three years were pure hell. Between behaviors, education issues, medication issues, and regular everyday &quot;boy stuff&quot; -- I was losing hope. In my research on these different disorders -- particularly ODD as it was the one I was least familiar with -- I came across rather frightening info -- particularly that ODD that isn't stopped becomes CD (conduct disorder), which basically guarantees a life in prison or as a socialoutcast of some other sort for the person in question. That's incredibly frightening for a parent to learn. Not only was my son diagnosed with something that was not very treatable, but if it didn't respond to treatment he was in for a lifetime of hell. I also read that the only thing PROVEN to be effective against persistent ODD is in-home intensive therapy. Well, we did in-home counseling and it didn't do much (more or less parent training, and it wasn't new information at all). I did get wrap-around services for my son, which includes an in-home mental health aid 4 days a week (now it's three, soon to be two). THIS is what worked:The groundwork I lay as far as behavior management and a positive discipline plan is contained wholly in this book. &quot;The Nurtured Heart Approach&quot; is the *only* approach that I felt good about, was easy to apply, was easy to stick with, and - most importantly - *WORKED*. This behavior plan, which includes a great point system at the end of the book-- was applied religiously and with total disregard for any protestations from my son (and daughter -- she's not got all his diagnoses, but it's a darned good plan and applies to an easy kid, too). Anyway, this plan was applied by *everyone* who worked with him -- at school (it's part of his IEP), at home, when visiting relatives, etc. Let me tell ya -- you *do* notice a differenceright away. It might be subtle at first, but today is one year since I started the nurtured heart approach with my son and he's a different kid. Honestly. His behaviors have been stable for 6 months now. We haven't had an outburst (fit of any kind) in two months. I HIGHLY recommend this book to anyone with a kid who has an ODD, ADHD, or bipolar diagnosis -- or is just plain difficult. My son's oppositional and defiant behaviors are no longer a huge issue. He's as oppositional and defiant as any other kid -- within the &quot;normal&quot; range and THIS is do-able. I can handle everyday, typical defiance -- ODD defiance/noncompliance is a BEAR.This book and its plan will get you going. I created a short form for the point system that I printed out and used daily to mark off the points earned (bonus points, points for not breaking the rules). At first we used a dry-erase board, but sometimes the rules/bonus items got smudged or wiped off and it became apparent that something easily reproduced was better. Idid point cards on business cards -- printing up a ton of 5 point, 25 point, 50 point, 100 point, 500 point cards. Several months ago we found it necessary to print 1000 and 2500 point cards -- THAT's how well my son is doing.This plan is the one that worked. We've done 1-2-3 Magic! and several other plans that not only didn't quite cover everything or did not leave a child's self-esteem intact and this is the only plan that I felt 100% good about - in my heart and in my head. AND, this plan covers EVERYTHING. It will work if you follow it and stick with it. And believe me, positive discipline plans are NOT like diets -- not all of them work if you just stick to and with them. Not every positive discipline plan out there works. THIS ONE DOES.Thank you Howard Glasser!",
                "review/helpfulness": "111/112",
                "num_reviews": 112
            },
            {
                "review/text": "After reading Howard Glasser and Jennifer Easley's excellent book, &quot;Transforming the Difficult Child,&quot; I felt a surge of hope for the more problematic children in our world. Finally, someone had discovered how to help parents manage difficult children in a positive, loving way and without medication!Most of the children Glasser and Easley have worked with were taking medication when they arrived at the Nurtured Heart Approach center. These same children are no longer medicated into submission but living bright, successful lives. These children needed a little or a lot more attention than the average child but were being raised with traditional parenting skills that were rendered ineffective because of their ultra-sensitive natures. The parents of these children needed to learn to apply another set of rules to their kids to help them become the wonderful people they were destined to be.The Nurtured Heart Approach is an easy, rational, beautiful and loving method of building on the successes of children while not giving energy to the negative aspects of their character. This is an approach that can be used on difficult or &quot;normal&quot; kids. I have begun applying these principles to my own methods of child rearing. They work quickly and magnificintly! It's brilliant in its simplicity and effectiveness.If you have a difficult child or even if you would like to learn a new positive, ingenious parenting approach, I urge you to read Glasser and Easley's book.",
                "review/helpfulness": "72/80",
                "num_reviews": 80
            },
            {
                "review/text": "If you're contemplating this book, you've probably read many other parenting books and tried numerous approaches to improve the relationship between you and your children. The book has some variations of ideas that have been around for awhile (&quot;catch them being good&quot;, &quot;earning privileges&quot; by using a reward for good behavior, and &quot;time-outs&quot;), but nothing revolutionary. The authors use frequent, annoying metaphors to explain simple concepts and repeat themselves a lot, resulting in a difficult-to-read, confusing book. Before deciding to try the &quot;Nurtured Heart&quot; approach, you might want to read &quot;Punished by Rewards&quot; by Alfie Kohn, who challenges reliance on carrot-and-stick psychology.As an alternative, I highly recommend &quot;Kids, Parents, and Power Struggles : Winning for a Lifetime&quot; by Mary Sheedy Kurcinka who also offers a nurturing approach to these spirited children (the author uses a more positive word than difficult, don't you think?), but without a reward-based system.",
                "review/helpfulness": "64/75",
                "num_reviews": 75
            },
            {
                "review/text": "I learned of Tranforming the Difficult Child in May of this year, and began implementing the recommendations (with resolve) with our 10 year old son immediately. Everyone who knows him saw an immediate, major improvement in his ability to listen, to get and stay on task, to control his actions, to have meaningful conversations. These gains began in the first couple of days, and have accelerated ever since.Our son's official \"diagnosis\" if you will, is ADHD non-attentive type and Non verbal learning disorder. While fun and likeable (also smart) is still immature for his ten years. He had never once had a best friend in his class (his long-time best friend is in fourth grade). With the confidence and ability to control that he gained through our application of the nurtured heart techniques, he has made not one but fourfriends in the fifth grade class!!!! He's enthusiastic about school, was crushed not to have made \"Responsibility Club\" this week (homework snafu) - a problem of prosperity. His teachers have embraced the form I adapted from your book. It's come home everyday with feedback, and in fact the highest scores possible, each and every day (they love the form).Like many parents, I have tried many, many angles to help our son. Nothing has worked in the past. Implementing the approaches in this book has changed our lives.",
                "review/helpfulness": "70/71",
                "num_reviews": 71
            },
            {
                "review/text": "The concept of this book is great. I have put the system to work and so far, it's fantastic. My daughter has responded extremely well to this system and I am very happy with our results! Very happy indeed. For the first time in 4 years my daughter is going to sleep without a fuss. (Trust me, this kid HATES to go to sleep, and I am being polite when I say \"fuss\").I am just about positive my daughter has ODD, or Oppositional Defiancy Disorder. I have implemented the credit system for positive behavoirs and she loves it! She looks forward to getting credits at the end of the day for the multitud of positive behavoirs that she can \"get points\" for.However, the book is so poorly written I had to put it down many times and walk away, or I was going to throw the darn book in the trash. I knew that there was a concept in the book somewhere that was going to work for my daughter and I. But the book was is so full of metaphors, and SO repetitive, it never really does get to the darn point! Every single time I thought the book was going to get to the point, it stopped dead in it's tracks and started with the metaphors again.Out of frustration, I finally took a highlighter and started highlighting sentences that had to do with explaining how to deal with difficult children, and how this program worked. Only then was I able to start assimilating the information contained within, and work my way around all of the 'filler'.Also, you need to give more ideas on how to actually, materially, give credits, or record the credits. I finally devised my own way. The book said there was more information about this, but darn if I can find it. Even the table of contents is vague, not descriptive enough to help one find what they are looking for.If you have a challenging child, get the book, try the system! It works wonders.Jackie ~ San Diego California",
                "review/helpfulness": "56/59",
                "num_reviews": 59
            },
            {
                "review/text": "This book has changed the entire mood of my home. One of my twin boys had a short fuse. I could never tell what would set him off or why. We tried all kinds of parenting approaches: 123 Magic, Parenting with Love and Logic, counseling. They all worked on twin A but not twin B. We couldn't figure it out. Then, we started to think that, perhaps, he had ADD. Late one night, I came across a review for this book on an ADD website. At 2:00 am, a parent is willing to try anything. I went straight to Amazon and ordered it. The results were immediate. Not only does this approach give you simple techniques, it predicts how the child will respond and how to handle it. The thing is, I never would have purchased this book if I had seen it in a store. My child was nowhere near as difficult or active as the kids described in the book. Not purchasing this book would have been my loss. For the first time in a long time, I get my child. I understand what he needs and why. Because I understand, I'm willing to do the things I need to do. It's great being a successful parent.",
                "review/helpfulness": "58/58",
                "num_reviews": 58
            },
            {
                "review/text": "I read this book with great hope. I came away confused and having a heart and mind that resents some of the advice. The book sets out &quot;steps&quot; to follow. The first is easy and seems like a promising start (neutral &quot;video moments&quot;). The second is the first but changed in a way that completely undermines what was so important to achieve in the first step (no longer neutral--instilling &quot;values&quot;). The third is so much like the second it hardly seems a separate step (rules). But the real problem I have with the book is the rest of the &quot;process&quot;, which is nothing more than a very detailed rewards and punishments system--as if you're training a dog. As if the only reason children will do good is because of the carrot or stick. Whatever happened to &quot;good for goodness' sake&quot;? If you have a capitalistic heart, ready to weigh and measure and value evertyhing in points (or dollars or favors or privileges) this system could work. There is some appeal to saying &quot;no tv tonight because you don't have enough privileges earned&quot; rather than saying again and again, you have a limit and you've reached it, without the black and white ledger. But I just found it too mercantile and not nurtured or Christian enough--the system as proposed. I don't think I can do this in good conscience. The first steps--yes--and I'm willing and welcoming to such an approach. The rest--I'll have to see. I'm also bothered about the suggestion that this balance book will be kept until the child is 18 or 21 even! There is just something in the theoretical underpinnings of this approach that I find morally wrong. I did learn some important insights from reading this book, but it is not the &quot;final solution&quot; as I had hoped and as suggested by some other reviews.",
                "review/helpfulness": "40/47",
                "num_reviews": 47
            },
            {
                "review/text": "I am a licensed mental health professional, but I bought this book because I have a \"difficult child.\" After my years of training, I typically roll my eyes with boredom when I am exposed to new parenting books. I cannot say that this book has changed my parenting much--I confess that I have not even finished it--but the first 5 chapters really grabbed me!Just the author's explanation of \"difficult\" kids' behavior really rang true for me. Just thinking of the main ideas presented in those early chapters makes me feel more hopeful. Who knows how helpful it might be if I actually got around to finishing it?!I learned about this book at a website for stressed-out parents. Parents at that site praised this book highly. I was somewhat skeptical, but decided to try it. I am very glad that I did, as it allowed me \"re-frame'' my child's behavior in a more helpful way. Particularly if there are readers who worry that a parenting book will be too simple-minded or watered-down for them, I think this is a book worth trying.",
                "review/helpfulness": "27/33",
                "num_reviews": 33
            },
            {
                "review/text": "To say Howard Glasser and his incredibly insightful book have put peace in my life would not be profound enough. I read Transforming the Difficult Child the Nurtured Heart Approach and immediately followed it up with his workshop that I flew across country for. What a true blessing this approach has been. Our difficult child is a joy and is taking such pride in her school work these days. Her teacher not only noticed the change but after I gave her one of Howard's books as a gift she has now implemented it in classroom. Following the workshop I completed a survey with the comments, &quot;When are you coming to Dallas? This information will change the world.&quot; Well, here I am planning the Dallas workshop in May. It is that profound! This &quot;nurtured heart approach&quot; works with ALL children and even your spouse. It is so simple, so nurturing, so refreshing and builds self confidence in the parent and their abilities as well as the children. This is an investment that you will never regret, never out-grow, and will pass on for generations. Enjoy!",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "Last night I implemented just the first part of &quot;Nurtured Heart&quot;-- by first observing my two sons (age 10 and 14) and making as many positive statements as I could muster. The result was nothing short of miraculous! &quot;I appreciate your self-control, honey, in not hitting your little brother even though I could see you were very frustrated with him...etc&quot; Simple yet powerful words. My fourteen yr old, who has been diagnosed with ADHD and who is recently off all medicine has consumed us with worry for the last couple of years. He is a challenging, yet very bright boy. So he fits the profile of the child for whom this book is targeted.However after using the first step in the strategy from Dr Glasser's book, my son went into the kitchen, put his dishes in the dishwasher and then started bundling the recyclables and garbage and taking it out to the cans. He has been responsible for these jobs for several years, but this is absolutely the first time ever, that he has done them without being told to--usually several times. Nothing has encouraged us like this book has and we have engaged in everything from individual therapy to medication--yet in a single week the program Glasser and Easley outline has literally transformed our family.This book is designed to help parents with kids who are not average--usually bright but intense and helplessly invested in the negative attention there behavior gets them. The basic premise is that traditional parenting techniques ie reward/punishment or lecturing /admonishing just are not effective with kids who are this intense.The book is explicit and easy to implement--and for once--there is not a hyperfocus on &quot;disorder&quot; and the lifelong &quot;sentence&quot; that implies--the emphasis is on building true self esteem and success with these youngsters with lessons that will help them grow into successful adults. This book upends the dominant trend to medicate first (and foremost) and outlines strategies that have enabled kids to either not start medication or stop Ritalin and other psychostimulants altogether.This book has certainly given us the confidence to successfully help our son. Thank you so much for writing this book--",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            }
        ]
    },
    {
        "Title": "my friend the monster",
        "description": "A lonely prince forms a satisfying though dangerous friendship with a monster.",
        "authors": "['Clyde Robert Bulla']",
        "infoLink": "http://books.google.com/books?id=OoQOAgAACAAJ&dq=My+friend+the+monster&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "From the title, you might not expect this to be one of the best chapter books ever written for young children, but it is. My oldest child is 17 and my youngest 6, so I have been reading aloud for many, many years, and this is one of my all time favorites. In simple, but beautifully poetic language, Clyde Robert Bulla tells a story of an &quot;ordinary&quot; prince, a disappointment to his cruel and snobbish family, who runs away and meets a &quot;monster&quot; who lives with his people in underground caves. Although the humans and the monsters fear and hate each other, the boys become friends, slowly learning to trust and even protect one another. It is a wonderful story, both exciting and psychologically rich, and it deals with overcoming prejudice in a way that makes sense even to children as young as five or six. But it's so good, so beautifully written, that I'd recommend it for children as old as nine or ten. Unfortunately, as I write this, the book is currently out of print, but any decent library ought to have it. And I hope the publishers come to their senses soon and make it widely available again. This is a book every child should get the opportunity to hear.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My Friend the Monster was my first \"chapter book\" that I read with little assistance from my parents. It made a huge impact on me. Years later, I realized that this book was the first objective look at prejudice that I had. It made me want to befriend those who were different and helped me realize that if and when I'm the different one, I want people to befriend me. I highly recommend this book. The material sounds \"too grown up\" for kids but it isn't. It's on just the right level for them to understand and ask thoughtful questions that will enable them to grow. It could have been better edited for correct syntax.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "your childs growing mind a guide to learning and brain development from birth to adolescence",
        "description": "A thoroughly revised and updated edition of the classic guide to childhood development describes a child's mental and emotional development and examines the ways in which children develop language, memory, and other skills, explaining how parents can help their children learn and emphasizing the importance of play, imagination, and creativity in the process. Reprint.",
        "authors": "['Jane M. Healy']",
        "infoLink": "http://books.google.nl/books?id=fAMZmJfc0pEC&dq=Your+Child%27s+Growing+Mind:+A+Guide+to+Learning+and+Brain+Development+from+Birth+to+Adolescence&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This excellent and easily read book is a &quot;must read&quot; for parents. As a support group leader for 37 home schooling families, I recommend this book as a priority buy for the home library. It gives parents a realistic view of what children are and are not capable of at different stages in their developement. It helps us realize just what our children's capabilities are and how to maxamize our teaching.Dr. Healy's writing style is very easy to read, informative and lively. The chapters are laid out in such a way as to make it easy to find any area of interest. For most of us, motivation is a subject we discuss often. Under &quot;Tools for Learning,&quot; she lists &quot;Motivation (pg.190),&quot; and &quot;Ingredients for Motivation (pg. 214). In each chapter, she outlines key information about the subject, for example &quot;Raising Motivated Learners,&quot; and &quot;Dealing with Motivation Problems.&quot; She gives anecdotal stories to underscore the information she presents, which makes it much easier for a layman to understand.This book definitely impacted not only my teaching style, but bettered my relationship with my teenager. This is an important book to have in your home.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "If you buy this book to learn about your baby, plan to hang on to it for many, many years. I have a newborn AND a 14-year-old. Although there was a lot of interesting information concerning my newborn, I learned even MORE about my older child! I really wish I had had this book a few years ago when she was struggling through sixth and seventh grades. I finally understand why she struggled! There were tips in this book that would have helped. This is a book I will try to reread at least once a year because the information is relevant to so many stages in your child's life. It is easy to read, enjoyable and useful. I especially like the bullet points of things to do at the end of each section.",
                "review/helpfulness": "42/45",
                "num_reviews": 45
            },
            {
                "review/text": "It details in a clear, parent-friendly way the various developmental phases growing children go through and explains why it is so important that they be allowed to go through those phases. I wish this book had been available when my children were young! It makes an excellent gift to give to new parents.",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "This book is a must given the intense pressure on kids placed by parents and educators on the young nowadays. I have enthusiactically recommend this books to all my friends with young children. The topics on the development of the brains is definitely a good read for parents who are pushing their kids beyond their development stage. Beware that your kids may miss out on developments/experience that will be necessary in the later part of his/her life",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "Just ordered another 3 copies of Healy's book (1994 edition). This book was recommended in my doctorate program in education as a MUST HAVE for anyone who is expecting. The suggestions of how to build brain capacity and learning begin while a woman is pregnant, so I've purchased it for all female family members who are now expecting as well as those who have recently had babies. I've also purchased a copy for my elementary school's parent resource center. The information presented in Healy's book presents the transitions of the brain through the school years in a practical, easy to understand manner.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "superfudge",
        "description": "Fifth-grader Peter Hatcher's mother is pregnant, his four-year-old brother, Fudge, is a constant embarrassment to his family, and his parents want to move to New Jersey for a year, could life get any worse?",
        "authors": "['Judy Blume']",
        "infoLink": "http://books.google.com/books?id=X0DwDKL7dlsC&dq=Superfudge&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is hilariously funny, but cruel to kids who believe in Santa Claus. I was devastated the first time I read it, when I was about 9 or 10, because of that part. Then I read it again two years later and loved it. Please make sure your child already &quot;doesn't believe&quot; in Santa before letting him/her read it--it's a terrible way to find out &quot;the truth.&quot; Other than that, a great book, especially the parts with Uncle Feather and where Fudge asks &quot;Is this a catastrophe?&quot; and the principal replies, &quot;No, Fudge, but I'm sure you'll try harder next time.&quot;",
                "review/helpfulness": "115/120",
                "num_reviews": 120
            },
            {
                "review/text": "I picked up this one simply because it had a cute cartoon cover. A short while later, I was totally relating to the story, particularly the parts where the Hatcher kids react to major changes in their lives.The eldest child, Peter, is trying to lead a normal life, but this is being severely hampered by the presence of his uncontrollable younger brother Farley Drexel, better known as Fudge, and his parents, who insist on making big, life-changing decisions without consulting him first.Although light and funny, it casually throws in some revelations that you may not be ready to explain, like where babies come from, and the existence of Santa Claus. It also skims the surface of the trauma of moving to a new city away from your friends, having a new baby in the family, and having your parents switch their traditional parental roles.These issues are skillfully woven into a funny context, but the book can be interpreted at a much deeper level than it first appears.Amanda Richards, February 17, 2005",
                "review/helpfulness": "28/30",
                "num_reviews": 30
            },
            {
                "review/text": "My child and I were enjoying the book a great deal in the car, on audio tape, until we got to the part where the author carefully details how there is no such thing as Santa, parents fake it, and even a kindergarten child knows this. Holy c**p. Thanks a lot Judy Blume--you destroyed my kid's Christmas. This book should come with a warning.",
                "review/helpfulness": "19/29",
                "num_reviews": 29
            },
            {
                "review/text": "At age 9 I enjoyed this book but didn't like it as much asTales Of A Fourth Grade Nothing. For one thing, there were no pictureslike the previous book. Another thing, I felt like the Fudge series lost some of it's innocense with one of Peter's friends saying blankety-blank (they didn't actually print it out but hinted it) in front of Fudge and his pals. Peter's pal should have known better. I wouldn't recommend this book to really young readers for that reason, and it may be upsetting for some kids because of the fact that Blume gives the impression that there's no Santa. Now when I read it, I wasn't upset because I already knew. But I think it'd upset some children, and I thought it was sad that Fudge lost his childlike innocense by not believing in Santa anymore. So parents, I highly advise you to proof-read this book before handing it over to your kids, as with any questionable material.",
                "review/helpfulness": "25/28",
                "num_reviews": 28
            },
            {
                "review/text": "There's no question that Judy Blume is one of the most celebrated children's authors of all time. But when it comes to the book Superfudge, there IS the question of whether or not it's fair of Blume to dismantle one of the most memorable childhood traditions in a book targeted to young children (\"ages 7 and up\" on the back jacket).As a parent of four kids under 8 years old, I can't help feeling somewhat betrayed by an author - even one as beloved as Blume - who would take it upon him or herself to completely cut down the Santa myth without any hint of subtlety or margin of error. For a children's author, this is a very severe stance to take and one that is most certainly intentional. In all my years of teaching and reading children's books, I have come across only one other author who took the same divisive position (Judy Delton's \"A Pee Wee Scout Christmas\") and the reason there are so few is this: most children's authors respect the wide diversity in the ages, circumstances, and beliefs of their young audiences. Even in books targeted to much older children, authors still take care to discuss topics like Santa in very \"cloudy\" terms (Jeff Kinney's Diary of a Wimpy Kid series is a good example) and that cloudiness is an act of simple courtesy, not only for young kids who are reading books at a higher reading level, but also for parents who trust that children's authors will treat ANY bordeline age issue with some level of subtlety.Realistic parents would never expect children's authors to avoid controversial subjects altogether, just as they would never expect to keep their children's belief in Santa alive forever. At the same time, it is unrealistic for parents to expect to avoid specific children's books since so many are readily available in school libraries and classrooms, and that's why there exists an unoffical trust between children's authors & parents that hot topics will be \"handled with care\". While some reviewers feel that Blume is to be commended for her direct honesty regarding Santa, I feel that her honesty could have afforded to be much gentler, especially considering the tender ages of many of her readers.But, with all of that said, the thing that confounds me most about this book is that Superfudge would have been just as awesome a story *without* the explicit Santa reveal. The book would have been no less edgy, no less funny, and no less appealing even if Blume had chosen to go with a far less definitive reveal scene, and sadly, I find myself questioning Blume's choice to take the harsher route with her youngest reader market.",
                "review/helpfulness": "16/20",
                "num_reviews": 20
            },
            {
                "review/text": "After reading &quot;Superfudge&quot; for the second time, the book took me back when I read it for the first time and I remembered how much I love Judy Blume's books. When I first read this and other books by Blume, I was in elementary, during the time which I was beginning to relate to her books. &quot;Superfudge,&quot; of course is a book that speaks of a boy who has a younger brother named &quot;Fudge.&quot; This book relates to many boys who have to deal with becoming a role model to their younger siblings, even though, like Peter in the previous book &quot;Tales of a Forth Grade Nothing,&quot; has no say in becoming an older brother. &quot;Superfudge&quot; deals with the universal human concern of family and finding themselves in that family, for example, Peter at first was the baby, but then he has that family placement taken from him when his brother is born. In &quot;Superfudge&quot; Peter not only finds out that there is to be another family member on the way, but that they are moving from New York to New Jersey. This to Peter is a critical change in his young life and seems like a never ending crisis. I truly recommend this book to young readers, especially those with younger siblings because this might help them understand that they are not alone in this world with the same problems. Because pre-adolescence is a critical stage, for both males and females, any type of change can seem like the world is going to end. Judy Blume's &quot;Tales of a Forth Grade Nothing&quot; and &quot;Superfudge&quot; is a reflection of such feelings in young boys who because of their family issues undergo many difficult changes that to a young boy are hard to deal with. Blume's books make young readers feel that they are not the only one's with problems. Because pre-adolescence is a stage where young adults feel as if they are alone with their issues, Blume helps them realize that life gets better, easier to deal with and most importantly, that they are not alone.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "As some other readers have commented - one has to beware of reading this to a 5 year old, or in the case of my daughter, an 8 year old. Thank God I didn't let her read it and was able to 'edit' that Chapter quite severely to protect the two of them. What a surprise to take a full frontal assault on Santa in such an otherwise incredible series. I didn't get the joke I guess. Destroying a young child's fantasy life is hardly appropriate material. I see the age recommendation is 9 and up, but still, that's an awfully young age to expose adult viewpoints on Christmas in my view. At least in this context it was.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "Thank God I was doing the reading and was able to filter out the offending paragraphs. This book will otherwise spoil your child's Christmas.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "We love Judy Blume's books so far but, my God, what was this woman thinking? She writes a book that features an 11 year old but is read, let's face it, by 7-10 year olds. Many of these children cherish Santa Claus and this book basically kills it for them. I cannot believe that I unwittingly bought my young son a book, second in the series he loves, and had to face his tearful face asking me if it is true. This is an area that should be left to parents and children to discuss and decide for themselves. For shame, Judy Blume!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I read this book along side my 5 year old who's reading Double Fudge. Because he's reading at 4th grade level, we've been searching for books that are just right for him. Little did I know that I myself would enjoy reading Judy Blume's books this much as well. It is a great way for us to bond when the whole family reads the same book--and bonus for us parents to be able to read books that are not dumbed down just because they are meant for kids. In addition, I am also glad that I read the book before handing it to my son because it does \"reveal\" the \"truth about Santa\"... Since my son is only 5, unlike most of Judy Blume's intended readers, he still believes in Santa. I've never written an Amazon review before, but I thought I should point this out in case someone else is thinking of getting this book for his/her early reader. If this does not concern you, then I highly recommend this book: I can't remember the last time I laughed so hard.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "if i forget you remember",
        "description": "A sexy romance that fans of Simone Elkeles and Jamie McGuire will fall in love with... There's a lot Zoey would like to forget. Like how her father has knocked-up his twenty-four-year-old girlfriend. Like her mom's nervous breakdown. Like Doug, the darkly handsome bad boy, who taunts her at school... Worried that her life is becoming a complete mess, Zoey fights back the only way she knows how, by making sure that she's perfect - the perfect daughter, the perfect student and the perfect girlfriend to ultra-popular football player, Brandon. But then Zoey is in a car crash and can't remember anything about the night it happened. She should have been with Brandon, but he doesn't seem to know anything about the accident - and, more confusingly, doesn't seem to care. Only Doug, who saved her from the wreckage, has the answers Zoey so desperately needs, but he's the last person she wants to rely on, especially as he's acting like something happened between them that night. Which can't be true, can it? But with her thoughts full of Doug and strangely empty of Brandon, Zoey starts to question her feelings for the two boys and whether being perfect is more important than following your heart.",
        "authors": "['Jennifer Echols']",
        "infoLink": "http://books.google.com/books?id=YST4QEhQLLwC&dq=If+I+Forget,+You+Remember&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The story of a girl dealing not only with the problems faced by most her age, but also her grandmother's medical condition, this book has some very meaningful lessons to share. Despite an unfinished ending , you will probably smile and cry at the same time. It is a wonderful book for anyone experiencing the effects of a loved one's battle with Alzheimer's disease.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As a Principal of a K-6 Elementary I read this book with 4th,5th and 6th graders as part of a &quot;Principal's Book Talk&quot; program. This was a very realistic and moving book for this age group. They related to a lot of the problems that the main character went through. They could easily relate to the bullies and the main character's problems she faced with trying to fit in. We really enjoyed the way the author describes the character's feelings and thoughts that the events touched in her. I thought this was a great book to share with this age group because of the situations and experiences they face on a daily basis. Her relationship with her grandmother was very touching. If you are a student, teacher, or parent, this would be a great book to share with others.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Sooner or later most family siblings will have to come to the acknowledgement that their parents are not just getting old, they are old. It is always a hopeful dream of any aged person, that they will not have to be institutionalized and that they can go quickly and not be a burden on their children. But for many families, that just doesn't happen.I would suggest for family siblings having to deal with aging parents, that they purchase this book and read it together. In- spite of the fact that the Kirkus Review said this was a sad story, I think &quot;If I Forget, You Remember&quot; has a lot of wonderful humor to it. Humor is the key to anyone's salvation in taking care of the aged.Carol Lynch Williams has done a wonderful job in making sure the reader doesn't get bogged down in the seriousness of the book. She has managed to show the devastaion of Alzheimers desease yet instills a sense of confidence that taking care of an aged parent isn't only possible, but it can be done while maintaing a somewhat normal lifestyle.The one great quality of this book is how the family supports the mother/grandmother and always lets her know how much they love her. They love her no matter what she does. They understand that she isn't the way she wants to be. And this love and caring is never breeched even by tragic events.I think &quot;If I forget, You Remember&quot; should be on every shelf of every home who has a parent or grandparent living there. When that time comes, to us all, that time when we realize we are old, it would be nice to know that your children could read a copy of &quot;If I forget, You Remember&quot;.MarvP.S. My favorite color is spring-green--for those who have readthe book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "what do you say when a monkey acts this way magic castle readers",
        "description": "Each day of the week, Little Monkey learns appropriate behavior for a variety of situations.",
        "authors": "['Jane Belk Moncure']",
        "infoLink": "http://books.google.com/books?id=bfkxOepoKFgC&dq=What+do+you+say+when+a+monkey+acts+this+way%3F+(Magic+castle+readers)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book teaches manners to your child! Little Monkey goes through the week learning how to be a Big Monkey and showing he can apologize, say please and thank you, and share! Children will enjoy the repetition of, &quot;What did Mama Monkey say?&quot; after each misbehavior. Parents will enjoy how readily and happily he corrects his behavior! This is a must for anyone who wishes to help someone learn good manners.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Our 30 month old grandson loves this book, which is great, because it stresses the \"manners\" issues he needs reminded of right at this time. Certainly worth searching for. It has a rhymey, rhythmey, cadence to it which he likes. He wants it read over and over.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "daddies are for catching fireflies lifttheflap puffin",
        "description": "Lift the flaps and see all the extra special things a daddy does.",
        "authors": "['Harriet Ziefert']",
        "infoLink": "http://books.google.com/books?id=TZQFEAAAQBAJ&dq=Daddies+Are+for+Catching+Fireflies+(Lift-the-Flap,+Puffin)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a wonderful book for a father to read to his son or daughter. So many of my daughter's books talked about a mother/child relationship, and I hadn't really found any books about a father/child relationship that I liked until I found this book. It talks about the very special things that a father might do for his child, such as teaching him to swim or fixing a broken toy. For example, one page shows a daddy taking his child to a parade. Then the reader lifts the flap to show that the daddy has given his child &quot;the best seat at the parade&quot; by placing him on his shoulders. My daughter likes this book, and so does my husband.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book would make a wonderful present from a 2 year old for Father's Day. Children from 2-6 should be very pleased with the book. The images and activities are fairly divided between daughters and sons, so it should be equally enjoyable for all young children. The large, pleasant water colors will be accessible for very young children. One year-olds will enjoy looking at the pictures. The book can also be used as a beginning reader around age 5. Lifting the flaps will seem like peek-a-boo for 2-3 year olds and will bring torrents of giggles.The book basically recounts lots of things that Daddies can help children with. My favorite was an illustration of a dozing Mom in a chair accompanied by the caption: &quot;Sometimes at the end of the day, Daddy puts you to bed.&quot;The book begins by having a girl try on Daddy's shoes and a boy put on Daddy's belt. Dealing with the relative size issue is a good place to start, and by making it humorous can take some of the potential discomfort out of the size differentials between children and the Daddies.When the flap is lifted, the child is included more directly with Daddy. For example, one illustration shows a Daddy shaving while a boy looks on. The caption is &quot;A daddy shaves.&quot; Under the flap, the boy has put some shaving cream on his own face, as well. The caption under the flap says &quot;And is good to smell.&quot;Daddies tickle your feet, mess your hair, try to fix things (not always successfully), help you deal with deep water (and teach you how to swim), protect you from big dogs, answer questions, go to work, and put you on their shoulders so you can see better.The book creates the expectation that Daddies will do things with their children, but not that Daddies are perfect. As you can see from the example, care is taken to turn Daddy's size into an advantage for the youngster.A benefit of having a book like this is to encourage Daddies and children to do more things together. Children are often very attached to their Mommies, and some are more than a little afraid of their Daddies. This book sets up an expectation of doing things with Daddies alone sometimes. That's good. Almost all children's books features Mommies doing things with children, so this book helps balance that mental image out.After you have been reading this book for awhile, I suggest that you ask your child what things Daddies could do that she or he would like that are not listed in the book. That can help you expand your relationship in mutually rewarding ways.Keep your eyes open for fireflies!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "My 20 month old daughter loves this book. The flaps are large and easy to lift. The illustrations are cute. This book does a great job of showing that a lot of the everyday things Daddy's do are special. My daughter often asks to read this when her dad is working late, and she is thinking of him.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the 8 seasons of parenthood how the stages of parenting constantly reshape our adult identities",
        "description": "The authors break the journey of parenthood down into eight distinct stages and discuss the role of each stage in shaping individual lives. 35,000 first printing.",
        "authors": "['Barbara C. Unell', 'Jerry Wyckoff']",
        "infoLink": "http://books.google.com/books?id=a3gDAAAACAAJ&dq=The+8+Seasons+of+Parenthood:+How+the+Stages+of+Parenting+Constantly+Reshape+Our+Adult+Identities&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I'm a volcano dweller and a psychotherapist and I love the truth in this book. I thought I was going to mold my children, little did I realize how much they were going to mold me. This will be an absolute &quot;must read&quot; for all my clients who are parents. A definite &quot;sanity enhancer&quot; for those &quot;how did I get myself into this&quot; moments!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "We received this book after our first child was born. I was SO glad to have this book, it validated all my feelings about having a newborn in the house and helped me gain perspective on what is in store. At a time of so much chaos, this book really grounded me! I look forward to using it as my child grows and my role as a mother continues to change.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "As a mother of toddlers, this book has helped me appreciate how precious this &quot;season&quot; really is. After reading this book, I now know what to expect and will have more confidence in handling the ups &amp; downs of parenthood. This is a MUST READ for anyone who is a parent-to-be thru a grandparent!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My 17-year-old daughter left this morning for three months of making her dreams come true. I would have been mopey and left to feel sorry for myself had I not read this book. Understanding the stages and phases of my life as a mother -- and as a daughter -- is practical and valuable. I highly recommend this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "thomas snowsuit",
        "description": "His mother, teacher, and principal have a hard time trying to convince Thomas to wear his snowsuit.",
        "authors": "['Robert N. Munsch']",
        "infoLink": "http://books.google.com/books?id=pfprVqJJkIAC&dq=Thomas%27+Snowsuit&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As a Minnesota preschool teacher, I can't tell you how realistic this book is! (in an exagerated way, of course). This book has become a classroom favorite every winter when snowsuits are a way of life. Robert Munsch really knows children and the way they think. Thomas, his teacher, and even the principal have an excitable time getting Thomas into his brown snowsuit to play outdoors. A word of warning: underwear causes fits of hysterical laughter to any 3 to 5 year old!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have worked in the children's department of my public library for over a year and this is one of the most popular books. I can't decide who enjoys it more- the children or the parents. The book is just good plain fun with something everyone knows about, trying to get a small boy into a yucky, confining snowsuit. Tha story gets funnier with each succeseive person the snowsuit ends up on. I love this book and recommend it to many patrons. Munsch is one of the funniest authors I've ever had the pleasure to read",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read this book out loud at our gymnastics training center, and the kids thought it was amusing but the coaches were on the floor! The rollicking humor of Munsch's books makes them ideal read-alouds for parents bored with the &quot;See Spot Run&quot; style. I can also recommend &quot;Moira's Birthday&quot; and &quot;The Paper Bag Princess&quot; but &quot;Thomas' Snowsuit&quot; is the funniest of the bunch.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I first heard this story in my education class while we were learning how to do shared reading in the classroom. Being read to in the child's perspective was interesting enough, but to have this book read was a blast. The pictures are humorous and the story makes children and adults laugh. Everyone knows that parents make you do something you can't stand. We have all seen \"The Christmas Story\" with the red-rider bb gun and the infamous overly wrapped for winter younger brother. This book reminds me of that hilarious scene. Once the teacher and the principal get in the act it gets all crazy. In the end, just like you would expect a child to do, he jumps right into his snowsuit when it lets him do something he wants to do, play. This is a sweet story, a good read for children.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Young readers and preschoolers love irony as much as adults - that's what the best humor is based upon. Munsch and Martchenko excel in bringing that irony to the printed page in this book. Exageration is at its best as Thomas asserts his independence, and the rhythm of language pairs beautifully with the witty illustrations to keep kids and adults laughing throughout. My kids have treasured this book since it first landed at our house several years ago. As a child psychiatrist, I find it to be a great ice breaker when working with my young patients. It's a great book for breaking out the grins!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I'm buying a copy for each of my kids to save for them when they're grown. This book has provided wonderful hours of reading and precious fits of laughter. It's also been an avenue to open conversations about acceptable behavior. I disagree with the review that it teaches children disrespectful behavior, actually I teach my children acceptable behavior and to discern when they are out of line. Thomas is definitely a way for them to bring that lesson home, in a hilarious way! Everyone needs to laugh and I love that this book appeals to the very young (my two year old loves to say no! with Thomas)and to the very old (my grandma read it to the kids the other night and cackled along with them!). Lighten up and enjoy life! That's the message of Munsch!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a GREAT book for reading to kids, with kids, and by kids! The hilarious storyline and repetitive nature keep even the most reluctant reader interested. It's a &quot;laugh till your belly hurts&quot; book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the girlfriends guide to getting your groove back loving your family without losing your mind",
        "description": "Bust out of that mommy rut and get into the groove! When a mother finally emerges from the mommy mole tunnel of pregnancy, breastfeeding, potty-training and preschool, she comes to the inevitable realization: The road to maternity is a one-way street. No U-turns allowed. You've survived the battles of baby- and toddler-hood, playdates and temper tantrums to time-outs. And just when it seems your former life is within reach-taking up neglected jobs and hobbies, committing to a fitness program, rediscovering the boyfriend living in the body of your husband-you crash headfirst into the wall of reality. The kids may be able to fasten their own seatbelts and pour their own cereal, but the homework, tucking in, car pools, and birthday parties have just begun. Let Vicki Iovine, author of The Girlfriends' Guides, show you how to navigate the twists and turns of family life-and find time for your kids, your spouse, your home, your work, and yourself. You're not alone in this \"mommy adolescence.\" In The Girlfriends' Guide to Getting Your Groove Back, Iovine provides her trademark sage, witty advice on: - How to focus at work when things at home are in chaos-and vice versa - Making time for yourself-and not the PTA - Getting over the romantic myth of \"date nights\" and weekends away from the kids - Homework help-your transformation into a human flashcard - The dinnertime crush and how to relieve frozen pizza fatigue Iovine puts the perils of perpetual parenthood into perspective. You'll feel like you do after a long chat with a good friend-relaxed, refreshed, and ready to reclaim your life ...",
        "authors": "['Vicki Iovine']",
        "infoLink": "http://books.google.com/books?id=nC_Qc_ZVnrcC&dq=The+Girlfriend%27s+Guide+to+Getting+Your+Groove+Back:+Loving+Your+Family+Without+Losing+Your+Mind&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Everyone told me how great having kids would be. Personally, I think they were trying to lure me into the &quot;mommy club&quot; by not telling me the rest of the story. While having babies is exciting and defenitely one of life's undisputed miracles, there is an aspect of it that changes you forever. You have to give up a lot of selfish behavior (in that, I mean things that aren't in and of themselves selfish in nature, just things you normally do for yourself: i.e. taking a long, hot bath or having a bit of a lie down whenever you feel like it)and in the process, you lose a bit of yourself. Thank goodness Vicki Iovine and her gaggle of girlfriends have returned to tell me that I'm not alone! It's amazing: you think that passing a certain &quot;stage&quot; (i.e. teething, potty training)is a relief, but in the process, you begin to feel your purpose slip away as your kids grow more and more independent. You begin to think, now what? I've been raising my kids for X amount of years, and I've lost who I am. Wasn't I supposed to just slip right back into the fabulous career woman role with little to no turbulence?!? Vicki is right by our side to lend her shoulder and support, and to tell us (perhaps before we even realize it) that life keeps changing- you never pass a &quot;stage&quot; and get relative calm in your life. She uses the anaolgy of a leaky rowboat. You can either cry about the fact that you're up to your knees in water, or you can grab that bucket and bail the boat out, something you'll have to do again and again as eventually, the rowboat fills up again. Vicki helps us to see the humor in motherhood, and the unique role we play as women, but not in some drippy, &quot;I found this book in the self help section&quot; way. Every piece of advice is peppered with humor. Vicki explains how to focus at work when things at home are chaotic, that we should get over the romantic myth of &quot;date nights&quot;, and how to turn to your experienced girlfriends for help through what she calls &quot;mommy adolescence&quot;. A must for every mom.",
                "review/helpfulness": "57/61",
                "num_reviews": 61
            },
            {
                "review/text": "This book is written for the Mommy who has finally put all the kids in school, and now wants to reclaim a part of her old self. Although I still have small ones at home, I found it reassuring that these &quot;stages&quot; parents go through with the kids don't last long, so we might as well enjoy them. At the same time, we need to remember that &quot;we are the only ones who know how much soul-searching time we need to keep functioning as the locomotives that pull the family train.&quot; I think a Mother can never hear enough that the days are long but the years are short, and that taking care of yourself must be a priority if we're to make it all fly and stand a chance of enjoying our families and ourselves.",
                "review/helpfulness": "34/37",
                "num_reviews": 37
            },
            {
                "review/text": "I loved the idea for this book, but Vicki Iovine drowns any useful information in a sea of boring personal anecdotes and terrible writing. Reading this book is like getting a phone call from that dear friend who just won't stop talking about herself. At 280 pages long, you'll learn much more than you ever wanted to know about Viki Iovine and not much about how to get your groove back.",
                "review/helpfulness": "17/26",
                "num_reviews": 26
            },
            {
                "review/text": "Vicki had me giggling through babyhood and terrific (haha) twos, but when the babies have stopped coming and it comes time for them and you to grow up, you're on your own. Until now. Vicki is refreshingly honest, sometimes a bit crudely so, but hey, she doesn't live in small-town America. She understands from experience how a mommy's body and soul have been hijacked for years by a bunch of adorable little fuzzballs (who may now be adolescents themselves and hormonal, while you may still be potty training the caboose!)and that, Hello! her dear husband may be ready to welcome her back to being his honey, and that she might actually be able to respond sans the multitude of interruptions. After all, as Vicki says, now they can get their own glass of water! It's time to get a part of our lives back under control, which we willingly gave away when we were needed so much, and now if we've done our jobs right and have helped our children to achieve some level of independence and self-sufficiency, Vicki kicks us in the (too big)tush and says &quot;Lose it! Get your act together, no more excuses, it's your turn! You've done your time!&quot; Thanks Vicki! I needed that.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "This books stinks. I've read all the other books and somehow Vicki has bought into gender norms, Christianity, and all the dated tropes of parenting. Does getting older = being a fuddy duddy? This book was PAINFUL to read and I felt like she had some agenda to put me back into the house and not take care of myself. I also don't like that she doesn't note that her husband makes BIG BUCKS. He is a big-time music producer. Please. Her life is radically different from most in the US!! Read _Breeder_ or _Mother's Who Think_ instead of this!",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "Ms. Iovine has a great knack for hitting the nail of motherhood right on the head. This book is a real look at what most of us moms are going through- loving our family, but wondering when we will have time for ourselves, and why we are so suprised that everyone's needs are being met, but somehow, not our own. I felt this book not only spoke to my struggles at being a mom, wife, carpooler, volunteer and holding a job, but certainly made me feel as if I were not alone on this treadmill. The best advice she gives is to look forward, and that we will never be the single girls we once were, so it is time to create a new identity and take care of ourselves, so we can enjoy our lives NOW and in the future. Thank You for a great book!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Not her best work. Very boring. Her advice is useless. Humor not the same as in her previous books.I loved her &quot;Girfriend's Guide to Pregnancy.&quot; It was a hoot. This book is not interesting. Do not waste your money on it.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "In some ways, Ms. Iovine and I couldn't be more different. I haven't worn a pair of high heels since my rehearsal dinner nearly eighteen years ago; makeup is something I put on in five minutes for my husband's annual christmas party; and I still don't know what I want to do with my life--compared to her highly successful career, stylish TV appearances, weekly newspaper columns, etc. But underneath the surface, we're both &quot;mommies,&quot; and that experience of trying to meet the infinite needs of your children while keeping a self intact is universal. Or at least, *now* I know it's universal, after reading this book. I found it warmhearted, encouraging, and practical--even when I knew I'd never do what she's suggesting. And even though all of her books have included discussions of highly personal topics, this one seemed even more personal to me, as if she were truly baring her soul at certain spots. I'd highly recommend it, especially to those, like me, whose youngest child is approaching school age and suddenly there is a light at the end of the tunnel--a thought both longed-for and (I find to my surprise) a bit dreaded.My only complaint, though, is the incredibly sloppy editing. There are typos, misspellings, punctuation marks missing (like periods at the end of sentences). Not Iovine's fault, of course, but the publisher has to be making a fortune off these books, you'd think they could afford a proofreader.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "the book seems like two different books. I really enjoyed the first half or so. The &quot;advice&quot; was clear and made sense and I felt like, YES someone understands my feelings. Then, halfway through, the book became more a series of poorly written and poorly edited, hard-to-follow rants that made little to no sense to me at all. There are EXTREMELY long and rambling run-on sentences, some of which never actually complete the thought they began. She randomly uses colons and semi-colons in ways that make the sentences feel disjointed. Things like this may not matter to others, but when the writer and editor are &quot;girlfriends&quot;, it annoys me that the reader has to work even harder just to get the gist of what should be an easy and fun read. It feels like she just used this book as a forum to ramble about her own husband-complaints (which I could NOT relate to at all, luckily) and her willingness to let her children walk all over her. She seems to love being needed so much that she has no personal boundaries with her children. To me, part of getting my &quot;groove&quot; back is being able to shower and use the bathroom without children as an audience. Not a great grooving message in my opinion. And how many times in a &quot;grooving Mommy&quot; book does she HAVE to mention getting your kids vaccinated?All in all, if you love Vicki Iovine and have enjoyed her books before, you will probably like it. But if not, save the money and buy yourself something else to help get your groove back. After reading her thoughts, I realized I never lost my groove after all. It's hard to take advice from someone who obviously lives in a different world from the one I inhabit. Maybe fun to read, but I worry for those women who will take her every word and try to live this book at home.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I purchased this book when my daughter was an infant, not sleeping through the night, etc. And it saved me from losing my mind. I recommend it to every new mom!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "honey bunny funnybunny beginner booksr",
        "description": "Honey Bunny Funnybunny feels that something is missing when her bothersome big brother finally stops teasing her.",
        "authors": "['Marilyn Sadler']",
        "infoLink": "http://books.google.com/books?id=nebAhXEBOlwC&dq=Honey+Bunny+Funnybunny+(Beginner+Books(R))&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a terrible book. I purchased this as part of a series of books for beginner readers in the Dr. Seuss series. Four adults have read this book and we all agree that this is really sick stuff.The little sister bunny is the subject of verbal teasing and physical tricks such as &quot;smashing carrots&quot; on her head at the dinner table. (Real lovely and funny, huh?) More tricks and nasty deeds follow. They go noticed by the parents until one final act and little sister tattles on her brother. Only then do the parents tell the older brother to leave her alone. They don't explain why what he is doing is bad. They don't ask him to apologize and he does not apologize. He chooses to abandon her and go play with other friends and basically ignore her for a while. Mother explains that &quot;he is playing with friends&quot; instead of spending time with her. She gets lonely and tells her mother that his lack of abuse on her is a sign of his not loving her anymore. The mother says that he does love her and shows her that he has resumed his abuse on her by painting her face with paint again. Little sister is happy and gives her brother a hug. Mother must also be happy as she disappears at that point and mother does not.This is the most negative children's book that I have ever read to date, and the only book that I have ever read that approves of verbal and even physical abuse. This is an illustration of how a sibling relationship should not be. And especially a relationship between older brother and younger sister. I have no idea why this book was allowed to be published. This is definitely one for the trash heap. I will not donate this copy to the library or even sell it to a used book store as I don't want this terrible message taught to preschool aged children (the audience it is written for).I am a mother who wants to raise her boys not to be violent, that teasing is not all right, name-calling does hurt, and physical abuse of other humans is not permitted and is not allowed by our society. I am raising my boys to learn to communicate well with others, admit their mistakes, and apologize when they are wrong. I am sensitive to the messages that we give our children through books, television, and also by viewing how adults interact with each other. There are better books out there to teach the lessons that tormenting others is not alright-I do not feel that this book is a good springboard for discussion even if the discussion is to address abuse and what constitutes a healthy relationship. And some wonder where our children learn violence and that dysfunctional relationships are the norm....this is one book that young children learn it from.",
                "review/helpfulness": "12/18",
                "num_reviews": 18
            },
            {
                "review/text": "Although I do not often become too excited about the negative aspects of children's book, I feel the negatives in this one outweigh the positive.Little sister learns that the wrong kind of attention is better than no attention at all; that you can EITHER be abused or neglected. That having polka dots painted on your face (or maybe scratches or bruises) is some kinds of a sign of affection or love.Brother learns that withholding love makes you a winner and makes you so you never have to apologize.These &quot;lessons&quot; are shown everyday in our schoolyards where our kids are teased cruelly. We don't need books, let alone children's books, to show us this, to extol this.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "We bought this book for my daughter based on the Dr. Seuss logo on the cover and the cute illustration of the little girl bunny rabbit. While the book's exterior is innocent enough, I'm very dubious about the message this children's story sends to young girls, such as my 6-year-old daughter.The story involves a big brother bunny, P.J., and his little sister, Honeybunny, whom he torments relentlessly. He stops when he is punished by his parents for some particularly egregious prank and then completely ignores his little sister. On one page he is shown haughtily ignoring Honeybunny, obviously in retaliation for the &quot;crime&quot; of reporting one of his viscious pranks.Eventually, Honeybunny becomes depressed that she's no longer getting attention from her abusive older brother. At the conclusion, she is relieved when P.J. once again resumes his cruel pranks by painting her face during her sleep.What sort of message is this story supposed to send to young girls? That they should tolerate, even welcome cruel and abusive behavior from male family members and by extension, males with whom they develop relationships?I consider myself a pretty easygoing person and I don't mean to make too much of a children's book, but kids can be impressionable, and I was very disturbed by the message this books conveys to children, especially girls. I've long considered writing the publisher and complaining, but for now this forum will have to do.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "To excuse the bizarre and inappropriate storyline of this book as the product of deranged and PC minds is ridiculous. I actually read the stroy several times to my young son before I actually thought about what it was saying. Basically the young female only feels that her brother loves her if he mistreats her! The amount of abuse he seems to heap on her seems excessive and cruel. Even more so, in fact than painting her face. That she misses this attention seems disturbing to say the least.I have passed this book around to several adult acquaintances and simply asked them to take a look at it and most have had the same reaction.I also thought of writing to the publisher - but am contenting myself with this.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book does not send a message in line with other Seuss books such as Horton Hears a Who and The Lorax. The stories written by Dr Seuss were either nonsensical fun, or morality stories wrapped in made-up language that appeals to children. The story of Hunnybunny Funnybunny by Margaret Sadler is neither. While on the surface it is a tale of sibling rivalry, it really is more about preferring negative attention rather than none at all.PJ Funnybunny's \"teasing\" of his sister Hunnybunny is sometimes silly, but sometimes legitimately punishable offenses. How many parents would laugh if their child \"poured mashed carrots\" on his or her sibling's head \"everynight\" as PJ does to Hunnybunny? Or if one sibling painting the others' face during the night? And the Funnybunny parents do nothing until Hunnybunny finally complains? It is very sad when in the end Hunnybunny translates this persistent torture into \"love\", preferring it to PJ's disregard, and her mother reinforces this. We can only assume that after Hunnybunny hugs her brother for painting her face bright blue while she slept, he goes back to humiliating her in various ways.The parents who laugh this off as a funny, harmless story are forgetting that self-esteem is built when children are very young. How they are treated by their parents and siblings shapes how they allow others in their lives to treat them. My husband bought this (without reading it first, as we usually do) because my daughter asked for it (because the cover is pink). He was horrified when he read it, as was I. We have removed it from our children's book collection, because this story reinforces negative behavior and reactions to that behavior. I not only do not recommend it, I steer people away from it at every opportunity.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a wonderful book for children if you want boys to think it is their right to abuse girls and for girls to think they have to endure abuse in order to be accepted. It teaches boys that to withhold affection is the key to success. I really can't believe that a female wrote this book, as it is about as blatantly chauvinistic and &quot;old school thinking&quot; as I have read in years. Children are impressionable by what they see on television and what they read; to think otherwise is having your head buried in the sand. This book does not portray acceptable behavioral patterns for people of any age.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I bought this book packaged along with 2 other Dr. Suess books I wanted. When I read Honey Bunny Funnybunny to my 5 yr old daughter, I quickly decided we would not be keeping the book. Honey Bunny is teased unmercifully by her older brother. When she objects her parents intervene. They tell her brother to stop teasing her, but do not explain to her brother that there are better ways to show love, and that teasing is cruel and benefits no one. So brother withdraws his attention from Honey Bunny and she decides teasing is better than no attention at all. I feel this is a very bad message that teasing is OK. Teasing is not OK. Teasing is cruel. Perhaps a different sort of book would model for young boys how to really show love instead of reinforcing that they can just act mean instead.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I really can't stand this book, would never buy it for any child, and would give it negative stars if I could. It gives an awful message, especially to young girls, that abusive behavior is a sign of love. I can't imagine why anyone would want to read this story to a child.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This truly IS a terrible book. I am one to really harp on parents not taking childrens' books so seriously (read my other reviews about The Giving Tree and The Rainbow Fish), but this one really is twisted. I can only assume this is how the author views male-female relationships for her to even consider writing something such as this.I have only read one other book in the series-- It's Not Easy Being a Bunny. I enjoyed that one. I thought it was a really cute story. I purchased it from Ebay and a page was ripped, so the seller replaced it and said they were sending this book for my trouble. I read the reviews and was tempted to tell her no tto bother, but I figured the reviewers were reading into it too much like other books I have reviewed.Sadly, that was not the case. I got it several days ago and got around to reading it last night after my son went to bed. Regardless of the reviews I have read, I would have felt the same way about the book.The story is about Honey Bunny Funnybunny and how her brother always teases her--painting her face in her sleep, scaring her, etc. That isn't what bothered me. Everyone knows, even children, that kids tease kids. It's just how kids are. Even adults tease each other. What bothered me about the story is that in the beginning Honey Bunny was so angry at him for treating her that way that he eventually stopped and did his own thing, sort of ignoring her and playing with friends instead. She then started saying how he didn't love her anymore because he was no longer teasing her. Her mom said it wasn't true and to go look in the mirror--and she had paint on her face once again. It wouldn't have been so sick had it been worded differently. But the look of horror on her face when she thinks he doesn't love her because of his lack of teasing and how her mother says of course he does and then she sees the paint...that is just sick. Even a little kid would be able to see that Honey Bunny clearly WANTS to be teased because that is love to her. Yes, there is a degree of love to teasing, but you will just have to read this book for yourself to understand.Don't buy it...read it at a store or library...you'll regret you wasted your money. I'll never read this to my toddler.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the night before kindergarten",
        "description": "In the narrative tradition of \"The Night Before Christmas,\" shows children from all over town preparing for their first day of kindergarten, imagining what wonders they will see.",
        "authors": "['Natasha Wing']",
        "infoLink": "http://books.google.com/books?id=K4coEAAAQBAJ&dq=The+Night+Before+Kindergarten&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I like the way the book begins, with children thinking and wondering about kindergarten, the night before school begins. But the book then turns to the mommies and daddies, who stand crying at the door on the first day of kindergarten. I didn't really want to give my daughter any ideas, as she was already a nervous wreck. The teacher assures the parents that everything will be fine, but I really didn't like this part of the book at all.",
                "review/helpfulness": "74/78",
                "num_reviews": 78
            },
            {
                "review/text": "I have seen many stories about children going off to school for the first time but this one has a surprising difference that really sets it apart from the others.The poem begins on the night before kindergarten with children and parents getting ready for the big day. Then the day arrives and we see children and parents as they prepare, go to, and arrive at school. There is much said about a lack of napping places that does not match my children's experiences. But then we see how the parents are saddened by leaving their kids behind. The resourceful teacher manages to find a quick solution and all ends happily.The first day of school can be hard for children and adults alike. This is the first book I have come across that deals with the excitement and hesitancies on this special day. A very fun book for parent and child.",
                "review/helpfulness": "30/31",
                "num_reviews": 31
            },
            {
                "review/text": "I bought this book for my granddaughter and for a friend's child who is entering kindergarten. Loved the idea of making children aware that this is a big step for them but somewhat bitter-sweet for their parents. Mentioned leaving their baby things behind as they go into the big school world. Pictures were very up to date--clothes, backpacks, school supplies. Very well done. I would extend the age range for appropriate readership through kindergarten age and not limit it to preschool.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I do not recommend because it essentially presupposes that kindergarten is a scary place and that you only need to overcome your fears when entering this frightening place. That's how it seemed to me, at least.Instead of describing kindergarten as a fun, happy, loving place, it talks about how children are at first afraid, but then learn to like it. Why even suggest that your child should be afraid?Worse, in the book, all the parents stay in the classroom, outside the door watching. That's not how school works. The parents are not there, so why suggest that they are going to be at the door looking in during the day?Not recommended. The other \"night before\" books I like, just not this one.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I bought this for my 2 year old who was starting Preschool and she LOVES it! It has darling illustrations, a cute story and a happy ending.....I recommend this one!",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "We've read several other books that are modeled after \"'Twas The Night Before Christmas\" and have enjoyed them. The rhyming of this book is enjoyable, but there are several things that I did not like. 1) There is a reference to \"day care\", stating that \"Some kids brought blankets or their favorite stuffed bear, in hopes they could nap like they did in day care.\" My daughter asked what day care was. 2) Too much was made about parents crying, and it is not appropriate. If parents are crying, a 5-year-old does not need to be burdened with this. In the book, the parents stayed at school, crying and watching, while the kids did about a dozen activities! That is totally not realistic. In fact, the crying parents (and the children setting THEM at ease with a final goodbye and hug and wave) seemed to occupy the bulk of the book, instead of focusing on how the child is getting bigger, and going to like school, etc., etc.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "I purchased this book for my daughter and read it to her a few weeks before her first day in kindergarten. It does have a neat ending, which I think helps children forget about their fears of the first day of school. Even though kindergarten has started, my daughter still likes me to read this to her.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I teach preschool children and I am giving copies of this book to the parents of my graduates. It has a nice surprise ending that is appropriate for that first hard day!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "We received this book in the mail coming from our new kindergarten teacher.My daughter (5) loved the story - she found the part where the parents cry amusing!This book accurately described our actual experience the first day so for us there were no surprises and my daughter loves the fact that there is a beautiful rhymed story about our experience.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I thought this was an excellent read for children about to enter Kindergarten...not every book has to be realistic, because, let's face it, Kindergarten can be scary to a 5 year old. I also purchased a number of other books for pre-K and read those, along with The Night Before Kindergarten, to my 5 year old. He particularly enjoyed this book, because it's easy to understand, the rhyming makes it fun and it ends with the grown-ups crying, which he thinks is very silly.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    }
]