[
    {
        "Title": "labyrinths from the outside in walking to spiritual insighta beginners guide",
        "description": "Walking labyrinths is a twenty-first century method of approaching the sacred and a spiritual practice more ancient than Stonehenge or the ruins of Troy. A practical and inspiring guide to help you explore.\"",
        "authors": "['Donna Schaper', 'Carole Ann Camp']",
        "infoLink": "http://books.google.nl/books?id=RB-0hM12c74C&dq=Labyrinths+from+the+Outside+in:+Walking+to+Spiritual+Insight-A+Beginner%27s+Guide&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Fortunately, understanding the nuances of the labyrinth is easier than figuring out what the aforelisted reviewer said in his review!&quot;Labyrinths from the Outside In&quot; is a primer for the labyrinth as a useful metaphor and mystical tool through which one establishes a stronger connection to self and the larger world around them. It provides a basic methodology and useful tidbits of information which prove facilitating on the journey.Easy to read and understand while very practical, this book makes for an interesting spiritual journey.Well done.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is not the best book I've read on the subject of labyrinths, but is quite good, particularly for neophytes, with much basic history and information.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the meaning of happiness the quest for freedom of the spirit in modern psychology and the wisdom of the east",
        "description": "Deep down, most people think that happiness comes from having or doing something. Here, in Alan Watts&rsquo;s groundbreaking second book (originally published in 1940), he offers a more challenging thesis: authentic happiness comes from embracing life as a whole in all its contradictions and paradoxes, an attitude that Watts calls the \"way of acceptance.\" Drawing on Eastern philosophy, Western mysticism, and analytic psychology, Watts demonstrates that happiness comes from accepting both the outer world around us and the inner world inside us - the unconscious mind, with its irrational desires, lurking beyond the awareness of the ego. Although written early in his career, The Meaning of Happiness displays the hallmarks of his mature style: the crystal-clear writing, the homespun analogies, the dry wit, and the breadth of knowledge that made Alan Watts one of the most influential philosophers of his generation.",
        "authors": "['Alan Watts']",
        "infoLink": "http://books.google.com/books?id=ajZlDwAAQBAJ&dq=The+Meaning+of+Happiness:+The+Quest+for+Freedom+of+the+Spirit+in+Modern+Psychology+and+the+Wisdom+of+the+East&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "To parody one reviewer of this book at the time of its first publication in the Spring of 1940, &quot;The mountain has labored and brought forth wildflowers.&quot; Which is to imply that through the mysterious vehicle of words Alan Watts has succeeded in unmasking the mysterious &quot;meaning of happiness,&quot; just as a mountain can, mysteriously, bring forth a meadow of beautiful wildflowers where there was once only barren ground.The original reviewer equated the laboring mountain with the bringing forth of a mouse, by which one may reasonable infer to mean that the voluminous mountain of words amounted to the slightest substantiality of meaning. But nothing could be further from the truth.Written in 1939 and published in 1940, The Meaning of Happiness, with its annotative subtitle &quot;The Quest for freedom of the spirit in modern psychology and the wisdom of the East,&quot; represented a watershed moment in western man's attempt to understand himself and his relationship to the universe and the creative energy of the universe.At the tender age of twenty-four Alan Watts used all his immense powers of perception and intellect, in this his third book, to draw together seemingly disparate concepts into an organic whole which help to illuminate the genesis of the elusive feeling of happiness. Though the philosophy brought out by Watts' discussion is profound he nevertheless presents it in a simple and easily understandable way, which is perhaps a preview of his uncanny ability to describe the indescribable.Seen and read today, through the distance of 60 years, The Meaning of Happiness may seem at first to be a bit dated. This is because it was written for a people who were under the influence of a different set of intellectual circumstances than those of us alive today. Back then, in 1940, most westerners had little exposure to the ideas and philosophies of what was then thought of as the Orient, which included the major cultures of Asia -- India, China, Tibet and Japan. Therefore Watts wrote in an effort to help educate as much as to illuminate his Western, predominately Judeo-Christian, audience's understanding of eastern philosophies coupled with the parallels of what was at the time known as modern psychology.What he was in the initial stages of formulating was a synthesis between traditional Christianity and the unitive mysticism of Hinduism and Buddhism, a theme he would explore in more depth in three other books: Behold the Spirit (1947), The Supreme Identity (1950), and Myth and Ritual in Christianity (1953).Though there are gems of wisdom and insight throughout the book, the chapters which stand out the most are the third along with the last three -- the sixth, seventh and eighth. If you are one who like to read ahead to get to the meat of the message, you will be especially interested in chapter six, The One in the Many. I won't spoil it for you, but you may find yourself in for a surprise and amazed at the depth of spiritual understanding that Watts brings to the concept of happiness.In today's world of quick fixes and mind numbing psychotropic drugs, like ritalin, the spiritual truths that Watts wrote about at mid-twentieth century are as meaningful and necessary a cure-all for the ills that plague men's minds today as they were then, in 1940. The lessons are as wise and practical as they are timeless. Here, in the brief span of two hundred pages, Alan Watts has managed to decode an ancient holistic plan for attaining not only mental well-being but for capturing that elusive feeling of bliss.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I love Alan Watts' writing. He makes you feel warm, like part of the family, but does not talk down to you like a parent. This book, written in 1940, is one of his earlier works, and you can sense he is still formulating his style. While sometimes scholarly, and other times playful, he mixes the right amount of both perspectives to give the reader a profound sense of being alive. The book is called &quot;The Meaning of Happiness&quot;. While we all have at some point experienced happiness, Watts explores the meaning of what happiness is and how might it be experienced more than a transitory feeling. Happiness is defined essentially as &quot;libertaion,&quot; where one no longer has the need to be happy, or need to be mad or need be anything exept to be. In a round about way it is enlightenment (or enlightenment is happiness). In Watts' calssical style, there is no progression one must endure, it just happens. It happens as easily looking with ones eyes. This is not the happiness that we coined in &quot;dont worry be happy&quot; because this presumes that one has to worry in order to be happy. It is not the, in order to experience happiness we must experience sadness. It is the &quot;transcendence of opposites&quot;. To dispute the Buddha's &quot;all things are sorrow,&quot; Watts says all things are happy.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you have ever heard the recorded sessions of Allan Watts, you know what you're in for when reading the book. A must read for anyone feeling alienated from the societal roles they play. As Mr. Watts would say,&quot;Take off your masks! Run free! We are all One! &quot;",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "living presence",
        "description": "A revised 25th anniversary edition of the classic work on Sufism that Jack Kornfield called, \"A heartfelt modern illumination of the Sufi path, filled with the fragrance of the ancients.\" In Sufism, the mystical branch of Islam, presence is the quality that describes a heart-filled state of mindfulness, an experience of being conscious in the present moment. It is only in this present moment, Sufi teachings reveal, that we can connect with the Divine, and the Divine can live through us. Kabir Helminski is one of the world's most recognized teachers of Sufism. Named one of the \"500 Most Influential Muslims\" in the world by Georgetown University and the Royal Strategic Studies Center, Helminski and his teachings are touchstones for the growth in interest in Sufism, and his books have been translated around the world. In Living Presence, Helminski lays out the basic principles of Sufism, and how these ideas can lead to the experience of presence. In this inspiring work, readers will learn how to cultivate presence in their lives through: * Finding a balance between the outer stimuli of the world and our inner reactions to them * Harnessing faithfulness and gracefulness * Learning about the parallels between ancient spiritual wisdom and modern psychological knowledge * Meditation and contemplation to discover more meaning in daily life With unique clarity, this book describes how presence can be developed to vastly improve our lives. Drawing on the work of the beloved Sufi poet, Rumi, as well as traditional material and personal experience, this book integrates the ancient wisdom of Sufism with the needs of contemporary life. Completely revised and updated for its 25th anniversary, this edition of Living Presence offers a wisdom that is both universal and practical.",
        "authors": "['Kabir Edmund Helminski']",
        "infoLink": "http://books.google.com/books?id=ndrEDgAAQBAJ&dq=Living+Presence&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an excellent book for someone seeking information about Sufism, about spiritual practice, or simply about how to live as a fully present spiritual being in our world. The chapters are short, digestible chunks in clearly written language, and include excerpts from Jelalludin Rumi's extradordinary poetry, as well as Helminski's wisdom garnered from more than two decades of Sufi study, practice, and leadership. This book balances the practical and the beautiful, and shows the sacredness inherent in human life. Someone who is remembering his or her connection to God, or wants to know how to remember that remembrance, will find &quot;Living Presence&quot; both useful and a joy to read. I highly recommend this book for anyone, both absolute beginners and those further along the path. A definite thumbs up!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "Kabir does a good job in presenting some of the basic information on Sufi mindfulness. However, if you have spent any time becoming familiar with other contemplative traditions (Buddhism) or practices (meditation) then this book will not have that much to offer. Much of what the author says are common themes in other approaches besides Sufism. Other Sufi authors such as Hazrat Inayat Khan or Llewellyn Vaughan-Lee may be better reads to get a deeper understanding of the perspectives unique to Sufism.",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book deals with more than Sufism per se. It is an distillation of ancient spiritual psychologies as applied to todays world and needs. Helminski draws deeply from the Gurdjieff 4th Way traditon, Zen and Sufism. But mostly the 4th Way - if you've read In Search of the Miraculous, Views from the Real World you'll see the parallels.The insights into the human condition and what needs to be done about it are excellent and is a very good primer into spiritual psychologies. They apply across religous boundries and would be of great use to anyone who is contemplating pursuing an spiritual path. Especially the western religious traditons were the concept of an spiritual psychology is all but lost or not understood.The reason I did not give it 5 stars is that it is an primer and not an how to book. Though any decent book on Vipassana style meditation will help here - which really forms the foundation for what Helminski is talking about in the book.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "the book leads the reader from the apparent ,which we all call and understand as real to that understanding which is indeed real and the very essence of life on this earth. a must for any one seeking a true understanding of LIFE",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "There are different things you can do with your time and different things you can read that would help you in some way. After reading a few chapters of this book you would become closer to reality and start to understand true worth and meaning of ... everything INVOLUNTARILY.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Helminski presents the Sufi path in a clear concise and most helpful way. I am a contemplative Christian and found this book to be consistent with all the teachings of Christ, and of the Apostles. Christianity has been westernized--and this book reminds me that indeed it was and is a belief system with definite Middle Eastern roots. Helminski is a devout follower of Rumi and the joy, focus and essential teachings of Mohamed, and of Jesus Christ are given respect and credit. Sufism is transcendent and encompasses so many other paths. This book is awakening and enlightment. Read it, re-read it and read it again.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "All traditional teachings have their own peculiarities that derive from the times they were born; this often makes the reading of original texts a difficult task, sometimes boring. Helminski writes in the language of our time; his book is a masterpiece of 'seeing Sufism in perspective' and being able to express it in written form. Living Presence gives a wide and realistic view of spirituality.Gurdjieff influence is strong: those familiar with him will find the book a good summary of his teaching; there is no better one written with the eyes of Sufism. When we approch Unity the differences disappear and the Ways look very similar!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the key to theosophy",
        "description": "Written in the form of question and answer, The Key to Theosophy is an excellent introduction for the inquirer. After the publication of Isis Unveiled and The Secret Doctrine, the author was deluged with questions about the human constitution, spiritual and psychological; the mysteries of periodic rebirths; and the difference between fate, destiny, free will, and karma. These and many other questions on the basic theosophical concepts are answered simply and directly. The work is enhanced by a 60-page glossary of philosophical terms drawn from Sanskrit, Hebrew, and classical literature.",
        "authors": "['Helena Petrovna Blavatsky']",
        "infoLink": "http://books.google.com/books?id=K7NIzQEACAAJ&dq=The+key+to+theosophy&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "'The Key to Theosophy' is a classic of Theosophical mysticism and esoteric doctrine. This book is a must-have for anyone seriously interested in philosophy or religion.The name &quot;Theosophy&quot; is derived from the ancient Greek for &quot;Divine Wisdom,&quot; and is used by the Theosophical Society (founded 1875) to describe a synthesis of philosophy, ancient spiritual mysticism and modern science.But be aware that Theosophical works such as 'The Key to Theosophy' present a rather controversial view of the universe, and the reader should be prepared for a long process of in-depth study and consideration of ideas that do not follow the normal mainstream of traditional dogma.The unorthodox philosophy contained in 'The Key to Theosophy' has been abused by such infamous figures as Adolf Hitler and others. But great personalities such as Alexander Graham Bell, Henry Ford, Thomas Edison, Albert Einstein, and Mahatma (Mohandas) Ghandi have also been associated with Theosophical studies. This work is a classic among intellectuals of the 19th and 20th centuries.'The Key to Theosophy' describes the Universe in terms of Pantheism (which refers to the intimate connection between Divinity and Nature, not &quot;multiple gods&quot; as is commonly misunderstood), and in this way, explains in logical terms a common set of fundamental principles behind many of the religions of the world. Theosophy shows the relationship of the Inner Essence of the soul of mankind to the Divine Source, and makes clear the &quot;how&quot; and &quot;why&quot; behind the Golden Rule and all the moral teachings of the various religions.In light of the Theosophical explanations, traditional morals, ethics, and spirituality become more than a set of arbitrary dogmatic rules. For those who look closely, even such fundamental Christian principles as salvation and sacrifice become clear.In addition to 'The Key to Theosophy,' other works of Helena Blavatsky, as well as William Q Judge, Annie Bessant, and Charles Ledbeater provide insight into this fascinating area of philosophy.I would particularly recommend 'Man, Visible and Invisible,' 'Isis Unveiled,' 'Thought Forms,' 'The Hidden Side of Things,' and 'Golden Precepts.'",
                "review/helpfulness": "102/104",
                "num_reviews": 104
            },
            {
                "review/text": "Almost all expositions of Tibetan Buddhism that are current in the west, logical studies of mahdyamika, ethical studies of prajanaparamita, mantra and tankha practice from the Tantric or Varjayana presume upon an intimate knowledge of the arguments, psychology and metaphysics of a Buddhism as described in this work. Even Madame Blavatksy wrote in Key to Theosophy, a popular introduction to the context of her theosophy embodied in her magnum opus The Secret Doctrine, recommended that the Buddhism of Tsong-kha-pa would be an explanation to her own occultism. It took many years before any attempt was made to summarize or introduce even parts of this work. Not because the text was scarce but that the technical command of Tibetan scholastic language, logic, hermeneutics, and exegeses of Buddhist scripture were needed to approach this powerful work. The Great Treatise on the Stages of the Path of Enlightenment is the first of a series of three projected volumes. In this first volume the reader is brought into basic Buddhist teachings as characterized in a Buddhist monastic setting, for people of little or middling capacity in religion to cultivate the awakening of Bodhichitta. The work is being expedited by a committee of exceptional Buddhist scholars and is being translated in a straightforward manner without commentary or cumbersome notes.",
                "review/helpfulness": "20/30",
                "num_reviews": 30
            },
            {
                "review/text": "Exhaustive, penetrating, and wholly satisfying, you will refer to this tome for years to come. The A to Z glossary alone has proved invaluable to me as I struggle to understand concepts far weightier than I ever imagined existed!",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book is an excellent introduction to the views of Theosophy, which in many respects is not a religion or a philsophy; it is a helpful guide to distinguish and compare theosophy both to the world religions as they are practiced and the \"secret wisdom\" that is also found in all world religions. As another reviewer remarked, the Glossary is a very helpful set of definitions for learning further about the theosophical perspective.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "If one is at all interested in Theosophy(literally \"god-wisdom\" or \"divine wisdom\") and Helena Petrovna Blavatsky, you NEED three books - \"Isis Unveiled\", \"The Secret Doctrine\", and \"The Key to Theosophy\"... forget the nonsense about Mdme. Blavatsky being a proto-Nazi or a fraud, that's complete hogwash.We have been lied to all our lives - about history, about religion, etc... there is no religion higher than TRUTH.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "deliberate acts of kindness service as a spiritual practice",
        "description": "An indispensable guide to the spiritual and the practical aspects of devoting one's time and energies to the service of others. Deliberate Acts of Kindness is for people who are ready to supplement\"random acts of kindness\" with intentional acts of generosity, decency, and integrity. More than simply a handbook for volunteers, it explores the significance of service as an expression of spirituality and the commitment to something greater than oneself. Meredith Gould guides readers through their journeys, from recognizing when they are ready to answer the call to service to finding the right place to donate their time and talents. She offers invaluable advice on discovering the types of work that best suit their personalities and the areas in which they can make the greatest contributions. There is helpful information on how to get involved, as well as sensible suggestions about what to do when things go wrong in a service situation. An easy-to-read mix of tips, quotations, reflections, and short narrative passages, Deliberate Acts of Kindness presents a comprehensive, honest look at what service is like on a day-to-day basis. Its insights will help new volunteers and veterans alike negotiate the practical difficulties that sometimes arise and achieve the spiritual maturity that comes from answering the call to service. From the Trade Paperback edition.",
        "authors": "['Meredith Gould']",
        "infoLink": "http://books.google.com/books?id=UsmuoE1rmtYC&dq=Deliberate+Acts+of+Kindness:+Service+as+a+Spiritual+Practice&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "WONDERFUL!! The world needs this now more than ever! Good stuff about boundaries, and levels of service, and how it figures in religious traditions, as well as how to figure out whether the alleged call is of the heart or of the mind.Reading this has helped me sort out intriguing doubts and questions I've been having about some of the service I've seemed called to lately. I got both clarity and affirmation from this wise guidance that I'll not only use myself, but to help coach clients.What's more, the material is beautifully organized, and expressed with the delightful, tongue-in-cheek irreverent and eminently readable wisdom that is Gould's trademark as a writer.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "From the tzedakah of Judaism to St. Benedict to Buddhism's dana and Hinduism's seva, Meredith Gould highlights the significance of good works in all spiritual/religious traditions.This is a very nifty--and practical--book! She holds our hands as she guides us along the journey of doing good--the upside and what she calls the &quot;shadow side of service.&quot; She teaches us when and how to say yes or no, how to manage volunteer assigments, and even &lt;gasp&gt; how to recognize burnout and what to do about it.She writes with great and gentle humor, warning newcomers to community work of booby traps they may trip over while on the path to kindness and self-fulfillment.This is a tips book for people who seek to aid their communities in any way they can and for people, already active volunteers, who wish to probe further into what they and their organizations can accomplish.What a treasure.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the tao of daily living",
        "description": "The perfect book for readers who are interested in Taoism and want a little daily inspiration. The Tao of Daily Life combines ancient Eastern wisdom with practical application-perfect for busy Western readers! Derek Lin, Taoist master and expert in Eastern philosophy, brings his deep knowledge of this time-honored Chinese spiritual thought system into the twenty-first century. \"There is one simple reason for the Tao to have survived through the ages intact: it works,\" writes Lin. \"The principles of the Tao are extremely effective when applied to life. The philosophy as a whole is nothing less than a practical, useful guide to living life in a way that is smooth, peaceful, and full of energy.\" Using the powerful medium of stories and short dharma talks, Lin illuminates the Taoist secrets and engages the reader in their inherent wisdom. As a result, the reader of The Tao of Daily Life will notice certain changes, including: - being more composed and more at ease in various situations; - being able to handle challenges and difficulties with less effort and achieving better results; - experiencing greater power and clarity in all areas of life. The spiritual journey, as described by Derek Lin, becomes the most worthwhile exploration anyone can take.",
        "authors": "['Derek Lin']",
        "infoLink": "http://books.google.com/books?id=9LuteqpbDScC&dq=The+Tao+of+Daily+Living&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I watched the &quot;birthing&quot; of this book, written and illustrated by my teacher and friend John Heider, and knew then that this would be a treasure. Like a newborn, it is full of awareness, touch, wisdom, and a sense of wonder. It, too, will enhance and enrich your life, in ways large and small. As a therapist, I've already given away five copies to clients, who come back and say, &quot;Wow!&quot; Wherever you are on your journey, you'll love &quot;The Tao of Daily Living&quot; for its simplicity and its wisdom.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Imagine my surprise and delight to find another book by Heider, just as wonderful as his Tao of Leadership. The work provides application of Taoist principles to real world, daily experiences. Love the artwork, love the concepts.Thanks for a new view, Heider!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "John Heider's 'Tao of Daily Living', like his 'Tao of Leadership', offers a simple and spendid 'guide to living' that is unsurpassed. TODL, in particular, integrates many spiritual 'truths' and tools into a delightfully simple 'how to' format. I gave 20 of these out as holiday gifts two years ago and continue to share it with others.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "meditation",
        "description": "Introduces a series of practical, step-by-step guides to ancient and modern techniques of meditation, from Buddhist and Sufi practices to Osho's own Dynamic Meditation and Mystic Rose Meditation, along with suggestions to help readers select the techniques that are most appropriate to personal lifestyles. Reprint. 25,000 first printing.",
        "authors": "['Osho']",
        "infoLink": "http://books.google.com/books?id=lDCwX3UpZBAC&dq=Meditation&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Ramakrishna Order is an worldwide organization of monks started by the disciples of Sri Ramakrishna, one of the brightest stars that rose in the Indian Spiritual horizon during the end of the 19th century. This Order is known for its rational and catholic approach to religion. The monks of the Order are one of the most authentic sources of information and inspiration on Religion, Meditation and Spiritual life. This book gives a good account of the theory and practice of Meditation. The book contains several inspiring and thought provoking articles which will set the person in the proper perspective, mood and understanding to move towards higher goals through Meditation.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "It was exactly what I was searching for, a way to meditate on scripture. It gives good points on how to do that plus very helpful things to help you spiritually each day.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "wisdom of the ancients",
        "description": "THE PERFECT READ FOR TROUBLED TIMES From the bestselling author of The Story of the British Isles in 100 Places comes this inspiring and beautifully written meditation on the wisdom inherited from our ancestors. For all we have gained in the modern world, simple peace of mind is hard to find. In a time that is increasingly fraught with complexity and conflict, we are told that our wellbeing relies on remaining as present as possible. But what if the key to being present lies in the past? In Wisdom of the Ancients, Neil Oliver takes us back in time, to grab hold of the ideas buried in forgotten cultures and early civilizations. From Laetoli footprints in Tanzania to Keralan rituals, stone circles and cave paintings, Oliver takes us on a global journey through antiquity. A master storyteller, drawing on immense knowledge of our ancient past, he distils this wisdom into twelve messages that have endured the test of time, and invites us to consider how these might apply to our lives today. The result is powerful and inspirational, moving and profound.",
        "authors": "['Neil Oliver']",
        "infoLink": "https://play.google.com/store/books/details?id=0xjFDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "The Cave of the Ancients reveals for many in the west the ancient secrets of Tibet. A Very powerful story of a very humble servant to the world and the travels and tribulations of a strong people. A must read for every thinking individual.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book describes archeological findings in Tibet found in ancient caves. Many objects are said to be found nowhere else. The history of Earth and Humanity is revealed to be very different from what is known. Tibet lovers must read Rampa's books.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I found this book to be very insightful although I am not an expert on Tibetan religion or philosophy. It is an enjoyable read and rather thought provoking in areas. What if????? Cave of the Ancients is a story about one man's journey, not a complete guide to the Tibetan way. I recommend reading it and deciding for yourself. Analyzing a book completely destroys the context. A book is to be read, absorbed and then digested. Everyone's interpretation is different.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The book was in Okay condition.This is a must read book.This is a journey with Lobsang through his education in the Tibetan monasteries.I actually visited the monasteries after reading so, I could really relate lot of things.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I read Lobsangs books in my late 20's and remembered them well I thought. Now in my late 50's I am reading them again and feel like it's all new. I have found his words to be validating and comforting as well as very interesting. He has indeed had a very tough life but what he says is no complaint just wisdom. If your looking for a different point of view and a different look at the history of the 20th century this is his 2nt book in a great series. I absolutly reccomend it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "essential spirituality",
        "description": "\"Essential Spirituality beautifully articulates the benefits of spiritual living in the material world.\"-Dan Millman, author, Everyday Enlightenment and The Way of the Peaceful Warrior\"Deceptively simple. Its power is rooted not only in Dr. Walsh's formidable intellectual capacity to deal effectively with a vast body of religious literature but in his own deep spiritual practices in a multitude of disciplines over many years. An important contribution.\"-Ram Dass, author, Be Here Now \"An absolute masterpiece . . . Essential Spirituality is helpful to both the unseasoned and seasoned seeker. The writing is deep, simple, and clear yet at the same time poetic and musical. A must read.\"-GERALD G. JAMPOLSKY, M.D. author, Love Is Letting Go of Fear \"Energetic, engaged, and occasionally electrifying. . . . The field of spiritual books has been looking for its own Lewis Thomas or Carl Sagan, and I believe Roger Walsh may be that one.\"-KEN WILBeR, author, One Taste and A Brief History of Everything Based on over twenty years of research and spiritual practice, this is a groundbreaking and life-changing book. In his decades of study, Dr. Roger Walsh has discovered that each of the great spiritual traditions has both a common goal and seven common practices to reach that goal: recognizing the sacred and divine that exist both within and around us. Filled with stories, exercises, meditations, myths, prayers, and practical advice, Essential Spirituality shows how you can integrate these seven principles into one truly rewarding way of life in which kindness, love, joy, peace, vision, wisdom, and generosity become an ever-growing part of everything you do.",
        "authors": "['Roger Walsh']",
        "infoLink": "http://books.google.com/books?id=LzKDxQbthS4C&dq=Essential+Spirituality&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Go into any bookstore and you'll find piles of books on spirituality, featuring spiritual paths ranging from Evangelical Christianity and pseudo-Vedantist guru worship to Americanized Zen and reconstructionist Neo-Pagan goddess worship. With people turning away from the churches they were raised in and world-weary atheists searching for spirituality, the spiritual marketplace is going through a boom period with no end in sight. But in the midst of such selection, how can one tell who's faking it, and who's the real deal? Is the teacher or author a committed seeker or a devious charlatan? Modern, sceptical Americans often avoid spirituality all together due to horror stories of silly cults and gurus perpetrating spiritual scams on the unsuspecting public. Who can we trust?How about an Australian philosopher-psychiatrist with years of experience dealing with spirituality, transpersonal psychology, and mental illness? Roger Walsh makes no claims to have attained a spurious level of \"enlightenment\" beyond a measure of basic sanity in this world gone slightly mad. In \"Essential Spirituality\", Walsh provides the perfect companion to Huxley's classic \"The Perennial Philosophy\"- a book of practical spiritual exercises, advice, and wisdom from sages the world over. Divided into seven sections on what Walsh believes to be the seven essential practices of the world's \"Wisdom Traditions\", Walsh provides advice on reducing craving, cultivating emotional wisdom, living ethically, meditating, awakening the senses, growing intuition, and pursuing spiritual action. This isn't New Age mysticism- \"Essential Spirituality\" is grounded in the teachings of saints throughout the world and history, extensively documented by Dr. Walsh. Even the most sceptical mind can see the gentle wisdom in his approach to spirituality.I give this book my highest recommendation to seekers of all faiths and none- may it help you on your way.",
                "review/helpfulness": "99/101",
                "num_reviews": 101
            },
            {
                "review/text": "This is a terrific book-perfect for beginners as well as psychologists and psychotherapists who wish to introduce meditation to their clients. Walsh has been at this for nearly 30 years, and it shows in his elegantly simple rendering of cross-cultural spiritual practices. A wonderful companion to Huxley's &quot;Perennial Philosophy&quot; and Harvey's &quot;Essential Mystics.&quot; Those books leave out the &quot;how&quot; of practice. Walsh fills in the details.",
                "review/helpfulness": "72/75",
                "num_reviews": 75
            },
            {
                "review/text": "This small book contains gems from Buddhism, Taoism, Catholicism, Judaism, Islam, Hinduism, and Confucianism. Not merely a compilation of sound bites, the author explores core practices revered by these major world religions. Most importantly, he provides concrete examples of how to incorporate these practices, little by little, into everyday life, until a new, throughly unique fabric is created by the reader's personal choices.The individual chapters address craving, difficult emotions, ethics, calming the mind, vision, wisdom, and serving others. Each section contains a number of exercises that you can try, modify, or adopt completely as best suits your own life and outlook. As time goes on, the practices can serve as springboards to discovering new sources of inner guidance.The discussion of various intersections of the religions is valuable for several reasons. The background provides specific reasons for engaging in spiritual practice. Rote repetition of formulas does not have the value of mindful attention to our actions, and these explanations help to put the practices in perspective. In addition, the discussion often reflects the gut-level experience of the seeker, and will likely resonate strongly with those on a spiritual journey. Also, the practices do not conflict with observance of any of these religions, and would instead enrich one's spiritual experience, irrespective of its formal context. Finally, the discussion of common ground is a beautiful example of how we can rejoice in our similarities, respect our differences, and share common goals for peace, rather than allow religion to divide us and breed hatred.As the introduction by His Holiness the Dalai Lama states, a few minutes a day devoted to engaging in the practices and contemplating their significance will go a long way towards bringing compassion, and ultimately a sense of inner peace, into your everyday life.",
                "review/helpfulness": "59/60",
                "num_reviews": 60
            },
            {
                "review/text": "This book, more than any other I have ever read, integrates the spiritual practices of the world's religions into a workable framework for the secular person. Walsh's methods not only bring the various religions together in a theologically interesting way, he shows us that living life to the full is a spiritual issue that all faiths seek. Their timeless wisdom and practical living are desperately needed in a world that moves away from wisdom and embraces an ethical vaccuum.",
                "review/helpfulness": "46/47",
                "num_reviews": 47
            },
            {
                "review/text": "We moderns have a difficult life. We are aware of suffering on a global scale as well as struggling with our personal suffering. We have been able to alleviate some of it with our science and technology and in other ways we have made it worse. The materialistic philosophy of modern times undercuts our spiritual hopes, but we are spiritual beings and we must find a way to live that gives us deeper meaning than nihilism or consumerism. So many of us have turned to ancient traditions, like Buddhism, and found various degrees of satisfaction, but the ancient traditions often seem too simple for the complexity of modern times - and we can't really turn our backs on the fact that we are moderns, steeped in a scientific view of the world, which has much truth in it.Wouldn't it be helpful to have some guidance from someone who is both a scientist and a spiritual practitioner, who has managed to integrate both approaches to reality? Roger Walsh's Essential Spirituality is such help.I was fortunate to see this book in manuscript form when the publisher asked me for a promotional quote. I was very rushed at the time and could only read through the manuscript lightly, but knowing the quality and depth of Walsh's work, I was able to enthusiastically say \"I could not imagine a better person to write this book.\" I knew he was not only a first class scholar and writer in these areas, but indeed someone with a serious personal practice informing his writing. Rereading the book more thoroughly for this review has been a pleasure and a privilege, for the clarity, depth, and importance of it is very great indeed.I should also take this as a lesson about the hurry in my life and what it costs me. Allowing oneself to be carried away by the rush of life is, as Walsh points out in Essential Spirituality, very costly:\"You need to have a routine of some kind with sacred time carefully set aside. Otherwise the world's distractions and demands will consume every open moment and leave you astounded to find that yet another day, month, year, or even decade has disappeared into oblivion with only a few scattered moments devoted to spiritual practice.\"This is an example of the clarity and practicality of the advice Walsh gives. Essential Spirituality is a complete introduction to the spiritual pathand an essential refresher for those of us who think we already know something about it!Walsh has isolated a common core of seven practices or directions of development. He not only explains them, but gives practical exercises for realizing them. The seven are:-Transform your motivation: reduce craving and find your soul's desire.-Cultivate emotional wisdom: heal your heart and learn to love.-Live ethically: feel good by doing good.-Concentrate and calm your mind.-Awaken your spiritual vision: see clearly and recognize the sacred in all things.-Cultivate spiritual intelligence: develop wisdom and understand life.-Express spirit in action: embrace generosity and the joy of service.It is hard to know what is best to quote to illustrate the practicality (and compassion) in the book, there is so much of excellence, so I will first quote the beginning of the first chapter on how to use the book:\"Each practice, exercise, and idea in this book is applicable to life and helpful in transforming it. Test them for yourself. This book allows you to do just that.\"\"These practices require no specific religious belief, nor do they require giving up any specific religious belief. This book is much more concerned with learning and living than with believing. All that is necessary is an open mind and a willingness to experiment. The crucial question is whether the practices are helpful to you.\"\"This is not to imply that spiritual practice is easy . It takes courage to examine yourself and your life carefully. It takes effort to do the exercises regularly and commitment to keep doing them during difficult times. Fortunately, the more you practice, the more these essential qualities grow. Above all, be patient. Transforming yourself and your life is a gradual process.\"Throughout the book Walsh emphasizes experimenting with the various practices, recognizing your own natural rhythms, finding what works best for you, and being kind to yourself. The sections on work with negative emotions are particularly valuable, for we often tend to have harsh superegos and so are counterproductively hard on ourselves.When I was younger, I used to think that spirituality was mainly about special states of mystical revelation. Now, while not devaluing those, I think that compassion and kindness toward others are what it's really all about, so I'm pleased that Walsh gives so much attention to these qualities. Near the end of Essential Spirituality he wisely reminds us that:\"The power of practice depends in part on why it is done. This is why practicing for the well-being and awakening of everyone, including ourselves, is more potent than practicing for ourselves alone. To focus solely on our own well-being is to separate ourselves from others and to starve beneficial qualities such as love and generosity.\"\"To practice for the benefit of all people-even all creatures- is to expand our circle of care and to cultivate emotions such as love and kindness. Over time it becomes increasingly obvious that the happiness of others is our own and that to practice for the benefit of all is not a sacrifice but rather a delight. Our spiritual work not only helps us but is, according to Ramana Maharshi, \"the best help you can possibly render to others.\" Our task is simply to do our practice as fully as we can. In this way we gradually learn to awaken ourselves, to love and serve life in all its infinite forms, to see the sacred in all things, and to care for our troubled world.\"A real contribution!",
                "review/helpfulness": "33/35",
                "num_reviews": 35
            },
            {
                "review/text": "For your quick reference, the seven practices to awaken heart and mind (stated in the front cover) as summarized by the author in pg 14 are as follows:-1. Transform your motivation; reduce craving and find your soul's desire.2. Cultivate emotional wisdom: heal your heart and learn to love.3. Live ethically: feel good by doing good.4. Concentrate and calm your mind.5. Awaken your spiritual vision: see clearly and recognise the sacred in all things6. Cultivate spiritual intelligence: develop wisdom and understand life.7. Express spirit in action: embrace generosity and the joy of service.If the above are what you want, buy it. I assure you that the author did write a very sophisticated but easy reading book which can satisfy you well, with his excellent writing skill and intelligent choice of wise sayings from various religions. Below please find some copy and paste for your reference:-It is in the silence of the heart that God speaks.- Mother TeresaAny natural act, if hallowed, leads to God.- Jewish teachingThere is pleasure.There is bliss.Forgo the first to possess the second.- BuddhaNo drives, no compulsionsNo needs, no attractions;Then your affairsare under control.You are a free person.- Chuang Tzu, Taoist sage",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Walsh takes the universal wisdoms from our major world religions and miraculously compacts them into one mere 285 page book. Combining the common beliefs and practices of all the major religions allows for anyone with an open mind to discover important practices and philosophies for spiritual development. The exercises are simple and benevolent. He quotes and demonstrates with stories, the teachings of Jesus, Mohammad, Confusius, and Buddha. Possibly the easiest to understand and practice of any of the spiritual or religious books I have read.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "If you only read one book on spirituality in your whole life, perhaps it should be this one. Roger Walsh is one of the greatest western writers in the spiritual traditions. His stories, his messages, and his ability to write in a way that most everyone can relate to are second to none. In this book, he provides practical advice on what to do to lead a more spiritual life. These ideas are extrapolated from the practices of various sages from a variety of spiritual traditions around the world. If you are ready to explore the spiritual side of yourself in depth, this is a great book to read. If you are interested in the psychology aspect of spirituality but not so much in spirituality itself or if your want more reading on how psychology is related to spiritual growth, may I suggest the excellent book called \"The Ever-Transcending Spirit\" by Toru Sato. Both books are extremely insightful and not written in a pretentious \"I will teach you how to become enlightened\" kind of way. In fact, the more enlightened we become, the less we teach, the less we preach, and the more appreciative we become of the process of growth both in ourselves and in others. Both authors claim that they are just regular individuals like you and me seeking glimpses of enlightenment and trying to understand what it all means. In any case, they still seem to know much more than me so I am happy that they have decided to share what they know by writing these books. These books are highly recommended.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is an important psychology book. It is an Aristotelian categorization of psychotherapy sayings of Buddhism, psychotherapy, Christianity, Hinduism, Confucianism, and Taoism, with a strong leaning toward Buddhism.And, this is the best foundation book I've read that can use our heritage of religious mental healing knowledge to build a new religion, ethics, and psychotherapy. Because Walsh so expertly defines the psychotherapy terms used in religions, another writer can use these terms as a building block for new religious-psychotherapy ethics.It is so difficult to wade through the mountains of pages of these various religions, with their esoteric metaphysics and ancient practices, to extract the elements of psychotherapy. The author has done this, and presents a cataloguing of the various practices. He, for the most part, accurately ties in the sayings from these many religions to show that they are all describing the same principles.For example, \"The Kingdom of heaven is within you\" (Christianity), \"Atman and Brahman are One\" (Hinduism), \"In the depths of the soul, one sees the Divine, the One\" (Chinese Book of Changes\"), \"Those who know themselves, know their Lord\" (Islam), etc.; all these are pointing at the same concept, as Walsh expertly points out.From here, Mr. Walsh lays out a method for improving oneself, in psychotherapy and \"spiritual\" terms. The method is Buddhist, but Mr. Walsh points out that the other religions also have components of this methodology.One of the few matters not described in this book is the meaning of feelings and how these are suppressed. Without defining this and knowing what it is, it still remains somewhat haphazard to apply time-tested techniques to cure psychological illnesses. Perhaps Walsh will write (or has already written) another book on this topic.Overall, this is a timely, important book that sets the foundations that others, I hope, will follow, to create a modern psychology and religion. As Nietzsche points out, the overman shall set his own ethics. Walsh is providing the dictionary for the overman.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I stumbled on to this book at the Library and started reading it. Before I finished this book I went on line and ordered a copies for myself and my friends.I have read many books that could be summed up in a paragraph. In this book, every paragraph is a book in itself full of reflection and wonderful thought.Ton's of information to go back through at least a second time if not more to write down and remind yourself daily of the important things in life.Dr. Walsh made me feel good in my own skin and I felt like he was talking to me.He really hit's the nail on the head about Attachments and False Goals of Happiness. It is really clear how Western Society is full of meanless and soul-less existence. We tend to look down on 3rd world nations as being behind in the times but Dr. Walsh shows how they have had some of the answers to happiness all along.I will keep this book with me forever.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "immortality and reincarnation wisdom from the forbidden journey",
        "description": "Famed traveler and mystic Alexandra David-Neel, the first Western woman to see the forbidden city of Lhasa, Tibet, examines Eastern concepts of the afterlife in this classic study. The question of what occurs to the individual personality after death is fundamental to the human experience. In Immortality and Reincarnation Alexandra David-Neel, the first Western woman to see the forbidden city of Lhasa, Tibet, examines Taoist, Tibetan, and Hindu concepts concerning life after death. Contrary to Western belief, which sees the human being as composed of a mortal body and an immortal soul, many Easterners believe in the immortality of both the body and the soul. Alexandra David-Neel gained firsthand knowledge of these beliefs and the practices they engendered in the course of her travels at the beginning of this century. In Immortality and Reincarnation she ties them together for a unique look at reincarnation and eternal life in a region untouched by the modern world.",
        "authors": "['Alexandra David-Neel']",
        "infoLink": "https://play.google.com/store/books/details?id=YF8oDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Important insight into various interpretations of what it means to be immortal,covering Tibetan and Indian beliefs. Alexandra David-Neel seems, to me, to be not only scholarly but also truly spiritual in her approach to this question of what it means to be re-incarnated. The work is intended for serious seekers. It is inspiring, and provocative. It does not set out with any agenda other than to give Westerners a glimpse into the mind of the oriental. It gives no comfort or answers. This , to me, represents its greatest value.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "The author is at her best when she recounts the adventures, both mundane and spiritual, that she encountered during her amazing life and travels. When she expounds on spiritual teachings and doctrines, she is not so skillful.Given the brevity of the book, one can hardly expect a complete and systematic exposition of the views on the topic of immortality and reincarnation found in China, Tibet and India. Still, the work is so idiosyncratic and choppy that it will be of limited value for anyone seeking an introduction and overview of the teachings and insights offered by these diverse cultures. That is unfortunate, such a work is much needed.Yet, with these limitation in mind, this work does offer some value for the discerning reader.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "the jade emperors mind seal classic the taoist guide to health longevity and immortality",
        "description": "The first English translation with commentary of three classic Taoist texts on immortality -> Translates The Jade Emperor's Mind Seal Classic, The Immortals, and The Three Treasures of Immortality -> Defines the Taoist concept of immortality and examines the lives and practices of Taoists who achieved this state -> Reveals the steps needed to achieve immortality in our modern society Taoist mystics claim that it is possible to achieve immortality: \"Within each of us dwells the medicine to cure the affliction of mortality.\" Now Western readers can access the wisdom of Taoist masters on the subject of immortality through the first English translations of three classic Taoist treatises: The Jade Emperor's Mind Seal Classic; The Immortals, from the Pao P'u Tzu by Ko Hung of the Sung Dynasty; and The Three Treasures of Immortality, from the Dragon Gate Sect. The Jade Emperor's Mind Seal Classic teaches that one can attain immortality through the cultivation of the three treasures of Taoism: ching (sexual and physical energy), qi (breath and vital energy), and shen (spirit and mental energy). Chinese history is sprinkled with accounts of individuals who applied the lessons of the Jade Emperor and lived up to 200 years. Drawing on his extensive knowledge of Taoism, martial arts, and Chinese history and culture, Stuart Alve Olson accompanies his translations with informative commentary that explains the historical context of the texts as well as demonstrates the practical applications of their teachings in contemporary life.",
        "authors": "['Stuart Alve Olson']",
        "infoLink": "https://play.google.com/store/books/details?id=O1soDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This is a wonderful book written by an author with both a scholar's understanding of the origins these Taoists classics and a practitioner's insight that these are living growing Taos (paths), not meant to be slavishly copied. I especially applaud his recognition that practicing Taoist techniques with a motivational mindset from Mahayana Buddhism called Bodhichitta, results in a \"warmer\" type of personal growth then traditional Taoism. Historically, the highest attainments of Taoism were expressed by wild, solitary Taoist hermits with little interest in teaching or passing on their knowledge. Their writings were often intentionally obscure with personal instruction clarifying them nearly unobtainable. Buddhist adepts on the other hand with their commitment to help all sentient beings concentrated on developing clear and obtainable sutra teachings.Most of the presently available modern Taoists texts come from those sects that combined teachings and philosophies from China's three treasures, Taoism, Ch'an Buddhism and Confucianism, such as the Complete Reality School. I think that Stuart Olson can be seen to be a continuation of these principles; namely that times, places, and conditions change, Taoist practices and teachings do as well, or they are not true Taoism.You will find in this text the root instructions to begin or deepen a Taoist practice. The criticism that this is not practice manual doesn't follow because there are no practice manuals for Taoism, and there couldn't be. In the many paths of Taoism the practices of ritual, poetry, herbology or martial arts are as important as philosophical study. A Taoist Sage/Adept many practice all of these or none of them... Enjoy this text as if it is advice from a Taoist friend.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "A very handy little book covering the base concepts of taoist longevety. Not a total guide so much as an introduction to the various methods. Along with the translated classics the authors personal stories are fun and interesting. Some parts the authors background in Buhddism shows but its hardly intrusive.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Olson's book was not what I hoped - probably, it never meant to be. On the positive side, I found the modern translation of eastern classics that I was looking for. That includes many passages from Ko Hung, a Taoist writer of the fourth century CE, the brief list or alchemical directives from the Jade Emperor, and the \"Three Treasures\" by T'ien Hsin Chien. All three read smoothly in modern English, and I'm sure that Olson's scholarship and fluency add much that another translator might not have captured.Olson adds explanatory notes of his own, as so many translators do. Those notes can be especially helpful with especially obscure and esoteric works like these. The original texts often intended to block their meaning from the non-initiate, so the modern, western reader will surely need help in approaching this material, and Olson provides that help.My problem with this text is that Olson goes far beyond explanation and into side-trips that damage his credibility. At one point, for example, he asserts that \"Normally water is just H-2-O, but it can range from H-1-O through H-18-O ...,\" somehow stabilized by \"... a strong magnetic pull on certain portions of the earth ...\" He seems to use the words magnetic and magic interchangeably, in this case, and somehow forgets to include references on the topic. Another passage describes a potion that lets fish swim happily in boiling oil. Metaphorical senses for these (and many other) statements elude me, and the literal senses of them simply undermine any good that the book might have offered.Readers interested in the esoteric content might derive benefit from the book that I can't. I just came for the classics in translation, though. I wanted to enjoy these translations, but Olson's accretions made that impossible for me.-- wiredweird",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "The translation of an ancient text and commentaries provided in this book bring forth some invaluable treasures for the attentive readers. Jade Emperor's \"Mind Sealing Classic\" is probably the most useful short manual of Taoist Alchemy I found after reading many, many books and pursuing the lineage Taoist teachings for years. Every sentence of this short text radiates the deep meaning, while the arrangement of the verses and the words within verses hide the precious internal structure. Olsen does a masterful work in its translation and commentary, opening the initial gate towards the pragmatic integration of the underlying wisdom.There was obviously a lot of work and heart invested into this book. I am always very grateful when author provides the Chinese original for the old scriptures, as this immensely helps the serious study. I also fully enjoyed the first-hand experiences that author shared with us. The old saying that an ounce of practice is worth the tone of the theory is especially critical in the study of the secrets that mankind has been attempted to solve for millennia. In this domain there are no deterministic or fit-all solutions and so any sincere attempt to reveal the complex mysteries provides a precious new perspective.It would be difficult to completely relate to all points some researcher would made, based on the own experience, or to fully agree with everything. For instance, I would argue against the author's point that Buddhism has higher moral aspirations than Taoism and would consider that their contribution to the world are just made in a different way and at the different stage of cultivation. However, there is no way for anybody to fully reflect deep and holistic, Pre-Heaven, Truths within the linear, Post-Heaven, timeline and terminology. As mentioned in Tao Te Ching, any term that can be named is not a part of the Eternal Truth. The reality is self-recursive and multi-faceted, rather than fully causal and it is the Intent, a devotion to the Way of Cultivation that counts.I salute to the author for the dedicated efforts and a contribution he made to bring some great treasures of Tao to us.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "early daoist scriptures daoist classics no 1",
        "description": "For centuries Daoism (Taoism) has played a central role in the development of Chinese thought and civilization, yet to this day only a few of its sacred texts have been translated into English. Now Stephen R. Bokenkamp introduces the reader to ancient scriptures never before published in the West, providing a systematic and easily accessible introduction to early Daoism (c. 2nd-6th C.E.). Representative works from each of the principal Daoist traditions comprise the basic structure of the book, with each chapter accompanied by an introduction that places the material within a historical and cultural context. Included are translations of the earliest Daoist commentary to Laozi's Daode jing (Tao Te Ching); historical documents relating the history of the early Daoist church; a petitioning ritual used to free believers from complaints brought against them by the dead; and two complete scriptures, one on individual meditation practice and another designed to rescue humanity from the terrors of hell through recitation of its powerful charms. In addition, Bokenkamp elucidates the connections Daoism holds with other schools of thought, particularly Confucianism and Buddhism. This book provides a much-needed introduction to Daoism for students of religion and is a welcome addition for scholars wishing to explore Daoist sacred literature. It serves as an overview to every aspect of early Daoist tradition and all the seminal practices which have helped shape the religion as it exists today.",
        "authors": "['Stephen R. Bokenkamp']",
        "infoLink": "https://play.google.com/store/books/details?id=qngJspoY3TMC&source=gbs_api",
        "review": [
            {
                "review/text": "I have sat through 2 lectures of Prof. Bokenkamp and found that his knowledge of Eastern thought has followed through in this book. Though not for a person looking for an introduction into Taoist thought, this book is informative in the fact that it has content I have not found in other books. Also, the book is written more for a western audience, which isnt necessarily bad, but Prof. Bokenkamp has taken some liberties with the English language that may have been better kept in Chinese context. For those with a background in Taoism, I recommend this book. Others might want to try the Tao Te Ching first to gain insight into what Taoism is about.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is a collection of Taoist canon books from the early Mao shan, Showing the Spiritualistic roots of the Taoist religion before it was sanitized by those who could not trance or perform as the founders did. It is easy to say and think that everyone is the same but some have improved themselves so much we say they are myths. History is a joy when you can see the ideas of the best minds that lived and the poetry of their lives expressed in these texts. I enjoyed the Purple texts especially as a map to the higher mind.To those of you who study the Source enjoy, I did.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "These scriptures were translated for scholars that study and teach Daoist history. I would say this isn't a book for the layman, or those regular consumers that want East Asian theory philosophy stuff.... Stephen Bokenkamp, Livia Kohn, Stephen Little are all university grade texts.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the unknown she eight faces of an emerging consciousness",
        "description": "Is there a mystical consciousness particularly natural to women? And if so, what role is it playing in the spiritual evolution of our world? To answer these questions, Hilary Hart traveled across the world meeting with contemporary mystics from a variety of traditions including Lakota Sioux, Sufism, Buddhism, and West-African shamanism. The revelations of feminine wisdom offered from these encounters are not conceptual teachings, but vivid examples of lived spirituality expressed sometimes through simple ways of being, sometimes through profound mystical experiences. Revolutionary and remarkably practical, The Unknown She offers a startling new look at women's unique mystical orientation and its place in the evolution of our universal consciousness. \"... for serious students of mystical traditions and women's spirituality, this challenging book offers rewards not found in more conventional works.\" -Publishers Weekly \"... a profound exploration of what may become the most important development in the 21st Century: the return of the feminine voice in spiritual experience.\" -Tsultrim Allione, author, Women of Wisdom A wonderful book! Here, the deep feminine speaks beautifully with inspiration and wisdom so terribly needed in our times.\" -Jack Kornfield, author, After the Ecstasy, the Laundry and founding teacher of Spirit Rock Meditation Center \"In this sensitive and beautifully crafted book, Hilary Hart has listened to the voice of a new, emergent, mystical consciousness in women and through her careful witnessing has offered it to us as a precious gift.\" Anne Baring, author, -The Myth of the Goddess",
        "authors": "['Hilary Hart']",
        "infoLink": "http://books.google.nl/books?id=vB8CCwAAQBAJ&dq=The+Unknown+She:+Eight+Faces+of+an+Emerging+Consciousness&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "What an awesome book! Author Hilary Hart offers intimate and really moving encounters with eight contemporary and mostly hidden mystics from different backgrounds, like Buddhism, and Sufism. It was amazing to read the ways so many different people can come to experience the divine.What sets this apart from so many spiritual books is it brings divinity down to earth wihtout losing the divinity!And finally, a spiritual writer who finds a way to be honest and real, herself. Not an ounce of pretension!!!",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "Something subtle and insistent is happening in the world and Hilary Hart in her impressionistic interview style captures its essence. To comprehend the book requires the reader to still the analytical mind and tap into the realm of the intuitive. Approach follows theme. Spiritual guides and teachers from a variety of traditions illuminate the sometimes vague,dark, powerful, tantilizing, and mysterious force that promise the return of something precious that has long been supressed.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This amazing book begins with the author exploring with seven women and one man what the feminine consciousness is, why it's coming in now, what its role is and how it will help reshape our world. I can't tell if all eight of these people have reached enlightenment, but if not, they are well on their path, with each having their own spiritual journey and discipline. The book ends with those interviwed saying such similar things, concentrating on four areas: exploring the feminine consciousness, what's important about spiritual practices, the need to go beyond transcendence to transformation in everyday life (and in a balanced way), and finally where we're headed because of our bringing in the feminine consciousness and transformation. It is with heart-felt gratitude to the author for writing this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the complete art of war sun tzusun pin history warfare",
        "description": "Sun Tzu's Art of War is the most famous, and the most thought-provoking, work of strategy ever written. The profound insights of this book have endured for over two thousand years, and they continue to reward careful study. The Military Methods of Sun Pin, the great-grandson of Sun Tzu, is a brilliant elaboration on his ancestor's work, which has been lost for nearly two millennia. Presented here together for the first time are the greatest of the ancient Chinese classics of strategic thought: The Complete Art of War.The Sun family writings on strategy represent a unique contribution to our understanding of human affairs. By unveiling the complex, often unexpected, interrelationships of armies locked in battle, their wisdom reveals the enduring principles of success in the struggle of life itself.With a unique index to the essential principles of strategy, and Sawyer's thoughtful chapter-by-chapter commentaries, The Complete Art of War is designed to guide the reader to new insights into the nature of human conflict and a greater understanding of every field of human activity, from playing the game of politics to building a successful marriage, from closing a deal to managing a large organization, and even from making war to making peace.",
        "authors": "['Tzu Sun', 'Pin Sun']",
        "infoLink": "https://play.google.com/store/books/details?id=ujs5LkQfPfIC&source=gbs_api",
        "review": [
            {
                "review/text": "The Art of War is the oldest and best military treatise this world has seen. It is amazing how Sun Tzu can talk about strategy and warfare in thirteen short chapters. His book is just the best about competition and strategy. And now we get to Sun Pin, the military strategist. I have awesome respect for him. He was betrayed and mutilated by his best friend, and still, he survived. He defeated his nemesis in a great strategic way that Sun Tzu would have mostly likely done. These two are the best and if they were in this world today, they would won every war that we fight, by their ability to adapt. If you want to get Ancient Strategy and Chinese Culture, get this book.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "Sun Tzu collected his teachings into the ancient Chinese treatise on military strategy known as \"The Art of War\" about twenty-five hundred years ago. Afterward his teachings were passed down through the Sun family, or a group of disciples, who edited or expounded upon the original writings until they assumed their current form. Sun Pin was the great-grandson of Sun Tzu, and he used the teachings of his brilliant ancestor to develop his Treatise \"Military Methods\". This wonderful translation by Ralph D. Sawyer includes both of these ancient texts.\"The Art of War\" has been studied the world over by military, political and business leaders seeking to understand the nature of human conflict in all it's forms. Although thousands of years old, the teachings of Sun Tzu remain relevant even today. The maxims of Sun Tzu have been applied by students of \"The Art of War\" to such modern conflicts as the Korean and Vietnam Wars.Sun Tzu's teachings range from the seemingly simple, such as \"Someone unfamiliar with the mountains and forests cannot advance the army\", to the more complex and thought provoking, such as \"In order await the disordered. In tranquility await the clamorous. This is the way to control the mind.\" The manual covers such diverse topics as training, supplies, terrain, the seasons and the use of spys, and includes detailed commentary by China's greatest military leaders through the centuries.\"The Art of War\" should be read by anyone who studies military history or strategy, and is part of the curriculum of many of the world's military academies. Studying the teachings of Sun Tzu can help you to form strategies for conflict resolution or negotiating in business, political or social endeavors through a greater understanding of human interaction.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "Sun Tzu is simplily the greatest military genius of all time. Dispite the book being written centuries ago it still provides wisdom for present warfare. Even more then that it also provides wisdom for everyday use. This book should be requirred reading in schools. Adding The Military Methods to the Art of War to create one book was a great idea. Sun pin picks up were is grandfather leaves off and he goes into a little more detail. The book provides history of China when the books were written. I usually do not like commentaries but these were not that bad. Personally I like to take my own meaning out of the context of this book which I believe gives it more meaning to your own life in this present time.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "The publishing of both Sun Tzu's and Sun Pin's works together makes for a valuable purchase. I've found that this translation is also quite easy to follow, and the comments assist with interpretation. These works represent awesome insights into the nature of warfare.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "My jaw dropped when i first read this book, i never new something this detailed on war existed! A must read for war gamers, these strategies can be used for a variety of games out there. Nicely done format, awesome commentries....words cannot explain....",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Bought a copy. Lost it. HAD TO buy another to replace it. An excellent book, Sawyers commentaries modernize and place in context applicable to today's managers. Clearly a lot of work went into his explanations. A must have, must read, must study. Provided me with months worth of reading material at lunch.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I've read this book for 3 times now (in two diffrent lenguages) and it just keeps getting better. It is a powerful book in warfare and is the basis of modern military thinkers. I train in the art of Shinobi and was my delight to know that the Iga region clans used this book as part of their basic strategies. Sun Tzu will always be a military genious. It is a must for Martial Artist, Law enforcers, Military personnal, Business men, and everyday person. Get it!!!!!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the complete guide to the kabbalah how to apply the ancient mysteries of the kabbalah to your everyday life",
        "description": "The Kabbalah is a practical system for understanding ourselves and our relationship with the world. At the heart of the Western Mystery Tradition, it is based upon a 'map' called the Tree of Life. The Complete Guide to the Kabbalah reveals the ancient mysteries of the Tree of Life in a way that is exciting, effective in its applications, and relevant to our modern everyday lives. The blend of traditional teachings coupled with state-of-the-art psychological understanding makes it an essential book for everyone interested in their own personal and spiritual development. This comprehensive book explains in straightforward terms how the Kabbalah can help us to: - Understand the connections between all the different events, ideas, and relationships we experience, and thereby make sense of life and enable us to live it to the full - Work from the heart as well as from the intellect and apply your insights to everyday life - Open yourself to the fabulous resources of your own inner wisdom",
        "authors": "['Will Parfitt']",
        "infoLink": "https://play.google.com/store/books/details?id=0Lt8AL29RpQC&source=gbs_api",
        "review": [
            {
                "review/text": "Whenever someone asks me which book to first read in order to start learning magick I always recomend this book by Will Parfitt. The great thing about it is that he guides the reader through a sequence of experiences so that you get to experience the different &quot;energies&quot;, &quot;paths&quot; and &quot;spheres&quot;, rather than just read about them. Most of the exersizes are also easy enough to do so that they do not require an enormous amount of self discipline. And the beginning student of magick will, after reading and experiencing this book, have an easy time understanding most western magick using either his direct knowledge of the meaning of the different parts of the three of life - or by learning about it using the intuitive faculties for understanding which this book helps develop.So, especially if you belong to the group of people who plods thorugh dark tomes filled with what appears as unfathomable kabblistic references or such and want to start experiencing and DOING magick - this is a really good start.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I have half a dozen books on Kabbalah and I use this one more than all the others. I find it to be the most relevant and useful in my life. I often reread passages at different times and I learn some thing new or see a different aspect each time.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "The title says it all; how to apply the ancient mysteries of the Kabbalah to your everyday life.It is one of the most fascinating books I have ever read addressing \"it all\".Morgan Sand",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "cherishment a psychology of the heart",
        "description": "Cher-ish-ment, n. F. cher, dear. Sweet, indulgent love, esp. of children. Emotional equivalent of nourishment; soul food. What the world needs now. Elisabeth Young-Bruehl and Faith Bethelard give a name to the kind, warm, tender, and affectionate love that babies expect before they can speak of it and that we all desire our whole lives long. As adults, they note, we all desire our whole lives long. As adults, they note, we don't often acknowledge or even understand our need for this \"cherishment.\" Their book is a rare effort to explore that need, to create a \"psychology of the heart.\" In Cherishment, Young-Bruehl and Bethelard provide a wholly original way of thinking about familiar concepts such as love, attachment, and care, showing how deep-seated disappointments and fears of dependency keep so many of us from forming healthy relationships. Questioning the traditional, celebratory view of independence and self-reliance, they argue that cherishment is the emotional foundation, formed in childhood, that sustains all kinds of growth-promoting adult bonds. Blending the philosophical writing that has won Young-Bruehl international acclaim with Bethelard's imaginative sensibility, Cherishment is a finely balanced interplay of scholarship, dual-memoir, and intimate therapeutic tales. It draws on ancient wisdom traditions of the East and West, telling many instructive stories of men and women, young and old, who have learned to cultivate the cherishment instinct in themselves as well as in others. It helps readers attune sensitively to the ways people express their need for affection in the details of daily life and relationships. The book narrates a journey of discovery, and any reader on his or her own journey in the realm of the heart will feel cherished by it.",
        "authors": "['Elisabeth Young-Bruel', 'Faith Bethelard']",
        "infoLink": "http://books.google.com/books?id=2UIA3Uv6Fg0C&dq=Cherishment:+A+Psychology+of+the+Heart&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As one who considers myself part of the prevailing cultural criticism of Freud I did not expect a pleasant read from a book in which his speculations play such a large role. But Young-Bruehl and Bethelard use Freud's solid ground of insights into the human mind to set sail on a voyage both east and west, ancient and modern. They generously take the reader along on their journey, gratuities included in the ticket price. Cherishment is more than a pleasant read. The book is an adventure for the reader/explorer interested in the ways in which we think about love, intimacy, dependency and primary needs. Voyagers meet an assortment of other pilgrims like Michael Balint, Akhilleus and a little known Japanese psychoanalyst named Takeo Doi. We learn to consider language and the ways its usage forms our understanding of our world. We eavesdrop on some patient sessions and are allowed in to some of the authors very personal dreams. Most interesting is the dialogue between the authors who challenge and compliment each other to advance an idea about our primary need to cherish and be cherished.",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "I was disappointed in this one...I found Cherishment to be a disconcerting and frustrating mix of technical jargon and rambling stream of consciousness. I'm big into self-discovery and learning about how psychothereapy works these days, and certainly understanding the role that cherishment (or lack thereof) plays in the individual and in society at large sounds valuable and interesting, but the authors make you work too hard for too little. The only interesting parts were the segments on the author's patients where they got into some real concrete discussions and examples about the effect of lack of cherishment on these individuals.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is one of the most elegant explorations of psychology, philosophy, classics, literature, and more that I've read in a long time. This is a beautiful contribution to scholarship, though it fits less into scholarship per se. Its argument--that \"cherishment\" is a fundamental need for humans--meanders through history, literature, philosophy, psychology without relying excessively on any one field's theories or frameworks. It is part self-reflection between two colleagues/friends and part academic study. The authors do not get hung up on \"arguing\" their point as much as offering their ideas and intellectual and spiritual journey to the reader to contemplate. Reading this volume was a refreshing and inspiring.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the illustrated art of war",
        "description": "A new illustrated edition of Sun Tzu's classic ancient Chinese meditation on military strategy and human psychology, with a new commentary that highlight its continued relevance for modern readers. Poetic and immensely readable, The Art of War was written 2,500 years ago and the military manual is still relevant today. A fascinating historical document that sheds light on ancient warfare, it is also a profound meditation on human psychology, interrogating the subjects of leadership, self-discipline and self-awareness. This new edition of the classic work is specially designed for modern readers. It includes an insightful introduction to the historical and philosophical context, and is accompanied by explanation and analysis of how Sun Tzu's lessons have been applied in some of the world's most famous battles. Renowned strategists from Field Marshal Montgomery to General Schwarzkopf have cited the book as an inspiration. The ancient text, attributed to Sun Tzu, is divided into 13 chapters that provide a logical and strategic approach to conflict and competition. Each focuses on a different aspect of warfare, including the importance of planning, managing your forces, decision-making, knowing your strengths and weaknesses, the art of deception and understanding the power of information. This edition, featuring more than 28 evocative photographs, offers a new perspective on a classic work and enables new generations to discover The Art of War and find new applications for the wisdom of Sun Tzu.",
        "authors": "['Tzu Sun', 'Anthony Tucker-Jones']",
        "infoLink": "https://play.google.com/store/books/details?id=ThiWDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "If you're going to pick up a copy of the &quot;Art of War,&quot; this particular edition is the most attractive one to have sitting in a collection. You don't have to be an ancient Chinese general to learn from Sun Tzu's 2,000 year old masterpiece. Much of this material can still be applicable in day to day life if you look past the military language. Especially recommended for people trying to get ahead in tough fields like business or politics or even just for those who happen to like philosophy. Also check out the animated Art of War by Tsai Chi Chung if you're looking for a lighter hearted presentation of this and other Chinese classics.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "There is not much to say here except that this book is very complicated if you do not get a good translation. Thomas Cleary's translation here is probably one of the best out there to offer a version that translates well into English. The Art of War harnesses the Zen-state of Buddhism in order to master war is a paradox that Westerners have a very difficult time comprehending. Cleary's translation offers a rare but well written method for you to approach this paradox. His prologue is a must read for all. The Art of War in itself is very difficult to comprehend. Written in practical verses that seem applicable in everyday life, they are actually profound concepts with multiple meanings. I've owned and looked at several translations but I have to say this is one of the best. This book will provide you with the prologue to get you started to digest the dyspeptic Chinese bible of war, and the lucid translations of the verses thereafter will need time to assemble correctly in your head. I want to strongly advise you not to get discouraged because, afterall, the Art of War is very short compared to The Book of Five Rings or On War by Carl von Clausewitz. Once you get past the seemingly endless contrarian advice, you'll understand why this is still the most widely recognized book in Asia on how to deal with conflict and confrontation.",
                "review/helpfulness": "20/23",
                "num_reviews": 23
            },
            {
                "review/text": "The Art of War is well known. Dating from well over 2,000 years ago, it is a compilation of short sayings relating to military strategy. These sayings have seemingly been found applicable by generations of military and business leaders.The author holds a Ph.D. in East Asian Languages and Civilizations from Harvard University. This new translation is written close to modern language so that it makes more sense to the modern American reader. It further establishes the point of view of the spiritual traditions of Taoism, the origin of psychology, science, and technology in East Asia that are the source of the insights into human nature that underlie this classic.The illustrations in this edition include some of the finest works of art from China, Japan, and Korea, selected from museums, galleries, and private collections in countries throughout the world.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "If you're in competition of any sort, you'd do well to read this classic work of Eastern Philosophy. While it primarily applies to warfare, with a little thought, you can understand how the information within can be applied to anything -- from business to sports.The book is well laid-out, with an informative introduction to the work. Throughout, we get the primary points of Sun Tzu's work, which are further expounded upon by other Chinese philsophers that followed him. In most cases, this allows you to understand exactly what Sun Tzu what saying, there are instances where the quotes/explanations from the other philosophers directly contradict what Sun Tzu said, which makes things a little uncertain.This does not mean you should discount this book -- it is actually an extremely good piece, both for the Eastern Philosophy or Military Sciences enthusiast, but for the beginner as well.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "You do not need too much words for explain and feel the presence of such unvaluable treasure . Highlighted supported with text and fotographs .A presentation of first rate . And so a timeless reference book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "With its clear graphics and its wonderful illustrations, this version of the Art of War adds the element of the various interpretations of the text, set up much in the way that the classic Talmudic texts read. An important work in the history of military strategy and philosophy, this book has much to teach to anyone.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Every day of our lives, when we have issues in our works, duties , homes, school, or wherever, you can go to these wise pages that would give you the key to face your problems, and concerns whatever they are. With a different meaning, this book has been translated into every modern language and has been helpful to many business strategies in the whole world.In this edition we can also read the introdution of Thomas Cleary who explains us the real meaning and a little biography of those generals who explain what Tsu's trying to say. This is not just only an interesting book for what it says, what it makes it more interesting are the higlighted pages , images, photos, sculptures and paints of the old China inmortalized in this beautiful edition.This is simply the best edition ever made of this mythical book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sorcerers stone a beginners guide to alchemy",
        "description": "The author of this book, Dennis William Hauck, is a Hermetic scholar versed in both Eastern and Western techniques of alchemy and widely recognized as one of the world's leading experts on the subject. Now, in this book, he makes alchemy's secrets and powers accessible to everyone with the desire to experience physical, mental, and spiritual transformation. By providing clear explanations, moving meditations, and hands-on experiments making tinctures and elixirs, this beautifully illustrated guide passes on the knowledge and creative energy of alchemy's magnificent discipline-sending a golden arc of learning from thousands of years in the past into your life today. Hauck presents a fascinating history of alchemy-from the ancient Emerald Tablet to modern quantum chemistry - and elaborates on its arcane principles in an intimate, conversational way that anyone can understand. His portrayals of individual alchemists bring them alive and show how they built on each other's work through an \"Underground River\" of secret knowledge passed down through the ages.",
        "authors": "['Dennis William Hauck']",
        "infoLink": "http://books.google.nl/books?id=jFySlAEACAAJ&dq=Sorcerer%27s+Stone:+A+Beginner%27s+Guide+to+Alchemy&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The author of this book, Dennis William Hauck, is a practicing alchemist versed in both Eastern and Western techniques of alchemy and widely recognized as one of the world's leading experts on the ancient art and the benefits it offers contemporary practitioners. Now, in Sorcerer's Stone, the first basic primer on the subject, he makes alchemy's secrets and powers accessible to everyone with the desire to experience physical, mental, and spiritual transformation. By providing clear explanations, moving meditations, and hands-on experiments making tinctures and elixirs, this beautifully illustrated guide passes on the knowledge and creative energy of alchemy's magnificent discipline-sending a golden arc of learning from thousands of years in the past into your life today.Hauck present a fascinating history of alchemy - from the ancient Emerald Tablet to modern quantum chemistry - and elaborates on its arcane principles in an intimate, conversational way that anyone can understand. His portrayals of individual alchemists (like Flamel, Fulcanelli, and Isaac Newton) bring them alive and show how they built on each other's work through an \"Underground River\" of secret knowledge passed down through the ages.Moreover, Hauck makes clear that alchemy is a means of personal transformation that enables you to meet your highest potential as a human being. Although the alchemists spoke in terms of vessels, furnaces, and chemicals, they were really talking about changes taking place in their own inner nature. They worked with the archetypal energies of metals to change their own \"temperament\" from lead to gold - to rejuvenate their bodies, integrate their personalities, and perfect the very essence of their souls. The bizarre drawings and cryptic writings of the alchemists refer to specific operations that work on all levels of body, mind, and spirit. Today, enlightened physicians and healers are demonstrating that alchemical methods can protect and rejuvenate the body and even heal brain and spinal cord injuries.Complete with alchemical engravings from the Middle Ages as well as insightful charts and diagrams, this illuminating handbook will teach aspiring alchemists the true art of transformation. Chapters: What Is Alchemy? | The Golden Thread That Runs Through Time | The Principles of Alchemy | The Kitchen Alchemist: Making Tinctures and Elixirs | The Ladder of the Planets | Saturn's Child: The Base Metal Lead | Jupiter's Rule: The Courtly Metal Tin | Mars' Challenge: The Angry Metal Iron | Venus' Embrace: The Loving Metal Copper | Mercury's Magic: The Living Metal Mercury | The Moon's Reflection: The Lunar Metal Silver | The Sun's Brilliance: The Solar Metal Gold | The Operations of Alchemy | Personal Purification | Becoming an Alchemist. The book includes an extensive glossary and resource guide.",
                "review/helpfulness": "99/99",
                "num_reviews": 99
            },
            {
                "review/text": "I bought this beginner's guide because, obviously, I'm a beginner. So I need to be able to trust what the author is teaching me. Unfortunately, I can't.Hauck's premise is that parallels can be drawn between alchemy and contemporary science. I don't know alchemy, but I found many sloppy references on the science track, and that makes me wonder if he's playing fast and loose with alchemy too.For a small example, in his discussion of gold, he notes that it's used to protect \"intersteller probes.\" Sounds plausible, except that humans have launched no intersteller probes; could this be some kind of metaphor, or is it just a mistake?One example of a larger failure is his chapter on Saturn, in which he ascribes its characteristics to the fact that it's a failed sun: that, if only it had more mass, it would have succeeded in becoming a sun. That's true, but it's true of all the planets; in fact, Jupiter is more massive, and thus closer to being a sun. Why did Saturn derive its personality from this, but not the other planets? I feel in this example he has twisted contemporary science to suit the ancient attributions of alchemy.As a beginner, I can't evaluate his presentation of the alchemy track, but his careless writing on the science side leaves me dissatisfied.",
                "review/helpfulness": "33/49",
                "num_reviews": 49
            },
            {
                "review/text": "I wa svery happy with the author's style of writing in this book. He presents a down to earth format which can be easily understood and utalized by anyone looking for information on alchemy. I deffinently reccomend this book if you want to discover alchemy for yourself.",
                "review/helpfulness": "20/31",
                "num_reviews": 31
            },
            {
                "review/text": "There is no one better suited to brew a beginners guide together than Dennis. His background, research, travels, lectures and other books are all proof of his knowledge in alchemy. What makes him perfect for such subject matter is that Dennis is an alchemists first and an author second.",
                "review/helpfulness": "19/28",
                "num_reviews": 28
            },
            {
                "review/text": "\"Sorcerer's Stone - A Beginner's Guide to Alchemy\" by Dennis William Hauck is a really nice book. It has something for everyone who is interested in alchemy and ties it all together. There is history, philosophy, theory, practical laboratory work for the novice, and psychological and inner exercises as well. Well written, illustrated, indexed, and with a very handy and detailed glossary, I recommend Hauck's \"Sorcerer's Stone\" to anyone interested in alchemy. You will be glad you read it, and re-read it again. On a personal level I have shared several lengthy emails with the author, and have spoken to several of his students (via the Flamel College with which he is affiliated), and everyone had kind and generous words to say about him. This alone says volumes.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "Many people are aware of alchemy as a precursor to modern lab chemistry, but less know of the alchemists' spiritual goals. Hauck's introduction to modern alchemy stresses this philosophy of personal transformation, where the practitioner's \"leaden\" personality is transmuted into the \"gold\" of an enlightened spirit. Hauck starts out with a chapter on how modern practitioner's view alchemy then moves on to a summary of the history and myths. The bulk of the book is devoted to applications. He gives a detailed discussion of the symbolism of the metals and planets, which includes a meditations and a few lab exercises. He ends by describing the chemical operations and how they correspond to spiritual, psychological, and physical changes that accompany spiritual development, again with exercises.For the most part, Hauck does an excellent job descrbing the symbols and operations clearly for someone new to the subject. I liked how he includes examples of some of the wonderful old alchemical illustrations and carefuIly explains the symbolism in them. I also greatly liked his breif aside on how the film version of 2001: A Space Oddessy as modern alchemical symbolism. I mostly read the book for intellectual curiousity, and did not try the lab experiments myself, but I imagine that one would need a little more information or experience to successfully perform them than is offered in the book. Hauck also has the somewhat annoying tendency of occult authors to mix fact, legend and speculation together with little differentiation and less citation. Overall, however, I found it an understandable and interesting read for insights into what a modern alchemist believes and practices.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "transformations of myth through time",
        "description": "Speculates on the origins of mythology, describes mythic stereotypes, and looks at how myths affect the modern world",
        "authors": "['Joseph Campbell']",
        "infoLink": "http://books.google.nl/books?id=zA3aAAAAMAAJ&dq=Transformations+of+Myth+Through+Time&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This was another of those synchronist events that happens in the form of the written word. Actually, I got ahold of these videos through my local library at a time when I was searching for questions instead of answers. This book is a tour de force of the mythological evolution of the human species. Campbell addresses what the elemantary ideas of myth are and how they present themselves uniformly throughout all cultures, historical and present, of the world equally. The thesis--there is only one mythology that is inflected in various folk manifestations, comes across beautifully. Campbell will challenge you to rethink about religion and mythology and what it means to you as a human being. This one is a must read.",
                "review/helpfulness": "37/37",
                "num_reviews": 37
            },
            {
                "review/text": "Read this if you can't afford the tapes of this excellent PBS series (though it gets a little dry in some spots)! It is a (now deceased) esteemed archeologists's comparisons of myth with the actual excavations that he and other archeologists have made. He can validate or repudiate claims made by some religions that their version is the best, only, or earliest version, and can also show how some myths evolved from actual real events or places. Once you are done reading this, go ahead and read the older work The Women's Encylopedia of Myths and Secrets (written by Barbara G. Walker), another heavily referenced work, which looks into the literature of the ancients, right on through to the Middle Ages, highly exposing information that has been supressed by later religions, politicians, and peoples.",
                "review/helpfulness": "21/27",
                "num_reviews": 27
            },
            {
                "review/text": "To read this book is a real proud . The multiple annotations and clever observations of this renowned master of the mythology make us transport immediately to this unusual universe He makes an amazing journey from the origins of the myth in the distant past to familiar European medieval legends .The fertile wisdom and powerful intelligence of this extraordinary thinker is a real invitation to enter and cross the line for knowing one of the most ambitious essays ever written .Thirteen chapters all the way depicted with visible commitment are :In the beginning :Origins of the man and Myth.Where People Lived Legends: American Indian Myths.And the Washed Our Weapons in the Sea: Gods and Goddesses of the Neolithic Period.Pharaoh' s Rule : Egypt , the exodus and the Myth of Osiris .The Sacred Source : the Perennial Philosophy of the East.The Way to Enlightenment: Buddhism.From Id to the Ego in the orient: Kundalini Yoga , Part I.From Psychology to Spirituality : Kundalini Yoga , Part IIThe Descent to Heaven: The Tibetan Book of the Dead.From Darkness to Light: The Mistery Religions of Ancient Greece.Where There Was No Path: Arthurian Legends and the Western Way.A Noble Heart : the Courtly Love of Tristan and Isolde.In Search of the Holy Grail: The Parzival Legend.The material of myth is the material of our life , the material of our body , and the material of our environment , and a living , vital mythology deals with these in terms that are appropriate to the nature of the knowledge of the time .There are two types of human beings . There is the animal human who is practical and there is the human being who is susceptible to the allure of beauty which is divinely superfluous . This is the distinction . This is the first little gem of a spiritual concern and need , of which the animals know nothing.The illustrations are of first order and support the text in a very helpful way .Do not think it over and buy this supreme golden book.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "I have read a number of Prof. Campbell's books, and found this to be one of the best. I enjoy very much his lectures on compact disk or DVD generally more than his written work, and this book is a compilation of lectures. Once you are familiar with some of his work, a particularly good read is his recent biography--A Fire in the Mind--excellent and organized insight to both his extraordinary life as well as his work and thoughts!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a strong set of lectures, published posthumously, jam-packed with detail about mythology and rich in associations that are fascinating, thought provoking, usually clear though sometimes obscure. Essentially, I would venture to say, the main lesson here is that in myth and mysticism symbols are used that point to that which is beyond thought, beyond the dualities of space and time; and it is a mistake to take those symbols as literal fact. \"Names don't matter , they're but a reference.\" In taking something literally as being the Word of God, the symbol is \"concretized\" and is made an object of authority rather than a reference to that mystery of spiritual power. Moreover, if those symbols are based on an out-dated cosmology of, for example, the first millenium B.C., the symbols themselves lose their meaning.The main topic of comparison here as elsewhere in Campbell's work is between East and West. The break in the spiritual traditions of East and West can be understood starting with the world view of the Zoroastrian tradition that grew out of Persia (Iran). The emphasis here is on the ethical: the battle between the sons of light and the sons of darkness. One's purpose is to engage in a battle for the good; the battlefield takes place in historical time; and the ultimate realization is the end of time when the good will triumph. In India a very different spiritual tradition grew and spread in the other direction. Campbell explains the mythology that underlies Buddhism, and goes into much detail concerning Kundalini Yoga and the chakras - the seven different stages in the transformation of consciousness. In the West the engagement is social - toward the group, whereas in the East, there is a turning inward to the psychological with the aim of transcending pairs-of-opposites and thereby transcending the problem of evil.In the last several lectures, Campbell summarizes material from his volume CREATIVE MYTHOLOGY. The central idea here is that you can search the East but not find the same kind of emphasis as in the West on the unique individual being tested through a spiritual quest. The spirit of individual development began with the Greeks, and emerged in mythology during the Middle Ages, especially concerning the Troubadours and the Arthurian and Grail legends. The theme of the Grail is finding one's center - \"following one's bliss\" - and that entails finding one's unique pathway in the wasteland - the place where people live inauthentic lives, lives that are mapped out for them, where they do not find the opportunity to develop their own unique and special abilities.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "introduction to magic rituals and practical techniques for the magus",
        "description": "The rites, practices, and texts collected by the mysterious UR group for the use of aspiring mages. -> Rare Hermetic texts published in English for the first time. -> Includes instructions for developing psychic and magical powers. In 1927 Julius Evola and other leading Italian intellectuals formed the mysterious UR group. Their goal: to bring their individual egos into a state of superhuman power and awareness in which they could act \"magically\" on the world. Their methods: the practice of ancient Tantric and Buddhist rituals and the study of rare Hermetic texts. So successful were they that rumors spread throughout Italy of the group's power, and Mussolini himself became quite fearful of them. Now for the first time in English Introduction to Magic collects the rites, practices, and knowledge of the UR group for the use of aspiring mages. Included in Introduction to Magic are instructions for creating an etheric double, speaking words of power, using fragrances, interacting with entities, and creating a \"magical chain.\" Among the arcane texts translated are the Tibetan teachings of the Thunderbolt Diamond Path, the Mithraic mystery cult's \"Grand Papyrus of Paris,\" and the Greco-Egyptian magical text De Mysteriis. Anyone who has exhausted the possibilities of the mundane world and is ready to take the steps necessary to purify the soul in the light of knowledge and the fire of dedication will find a number of expert mentors here.",
        "authors": "['Julius Evola', 'The UR Group']",
        "infoLink": "http://books.google.com/books?id=F1EtGwAACAAJ&dq=Introduction+to+Magic:+Rituals+and+Practical+Techniques+for+the+Magus&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Quite simply the most penetrating magical text that I have encountered in all my years of study. The collection of essays on magical theory and practice by Evola and his associates set a standard by which future works appearing in the English-speaking occult world will be judged. Of particular merit are the essays entitled &quot;Knowledge of the Waters&quot; and &quot;On the Magical View of Life&quot; - herein are given great secrets never before so clearly stated. There is no hackneyed, watered-down GD-OTO-Wiccan ephemera to be had here - those accustomed to that kind of spiritual spoon-feeding may find themselves a bit flabbergasted after ingesting this information, but may also find themselves a bit wiser in the process. The unleashing of Evola onto the American esoteric community has been a blast of long-needed fresh air; those with the will and vision to make the Ascent will find in him a great mentor. If you buy only one book on magic, make this your choice. You won't be disappointed.",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "This is probably the most profound and significant work on magic to appear in the last fifty years. Readers of Inner Traditions' other Evola translations will know that his works are not an &quot;easy read.&quot; They require careful, multiple readings because Evola is not a New Age huckster but a genuine master. His command of the most difficult texts of philosophy, mysticism, and occultism--East and West--is absolutely remarkable. But reading Evola you sense that you are in the presence of a man who not only exhibits great scholarly erudition, but also a high degree of spiritual attainment. INTRODUCTION TO MAGIC confirms this impression, for here we learn of the spiritual and magical disciplines to which Evola and his UR group subjected themselves. This is most definitely a &quot;how to&quot; book, but it is far from &quot;introductory&quot; in the sense of being painless or easy. This is a demanding book, demanding in that it will require careful study, and demanding in what it requires the aspiring adept to DO, practically, in order to perfect his soul. The spiritual aim of Evola and the UR group, and all of the exercises in this book, is to achieve consciousness of, and identification with, a &quot;higher self.&quot; This involves nothing less than a will to completely transform and perfect oneself. It is a path which requires the strictest mental and physical discipline. It is not for those casually interested in &quot;the occult.&quot; Indeed, Evola warns that this path is actually dangerous to those who would take it up casually or without full conviction. If you are a serious and dedicated student of occultism, if you are ready to embark upon a path which WILL transform your life, and if you are prepared for the struggle and conflict that this will inevitably bring with it, then you must read INTRODUCTION TO MAGIC. No other work on magic is as frank, as explicit, and as profound. Evola's approach is also blessedly free of any infusion of Christianity, Kabbalism, or &quot;Egyptianism.&quot; His is truly a Western pagan magical path. It is recommended that you read this work in conjunction with other works by Evola, especially his book on alchemy, THE HERMETIC TRADITION, and his magnum opus, REVOLT AGAINST THE MODERN WORLD. Both of these are also published by Inner Traditions.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "The Kali-Yuga into whose saturno-aquarian darkness and nescience we are presently sinking is a veritable epoch of decline and decay, of senescence, decadence and obscuration dominated by what the Gnostics called 'the counterfeit spirit' Ialdabaoth-Samael, the Archon of Darkness and material delusion - authentic Esotericism has for some centuries been eclipsed and clouded by a whole spectrum of insidious imitations and perversions ranging from New Age effusions and modern ceremonial gibberish to quasi-satanic claptrap, all usually characterized by ineptitude, questionable aesthetic taste and dishonesty. So this collection of essays on various aspects of High Magic, remarkable for it's special quality of rigour, clarity and fidelity to the spirit of the Tradition, presents a very refreshing exposition of Magic and the perennial wisdom of Hermeticism. In fact the book also treats aspects of Kaula Tantrism and Vajrayanic Buddhist Yoga. Far from an easy ride this material is challenging in its austerity and power and requires not just intellectual concentration but assimilation via the understanding of the Heart-Mind, by noetic apprehension of its inner truths. The essays by the 'Black Baron' are profound in their icy penetration into the lofty reaches of the most sublime arcana of Hermes: the other writings presented here, by the Neo-Pythagorean magus Arturo Reghini, Giuilio Parise and the other members of the UR Group are equally inspiring and nourishing. This book is a welcome change and one does not have to concur with every point made to find it extremely stimulating and unusual. Highly recommended as epitomizing various takes on the Traditional approach to Magic and Hermeticism.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            },
            {
                "review/text": "Inner Traditions merits praise for the great care they have afforded in faithfully reproducing this seminal work on Ars Magia by a group of anonymous Italian esotericists known as the Gruppo di Ur. Unfortunately the other English translations of Evola's works have not fared as well. Entire passages of previously translated books remain incomprehensible and utterly unrecognizable from the originals. For example, a key subject matter in Italian esotericism revolves around the semiosis or secret language employed by a (alleged) group of Tuscan duecento poets known as the \"Fedeli D'Amore\". The name of this group has appeared in various translations of Evola's works as \"Worshippers of Love\" or enigmatically as \"Love's Lieges. The translator fails to recognize that by translating key cryptic terms, one uproots the semiotic power of assonance and associated imagery embedded in the original phrase (etymon) to graph onto the psyche and shoot branches of sublime meaning. The underlying context which in the sapienza palladia or gaia scienza lexicon associates the term with the H.R.E. Federicus and the Ghilbelline movement is lost. This loss of identity is akin to a literal translation of Troubadour into Finder. With that said, and leaving aside one's perspective on Evola or on the subject matter, Introduction To Magic is a magnum opus of its kind. Originally published in minimal quantities as a journal in the late 19 20's, these series of manuscripts were uncompromisingly written by adepts for adepts, without any attempt to appease public vagaries. The scholar Mircea Eliade first became acquainted with Evola's works through the publications of these curious yet hermetically dense texts. The Ars Magia forms part of an ancient branch of Italic sapiential wisdom that has been enriched over the centuries by philosophers such as Ficino, Pico, Bruno, Campanella and Vico. Introduction of Magic is a worthy continuum to this corpus. It offers a window into arcane labyrinths.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "Introduction to magic is indispensable if you are seriously pursuing the path of real initiation. The booklets published by the italian group of UR in the 20s, collected as a chapter for every month, comprise direct instructions, commentaries of ritual and alchemy works, explorations of different initiatory systems, essays on several components of magic.One aspect that could be considered a minus is that this book doesn't spoonfeed you about how to build your routine. You won't find a page with a big EXERCISES title at the end of every chapter, and you won't be told every little detail of every technique (for an *excellent* book that does this, my advice is 'Initiation into hermetics\" by Franz Bardon). However, some of the authors (Abraxas and Luce, in particular) seem to lay out a complete system of practice chapter after chapter, to be followed in order.A warning: this is a wonderful book, but it is very different from what many occult hobbyists are accustomed to. It does everything to keep away from the feel-good newage fluff which fills the vast majority of books on the subject, and to state clearly what initiation really implies.Do you think you can read that mediumship is something that must be cured, that theosophy and spiritualism are anti-initiation movements based on fancies, that immortality isn't for everyone and you will not just 'reincarnate' to have another chance if you fail? Can you accept the notion that one of the goals of initiation is to transcend passions, that an initiate cannot fall in love, get angry, desire or fear anything? If the answer is no, then don't read this book; you will not like it.Note that this is only the first volume of three. In my opinion this is also the most important. The essays follow an order and can be used to draw a plan or at least to get an idea of the subject, while they become less organized from the second year of the publication on. However they are still invaluable, so, if you can, read the other two too.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "There are many available sources of knowledge in the world today, but the writings of Evola are without doubt giants in their field. This book is absolutely serious, and dangerous. I can guarantee that no one who reads it will genuinely take up its teaching and practices without the greatest difficulty and sacrifice. For this type of knowledge to be available in today's world is nothing less than a blessing, and can be used to great benefit in virtually every religious, occult, metaphysical and spiritual endeavour.It is best described as a handbook to Adeptship, the Science of the Self, in which both religious and magical aspects are fully integrated with balance, grace and dignity. Clearly, each contributing author speaks from experience, and this immediately puts it beyond the vast majority of 'textbooks' out there. I am surprised that this book has even been published, but given that its authors felt that no unworthy students would benefit much anyway, it is better not to look a gift horse in the mouth.I would add that a certain period of study-at a 'safe distance'-is necessary, and should be supplemented by (at the very least) two other books by Evola: \"Ride the Tiger\" and \"Revolt against the modern world\". These will give the passive reader an idea of what is really being asked of them, and the context in which this teaching is set. Other books by Evola are of equal benefit, but deal with the path from specific Traditions, whereas this book combines insights from East and West. Specifically, the writings of Ea, Abraxas, Luce and Leo are of core value, followed by Arvo, Oso, Alba and Meyrink. These will naturally appeal to the Western reader, though the other texts should not be avoided.On a personal note, I have found the study of Evola's writings to lead to a respectful, even loving relationship to someone whose spirit and mind were clearly as deep and bountiful as the ocean, and I treasure his clarity, honesty and rigorous discipline in all he says and does. He was a bright star amongst a dark generation.The only 'criticism' I have to make is with his understanding of Christianity. But this is easily justified given his point of reference, and the problematic position of Catholicism to the Traditional World (not being properly part of it due to its exclusivity, yet retaining much through organic adoption and succession). Nonetheless, I am surprised he did not see through the 'exoteric' version of Christianity to its essence and significance. To the Christian who studies his work, he will find the key to understanding the esoteric or truly gnostic meaning of Christ's life and work, especially his explanation of the 'Immortal Body'. In this respect, I would strongly recommend the works of Rudolf Steiner, who, interestingly enough, Evola respected personally yet disagreed with professionally.In conclusion, this book is a prodigy in its field, and probably will not be recognised as such for a while. Do not be put off by any references to Evola as a Nazi supporter-his position is fairly well documented and understandable from his own hopes and beliefs, not his detractors. If you do decide to buy this book, you will probably find most of your further collection naturally taking second place!Even if you only read it for information's sake (and this is not an easy task by any means) it will be well worth it. Good luck!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book presents a series of short essays designed to introduce students of the esoteric to the Hermetic school of thought of Evola's UR lodge.Some basic things about this book are that it should be read in order, as it tends to build upon previous essays. It is some what philosophical, which sees things in a gnostic/manachean way. it seeks to restore a sort of &quot;heroic&quot; attitude to the esotericist, that is lacking in most drivel that passes as &quot;magic&quot; today.Also included is a very interesting introduction which describes the behind the scenes dramas and background information on the authors.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I rarely give 5/5 for anything, whether it be music, art, or cinema. But Julius Evola and the UR Group have presented one path in this book for the student to apply to her or his life to progress magically through this world and on into the next. This text is not for the beginner or the non-practitioner, they are for those that are willing to trudge forth ... and I'm sure they know who they are.You don't have to agree with every method put forth by the UR Group, but to experience and understand what they teach is to be well on your way.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book contains a great deal of interesting material, from translations of Mithraic rituals and various alchemical works. Additionally, I would rate the meditative exercises as very good.However, it is somewhat less of an introduction to magic than, say, Book 4 by Crowley. Instead I would recommend it either as an advanced meditation manual or an advanced magic workbook. It is not really suited to the beginner very well.I only gave this work four stars because the book claims to be universally applicable and transcendent of tradition but instead seems to my mind to be fairly Buddhist in its outlook. I think therefore it fell slightly short of the original author's stated goals. Otherwise, I think it is worth reading for those who are interested in the history of esoteric thought, for those looking for some more advanced meditative techniques, and for those looking to bridge the gap between meditation and magic.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The title of this book could be a bit misleading, as it's fair to say that the majority of the articles in this book are not intended for people who are just coming into magical practice. The articles requires at least an intermediate knowledge in Hermeticism, Alchemy, or Buddhist Meditation techniques, for the most part. With that said, I definitely recommend this book for anyone who is interested in reading and practicing the different techniques described and discussed in this book.These articles were written in the late 1920's by a group of experimental magicians called the UR group, lead by Julius Evola. This book presents a fascinating glimpse into ceremonial magical work being done in that time by magicians who weren't overtly associated with magical orders such as the OTO or Golden Dawn. The articles are detail oriented, but all of the writers manage to discuss the concepts with enough brevity to explain what needs to be done and how to do it, without unnecessarily waxing poetic about it.One article I particularly liked was what I would suggest was the first article ever written on space/time magic...but rather apt for what it suggests about the nature of time and how a person interacts with it. This is definitely a book I will read again and again and get more out of each time I read it. I recommend it to any person who wants to either get a better historical perspective of magical practices or wants to continue honing his/her practices.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a pilgrims guide to the camino fisterra santiago de compostela to finisterre including the muxia extension",
        "description": "Finis-terre translates simply as end of the world, and provided a dramatic focal point for one of the most potent western vision quests in the medieval world. It was here that the material and spiritual worlds met. Beyond the horizon was tir na nog - the land of eternal youth. Its potency is not lost on the pilgrims that still come here, seeking to reconcile the inner and outer realities in their lives.",
        "authors": "['John Brierley']",
        "infoLink": "http://books.google.nl/books?id=MDbSNwAACAAJ&dq=A+Pilgrim%27s+Guide+to+the+Camino+Fisterra:+Santiago+de+Compostela+to+Finisterre+Including+the+Muxia+Extension&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Same format as the Camino Frances guide - laid out in three stages. One stage per day, one map per stage total of 95 pages. In addition to covering the route, it has a section of practical information on when to go, covers Galician history and culture. A beautiful full color guide.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I used this book and the similar Camino Portugues book for my pilgrimage in April 2006. They are both superb. I followed Brierley's suggestions pretty much to the letter. The book contains excruciating details as well as a longer and spiritual view.I think of the book as a personal gift to each of us pilgrims. Brierley obviously loves his work and the Camino. He kept me on track, put me to bed early and awake early when it was important, encouraged me to appreciate the wonderful people and sights along the camino. He offers history lessons, lists of practicalities, maps and directions. This book is all you need!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how the universe was created and our purpose in it",
        "description": "This book provides answers and details about the process of creation that are not available in any other traditions, religions, or areas of science. It offers the oldest rendition of the creation and presents insights into the spiritual purpose of it and what we are really meant to do here. Every culture in the world and most religions have their own descriptions of the creation, and ideas about from where we came and what we should do. Unfortunately, these are often short and generalized versions that lack details. Thus, they are often given no better regard than myths. However, there are descriptions that give more elaborate explanations of how the cosmic creation fully manifested which are found in the ancient Vedic Puranas of India, some of the oldest spiritual writings on the planet. These descriptions provide the details and answers that other versions leave out. Furthermore, these Vedic descriptions often agree, and sometimes disagree, with the modern scientific theories of creation, and offer some factors that science has yet to consider. Now, with this book, we can get a clearer understanding of how this universe appears, what is its real purpose, from where we really came, how we fit into the plan for the universe, and if there is a way out of here. Some of the many topics included are:? Comparisons between other creation legends.? Detailed descriptions of the dawn of creation and how the material energy developed and caused the formation of the cosmos.? What is the primary source of the material and spiritual elements.? Insights into the primal questions of, \"Who am I? Why am I here? Where have I come from? What is the purpose of this universe and my life?\" ? An alternative description of the evolutionary development of the various forms of life.? Seeing beyond the temporary nature of the material worlds, and more. This book will provide some of the most profound insights into these questions and topics. It will also give any theist more information and understanding about how the universe is indeed a creation of God.",
        "authors": "['Stephen Knapp']",
        "infoLink": "http://books.google.com/books?id=bhapuAAACAAJ&dq=How+the+Universe+was+Created+and+Our+Purpose+In+It&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In How The Universe Was Created And Our Purpose In It: The Eastern Answers To The Mysteries Of Life, Stephen Knapp reveals conditions in the spiritual world before the material manifestation; how the Supreme Being exists before and after the material creation; the ultimate foundation and cause of the universe being the compassion of the Supreme Being; how the agitation of the modes of nature cause the appearance of time; detailed descriptions of the dawn of creation and how the material energy developed and caused the formation of the cosmos; the Vedic description of the evolutionary development of the various forms of life; manifestation and purpose of the Vedic literature; profound insights into the primal questions of life; the primary source of material and spiritual elements; the many incarnations and expansions of the Supreme Being in the material creation; and how everything reflects an expansion of the Absolute. How The Universe Was Created And Our Purpose In It is profoundly rewarding reading for students of metaphysics and the Eastern philosophies.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "My congratulations to the author for a well thought out and meticulously researched book. Stephen does what he says he will do, which is to present the Vedic version and all its details of how the world was created. I have read a little about the Vedic description of the universal creation in the Rig Veda and Upanishads. Though it has always intrigued me, it is not a topic that is easy to understand. The author has done a commendable job in putting it all together in a format that's much easier to grasp and follow. This Eastern tradition always had much more information about the creation process than any other culture or spiritual tradition, and is worth looking at. So I especially appreciate the many dozens of quotes or references from the ancient Vedic books and Puranas that the author uses to illustrate the lofty concepts that they contain. Anyone interested in Eastern thought or alternative spiritual views will appreciate this book and the endeavor that was put into it.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "The purpose of this book and many of his other books written by Stephen Knapp is to identify our constitutional position as a pure spiritual soul that is superior to material nature. Recognizing our eternal place and working towards to get back there is the esssence and purpose why this universe is created to discipline the rebellious souls. Stephen brings this point forth with clarity out of innumerable references from many scriptures. With his practical experience in practicing bhakti yoga over years helps giving useful practical hints for the souls that are interested in putting this material into use. Like his other works, the content of this book can be best appreciated only when one has open mind and thinks beyond the perception of material senses.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I HAVE READ A LOTOF BOOKS OVER MANY YEARS BY VARIOUS PHILOSOPHERS (EAST AND WEST), PHYSICISTS, MYSTICS,ETC. ALSO, ON SUBJECTS SUCH AS CONCIOUSNESS, VARIOUS RELIGIONS, DEATH, THE AFERLIFE, THE OCCULT,ETC.RAISED CHRISTIAN, I NOW FAVOR THE EASTERN RELIGIONS, ESPECIALLY HINDUISM. AFTER READING TEXTS ON THE VEDANTA, UPANISHADS, ETC., I WAS LOOKING TO FIND AN AUTHOR WHO WOULD CONCEPTULALIZE THESE BELIEFS IN A SIMPLE WAY. I CAME ACROSS \"HOW THE UNIVERSE WAS CREATED AND OUR PURPOSE IN IT\" AND STEPHEN KNAPP. I FOUND CHAPTERS 17, 18 AND APPENDIX 3, PARTICULARILY ENLIGHTENING AND THEY SUMMARIZED A LOT OF IDEAS I HAD BEEN READING ABOUT IN MORE DETAILED PUBLICATIONS.HIS WEB SITE \"STEPHEN-KNAPP.COM\" ALSO HAS NUMEROUS ARTICLES THAT CAN BE VIEWED ON-LINE OR FREELY DOWNLOADED. I WOULD RECOMMEND THIS BOOK TO ANYONE ON THE SPIRITUAL PATH.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "the mists of dragon lore the toltec teachings volume 3",
        "description": "Focusing on techniques of spiritual development and awareness of the presence of spirit in ordinary life, Robbins challenges the reader to move beyond spiritual blockages and obstacles and raise the vibrational frequencies that bring us to greater enlightenment. This reduces negative emotions such as despair, meaninglessness, and unhappiness. Robbins wants to help us increase our pro-social activity thereby contributing to a more open-minded service towards others. In this book he shows how to use effective techniques for practical and spiritual change while following a path of heart.",
        "authors": "['George Robbins']",
        "infoLink": "https://play.google.com/store/books/details?id=qqAhEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Mists of Dragon Lore is the third volume in the Toltec Teachings series by Theun Mares. In this volume Theun continues \"disclosing the inner teachings of this ancient tradition\" and he specifically \"reveals the true nature and application of The Mastery of Awareness and the Art of Stalking.\" As a nagal, or leader of warriors, Theun teaches us how we can live our lives as warriors of Freedom and gain immeasurable benefit from any and all challenges in our lives.This volume is a clear and pragmatic treatise on the common dream of humanity, how to wake up in this dream, and ultimately how to achieve freedom in this awakened state. Other topics such as shifting the focus, true combing of shadows, going beyond the veil of time, and safely accessing the 4th dimension are also covered.I say, with all my heart, that Mists of Dragon Lore has been one of the most important books that I have read. It has been, and is, very instrumental in my life as I am discovering my full potential. I have read the teachings and I am applying the principles covered and, without a doubt, my transformation is directly proportional to my living these teachings.This book is the quintessential manual for anyone who is serious about waking up in this common dream and \"surfing life's challenges with skill and joy.\"I more than highly recommend this book!Leonardo S. Burton",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "It is amazing to observe how people understand what the Path of Freedom has to be. Most of them are fascinated by the field notes of Carlos Castaneda, paying very little attention to the essence of what the mighty nagual Juam Matus is teaching. Most of them think that the Path of Freedom is a journey to Disney Land, not noticing that this is a journey to nowhere. Looking forward to meet with magic and sorcerers, allies and flyers they do not see numerous mirrors along this Path reflecting their illusions, frustrations, social conditioning. But there are those who have passed further on the Path of Freedom experiencing and LIVING according to the Teachings of Toltecs and only they are able to bring to man-kind true Knowledge as clear and pure as possible. For me Theun Mares is one of these MEN and this is clear from his books written in scientific language, with heart and with full awareness. His works are guide-books to one's TRUE Self, helping to learn how to work with emotions, with mirrors, with relations. How to live and to be really happy in every environment. Theun never says that the Path of Freedom is an easy and secure way of leaving. Through his books he is teaching that this is the only way of man-kind to grasp the meaning of its existence and the role it plays in the Universe.If I need a secure hand to lean on on my journey to Freedom I will choose Theun's.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book holds many keys that can unlock a persons full potential. It is down to earth, practical and applicable to anyone interested in/living the Toltec teachings. The concepts and clarity offered are amazing and powerful, such that words fail to express the beauty and purpose within. One must experience this on their own!This book turned my life around. It guides one into developing their own personal power in a practical way. Reading it brought me to working with Theun, and I can honestly say that life for me has never before been so rich, fun, uplifting and joyous!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "from intellect to intuition",
        "description": "The development of the intellect, while necessary, is a means to an end. The intellect should become a means of penetrating into new dimensions of thought and consciousness, and of awakening the intuitive faculty of \"pure reason\". Through occult meditation the gap is bridged between the threefold mind and the intuition.",
        "authors": "['Alice A. Bailey']",
        "infoLink": "https://play.google.com/store/books/details?id=f98JxdBCs4gC&source=gbs_api",
        "review": [
            {
                "review/text": "Trained in psychology, I tended to take an intellectual view of the world and the people in it, and to put aside what is known as &quot;female intuition.&quot; Of course, this is NOT what this book is all about. Here we're talking of the fruits of meditation, the work of the Soul, so to speak. In this book Alice Bailey explains the mental training we have all experienced, both in the East and in the West, due to our education and socialization. We have been using our brains the way society wants us to use them...without having access to the truths that we can discover by using the brain in meditation so that Universal Truths may be recognized as they are. A good primer for learning meditation, FROM INTELLECT TO INTUITION brings us through the stages and helps us make the necessary mental and emotional adjustments, albeit with practice and not only with reading.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "Alice Bailey wrote this book under the tutelage of the Master Djwhal Khul (the Tibetan), a Master of the spiritual &quot;Hierarchy&quot;, headed by the Christ. These books comprise genuine, albeit advanced teachings about the Ancient Wisdom (this book however was written by Alice Bailey herself, and is a good introduction/less complex).Spiritual advancement can be expedited by these teachings to those willing and able to learn and grow spiritually. Most of what we know and have been taught about spirituality, the after-life, God, angels, souls, and spiritual evolution is basically erroneous information (analagous to children realizing their is no santa claus or easter rabbit when the higher truth is revealed). This has been further distorted by misguided zealots of all faiths, who accept as dogma the distorted and biased teachings of man-made theologies, and not the one true universal Religion of the Ancient Wisdom (as revealed in the Bailey books). The spiritual truth and reality has been kept alive (besides the Ancient Wisdom) by the mystics and secret esoteric shools throughout the ages. However, even they only have portions of the whole spiritual truth. if you read the Alice Bailey books and are unable to comprehend them fully, another (intermediate) area of study is recommended- Rosicrucian/AMORC (800 88-AMORC).Also recommend reading (besides all the Alice Bailey books)- Vera Stanley Alder; Zachary Lansdowne; Douglas Baker; Cecil A. Poole; Raymund Andrea; Henry Guy (&quot;Saving the World&quot;); Three Initiates (&quot;KYBALION&quot;).",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "Thinking that intuition was a \"gut\" feeling is really instinct. After studying this book, intuition is beyond thought. Intellect is important. However, intuition is something that is very rare and is 1000 times faster than thought. Will be studying this book for a long time to come. Developing intuition is a process that requires much more than the emotional component most people think is intuition.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A.A. Bailey's books usually contain very rich, yet hard to understand information. The effort of reading it is as important as the content itself. This book is perfect to begin reading A.A. Bailey. It sets the basis to understand the concepts of intuition, intellect, and meditation. It also brings practical exercises to begin daily meditation. This is not a commercial manual, or light reading. It's for people who already know the path they want to take, and who are serious about it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "from the caves and jungles of hindostan",
        "description": "In addition to founding the Theosophical Society and playing an influential role in the New Thought movement, the controversial and idiosyncratic figure Madame Blavatsky was a tireless world traveler. In this engrossing volume, Blavatsky recounts her time spent traveling in India during an expedition that took place in the late 19th century.",
        "authors": "['H. P. Blavatsky']",
        "infoLink": "https://play.google.com/store/books/details?id=CfcFFyy7gE0C&source=gbs_api",
        "review": [
            {
                "review/text": "'From the Caves and Jungles of Hindostan' offers an intrigueing travelogue through nineteenth century India revealing a culture whose uncanny developments in the metaphysics of mind in the material world are today shedding light upon far reaching intuitions. The way Blavatsky reveals India without the fogs of mysticism but through an insightful first-person narritive makes this an exellent introduction and captivating look into the exotic world of Hindustan. It's truly adventuresome and fascinating. For anyone looking into the anthropology of ancient and modern India this book will prove insightful, or for those looking to escape into an exciting travelogue. Blavatsky and her traveling companions are both intellectual and charming. I've had this book for a number of years and I continuously comeback to it for its wonderful wealth of thought and adventure.",
                "review/helpfulness": "44/44",
                "num_reviews": 44
            },
            {
                "review/text": "Read this more for its artistic value than its historical accuracy...it is a delight for any true follower of HPB's life and times and invaluable look at India from a traveler's point of view.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "In this wonderful book Blavatsky takes readers on a trip to India through the great schools of the esoteric Indianan methods of the occult. We go straight to the source led by a master into the most powerful and obscure experiential knowledge of the metaphysical. The revelations and their implications are truly amazing.What I love the most about this book is how comprehensive and practical it is. It covers so much ground. It contains a lot of specialized knowledge that boosts your spiritual development many levels higher, and the methods are very clearly explained.I strongly recommend this book. My increased study of the metaphysical and the occult has led me to discover that the best knowledge tends to be found in the older books like this one. This is an extremely important work, and I cannot stress this enough. It's truly a rare and special masterpiece.The author unlocks the great mysteries and lays it all out for us in this book, which I found it to be most empowering. You just won't find knowledge like this anywhere else. Blavatsky takes you straight to the top and shows you the ways of the great masters. I can't recommend this book enough. I firmly believe it to be indispensible.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a most compelling work. I loved the author's account. I thought it was beautiful, intriguing, and inspiring. What she describes are the most powerful metaphysical techniques I have ever read about, and the results of putting these into practice are highly beneficial.Readers can benefit immensely from this book. It's absolutely jam-packed with information. There is always something new to learn, and I'm grateful whenever I find a new gem like this one. It explains so much and shows you how to keep on the right track.I've found this book to be incredibly helpful and empowering. I really loved it. It covers a lot of territory in the realm of the esoteric arts, including information on the most obscure and secretive ones... even the unheard of ones. I learned so much from it. It's highly advance but written in a way that even a beginner can understand.This is a wonderful work that I intend to recommend to all my friends. I firmly believe I was led to this book, which is an amazing and rare find. It will take you on the most incredible and empowering journey into a secret word that we still have much to learn about. This book will show you the way.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have just been to India and found some of the cultural aspect hard to fathom. This book explains it all and is a fantastic journey. Very enlightening and I would recommend it to anyone who wants to visit or learn more about rural India. I wish I had a map so that I could follow their journey.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "siddhartha an indian tale penguin twentiethcentury classics",
        "description": "A bold translation of Nobel Prize-winner Herman Hesse's most inspirational and beloved work, which was nominated as one of America's best-loved novels by PBS's The Great American Read A Penguin Classic Hesse's famous and influential novel, Siddartha, is perhaps the most important and compelling moral allegory our troubled century has produced. Integrating Eastern and Western spiritual traditions with psychoanalysis and philosophy, this strangely simple tale, written with a deep and moving empathy for humanity, has touched the lives of millions since its original publication in 1922. Set in India, Siddhartha is the story of a young Brahmin's search for ultimate reality after meeting with the Buddha. His quest takes him from a life of decadence to asceticism, through the illusory joys of sensual love with a beautiful courtesan, and of wealth and fame, to the painful struggles with his son and the ultimate wisdom of renunciation. This new translation by award-winning translator Joachim Neugroschel includes an introduction by Hesse biographer Ralph Freedman. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "authors": "['Hermann Hesse']",
        "infoLink": "http://books.google.com/books?id=2UyB0P3b9KAC&dq=Siddhartha:+An+Indian+Tale+(Penguin+Twentieth-Century+Classics)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Siddhartha is both a western and eastern tale. Though it was written by a westerner, it has the soul and power of an ancient eastern myth. It is at once a timeless story and one that the reader will wish to continually revisit at different phases in his or her life.Hesse does a remarkable job in capturing the tone, cadence and moral complexity of ancient Indian religious stories. His \"revisionist\" take on the life of Buddha is at once fresh and familiar to anyone who has read the sermons of the Buddha or who has studied ancient Hinduism and Buddhism. The themes of self-doubt, denial, asceticism and spiritual rejuvenation are both profoundly and cleverly handled in Hesse's superb narrative. In many ways, this is a book that serves as a summation, and improvement on, all of the religious texts one has read. The fictional aspect allows Hesse to interweave common literary devices, such as heroic journeys and coming-of-age revelations, to make the text, as a whole, much stronger and more impacting than a dry sermon.Siddhartha's narrative works as a cycle, with each chapter offering commentary on the vices and victories of mankind and the ultimate futility of the material world. Like the river that Siddhartha comes to love, the book flows, and never missteps or hesitates in reaching remarkable insights into the nature and philosophy of humanity.This is a book that will stay with the reader for a lifetime. Its simple structure belies a greater complexity; be sure that this book leaves the reader with no easy answers, but it is sure to inspire thought and joy.*A note on translations:-For readability, flow and consistency, I find the Joachim Neugroschel translation to be the best of the many options. It never feels forced or awkward and the introduction by Ralph Freedman is also a wonderful asset to understanding the importance of the story. Neugroschel seems to best capture the ebbing German of Hesse's original, while also capturing the tone of an Indian sermon.-The Sherab Chodzin Kohn translation is also well-done, though I find it slightly overstated in certain parts.-The oldest translation, by Hilda Rosner, is the most commonly available version, though I find it to be clunky, awkward and halting. Avoid it, if possible.-A newer translation by Susan Bernofsky has received good reviews, but I have yet to read it.-Finally, two low-grade translations by Applebaum and Edwards should be avoided.",
                "review/helpfulness": "66/66",
                "num_reviews": 66
            },
            {
                "review/text": "Seriously, if you're gonna read Siddhartha, this is certainly the edition to get -- the slightly oversized Penguin Classics one.It features a useful (35-page!) introduction by Ralph Freedman, which includes suggestions for further reading.The translation by Joachim Neugroschel -- a new one -- also reads swiftly and naturally.There are no footnotes for the text itself, however.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book is your road map to ultimate inner-peace and an understanding of what this whole existence is all about. It will make you realise that there's really little need for religions of any kind. No need for the latest Guru or Teacher. No need to be anything other than who you are, because as you are, you are already there. Get this, you get a life. Not everyone will &quot;get it&quot; but those who do will never need anything else.If you're really interested in finding out about it all, then get this book. It's the only one you'll ever need, providing you \"get it\".",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Did you ever feel sensational beauty about every word you read? This is the book that returned me the harmony of my inner world.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a book that will appeal to anyone who wonders &quot;what it's all about.&quot; Hesse has masterfully captured the essence of a wandering soul in Siddhartha's character, someone who seeks meaning and understanding in all its forms.This book is even more applicable to modern day society than when it was written. We are confronted with millions of choices in our lives and it can often be difficult to discern the correct path; often with respect to the materialism and consumerism that permeates American society. So, take a few hours and peruse Siddhartha...forget about the rat race and imagine life as an ascetic.Truly a sublime book, highly recommended.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Like many people, I first read Siddhartha in high school as a part of my study of Buddhism and Hinduism. It wasn't until this second reading that the book made an impression on me. Siddhartha is a young man who spends his life looking for the way to Nirvana. He begins in the forest, living a life of a samana, a wandering ascetic, begging for food and spending his days in meditation. His eventual meeting with the Buddha has an unexpected effect on him: he realizes that teachers cannot really teach him anything. Therefore, it is up to him to find his own way to salvation.The book is short, and is made up of two parts, before the Buddha, and after the Buddha. Each chapter has a very particular meaning, and the plot is very well contained within. This adds to the story and gives it the feeling of a sacred text. Although most of the minor characters are not well-developed, it is very clear that their very existence is only to help Siddhartha on his journey. Otherwise, they are not important. Each character has something to give Siddhartha, and each adds to his understanding of the world and of himself.This book will appeal to anyone interested in Eastern religions and philosophies, or to anyone who is themselves a spiritual pilgrim. It is very similar to Paulo Coelho's The Alchemist in its plot and feeling. It's also easy for even a reader who is not familiar with religious doctrines or language - Hesse does a beautiful job of making the spiritual and philosophical content very clear and easy to understand. However, this does not mean that it has been \"dumbed down\" in any way. In fact, the writing is intelligent and evocative, and the story is wholly engrossing.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Herman Hesse's Siddhartha poeticizes the truth-seeking endeavors of a protagonist who overthrows convention and becomes more religious. Ultimately, Siddhartha abandons Brahmin, ascetic, and materialistic pursuits. Siddhartha's eventual enlightenment, by crystalizing his conversion journey, mirrors Hesse's Western perspective - which revels in the vital role of individualism in achieving religious fulfillment. Siddhartha expresses that regardless of a person's past sins or social status, any person can have a continued personal experience or an embodied understanding of his or her role in the world. Across a Buddhist, Hindu, post-World War I, philosophically-vibrant, and Western canvas, the nearly-biographical story paints a final deeply intimate connection with an immaterial force.Herman Hesse's Siddhartha is a portrait of a man seeking self-knowledge and in the process; he is seeking a new transcendental, universal, and spiritual framework that is communal in content and individual in conquest. Ultimately, Siddhartha's humbleness, awareness and empathy -coupled with his escape from materialistic misery- enable him to attain an enlightened lifestyle, a unity with the universe, and an entrance into a greater community of humanity. This fulfillment is the result of independent seeking and living, as well as the mastery of collective Brahmin, ascetic, and practical teachings. The story imbues the Western notion of self-teaching. Siddhartha becomes more religious, as a result of the author's introspection. Hesse's individual spiritual success creates an inspired literary piece that compels readers to attempt to either establish or appreciate a continued personal experience or an embodied understanding of his or her role in the world.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "this book is simply amazing! and when i say simply, i also mean that it is an interestingly simple book... very short and concise... and yet filled with so much knowledge and meaning... it really is a treatise on life itself.this book truly is a two way conversation. you just cant help wondering, asking new question you've never asked before... some books are strictly written for the excitement, making them a one way conversation, the author just telling you things and there is nothing you can say that will make what he (or she) said better... but this book, as i said, truly is the opposite of that.read the book and you will know where I am coming from... it is a great book and worthyto be read by everyone...",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is an excellant book for people seeking answers to living life to its fullest. Siddhartha learned the lessons the hard way and through his journey we then learn those same lessons and find out just how simple they really are. I recommend reading this book again as most of us have probably read it years ago.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have always had a fascination with religion and philosophy and have studied western thought extensively, but have only scratched the surface of eastern thought. I have been working my way through a variety of literature and decided to give Siddhartha a try. I realized that it was written by a westerner, but knew it had good reviews by many easterners.I initially expected this novel to be a fictionalized retelling of the Buddha story, since Siddhartha is one of the names of the Buddha. But it turns out that this is a story of a contemporary of the Buddha that meets him and his story actually follows many of the elements of the Buddha's life.This is an allegorical tale that packs a lot of meaning into a fairly short novel. The introduction by Freedman was helpful in showing many of the hidden meanings that I wasn't aware of. I also thought the translation was very easy for me to follow and understand.Overall, I gained many insights from reading this book. There were several character traits highlighted that I don't think are discussed in our society enough. When he talked of his ability to think, fast, and wait; I though of how important these characteristics are. In our society, thinking is highly valued, but fasting and waiting are almost totally neglected at this point. I think of these as self control and patience. There were several other gems in this book that caused me to think and reflect.As a westerner, there were some thought processes that I didn't agree with. I don't believe in extreme asceticism. I believe in learning self control, but not to the extent where you are totally focused on yourself. I believe that the true path to peace and happiness is losing oneself in the service of others. The best method to do that is by raising a family and participating in your community. Having said that, I believe that this book did bring out several profound truths for me. I highly recommend this short book.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "mahamudra vol i",
        "description": "This guidebook for cultivating the meditative practices of stability and insight-the first major work from the Drukpa Kagyu lineage to become available in English-stands out among works of its kind as one of the clearest and most comprehensive presentations of coemergence, or mahamudra. In it, the eighteenth-century Tibetan master Ngawang Kunga Tenzin, the Third Khamtrul Rinpoche, details a step-by-step program of spiritual exercises that bring the meditator directly to clear realization of the fully perfect, ever-present, nondual nature of mind. Beginning with the close relationship between phenomena and mind and the immense benefits of meditating on the nature of mind, the Third Khamtrul Rinpoche offers careful instructions on the four yogas of mahamudra together with advice on how to recognize genuine progress and how to remove obstacles that arise during meditation. Characteristic of the Drukpa Kagyu approach is that, even from the earliest stages of training, the author explains how all experience, thoughts, and perceptions may be used as the path to enlightenment from the perspective of insight into the nature of mind.",
        "authors": "['Khamtrul']",
        "infoLink": "https://play.google.com/store/books/details?id=rUjUBgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book, p. xxi: \"represents the advanced doctrine and practice as understood and realized by the Kagyupa Order of Tibetan Buddhism.\" It is a translation of the 16th century \"Moonlight: An Excellent Elucidation of the Meditational Stages of the Ultimate Great Seal\" abbreviated as Moonlight of Mahamudra (source text for Thrangu Rinpoche's commentary, \"Essentials of Mahamudra\"). \"This extraordinary treatise provides not only a wealth of knowledge but also methods for realizing enlightenment.\" The translator provides an extensive Introduction including a brief synopsis of the book. The author, Tashi Namgyal (1512-87) was a member of the Takpo Kagyu meditational order or lineage. This book includes tons of quotes from Sutras, Tantras, & Masters, noting conflicting opinions & with explanations thereof, presenting an -\"exhaustive elucidation of the metaphysics and the meditation of Mahamudra.\" His (p. 413) \"excellent treatise\" and \"elegant literary composition\" does just that; it explains The 9 Stages of Tranquility (frontispiece)-(I obtained this diagram in Lhasa) & explores existence, dependent arising, relation to Madhyamaka philosophy, types of meditation, Sakya Pandita's criticisms,, condensed & elaborate explanations of Mahamudra (MM) meditation, relation of karma to MM (p. 287), \"elevating the mind to the path,\" the 12 levels of the 4 MM Yogas in the greatest detail I've seen including their relation to Tantric grounds/paths/(bhumis), post-absorption, & non-conceptualization. He calls his approach \"The Mahamudra of Ultimate Certainty.\"More specifically, Namgyal explains the nature of intrinsic reality such that (p. xlviii): \"The deities and mandalas are not external entities but a kind of psychological geograph of our mind\" & (p. 218): \"Alas, the 6 levels of sentient beings are Emanations of deluded minds\" and describes the interrelationship of Mahamudra & Vajrayana/Tantric methods: while Gampopa (Milarepa's #1 disciple & 1st Karmapa's master), p. 112: \"considers Mahamudra to be a separate path and independent of the sutras and tantras\" & p. 123: \"did not make the esoteric empowerment a prerequisite for receiving the Mahamudra teachings,\" (p. 124): \"Lately the followers of this meditative order adapted Mahamudra to the practice of Tantric mysticism...Since these Mahamudra meditations incorporated Tantric elements, practitioners are required at the outset to receive ...initiation.\"He provides the best description I've seen (p. 350) of the 3 groups of meditators (and their realizations): great (instantaneous), average (evanescent), and ordinary (gradual) and states that (pp. 123 & 144): \"A great medicine for gradual seekers Becomes a poison for instantaneous seekers. A great medicine for instantaneous illumination Becomes a poison for gradual illumination.\"He provides excellent descriptions of techniques: (p. 280): Mindfulness \"is done in the same way an experienced cowherd watches his cattle. Without rounding them up or following every animal, he keeps them all under his observation, letting them graze freely, even though some may wander,\"(pp. 334-5): the 5 practices of self-transformation to sublimate adverse conditions: \"To behave--like a wounded deer\" (shun companions); \"a lion\" (not fear internal/external obstacles); \"the wind blowing through space\" (let thoughts flow freely/openly without any attachment); \"space\" (unfocussed meditation without any support); \"a crazy person\" (without objective direction, attachment to anything, or value judgments), and (p. 335): bringing dualistic thoughts to the illuminating path, and even mentions ch&ouml; [ch&ouml;d].",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is the best, most complete, most beautiful guide to meditation practice that I have ever seen. It is a marvelous, profound work that covers the Sutric paths of meditation from the perspectives of theory and practice. Richly documented with citations from Sutra and Shastra, this magnificent work illuminates the path with clarity and precision. I am extremely pleased to see that it is coming back into print. Highly recommended.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the vedanta way to peace and happiness",
        "description": "Geared towards individuals seeking to enrich their lives, the timeless teachings of an ancient tradition encourage spiritual growth by inviting critical inquiry, encouraging honest doubt, and providing realistic explanations of the mysteries of the spiritual quest.",
        "authors": "['Swami Adiswarananda']",
        "infoLink": "http://books.google.nl/books?id=xEwdEv1U9acC&dq=The+Vedanta+Way+to+Peace+and+Happiness&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I'm over sixty now. I've been reading books about \"the path,\" the search, the quest, about meditation, all sorts of wisdom traditions - all that, since I was still a teenager in the sixties. I have stacks of wise books taller than I am about Zen, about Taoism, Buddhism, Chaung Tze, Lao Tze, about how to meditate, what to eat, what this or that famous wise person taught... Then I was looking in the public library for a biography of Ramakrishna when I found this book. I started reading it.\"When the student is ready, the teacher will appear.\" Isn't that how the old saying goes?This book is written in clear and easily understandable terms which make the content of the teachings accessible to the western reader. The message is timely and sympathetic to the challenges we face these days. It contains practical advice that anyone can put to good use and into action RIGHT NOW.I HIGHLY RECOMMEND THIS book to anyone interested in meditation, yoga, Vedanta (of course) Hindu or Buddhist wisdom, AND to any seeker on the path. You know who you are. Wait, come to think of it, perhaps you don't know \"who you are\"... so, find out. Read this book.Namast&eacute;",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "You know, one thing I always feel is, of what use is religion, What ever the religion may be, if it doesn't better the quality of the life we live, doesnt pull us out of the difficulties and challenges we land ourselves in. . Usually the vedic interpretations are too metaphysical and tedious to understand and relate. Here is a surprisingly wonderful interpretations of the millennia old wisdom of the Vedas as applied to our day to day lives. It takes you step by step from the challenges of the modern world or the Technology Age to its woes, the reasons and how to overcome them in a more generic way. This could be life changing. Swami Adiswarananda has epitomized the spirit of his Guru.Enjoy!!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "An excellant book. Well written. Easy to understand. Clearly delineats a philosophy and lifestyle that is possibe and desireable ti follow. A musr read.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the art of joyful living meditation and daily life",
        "description": "This book shows how to maintain a joyful view of life and how to transform habit patterns.",
        "authors": "['Swami Rama']",
        "infoLink": "http://books.google.nl/books?id=7or8L3fsclkC&dq=The+Art+of+Joyful+Living:+Meditation+and+Daily+Life&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The more I read Swami Rama the more I have to recognize the power of simplicity and its richness. I am one of those who like to intellectualize a bit, but when I get confused enough all there is to do is go back to this very simple book. This book does not requiered any esoteric knowledge of yoga but just openess and sincerity from the reader. If you haven't read it, I almost envy you for the sweet pleasure waiting for you. Once you will have tasted Swami Rama's teachings I suggest you visit www.swamij.com , a treasure chest of informations and guidance by one of (if not the) closest disciple of Swami Rama.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book can be read over a hundred times! There is always something new turn learn from it. A book for everyone seeking peace and thoughtfulness.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book can be understood by anyone, not just those interested in esoteric, spiritual practices. It's full of true wisdom that can be applied to daily life. It gives very sensible advice.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I first encountered Swami Rama years ago, while working at a spiritual bookstore. His Autobiography, \"Living with the Himalayan Masters\" was an inspiration and much more modern and accessible to me than many enlightened masters autobiographies. Considered a great sage and master, Swami Rama, born in 1925, was raised from childhood in a cave monastery, by a Master who allowed him to study with all the adepts in his monastery and area. By his twenties he was a famous singer, and the youngest Shankaracharya (spiritual leader) in Southern India and studied at several European universities, and taught in Japan. He also started an Ashram in India and founded The Himalayan International Institute of Yoga and Science and Philosophy. Having studied in the west and performed countless scientific experiments verifying his minds control over his body, he combines the eastern teachings with a nod to western science, philosophy and religion, making them applicable to any walk of life or philosophical system. I highly recommend all of his books but this is one of my favorites.In this classic, he tells us how to find, know and transform our true self and live a positive life that acknowledges our humanness, while striving for perfection. This is accomplished through an understanding of ones self, negative emotions and habits, while strengthening ones willpower, memory, intuition and spirituality. He teaches us how to have spiritual and loving relationships, gives a simple no-nonsense approach to becoming your own therapist, and an example of good parenting, all through a simple basic understanding of meditation and self exploration.A simple core lesson from this book is that we often \"blame others and expect others to make us happy. No one else has the capacity to make you blissful, your mind is your own mind\" Swami teaches us that it is our own \"Samskaras\" or the collective soul experience (kind of like a basement in your subconscious) and how we react, or control these, that make us happy or unhappy. By \"journeying within\", anyone can come to an understanding of ones own distorted thinking process and train, change or improve their life direction, finding a way to joy and happiness. One can discover within the self the source of negative and positive thought forms and how they affect our emotions and then use this knowledge to retrain our minds into being happy.While this is an \"Art\" that takes time and energy, and perhaps a life time, its practice will result in self actualized transformation and manifest in our external and internal happiness, thus changing our own world and perhaps the world of others around us.I highly recommend this book to anyone of either a western or eastern philosophical approach. Even a psychologist, might find a simple approach to behavioral change for clients by using these applicable techniques. If art imitates life, then ones life is surely the most valuable of art forms and worthy of discovery.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "norito",
        "description": "This book presents, for the first time, a collection of ancient Japanese Shinto prayers in a format where English speaking readers can both understand the deep meaning of the translated text and can also pronounce the original Japanese words. Shinto is an ancient spiritual tradition, primarily practiced in Japan, which is now spreading its traditions to the western world. Its primordial rituals and traditions touch a deep chord within one's spiritual self. Shinto's focus on divinity of all beings and of all creation, on living with gratitude and humility, and on purification and lustration of one's self and environment will bring light and joy to any reader. The purpose of prayer and ritual as practiced in the Shinto tradition, is to reinsert ourselves into a divine state of being, not as a new position, but as an acknowledgement and reinforcement of what already exists. Ritual restores sensitive awareness to our relationship to the universe. Through purification and removal of impurities and blockages, we return to our innate internal brightness and cultivate a demeanor of gratitude and joy. Shinto rituals and prayers were created by ancient man over 2,000 years ago in a time when mankind was more intuitive about his relationship to this world. Because of this, the rites are archetypal and invoke deep emotion within the participants. This book of prayers will introduce the western reader to the deep spirituality of Shinto, providing explanation of the spiritual tradition and practice and providing a collection of 22 prayers for use in personal meditation and devotions. Order a perfect bound version of Shinto Norito",
        "authors": "['Ann Llewellyn Evans']",
        "infoLink": "https://play.google.com/store/books/details?id=QUpSHAVOGTIC&source=gbs_api",
        "review": [
            {
                "review/text": "The Japanese religion of Shinto has no holy book, no guide for how to live a moral life and achieve glory in heaven. It is very much a \"this worldly\" religion, trading worship of the kami in return for blessings on crops and weather. The traditions of worship, the calls to the kami for their blessing, have been handed down through the centuries and remain some of the little Japanese writing unaltered by outside influence.In \"Norito,\" Donald L. Philippi has gathered together these calls to the kami, these prayers, from many ancient sources such as the \"Engi-shiki\" (\"Procedures of the Engi Era,\") the \"Nihongi,\" the \"Kojiki,\" the \"Hitachi Fudoki\" and the twelfth-century diary of a Fujiwara nobleman. He has brought them all together into this single book, and undertook modern translations, attempting as much as possible to retain the intended flavor of the original, without allowing the Western way of thinking about religion to influence the translations. The norito are heavily footnoted, introducing the formal thinking of the Emperor and the royal family, and the role of the kami deities. Reading these original prayers helps frame an understanding of Shinto, and the culture that spawned it.In addition to this valuable collection of norito, Joseph Kitagawa provides us with a lengthy opening preface discussing the norito and \"The \"Strangeness\" of non-Western Traditions.\" This article, with insights into the norito, their origin and evolution, is as interesting as the prayers themselves.My only complaint of \"Norito\" is that I wish it were a bilingual edition, with the original Japanese norito included along with the translation. The ability to compare the original along with Philippi's interpretation would make a great book even better.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Few books can match Donald Philippi's \"Norito\" in its ability to transport us back to the very earliest days of Japanese history and thinking. This slender volume provides as fine an understanding as it is possible to obtain of Japan's original conceptions of religion. In the centuries that would follow the era that these \"songs\" represent, Japan would be transformed by the Buddhism introduced from China. By this process of cultural sharing, a native religion (Shinto) that had existed without written texts or formal doctrine, without much real estate or a church hierarchy, would be changed forever, losing its essential innocence and intimate relationship to nature.Philippi's \"Norito\" would be especially well teamed with a reading of Michiko Aoki's translation of the \"Fudoki\" (\"Records of Wind and Earth\"). This eighth-century gazeteer of regional information provides, far more than the contemporaneous and now better known \"Kojiki\" and \"Nihongi\" histories, a view of early Japanese life still relatively untouched by outside influences.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]