[
    {
        "Title": "sticks",
        "description": "From New York Times bestselling author and master storyteller Patricia Polacco comes the uplifting tale of three inseparable friends who pursue their talents and stop at nothing to achieve their dreams. Based on her own childhood memory, author Patricia Polacco shares the pivotal story of one year in elementary school. On the first day of school, she breaks out in a rash and is called \"Cootie\" by her classmates. It seems like the year will be a disaster for Patricia until she meets Thom and Ravenne. Each of the friends have their own talent. Thom, with his long legs and graceful manner, loves to dance ballet earning him the name \"Sissy Boy.\" Ravenne makes kits and paints on fabric, but she's shy that people call her \"Her Ugliness.\" Thom, Ravenne, and Patricia are bullied by their classmates causing the three friends to band together for support. For years after that fateful year, encourage each other to stay true to themselves and achieve success in their passions. This endearing and timely story celebrates uniqueness and proves that no matter what challenges stand in your way it's your differences that make you who you are.",
        "authors": "['Patricia Polacco']",
        "infoLink": "http://books.google.com/books?id=rAL8DwAAQBAJ&dq=Sticks&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Hey! People if you want an exciting and extraordinarily funny, but realistic fiction story by the great author named Joan Bauer, I recommend the book Sticks. The 2 boys in the book are the main characters. Mickey Vernon is 10 has freckles, blisters on his finger sand Arlen Pepper has glasses, carries his calculator, and a protractor that why everyone called him the math wiz. He is very intelligent with any kind of math and science. Ever day Vernon always got beaten the big fat bully named Buck Pender.Once in the pool hall of Cruckston, New Jersey [Where Mickey's family lived] when Mickey was young, he wanted to be the pool best player like his dad who had died. Arlen and Mickey are searching for secrets of pool. One day Vernon `s grandmother Poppy stuck up a poster that said,\" 10 to 13 Year Old Pool Tournament\". Absolutely. Mickey was going to join, but he'll have to be much better in pool because Buck is joining, too. Days went by, but something strange happened at the pool hall. When Mickey is practicing pool a man with reddish beard came to Mickey and tells him that Mickey will win the tournament. The next morning day when Arlen and Mickey are walking Buck and his ugly friends came to block Mickey and Arlen from walking. The man from the pool hall came with his green truck and scared the bully off. One day that man came to the pool hall and talk to Ruthie [Mickey's Mother]. Mickey and his sister Camille were watching them as they talk. Then Ruthie introduce the man to Mickey and Camille who his name is Joseph Alveraz one of Mickey's dad best friends. Mickey rushed to him and asked him if he can teach him pool? He said, \"Yes\". Ruthie sigh and said, \"Okay\". They both together play Ping Pong and archery to make Mickey focus. Days went by until something bad happened. Joseph has to go to someplace away from New Jersey, before leaving he said not to play a single match with Buck. What do you know? Mickey didn't obeyed Joseph's command. He played a game with Buck and loses and other bad news Mickey broke his left arm because Buck slammed him on the floor. The doctor said it will cure in 3 weeks and real bad news that the day that the tournament is starting. Will our Mickey Vernon be able to practice only for a week to win the tournament? If you want to know, go ahead buy the book Sticks by Joan Bauer and you'll not be bored ever.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Sticks is a wonderful, heartwarming story about the struggles of a young boy becoming a young man. Mickey must confront internal conflicts created by the death of his father, a nationally recognized championship pool player. It is difficult for Mickey to live up to his father's reputation because everyone compares his pool game to his father's. Also, he faces external conflicts with his arch rival, the town bully, in a pool tournament. Just when things look bad for Mickey, a mysterous stranger arrives in town offering to help Mickey with his pool game. Is the stranger a former friend of his fathers? Read Sticks by Joan Bauer to find out.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "phase 10 a rummy type card game with a challenging and exciting twist",
        "description": "Not available with blister packaging. Will be supplied with a Hang Tab only.",
        "authors": "['Blister Pack Staff']",
        "infoLink": "http://books.google.com/books?id=djQDAAAACAAJ&dq=Phase+10:+A+Rummy+Type+Card+Game+With+a+Challenging+and+Exciting+Twist&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Myself and about five other people were sitting around in the living room area of a cabin after breakfast one morning in February trying to decide on something to do. We didn't want to go out because it was far too cold and nothing was open yet anyway. So someone asked if anyone in the room wanted to play a game of Phase 10. Everyone readily agreed to play the game. The rules were explained, the cards were dealt and four or five hours later we finally had a winner. The game is a lot of fun and the time goes by quickly. By the time we realized how long we had been sitting there playing it, nobody could really believe it.The girl who brought the game to the cabin said that it's more fun if you have a lot of people playing but it also takes longer to play it. It goes by quicker with less people.This was the first time that I had ever even heard of this game. After the rules were explained I was still a big confused as to how to play, but after the game had gotten started I caught on pretty quickly.This is a good rainy day game when you can't go outside. Or for one of those days when you're stuck at home with a few friends, your siblings and/or your parents and don't know what else to do. It'll definitely kill a few hours or so of boredom.I love games. I have a closet full of board games that I can't get hardly anyone to play with me. Maybe I'll have better luck with getting someone to play Phase 10 with me since there's no board to have to drag out and set up.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "It sounds simple at first. Be the first to complete 10 melds, or phases, in order. You can only complete one phase per hand, and if you fail before the round ends, you must try again. And it is, at first.As you go along, each round gets harder to complete, giving those who are behind a chance to catch up. But each hand also starts to take longer. And that's my biggest complaint against the game. It takes forever to finish. In fact, I don't know if I've ever finished a game because of time constraints.This is a challenging and creative card game. Just be ready to play for a while, because you'll need the time to complete all 10 phases.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a very good card game. It is mainly luck of the draw but there is some skill involved at times. I will say that I just finished a game, no, we didn't finish, but we were going on playing for 4 hours straight. WARNING! Don't play with too many people, you will suffer a game of great lengths. Although, I have played games that took more than one day to complete.This game is very fun though. Great for those camping trips, family get-togethers, long rainy days (like today). I highly recommend. The only bad thing I have to say is that the games can go on, and on, and on....but that is easily dealt with. Give it a try if you're a fan of UNO, Skip-Bo, Rummy, etc...Enjoy!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I was introduced to this game a couple years ago by my housemates at University. Not being a card person I was rather skeptical but within ten minutes I became a P-10 devotee. It's a great game that kids and adults can play together on equal terms, and is mindless and simple enough to do over drinks (or just drinks) after dinner- no strategy to muddle up the conversation. We spent many a happy winters eve huddled round our kitchen table cheerfully cursing the lucky players and wearing the heck out of our deck.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Phase 10 dice is probably the best game they'll come up with this century and it's only 2007. It's durable, compact and can be played just about anywhere, and oh yea it's loads & loads of fun!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Great game. Everyone we invite to play this game buys one to play themselves. If you can find an older version of the game, the cards are much better to play with. The newer version has thin cards that get damaged easily and tend to be a little slippery. Buy it at your local discount shopping center, it is usually three to six bucks.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you are looking for a challenging game that is easy to learn, Phase 10 may just be what you are looking for. We encountered this card game after Thanksgiving dinner ... it seems complicated at first but once you get started, you want to keep playing.If you like Uno, Rummy, Yahtzee, Poker.. it's all of these games meshed into one.We are addicted now and play weekly.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I love this game and bought one to teach my grandkids. The quality of these new phase 10 cards was poor. The cards are so thin that they easily bend and get folded over when used by children. I was disappointed with them. My older deck of Phase 10 cards was much better quality and are still in good shape.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am a 21 year old female and, growing up with a large family, we always played games at family gatherings-Phase 10 being one of them. This is a game that may take a little bit to understand, but once you do, it is fun for everyone. Kids of all ages can play and it is also fun for teenagers and adults as well. Basically the game in a nutshell is that there are \"10 Phases\" that you must complete in order to win. Everyone starts on the first phase (these can be anything like getting two sets of three, four of the same suit, etc) and the first person to get the phase wins that round. That person advances to working on the next phase, while the rest of the group has to try and complete the one they did not master. First one to complete all 10 phases wins.I love this game and I would suggest anyone buying it that wants to have a great time!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "winning blackjack without counting",
        "description": "Mr. Lucas has been dealing Blackjack in several large Casinos for twenty years, and has been personally playing Blackjack for over thirty years. He as a B.S. Degree in Business. His goal is to inform people how to be better Blackjack players that win more and find more joy in their Casino experience. In his free time he enjoys sightseeing, photography,eating out, and landscaping his acreage. He has practiced Zen meditation for forty years, which he gives much credit for giving him the focus, concentration, and steadiness to do the many years ofresearch for this book, and for much of the personal happiness he enjoys.",
        "authors": "['John Lucas']",
        "infoLink": "https://play.google.com/store/books/details?id=JgA1eLKbZqUC&source=gbs_api",
        "review": [
            {
                "review/text": "I play blackjack for a living, and that means before I decided to do so you need to seperate the good from the bad books. I'm not the person to tell you what to do relating towards your goal playing blackjack, but one year after me trying to get it done the easy way, I,m glad that I switched to cardcounting. Remember do no think that blackjack is a easy money program. Many system sellers are making only money from selling books, or working indirectly for casinos. Any form of progression betting will get your cash in the longrun. I know from the early years of me playing blackjack that playing any form of progression you are able to winn money in the short run, but it will burn you out playing into the longrun, and I played too Popik's theory. But you can't compare a flip of a coin with 2 outcomes with a game of blackjack where you have 13 different outcomes relating to your hands.I play about 100 hours a month, 1200 hours a month. It is not about the no. of sessions you winn, but the no. of hours.Using Popik's system I won a majority of the sessions playing it in 1991, but the sessions I lost, I lost all what I won related to my winning sessions before. This is happening to all forms of progression play.Therefore I would suggest you to start reading work from Stanfort Wong, Lance Humble, Arnold Snyder or Peter Griffin.Again, I want you to winn but If you will ever decide to choose the profession I choosed you will realise that playing fulltime any progression system will hurt you playing about 1200 hours a year.",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "After listening to my friend explain his card counting methods -- I was impressed (actually amazed at his winnings) but discouraged to think I'd have to spend that much time and energy to beat the dealer at a game of Blackjack.So I found a book for the non-counter by Donald Dahl titled Progression Blackjack. A worthwhile read, but while using his strategies playing online, I quickly saw that the systems were &quot;missing something.&quot;Then I read &quot;Winning Blackjack Without Counting Cards&quot; by David S. Popik! It's a real eye opener! He simply and powerfully shows that BJ is not a game of chance when certain rules are adhered to.... But MORE than that, he teaches a truly brilliant system for consistently beating the house! It's so simple a 12 year old couldn't lose with this strategy. The book's about an hour's reading time (or a little more to carefully go over all the numbers -- the author carefully documents all his findings)In my first game online after reading this book, I won over $500 in less than 2 hours. Don't miss this one!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is fantastic. It is an easy read and a logical system based purely on mathematics. It does require some discipline, but when followed the system has proven to be profitable and substantially easier than learning to count cards. Will be useful to the occasional player as well as the consistent player.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book, unlike the standard, much publicized books on progression betting, places bets based on probabilities of winning and losing streaks. The bets are placed at specific intervals rather than just teasing the odds and leaving the same bet out as the odds continue to diminish against winning.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Yes...forget the math. As we know, you cannot make a progressive betting strategy pay off \"in the long run\". Playing blackjack can, and should be a series of short runs. With David's approach to progression, you can make money. I say \"can\", not \"will\". The key is money management and quitting when you're up.I've tried David's system in a combination of simulated play (using a reliable simulator...you know, the one counters train with) and actual table play. I've logged 240 sessions, with almost 11,000 hands played. I'm up 500 units. While that's not the \"long run\", I feel I can make the system work with David's 3 to 1 approach and good money management (loss limits, pull plateaus, discipline and reasonable win expectations). Heck, I wish I were bankrolled enough to use $100 units. If I can make 2.4 units per hour as an average over, say, 100 hours...well, I'd sure be doing it.Why does it work? Probably because it's the real world, and the player controls when he leaves or stays. There is some real world reality to streaks and clumping.Why do I give it a 4 and not a 5? I think the math contains some fuzzy logic (as a previous reviewer points out). It could be about a twenty page book...but then, would it have any credibility?I liked it and would recommend it to casually serious non-counting players.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "blackjacks hidden secrets win without counting",
        "description": "Short, concise and to the point. This blackjack book doesn't beat around the bush. It's easy to read, simple to understand and uncomplicated to apply. You can be playing, with this no card counting system, in just an afternoon and taking advantage of its 78% win average. Blackjack's Hidden Secrets, Win Without Counting shows you how to determine the exact amount of money you should bring to the casino and how to spot hot and cold trends. It will have you automatically betting more when you're hot, less when you're not and teaches you when to leave. Winning at blackjack is more than a possibility, it's a proven mathematical fact! This system also has its very own tutor card, which can be taken to the tables with you, so you'll never feel alone or lost for answers.",
        "authors": "['George Pappadopoulos']",
        "infoLink": "http://books.google.com/books?id=3LAwPQAACAAJ&dq=Blackjack%27s+Hidden+Secrets,+Win+Without+Counting&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Mr. Pappadopoulos explained his system on a local Spokane radio station recently to sell his book and it worked.. I've met many folks around the BJ tables in this town who now use his system. The layout of his book is equally cunning in that it prefaces his &quot;hook&quot; with a legitimate concept.. Basic Strategy. The problem is that the &quot;hook&quot; is yet another progressive betting scheme that any true blackjack expert will tell you does not give you any more of a statistical advantage than Basic Strategy alone will give you. As you surf Amazon.com for a good blackjack book, remember one thing above all else: You cannot gain an advantage over the house without using a statistically proven card-counting system. To do so, go the the experts: Wong, Schlesinger, Uston, Clayton, Thorpe, Revere, etc.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I play blackjack, ALOT of blackjack. I have lost alot of money playing blackjack and I have seen &quot;professional Counters&quot; lose alot of money playing blackjack. I always felt there was a way to beat the game, but could not find it. After all, we would not play the game if it did not give us the Illusion that you can win. The casinos know this, and so does George!!! He has discovered what I knew existed but could not find. Do you want to win money playing blackjack? Read His Book!!!!It is easy to understand and learn and it works!!!!If I had this information, I would not sell it for less than $5,000. I know, I am winning more money than I have ever won playing this game. This is the only book you need to win!!! This is the truth. It has been table tested!!!!!",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "I was a bit skeptical about ordering Mr. Pappadopoulos's at first. But, I decided to gamble and order it. To my surprise, this guide was extremely easy to understand and it made REAL sense. It's all summed up in a short amount of time. After using Mr. Pappadopoulos's system, I went from a 1/3 ratio of winning to a 4/5 ratio of winning. I now have all the confidence in the world to be an expert winning blackjack player and I owe it all to this book! I definately recommend it! (It really works! )",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "moral calculations game theory logic and human frailty",
        "description": "What does game theory tell us about rational behavior? Is there such a thing as rational behavior, and if so, is it of any use to us? In this fascinating book, renowned Hungarian economist Laszlo Mero shows how game theory provides insight into such aspects of human psychology as altruism, competition, and politics, as well as its relevance to disparate fields such as physics and evolutionary biology. This ideal guide shows us how mathematics can illuminate the human condition.",
        "authors": "['Laszlo Mero']",
        "infoLink": "https://play.google.com/store/books/details?id=b2Z3BQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Mero's book is an interesting read, and is a very good non-mathematical review of the basics of game theory and its relationship to human ethics. I suspect that its translation from Hungarian led to its sometimes strange choices of words, but on the whole, it is a good way to get a sense of the surprising generality and importance of the subject.Unfortunately, the book is marred by Mero's expansion of game theory into a &quot;theory of everything&quot;. By the last chapter, he has gone from straightforward applied mathematics into fuzzy-headed mysticism. At this point, the book has become more embarassing than interesting. My suggestion is to read the first half of tbe book and forget the rest!",
                "review/helpfulness": "45/49",
                "num_reviews": 49
            },
            {
                "review/text": "I found this book compelling: an understandable, non-dogmatic, open-minded, non-technical yet scientific look at how mathematical game theory might be applied by someone trying to behave morally in a universe of limited resources. The concepts are clearly stated without jargon in such a way that people with little aptitude or patience for mathematics will remain interested throughout. An important book for anyone interested in morality at any level.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "In this book, Mero adds some flesh to game theory, explaining why so many people become entranced with how it sets up economic and social choices as toy puzzles, in which people are trying to get the best possible outcome.In particular, he explains some of the more infamous non-zero-sum games: the dollar auction, in which a dollar bill is auctioned off, but with a twist - both the highest bidder and the second-highest bidder must pay their bids, but only the highest bidder gets the dollar; and the prisoner's dilemma (and its variants), in which cooperation is the best result for the 2 players combined, but there's the danger of being undermined by the other player and individually losing everything. The dollar auction is likened to an arms race (indeed, the U.S. won =that= particular dollar auction against the Soviets), where what is being bought is military supremacy between superpowers. The prisoner's dilemma can be likened to a situation like a lane closure on a busy highway: if one merges in turn, and everybody else does, traffic keeps flowing somewhat; however, if only one person zooms ahead and merges ahead of where they should in fairness, the traffic can still go on fine and that one zoomer gets a benefit over the other drivers. But if =everybody= tries to cut in line... traffic clog.It is true that trying to extend game theory to morality is a tricky business, and as another reviewer has put it, the book gets downright embarrassing towards the end. However, I am a math teacher, and have used ideas from the book to put more =oomph= in my classes on game theory to gifted teenagers. There isn't much in the way of math in here, but plenty of rational thinking and can lead a little light on to why game theory research has led to the winning of a Nobel Prize in Economics (or two).",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "1998 was a crummy year. The single, sole exception to that is Meros' book, &quot;Moral Calculations&quot;. In laymans terms, Mero makes a compelling arguement in a branch of mathematics called Game Theory what constitutes a moral decision. I have read this book five times, and before 1999 is over, I will read it several more times. For anybody who has ever argued over the morality of a decision, you MUST read this book. I hate the cliche of a &quot;brilliant read&quot; but this book has that hallmark. Don't let 1999 pass before you sit down over a long weekend, and reread this book.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Laszlo is a master game theorist who is also able to convey the essence of many other complex and abstract fields and explain those concepts vis-a-vis game theory principles.The many fields which he observes are1) Evolution - the debate between group selection and gene selection2) Bluffing - Can there be a formula that can help you bluff.3) Human behaviour in auctions.4) The play between Socialism and Free Enterprise or competition-cooperation in societies and economies.5) Hawks and Doves - is there a mathematical necessity to have both elements in a society as it evolves.6) Quantum physics - why do electrons behave or are observed to be behaving according to principles of quantum physics. Is that the electrons behaviour or is that behaviour its existence.7) What principles of decision making does our conscious and unconscious mind follow?8) And finally a great comcept that amazed me - mysticism or meditation and its comparison with scientific thought. How eastern concept of meditation, which is based on transcending the mind, compares with the goedele's theorem which says that a system of rational thought can be insufficient to explain everything within that system.The book does get difficult to read towards the end but for most part Laszlo manages to simplify concepts of immense complexity in simple language.It's a joy to read and will reignite the scientific thought as well as mystic curiosity in you.Laszlo Mero, A Big Thank You for this effort.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is fascinating in how it demonstrates what we do in politics, science, and even meditation can affect our rational (and irrational) decision making processes, both individualy and in community.I actually got referred to this book by a website that discussed Game Theory and when I went to Amazon to purchase it, I was amused by the reviewers on Amazon that were horrified that the last of the book covered Meditation/Mysticism. Thats what absolutely convinced me to buy it. I am a scientist and I am practicing meditation, I see both sides.Mero does a great job of showing how Game Theory can explain the Rational and also show how irrational we are. He practically predicts why the reviewers that didn't like the last parts of his book are the way they are, which of course made them say the things they say in the review!As the famous ad says, Just do it.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "The first half of the book was absolutely terrific and I am glad I book, however, it gets a little scattered toward the second half.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "The book is divided into three parts:I. Introduces some concepts from game theory, psychologyII. Gives examples from fields of economics, physics, biologyIII. Discusses rationality and irrationality.I found the first two parts both helpful and easy to read. They weren't technical at all, there isn't a single formula in the book. However, the last part is very hard to read and understand. I had to re-read some sentences several times and am not sure if I followed the author correctly.Overall, I would suggest reading the book - it won't take much time and you can learn such concepts as evolutionary stable strategies, mixed strategies. Also, presentation of some concepts from physics and economics is interesting.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "bear memories the chicagogreen bay rivalry il images of sports",
        "description": "\"Halas would provide food according to how we had fared against the Packers. If we won, it was steaks for everybody. But if we lost, we were lucky to be served hamburgers.\" --Harlan Hill, 1950s \"I didn't have any particular grievance with any of the Packer players, I just wanted to beat them all.\" --Hall of Famer Doug Atkins, 1960s \"Doug Buffone took me aside to tell me about Green Bay games . . . to set me straight about the importance of the rivalry. It definitely was not a game to be taken for granted.\" --Brian Baschnagel, 1970s \"Each year at the start of the season, fans we'd meet would just have the one request--please beat Green Bay.\" --Jim Flanigan, 1990s",
        "authors": "['Beth Gorr']",
        "infoLink": "http://books.google.com/books?id=RVpd48ubBtsC&dq=Bear+Memories:+The+Chicago-Green+Bay+Rivalry+(IL)+(Images+of+Sports)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was purchased by myself for a Valentine's gift for my husband. My husband is a real Bears'fan. He hasn't missed a regular season home game since 1962 and has a great memory for the details of the games. He was extremely disappointed in all the mistakes in the book. He said it was unbelievable that a book would contain so many errors. Misspellings of names, player identified incorrectly in caption, incorrect statistics for the 1963 season, and incorrect gate site location are a few of the many errors.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Beth Gorr's BEAR MEMORIES: the Chicago-Green Bay Rivalry is a true labor of love and a first-rate job of reporting. She got the men who counted - they who were in the trenches and on the sidelines for the NFL's most enduring as well as endearing rivalry.For the story of the Bears and Packers rivalry is a matter of love. Love of combat, love of competition, grudging respect for the bums on the other side of the ball and the other sideline. Love for all they and their predecessors have stood for and defended since George Halas and Curly Lambeau faced off for the first time in 1921 when Green Bay joined the league the Papa Bear founded the year before in that Canton, Ohio Hupmobile showroom.Ms. Gorr has captured the essence of that marvelous rivalry, must reading for all fans who love the game of pro football. Unfortunately, all her magnificent efforts were marred by one of the sloppiest jobs of copy reading and editing imaginable. Blown captions and misspellings cannot be overcome. They stand out like sore thumbs, throb like toothaches, and annoy the reader. She deserved the same first rate treatment from her editors that she supplied with her outstanding manuscript.Still, read it and enjoy. You cannot go wrong.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "casino craps strategies for reducing the odds against you",
        "description": "Learn the ins and outs of craps to beat the casinos and win more money. Of all the games in the casino, only one allows the player to engage the house in a fair fight. Craps, when played intelligently and prudently, reduces the house advantage to a miniscule .6 percent, a margin that can be overcome with smart betting and simple money management. How could casinos afford to offer such a winnable game? What's the catch? For players willing to devote a little time and patience learning the ins and outs, there is no catch! Here is the most comprehensive, expert, and reader-friendly guide to casino craps ever written. Robert R. Roto, a documented lifetime winner, has dissected the odds like a surgeon and formulated several systems of variable risk and aggressiveness-all guaranteed to maximize the player's chances of winning. Whether you are betting with $5 or $1,000 chips, whether you play \"right\" or \"wrong,\" whether your strategy is to come in on the Pass line and then switch to Don't Pass, or you employ the \"just did-do that\" session rule, Roto will teach you how to milk the casino odds for every percentage point possible. Too many players refuse to learn the nuances of the game, insisting instead on fattening the casino's bankroll. Wouldn't you rather join the author in the winners' club?",
        "authors": "['Robert R. Roto']",
        "infoLink": "http://books.google.com/books?id=b137DQAAQBAJ&dq=Casino+Craps:+Strategies+for+Reducing+the+Odds+Against+You&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Robert Roto has written the most authoritative analysis on how to beat the game of Craps. With his in-depth analysis of how to play, calculating the odds, and effective money management, anyone can now beat the dealer at the craps table. &quot;Casino Craps: A Guide to Successful Strategies Reducing Casino Odds&quot; has been written for the novice and expert alike. This is a breakthrough work on this exciting game, and is a must read for anyone who plays the game.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is a great book for beginners or casual players. It gives great descriptions of the bets available to players and also gives good statistics on the bets. Not so great though for strategy. Wouldn't use the strategies they suggest, but I would use the explanations of the bets and the risk associated with them.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is the best book I ever ever read on this subject. The concepts are laid out in an easy to understand format. It is an excellent book for the novice as well as the experienced player. I especially like the way the Mr. Roto supports his ideas with statistical evidence.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "differential games a mathematical theory with applications to warfare and pursuit control and optimization",
        "description": "One of the definitive works in game theory, this volume takes an original and expert look at conflict solutions. Drawing on game theory, the calculus of variations, and control theory, the author solves an amazing array of problems relating to military situations, pursuit and evasion tactics, athletic contests, and many more. Clearly detailed examples; numerous calculations. 1965 edition.",
        "authors": "['Rufus Isaacs']",
        "infoLink": "http://books.google.nl/books?id=XIxmMyIQgm0C&dq=Differential+Games:+a+Mathematical+Theory+with+Applications+to+Warfare+and+Pursuit,+Control+and+Optimization&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the original book on differential games. It is as relevant today as when it was written nearly 40 years ago. The book introduces all the main concepts and equations in differential games. This is achieved without recourse to heavy theorems or proofs. A central feature is the use of many and varied examples of differential games; the homoicidal chauffeur, wars of attrition, pursuit with a rocket, etc. These bring the whole field alive with potential. Another element is the use of geometry and pictures to describe game evolution. This book is a must for anyone interested in modern autonomous systems.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Accounts some of the game theoretic problems encountered by Isaacs during his work at the RAND Corporation. A must read for scholars interested in game theory. Has a lot of interesting cases of military and non-military applications.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lotto winning wheels for powerball mega millions",
        "description": "The 2006 second edition of Gail Howard s book, Lotto Winning Wheels for Powerball & Mega Millions, has several systems that let you wheel all 55 Powerball numbers and all 56 Mega Millions numbers. Wheeling means choosing a large group of numbers which you simply place in the lettered boxes. Your numbers are magically (mathematically) combined into the correct sets of numbers to cover a specific win guarantee, ready to mark on your play slips. There is no easier way to scientifically combine your lotto numbers. So simple a child can do it. Fast and easy to use as A-B-C! And affordable, too. Systems in this book range in price from $2. Of the 190 systems, 87 cost $20 or less to play; 46 cost $10 or less, and 17 cost $5 or less. All the systems have guaranteed wins which means specific minimum win guarantees. The minimum and maximum number of multiple prizes possible to win (both with and without the 6th number) is shown for each system in the book. The minimum win guarantees are mathematically correct, totally accurate, flawless, without holes. Guaranteed! Use these systems also for California SuperLotto, Kansas Super Cash, Hot Lotto, Wild Card 2, Australian Powerball, England Thunderball, Greek Tzoker, India Thunderball and Turkey Sans Topu.",
        "authors": "['Gail Howard']",
        "infoLink": "http://books.google.nl/books?id=H_bcAAAACAAJ&dq=Lotto+Winning+Wheels+for+Powerball&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book, because I thought I will get some new insights on the big money lotteries, but I do not think there is anything of value there. I have the older book of Gail Howard; used to play Fantasy 5; 2 of 5 and 3 of 5 are the highest prizes I have ever won. Do not get caught by the hype: This book won't tell you how to win the big money lotteries - in fact, all that Gail Howard says is that it's very difficult to predict the Powerball ball, and the Powerball ball cannot be wheeled anyway. Guess I shouldn't have spent my money to learn that... The book is no different from her previous book, Lotto Wheel Five to Win. Well, the new one has some shorter wheels than the previous one (that is why I give two stars), but if you are into wheeling, you will be able to find them elsewhere. The book has a very long section (some 20+ pages) of ads about Howard's other books and software. Hey, you pay for that too! You'd be better off spending your $$ on a couple of extra tickets...",
                "review/helpfulness": "31/37",
                "num_reviews": 37
            },
            {
                "review/text": "Since I brought the book and read the book I won the Jack pot. Not only one time but twice.... 5.8 Millon- Plus 120.00 millon..... Thank you Gail... My family and friends said that I was wasting my money I told them that I wasn't they all laugh at me and told me that I was a fool by buying that book... Now look at me I am a millonaire. this Friday night I am going to play one more time.",
                "review/helpfulness": "11/18",
                "num_reviews": 18
            },
            {
                "review/text": "Amazon has in stock, ready to ship, the 2006, 2nd edition of the Powerball and Mega Millions book. To get the new edition for the 55 and 56-ball games, type the ISBN number: 0945760418 in the search bar and it will come right up.",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "I found her concept very, VERY good, BUT, unless you're really flush and can afford to spend a great deal of money for a LOT of number combinations per game, it certainly doesn't increase your odds much. Now... there ARE folks who can afford, and DO buy, many ticket combinations per game... so for THEM this may be helpful; however, for the average person who buys only a few number combinations each game, this is a waste of time. Sorry Gail :o( !!",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is nothing new from Gail Howard, or at all. These wheeling systems can be worked out mathematically, without paying for this book. There are also lots of websites that offer number generators and wheeling system explanations for free. If you want it all spelled out for you then buy this book, but if you are willing to do a little mathematical work check out lottery information website like [...].",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Waste Of Time & Money... I found that if you want to win big, just put the money into a savings account & watch your money grow! Pay YOURSELF not this author.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "it was and still has been very helpful to know how the system works and just using the book i have been hitting better than i did before",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "THIS BOOK WAS NOT WHAT I HAD WANTED THAT WOULD HAVE BEEN HELPFUL TO ME.TOO COMPLICATED FOR MY LEVEL OF UNDERSTANDING.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book cuts down the odds with a better chance at winning lottos games. Very informative with many game wheels for all wallets. A must have if you want a better chance at winning than watching others win and wish it were you.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I purchased this book thinking it would tell a lot on Mega Millions but found out otherwise. The book is mostly on Powerball.Didn't go into the book much so I can't comment on that. I have returned it already.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the stag hunt and the evolution of social structure",
        "description": "\"The possibility of a successful solution depends on the coevolution of cooperation and social structure. Brian Skyrms focuses on three factors that affect the emergence of such structure and the facilitation of collective action: location (interactions with neighbors), signals (transmission of information), and association (the formation of social networks).\"--Jacket.",
        "authors": "['Brian Skyrms']",
        "infoLink": "http://books.google.com/books?id=JykQZ9-wkcAC&dq=The+Stag+Hunt+and+the+Evolution+of+Social+Structure&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Brian Skyrms is one of the few philosophers who has been elected to the National Academy of Sciences of the United States. He is an outstanding example of what seems to me to be a trend in modern philosophy of science, which is to learn the relevant scientific practices thoroughly so that one's contribution as a philosopher is at a high technical level of expertise. This book is accessible to the interested non-professional, but the journal articles on which it is based are quite sophisticated. I am not sure whether we should consider Skyrms' ideas as contribution to social theory, social philosophy, or both. Then again, perhaps it doesn't matter.Skyrms' preferred method is to take a simple two-player game like the stag hunt or the prisoner's dilemma and explore the implications of repeating the game, playing it on a lattice, allowing player strategies to evolve, and otherwise enriching the game's structure to better approximate some forms of real social interaction. Skyrms is above all an explorer rather than an exhaustive taxonomist. He wanders through the forest of exotic plausible assumptions for two-person games, stops here and there to admire a particularly interesting specimen, and the moves on. This is a delightful approach for both the casual reader, who is not interested in complex details, and the professional student of game theory, who is tired of taking a highly specific game and absolutely beating it to death with forays of analytical purity.One serious limitation of this book is that Skyrms is almost single-mindedly concerned with two-player games, whereas understanding human social life requires n-player games for fairly high n (at least 20 in some important cases). While a deep understanding of two-person games does shed light on behavior in larger games, it also can be very misleading. Certainly human society is much more complicated than one might infer from the workings of the prisoner's dilemma, the stag hunt, and the hawk-dove game.I also believe that Skyrms' major point in this book is just dead wrong. In the Preface, Skyrms says \"If one simple game is to be chosen as an exemplar of the central problem of the social contract, which should it be? Many modern thinkers have focused on the prisoner's dilemma, but I believe that this emphasis is misplaced. The most appropriate choice is not the prisoner's dilemma, but rather the stag hunt.\" (p. xii) Now, the stag hunt is a pure coordination game of the following form. Suppose there are n players (Skyrms prefers two players, but any n will do). If all players \"hunt stag,\" each will receive an payoff of 1000 calories of meat. However, if any player decides instead to \"hunt rabbit,\" the stag hunt will fail, and all players will get no calories except the rabbit hunter, who gets 100 calories. This is a coordination game, or an assurance game, because a player can be assured of getting 100 calories no matter what the others do (by hunting rabbit), but if the players can coordinate so all hunt stag, they will all do much better.Skyrms defends his statement that human social life is basically a stag hunt-like coordination game as follows. At first sight, social cooperation seems to be a prisoner's dilemma, or in the n-player case, a public goods game. In this game, by cooperating an individual helps all the other members of the group, but at a cost to himself. Therefore, a self-regarding player will never cooperate. It follows that social cooperation requires altruistic players---people must cooperate even though this is personally costly and the others alone benefit from one's prosocial behavior. It is easy to see why the public goods game is an allegory for social cooperation among humans. For instance, if we all hunt, if hunting is dangerous and exhausting, and we must share the kill equally, then a self-regarding hunter will prefer to shirk rather than hunt. Cooperation in this case requires altruistic hunters. Skyrms' point, however, is that if the game is repeated indefinitely, then cooperation among self-regarding agents is possible using what are known as \"trigger strategies.\" A trigger strategy for a player is to cooperate on every round, as long as all other players cooperate as well. However, the first time one player defects, the trigger strategy dictates that all players defect on every succeeding round. It is easy to see that in this case, even selfish players will cooperate on all rounds, because the gains they have from defecting on one rounds may be swamped by the losses incurred by not benefiting from others' efforts on the succeeding rounds.Why is Skyrms wrong? Note first that the repeated prisoner's dilemma or n-player public goods game (the latter is just a prisoner's dilemma with n players) is not really a stag hunt game at all. The stag hunt game has exactly two equilibria, one where everyone hunts rabbit and one where everyone hunts stag. The repeated public goods game (rppg) has an infinite number of equilibria! For instance, suppose it costs 100 calories to generate 1000 calories for the other players. Now suppose in a ten player repeated public goods game, all players cooperate on all rounds, except player 1, who defects on all rounds. With an obvious alteration in the trigger strategies of players 2 through n, we still have a Nash equilibrium of the rppg. This is because 9,000 calories are generated in each period, so each player gets 900 calories, and players 2 through 10 only expend 100 calories, so they have a net gain of 800 calories and hence are willing to participate. Now, by varying who participates and how much, we can generate an infinite number of equilibria for the rppg. In game theory, this is known as the Folk Theorem of Repeated Games.Despite the fact that the stag hunt is not exactly the same as the rppg, Skyrms would be correct in principle if it were true that the rppg were a coordination game, like the stag hunt. But the rppg is NOT a coordination game at all! In fact, in the rppg, a self-regarding player has an incentive to shirk if he can get away with it; i.e., if others do not observe his shirking. This is not the case in the stag hunt.Economists generally treat the Folk Theorem as a brilliant solution to the problem of cooperation among many self-regarding agents, and Skyrms is here merely following their lead. My study of the Folk Theorem, by contrast, shows that the Folk Theorem is no solution at all, except for groups of size two, or larger groups under generally implausible informational conditions (see my book, The Bounds of Reason, Princeton University Press, 2009). The reasons is that cooperation in the rppg requires that each player send a very accurate signal to each other player indicating cooperation or defection, and the same signal must be transmitted to all players if they are to coordinate in their manner of reacting to a defection. When different players get different signals (e.g., when each player sees only a subset of the other players) and/or when the signals have a significant probability of being inaccurate (e.g., a hunter worked hard but by chance failed to be successful in the hunt), the cooperative equilibrium to the rppg will not exist, or will exist but will be extremely inefficient.The implication of Skyrms' position for social theory is quite dramatic. If he were correct, it would follow that humans could cooperate very effectively even if they were perfectly self-regarding, with absolutely no need for altruistic preferences, empathy, no predisposition for cooperating and sharing, nor any other prosocial behavior that goes beyond simple mutualism: An individual would help the group only as a byproduct of helping himself. In fact, there is a great deal of evidence that humans have fundamental other-regarding preferences, including a predisposition to follow legitimate social norms, and to make personal sacrifices on behalf of the group if they perceive that others are make such sacrifices as well.My reading of the empirical evidence is that humans have evolved a cognitive psychology that allows for \"team cognition.\" Team cognition means that humans can understand that they are part of a team, that all team members have the same team goal, and that other members also realize this. Most animals completely lack this form of cognition, or have it only to a severely limited degree. The writings of Michael Tomasello offer, to my mind, the most persuasive evidence on team cognition. However team cognition has nothing to do with the stag hunt. In groups of several agents, even with team cognition, it will usually be the case that one of the group can defect and the project will still be worth doing, and hence will benefit the defector. Thus, team cognition will generally be embedded in games of the public goods type, for which altruistic motivation is required for success. This altruistic motivation is a social psychology that leads individuals to cooperate with others even when there is a personal cost, so long as others are doing the same. This implies that to sustain cooperation in a social group, we need a lot more than to simply coordinate on the high-yield strategy. We need a social system that fosters a sense of morality that includes caring about others and sacrificing on behalf of society. When that morality is absent or in disrepair, life will be \"poore, nasty, brutish, and short,\" to use Hobbes' famous words.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Skyrms weaves together insights from game theory, evolutionary dynamics, computer simulations, and philosophy to address a crucial question: Where does trust come from? When do the trusting get ripped off? When do the trusting succeed? How can societies be set up so that they're more likely to build trust?Skyrms walks the reader through the key technical tools, so most college-educated readers should have little trouble following the key ideas. And the payoff is large: You'll think things you've never thought before about the nature of cooperation.I'd recommend reading this book along with Axelrod's classic Evolution of Cooperation to get a sense of where the serious study of society is heading. Since life in the modern rich countries depends so much on trust--trust within firms, trust across branches of government, and trust within communities--Skyrms's combination of big-picture thinking and cutting-edge rigor provides a great way to learn about this poorly-understood social phenomena.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "blackjacks hidden secrets win without counting new expanded edition",
        "description": "Short, concise and to the point. This blackjack book doesn't beat around the bush. It's easy to read, simple to understand and uncomplicated to apply. You can be playing, with this no card counting system, in just an afternoon and taking advantage of its 78% win average. Blackjack's Hidden Secrets, Win Without Counting shows you how to determine the exact amount of money you should bring to the casino and how to spot hot and cold trends. It will have you automatically betting more when you're hot, less when you're not and teaches you when to leave. Winning at blackjack is more than a possibility, it's a proven mathematical fact! This system also has its very own tutor card, which can be taken to the tables with you, so you'll never feel alone or lost for answers.",
        "authors": "['George Pappadopoulos']",
        "infoLink": "http://books.google.com/books?id=3LAwPQAACAAJ&dq=Blackjack%27s+Hidden+Secrets,+Win+Without+Counting+(New&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Listen to the reasons this book has been getting 4 or 5 starts here. \"I didn't know there was a basic strategy - this is great!\"Duh!\"Other books show how to count cards. That's hard. This book shows any easy way to win with money management. That's easy.\"People, you can NOT win with money management. One of the reasons Blackjack is hard to figure out is that you can NOT learn from experience how to play. You would have to play millions and millions of hands, and record the results of every single hand, before you could figure out the correct plays.This game has already been figured out with mathematical proofs and huge computer simulations. I quickly perused this book in the book store (took about 15 seconds, because it's about 12 pages long (exaggerating just a bit)), and it's got plenty of errors, while the basic strategy tables are found in ANY book, folks! Don't waste your time. If you really want to win, you have to eithera) find a game with such good rules (almost always a single deck game) that you have an advantage even playing basic strategy. Good luck finding such a game.b) count cards, or at least pay attention to the cards.For the easiest approach (and a very good explanation of basic strategy), try Cardoza's book WINNING CASINO BLACKJACKFOR THE NON-COUNTER. Even here, you must find a single deck game with good rules, that gets you close to even with basic strategy, and then watch for a lot of low cards coming out early, and then betting higher. Otherwise, you have to count. For an easy counting system that is mathematically proven, try Knockout Blackjack.Folks, if you want to believe you can win by some betting progression or money management system, please do. The casinos will stay open with your business. Just because you won does not mean you have an advantage. You are still playing a losing game. Blackjack has HUGE variations in winnings, so your experience PROVES NOTHING. Great players can lose in the short term, and lousy players can win in the short term. \"Short term\" means less than about 10,000 hands, or about 1,000 hours of playing (that's playing for 4 hours a day, 5 days a week for about a year.) If you come out ahead after that time, then come back and write a positive review for this lame book. Otherwise, knock it off people.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "I couldn't believe it when I found it this book. I had tried card counting, the cheat cards, and a few other strategies (that I made up). I couldn't beat the casinos. Maybe once a awhile I would win, but more often I would lose. I read the book and couldn't believe how easy it was. I won 5 out of the last 6 times I played. I just wanted to let anyone else interested in blackjack know that this is the book to read! I don't need luck any more. I have George on my side.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "The most valuable information in George's book is essentially how to be a disciplined blackjack player, which is most valuable indeed. Think about it though. If there was a guaranteed way for the average non-card counting Joe like you or me to win consistently at casinos, casinos would soon cease to exist. What about George's 78% win average? Well, that's according to him of course. But consider this: when you use his system you've had a \"winning\" session when you win 50% of your original stake. You've had a \"losing\" session when you've lost 100% of your stake. Therefore you can end up with a higher percentage of winning sessions than losing sessions, and still end up in the hole. George doesn't say he sees a consistent 78% monetary return on all his blackjack investments, just that he sees a 78% \"win average.\" Plus, no betting system can gain or lose you money. How does one hand know what was wagered on the last hand?However, I rate this book highly because of the many positive lessons it teaches about gambling in general. Although George's system cannot guarantee you will win money, it is still a system which requires discipline, proper playing technique, and a strict betting and money management formula. He emphasizes fundamentals that are paramount to having a successful ride at any gaming table: do not drink, don't bet hunches or feelings, bring only a certain amount (depending on table limits) to each table, walk when you win or lose a certain amount. If you can follow all George's disciplines, you will definitely increase your chances of winning. Hopefully you will have a good time as well and not walk away broke, having spent five times as much as you intended in half an hour.George is an Everyman, and his short book is a good read. From reading his books and hearing him on talk shows, I think he has a great personality, and very much speaks to the average or casual gambler like you and me. He is a good writer for someone who is not a professional writer. The handy strategy cards can be simply torn out and taken to the blackjack table with you. If you're planning a trip to Vegas or Atlantic City, it can be a fun system to try. Who knows, you may get lucky!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The money-management system described in this book is bogus. You are guaranteed to lose using these techniques. To call this a \"winning system\" is fraudulent. You can't win, in the long run, at blackjack unless you count cards or use other similarly complicated techniques. If you play without counting, you're a sucker; if you buy this book, you're a sucker twice over. Good luck.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I've only read the sample pages on amazon but I have recently ordered it. The sample pages that mention money management is actually what I have been practicing before discovering this book. When playing blackjack I usually start out with twenty $5.00 chips($100). On an average session I can gain 10 chips (10 X $5 = $50). On a good session I can gain 20 chips(20 X $5 = $100). Going beyond that is pretty hard and I start losing or going up and down. On a really bad session I can gain only 4 chips (4 X $5 = $20). Usually on bad sessions I go negative before I can make it all back and get ahead by a little. But I usually do get ahead eventually. After seeing this pattern I figured the only way I can make more money is to start betting larger chips regularly such $25 chips. So my usual $50 gains become $250 and my miniscule $20 gains become $100. I go to the casino once or twice a week and make a couple of hundred dollars within the first half hour inside the casino. Then I leave. If I stay any longer I end up losing my gains and getting stressed out. I'm not breaking the casino or getting filthy rich. However, I've turned the casino into my own modest free ATM machine on a weekly basis.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book has changed my entire perception of gambling in the casinos. I was willing to give this idea of George's a try. After all counting cards is suppose to be difficult and time consuming.With this book the reading is easy to follow and it's a system that allows you to grasp the concept very easily. I'm playing with the mathmatical odds that enable me to win at blackjack, not break the casino. you'll never beat the casinos,but you can win fairly consistently with this system.FIVE STARS is my vote",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I'm a blackjack newbie ... and I KNOW this book will save me hundreds, if not thousands of dollars. George's system is easy to learn (unlike card counting) and remember. Plus, it's a relatively quick read, making it perfect to bring on a plane ride to Vegas or your gambling mecca of choice. If you're headed to the blackjack tables, get this book first! It'll be the best [money] you spend ... and with George's 78% success rate, chances are good you'll recoup your investment.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I met George at a conference and only picked up his book to be polite. Wow! I'm glad I did. This book is very helpful and with its tips and guides, got me over my fear of playing Blackjack. If you want to play Blackjack and actually walk away from the table with some money in your pocket, buy George's book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Not only is George a great guy but he has written a great book! I love it. He is the perfect person to teach people to play. Read his book! You won't be sorry!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a very straightforward book. The author gets to his points quickly and concisely. He doesn't waste words in the 20 pages of text. It was a radio interview Mr. Pappadopoulos did earlier this year with a Vegas radio station that peaked my interest. I was considering learning to card count but after reading this book I am relieved that I found an alternative. I've only used the system in simulation but it does make sense and seems to be a sound progressive betting system. Card counters will not enjoy the book, but novice or recreational players will easily understand the book and flat bettors will profit from using his system. I'm looking forward to testing the system in Vegas when I return later this year!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "win at euchre",
        "description": "Master Euchre, Win More, and Have Fun with Your Friends! Click the READ MORE button to discover more about this exciting card game! When you get your copy of How to Play Euchre, you'll discover all the basics you need to have fun with this fast-paced and social game: How to Deal Euchre Hands What to Put in the Kitty Determining the Trump Suit How Trumps Affect Game Play The Mechanics of Playing Euchre Hands and much more! You'll also find out how cheating figures into the game of Euchre. If you're quick and cunning, you can take advantage of fun actions: Stealing the Deal The Six Flags Move Double Drawing and Reneging You'll even learn how certain players work cheating into the game - and punish those who get caught! This comprehensive guide to Euchre includes a full list of gameplay lingo terms and definitions. You'll also find out how to play seven fun variations like Stick the Dealer and Three-Handed Euchre. With the Euchre strategy tips in this book, you can play, cheat, and bid like a pro! Don't miss out on all the fun! Order How to Play Euchre right away and maximize your card-game skills. It's quick and easy to order - just scroll up and hit the BUY NOW WITH ONE CLICK button on the right-hand side of your screen.",
        "authors": "['Tim Ander']",
        "infoLink": "https://play.google.com/store/books/details?id=0QVaDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Gallagher's booklet has a Gorenesque point system for evaluating a euchre hand. And while that is its most salient feature, its best feature is the second little paragraph in the Introduction: &quot;Euchre is a bidder's game. You must bid at every opportunity. . . . Just to sit back and pass or hope to euchre your opponents is a loser's game. . . .&quot;Another section, the three &quot;Most Common Errors by Euchre Players,&quot; is right on: Passing a biddable hand, failing to lead trump on offense, leading trump on defense. (Trumping a partner's ace is left out, but it is enjoined - in bold type - on the previous page.)The point system assigns four points to a right bower, three to a left, two to each other trump card, and one to each ace in the off suits, for a total of 20 &quot;high card&quot; points. Then the author concludes, and attempts to demonstrate, that you need 10 points to go alone, and that you should order or pick up with a net of 7 points (but need only 5 to &quot;assist&quot; - and that's a flaw, since it encourages a dealer's partner, who normally should keep his mouth shut in order to give his partner a chance to go alone).But the math is a little fuzzy. For example, the author states that if you have 8 points, your opponents have 6, your partner has 3, and the pack has 3. The actual probability is, the opponents have 6.7, the partner has 3.3, and the pack (i.e., the three cards remaining &quot;buried,&quot; or unseen) has only 2. On average each hand is 167 per cent as strong as the pack.The author says, at page 3, that a 10-point hand &quot;cannot be euchred.&quot; Accompanying the discussion of the point system is a one-page chart of &quot;biddable&quot; hands from 7 to 13 points. The chart lists four possible &quot;10-point&quot; holdings, all of which *can* be euchred, but omits two - (1) a left with three other trump and an outside ace, which also can be euchred (by Right-Ace-x of trumps held by an opponent), and (2) a holding of five trumps without bowers, which is the *only* &quot;10-point&quot; hand that *cannot* be euchred. The error lies in ranking a 9, 10 or queen of trumps as high as an ace or king.And the author's assertion that you must have at least 10 &quot;high card points&quot; to go alone seems rather timid from one who says you must bid to win. Natty Bumppo's Columbus Book of Euchre, at pp. 42-43, lists four &quot;8-point&quot; holdings that are excellent candidates for loners, and even a hand of 2 or 3 points that will do the trick on a long shot.None of which is to say the point system is shoddy - by and large, it works. But it is flawed. For further examples:(1) It fails to distinguish between the value of a &quot;next&quot; ace and one of the other color. An ace off color is much more valuable.(2) It fails to evaluate distribution. The Goren point system in bridge gives a void the second highest value, comparable to that of the left bower in Gallagher's euchre system. Also in euchre a singleton ace is worth more than a doubleton ace; an ace heading a three-card suit is virtually worthless, and a two-suited hand has a value not addressed by Gallagher.(3) It gives no value to kings. While a king often has no value in euchre, it has tremendous value in a two-suited hand or if its ace is buried or in partner's hand.Another problem with playing by the numbers is that each euchre hand is situational - it's not only the cards that matter, but also the position (where you sit at the table, which is *so* much more important in a short game like euchre than in a long game like bridge or spades), and the score (many things you will do at 6 or 7, or at 8 or 9, or when your opponents are at 6 or 7 or at 8 or 9, you will not do at other scores). You play by Gallagher, I play by instinct, and I'll beat you.Finally, would it be picayune to point out that the author has the horse on the rider (p. 45)? That he thinks &quot;next&quot; is &quot;Nix&quot;? That he lacks true bravado, or humor, as on page 39, where he writes, &quot;Dealing out of turn . . . is considered poor sportsmanship if . . . done intentionally&quot;? Not in Columbus, where stealing the deal is part of the game!The book is OK; it's interesting. But it is too formulaic: It does not capture the intuition, the essence, of euchre.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Well organized. Comprehensive, but concise. Easy to read and follow. Bidding methodology excellent for both novice and experienced player. Sample hands very useful to aid understanding of the author's bidding system. I thought I was a pretty good and experienced player before I read the booklet, but it improved my game significantly! And, I've seen it greatly help others who were much too cautious in bidding.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I bought this for a gift. Was I surprised to find it was a 31 page pamphlet, with the first 12 pgs nothing but intro and history of euchre. I'm now making a trip to the bookstore to find a book. Don't feel this is worth the money at all.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "annie duke how i raised folded bluffed flirted cursed and won millions at the world series of poker",
        "description": "A top-ranked woman poker player presents an insider's view of the World Series of Poker, in a personal account that describes her academic achievements, impulsive entry into the world of gambling, and insights into strategic tournament play. 150,000 first printing.",
        "authors": "['Annie Duke', 'David Diamond']",
        "infoLink": "http://books.google.com/books?id=IhdaAAAACAAJ&dq=Annie+Duke:+How+I+Raised,+Folded,+Bluffed,+Flirted,+Cursed,+and+Won+Millions+at+the+World+Series+of+Poker&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book intercuts between the play at a huge WSOP Omaha Hi-Low Split poker tourney and Ms. Duke's life story.The method works, but depending on the reader, you'll be rooting for one -- the game -- or the other -- the life story -- to come back.She's from a studious but dysfunctional family: heck they're probably all geniuses, but Mom's drinking and playing solitaire, and Dad's grading papers and trying to break out of his genteel poverty teaching at a prestigious prep school.Fortunately, things get better: her older brother, poker champ Howard Lederer, learns to beat the odds in card games and sports betting. Mom works for him. And Dad writes a series of entertaining, immensely popular, pun-filled books on the English language. (No, I'm not making this up.)Therefore, the book is filled with a harrowing life story, a report on what it feels like to be the final table of a big poker tourney, and poker tips. The poker tips are scattered about the text in little boxes, but they are the real goods from a professional player.Unlike other poker memoirs I've read, this book has a whiz-bang happy ending, and it reads as fast as folding to an allin bet from Ms. Duke.Or, for another point of view on Annie's family, read Poker Face by Katy Lederer, her younger sister. (I told you they're all geniuses.) It's a touching memoir of growing up Lederer, but you won't learn any poker from it.P.S. I wanted a bigger book with more poker strategy. When you learn how well Annie's done at the tables, you know she knows a lot more than she reveals about the game.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "I have been playing poker for several years, and when they started broadcasting the World Series of Poker on ESPN I was hooked from the start. And as happens to most people I immediately took a liking for some players and started hating others. Annie Duke was among my favorites from the start, together with Daniel Negreanu, Chris Ferguson and Gus Hansen. So 2004 was a great year for \"my players\", since Negreanu was player of the year, battling it out with Ferguson, Hansen dominated the WPT, and Annie won the Tournament of Champions.That is why when this book came out I undoubtedly wanted to check it out; and the result was as good as expected. Not only did I get to relive in Annie's own narration some of the tournaments she had played, but I also got to know more about what led her to that place in life. On top of that, she uses a very interesting style in her writing, intertwining the chapters about poker with those dealing with her marriage, studies and kids. While I was reading this book I got the same sense I get from when I see her playing on TV: that she is a very entertaining person, and one that would be fun to have in my poker table (of course, unless my goal is to win some money).Annie also includes text boxes throughout the book that contain poker advice, mostly for newbies, but I found a couple of pointers that helped me become a better player. At the end there is a more thorough explanation about the different types of poker (focused on Texas Hold 'Em and Omaha Hi-Lo) and a brief description of the most prominent poker players that dominate the spotlight nowadays.The book is great, but I cannot help but point out a couple of things that surprised me as being wrong. The first one has to do with the fact that Annie makes reference to another poker pro that carried out a vicious internet campaign against her, but she never mentions him by name. I don't really understand the reason behind this mystery. The second has to do with a mistake she makes when describing an Omaha hand. She mentions having a nut straight, which is accurate, but then she goes on to say that the straight was A-K-Q-J-10 when for this she is using three of her hole cards (A,Q,J), which you cannot do in Omaha. She did have the nut straight, because there was a 9 on the board, and the straight was K-Q-J-10-9. Anyway, this is not a huge deal, but it really surprised me that such an accomplished poker player would make that mistake. Bottom line: she still gets five stars in my book!",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "The name of this book is Annie Duke and it's all about Annie Duke and how she won the Omaha 8 or Better tournament at the World Series of Poker, how she won the Tournament of Champions against a field of very good players, how she had four kids, how she grew up, how she got married and divorced, her anxiety attacks, her almost academic career, her critics, her passion for poker, etc.The part I liked best was when she went into the Crystal Lounge in beautiful downtown Billings, Montana for the first time to play poker against an all-male line up of crusty old ranchers and cowboys and assorted male chauvinists. In one of the first hands she was dealt ace-queen and got a lot action and ended up making a full house on the river. How sweet that must have been!It is also about how Annie kicks off her shoes and tucks her legs under her butt and settles in to play cards; how she punks when she feels panicky, but how once the cards are in the air, she is in no danger of throwing up. The cards and the machinations of the game distract her. This is also about how she wanted so much to be thin and liked and pretty, and how she loved to party.Frankly I don't know what to make of Annie (n&eacute;e Lederer) Duke. Personally I never played cards with her. I don't know whether she wins because she's good at reading people, or because she has an instinct for sharp aggressive play, or because of her experience and understanding of the game. Reading this book I would say all three. Her brother Howard Lederer is a world class player himself, and he taught her a lot. And she paid her dues playing small stakes games.I found it interesting that while playing $50 and $100 hold'em in Vegas she made between $50 and $100 an hour (p. 160). And when she played at home on the Internet she made about $40 an hour. She also writes about losing $300,000 in one week at high stakes cash games (p. 182), and intimates that she bombed out of the $1,000/$2,000 hold'em game at (I presume) the Bellagio. She writes she \"wasn't happy\" playing at that level (p. 189). One thing I have to tell you--and Annie Duke mentions not a word about this subject, not a single word, is that high stakes poker players have an intimate relationship with the IRS and they are always trying to find ways to lay off their winnings to reduce their taxes. So I would take her winning and losing figures with the proverbial grain of salt.It is also interesting to note that Annie Duke may be more of an instinctive player than a scientific/mathematical player. The great swings that her bankroll apparently went through suggest that she (and her brother as well) are very, very good when they are on, but fairly ordinary when they are off their game. Scientific/mathematical players keep a more even keel. Of course the greatest players in the world are both instinctive and scientific.She writes that you can have a hand in which you are a 2 to 1 favorite and can \"lose it ten times in a row,\" adding \"that's not statistically surprising\" (box on page 183). Well, the odds against losing ten times in a row when you are a 2 to 1 fav are almost sixty thousand to one. If it happens, it would be a lot more than \"statistically surprising.\"She also writes that for safety's sake you ought to have about 300 times the big blind in your game as a bankroll. Actually, how big a bankroll you need depends on what kind of player you are and how great an edge you have over the competition. If you have a big edge, you only need a small bankroll. If your edge is small you need a larger bankroll. But even if you are a winning player but play a lot of hands, your variance will be larger and you will need a larger bankroll. Annie does a good job of explaining this in Chapter 24. However, she reports that her brother went through a four-month period when he was \"losing literally every day.\" (p. 182)Somehow I doubt that. The odds of a winning player losing that consistently are astronomical. What can happen, however, is that even very good players can drift away from their best game and can go on TILT. They can lose their confidence and actually become losing players.As was pointed out by another reviewer that was a king-high straight that she made on page 49, not an ace-high, but that isn't her mistake. That's the equivalent of a typo. Another bit of carelessness is in the glossary where \"river\" is defined as the \"final community card in Texas Hold'em or Omaha.\" Actually the term originally referred to the final card in seven card stud, a game appropriately dubbed \"Down the River\" long before hold'em ever came into existence.By the way, if you don't know how to play Omaha 8 or better (also called Omaha hi-lo) a lot of poker hands she recalls will be difficult to appreciate. Also the structure of the book in which alternating chapters refer to her playing and then to her life experiences may be a bit artificial for some readers.Bottom line: a little too, too much Annie Duke here for some readers and not much in the way of instruction, but an interesting read anyway.One final point: she did it. Annie beat the best and she made millions, and nobody can take that away from her. I just hope she invests her winnings well and concentrates on raising her four kids.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "The two best reasons for reading ANNIE DUKE are for its point of view on big-time tournament poker and its honest self-examination of the life a controversial poker pro.Duke and co-author David Diamond succeed in revealing a view from the table at high-pressure poker tournaments. The book goes through Duke's win at the World Series of Poker in 2004, then at the Tournament of Champions later that year. The vivid details and notes on the hands (the book isn't overly technical and contains explanations of the terms and rules of play, but part of the book's draw is that it takes you \"inside,\" and that includes playing some poker hands) help understand the swirl of emotions and details that can fill a player's head when they get into this unusual environment.The second reason for recommending the book is Duke's willingness to reveal how she became a professional poker player and celebrity through the circuitous route of a competitive family, academia, marriage, and motherhood. Plenty has been written about Annie Duke's story (including her sister Katy Lederer's POKER FACE, which also tells the story of their unusual and remarkable family). Her own version has some new details, but its best feature is its honesty. Duke thinks highly of her poker abilities and says so, but she also shares stories of her losses, insecurities, and bad decisions. She does a great job explaining the decisions that brought her into poker as well as those that led to her backing away from the biggest cash games.Duke and Diamond also structured the book in a very readable fashion, shifting chapter-to-chapter between the action in her two big poker wins and her life story.As a matter of disclosure, I wrote a book about professional poker players this year, but never spoke with Duke in connection with it. One of my sources on that book was Annie Duke's brother, Howard Lederer. But many other sources were players who did not like Duke and whose attacks on her are mentioned (though she doesn't give out their names) in her book.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Annie Duke's book is long on title, short on substance. The chapters alternate from her past to her present (at the time...her first big win in an Omaha Hi Lo tourney). The present-day stuff is presented well and you get a feel for what happens at a poker tournament...tension, boredom, table talk, and \"rail birds\" are all covered well. That's the good part and poker fans like myself will enjoy it for that.The bad part is that the personal stuff is not fleshed out enough. The breakdown of her marraige for example, is never really explored and I'm certain there was a good story behind it. The relationships between herself, mother, and father are described in depth at first, but the parents seem to drop off the face of the earth about midway with little or no description of her relationship with them now. Since she included this personal side in the book, she should have followed it through and given the reader a full picture of where she is now.Prior to reading this book I admired Annie Duke. She is competing in what is truly a man's world and for that she should be congratulated. Unfortunately, after reading this, I ended up not liking her at all. The \"poor me\" attitude she adopts runs thin after just a few chapters. Poor her, indeed. Having to \"scrape by\" on her husband's TRUST FUND. Those of us who work every day aren't likely to feel sorry for such a self-centered mess. I feel certain that if she had included more detail in the past/personal life chapters, one would understand and sympathize with her more.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Have you ever tried to tell a story to a friend or acquaintance, some personal epic filled with twists and turns, comedy and drama, thrills and chills and all sorts of gut clenching climaxes only to be met with a blank expression and a vaguely rhetorical \"I guess you just had to have been there?\" That was my reaction to this book.It's an interesting insight to gambling culture and one woman's take on it, but after a while the two threads of the book (chapters alternate between her autobiography and her experiences at the World Series of Poker) begin to feel schizophrenic. Her history begins to read more and more like a recitation of rote facts while her descriptions of the hands she played in Vegas become more bombastic, which makes for an awkward reading experience. One chapter is a description of how she met this guy and they hung out and he moved back west and then she married him and followed him and so on while the next is a breathless explanation of how exciting it was when the three of clubs came up!Given that this book is essentially focussed on her experiences in poker, this dichotomy is perfectly understandable, but towards the end of the book I was worn out by the constant yo-yoing of the narrative that I was simply relieved to be done with it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "twoperson game theory dover books on mathematics",
        "description": "This fascinating, newly revised edition offers an overview of game theory, plus lucid coverage of two-person zero-sum game with equilibrium points; general, two-person zero-sum game; utility theory; and other topics.",
        "authors": "['Morton D. Davis']",
        "infoLink": "https://play.google.com/store/books/details?id=4LbCAgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "If you want to learn the underlying foundations of game theory, and do not want anything over-technical or under-technical in its explanation and description, then this is a good book to consider. Most introductory game theory books usually plunge you into the math immediately and the remaining few use very little of it and focus on the qualitative aspects. If you're looking for a book that can both teach you game theory and the math behind it, but assumes all you know is the math you know or remember was from high school, then Two-Person Game Theory is what you've been looking for. This book begins essentially with no usage of mathematical jargon whatsoever and slowly works in the math a little more each chapter. By the last third of the book, there is substantial use of math in each chapter, but by then it is understandable because of this slowly increasing dosage you've been exposed to while reading. In any case, the mathematical background requirements of the reader is minimal. For most of the book all you will encounter are basic concepts of probability, with some simple algebra and a few instances of calculus used in the later chapters, though these parts aren't integral for overall understanding if you're just getting into game theory. However, the author also provides a verbal account for the rationale and underlying logic for every mathematical equation and representation he introduces. Overall, this is an excellent introductory book, especially if you're intimidated by math but still want to learn about game theory and the math behind it.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Definitely a must reading if you are interested in game theory, conflict resolution or behavioral science. This very enjoyable book is full of interesting and colorful examples to illustrate each covered topic.Rapoport combines an interesting and rare mix of skills: a mathematical expertise, an extensive and deep knowledge of behavioral science and an amenable writing style. The result is little-great book that knits together work in decision-making, psychology, strategic thinking and pure game theory. In this remarkable and illuminating text the relevant concepts are introduced in a very clear way. In the last chapter the author offers a critical review assessing strong and weaknesses of Game Theory for purposes of modeling human behavior and situations characterized by conflicts of interest. The main conclusion is a remarkable one: the great value of game theory is in its power to reveal its own incompleteness.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "501 essential backgammon problems",
        "description": "This comprehensive backgammon supercharges intermediate players with powerful concepts used by professional money players and champions! Readers learn everything from the general principles underlying expert play to advanced concepts like back play, holding games and one man back. Advanced strategic chapters cover connectivity, priming games, containment games, breaking anchor, action doubles, late game blitzes, post-blitz turnaround, ace point games, the concepts of profitable doubles and much more in the 31 hard-hitting chapters. With the help of hundreds of game-action diagrams 501 Essential Problems transform readers into thinking, aggressive pro-level players. A must-buy for every serious backgammon player!",
        "authors": "['Bill Robertie']",
        "infoLink": "http://books.google.com/books?id=OdeYzgEACAAJ&dq=501+Essential+Backgammon+Problems&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As I start to read Bill Robertie's latest book, 501 Essential Backgammon Problems, I am informed in the preface that he is the world's best backgammon player. So far so good.For those of you unaware, Robertie, former two time world champion, has already written many books on backgammon and together with Kent Goulding co-published the sadly now defunct, but at the time premier magazine \"Inside Backgammon\".As the title suggests, it is a compilation of 501 problems, split 360 checker plays v 141 cube actions. (67 doubles 74 redoubles). After the introductory chapters covering notation/probability/basic doubling strategy etc, there are 26 chapters covering many of the important concepts in backgammon from the opening to the bearoff. These are:The Opening, Flexibility, The Middle Game, The 5-point, One Man Back, Priming Games, Connectivity, Hit Or Not?, Crunch Positions, Action Doubles, Late Game Blitz, Post-Blitz Turnaround Games, Ace-Point Games Back Games, The Containment, Game Post-Ace-Point Games, Saving The Gammon, The Race, Various Endgames, Bearing Off Against Contact, The Blitz, Breaking Anchor, Too Good To Double?, Playing For A Gammon, The Bearoff, Holding Games,The book manages to cram the 501 positions and analyses into 384 pages of a book measuring just 23x15cms. This is achieved by squashing the diagrams with the effect of making the checkers oval. The problems in each chapter are all bunched together first and the solutions at the end of the chapter hence cutting down on the need to avoid looking at the analysis.It's target audience is everybody from beginner to expert level. The only group that maybe wouldn't find many parts of this book valuable would be world class players.The problems are typical of positions that appear in everyday backgammon and not unusual or tricky positions that an expert may get wrong. The difficulty of the problems range from very easy to hard with the majority in the intermediate/advanced level. My guess is that the book would be suitable to players ranked up to elo 1900 on F.I.B.S. or Gamesgrid. Robertie has attempted to create a book of reference positions whose characteristics the reader can hopefully remember and apply and adapt over the board and for each problem, he typically gives a succinct 8-10 line analysis.There are no references to any of the neural net backgammon programs in the book. I checked all the positions by rollout and did discover some disagreements between the bots' conclusions and Robertie's analysis. There were around 12 cube problems whose equity differed by more than 0.04 and also some checker play differences. Some of those positions would make good reading for the more expert players.My only major criticism on the book is that in some of the checker play problems Robertie doesn't analyse all the potential choices or rejects one when in fact the equities are quite close.The reasoning behind this maybe that that the merits of that checker play do not fit in with the theme of the chapter or are too complex. And on a personal note I prefer to see the pip count in diagrams.Overall an excellent book suitable for either beginners who have learned the very basics or a good refresher book for more advanced players. Marks out of ten 8.5.",
                "review/helpfulness": "96/98",
                "num_reviews": 98
            },
            {
                "review/text": "Backgammon is as good as it gets. The rules take minutes to learn but a lifetime to master. Each checker on the board plays an offensive and defensive role, as the two opposing forces march past each, one going clock-wise, one counter-clockwise. And then there are the dice. Like chess, there is a tremendous amount of strategy involved in how to play each roll, but the dice add another level of probabilistic strategizing. And sometimes the better strategy loses, just because the rolls don't come through.Bill Robertie, \"The world's best backgammon player\" according to the back cover, breaks the strategy down into discrete 31 topics, examples being \"the opening,\" \"the middle game,\" \"the blitz,\" \"crunch positions,\" \"action doubles,\" and \"the bearoff.\" The topics are covered by a series of snapshot moments from a potential game. You're given a certain layout and a dice roll and asked what the best move is. Then you flip to the answer section of each chapter and see what Mr. Robertie thinks is the best move and why. As someone who was a student for over 25 years, I'm well acclimated to this format of testing, and quite comfortable with it. However, the snapshot approach doesn't address what many players do wrong, which is to lock-in to a strategy early in the game, or to have overall certain tendencies, instead of focusing on the flexibility to change strategies at any time to match the action of the game. This strategic flaw is analogous to a football coach who says you always have to establish the run before you can pass (think Mike Ditka, Dan Reaves), as opposed to a coach who approaches each team differently and can adjust to the opponent throughout the course of the game (think Mike Shanahan, Bill Belichek). It's also seen in brokers who chase after trends in the stock market, or poker players who try too hard to avenge their last hand and lose their perspective.Like other reviewers, I did find flipping back and forth between problems and solutions to be annoying, but not a deal-breaker. You just need two bookmarks and a little patience.I recommend this book. I think it has helped my overall decision making skills in Backgammon. But it won't solve the big problem of not being in the moment, of not reacting and adapting strategy to each roll of the dice. A book won't fix that. Meditation might help. Wading through a creek might help. Relaxation techniques, mindfulness exercises, and beta blockers wouldn't hurt.",
                "review/helpfulness": "50/52",
                "num_reviews": 52
            },
            {
                "review/text": "The 501 positions examine your approach to the game from beginning to end.Robertie's solutions so closely mirror my JellyFish Tutor recommendations that I have simply dropped the examples into JellyFish and only consult the book when I have a disagreement with the bot.Therein is the second value in this book for me: Robertie's analysis is succinct and sticks to themes over theory. When I do perhaps 50 positions quickly, only noting where I differ from the bot, and then read Robertie's suggestions for these positions, I usually find a recurring theme pointing to a weakness in my game.For me, this book is ultimately what I've made of it, Robertie has provided the necessary resources and I recommend this book as such.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "If you are a backgammon lover, this book must be on your personal library. Robertie analises problems in each point of the game, since opening rolls until the bear off. The hints are clear and at first read you can discover many points you would play in a different(and awnkward) position. As you read the topics you will feel imediately a good development in your game, specially if you try to solve then before looking for the solutions. The secret of this book is figure out the different way of think in each situation and time of the game. A great book that can be easily consulted by anytime.The book is shared in the following chapters: *THE OPENING *FLEXIBILITY *THE MIDDLE GAME *THE 5-POINT *THE BLITZ *ONE MAN BACK *HOLDING GAMES *PRIMING GAMES *CONNECTIVITY *HIT OR NOT? *BREAKING ANCHOR *CRUNCH POSITIONS *ACTION DOUBLES *LATE GAME BLITZ *POST-BLITZ TURNAROUND GAMES *TOO GOOD TO DOUBLE? *ACE-POINT GAMES* BACK GAMES* THE CONTAINMENT GAME* POST-ACE-POINT GAMES*PLAYING FOR A GAMMON*SAVING THE GAMMON* BEARING OFF AGAINST CONTACT *VARIOUS ENDGAMES *THE RACE *THE BEAROFF *Plus an introduction with basic rules and backgammon notations and a final chapter with places to play backgammon.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "While studying this book I noticed that my game improved dramatically. I gained a much better understanding of duplicating, slotting, and use of the cube. I am no expert but I am now challenging the best players in our club!If you are looking for examples this IS the book you should get!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "i keep going back to this book to relearn what it has taught me! backgammon is easy when the dice go your way. this book puts you in tough positions and tight spots and helps you get out of them. makes me a much more robust player.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Edit - 11/29/11I can't say enough about this book, I have read A LOT of backgammon books, but this one had the most immediate impact on my game. I really like Robertie's books. Robertie teaches and explains, he doesn't pontificate.I have heard the neural nets (and let us not anger them) have found some \"errors\" in Robertie's analysis, but I have used eXtreme Gammon on many problems, and have never found an error, and only a few cases where there were equal plays. Keep in mind Robertie's examples are chosen to illustrate the particular concept in question. In a few instances there may be other acceptable plays, but his purpose is to teach the various concepts in question and he succeeds impressively. Your game will improve dramatically by understanding these concepts and there are no backgammon programs that can teach that.Robertie's method in 501 allows you to learn the concepts quicker and it is much more fun and interesting than slogging through page after page of some author's wearisome written \"analysis\". After you work through a few examples, you begin to see the concept in the following examples. This is very interesting, encouraging and fun.I had the same experience when I studied chess years ago. Pages of theory and analysis put me to sleep, while plenty of good examples of the same concept were like turning the light on for me, and I began to see it in my own games.Very few of us have the computer-like brains to perform complex calculations in our head, but we can analyze the position strategically for it's strengths and weaknesses, what we need to accomplish, what potential dangers may exist, etc. and 501 excels in that area.I have a computer and eXtreme Gammon and can perform 3 and 7 ply analyses on book positions just like anyone else. Analyzing positions with your computer is fine, but Robertie teaches you how to play and how to think DURING the game, when it counts. With this information, you will outplay 95% of all backgammon players.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I'm only 3/4 of the way through this book, but that's far enough to gauge the benefits that this book provides for the Backgammon player who wants to get better.With 501 sample problems, you will find that many (never all) situations that will come up in a game are illustrated here. The format is easy to follow, with each of the 31 chapters containing problems and solutions for facets of the game from openings to bearing off, and blitzing to holding games, and the author's comments in the solutions provide the tips that can be memorized. For example: faced with a choice, say between making a point, or hitting a blot, \"do the hardest first.\" In Backgammon there are exceptions to almost every rule, and Robertie covers these also. I'd also like to point out that this is an extremely \"fun\" book, that you can pick up for 5 minutes or 55, at lunch, or in the car!Other than the most basic rules of the game, like how to set up the board, everything is covered here, from beginner on up. Robertie has a real gift for clarity, and is able to speak to EVERYONE, from someone new, to an expert, in a clear, focused voice.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book contains invaluable information for the improving backgammon player. It suffers from it's unfortunate layout (as do all Robertie books) --- poorly located diagrams or solutions in relation to the diagrams. Still the contents are a must read (and reread) for any advancing player.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is of great tactical value. It let's you exersise and perform 501 plays that will change the way you play Backgammon. Not just a theoretical book, but actually a much more practical approach.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mastering nolimit holdem",
        "description": "Strategies to consistently beat small stakes poker tournaments and cash games.",
        "authors": "['Jonathan Little']",
        "infoLink": "http://books.google.nl/books?id=cMAtMQAACAAJ&dq=Mastering+No-Limit+Hold%27em&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The first two chapters reveal that the book is superficial, repetitive and confused.The book says it is aimed at fixed and variable cash buy-in games between $100 and $500. On page 8, we are told \"in all cases, we recommend you buy-in for the maximum possible amount. There is no reason to put yourself at a disadvantage . . .\"Just 3 pages later, on page 11, we are told \"we strongly advise you buy-in for the maximum amount. First, many of your opponents will buy in for the maximum. Second, if you purchase the minimum, you will be relatively short stacked. Why put yourself at a disadvantage?\"Now, not only is this advice repetitive, but no valid justification is offered for buying in at the maximum.The fact is that the bigger your stack, the better player you need to be. There is a reason for this. Any hand you open as a big stack, with a limp or a raise, gives implied odds for all those with position on you to call with a wider variety of hands. This is why Ciaffone/Reuben and later Miller suggest that newer players not play big stacks initially.In addition, the book is confused. On page 2, we are told that bluffing is not a big weapon anymore in this level of game where people routinely call all their stack on one pair. However, on p. 21, we are told that a big stack is a weapon to be used to bluff with, citing with approval an example where a big stack raised 99 preflop, got bet into on an A83 board, and then reraised all-in, getting a player with AT to fold.In reality, \"big stacks as weapon\" is much more of a tourney concept where the blinds increase and you can't go in your pocket. And the advice on page 2 is correct - many calling stations exist today, and attempting to bluff those players is incorrect.Chapter 3 entitled \"Know Your Foes\" offers nothing new.Chapter 4 entitled \"Odds & Betting Strategies\" is ill-conceived.Discussion of pot odds includes an example where we are told to fold on the turn with a nut flush draw and 2 overcards in last position for $80 in a $220 pot because the pot odds are \"approximately\" 2.75:1 and that's not enough to call \"even if we attempted to value the overcards.\"First, $80 to win $220 is exactly 2.75:1. Second, if both overcards are live, we are 2:1 to win the pot, and are getting an overlay. If one of the overcards is live, we have 12 outs which is 2.8:1, enough to call especially considering implied odds.Discussion of implied odds includes example of nut flush draw getting 3.5:1 from the pot on the flop. \"However, if you make your hand, you believe you will be able to make a large amount of money on the river by traping a loose bettor for most of his stack.\"I don't know about you, but unless it's flush over flush, I don't trap people for most of their stack when a flush hits. It's simply not hidden. A straight draw should have been used as the example.One crucial omission: there is no discussion of odds with 2 cards to come, as in all in on the flop!!Moreover, there is no discussion of how you go about finding yourself in an implied odds situation. The key is entering pots in position when a big stack (or two) has already entered the pot. In many ways,the authors virtually ignore stack size in their discussion of strategy. Stack size is paramount in NLHEThe discussion of betting strategies is little more than giving you a range to bet under certain situations. This material is nothing new.Moreover, no consideration is given to how to bet draws. For example, with a flush draw and two overcards, you can bet the pot on the flop. Often, you will win the pot without a fight, and if you get called, you just got 2:1 on your bet with a 2:1 shot to hit your card on the turn.\"Relative position\" is described by the authors as your position on the flop. In other words, if you were in the cut off seat, and the button folds, you have last \"relative\" position.I guess that's OK, but it's not very helpful.I didn't see where they discuss what most consider to be \"relative position,\" ie your position with respect to the preflop raiser. Who cares if you have the button on the flop if you are first to act after the preflop raiser makes a continuation bet? This is why cold calling raises is usually so wrong.Relative position means where you are relative to the preflop raiser. The best position, of course, is directly to the right of the preflop raiser, so if makes a continuation bet, he's betting the field into you.I could go on, but bottom line, Ciaffone & Reuben's PL & NL Poker book is vastly superior.",
                "review/helpfulness": "39/44",
                "num_reviews": 44
            },
            {
                "review/text": "If you are looking to play no-limit cash games (as opposed to tournaments) and your main experience with NL Texas holdem is watching poker on TV or playing sit-and-go or multi-table tournaments online, please get this book. The truth is that NL holdem against ordinary players is not a game that requires or demands a lot of fancy plays and bluffs, but rather mostly solid fundamentals. It might be \"sexy\" to play like Gus Hanson or Daniel Negreanu do on TV (at short-handed final tournament tables) but you don't want to play like this in the typical game. This book stresses these fundamentals of how to bet, when to raise/call/fold, how to play after the flop, etc.I thought that I was a decent NL player, but I underestimated the differences between cash game and tournament style holdem. In the few weeks I've had the Fox/Harker book, my results playing NL holdem cash games, both online and in a casino, have been great.This book assumes that you will be playing in a \"restricted\" buy-in NL holdem game against average opposition, which is the type of game you would play online (with a $25-$200 buy-in) or in a casino (where the buy-in is usually in the $100-$500 range). Unlike Doyle Brunson's SuperSystem, Harker and Fox do not assume you are playing with a huge stack of thousands of dollars against players that are scared to death of your raises. They also do not assume that you are a world-class player in terms or putting your opponents on a hand.I gave the book 4 stars instead of 5 because I would have personally preferred a lengthier discussion of \"implied\" and \"reverse implied\" odds and more mathematics (although most will probably find plenty of math for their taste).",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "Having played for several years (prior to the days of 21 year old millionaires and Gus Hanson)... I have great respect for the subject matter in the book.Nothing flashy or dramatic... just good solid poker strategy.I was first attracted to the book because I have played with Russell Fox several times at the Bicycle Casino in CA... and he is the most unexcitable player I have ever met. Yet somehow, he continues to cash-out absurd amounts of chips time and time again.I have even caught myself on the loosing end of a bluff/move in a heads up match against Mr. Fox.Live and learn... read this book and be successful. The tips are legitimate, and very relevant to the world of minimum/maximum buy-in structures.Areas covered include not only tips for play, but tips on maintaining a winning attitude and a solid financial base for your endeavors into Poker.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "I play poker for a living and online no-limit cash games between 2/4 and 5/10 are currently my games of choice. I have read probably 15 poker books and this one (MNLHE) is far and away the worst. I think the only reason it ever got decent ratings is that for a long time there were very few books on no-limit on the market. This has changed. No Limit Holdem: Theory And Practice (NLHE:TAP) by Sklansky and Miller is now the Bible on cash no-limit, and Phil Gordon's Little Green Book and Little Blue Book are also very good.As other reviewers have noted, this book endorses the bizarre idea that a short stack is an inherent disadvantage (as opposed to simply a less profitable choice than a deep stack) in a cash game. This commonly believed idea was debunked once and for all in NLHE:TAP.MNLHE's problems get much worse than that, though. You only have to reach page 18 before this stunning advice appears. You're sitting in a $2/$3 NL game with $60, having just lost a pot, and:\"You look down at 9d7h in the cut-off position. An early position player raises to $7 and 4 players call. Normally you would fold this hand but in this situation you might elect to call. It is likely your cards are live. If you hit the flop you can win a large pot.\"If you haven't played much no-limit you'll have to take my word for it that this is unbelievably bad advice. I feel silly even explaining why, but: with a deep stack of say $300, a call could be justified, but with a stack as small as 20 big blinds, your payoff when you hit the flop in a big way is far too small. You have good position, but that is worth a lot less when you're short stacked. The pot is going to be something like $40 on the flop and you only have $53, so your choices are going to be limited to allin or fold. It's also worth noting that in a loose game there's absolutely no reason to believe that \"your cards are probably live\".Wander over to page 21 and we see the authors endorse the idea that having a stack of $400 facing two players with stacks of $70 and $125 is any different than having a stack of $125 in the same situation. See NLHE:TAP if you don't understand why this is wrong.Turning to the quiz on page 161, the authors ask:\"You hold QQ in the cutoff seat. There are two limpers to you, you raise to $20, and only one of the limpers calls you. The flop doesn't appear threatening: 7h7c3s. However, to your surprise, the preflop limper bets $30 (he has you outchipped). It's your turn to act; what is your action?\" (You began the hand with $150 in a $2/$3 game)This is an utterly trivial hand, but the authors start their answer:\"What does your opponent hold? Is he bluffing? Hands like this are why some of us get grey hair!\"Um, really? You guys must be easily stressed.\"If your opponent is tight and solid, a fold is probably correct; he likely has one of the hands that beats you.\"Are you serious? What is a \"tight and solid\" player doing splashing around preflop for over 1/8th of the effective stacks, out of position, with 33 or a hand that includes a 7? And if he does have one of those hands (or is slowplaying aces or kings) why is he betting straight out at me instead of checking and giving me a chance to put more money in the pot if I have something like AQ? Folding here is just ridiculous. The pot is $48 and your stack is $130 - there's no way you're doing anything on a flop like this except getting the money in. You should either raise or call here depending on the tendencies of the opponent, but in either case your focus is squarely on getting all the money in the middle.Those are some of the more egregious examples; I could go on, but my point should be made.The writing is terrible, both in terms of correct use of English and in terms of clarity and readability. There are grade-school grammatical mistakes like \"not that great of a situation\" (rather than \"not that great a situation\"). The narrative is tangled and often wanders off on little tangents of questionable relevance. It is frequently anecdotal rather than dealing with underlying theoretical context. This adds up to a very confused presentation of ideas which the authors (given some of the jaw-dropping advice) probably don't have much of a grasp on in the first place.I felt compelled to write this lengthy review after ordering MNLHE from Amazon on the strength of the reviews. I learnt nothing from this book and its presence on my bookshelf is nothing but an irritation. I'm not one of those people who trawl Amazon looking for things they can give one star to, but I really do think that is what the book deserves. Buy NLHE:TAP instead, or if you already have that, save your money and reread it.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book really fits into a void within the poker literature because there are a million books about limit and no limit tournaments but a scare few address no limit cash games. The irony is that NL ring games are the types in which most of us play. What Fox and Harker do in these pages is discuss various elements and strategies necessary for play in the 10, 25, 50, 100, and 200 dollar NL games. However, it obviously won't help you deal with Juanda and Matusow at NL 10,000 because the authors' views are fairly conservative. The tactics showcased here are not ones that are going to appeal to loose-aggressive players. Theirs is a tighter game which becomes classically aggressive in moments of strength. Appendix A contains a play-by-play analysis of an 8 hour NL session at the Bicycle Casino in Los Angeles. By offering this, readers get an opportunity to \"sweat out\" a game with the authors which is an absolutely wonderful idea. It really allows you an opportunity to plug up some of the leaks in your own game by seeing the right and wrong way to do things. Personally, I'd give anything for Dan Harrington to provide us with a 400 pages sweat-now that would be worth about $500. Anyway, the real live play example was helpful and I'd like to see more authors make use of this technique. Overall, this shouldn't be the first book you buy on No Limit, especially since Ed Miller will be coming out with one in a month or so, but Fox and Harker have given us something valuable, so, if you're having any trouble in the small to mid-range NL games, this one's a must read.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "In this book, the authors try to help the reader learn to win at no-limit holdem. The problem witht the this book is that the book only gives enough information to give the player a false hope at the game. While the book doesn't offer any \"bad\" advice, it doesn't offer enough \"good\" advice, in that it addresses the basics of poker theory, and then goes about how to apply these basics to no limit holdem. To really win at no limit holdem, the basics just aren't enough. Psychology is much more important, and this book just leaves the player too predictable and too uninformed to do some serious damage at the tables. This book has the player playing a more limit style of poker, which doesn't work in no limit. It doesn't discuss the difference between a big pot or a small pot, which has a major affect on whether a player is a real winner or not. Get Doyle's and Harrington's books (all of them) and don't go overboard.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a fairly straightforward book for no limit; however it is a niche book. This book discusses the small buy-in no limit cash games found mostly in the LA clubs and Las Vegas casinos. While I think it provides an adequate overview for these specific games it is short on the underelying theory of no limit holdem and almost completely void of the psychology which is the main thrust of no limit holdem. The book is for the casual to intermediate player who wants to play at these smaller games. My main complaints are that there is much basic material that is more common sense than anything and the authors never take you to a place of elevating your game. If you are still learning the basics and don't understand things like position and how to read holdem flops it may be okay but personally I didn't feel I got much value out of it. Do an honest assessment of your own game-if you would consider yourself a beginner or struggling intermediate player you will learn enough to make the read worthwhile otherwise it is very middle of the road and you might find better value in \"Super System\" or \"Harrington on Holdem\". While \"Harrington on Holdem\" is written to be a tournament no limit book most players will find tremendous value learning from a truly great player like Harrington and you will learn underlying theory of no limit holdem that can be applied to cash or tournament games.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I would tell you this is a great book for getting started in no limit ring games but if I did that I might find you sitting across from me making my job at the tables harder.Seriously this is a great book for getting started in smaller stakes ($100 to $500) no limit tables and also for the internet play. This book assumes you know how to play good poker so if you are looking for starting hand requirements etc. you should probably start with a more rudimentary book on poker, but for no limit betting structure, pot odds and just general strategy this is a must have.This book is not geared for tournament play but for ring games, get another book for tournaments.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "If you're considering playing the restricted buy-in no limit hold 'em games that have become popular in most casinos, then this book is a must. It is a complete guide to developing a winning strategy. If you are already a winning player, this book will help reinforce many of the concepts that you already are using, and should increase your win rate. I've been beating the small no limit games for two years now, and I find that this book has helped shore up some of the leaks in my game.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book covers the essential points of playing No Limit Hold'em. It is easy to read, systematic, and thorough. I felt I had already read all the advice in it somewhere else. If you already have a large Hold'em library, you won't learn anything new here. It may serve as a good review. If you are looking for a first or second book on No Limit Hold'em, this might be a good choice. Everything necessary seems to be here, but I hope to find something original when I buy a new poker book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "what giants they were",
        "description": "Once there was a baby in the house - and to that baby, Mum and Dad and Jill and John and Uncle Tom were giants. But little by little, that baby grew up - until she became a giant too. This book explores the stages of life and development.",
        "authors": "['Martin Waddell', 'Penny Dale']",
        "infoLink": "http://books.google.com/books?id=z4hfAAAACAAJ&dq=What+Giants+They+Were&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "THIS BOOK IS A COLLECTION OF INTERVIEWS AND SHORT STORIES ABOUT SOME OF THE LEGENDARY GIANTS OF THE EARLY ERA AND MOSTLY OF THE GOLDEN ERA OF THE LATE 50'S AND EARLY 60'S. IT IS A FASCINATING COLLECTION ALONG WITH SOME GREAT PICTURES. I REALLY LOVED THIS BOOK, EVEN THOUGH I AM A BROWNS FAN. A BOOK THAT SHOULD BE A MUST READ FOR GIANT AND THE NOSTALGIC FOOTBALL FAN.VERY RECOMMENDED.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "\"What Giants They Were\" is a fond look back at the New York Giants. Those folks most likely to enjoy WGTW will remember when one specified \"football Giants\" when referring to that franchise! The tale recalls a very special time for this reviewer: He can well remember taking a short subway trip to Yankee Stadium and purchasing a bleacher ticket-the day of the game. Price: $2.00. He could buy a game program, a coke and 2 hot dogs and still have change from a Lincoln! For the 1963 season, this reviewer bought a season ticket in the bleachers. Price: $28.00! The actual games, it should be mentioned, were played on real GRASS! By November, the green grass was gone, changed to beautiful brown dirt! The Giants owned New York in the Fall. People paid attention to basketball and hockey-but not until Winter. The Manhattan-centric Giants WERE New York sports. The players became small gods, helped by the fact that rosters were stable in those pre-free agent days. The defense, anchored by #70, the great Sam Huff was virtually unchanged from 1956-1963. The team appeared in 6 NFL Championship Games in that span. That they lost the final 5 of those contests did not cost them a single fan. Those Giants were the pinnacle of franchises in a time that can never be recaptured. The memories of the old Giants are enhanced by the brutal fact that living in NYC was, to put it mildly, vastly simpler then. Author Whittingham has dutifully interviewed 20+ former players and coaches. \"Someone\" on high was cooperating with the author! The very names tell the story: Huff, Gifford, Rote, Webster, Conerly, Katcavage, Lynch, Mozelewski, Robustelli and Summerall. Those unable to instantly supply the relevant first names to those titans of the past will not fully enjoy WGTW. Homage in passing is paid to the Parcells/Simms era but they are blessedly outside the scope of Whittingham's tale. Those guys do not belong here! In fact, the author goes farther back than forward! Space is devoted to guys like Red Bagro, Benny Friedman, Mel Hein, Tuffy Leemans and Ken Strong! In addition to his strong research, the author has provided some of the sharpest and most personalizing photos this fan has experienced in any sports book. Many readers take typesetting for granted, or suffer silently with it, but in WGTW the work is excellent! The production values are very high indeed. Other attractions are sections on some of the men's college days and the trials they endured as rookies. Sam Huff was on his way back to West Virginia when assistant coach Vince Lombardi collared him at the airport! There is also a section on \"life after football\". Most of WGTW is positive. The only dirt spilled is Sam Huff's latter day rant about his trade to the Redskins after the '63 season. That was his due; his trade was the dumbest move in the life of the franchise. Sam was the heart of the team; the Giants took nearly 20 years to recover from his untimely departure. If there is a weakness to WGTW, it lies in what is NOT revealed. Some unaddressed issues might include: 1) How did the team let assistants Vince Lombradi and Tom Landry get away in favor of a guy named Allie Sherman? 2) What about the intra-Mara family squabbling? It had to be serious but never made the press. 3) What was behind Kyle Rote's sudden retirement after the '61 season? 4) Why didn't a Mara stop the Huff trade? And on a lighter note: 5) Why on earth did Allie Sherman allow backup quarterback Glynn Griffing to skip practice the entire week before the '63 championship game against the Bears? Couldn't his wedding in Mississippi have been postponed a week or two? And what ever happened to the heir apparent QB after his woefully brief performance in that game? This is first class sports reporting! We may term it pure nostalgia, but to so is to bestow a compliment. Looking backward is the crux of WGTW. This review won't deduct a star for the limited scope. The strengths vastly outweigh the \"weaknesses\" of a limited audience and the aforementioned unaddressed issues. We should treat WGTW like an old Hank Williams CD. Don't fret that they don't make them like they used to. Let's enjoy pleasant memories as they are handed to us.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "theory of moves",
        "description": "This book aims to show how game theory can be radically reformulated so as to make it applicable to the study of strategic conflict in a number of fields.",
        "authors": "['Steven J. Brams', 'Steven John Brams']",
        "infoLink": "http://books.google.com/books?id=WzfN3IO44AwC&dq=Theory+of+Moves&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "To me , \"Theory of Moves\" (TOM) is the first academic book I have read cover to cover with great interest . I discovered this book in the course of the last semester , being one of the must reads for the game theory course I'd taken , and once I got my hands on this book I couldn't wait to have the time to read it thoroughly , a task I completed only lately .Game theory in general and TOM in particular , have given me a new way of looking at the world surrounding me ; I feel like I understand it better than before I've learned to use this logical and rational thinking . Many things look simpler now , since the facts and principals I've learned make them comprehensible , understandable and clearer than before .Prior to reading this book you'd have to have some background on the classical game theory . I learned this background mainly from the booklet of Frank Zagare that pretty much covered all the main basic principals of the qualitative use of the theory . Morton Davis is also a good choice for beginners , both center on the non-mathematical aspects of the theory which are used to dissect and explain the decisions of players at matters of internal politics ,international relations and everyday's life serious decisions people make .This work represents an extension of game theory that helps to adjust it better to real life , or as Brams puts it : \"The Theory of Moves brings a dynamic dimension to the classical theory which was defined as static , by postulating that players think ahead not just to the immediate consequences but also to the consequences of the other player's countermove , counter countermove and so on ... TOM extends the strategic thinking into the more distant future . \"Brams , in his book , gives all the tools needed to learn and understand everything about his fascinating theory . This effort is mostly a summation of more then two decades of trial and error , deep investigations , constant changes and improvements , and examination of a myriad of case studies .The major concepts and issues you are going to read about and be captivated with will start with the 'Anticipation Problem' , going through 'Magnanimity' with the teasing theme - \"it sometimes pays ...\", 'Moving Power' , 'Order' and 'Threat power' , ending with 'Information Problems' in games such as 'Misperception' (which is enormously intriguing concept to capture) , 'Deception' and 'Omniscience' . There is also an additional chapter that was difficult for me to understand , in which Brams offers a new model of negotiations .Each chapter is written with the well known form of introduction - theory principals - applications , in addition to a last chapter that concludes the entire book . This design is very helpful since whenever you have problems understanding the theory - you can immediately skip to the examples Brams is generous with giving - and solve all the unclear points instantly . As for the style itself , we're dealing here with a first class author that has the outstanding ability to keep you thrilled all along the reading effort , winding up asking for more ...From what I've gathered so far this is the best book you can get about this brilliant extension . I believe everyone that is interested in expanding horizons in this evolving field should read this book , and maybe add further applications and modifications in the future to come .",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "Steven Brams' Theory of Moves is a fascinating publication that supplies qualitative and quantitative mathematical models used to explain the merits and deficiencies in the logic of hypothetical and anecdotal decisions of various types (economic, political, social, etc.).Brams intermittently isolates two-party conflicts and highlights each conceivable resolution by using a 2x2 matrix that gives a variety of possibilities provided in ordered pair combinations, where the numbers range from a 1, which translates to a worst case scenario for the party concerned, to a 4, which is the best possible outcome. For instance, a (1,4) would be interpreted as a two-party game where the deciding party, who receives a 1, ends up with the theoretically worst possible outcome, leaving the opponent, which receives a 4, with the best. As another case, a (3,2) would be read as a pairing where the 3 represents a next-to-best outcome for the decision making party, whereas the 2, on the other hand, would be the next-to-worst outcome for the opponent.Brams looks at various situations, comparing and contrasting, for instance, the fictional works of Sir Arthur Conan Doyle, whose most famous character, the detective Sherlock Holmes, always comes out one step ahead of his arch nemesis, with those that display what is referred to as the Minimax Theorem, which espouses that \"[i]n a two-person constant-sum game,[it] guarantees that each player can ensure at least a certain expected value, called the value of the game, that does not depend on the strategy choice of the other player\". Among the works in this latter category is William Faulkner's Light in August, where a chase scene is partially deconstructed by Brams in such a way that argues that, unlike Doyle, whose protagonist is portrayed as a character with computational abilities that are superior to those of the antagonist, who never, in turn, makes the necessary adjustments to place himself or herself at an unequivocally victorious stage, Faulkner understood the mixed strategies involved in a two-person sum game where, perhaps, a decision made by the inferior might have the silver bullet effect to overcome the superior.As a relevant case that might be brought forth, sports analysts paid special attention to the selection of players for the 1980 U.S. Olympic hockey team. After the best American players, even at the top of the National Hockey League, had previously been beaten by the Soviets time and again, the hopes of ever defeating Russia, especially in 1980, were dim. What transpired to be the Miracle on Ice was regarded by sports historians as essentially this. Though decision making officials were inclined to put together what were deemed the very best of the best, the U.S. coach used, as I recall, a counterintuitive approach by forming a team that largely consisted of players with, perhaps, less talent than the hockey elite but, nonetheless, an overall determination to win which could not be denied. In other words, the U.S. probably did not have its best team that day, but it had, more importantly, the right team.Throughout Theory of Moves, Brams portrays various situations where diplomacy and compromise are the appropriate, realistic approaches to dealing with an opponent. For instance, if the outcome is ideologically next-to-best, it might, in reality terms, be the applicable best, especially in cases where the opponent has interests that run counter to those of the decision maker. In those particular scenes, Brams provides further outlets of analyses, expounding upon where it is not worth pursuing the attainment or maintenance of the best possible state; in discussion, Brams introduces us to magnanimity, which is a transfer of moving from what was the best possible state to the next-best possible. Magnanimity, according to Brams, is essential, especially if what was regarded as the best possible situation devolves into a worst case Status Quo, where the opposing party, over time, grows resentful and decides to rise up in hostile action.What have been provided in these few paragraphs are only a handful of terms that Brams gives in these roughly 215 pages, for there are so many angles for the reader to look upon. In fact, the information and explanations are so thorough and detailed that once a person gains a more refined appreciation or understanding of the decision making powers or adjustments necessary for optimal outcome in game theory, he or she can apply it in life, especially when making personal decisions and effectively dealing with the dilemma that we often put 80% of our energies into what amounts to only 20% of what is really of immediate importance.Theory of Moves is a definite must have. Quite a bit of the language is technical, but there is enough induction applied where one can draw enough analogies and parallels to what is discussed so as to relate to the points that Brams is getting across.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "theory of games and economic behavior",
        "description": "First published in 1944, this book, co-written by an economist & a mathematician, conceived a groundbreaking theory of economic & social organisation based on a theory of games of strategy. The result was a revolution in economics & game theory has since emerged as a major tool of analysis in many other fields.",
        "authors": "['John von Neumann', 'Oskar Morgenstern']",
        "infoLink": "http://books.google.com/books?id=_aIGYI-jGEcC&dq=Theory+of+games+and+economic+behavior,&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I'm not even sure I'm qualified to pass judgement on this book, but what I understand, I give 5 stars without hesitation. The authors discuss almost every class of game (2-person, 3-person, zero-sum, non-zero-sum, etc.) and even a very simplified version of poker.You basically have to be a mathematician to get full value from this book. This book is absolutely full of equations and complex proofs. For a beginner with little math, I'd recommend Game Theory by Morton Davis, or for someone with some university math I'd recommend Games and Decisions by Luce and Raiffa. However, if your math is good, you might as well go straight to this book, which started the whole field of game theory.",
                "review/helpfulness": "117/124",
                "num_reviews": 124
            },
            {
                "review/text": "Let me start out by acknowledging that this is THE BOOK that started Game Theory as it exists today. While Bayesian statistics are an obvious precursor, everyone agrees that von Neumann's and Morgenstern's work was ground breaking.That said, this is not the best written Game Theory text out there. Like all seminal works, it suffers from the basic fact that we've learned a lot of new things since the time it was written. Many people have gone on to build and expand on the insights contained in this book, especially in the area of bargaining and cooperative game theory.This is a very impressive book to keep on your shelf, and the discussion of poker and the role of bluffing is very interesting, but, owing largely to the 60+ years that have passed since its initial publication, it's not the best reference work or study material available.Another word of warning: The review below is correct that the level of math that you must understand to fully appreciate this book is quite substantial. This book is more for the mathematically sophisticated who want to develop an appreciation for the origins of game theory.",
                "review/helpfulness": "94/102",
                "num_reviews": 102
            }
        ]
    },
    {
        "Title": "chance",
        "description": "\"In an intense tale of psychological suspense, a San Francisco psychiatrist becomes sexually involved with a female patient who suffers from multiple personality disorder, and whose pathological ex-husband is an Oakland homicide detective--from a Los Angeles Times Book Prize-winning author. Dr. Eldon Chance is a brilliant, lonely, forensic neuropsychologist with a long track record of getting involved with damaged, complicated women. While apartment hunting after separating from his wife, a series of bad decisions leads to Chance sleeping with a patient named Jaclyn Blackstone. Unfortunately her ex-husband is an Oakland homicide detective and the jealous type. Meanwhile, Dr. Chance meets a young man who goes by \"D\"; Chance believes he is a war-veteran, but he is in fact a deranged loner and self-styled Samurai skilled in the art of the blade. D is fascinated by Chance's tales of his tormented and increasingly dangerous affair with Jaclyn and advises him that her ex-husband will find a way to destroy Chance. As Detective Blackstone does indeed threaten the doctor, Chance and D plan a counter-strike. Meanwhile Chance continues his steamy affair with Jaclyn Blackstone (or is it one of her multiple personalities?) But the sexually voracious \"Jackie Black\" has a story that is far more complex and darker than he could have ever imagined ... Gritty, twisted, and impossible to put down, the surprises keep coming in Chance until the final page has been turned\"--",
        "authors": "['Kem Nunn']",
        "infoLink": "http://books.google.com/books?id=DqoxDQAAQBAJ&dq=Chance&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "\"Chance\" by Amir Aczel is an entertaining introduction to statistical reasoning as applied to daily life. It will provide a great deal of information to those unfamiliar with statistics or statistical reasoning. However, because of the brevity of the explanations, the reader often does not have adequate information to evaluate the hypotheses put forward in the text. This is particularly the case in the section on selecting a mate, in which a number is given based on \"e\" without any real explanation, and the section on Bayes's theorem, which does not provide enough detail to allow for adequate understanding or evaluation. The book also has some factual errors, such as the presentation of a poker hand in which one player is trying to draw to a flush in order to \"beat\" another player who already has a full house. I also think that some of the problems presented at the end of the book were not explained clearly.This book may be a good place to start for someone interested in the application of statistics to daily life but it will leave the interested reader thirsting for more details and explanation. If that was the goal of the author, he certainly succeeded. Perhaps he or other authors will write a book which addresses this need in the near future.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "In \"Chance,\" Dr. Aczel had a wonderful idea: Present the basic ideas of probability in a context that lay-people can understand. He engages the reader's imagination through real-life examples. Given the role that probability and statistics play in political reporting (through polls), the recent poker craze and investing, this book seems an ideal gift for just about anyone who doesn't already know anything about probability theory.Unfortunately, the execution of the book is severely flawed. The book is very poorly edited. In particular, many of the formulas contain significant errors. A probability theory novice will certainly get lost in this.In addition, in the section about 6 degrees of separation, he makes no mention of James Milgram's experiment. One can probably safely assume he is aware of this experiment, and I think that making no mention of it (especially as it brings sociology so nicely into the picture) was a mistake.Finally, the book is simply too short. The real text is only about 120 pages, with a large font and small pages. I was originally considering giving this book to my Computer Algorithms students as a helpful introduction to probability. Dr. Aczel does not, however, provide enough formulas and examples to make this useful.I highly recommend this book as a gift for those people who have never had a probability course. It will help acquaint them with some of the counter-intuitive effects that probability theory has on every-day life. Serious fans of math, however, should steer clear.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "The basic ideas are clearly and cleverly presented. However, it is little more than a very short text with a few examples. It is distracting to find the equations clumsily presented, and there are errors of content in addition to typos. It needed a knowledgable and diligent editor.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "Everyone knows that chance plays a huge role in our lives, in weather, auto accidents, and coincidental meetings, as well as in lotteries and other games. \"What are the odds?\" is a question we are faced with so many times a day that we probably don't even think about how many unconscious calculations we make trying to predict the future. Probability theory helps us do this; it is \"humanity's attempt to use pure mathematics to understand the un-understandable.\" So writes Amir D. Aczel in _Chance: A Guide to Gambling, Love, the Stock Market, & Just About Everything Else_ (Thunder's Mouth Press). It is a book of mathematics, but it is not intimidating. It is accessible and small, readable in an evening (but readers may spend much more time working on the sample problems), and may present few surprises to those familiar with the subject. The presentation, however, is brisk and clear, and serves very well as a primer to this branch of mathematics.The pretty red and white cover of the book simulates the back of a playing card, and games of chance are a big part of the subject. Not only do the games themselves get examined, but dice and cards give good examples of how probability may be calculated. But more complex life examples are given. As the title insists, probability theory can help you find love (or, for that matter, a good apartment or a companionable puppy). Let's say you are entering a computer dating service, and you expect as many as a hundred relationships, each of which you will experience and then keep that mate or move on. If you just stop at the first prospect, there is a one in a hundred chance that it is the best match for you; similarly, if you get through all 99, the hundredth prospect has a one in a hundred chance of being the best match for you. Neither of those odds is very good. The mathematically best strategy is to date the first 37 matches, and settle on none of them. This enables you to learn about what you are doing and how well the population measures up to what you want. And then, starting with the 38th one, take the candidate that is better than any so far. There's a chance you won't find any such candidate, because the best match was in the first 37 you sampled; but as firm as the mathematics is, nothing in love is certain. As Aczel jokes, \"Now, don't you wish your mother would give you advice like that?\"There is gambling advice. If you wish to avoid losing money at the casinos, don't gamble. Don't make the mistake that if the die just rolled a two, it is less likely to roll a two next time; dice, or roulette wheels, or all the rest, have no memory. If you have to gamble, and you have a big wad of money to blow, play it all on one big play; if you apportion the money in a series of bets, the money will only be chipped away by the odds that always favor the house. You can get advice on shuffling; a deck riffle shuffled five times still has pockets of order, but seven times will produce randomness. But mostly, this smart little book shows how probability makes a difference in our lives and in the way we think about things. Here you will find the answer to the problem about whether those monkeys on typewriters would ever really produce _Hamlet_, why it always seems as if you get to the bus stop just after the bus has already gone rather than just before it comes, why good things seem to come in threes, and why you should expect in a room of 23 people that two of them ought to have the same birthday. It's an entertaining brief overview of a classic subject.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "'Chance' by Amir Aczel is lucid in language. It covers the fundamentals of probability theory and relates the mathematics to interesting real-life scenarios. The explanation of Bayes' Theorem is especially good.However, from the perspective of a lay reader, the book is confusing at some places. For example, in Ch. 2 it refers to 'outcome' and 'event' but the word 'outcome' is seldom, if ever, used in the rest of the book. The distinction between these two is not clear from the book. In Ch.7,it mentions that the feeling (that there should be equal number of heads and tails at any given point on tossing a fair coin) is 'indeed true- but only over the long term'. However, in Ch. 11, it mentions that 'as the number of trials (tosses of the coin) increases, the probability of an even split becomes smaller!'. These two statements are conflicting.There seem to be some issue with printing the formulas on pp.48, 49. And, the book suddenly jumps into a discussion on probability distributions in Ch.17 without any explanation of what a distribution is about.While the answer given for problem #22 is correct, the formula shown in the answer is wrong.A book attempting to popularize and de-mystify the mathematics, I believe, should explain the apparent contradictions and misconceptions and stimulate the reader to go beyond the book. I do not think the book really stimulates any further reading.Not withstanding these blemishes, the book is worth reading once, but is it worth keeping in a personal library? I am not sure.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This tiny book leaves one with the impression it was knocked off over a weekend. The topics chosen in the book are intriguing but are only mentioned in summary and nothing is dicussed in depth; most results are simply stated without adequate justification or proof. One feels like asking \"where's the beef?\".Any interested novice or high school student curious about these selected topics will be most frustrated by the many errors and poor or misleading type-setting. Did this book have a proof-reader?Errors or typos are on pages 48,49,96,97,115,116,128,129.The Notices of the American Mathematics Society, August 2005 issue, reviewed this book but Professor Durrett, the reviewer, was far too kind. He did criticize the cost per character and concluded that the book was no bargain but he never mentioned the errors.In conclusion, this is a hastily written book which needed far more \"meat\" as well as a proof-reader. Get it from the local library if you must but don't waste your money buying it.Gill Valk",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Very fun book, but had me wanting a lot more. One thing that was nice, was that it was so short, it made me feel a lot smarter than I am when I finished it in half a day.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Chance: A Guide to Gambling, Love, the Stock Market and Just About Everything Elseby Amir D. AczelThis is a good basic intro to probability. It is accessible but it does have some equations in it. It gives the reader some concrete examples like the birthday problem that allow them to understand important concepts like random distributions. Probability and random events play a huge part in people's lives. This book can help people only slightly familiar with these concepts to get a better grasp of them. Do not put too much stock in the title it will not help you much with any of that.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Surely, this book about propability is written for thelayman. But even if you are little more expert than that,it is quite good. I certainly enjoyed walking through memory lanein theory that I once learned in a probability course atUniversity.The examples are many - and very thought provoking. Fromtime to time the theory is only touched upon lightly - but noproblem - Wikipedia.org (or other internet sites) might helpyou with the finer details of e.g. Bayes theorem,the secretary problem or what ever you mightwant more details on.And isn't it nice to know that you will have a0.0005 chance of dying in a car accident if you live5 years in France, or a 0.9999984 chance of surviving20 flights this year. Or if 10 people gather in aroom there is a 12 % chance of a birthday match. With 23people in the room there is 50 % chance of match.You can't live without that kind of data!-Simon",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book covers alot of ground in discussing topics in probability without becoming too technical. The book is succinct, easy to read, and seems that is was meant to pique one's curiosity in probabilities teaching some interesting principles and ideas. These ideas could be further expanded with more of a specialized and more technical probability textbook.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the rookie a season with sidney crosby and the new nhl",
        "description": "Sidney Crosby has already been hailed as the NHL's next saviour. Young, bright, photogenic, personable, and a media darling, the only question that remained was whether he could handle the big time. From an international advertising deal with Reebok to a season that seems to go from triumph to triumph--with a little argument from Don Cherry along the way--Sid the Kid has proven that he already is the man. In the tradition of A",
        "authors": "['Shawna Richer', 'Roy MacGregor']",
        "infoLink": "http://books.google.com/books?id=mirlAAAACAAJ&dq=The+Rookie:+A+Season+with+Sidney+Crosby+and+the+New+NHL&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "An objective review of this book from me is impossible. But a fair one, the book more than deserves. Late in the text, Ms. Richer gives a speech, or at least an anecdote, some advice she was given as she wrote this book, on objectivity in writing: \"But objectivity ... is not necessarily a worthy goal. To be objective in the literal sense would be to remove all emotion from the coverage, and sportswriting at its best can only be worthwhile by embracing and exposing emotion and all the things that fuel it. Fairness ... is the tone you want to strive for.\" So I give Ms. Richer and her book a fair deal, but not an objective one, as I am emotionally attached to the subject matter.I lived in Pittsburgh for over 30 years and am a die-hard Penguin fan. I know the entire cast of characters in this book, what they look and sound like, including the indefatigueable Tom McMillan, Penguins Vice President of Communication, who is a major player in the story. I can hear Mike Lange's voice calling out the plays, and Phil Bourque's commentary, on the air or not. I can picture the Igloo (the Pens' home arena) with snow on it, or the rolling hills of Upper St. Clair (Ryan Malone's home neighborhood). From Molinari to Mario, Sewickley to the Steelhead Grill, whether you are from Pittsburgh or not, you too will settle into this story as if you were hearing it from a friend in your own neighborhood.Shawna Richer gained the enviable assignment of chronicling Sidney Crosby's first year in the NHL with the Pittsburgh Penguins. This is a significant season for two reasons - Sidney Crosby is not just another hockey player, and this wasn't just the mere beginning of another hockey season. Crosby, a native of Nova Scotia, was the most anticipated rookie since 1984, when Mario Lemieux was taken first overall (also) by the Penguins, the same draft in which Crosby's father was selected. The NHL was also making a debut of sorts. After an owners' lockout of the players had cancelled the previous season in its entirety, the revamped league was back for business.A new collective bargaining agreement had finally been reached by the owners and the player's union. The owners had conceded to revenue sharing which would allow small market teams to survive financially. The players conceded to a salary cap, which would allow owners to survive financially. The league would benefit from the parity that this arrangement breeds - all 32 teams able to compete with each other, year after year.League executives restructured and reinforced the rule book during the unfortunate lull. Their intent was to free the game from the stifling \"clutch and grab\" style of defensive hockey and allow for a faster, more skilled, offensive game. Showcase the league's more talented players. Give the old fans something to cheer about, and try to lure new fans to the speed and grace of the game. As a player with \"once-in-a-generation\" ability, 18 year old Sidney Crosby would be shouldered with the mantle of the \"new NHL\". From the time before he was even drafted, Crosby had been labeled as \"The Next One\", and after a full lost season, the league looked to him to win fans, old and new, to the game. Even though he didn't ask for it, the youngster understands his role and carries it out with a gentle passion as fierce as the one he brings to the ice.Ms. Richer tells the story well. The Pittsburgh Penguins, like most of the small market teams in the NHL, had been losing millions of dollars every year. Unable to pay premium salaries, one by one, their star players left or were traded. At the conclusion of the previous season, the Penguins had finished last overall. Under the new arrangements, the Penguins would be able to surround Crosby with veteran talent. And they did so, turning into a contender within a few weeks.The league literally took off and the fast, exciting pace of the games silenced every pre-season criticism of the rule changes. Crosby's season took off too, but had several unimaginable bumps. His coach was fired in December. There was a slight but sustained backlash from some fans and players against Crosby. In one six day span, both of his linemates retired, and the team was put up for sale by the owner, Lemieux. The same Mario Lemieux who was 1984's once-in-a-generation rookie was now, not only the team's owner, but one of the retiring linemates.Richer was there for everything and delivers each high and low in a straight, readable narrative. She quickly (p15) pays homage to Peter Gzowski's exemplary hockey book, The Game of Our Lives. (Anything written on the subject since 1981 should.) The Rookie is given a similar form by the author, announcing the time and venue of significant games, going through the Penguins roster with a short paragraph for each player, and weaving her experiences and inferences into the text.The book falls short of the insider's look and analysis I expected from the subtitle (A Season With Sidney Crosby and the New NHL). It seems like Ms. Richer is barely below the surface of Crosby the individual, the Penguins as a team, the \"new\" league as a whole, and Canada's reaction to all of the above. I, however, do not know what is acceptable to print about the inner workings of an NHL locker room, so it remains to accept Ms. Richer's coverage and interpretation of events.Even after the Penguins are disappointingly eliminated from playoff contention, Ms. Richer is able to keep the reader's interest with drama appropriate to the tale. How would Crosby handle playing on a loosing team? Would he be voted Rookie of the Year? Would he be able to achieve certain milestones like being named to the Canadian Olympic squad or reaching 80 points on the season? How would Sidney Crosby's first season and the \"new\" NHL turn out? You'll want to read this book to find out.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This behind the scenes book about Crosby's struggling, but amazing rookie year is very well-written and interesting. However, I did find myself grimacing over recapping what a terrible season the Penguins had, but in the end I think it was a very fine read.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I loved this book! Richer provides great detail and has a keen aspect on every situation. I couldn't put this book down and finished it very quickly. I highly recommend this book to any Sidney Crosby fan that wants to learn more about him, or anyone that thinks he is just a hot-shot in order to find out how hard he has worked for this.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "bridge odds for practical players master bridge",
        "description": "Anyone who learns the principals set out in this book need never again be accused of playing against the odds. Backing outsiders has ruined many a punter at the bridge table as well as at the race track. Few players have any idea of how to harness the odds to solve problems that constantly recur. Which is the best line of play? Is it better to finesse or play for the drop? Will the diamonds break? Can the chances be combined? What are the exact odds? Here is a simple guide to solving the problems that arise in assessing the odds in play at bridge. Keeping theory to a minimum, the authors show by means of many practical examples how to calculate the odds and how to come up with the right answer at the bridge table. Anyone who learns to apply the principles set out in this book need never again be accused of playing against the odds.",
        "authors": "['Hugh Walter Kelsey', 'Michael Glauert']",
        "infoLink": "http://books.google.com/books?id=tO1XHAAACAAJ&dq=Bridge+Odds+for+Practical+Players+(Master+Bridge)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've read several of Kelsey's books, and the problems he gives are often rather difficult. Those in this book are usually easy, however. And that is how it should be. Most decisions at the bridge table are pretty easy. You just need to make the right ones consistently.After a brief introduction to basic probability theory, Kelsey tells us about the odds for distributions of missing cards. The next chapter is on how to play various card combinations in a suit.After that, we practice combining chances as a declarer. We learn to play for a drop in one suit before taking a risky finesse in another, and so on.Next is a chapter on care of options. Sometimes, the opponents will remove one of your options. Sometimes, you will remove one of theirs. We learn to make some straightforward plays that take all this into account.Of course, one elementary aspect of bridge is that the odds change as the hand is played. If an opponent shows out of a suit, or gives you other information about the distribution of cards, the odds can change. And Kelsey expresses the change in odds by the number of \"vacant places\" that remain undetermined.The final elementary concept in bridge odds is generally referred to as \"restricted choice.\" Kelsey finds this term confusing, so he calls it \"freedom of choice.\" A simple example is when you have nine trumps, missing the Queen, Jack, five, and four. With the Ace and King in your hand, you try the Ace. Your left-hand opponent drops an honor! Before that happened, you would have played for the suit to split 2-2. But you now realize that there are only two kinds of hands your opponent could have started with: a singleton honor or both honors. There are two hands where your opponent has a singleton (singleton Queen and singleton Jack). And only one hand where your opponent has both honors. So the odds are nearly 2 to 1 in favor of finessing on the next round of trumps. That's a basic concept one has to know in bridge, and Kelsey gives some more examples of it.This book is easy to read but teaches some valuable lessons. There is only one statement I seriously disagree with in it, and naturally, it is not about bridge. Near the start of the book, Kelsey asks about the probability of a \"tossed coin\" to come down tails if it has come down heads nine times running.Kelsey is trying to explain that the chance of tails is not greater than 50%. After all, the coin has no memory. It is not going to come down tails just to even the odds! Kelsey says that each toss of the coin is a separate 50% chance.Well, that's not quite true. The chance of it coming down tails is not 50%. After all, there is only one chance in 512 of a fair coin coming down heads nine times running. The chance may be considerably greater if the coin (or the toss) is not fair. If the coin is two-headed, the chance of nine straight heads is 100%.Clearly, the chance of tails on the tenth throw is less than 50%.I recommend this book.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "While the calculation of the odds is interesting this is a practical book as well as a methematical one. Theer are numerous problems where teh reader needs to improve their chances by combining plays. Such as playing AK of a long suit to see if the Q drops before taking a finesse.Not only is the information useful, its well presented adn enjoyable to read.The math is not especially dificult and if you want to become a good player you should be aware of this. I put it under \"knowing your fundamentals\"I liked this a lot more than the Vivaldi book. The Terence Reese book \"Master the Odds\" was ok, this was better.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is for advanced players that are willing to make it into the championship level. Describes not only probabilities, but also odd changing, vacant places, chance combination and more.Highly recommended.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "blackjack attack playing the pros way",
        "description": "Blackjack Attack is the book that every professional player packs in his suitcase to put a dollars-and-cents value on the fine points of play.",
        "authors": "['Don Schlesinger']",
        "infoLink": "http://books.google.com/books?id=zj-ougEACAAJ&dq=Blackjack+Attack:+Playing+the+Pros%27+Way&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've bought several good books on blackjack (The World's Greatest Blackjack Book, Best Blackjack, Blackjack a Winner's Guide, Professional Blackjack, Beat the Dealer, Theory of Blackjack, Burning the Tables on Vegas, Blackjack Attack) and the two best are Burning the Tables in Vegas (BTV) and Blackjack Attack (BJA). In BTV it covers counting along with the entire lifestyle and behavior needed to prosper in the casino playing blackjack. In BJA Mr. Schlesinger covers every significant detail relating to the modern game. His famous &quot;Illustrious 18&quot; play variations gives the beginning player 90+ % of the advantage available though card counting in one very simple package. Throughout the book he uses several other blackjack authorities (some are authors of the above mentioned books) to verify his findings on many of the finer points of the game. This book assumes you already know how to card count using the most popular basic card counting system in use today, Hi-lo. This system is covered comprehensively in most of the other books forementioned.PEace",
                "review/helpfulness": "45/46",
                "num_reviews": 46
            },
            {
                "review/text": "Blackjack is not that hard to play. But Schlessinger makes it sound as if we're dealing with intricate brain surgery. We aren't. If you want to know the &quot;secret formula&quot; of professionals you might consider this. If you play games with deep penetration, count cards in these games, structure your betting to get to double the number of decks you are playing against when the count is positive, and get that money out there in high counts, you will win. It is that simple. Schlessinger's book is truly ludicrous in its intricacies. His math isn't wrong, it just isn't necessary to play winning blackjack. If you are looking for good blackjack books to give you a handle on this game, look elsewhere.",
                "review/helpfulness": "15/24",
                "num_reviews": 24
            },
            {
                "review/text": "This was the third blackjack book I've read, after KO Blackjack and The World's Greatest Blackjack Book. I read that Don Slessinger is the greatest auhtority in the world on blackjack. Maybe he is, maybe he isn't. This book was incoherent. I found World's Greatest Blackjack Book much better and KO Blackjack was also better. I learned a few things from this book but not enough for [the price]!",
                "review/helpfulness": "13/20",
                "num_reviews": 20
            },
            {
                "review/text": "All serious blackjack players own this book. It is a good read and a frequent reference. Chapter 9, on risk of ruin, is important reading for serious gamblers. Ch 10 is a very good quick reference to find the relative favorability and win rate approximations for hundreds of the permutations of rules, number of decks, and betting strategies for blackjack games. I'm a professional gambler and I refer to this book often. It easily ranks among the five or six &quot;must own&quot; books in the field of blackjack.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "Blackjack Attack is an excellent book, and has been very well received by a most critical audience -- visitors to BJ21.com, the busiest blackjack web site. The material in the book can be valuable to you if you learn to count cards to win at blackjack in casinos.Stanford Wong",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "There is much mathematical theory on blackjack. I have read pretty much all the major books on blackjack, and read most all its theory. The problem with some blackjack books is that it's based on bad mathematical theory. The problem with most of the other books is that it discusses the theory and math behind which a winning foundation can be built, but leaves the implementation of that theory at the casino table up to you.Some writers do a passable job at addressing the application of blackjack mathematics at a blackjack table. Some leave you on your own to guess a lot of it. But to date, I have seen only one author, in one book, who crosses both realms perfectly with an uncanny gift to pick out what's relevant, dismiss what's not, and then apply that knowledge to answer virtually every important question that can be asked about blackjack.This is the book.This is not a basic blackjack book. It assumes you already have one of those, already know a count, and wish to put it to work in the most effective manner possible. If you fall into this category, this is the book you've been waiting for all these years.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This will be a classic book in the blackjack world just like Super/System is for poker.1) Yes the book goes into a lot of details, but this essentially proving his points. You don't want to blindly use the Illustrious 18 without knowing for sure that it is mathematically sound. I admit a lot of times the mathematical derivations get tedious but it's nice to know if you are industrious to use the methods for your own calculations.2) There is no counting system taught here; Don isn't a counting system producer. He is more of an player-analyst.3) For beginners, the stuff is probably way over your head. Otherwise chapters 10 and 11 are worth the book itself.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a graduate course on winning at blackjack, not a basic primer. The author is extrememly creative in applying elementary probability theory to the tough practical questions that confront counters on a daily basis.This should probably not be your first book on blackjack - but if you plan to give the casinos a run for their money, you MUST study this book.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is not a book in the traditional sense; it's really largely an anthology of Schlesinger's &quot;Gospel&quot; articles from Blackjack Forum magazine, dating back to the 1980s. Because of this, it's somewhat lacking in integrated cohesiveness, but it's a very valuable resource, nonetheless. Schlesinger covers most of the statistical aspects of Blackjack in a clear, concise and accurate fashion. In addition, Chapter 10, which is primarily the work of Schlesinger's collaborator, John Auston, is all-new and presents some very comprehensive game-selection and risk-of-ruin charts. All in all, an excellent and very useful resource for serious players.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Don Schlesinger has a special ability to take theory and original work and make it more practical and understandable.Chapters 1, 7, and 9 are excellent and chapter 10 is a book of its own.This book contains some excellent technical and mathematical content and Don trys to solve many problems.My only objections to this book is that most of the book is material from past Blackjack Forum articles and the author is a little biased on certain issues.Overall, it is must reading.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "evolution of cooperation penguin press science",
        "description": "A famed political scientist's classic argument for a more cooperative world We assume that, in a world ruled by natural selection, selfishness pays. So why cooperate? In The Evolution of Cooperation, political scientist Robert Axelrod seeks to answer this question. In 1980, he organized the famed Computer Prisoners Dilemma Tournament, which sought to find the optimal strategy for survival in a particular game. Over and over, the simplest strategy, a cooperative program called Tit for Tat, shut out the competition. In other words, cooperation, not unfettered competition, turns out to be our best chance for survival. A vital book for leaders and decision makers, The Evolution of Cooperation reveals how cooperative principles help us think better about everything from military strategy, to political elections, to family dynamics.",
        "authors": "['Robert Axelrod']",
        "infoLink": "https://play.google.com/store/books/details?id=GxRo5hZtxkEC&source=gbs_api",
        "review": [
            {
                "review/text": "If you read this book as long ago as I did, you probably first heard about it from Douglas Hofstadter's \"Metamagical Themas\" column in _Scientific American_, or the book in which his columns were collected. (If you're just now being introduced to this book, check out Hofstadter's too; his discussion of it is very helpful and insightful.)What Robert Axelrod describes in this book is a novel round-robin tournament (actually two such tournaments) in which various game-theoretic strategies were pitted against one another in the game known as the Iterated Prisoner's Dilemma. Each strategy was scored, not according to how many times it \"beat\" its \"opponent,\" but according to how many points it accumulated for itself. The surprising result: a strategy dubbed TIT FOR TAT, submitted by Anatol Rapaport, cleaned everybody's clocks in both tournaments.Why was this surprising? First, because TIT FOR TAT was such a simple strategy. It didn't try to figure out what its \"opponent\" was going to do, or even keep much track of what its \"opponent\" had _already_ done. All it did was cooperate on the first move, and thereafter do whatever its \"opponent\" had done on the previous move. And second, because this strategy can _never_ do better than its \"opponent\" in any single game; the best result it could achieve, in terms of comparison with the other player, is a tie.So it was odd that such a simple strategy, one that went up against all sorts of sophisticated strategies that spent a lot of time trying to dope out what their \"opponents\" were up to, should do so much better than all the \"clever\" strategies. And it was also odd that a strategy that could never, ever \"beat\" its \"opponent\" should nevertheless do so much better _overall_ than any other strategy.As Axelrod is careful to point out, this isn't always true; how well TIT FOR TAT does depends on the population with which it's surrounded, and in fact it wouldn't have won even _these_ tournaments if certain other strategies had participated. But TIT FOR TAT is surprisingly robust, and its success does offer some tentative political lessons.Axelrod spells them out, in the form of principles like \"Be nice and forgiving\" -- which means: never be the first to defect; be quick to forget what your \"opponent\" has done in the past. And in a follow-up computer simulation, he shows that it's possible -- under some conditions -- for a little cadre of \"cooperators\" to increase their numbers and \"take over\" a population that practices other strategies.Axelrod's research was and is important for several reasons, one of which has to do with evolutionary theory: it shows that, under the right conditions, natural selection can tend to generate cooperation rather than competition, even among actors who act solely out of self-interest. Another has to do with the spontaneous growth of cooperative behavior in predominantly competitive or hostile environments (Axelrod's examples include holiday cease-fires in the trenches during the First World War). Yet another has to do with the need (or otherwise) for external authorities to _enforce_ cooperative behavior -- a point not lost on Axelrod's libertarian and/or Hayekian readers, including myself.Nevertheless, as groundbreaking as this work is, the results are modest and Axelrod states them very cautiously. TIT FOR TAT doesn't _always_ \"win,\" and in any case not all of our social interactions can be modelled as Iterated Prisoner's Dilemmas. It's a _very_ hopeful book, but readers will want to be careful not to claim more for Axelrod's results than he claims for them himself.In short, this volume is a solid piece of political-sociological-mathematical research that has stood the test of time and stimulated all sorts of follow-up work. I expect it will be read for a long time to come -- this conclusion being a simple extrapolation from the fact that I've been reading it for almost two decades now myself. It's fascinating.",
                "review/helpfulness": "102/107",
                "num_reviews": 107
            },
            {
                "review/text": "Sometimes, the individual benefit seems to conflict with the benefit of the community as whole, even though the community includes this very individuum. One such example has been formulated as the Prisonner's Dilemma: two suspects, A and B, are arrested, and kept separated so that they cannot communicate. If they continue to cooperate, they will be both sentenced to one year. However, if suspect A cooperates, but suspect B defects, A is going to be sentenced to five years, and suspect B will be released. Vice versa, if B cooperates and A defects, A will be released and B sentenced to five years. Finally, if both defect, they will both be sentenced to three years each.It is clear that the best solution for both of them is cooperation. On the other hand, each individual is also tempted to maximize his own individual benefit. And each of them benefits most if he decides to defect, which in turn brings the worst possible outcome for both (six years total). So one-shot Prisonner's Dilemma rarely leads to cooperation. Now, what if the very two chaps are later arrested again? Will they cooperate when given another chance? Or if they know they will face the same situation every five years? Professor Axelrod tested the iterated Prisonner's Dilemma with computer programs, and investigated under which circumstances cooperation can emerge.The book is nicely scattered with fragments of game theory and examples from world politics. All in all, as Richard Dawkins has commented in the foreword to its British edition, in breathes with optimism, and is a delight to read. Still, it has one problem, and actually shares it with Dawkins: the book reaches its climax right at the beginning. The book starts with a strong and very convincing idea, but later fails to keep the same pace of dynamic. The idea is splendid, but the structure of the book could be enhanced.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "This book has a wonderful first chapter that Axelrod repeats throughout the book. Axelrod uses computer simulations to develop game theory and devise strategies that result in collaborative behaiviors. While Axelrod's findings can be applied to other fields, such as politics or interpersonal relationships, it should be noted that Axelrod is dealing with very precisely (and arbitrarily) defined initial conditions and constraints that are not at all gauranteed to exist outside the world of computer simulations. Generally speaking, the first chapter is excellent and offers a ray of hope that collaborative behaiviors can and will evolve on their own; on the other hand, the rest of the book is repetative and highly arbitrary.",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book has information for military theorists, biologists exploring gene regulation, antitrust policy-makers, and Miss Manners. It is a wonderfully clear explanation of how almost any two entities, interacting over time, develop a mutualism more profitable than greed.The experimental support for these claims comes from a series of contests. Dozens of authors provided computer programs to play in the Iterated Prisoner's Dilemma - a simple model, but one that describes a surprising number of real-world phenomena. Most importantly, it's a testable model. It almost puts a common aspect of social interaction into a test tube. What came out of that test tube was startling in its clarity and simplicity.The book is very readable. Axelrod segregates the mathematical and non-mathematical discussions with some care. Math-free readers see the whole set of experiments and conclusions, clearly explained, and need to skip only a few paragraphs during the main discussion. The last few chapters reward math-positive readers with additional precision and rigor. Even then, the math is accessible to someone with good high-school algebra skills.Axelrod's discussion truly timeless, except for references to the Cold War as current events. I can accept that. Even though that un-war is mostly over, it's a critical part of modern history and it still informs current policy. Any insight into that madness helps, and Axelrod is very helpful.This book stands above any one category. It's one of very few that I recommend to the bookshelves of every educated person.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Amidst the glowing 5-star reviews I feel the need to interject some concerns and outright criticisms of this book, although I do recommend its reading. Certainly the book provides a relatively good starting point in a very complex area, but it should not be construed as the final word on a much more complex subject. I do think that R. Axelrod provides an excellent, if at times overbearing, presentation of how game theory, specifically in the realm of an Iterated Prisoner's Dilemma (IPD) scenrario, can explain a number of historical as well as daily situations. He goes on to expound on some good generalizations on how people might act to inspire more cooperation and these generalizations, if implemented by people (groups, governments, etc.), might result in a more cooperative world. For this, there are good things to say. But I would caution not to create from this any utopian potential for the real world.The `winning strategy' of TIT FOR TAT (TFT) works because it starts out `nice' but it retaliates immediately if someone else does not `play nice', too. So this is not vision of world cooperation. It is a realistic vision of maximizing cooperation under specific conditions which he covers relatively well towards the later chapters. Ultimately, the natural take away is a hopeful view of a potentially more cooperative environment, with perhaps a bit of forgetting that unkind retaliation is an integral part of his winning `cooperative' strategy.Here are some aspects which Mr. Axelrod alludes to but somewhat minimizes, in my opinion, in their impact on TFT's potential for success in real world interactions:a) The IPD strategies, which were submitted by experts from around the world, were submitted to computerized testing to determine which strategies `win' the most. This is based on an established point system that awards different points for different actions by two players. (This is summarized in one review already, so I will not repeat it here.) While this makes the playing of the game easy and consistent, it does not reflect the real world conditions which often exist. For example, if, in one turn, one player `defects' and the other `cooperates', the point system says the defector `wins' 5 points and the cooperator gets nothing. Are all defections `equal' in the real world? Or are some interactions far more important than others, so therefore cooperating on small things but defecting on bigger things might result in different outcomes than would ever be accounted for in the point systems used in these studies? Intuitively, a major defection may have far more significance (i.e. point value) than a minor one, but to accomplish his analysis, Axelrod's point structure is always the same.b) Related to the above, are all joint cooperative efforts or joint defections `equal' as implied by the point values? (When two strategies cooperate, each is awarded 3 points. When each defect, they each get 1.) At the time this book was being published, an interesting `real world' example was playing out which would question this very assumption. At that time, Reagan was building up the military and the Soviet Union was `matching' the build up. You can either view this as mutual defection or mutual cooperation, depending upon whether you view cooperation as always a `positive' thing. In any event, the results of these mutual actions were NOT equal. The US had far more resources to invest in the game so each time `points' were awarded, the US actually gained more than the Soviets who eventually had to stop playing. Consistent point values simply do not account for this, unless one wants to interject additional elements not presented in Axelrod's work.c) Related to point b), the IPD study presents things from a vantage point that each actor starts out from an equal footing and therefore the only functional question is whether one strategy consistently wins in such a way as to keep near the top of the point standings. In reality, rarely does any person or group begin interaction on an equal footing. What I am trying to raise is not the same as his discussions in Chapters 8 and 9 on the strength and growth of various strategies in a world starting out with many different strategies. In those scenarios, some strategies die out because they stop having sources of points to take from others. But what if each strategy starts out from an unequal basis, some having significantly more `capital' to expend and coupling this to a more realistic scenario where each interaction is not free, but each has a cost to the participant (somewhat like putting your bet down before you play poker - you may win or lose, but if you lose your position is not the same as when you started, it is less than when you started). In such a scenario, which is more realistic in terms of how companies, governments and even people interact, the results would be materially different. So the starting premise of Axelrod's IPD scenario and point schemes may be so well constructed as to make for interesting descriptions of some specific and even common interactions, but it may be too well constructed to be able to be extrapolated to many more complex situations.d) Another weakness is the assumption that all defections are of the same magnitude. If, in an otherwise nice political campaign (ever seen one of those?) a small, third party candidate launches an attack ad and the attacked major party retaliates, is the retaliation equal? Or, again, does their starting point allow them to annihilate the attacker? (Since I have never seen a positive political campaign, you can interject any other similar scenario which might actually come up in real life!) The `equal points for equal actions' premise is inherently flawed. Yet this is the basis of much of the book's conclusions.e) What is the end result of a universe where everyone uses a TFT strategy? This is only marginally considered, at best. While the issue had been in my mind throughout much of the book, it was not until fairly late that Axelrod makes clear, albeit briefly, that in any set of two player interactions, TFT will at best result in the same total number of points as the other player and, for a number of reasons, probably slightly less. In other words, the person, company, group or government using a pure TFT strategy must be happy being close to the best in whatever the interaction. Personally, I am fine with that, thank you! But to assume that everyone is and that nobody will come up with a disruptive strategy that, perhaps only for a time, garners more points but winds up putting them on top of the heap in whatever competition may be in play. If the end game is the Superbowl, being second is not gratifying. Ask Philadelphia.f) Finally, I found some of the descriptors attached to the strategies interesting, especially in light of Axelrod's ending recommendations on cooperation. Some strategies which attempted to use planned defection as part of their strategy were labeled as `meanies' while other strategies that started their initial moves with cooperation were labeled as `nice'. I find it interesting that a `scientist' would use such descriptors to classify things given that they bring with them connotations. Even TFT could be construed as a `meanie' since one of its logical outcomes is that it cooperates once, and once only, only to defect from then on based on the other parties action. Are all non-cooperative interactions except one inherently more `nice'? This is not important in the scope of my real concerns, but I always sense a red flag rising when an otherwise objective presentation resorts to affect-linked labels to make part of its case.All of the above is NOT to imply that I think Axelrod's work is wrong and should be thrown out. I simply felt that, unlike the rest of the glowing reviews, Axelrod's work does not go far enough and leaves some gaping holes yet to be explored. Read this book, but keep your eyes and mind open for the flaws which seem to be thinly covered with papier-mch&eacute;.",
                "review/helpfulness": "18/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book is a must-read not only for students (broadly defined) of the social sciences, but also for politicians and bureaucrats, especially those in charge of military and foreign affairs. Axelrod's book is a tour-de-force in multi-method approaches. Although the author is a trifle repetitive and occasionally laborious, I think the profound content of the book far outweighs the minor inadequacies of its form. At the risk of sounding like a logical positivist, I would venture to say that Axelrod's approach offers hope for a bottom-up construction of cooperation in an uncertain world without a central authority.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "\"The updated edition includes an extensive new chapter on cooperation in cancer cells and among terrorist organizations.\"WHAT?? I bought this, with the new preface and cover, and it DID NOT CONTAIN NEW MATERIAL IN THE BOOK. I wrote the published, and THEY DID NOT REPLY. Crappers.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "If you're an intellectual and want to read a book that will change your perception of many facets of the world forever, this is the book for you. It's not a long read, but you will spend a lot of time thinking about all its implications as you read it. I found it applicable to everything from inviting people to parties, to business and personal relationships, to species competition, to wondering whether a theoretical race of super-powerful extraterrestrials would enslave us, to... Well, you just have to check it out!I'm reading the sequel (&quot;The Complexity of Cooperation&quot;) right now, which is also amazing. In it he quotes a letter written to him about EoC by a woman who claims that the principle developed in it helped her with her divorce proceedings! How can you miss a book with such broad applications.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "In 20 to 50 years people will look back on the experiment described in this book as one of the very important events at the end of the 20th century. There is a section of the book that nearly forces you to abandon it, the mathematical description of the famous prisoners dilema game. But if you get past that point , it just gets more fascinating the more you read it and think about the consequences. Short descriptions of this experiment will appear in a lot of good books, but it is nice to get the complete description of the experiment, along with the author's projections of its implications in such a short wonderful book.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "A lot of interesting material is spun up from a simple premise: a two round tournament of programs for playing Prisoner's Dilemma. Game theory is one of the great cross-disciplinary topics. As the web is woven with nodes as distinct as Jean Jacques Rousseau and why the Japanese bombed Pearl Harbor (a personal favorite for Socratic historical discussions), somehow it not only all makes sense, but you are left with the impression that the topic and the book combine to achieve the brass ring of writing: repeatedly fetching the proufound while remaining clear and simple. (Ironically, this book makes a good companion to readings on Complexity and Emergence. But that makes some sense since those topics have turned to automata and the realization that complexity is most often a function of simple constituents iterated.)The read this and pass it on advice from the other reviewer here is good, and apropos, as this is about the infection of cooperative strategies in populations.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "billiards as it should be played",
        "description": "Willie Hoppe dwells on the ABC's of the game - the stance, grip, bridge, stroke, etc., before going into fundamental shots, and rules to following order to make them easily. The instruction set forth in this volume is intended not only for those who desire to begin playing after they have grown up, but for those players who have started out on the wrong foot, those others who want to improve their game, as well as for the youngsters. This book contains classic material dating back to the 1900s and before. The content has been carefully selected for its interest and relevance to a modern audience.",
        "authors": "['Willie Hoppe']",
        "infoLink": "https://play.google.com/store/books/details?id=A0x9CgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Willie Hoppe provides you with everything needed by dedicated person to become competitive in 3-cushion billiards play. He begins his book with the proper selection of a cue stick for playing billiards, then for thirty pages of text, detailed diagrams, and clear photographs, takes you through the fundamentals (stance, balance point of the cue, bridge, cueing the ball, stroke, english, and speed). The next twenty pages introduce you to the carom (natural, follow, and draw) and the use of the rails in cushion caroms and straight rail billiards.The second half of the book is dedicated to the game of 3-cushion billiards. In it Mr. Hoppe outlines the key shots of the game, misunderstood shots, and finally the science of the game. He discusses why english curves the path of the ball, the effect of the nap of the cloth on the table, the effective size of the target, long and short rolls, and the various diamond systems. His explanation of these systems alone is worth the price of the book. It is complete, detailed, and, most important, clear.In all, this book is exceptionally dense with information. Even after twenty years of use, each time I come back to this book, I gain a greater understanding of the game. It combines clarity of description with 95 well though out diagrams and thirty-seven black and white photographs. All in all, it is one of the best explanations of the royal game to ever have been published. Players of all levels of experience and skill will find something of value, and most will find enough to keep them learning and improving their game for many years. If you have the dedication of purpose to work your way through his approach to learning billiards, you too can become a Player (with a capital &quot;P&quot;) using this book alone. As Willie Hoppe says in his forward to this book &quot;You or anyone else who reads these instructions can become a good billiard player beyond the shadow of a doubt -- if you follow them.&quot; I agree, and I think you will too.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Of the dozens of books and videos I have read and viewed, there is no better discussion on the mathematics and subsequent use of the diamonds. Very few authors even touch on this subject. Mr. Hoppe also explains in detail the use of caroms, english and how to determine the path of cue and object balls after they make contact with each other. All guess work is removed because Mr. Hoppe uses scientific principles in his discussion of this grand old game.On another note, I found this book in a small bookstore in a small town fifteen or more years ago. I lost this book ten years ago and have not been able to find it anywhere. I now know that it is out of print.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "infinite game universe mathematical techniques advances in computer graphics and game development",
        "description": "A working level of mathematics is necessary for advanced game development, and this unique reference provides the concepts and insights needed to master this challenging material. Covering the topics of random number generation, number predictability, probability, and fractal generation, various possibilities are explored and outlined with the goal of creating an ?infinite game universe.? This upper-level reference guide will provide programmers with the cutting-edge tips, techniques, and reference materials they can use to create an exciting gaming environment. All of the algorithms and source code are included on the CD in C++ for optimization and manipulation.",
        "authors": "['Guy W. Lecky-Thompson']",
        "infoLink": "http://books.google.com/books?id=dp7BwAEACAAJ&dq=Infinite+Game+Universe:+Mathematical+Techniques+(Advances+in+Computer+Graphics+and+Game+Development)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Infinite Game Universe is based on a concept derived from the game Elite, of which I have happened to play extensively in my former gaming life. The overall idea behind this book is outstandingly stimulating, that being the use of mathematical equations in place of rampant memory use in order to create games with limitless dimensions of play.Unfortunately, most of the actual specifics detailed in the book were yawners and I nodded off more than once trying to read this book. It had the flair of your typical college textbook. For example, a good 1/3 of the book is dedicated to writing and analyzing your own psuedorandom generators and I found this to be a good example of excess.However, I am not actively trying to create an infinite game universe and it is quite reasonable that there are some people out there who would enjoy the specifics far more than I did. I picked up a couple cool ideas and the importance of the &quot;infinite game universe&quot; concept was emphasized by the very existence of this book! It is almost worth adding to your shelf as a reminder that there are patterns in this world that can be represented in better ways than 80 Megs of disk space. (Remind me to mail my copy to Bill Gates one of these days.) And, this concept has quite a future in the embedded world where resources will be quite limited for a new wave of interactive media &amp; games.Overall, I enjoyed some examples in the book and did not consider this to be a poor use of money. And I applaud the author for detailing the physics of the &quot;Infinite Game Universe&quot; because if more programmers considered these methods, we'd all have a little more space on our hard drive and games that provided a lifetime of adventuresome play!",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "I was interested in the book based on its title, which is very pertinent to both my professional and academic interests. A procedurally generated universe is a powerful (but not a very new) concept.Anyway, aside from being a reminder (as another reviewer put it) that this field has potential and is growing, this book was overly verbose in describing vague, undetailed ideas. The examples were poor. There was never any &quot;hard&quot; math (one wonders how it got in the title). Most of the ideas were no-brainers. I felt that many of the solutions that were presented, were solutions that many people would come up with on just a few minutes of pondering. After having read 2/3 of the book, I wanted to hurry and finish just to get it over with. I was not the least bit stimulated by the possibilities, as none were offered that I hadn't already thought of just daydreaming. In fact, the book is so dry, it tends to take the excitement out of the subject. Even the section on Fractals--which I looked forward to the most--was completely lacking.In conclusion, I'd say that the important material could have been condensed into a thirty page paper on random number generation with some commentary on its application in video games.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "The \"universe simluation\" view of game design draws on a diverse array of topics in computer science: random number sequences, cellular automata, neural networks, fractals, formal languages, scripting, object-oriented systems, physics, algorithms, data compression, artificial intelligence. While Thompson's book manages to touch on most of the above, no topic is explored or applied in any real depth, and the difficult prose hinders reading.The text is full of off-hand references to the classic computer game \"Elite\" as an example of an infinite game universe, but awfully short on specifics. A few hours of web research into gaming sites would have filled in the blanks. Even more shocking is the omission of \"Starflight\"---a groundbreaking computer role-playing game that used a good number of techniques in this book (i.e. fractal terrain generation) to support hundreds of detailed, explorable planets and star systems, each with its own atmospheric conditions, mineral deposits, ancient ruins, and mysterious life-forms. All that crammed onto a 720K disk---surely of great interest to this book's audience. Why is there no coverage of this classic?Likewise, I can't understand why the author provides an illustrated reference to \"R-Type\" --- the most predictable shoot-em-up game ever --- while not mentioning the massive, still-unequaled world-simulation that was \"Ultima VII - The Black Gate.\"What exposition remains is obscured by the awful writing style and distinct lack of mathematical rigor.What should you read instead? I recommend \"The Computational Beauty of Nature\" for the math side, \"The Official Book of Ultima\" for the design philosophy; you can read up online about the relationship of object-oriented systems to simulations. For people who are thinking about game design, read up on Interactive Fiction and some of the old papers applying discrete maths to storyline, plot, character, environment. I've been planning for years to write a book on these types of games someday---perhaps it'll be sold on Amazon? :-)",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a good book for game programmers who are just starting to realize that the need a background in mathematics to reach the next level in the careers.Other audiences will not really like the book. Mathematicians wanting to know more about gaming or graphic techniques will find the math lacking. There is not enough action to keep game players from yawning. There is no cut and paste code for second rate programmers to plagerize. Only a narrow audience will really find the book of interest.I am really happy to see this book on the shelves. Game programming is a multi-billion dollar industry. Many of the people got their start in the business through graphic arts, or simply banging on computers without much training. This book shows how programmers need to evolve from just plain code monkeys to true thinkers.It was interesting to see what subjects the author found to be important. He concentrated a great deal on random number generation, seeding, plot development, basic oop and finally he touched on fractals. Unfortunately, the mathematics in the book was pretty much obvious stuff. The book would not serve well as a reference, nor as a text book.If you are in the game programming business, I would recommend this book. Others will not receive much value from it.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought this book hoping for information on fractals, random number theory, compression, etc. Very disappointed. He seemed to lean heavily on a few particular sources that I didn't think were very strong. (For example, I can't imagine anyone covering random numbers without mentioning Knuth's book which is considered one of the authorities on the matter.)Basically, this book spends a lot of time describing to you in generalities the basic principles, without actually giving any compelling examples. In many cases, he teases you by talking about what *could* be done with the types of techniques he is describing, and you're like, &quot;all right, now we're getting interesting.&quot; But then he never actually gets around to the meat of the matter. He talked a lot about fractals in general, but never any good examples of how to actually make fractals. Or in the chapter &quot;probabilitity as a compression technique&quot; (which is only 5 pages long, btw) he discussed RLE encoding, which is an excellent trivial example. The only problem is, that's where he stopped - I can't believe he didn't discuss ADPCM encoding, for example.It's not that this is a beginner, book, either. There really just isn't that much material at any level. I'm still trying to figure out where all the pages went. Basically, a disappointment. Lots of fluff. Not much math, which is what the title would lead you to believe this book is all about.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I got this book because the title sounded like just the sort of good algorithm design discussion I was interested in. Sadly, the book doesn't live up to expectations. By a long shot.I got the book before reviews were up on this site, unfortunately... Listen to these reviewers!The book provides a lot of interesting discussion and pontification without a lot of specifics or advanced concepts. The techniques described are nowhere near cutting-edge. It honestly reminds me of listening to one of my CS professors rambling after a long day.The upside is that it contains a lot of interesting ideas and could be a good introductory text for programmers not already experienced in advanced algorithms, real-world game design, or higher mathematics. Unfortunately, that's a small audience, I suspect.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "knockout blackjack the easiest cardcounting system ever devised gambling theories methods",
        "description": "The Knock-Out card-counting system eliminates the mountain of mental arithmetic necessary to win at blackjack. The scientifically devised unbalanced K-O count can be used profitably anywhere blackjack is played: Las Vegas, Atlantic City, Mississippi, riverboat casinos, Native American casinos, the Bahamas, and on cruise ships. This third edition, revised and expanded, is now easier to use than ever. Step into the ring and learn to: Implement an abbreviated system--the \"K-O Rookie\"-- that's powerful enough to yield a player advantage and simple enough to be mastered in a few hours. Advance to a profession-level system--the \"K-O Preferred\"--which performs on par with the most sophisticated systems on the market. Win the cat-and-mouse game between the casinos and the players.",
        "authors": "['Olaf Vancura', 'Ken Fuchs']",
        "infoLink": "http://books.google.nl/books?id=PiEVswEACAAJ&dq=Knock-Out+Blackjack:+The+Easiest+Card-Counting+System+Ever+Devised+(Gambling+Theories+Methods)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have racked my brain trying to decide if I want to learn the K-O count or the High-Low. I figure, why waste my time learning one system if I will eventually move on to another, more advanced system? Just start with the High-Low from the beginning!But I have finally made my decision, and I feel this advice might help others trying to make the same decision. Is the K-O good enough to learn, or should you look elsewhere? Well, I'm no expert, but I have come to the conclusion, after reading much about counting systems, that it really makes no difference which system you use. The difference in expectation is very small, not to mention the potential for error in the more complicated systems like Omega II or APC. Even in a simpler level-1 count like High-Low, there remains that god-awful true count conversion (more room for error and delay). Of course, if you really want to play professional blackjack, you might want to eventually (or even right from the beginning) move to a balanced count system. But I have decided that while I want to play blackjack with an advantage, I never want the game to become a chore. I don't want to hate playing it. Therefore, it is not necessary for the recreational/casual player to learn anything more than an unbalanced count. Even if it's not the K-O system, you shouldn't worry about learning an advanced balanced count. The K-O system performs on par with all other similar systems, so the decision between which to learn is up to you (there is the Red 7 count and the Black Ace count, for example).Now, as far as this particular book goes, I think it is fantastically written and presented. I read another review that says the book is poorly organized, but I honestly don't understand where that person is coming from. The book presents the K-O in steps, and by the end you will understand it. (My only complaint is that there are a few incarnations of the K-O count, eventually all coming together to form the K-O Preferred system, and it is not always easy to know what exactly is involved with each incarnation.) It may be necessary to re-read it, but if you plan to seriously learn to count cards, then you should expect to read it several times anyway. Another complaint I saw was that the authors do not explain why they assign the values that they do to particular cards. But this is also simply not true. Vancura and Fuchs give you a chart that shows the player/dealer expectation when certain cards are removed from the pack, and it is on the basis of this information that they assign +1 to 2-7 and -1 to 10, J, Q, K, A.Anyway, if you are interested in learning a simple but powerful count that will perform well for recreational play, you definitely should read this book. It is wonderful. But not only that, the K-O is also considered a \"professional\" level count, so it cannot be written-off as a system not to take seriously. There is work to be done to learn it efficiently. And as Stanford Wong said in \"Blackjack Secrets\" (I believe it was that book), as long as you know a count that keeps track of low cards compared to high cards, then you are using a good system and do not need to move up to one that is supposedly more \"powerful\". (Of course, he wrote this before the K-O count was created, but I would still include it in his assessment). Besides, these systems that are \"more powerful\" are only theoretically so, and I think a lot can be said for the fact that because K-O is so simple, it may work more efficiently than even more advanced count systems.",
                "review/helpfulness": "112/116",
                "num_reviews": 116
            },
            {
                "review/text": "This is one of the most poorly written books I have ever read. The system is quite simple and could be explained clearly in a few pages of charts, but the authors have no idea how to make a clear explanation. It would take a conscious effort to make a simple idea any more confusing than has been done in KO Blackjack.Unfortunately, while the KO count system appears to be a good one -- combining ease of use with a fair amount of power -- the authors make it as difficult to learn as possible. There is a fair amount of information for beginners but, again, this information is better-presented in other volumes.I would strongly recommend that players at all levels go to another book. Advanced players will want a more powerful system, such as Omega II or Revere. Beginning-intermediate players might well want to use the KO system, but it's a lot easier to understand other simple systems such as Red 7.Nothing here against the KO system, which is a good one, or Ken Fuchs, who is reported to be a very nice guy and a learned and helpful blackjack expert. But I wouldn't buy this book unless it comes out in a second edition with a complete rewrite.",
                "review/helpfulness": "79/96",
                "num_reviews": 96
            },
            {
                "review/text": "There are serious problems with this book.The first is that the co-author Olaf Vancura now works for Mikohn gaming, a company which specializes in developing products for the casinos, some of which are specifically designed to foil the card counting strategy Vancura recommends. Patently Vancura has little faith in his own method if he chooses to make money that way rather than at the tables.The KO system is very simple and this has made it very popular with players. The authors make a good case for stating that the % edge for using a professional level system rather than KO is small, say a few tenths of a percentage point. That is true-but what they don't tell you is that the gains from the use of a higher level system tend to increase like compound interest in a bank account, and this can make the difference between winning tens of thousands of dollars or hundreds of thousands of $'s over time. The claim that K-O is superior to its nearest commercial rival, the hi-lo system, is frankly stupid and supported by data that massages statistics in a way many politicians would be proud of.You might think is just my opinion-and to some extent you'd be right. Then again, if you get a copy of Karel Janeck's SBA simulation software or Norm Wattenbergers CVSim you will see just how poorly KO performs against other count systems.I would recommend Wong's &quot;Professional Blackjack&quot; for those interested in pure counting, also John May's &quot;Get The Edge At Blackjack&quot; and James Grosjean's &quot;Beyond Counting&quot; for professional gambling methods with real money-making power.",
                "review/helpfulness": "74/91",
                "num_reviews": 91
            },
            {
                "review/text": "Overall, this is an excellent book for casual or recreational players who want a simple BJ system, based on card counting, that will provide them with a definite edge over the house. The K-O System presented in the book is a level-1, &quot;unbalanced&quot; system that is as easy to use as it gets. The authors, Vancura and Fuchs, cover the basics of card counting and casino comportment in a very clear, concise manner. So, unless your goal is to play at the pro or semi-pro level, this may be all the BJ book you need. My only real criticism of this book is the disingenuous way the authors exaggerate the power of the K-O System. It's a good system, but, Vancura and Fuchs to the contrary, it can not and does not compare to real powerhouse systems such as Carlson's Advanced Omega II System, or Uston's Advanced Point Count. And, actually, there wasn't any real need to overstate the power of the K-O System; considering its ease of use, it's plenty powerful for most players.",
                "review/helpfulness": "62/64",
                "num_reviews": 64
            },
            {
                "review/text": "This book explains the Knock-Out (\"K-O\") set of point count values, which you use to determine when to raise your bet and by how much. Traditional card counting methods, such as the Hi-Lo, require you to compute a \"true\" count, which is the running count divided by the number of decks remaining to be dealt. But this type of computation can lead to errors since (1) you have to estimate the number of decks in the discard tray in order to be able to calculate the number of decks remaining to be dealt, and (2) you must then mentally divide the running count by the number of decks remaining. And you have to do all of this quickly enough so the casino personnel don't become suspicious that you are an advantage player; otherwise you risk being barred from playing blackjack at that casino.The K-O, like the Hi-Lo, is a one-level counting method in that the point count value for each card is either 0, 1, or -1. High cards (10s and Aces) are counted as -1, neutral cards as zero, and low cards as 1. As the count gets more and more positive, the remaining cards to be dealt contain a greater number of high cards versus low cards. This means your chance of getting a blackjack is higher than right after a shuffle, and thus you should increase your bet to take advantage of this opportunity. But with the K-O, as opposed to the Hi-Lo, you do not have to compute a true count. You simply add the 0, 1, and -1 values as the cards are dealt to calculate the running count. Then you use just the running count alone to determine your bet for the next round. There is no need to track either the number of decks in the discard tray or the number of decks remaining to be dealt, and, almost too wonderful for words, there is no headache-inducing, \"dividing in your head\" required!Amazingly, even with the simplicity of just using a running count to determine your bet amounts, the K-O provides about the same win rate as the Hi-Lo! I know this from running simulations on the excellent Blackjack 6-7-8 software written by Hal Marcus. By the way, I thought I died and went to heaven when I discovered the Blackjack 6-7-8 strategy cards. Just like the K-O count makes the betting decisions easier, these strategy cards make the playing decisions unbelievably easier. First of all, they look marvelous, and they feel like butter! But seriously, you just find the table that corresponds to the rules where you'll be playing, and then the large, easy to read, easy to remember, 3-letter, color-coded decision cells (including surrender, if you please) practically make the memorizing fun! If I have some time to practice, the Blackjack 6-7-8 software is the best, but when I keep putting it off until it's time to board the big bird from Chicago bound for Vegas, then I just whip out a strategy card, choose the table I want, and I can know it cold before the pilot says \"fasten your seat belts, we're getting ready to land\".Now could you increase your win rate by using more complex counting methods than the K-O? Sure, in theory, but more complex counting methods increase the chance of making errors which can quickly nullify the benefit of using such a counting method. With regard to the betting guidelines in the book, I would amend them to use a bet ratio of 1 to 8 for 2 decks (instead of 1 to 5) and 1 to 16 for 6 and 8 decks (instead of 1 to 10), since in my 30 years of experience I have found that most casinos are usually tolerant of these bet ratios.The authors' advice is valuable, their writing is easy to follow, and I like the humorous sidebars sprinkled throughout the book, such as the gumball analogy in Chapter 3 to explain why card counting works. But the K-O count methodology is simply superior, and that's really why I find it valuable to use the K-O count, along with the superb Blackjack 6-7-8 strategy cards from Stickysoft (search on: blackjack basic strategy), to make it as easy as possible for me to \"get the edge\" over the house!",
                "review/helpfulness": "55/56",
                "num_reviews": 56
            },
            {
                "review/text": "Here's four years and 14 blackjack books' worth of advice:1) Yes, you can beat blackjack by learning how to count--even against six-deck shoes.2) The biggest reason players lose after learning how to count is they are making counting mistakes and don't know it.3) Knock-Out Blackjack is the one level-1 system that virtually takes the mistake factor out of counting.That's the biggest reason it's powerful and that's why it works. This book is well-written, easy to understand, although the charts they use have been formatted better in other books.Read additional BJ books, of course, master other counts, but KO is essential to your repetoire, particularly for shoe players.",
                "review/helpfulness": "44/46",
                "num_reviews": 46
            },
            {
                "review/text": "In terms of books that can take you from knowing almost nothing about blackjack to becoming a skilled player, there are two that I have found to be the best: Knock Out Blackjack by Fuchs and Vancura and Best Blackjack by Frank Scoblete. Scoblete's book is the more enjoyable and entertaining. However, the Knock Out book has a counting system that is truly easy to learn. My advice is to get both. Scoblete is a warrior who has been in the casino wars. His diary at the end of the book is priceless and his insights into what it is like to play in casinos is the best I have ever read. Fuchs and Vancura, on the other hand, have created a simple but powerful card counting system in KO that I have been using with great success for over eight months now. I think these two books are just super. I recommend that you buy both to truly learn how to beat the game of blackjack.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "If you have tried counting cards using other systems and have failed, then Knock-out Blackjack is the book for you. Not only is the system uncomplicated, but the authors layout a step by step progression of easily understandable techniques. The data supporting the K-O system is included in various chapters, yet you do not need to know or memorize the math. There is no dividing and they show you how to make a simple adjustment so you there are no negative number to work with. And it is easily adjustable to any number of decks.When they say it is the easiest card counting system every devised, it is true. I have tried other systems and failed. But with K-O system the average person will have the advantage over the house for a change.If you like to play BJ this book is a must.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "This is the first book I have ever read about blackjack and gambling. I know, as many of you already do, that Blackjack does afford the player the best advantage out of any game in the casino. I have never sat down at a Blackjack table because I knew that without knowing the proper counting and basic strategy techniques, the house would always win in the long run. I had read on the Internet of various card-counting methodologies, however they all seemed to complicated and discouraging to ever consider seriously proceeding with (unless of course I had a degree from MIT, which I don't.)Alas, I read a review of Knock-Out in the Chicago Sun-Times, which alluded to my concerns over difficulty. This book is straightforward and interesting to read, and the card-counting technique is regarded as being simple to use comparatively to other popular techniques. Even though, admittedly, this will take some practice, I am confident I can master Knock-Out with enough patience and I am not discouraged to the point of not bothering to try. I did find it somewhat surprising how much money and time is needed to have an satisfactory amount of return with relatively low risk (the fact that you start to max your betting with only a 2% advantage over the house is a testament to this fact.) Nevertheless, the book only took a couple of days to read, and it was truly hard to set down. Even though this is the first Blackjack book I have ever read, from a beginner's prospective, I wholeheartedly recommend this book. Wish me luck!",
                "review/helpfulness": "24/31",
                "num_reviews": 31
            },
            {
                "review/text": "I've read a lot of BJ books and played the game all over the country with varying house rules. This book is a great guide. If you stick to basic strategy, except when the count calls for an adjustment, and remain unemotional about the money, you can make some cash. Have patience and stick to the system. The game can be beaten consistently enough for it to be a profitbale hobby. I recommend the book and these guidelines to anyone who wants to make a serious run at the 21 tables: 1.) Practice counting every chance you get; 2.) Play single or double deck until you master the count (it's easier to start this way because if you lose the count you don't have to wait long for the shuffle); 3.) Read as many books as you can and find your counting niche; 4.) Make sure you have the proper bankroll for your bet spread, above all else. The ultimate goal is to be able to count down a 6 or 8-deck shoe. Big decks make for longer runs with a positive count and better camouflage.",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            }
        ]
    },
    {
        "Title": "game theory",
        "description": "This comprehensive textbook introduces readers to the principal ideas and applications of game theory, in a style that combines rigor with accessibility. Steven Tadelis begins with a concise description of rational decision making, and goes on to discuss strategic and extensive form games with complete information, Bayesian games, and extensive form games with imperfect information. He covers a host of topics, including multistage and repeated games, bargaining theory, auctions, rent-seeking games, mechanism design, signaling games, reputation building, and information transmission games. Unlike other books on game theory, this one begins with the idea of rationality and explores its implications for multiperson decision problems through concepts like dominated strategies and rationalizability. Only then does it present the subject of Nash equilibrium and its derivatives. Game Theory is the ideal textbook for advanced undergraduate and beginning graduate students. Throughout, concepts and methods are explained using real-world examples backed by precise analytic material. The book features many important applications to economics and political science, as well as numerous exercises that focus on how to formalize informal situations and then analyze them. Introduces the core ideas and applications of game theory Covers static and dynamic games, with complete and incomplete information Features a variety of examples, applications, and exercises Topics include repeated games, bargaining, auctions, signaling, reputation, and information transmission Ideal for advanced undergraduate and beginning graduate students Complete solutions available to teachers and selected solutions available to students",
        "authors": "['Steve Tadelis']",
        "infoLink": "http://books.google.com/books?id=eLkOJPwAdu8C&dq=Game+Theory&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a definitive reference text. It is not a self-study course in game theory, nor even a useful introduction. It functions best as a brush-up source, or a reference on equilibrium refinements, for those who already know the basics, and can work with a fairly technical presentation. It's very good especially on screening games and Bayesian-type information games.For a more intuitive introduction to game theory, try a short little book by David Kreps called &quot;Game Theory and Economic Modeling.&quot;.",
                "review/helpfulness": "64/68",
                "num_reviews": 68
            },
            {
                "review/text": "The theory of games is now pervasive in the fields of economics, financial modeling, logistics, operations research, network engineering, and population biology. As such a background in game theory is an absolute necessity if one is to deal with problems in these areas. This book is an advanced treatment of game theory, and presupposes the reader already has had some exposure to the subject. There is an excellent set of exercises at the end of each chapter, and so the book can be used as a textbook or for self-study.After an elementary example of a game in the introduction to motivate the subject, the authors begin in Part I of the book with the subject of static games with complete information. Strategic-form games are defined, along with dominated strategies, and the important concept of Nash equilibrium, the latter being introduced to deal with games that are not solvable by iterated strict dominance. For those with a background in elementary functional analysis, the authors prove that finite strategic-form game has a mixed-strategy equilibrium and prove that the Nash-Equilibrium has a closed graph. The concept of Nash equilibrium is extended to the concept of a correlated equilibrium, wherein each player can send another a private signal before they choose their strategy.In Part II, the authors discuss dynamic games with complete information. Examples of these kinds of games include a sequential version of the battle of the sexes game, and a sequential version of matching pennies. The authors discuss subgame-perfect equilibria, wherein an n-tuple of strategies constitute Nash equilibria in every subgame. The Stackelberg model of duopoly is discussed along with the repeated Prisoner&quot;s dilemna, the latter being an example of backward induction in finitely repeated games. A kind of generalization of the principle of optimality in dynamic programming is used to analyze perfect public equilibria via a tool called self-generation.In Part III of the book, the authors discuss static games of incomplete information. Examples are discussed including Bayesian games, where at least one player is uncertain about another player&quot;s payoff function, and first-price and second-price auctions. In first-price auctions, each player submits a sealed bid and the one with the highest bid obtains the item; in second-price auctions each player submits a sealed bid but the player submitting the highest bid gets to purchase the item for a cost given by the player with the second highest bid. The authors explain in detail the dominant strategies for these types of auctions. Bargaining with two-sided incomplete information is discussed and the optimal amount of trade is found from the linear equilibrium of the Chatterjee-Samuelson double action.In Part IV, dynamic games of incomplete information are discussed by the authors. Examples that they discuss include signaling games such as the two-period reputation game, and Spence&quot;s education game. Signaling is widely used by firms and organizations in spite of it being somewhat costly to do so. For example a public company may be trying to convince investors that it represents high returns. The authors show how to obtain sequential perfect Bayes equilibrium in these and other scenarios. The authors also discuss reputation effects in games, with an example being the chain-store game. The general case of single long-run players with reputation effects is treated in detail. Bargaining with sequential buyers is also discussed with examples given for one-sided asymmetric information and mechanism design.The last part of the book discussed miscellaneous topics in game theory, including strategic stability, more discussion on signaling, finite strategic-form games, and supermodular games. The treatment is more complicated mathematically with emphasis on proving existence theorems for Nash equilibria and pure-strategy equilibria. The notion of a Markov perfect equilibrium is employed to discuss situations where the past has a direct influence on current opportunities. This brings in the fascinating subject of stochastic games, wherein current payoffs depend on the state of the game and on current actions, with the state evolving according to a Markov process. These are generalized to continuous time, leading to the famous differential games. Game theory under &quot;common knowledge&quot; is also discussed, with examples given of the &quot;dirty face&quot; games.Some omissions in the book, which would have of course increased the size of the book substantially, include mathematical modeling of poker and other card games. These are complicated games in which to analyze, but they have taken on considerable importance in the casino industry in recent years.",
                "review/helpfulness": "34/46",
                "num_reviews": 46
            },
            {
                "review/text": "The book does a pretty good job of covering Bayesian issues, but one would think that a big book would be better organized and would cover more topics.I found it difficult to master the issues of equilibrium refinement and of mechanism design using this book and had to turn to outside sources at the time. Many of the problems would be helped by more &quot;mechanical&quot; examples on how to solve them, since the tools needed to solve many of these problems are probably new to a lot of students. The Tirole IO book contains some solved problems...I wish this book did, too.Overall, it is a fine book...more than adequate. But it could be better.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "If you are a Matematical Economist, and you like to study Game Theory or/and Adverse Selection, then this book is a must. It is wery precise when it comes to references, and it includes almost all significant contributions in the field. Sadley the book comes short on Moral Hazard, but that can be found elseware. Likewise if you look for Cooperative Game Theory, you wont find it here. The book is the best contribution I have found on Baysian topics",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you are going to do Micro at more than an undergraduate level, you are going to have this book on your shelf. It is quite comprehensive, although the notation is not always what one might be used to. I do share some of the misgivings voiced in other reviews -- topics sometimes don't appear in the order one might expect and the flow often may not seem natural. Also, the format of the presentation is unlike a mathematics text in that defibnitions, etc. may not always appear in nice blocks, etc. But at some stage, if you do enogh game theory, you will find yourself looking at it and then buying it.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is probably the best reference in game theory out there, and it also does a very good job in explaining difficult concepts. I've been studying from this book by my own and I'm very happy with it. I recommend it for anyone who is serious about learning game theory.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "If you are going to do Micro at more than an undergraduate level, you are going to have this book on your shelf. It is quite comprehensive, although the notation is not always what one might be used to. I do share some of the misgivings voiced in other reviews -- topics sometimes don't appear in the order one might expect and the flow often may not seem natural. Also, the format of the presentation is unlike a mathematics text in that defibnitions, etc. may not always appear in nice blocks, etc. and occassionaly I have found myself wishing for a bit more technical detail, for example on Bayesian Games. But at some stage, if you do enough game theory, you will find yourself looking at it and then buying it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "pick your lucky numbers easy ways to play the lottery",
        "description": "Designed for beginning and advanced lottery players, a guide to playing the numbers presents traditional strategies based on math and logic, profiles of celebrities and their lucky picks, and charts and simple calculations. Reissue.",
        "authors": "['Signet Staff']",
        "infoLink": "http://books.google.nl/books?id=wPEHAAAACAAJ&dq=Pick+Your+Lucky+Numbers:+Easy+Ways+to+Play+the+Lottery&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "An easy, yet informative read. Has simple to follow directionsbut they are presented in away that is not condescending. The authorrealizes the audience with whom he is contacting and maintains the tone throughout the book. The only caveat is that I did not hit the Big Game jackpot using the methods reccommended.",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "This was a pretty good book for the price,especially when it described some of the techniques and pure luck of how players won the big one!The new age stuff was interesting but I wouldn't reccommend using it to try and win the lottery.It covers various aspects and methods of lottery play that are still used today but nothing groundbreaking or will guarantee winning anything!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "the game win your life in 90 days",
        "description": "The motivational speaker offers a game with prizes, rules, time limits, and coaches to help readers set goals, measure results, and achieve personal and professional objectives.",
        "authors": "['Sarano Kelley']",
        "infoLink": "http://books.google.com/books?id=jqxvOwAACAAJ&dq=THE+GAME+Win+Your+Life+in+90+Days&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I sat through a Sarano Kelley seminar a few years ago while I was employed with a financial services firm. He is a dynamic speaker to say the least. He is also incredibly manipulative. He has a way of convincing everyone in the room they are \"asleep\" and need his \"Game\" very urgently. His game, or the away from home motivational boot camp he puts together in San Diego, costs over $20,000.00! You get up early in the morning, go through high physical exhaustion, highly emotional conversations, and then you get to the training sessions. When you are exhausted and emotional you are at your most vulnerable to suggestion. This is classic nuerolinguistic programming, or NLP. NLP techniques are how cults brainwash people. Look it up!Sarano also loved to talk about the movie The Matrix and how it was like real life. I guess he likens himself to the character of Morpheus. He has the way, the answers, the road to being awake in life while others sleep. Classic hucksterism.I went away from his seminar convinced I was a piece of crap and needed fixing. I even considered the whole \"Game\" program. I also knew I was manipulated. I soon started to get phone calls from their sales department trying to pressure me into the program. \"Just put it on your credit card\" they would tell me. When I asked them to stop the calls the sales person said, \"Well, it's obvious you're not coachable.\" The high pressure stuff felt evil and insincere!I will never forget Sarano. I will also never look at the whole business of motivational speakers the same again. I'm sure some are great and sincere. Some are nothing more than mind games that feed off of the frailty of the human condition.Don't buy his book. Don't drink the Coolaid.",
                "review/helpfulness": "27/36",
                "num_reviews": 36
            },
            {
                "review/text": "I played the game as a participant in the coaching program. It forever changed the way that I look at life. During the game I cleaned and reorganized closets, drawers and rooms. I built a zen garden in my backyard, painted a garden on my bedroom walls, reduced my body fat by 15% and increased my reading speed from 300 words per minute to 2600 words per minute. I recorded over 21,000 concious acts of will during the 90 days that I played the game.The value of choosing a partner for this game is immeasurable. It's good to have another person to be accountable to. This structure was very effective for me on those days that I was tempted to let a work-out slide or if I just didn't feel like completing on a committment.The book stresses the importance of structure, community and affinity in achieving goals. It guides the reader through exercises that help to put these in place. There are many real-life examples in the book from past &quot;game&quot; players. This clearly demonstrates that anyone can achieve their goals by putting the principles of The Game to work.The tone of the book is conversational, making it very easy to read. This is not just another self-help or motivational book. If you truly have the desire to realign your priorites and live your life with passion and purpose, you will enjoy this book.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Kelley's book covers a lot. I hope to do it justice while giving you a sense of what you'll find in it. First of all, there really is a &quot;Game&quot; that the author challenges and instructs you to play for 90 days (The game is very much like goal setting exercises transformed into a game you play with a partner). Kelley provides the rules, the scoring system, the strategies, and even a grand prize reward of $50,000 for whichever partner-team he deems to have changed their lives the most in 90 days.So what is the game? Well as the title implies, you are playing to improve your life dramatically. You choose the three or four areas you want to improve the most -- you are choosing from: Balance, Body and Health, Money, Relationships, Spiritual Life, Mind, Tools, Environment, Education, Family, Work, Charities, Hobbies, Interests, and Art. There is a chapter on each of these areas, full of excellent advice and true stories of previous game players, so that you have loads of strategies and inspiration to make your improvement. Let's say you read the book but opted to never register at the official website to play the game -- these chapters would still be worth the price. I liked the combination of smarts, specifics and spirituality woven into each one. But the originality of the book lies precisely in actually playing the game from start to finish -- from reading the book to turning in your final essay that extols your breakthroughs -- because the game provides an added motivation and support system that other books lack.My final comment would be this -- the books easily worth the price. The question is, once you read it, will you have the determination to play for 90 days? Realistically most won't -- it is a big challenge. But the ones who do will undoubtedly make major improvements. How could you not? Conscious, concentrated, focus on improvement for 90 days will change anyone's life. I humbly submit that if you are interested in succeeding, you will also like my book, Major in Success, especially for career or college success, it would be a great complement to Sarano's excellent book.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Being a psychiatrist I am exposed to man theories, publications, and other forms of communication regarding improving ones's life. As you can imagine I have become rather skeptical about this genre of &quot;self help&quot; titles. I began reading The Game by Mr. Kelley with a fairly high degree of doubt whether it would have any meaning or standout from other works of its ilk in any way. I must say I was pleasantly suprised and found Part I of to be an excellent outline for the one thing we all strive for... some degree of CONTROL in our lives. Mr. Kelley gives a clear and consise plan to begin this process, followed by more detail in Part II &amp; III, on how to accomplish this life long task. Having been an athlete The Game strikes a cord prompting me to re-examine several aspects of my life and make some changes. This was no mean feat for a cynical physician. I am even going to offer The Game to the employees in my practice as a Holiday gift. One will not find the Holy Grail in any book of this nature, or anywhere else for that matter, but with The Game at least you can begin the search.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Mr. Kelley provides a great conversation about all those 'messes, what-tos and to-dos' rattle around in mind. Why do we carry these for years and never perform? You know the lists: I have always wanted to get in shape, I'd really like a better relationship with my daughter, I should learn those cell phone features... and the like. Where do these come from and why are they always so frustratingly just out of reach?More important than recognizing these frustrations, Mr. Kelley provides an elegant solution. In the form of a Game, a very special game, he challenges and empowers us to climb life's mountains whether actual or symbolic. This book is not about theory. It is a wake-up call and a will get you too to perform. In the end, like with all good games, there is a PRIZE.The book is well written and easily read. It is full of personal stories from both Mr. Kelley and from his clients built up over years of coaching successful people to even higher performance. And, along the way you will learn some timeless lessons about what it is to be human. A future Classic.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have been playing the game for over 90 days and the changes are amazing. I am more focused, relaxed and my business and perosnal relationships are being transfomred. Reading this book will dramatically change your life.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I recently had the ability to listen to Sarano speak, and I have read his book. Outstanding to say the least. He helps YOU realize what YOUR potential is and he helps YOU open your eyes to what is holding you back from being the best you can be. In all honestly, he made me face the things that I hated to face, and didn't want too, more importantly the truth. After you realize what is holding you back, he gets you on track to make the changes you need to make, not in the future, but in the NOW. I would recommend this book to anyone wanting to better themselves no matter if it professionally, personally, or spiritually.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Saraon is right we are all aslep. we get up, do our thing and hardly notice where we are and what we are doing. Very few of us reach our potential. Very few of us build on relationships and let friends help us. We all think we have to do it ourselves and end up frustrated because we know we have not reached our full potential. Sarano's insights into the humnan psyche are right on. He has found a way for us to wake up and reach for new levels of success. There is not a person on this earth that will not learn and grow if they apply just some of the ideas put forth by Sarano. Ted Fuller",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The Game is deceptively simple in construct. In chapter after chapter,busy people tell how applying simple disciplines worked in their lives when they competed in the &quot;game&quot;. The people are real. The changes in their lives are real, and some of them are dramatic. But the practical, simple, transforming work of the book is for each of us to decisively intervene on our own behalf in the sleepiness of daily life so that it becomes for us the miracle it really is. Yes, after a hundred pages or so the format of the story told is repetitive and even a little dull. The real news is however, that the book will do nothing in anyone's life who does not go to the website or call for help in setting up to play the game. Reading about the game will not do it! Only players savor the sweat and reap the benefits. If a prospective reader really wants to do something to enliven areas of her/his life then reading The Game combined with playing it with structure, affinity and community will alter the reader's level of awareness and increase the delight possible only in being present in the moment.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The title, The Game: Win Your Life in 90 Days couldn't be more accurate. I read this book in one evening. I found myself so excited to get into action and accomplish the things I had always wanted for myself. I began to play the game with a co-worker of mine and started to see results immediately. It was when I decided to take The Game Class through The Coaching Program that people around me started noticing the changes in me. They made comments like, 'you seem so much happier' and 'you have been so pleasant to be around'. I realized that by playing the game and getting out of life what I had always dreamed, I had a new vitality and it was clear to everyone around me. No amount of money could have bought this new lease on life.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    }
]