[
    {
        "Title": "my soul thirsts an invitation to intimacy with god",
        "description": "With years of reflection and experience with drawing closer to God, Korch, dean of Western Seminary in Northern California, offers insights that provide readers with tangible reference points for evaluating and building a more intimate relationship with the Creator.",
        "authors": "['Steve Korch']",
        "infoLink": "http://books.google.nl/books?id=MY6BmVih-SsC&dq=My+Soul+Thirsts:+An+Invitation+to+Intimacy+With+God&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an essential book for men and women who have been active in church for years but feel something isn't quite right. Their day-to-day Christianity is delivering a lot less than they had hoped. For them, God is a doctrine, not an intimate friend. This refreshingly practical book is about Intimacy with God from a guy who lives in the Silicon Valley, not a hermit's cave. Steve uses vivid metaphors and personal stories that slip biblical truth through the side doors of our hearts. He updates dusty labels on the jars of life-changing biblical truths like joy (for the \"humor-impaired\"), prayer/spiritual power (\"overcoming life's obstacles\"), knowing the Bible (\"hearing God's voice with your whole being\"), and authentic passion for God (\"dancing in the Arms of God\"), making them accessible and motivational! The thought provoking discussion questions at the end of each chapter make this an excellent choice for home Bible study groups or workplace Bible studies. Bottom line: Any follower of Jesus can have an intimate and adventurous relationship with God. It can happen and this book helps show the way!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book expecially Chapters 3 and 5 changed my outlook on life. Thank you very much I would recommend this book to everyone who is searching for a deeper relationship with God.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "My Soul Thirsts is a rich feast of spiritual delights for Christians seeking a more intimate communion with their heavenly father. Korch covers a wide range of spiritual disciplines and dimensions and issues a challenge to every Christian, no matter how mature, to go deeper. This is a touchstone sort of a book that can be re-visited many times for thoughts and a spiritual tuneup. Korch uses many Biblical references, quotes and illustrations to help bring alive his message. Expect to be challenged by his direct, personal approach bundled with an easy-to-read, friendly style.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "walking in victory experiencing true sanctification and holiness through gods grace",
        "description": "The author manifests insight into the full reality of the victory we have in Christ. He uplifts the Lord Jesus Christ, pointing to Him as the Victor over self and sin.",
        "authors": "['Charles Trumbull']",
        "infoLink": "https://play.google.com/store/books/details?id=dF3X8mBgf8cC&source=gbs_api",
        "review": [
            {
                "review/text": "If you've never understood God's acceptance and grace fully, this is a book you would definitely benefit from! McCallum obviously put a lot of thought into how he could make these deep truths easier to understand and apply. Personally, I love the tables sprinkled throughout this book. They do so much to make things clearer, and are a great resource for group bible studies!!Some of the many tables found in this book:&lt;> Comparing Biblical and Modern Love&lt;> How the Means of Growth (Prayer, Word, Fellowship, Ministry) work together and affect one another.&lt;> Our Old Self (in Adam) vs. Our New Self (in Christ)&lt;> Living under the Law vs. Living in Grace",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "What a great resource to have to work through personal issues and also bringing along a friend in their life-long walk with God. Eye-opening for the new believer; a trusted reference book for the maturing Christian who wants to see more of Christ in their lives and their output to others. This is a unique book that has no real equal on the subject of \"how to\" walk more-and-more in godly obedience (which is our victory).",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book recognizes that our actions flow from our beliefs. It does an excellent job of using the truths of the Bible to align our beliefs with God's love for us. Our good actions flow from God's profound assurance of freedom and love.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Reading this book in conjunction with a Bible study on Romans 6,7,8 was life changing for me and my husband - and our marriage. I often wonder how things would be if we hadn't read it.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read Walking in Victory years ago, when it first came out. I still refer to it regularly and think of its content often in my daily life, and I use the information in Bible teachings regularly as well. The charts help to make deep truths clear and memorable. This book is a must-read for anyone who wants to understand *and live* what it means to be a \"new creature\" in Christ. ~Kathy Hoffer",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I refer to this book often to get God's perspective on grace and my new identity in Him.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "McCallum's book helped clarify for me what it looks like to walk in God's grace. I have often shared the truths with others and refer back to it myself.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I really like this author's body of work. I've read all his non-fiction. He's very objective and can sound a little bit like notes from a lecture. But it is also emotionally productive, without the bells and whistles, unlike many Christian authors, and has genuine feeling and vulerability to appeal to anyone's subjective sensibilities. This book is my favorite from this author. He wrote that walking with God is about tranformation by the Spirit, not a change of behavior. The author makes points about principles and leaves the reader in charge of how to purpose God based on teachings from the Bible. This message is biblical and encouraging to anyone who has accepted Christ but doesn't know what to do next. This book is not a self-help book. It's not a method plan. Many Christians love the book of Romans and should really take a look at this book as extracurricular. This book is not a substitute for reading the Bible but a companion, conversation piece, the result of the word of God in the author's live - which the author states could happen to anyone who wants a personal relationship with God through Christ.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Walking in Victory is a great book that helps to expound and compile the information in the Epistles. After reading this book, many events and experiences in my life made sense. It was much easier to apply the biblical truth in a fruitful way.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "greater works",
        "description": "If you are a Spirit filled minister or prayer warrior that wants to build your faith for miracles, then this is your book. You can go from being a spectator to being spectacular for the Kingdom of God and learn to put impossibilities to shame with this inspirational and practical bible study for doing greater works! Learn the process of exercising your God given dominion over time, distance, death and darkness. Find the keys to divine health and creative miracles. Benefit from decades of study and flowing in the anointing in this book to encourage and empower you towards a greater life for you and your circle of influence. This is your commission. Miracles are real and people are believing in God and miracles in this age more than ever. This book is an announcement that such a new wave of Holy Spirit inspired transformation is well and truly underway! And nothing makes the message of Christ more accessible to the outside world than seeing it at work in practical ways: not only changing lives one at a time but also whole communities. Scriptures in this book are totally relevant, applicable and compatible to applied situations. Thank God, the book reveals the Lord's Everlasting Truth, and breaking forth again in His eternal power in this our day and age. Rev. Kennedy Onyango Kingdom Life Ministries, Mbita, Kenya. Jeff Lowe is the founder and overseer of Tree of Life Ministries in Long Beach, California. He has been in evangelism since 1988. He graduated with a B.A. in Theology from the International Miracle Institute, and also has an honorary Doctorate in Divinity. He continues to serve in evangelism and missionary work worldwide with the Cottonwood Church in Cypress California .",
        "authors": "['Jeff Lowe']",
        "infoLink": "http://books.google.nl/books?id=PmkD6oJSCe8C&dq=Greater+Works&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Smith Wigglesworth was an amazing man of God, and you will be blessed by his writings. This book has FOUR of his other books, combined into one.Smith Wigglesworth on HealingSmith Wigglesworth on the Holy SpiritSmith Wigglesworth on the Spiritual GifsSmith Wigglesworth on FaithThese four books are available individually, but each is well over the cost of this single book. Get it! Read it! Be blessed!",
                "review/helpfulness": "52/52",
                "num_reviews": 52
            },
            {
                "review/text": "Smith Wigglesworth may be thought of as one of those &quot;old-timers&quot; from an age gone by, but if there is one thing to be learned from this, as well as his other writings, it is this: Jesus promised that &quot;the works that I do shall ye do also, and greater than this shall ye do, because I go to my Father who is in Heaven.&quot; John 14:12 and Heb. 13:8 are as true today as the day they were written.If we as Christ's body could ever apprehend the simple teachings of this simple man, who was endued with &quot;power from on high,&quot; we would indeed fulfill the aforementioned scriptures, as well as Mark 16, to name just a few. Bro. Wigglesworth believed that the Christian's Divine Right, as purchased by the Christ of Calvary for His people, was to live on a &quot;higher plane.&quot; He truly lived a life of holiness, which produced a faith that could stare down the enemy; this is said not to honor or worship the man, but to give us faith that &quot;all things, whatsoever ye shall ask in prayer, believing, ye shall receive.&quot;Greater Works is one of those &quot;unknown&quot; Christian Classics that belongs on the bookshelf of every believer, along with Charles Finney and F.F. Bosworth.",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "I enjoyed this book. Its a huge compilation on several aspects of spiritual growth (faith, healing, spiritual gifts, etc).The accounts of Smith being used by God to raise the dead, heal the sick, drive out evil spirits was so phenomenal, it almost makes you feel convicted that you are not living on a higher spiritual plateau. It definitely urges the reader to live 'above the norm' and to keep growing in your relationship with Christ.I would give it 10 stars if available! Please get it if you are seeking greater levels in Christ.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is not a book for the casual seeker. Wigglesworth could not tone down the shout that directed his Life. He \"flatout\" believed the Word enables us to walk as Jesus walked, if we aren't timid about \"receiving\". He defined his walk so clearly that every serious seeker can benefit from his life. You will want to also buy one for a friend. This is several of his books in one publication.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Greater Works: Experiencing God's Power is wonderful book touching on spiritual progression; salvation, sanctification, filling of the Holy Spirit and gifts / fruits of the Spirit. He describes/demonstrates his total submission to Christ and reliance and trust in God and how to be a channel for God's Holy Spirit to heal and change people's lives. This is his best book I have read demonstrating serving Christ. I purchased copies for family members and for leaders in our church.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book shows faith in ACTION.This was an amazing man, but he himself thought it was just a normal way for a christian to live. Maybe he was right. But what does that say about our christian lives nowadays?This is an updated version of the original work. It is an easy read. I wonder what the original was like.All in all, VERY MUCH WORTH READING. This man's GOD is incredible! What is so beautiful about it, is that his God is ACTIVE in his life every day in a miraculous way! And his God always acted in accordance with the Bible. Looks like we need to look again, much deeper, at that wonderful old book, the BIBLE.We should pattern our faith more like his. We need such miracles these days, more now than ever! We need sermons like these nowadays. They come on strong, but they build real faith!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book has greatly inspired me to trust God in greater ways even in the details of life- concerning any needs or problems. It challenges me to reach out to others and pray confidently for them as well. I want these truths from God's word to penetrate my mind and soul till I am consistently walking in them and experiencing God's powerful presence in new ways.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I never thought that the Holy Spirit can inspired someone to live a life of total faith and believed in Jesus, and his Word. I wish I had known about these teachings when I was a new born believer. Had I no listen to so many teachers, most of them with good intentions but just like Paul sincerely wrong, I would had never lost my faith. Now thanks to God and the teachings of this godly man, I am hoping to gained or recuperate what the devil had stolen from me through those so call good men of God, but so out of sync with God's will.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you are into the bible, feel a sense you aren't experiencing all that you desire from within the church, THEN, this book will change your life. You must read it slowly and dwell upon what is being said. You may want to review given scriptures. But, if you are seeking more of God, this book will allow your heart and mind to become one with Him. Days are short and God is still calling His people to order that they fulfill their purpose upon this earth. Still seeking to know your purpose? This book will open you up from within and show you the way of truly living a joyous life while giving all the glory to God.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "lectures on revivals of religion",
        "description": "LECTURES ON REVIVALS OF RELIGION is Finney's classic teaching on revival. Penned in 1868 after decades of seeing God move in revival power in the Second Great Awakening, these powerful lectures are a must read for anyone who truly seeks to see lives and communities transformed for God! Contains 22 powerful chapters on subjects such as: What a Revival is, How to Promote a Revival, How to Preach the Gospel, Means to be used with Sinners, and many more! CHARLES FINNEY (1792-1875) was mightily used of God to promote revival and deep spiritual awakening throughout the United States in the 1800's. His life has inspired countless Christians to passionately pursue God (and was a favorite of Jonathan Goforth, Leonard Ravenhill and Keith Green). A must read for those who long to see God move in our day!",
        "authors": "['Charles Finney']",
        "infoLink": "http://books.google.com/books?id=TWmajgEACAAJ&dq=Lectures+on+revivals+of+religion&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "These are powerful lectures on what constitutes a religious revival, how to encourage or promote a religious revival, and what can be done to maintain a revival experience in the life of the Christian and in the life of the church.Charles Finney understands a religious revival to be the work of man, when we renew our first love with Christ. A religious revival is a new beginning of obedience to God. It results in the backslidden person or church returning to its first love (Jesus), and in the conversion of sinners. God is involved in the revival process insofar as he providentially arranges for men and women to be encountered with the truth of the gospel. Yet a revival cannot take place without the cooperation of the penitent sinner, he or she must repent of their sins and seek the Lord with all their heart (Jeremiah 29:13). This understanding of a revival shows that Finney emphasizes the work of man right alongside the work of God, which would be anathema for Calvinists.Finney also stresses that people need many revivals. If our love grows cold, or our hearts become crusty, it is because we need to remember the height from which we have fallen and repent and do the things we did that led to our first revival. Finney contends that we need to be reconverted, or a person who was once a revived believer could end up in hell.He points out that a revival can be expected when God reveals to His people that the time is right for one. Also, when the Christian community and the clergy are united in their intense desire to see a revival that will bring about the salvation of the wicked, an awakening can be expected. Finney would also point out that the church would need to be open to God doing it any way He wants.He goes on to mention that in order to promote a revival, Christians should confess their sins one by one. Finney regards this as absolutely essential, since we committed them one by one, they need to be confessed and forsaken one by one. Moreover, it will do no good to merely confess them or to trust that over time, God will grant repentance unto life. God has mandated that we all repent of our sins of omission (things that we neglected to do, such as prayer, Bible reading, giving, self denial, etc) and our sins of commission (slander, lying, cheating, hypocrisy, and envy, among others).Beginning with page 342 of Lectures on Revival of Religion, Finney gives advice to Christians on how to respond when someone asks \"What must I do to be saved?\"His advice is to tell the sinner to change his mind about sin, to confess his sins and vow to forsake them, and to believe the gospel of Christ, that He died for us and rose again, and to submit to God completely.Unfortunately, it seems that Finney believes that a person may need to be reconverted again and again. It is hard to know if Finney is suggesting that a Christian may backslide to an unsaved condition and may need salvation again, or if the expression \"reconvert\" is merely an expression of being reconverted to a totally sold out lifestyle for Christ. Probably both, since Finney shows contempt for the idea that a person can be \"once saved, always saved.\" If this assessment is true, it would put Finney's understanding of the security of the believer in sharp contrast with Edwards, who would only assume the integrity of a revival experience if the person is faithful to the end.I should also say that Finney has a plain way of speaking (these lectures were delivered extemporaneously and transcribed), and he is also quite funny, especially in the lecture about the wrong things to say to a sinner on the verge of accpeting Christ.I recommend not only reading this book, but following Finney's steps in promoting revival in your own life (pages 31-44). But watch out for his erratic theological pronouncements (the need for Christian people to be reconverted again and again, his radical emphasis on man's role in salvation, and in his denial that revival is a supernatural work of God. Get past the theology and take his advice on the practical side of living an awakened life for Jesus Christ.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "As a trained lawyer Finney's is very organised writer and the Title says Lectures. This is a clearly written and a very powerful book. Finney sees revival the way a farmer sees crops. You prepare the ground (heart), you plow (pray), plant seed(Word of God), you water (repent of sin) Trust God to give the growth. Not a book on over night jack in the bean stalk growth. But a timely book now as when first written. Read Finney auto Biography to more clearly understand the Second Great Awakening in America. The first being 1740-1750's Johnathan Edwards and George Whitefield's ministry. This book when read with Bible in Hand will do no harm and possibly much good. It is one of a dozen or more great books on religion that has had a great impact on my Christian life. You will be stirred if you read it. It is not perfect but written by a man trying to be perfect even a s God is perfect. A great Book on Sowing and Reaping. Note: Finney was not a get salvation lose salvation preacher. He did begin to believe it was possible for a man to chose to forsake Christ after having been converted. This required a active choice of unbelief not an accidental falling away or by sinning to much. This doctrine was a result of his seeing fruit that he thought was once gathered seeming to fall away back into unbelief. This Book will be a great blessing to who read and to all who read it like the Bereans searching the scriptures to see if it is true. W.A. Criswell wrote of one of his books \"Reading this book is like eating fish, if you come to a bone you can't swallow, just chew around it.\" So take advantage of this reprint Buy, Borrow it from some one who has it. It will stir your soul and provoke you to good works for Christ.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "when godly people do ungodly things arming yourself in the age of seduction",
        "description": "When Godly People Do Ungodly Things: Arming Yourself in the Age of Seduction - Bible Study Book by Beth Moore provides a personal study experience five days a week plus viewer guides for the group video sessions of this in-depth women's Bible study. In this biblical guide to authentic repentance and restoration Beth examines why devoted followers of Jesus Christ can fall into the traps of Satan. Believers are still subject to Satan's attacks. He is determined to disrupt the lives of Christians, destroy their ministry, and steal their joy. Sadly, those who have \"fallen\" may not recognize the devil's schemes until they have already been caught in a snare of defeat. This six-week study is written in three parts. The first part is a warning to believers, while the second part shows women how to prepare for attacks by the Enemy. The third part is directed to those who have been snared by seduction, and compassionately points the way back to God. The Bible Study Book includes: 6 weeks of personal interactive study five days a week Viewer guide for use with the DVD teaching sessions",
        "authors": "['Beth Moore']",
        "infoLink": "http://books.google.com/books?id=ZZiLvgEACAAJ&dq=When+godly+people+do+ungodly+things:+Arming+yourself+in+the+age+of+seduction&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This title is the second I have read by Beth Moore, and it is the best yet. It is easy to read, but profound in nature. Many Christians may be inclined to miss the impact of this book because of its simplicity.Moore here does not seek to be informative, but inspiring. There are many other volumes on the market that offer much better insight into the darkness of human nature. If a person is desiring that sort of deeper understanding, then this book is not the one to purchase. If a person is looking to find motivation to overcome his/her darker side however, then this title is the one to choose.Moore divides her work into three basic sections: the Warning, the Watchman, and the Way Home. The Warning section describes the attacks Satan makes against devout believers. The Watchman section unfolds ways in which a disciple's defenses can be strengthened to resist such attacks. The Way Home section, as the title implies, points Christians in the right direction to recover from having succumbed to temptation and seduction from the Enemy.I recommend this book highly to persons who are intent upon living consecrated, victorious lives for Jesus Christ. Moore's honesty, transparency and humility serve only to strengthen the arguments she presents. This one is not a book to miss!",
                "review/helpfulness": "109/111",
                "num_reviews": 111
            },
            {
                "review/text": "First, a word about the audience this book addresses.1. It does not address carnality. Sinnners are already lost - they are not Godly.2. It does not address frauds. People that pretend to be Christians but lead a life opposed to God are sinners dressing up as lovers of God. She points out that just because someone fails does not mean they are fraudulent. Fraudulent believers never really lived for God anyway.This book adresses people who walk with God daily, yet fall into pits of sin doing unGodly things.2 Corinthians 112 For I am zealous for you with a godly eagerness and a divine jealousy, for I have betrothed you to one Husband, to present you as a chaste virgin to Christ.3 But I am fearful, lest that even as the serpent beguiled Eve by his cunning, so your minds may be corrupted and seduced from wholehearted and sincere and pure devotion to Christ.Secondly, Some Christains believe it is not possible to be seduced one once you are a Christian. Beth Moore writes that this is false and is proved true by the above scripture (among others). Christians are being seduced TODAY. Consider David - a man after God's own heart - He fell into an adulterous relationship and didn't realize what he had done until the prophet revealed it to him! She writes that those of us who are already walking with God need to beware. We are living in the age of seduction and we who walk with God can fall into traps. Knowing this, we should feel the sense of urgency to guard ourselves against being deceived.Beth Moore explains that she has received countless letters from true believers that have fallen into traps. Godly people that have a history of walking with God, but fall into sin share some common denominators that she shares in this book.I highly recommend that every believer in Jesus Christ should read this book - now.",
                "review/helpfulness": "103/110",
                "num_reviews": 110
            },
            {
                "review/text": "The title of this Beth Moore book is certainly a provocative and thought-provoking one. We all wonder why godly people stumble (including ourselves.) The author explains to us the seductive forces in the world today and shows how sincere Christians can fall into wrong thinking and acting. She then details how we can arm ourselves, through prayer, Bible-reading, accountability groups, and other methods to resist the temptation all around us and keep our eyes on God. She describes what repentance really is and shows us how to go about restoring our tarnished relationship with Christ. This is inspiring and is a wonderful &quot;how-to&quot; book for any Christian.",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "\"If you love Me, feed my sheep.\" Beth Moore obviously heard the heart of the Lord and her book, \"When Godly People Do Ungodly Things\" is the answer she responded with.If everyone who ministers to the Lord's sheep would take Beth Moore's message to heart, great healing would be released within the Body of Christ and untold numbers would begin to move back into places of spiritual wholeness and usefulness.This is a timely demonstration of the breadeth, and length, and depth, and height of God's love, mercy and grace to ALL who repent and turn back to Him. Thank you, Beth Moore!",
                "review/helpfulness": "22/29",
                "num_reviews": 29
            },
            {
                "review/text": "Struggling to understand why a wonderful devout friend of mine committed crimes that landed him in state prison, I was intrigued by the title of this book when I saw it at a friend's house, so I bought it. Beth does a wonderful job of explaining how those who are truly committed to Christ can fall into Satan's snares. The elements she describes of Satan's seduction were verified by my friend who said his experience was just as described by Beth. A much-needed and obviously God-inspired book with a serious warning for those of us who think we're too close to the Lord to ever forsake His Word.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "First, I must admit that this is the first Beth Moore book that I have read. I have heard her speak before (during a marriage conference), but have not read anything written by her.Overall, I liked the message of the book. It is very difficult to live in a holy manner given the ungodliness that we face everyday in modern society. This book helps to understand the challenge, and offers an approach to prepare for the spiritual battles that you may face. Her warning that mature Christians may face the toughest battles is well placed since we do not talk much about it within the Christian community. I particularly liked her one analogy of &quot;the lion is in the yard&quot; - this section of the book is well done.The book also offers a plan of restoration particularly aimed at those believers who have veered from the straight and narrow path. Although her message is simple, it is biblically based and may be useful for someone who is not sure what to do about the mess they have made of their life.My main negative about the book is that her writing is not very concise. She writes likes she talks and includes a few too many personal comments throughout the text. Having said that, it is just a minor distraction, not a major irritation.This book offers a wake-up call to the church about sin. We face an enemy who is ruthless in his approach to destroy our lives, or distract us from our call to follow Jesus. By reading this book you will be prepare yourself for the battle we face. If you do not think that we are in a battle then I suggest you read this book in order to face up to the reality of the challenges Christians face, even mature ones.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is one of the most important books I've read in the past five years. I say it fills a gap because of the way it so clearly addresses the specific topic of spiritual \"seduction.\" The anonymous reviewer of 3/26/02 did a good job of describing what that is and is not. In contrast to the willfully disobedient or rebellious person, the seduced person may creep by almost imperceptible steps to a spiritual disaster he could not have imagined could happen to him.Moore is compassionate without being soft. She does not excuse the sin or the sinner, but her harsher words are for those who those who are ready to throw the first, second, and third stones.The book is very practical in terms of the risk factors for being seduced, how to arm ourselves, how to get help from God and others when we have fallen, and how to be a godly helper to someone else in the situation.As a missionary doctor with some background in counseling and with some member care responsibilities, I can say that this book (or something else like it, which doubtless exists though I don't know what) should be essential reading for pastors, counselors, lay leaders, missionaries, and anyone else with leadership and pastoral responsibilities. Beyond that, it would be valuable reading for anyone serious about his or her spiritual life.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Thank you God for once again using Beth Moore to speak truth into our lives. It is not usually the obvious, recognizable, 'really big' sins, but the insidious, underlying, almost harmless temptations that have put the small cracks into our temple (as Beth puts it)and allows Satan to destroy us. It made me mindful, and, along with the video, showed me visually not to ignore signs and especially to get the trash out and live in abundance of our Lord. May every believer know the freedom that only comes from Him.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "When Godly People Do Ungodly Things by writer, educator, and public speaker Beth Moore is a compelling moral, religious, and spiritual examination as to why faithful Christians fall into the ways of Satan. Individual chapters guide those who have strayed to the path of true repentance and redemption of evils. When Godly People Do Ungodly Things is highly recommended for personal and small group discussions as a powerfully written and fervent presented Christian testimony.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "People who get this book thinking it is going to explain away all problems may be disappointed.For me, the value of it is working through the process of the questions and allowing the Holy Spirit to work in me through the Bible verses I read, copied, and meditated on. Her experiences and Biblical guidance have helped clarify for me the need for continual vigilance in my Christian walk.I believe today's Christians are being bombarded on all sides and we often don't even realize the attack we are under. Then we wonder why we bear no fruit in our Christian walk.We need to wake up and smell the coffee! We ARE under attack, and even more so if we are actively seeking to fulfill the mission that Christ has left us here to accomplish. Mostly, in today's world, we have been lulled into a false sense of security.This workbook is not for everyone, but for those who are struggling with living a godly life or those who have been hurt and/or confused by ungodly actions of another believer, I believe there is help and healing in this study.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "the great controversy between christ and satan the conflict of the ages in the christian dispensation",
        "description": "Beginning with the destruction of Jerusalem and continuing through the persecutions of Christians in the Roman Empire, the apostasy of the Dark Ages, the shining light of the Reformation, and the worldwide religious awakening of the nineteenth century, this volume traces the conflict into the future, to the Second Coming of Jesus and the glories of the earth made new. In this concluding volume, the author powerfully points out the principles involved in the impending conflict and how each person can stand firmly for God and His truth.",
        "authors": "['Ellen G. White', 'General Press']",
        "infoLink": "https://play.google.com/store/books/details?id=OPO0DwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This could be a little daunting to read if you are a Catholic, (I am not, but my spouse and children are and many of my friends as well) as there are some negative points made against the Catholic Church. Never the less, she made some very interesting points that should be looked at and ruminated over. She has a great gift at writing so that everyone can understand her meaning, which is something I have found more difficult with some of the other writers on religion.She was considered a prophet and had written this book almost a century ago and it is amazing how closely and accurately the events that she has prophesised about have fallen into place. It is almost like reading today's paper or watching current events on TV.As I have just finished reading the Bible, I found that her book went right along with it. A couple of things that I found of interest is her claim of the heresy of the church changing the day of the Sabbath to Sunday, which actually I have always wondered about myself, and of churches using Idols-like Mary, etc. both of which when I read the bible, I found was a big no-no. Jesus said that none of his Father's laws were to be changed and then there was mentioned in other places in the Bible that &quot;the times and laws they will be a changing&quot; (or something like that). So it did make me wonder, are we celebrating the wrong day for the Sabbath?Also, it was interesting to note that years ago, the scriptures themselves, were kept from the public and only the priests had access to them. It did indeed sound like, through Satan's influence (the best way that he messes with people's beliefs is when he can do it through a false religious front) that good, God-fearing Christians could have been led astray and not even have realized it. This is where everyone should read the Bible for themselves, and that way, they know exactly what it says and what to look our for.She is very good at describing the ways and means that Satan implements is evil ways. From inside the church, to friends, bribery, etc. nothing is missed by Satan when he looks for ways to mislead the people.If you want a good look at the end of times and the way it could very possibly end, this is an excellent book to read. She is very good at explaining everything. She stresses the Word of the Bible as the definitive answer. Enjoy!",
                "review/helpfulness": "44/54",
                "num_reviews": 54
            },
            {
                "review/text": "This book is obviously a mainstay of the 7th day adventist religion. Though I personally do not subscribe to the doctrine at this time, Ms. White makes a compelling case for &quot;... the infallible authority of the Holy Scriptures as a rule of faith and practice.&quot;Modern day Roman Catholics would likely be surprised and alarmed in reading the book; she reveals in some detail the past corruptions of the Roman church and of the papacy and traditions in particular. While today the pope speaks to eliminate the death penalty, in the history of Rome, the popes used not only death, but terrible tortures to promote and protect his power. Her ultimate conclusion is that the Pope of Rome is the beast of Revelations (so Henry Kissinger can relax a bit). The mark of the beast is in setting aside the precepts laid down in scripture for the traditions invented by man (Sunday vs. Saturday worship, infant baptism, indulgences, worship of saints and Mary, ad infinitem).I recommend this book to any fundamentalist, evangelical, or liberal Christian thinker whether Protestant or Catholic, because it raises our awareness how church leaders can loose sight of the path set down by Jesus and instead promote superstitions set out by men who would use them to achieve and retain worldly power.",
                "review/helpfulness": "48/50",
                "num_reviews": 50
            },
            {
                "review/text": "This is an excellent work, written approximately a century ago, revealing the love, justice, logic, exactness, and pain of our God. Through this book, God shows His work progressing from Eden, through the Old Testament, Jesus and the Apostles, throughout the middle ages, to today, through trials, wars, and oppression. She gives a clarification of the logic and perfection of God as He fulfills His prophecies in Daniel and Revelation at the exact time appointed.This book also reveals Satan's devices, which are at work today, in main stream churches around the world. Baptist, Catholic, Jew, Hindu, Muslim, Methodist, Lutheran, Episcopal, Seventh-day Adventist, Jehovah Witness, Mormon/Latter day Saints, Holiness, Christ of Christ, Pentecostal, Non-Denominational, and ALL other persons will be judged by the same rules. \"By their fruits\" Matthew 7:15-20.In this book, the author clearly explains that good Works do not save us. Faith is revealed by good Works. Good Works are the result of Faith, and &quot;the Holy Scriptures, ... are able to make thee wise unto salvation THROUGH FAITH which is in Christ Jesus.&quot; 2 Timothy 3:15 (See James 2:14-26).The author shows how, by allowing scripture to explain scripture, the prophecy of Daniel 7:25, \"think to change times and laws\", has been fulfilled and how Revelation 14:9, \"the mark\" of the beast, is being fulfilled. She puts in plain words, how this should be an alarm to the whole world to return to the Bible and the Bible only as the only rule of faith, allowing scripture to interpret scripture, just as Jesus did while on this earth. She shows how men, by traditions and &quot;political correctness&quot;, have watered down and changed God's Laws, and interpreted them in a way to make them more acceptable to the masses, preventing men, in the end and to their end, from changing their hearts.The book ends with summary and eye-opening descriptions of the final conflict of this world and hope for the next.The seriousness, clearness, intelligence, magnificence and simplicity of God's Word is revealed, throughout the book, as God tries to lead each believer to repent and &quot;Go and sin no more&quot; John 8:11. &quot;For by grace are ye saved THROUGH FAITH; and that not of yourselves: it is the gift of God. Not of works, lest any man should boast.&quot; Ephesians 2:8,9. \"Even so faith, if it hath not works, is dead, being alone.\" James 2:17Jesus plus faith equals salvation. Ephesians 2:8,9Faith only equals Faith plus Works. Faith without Works equals No faith. . James 2: 14-26If you believe that you are saved by grace only or traditions, or that the blood of Jesus gives us salvation without accountability to God's Law, or that the requirement of obedience for salvation ended at the cross, or that salvation is a gift, even without repentance, please read your bible, and then read this book again. \"But he answered and said unto them, Why do ye also transgress the commandment of God by your tradition?\" \"This people draweth nigh unto me with their mouth, and honoureth me with their lips; but their heart is far from me. But in vain they do worship me, teaching for doctrines the commandments of men.\" Matthew 15:1-20She helps us understand that we are not just to believe, but to obey. \"For the time is come that judgment must begin at the house of God: and if it first begin at us, what shall the end be of them that obey not the gospel of God?\" 1 Peter 4:17In other writings, by this author, she states that her books are NOT a replacement for the Bible or serious Bible study. I recommend this book to anyone who wants to understand why their Christian church believes what they believe, and how God's steadfast requirements do not contradict His unconditional love for us. \"For God so loved THE WORLD, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\" John 3:16",
                "review/helpfulness": "38/48",
                "num_reviews": 48
            },
            {
                "review/text": "As a History major in a non-SDA school, I have read many books regarding the dark ages and world history. Read American Freedom and Catholic Power by Paul Blanshard. You will see a close parallel. The Great Controversy does show you what is happenning in the religious and the secular world. Just look what happened a few days ago! The pope asked the world for forgiveness of their past sins!Now this is a man who is supposed be God on earth, INFALLIBLE. And he is asking the world for forgiveness?Page 571-- &quot;The Roman Church now presents a fair front to the world, covering with apologies her record of horrible cruelties. She has clothed herself in Christlike garments; but she is unchanged. Every principle of the papacy that existed in past ages exists today. The doctrines devised in the darkest ages are still held. Let none deceive themselves. The papacy that Protestants are now so ready to honor is the same that ruled the world in the days of the Reformation, when men of God stood up, at the peril of their lives, to expose her iniquity.&quot;What are the churches of today doing? They are stumbling over themselves to become associated with the Roman Church.A few years back Harry Truman tried to appoint an ambassador to The Vatican, and was almost run out of office. But, Ron Reagan did it and there was very little outcry from the Protestant churches.The World Lutheran Church just signed a concordat with the Vatican that says that Luther was wrong! The Angelicans have done a similar agreement!One review says that she plagerized. If that is true than someone else said that these things would happen; where do they say exactly what she has said?She said there would be a rise in spiritualism, that the churches would be teaching that the dead go to heaven or hell at their death. This book, based on these two facts alone shows that this writer to be a prophetess! I am amazed at the information she has presented in this book and when I read a newspaper and compare, it is almost as if she wrote the bylines.The newspapers are reading like this book and people are missing it!",
                "review/helpfulness": "42/46",
                "num_reviews": 46
            },
            {
                "review/text": "This is an excellent work, written approximately a century ago, revealing the love, justice, logic, exactness, and pain of our God. Through this book, God shows His work progressing from Eden, through the Old Testament, Jesus and the Apostles, throughout the middle ages, to today, through trials, wars, and oppression. She gives a clarification of the logic and perfection of God as He fulfills His prophecies in Daniel and Revelation at the exact time appointed.This book also reveals Satan's devices, which are at work today, in main stream churches around the world. Baptist, Catholic, Jew, Hindu, Muslim, Methodist, Lutheran, Episcopal, Seventh-day Adventist, Jehovah Witness, Mormon/Latter day Saints, Holiness, Christ of Christ, Pentecostal, Non-Denominational, and ALL other persons will be judged by the same rules. &quot;By their fruits&quot; Matthew 7:15-20.In this book, the author clearly explains that good Works do not save us. Faith is revealed by good Works. Good Works are the result of Faith, and &quot;the Holy Scriptures, ... are able to make thee wise unto salvation THROUGH FAITH which is in Christ Jesus.&quot; 2 Timothy 3:15 (See James 2:14-26).The author shows how, by allowing scripture to explain scripture, the prophecy of Daniel 7:25, &quot;think to change times and laws&quot;, has been fulfilled and how Revelation 14:9, &quot;the mark&quot; of the beast, is being fulfilled. She puts in plain words, how this should be an alarm to the whole world to return to the Bible and the Bible only as the only rule of faith, allowing scripture to interpret scripture, just as Jesus did while on this earth. She shows how men, by traditions and &quot;political correctness&quot;, have watered down and changed God's Laws, and interpreted them in a way to make them more acceptable to the masses, preventing men, in the end and to their end, from changing their hearts.The book ends with summary and eye-opening descriptions of the final conflict of this world and hope for the next.The seriousness, clearness, intelligence, magnificence and simplicity of God's Word is revealed, throughout the book, as God tries to lead each believer to repent and &quot;Go and sin no more&quot; John 8:11. &quot;For by grace are ye saved THROUGH FAITH; and that not of yourselves: it is the gift of God. Not of works, lest any man should boast.&quot; Ephesians 2:8,9. &quot;Even so faith, if it hath not works, is dead, being alone.&quot; James 2:17Jesus plus faith equals salvation. Ephesians 2:8,9Faith only equals Faith plus Works. Faith without Works equals No faith. . James 2: 14-26If you believe that you are saved by grace only or traditions, or that the blood of Jesus gives us salvation without accountability to God's Law, or that the requirement of obedience for salvation ended at the cross, or that salvation is a gift, even without repentance, please read your bible, and then read this book again. &quot;But he answered and said unto them, Why do ye also transgress the commandment of God by your tradition?&quot; &quot;This people draweth nigh unto me with their mouth, and honoureth me with their lips; but their heart is far from me. But in vain they do worship me, teaching for doctrines the commandments of men.&quot; Matthew 15:1-20She helps us understand that we are not just to believe, but to obey. &quot;For the time is come that judgment must begin at the house of God: and if it first begin at us, what shall the end be of them that obey not the gospel of God?&quot; 1 Peter 4:17In other writings, by this author, she states that her books are NOT a replacement for the Bible or serious Bible study. I recommend this book to anyone who wants to understand why their Christian church believes what they believe, and how God's steadfast requirements do not contradict His unconditional love for us. &quot;For God so loved THE WORLD, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.&quot; John 3:16",
                "review/helpfulness": "27/40",
                "num_reviews": 40
            },
            {
                "review/text": "I read this book when I was younger and I didn't like it. I am not sure of my reason. Then I became curious as to whether the church we have today differed and how it differed from the church in the aposlotic age. After going back over the book and reading it more in depth, I find the history to be very accurate. I find the theology to be well-supported by the Bible. I can say I am willing to believe what the Bible says, and to doubt anything that does not completely harmonize with God's Word, whether it is popular or not. My own faith is encouraged that God's Word will never contradict itself and gives me a sense of confidence in the accuracy of His Word.",
                "review/helpfulness": "22/27",
                "num_reviews": 27
            },
            {
                "review/text": "I first read this book at 13 years of age. I am now 30. I am amazed by the amazing presience of this author. She outlines in one book what many authors are pointing to at the present--the danger of the religious right, the call to Christian Unity by the Pope, the alarming rise in natural disasters, fires, etc., the sad decline of morality in the world, the money-grab by a few super-rich men who own vast chunks of industry, the plight of the poor in America. Read this book, and prepare to see things in a new way. There's a few reviews that seek to quash this book as more 'Adventist Propaganda.' Read for yourself and see what powerful groups don't want us to see. The books Catholic Power, The Thunder of Justice, and The Keys of This Blood only echo what this book foretold many years ago.",
                "review/helpfulness": "22/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book is very important and backs up the Bible 100% - it doesn't contradict it. It should be read by everyone to get a better understanding of the things that people are so confused about because of the lies of many churches and/or religions. This book explains in clear terms what the Lord asks of us hiding nothing. Not everyone likes to be told the truth, this book is only for those who are ready to know the real truth. If you are familiar with the Bible, you will see that this book is a great book to explain certain issues in detail.",
                "review/helpfulness": "16/23",
                "num_reviews": 23
            },
            {
                "review/text": "Many of the reviews lapse into predictably derisive language including \"if you read this book you've got way to much time on your hands.\" I beg to differ. . . Men and women the world over are searching for truth. Many times, as also seen in some of the reviews, truth is mistaken for or deliberatley compared to fanaticism (Heaven's Gate, Davidians, etc). However, what cannot be disputed - or refuted - is the accuracy of this woman's predictions so far.One reviewer stated that there are \"lies on every page.\" Ouch!. . . (Something in the book really struck a raw nerve.)All religions that are predicting end of the world scenarios that seem to converge on this century. Heck, even the Discovery Channel has \"Super Tsunami\" and Earthquake programs that predict coming global devastation on a scale that mankind has not seen. To disparage this woman simply because she ties all of this in with the urgency of getting oneself right with God - not some man - seems entirely plausible, totally rational, and downright prudent considering what is at stake.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "Tell you what, if you wanna know some facts that are so limited in our time, this book will reveal things you'll never find in just any other book. Before reading this book I have searched for an accurate picture of things which have happened early in Christianity. Obviously, I wasn't satisfied. But this book really took care of that. I may not agree with some things Ellen White says, or believes, but I commend her for giving an accurate review of Christianity that I wasn't alive to see. I recommend this book to anyone who is truthful with themselves, and with their soul.",
                "review/helpfulness": "15/21",
                "num_reviews": 21
            }
        ]
    },
    {
        "Title": "best of aw tozer book 1",
        "description": "In The Best of A.W. Tozer Book One we find that Warren Wiersbe compiled a fantastic amount of writings to show us once again that Tozer had a gift from God. This collection of 52 favorite chapters of Tozer's writings highlight that as A.W. Tozer said, \"I guess my philosophy is this: Everything is wrong until God sets it right.\" These writings represent the major themes from the works of A.W. Tozer and each reveals deep, refreshing insight, conviction, and originality of thought. From Let My People Go to The Pursuit of God, Tozer's books were always written after long hours of meditation and prayer. Perhaps this explains their wide circulation and lasting influence.",
        "authors": "['A. W. Tozer']",
        "infoLink": "http://books.google.com/books?id=Fl4pPQAACAAJ&dq=Best+of+A.W.+Tozer,+Book+1&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "AW Tozer is a man of God who was self-taught (many times on his knees before the open Bible) and not seminary trained, because he could not afford to go to seminary. But his learning was through the Spirit of God and his diligence. And this book, \"Best of AW Tozer (vol.1)\" IS indeed great summary of Tozer's spirituality (Thanks to Warren Wiersbe who compiled and selected these chapters from Tozer's numerous books). In this book, Tozer teaches us in sum:1. What is essential Chrisitan life? He talks of believers' NEED for genuine love for Christ and His Return. For example Tozer accurately points out, \"Another reason for the absence of real yearning for Christ' return is that Christians are so comfortable in this world that they have little desire to leave it... in these times of religion has become jolly good fun right here in this present world, and what's the hurry about heaven anyway?\" (p.57). Such words challenge our heart of hearts. And there are more words like this in this book.2. What is proper knowledge of God? He does not mean merely doctrinal or theological side of it (though he emphasizes it elsewhere in the book), but also experiential walk with God and seeking Him. He said, \"[holy men and women] want to taste, to touch with their hearts, to see with their inner eyes the wonder that is God... The evil habit of seeking 'God-and' effectively prevents us from finding God in full revelation. In the '-and' lies our great woe. If we omit the '-and,' we shall soon find God\" (pp. 17,18). He is right. And there are more helpful, challenging, and edifying articles in the book.Those who read this book will not be disappointed, because Tozer redirects believer's focus onto God and God alone.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "Im a &quot;Born again Christian for 14 years now. Of all christian books that i have read, The Pursuit of God is the only book that make me cry. By reading this book, you will convince that God really exist. A.W. Tozer is really a modern day prophet of the living God.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "The Best of A.W. Tozer contains a variety of Tozers' Short essays on a wide variety of subjects. Like my other favorite Christian author, C.S. Lewis, Tozer is perceptive, original, plain-spoken, not squeamish about any subject of concern to the Christian reader. His wisdom, discernment and insight into the lives and concerns of committed Christians is of great practical use when making decisions, or thinking over a situation. Although not a \"self-help\" book per se, Tozer's observations and insights are drawn from the greatest of all self-help books, the Bible.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "When I picked up this book for the first time, I had no idea what I was in for. As a Christian, I wanted to know more about the Lord, as well as be challenged in my daily walk. This book certainly delivered! A. W. Tozer does not pull punches, but speaks boldly as to what the Bible says about how we should live our lives. Next to the Bible (of course), this is the most inspiring book I have ever read. I recommend it very highly.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am not even finished with this book yet, however, I am loving it. A.W. Tozer is great with words and expressing his thoughts on personal life and the church. He is not schooled through seminary which is why I believe that the average person would understand and enjoy his teachings.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a book written to Christians, that is, to people who have received Jesus Christ as personal Savior. The principles laid out are for Godly living, personal accountabilty, truth with one's self, and ultimately for the glorification of God and the Lord Jesus Christ by the individual believer. Tozer is very frank in his acessment of the way Christians display ungodly as well as godly attributes and behavior. If your goal is to emulate what God has revealed in the Bible as a profitable Christian life you will enjoy the 52 chapters compiled by Wiersbe. Tozer as usual will motivate introspection through the guidance of the Word of God and the Holy Sririt of God. I highly recommend this book, as well as any Tozer material available.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Economical, travel ready..it is Tozer.What more can be said?Probably only this: Get Volume II as well.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the god of promise and the life of faith understanding the heart of the bible",
        "description": "This theological primer lets the Bible tell its own message, providing a basic framework for Scripture that will encourage readers to take up the Bible for themselves and grow in faith, hope, and love.",
        "authors": "['Scott J. Hafemann']",
        "infoLink": "https://play.google.com/store/books/details?id=PX1UAQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "There is no way to put into words how valuable this book is. Hafemann opens up the Bible in a way I have yet seen or read. Hafemann shows us how the heart of the Bible is trusting in God's provisions and being thankful, therefor honoring God as God (Romans 1). He shows us how the Old Testament Convenent was not replaced by the new, but was fullilled by it, in that we now have the Spirit and therefor the ability to obey God's commands, which both benefits us and brings Him glory! Hafemann is uncomprising in his exegesis of the Bible. There is no waterdown or health and wealth gospel in these pages. Hafemann shows how God uncondiontially elects us to serve and obey him, and uses suffering to both make us more like Christ as well as bring Himself glory by showing to the world that God's people trust Him even in adverse circumstances.If you were going to read one book your whole life, read the Bible. But if you were going to read two books, get this book.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is a book that is a good starting point for understanding God's actions throughout redemptive history. It is not difficult to read and there are many good points in it. However, there are some problems and questionable conclusions that make this book a mediocre one. However, before discussing the negatives I will first mention some of the positives.Positives:Hafemann's discussions (chapters 4 and 7) on the what it means to truly trust God despite one's circumstances is a gem. Many readers will find very helpful pastoral-like statements that will help them understand why God's people suffer and why believers should never fall into utter despair (and why trusting in God's provisions and promises are essential in overcoming this despair). Another good discussion is how the Bible reconciles God's character and sovereignty with the existence of suffering and sin (chapter 6). Hafemann does a good job refuting the common Arminian, \"open-theist\", and process views of theodicy (pp. 130-5). He opts for the typical Calvinist view that suffering and sin exist within God's plan so that He can reveal His glory to the world (pp. 135-9). Hafemann's discussion on theodicy is excellent and many will find convincing reasons why the Calvinist approach is the most Biblical and rational.Negatives:Hafemann actually denies in this book the Reformation principle of justification by faith alone. In fact, the view presented in the book is a departure from the view of justification advocated in the Formula of Concord, the Anglican Thirty-Nine Articles, the Westminster Confession of Faith, and the London Baptist Confession of Faith of 1689. In fact, Hafemann advocates a view of justification that is a combination of the forensic view of Protestantism and the re-creative view of Roman Catholicism (cf. p. 124). In fact, on page 180 he states: \"Obeying in order to inherit God's future grace (his covenant blessings) means obeying in order not to inherit his future wrath (his covenant curses).\" It is no surprise then that the \"letter-spirit\" approach to the Law is not widely accepted by most orthodox Protestants (cf. pp. 226-8 n. 15). Hafemann even questions the way Lutheran, Reformed, and Dispensational scholars have typically understood the Law's relationship to the Gospel (pp. 244-6 n. 6). Hafemann's view should be more accurately stated as justification by faith/works (or trust/law-keeping). This is basically a reemergence of the radical Anabaptistic view of the Law and Gospel. Many orthodox Protestants will find Hafemann's work questionable and controversial. For those who enthusiastically support Hafemann's view of the Law (and its relationship to the Gospel) should realize that they are the one's departing from the historic Protestant faith and not the Lutherans, Reformed, or Dispensationalists.Regardless of all the questionable points made in the book it is a good place to start in understanding the hope believers have in the midst of their suffering and why God does what He does throughout history.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "Written simply and full of deep insight, this is a book that will inspire faith in the seeking heart.I was struggling with trusting God and repeatedly prayed about it. The Lord used this book to open my eyes and give me wisdom concerning what it means to trust Him and to live a life of faith.I learnt about obedience to God in a brand new light. I used to fear the teaching of obedience, as I always heard it taught using condemnation eg. &quot;You must obey God or else....&quot; It only made me more afraid, and consequently, more rebellious toward a God whom I perceived to be demanding, over-bearing, and vindictive.This book helped to clarify so much of that wrong theology. Obedience is a Biblical concept, a must, but the way we approach it must be through the way of tenderness, grace, and kindness. Mercy triumphs in the end, not judgment, and God delights in mercy. It is ultimately His goodness that leads one to repent, to change his way of thinking, to yield and submit. The Word says : Husband, love your wives (then), wives, submit. Understanding God our Husbandman who loves us deeply is a tremendous stimulus for us (the bride of Christ) to respond with willing and eager submission.This book is recommended reading for new believers and also for &quot;old&quot; believers who have somehow lost their way in the wilderness of hyper-faith teachings supported only by enthusiasm and flimsy feelings, legalistic teachings that ultimately lead to bitterness and hardness of heart, and false doctrines based only on man's word without any on God's Bible.The book explains in detail what living the Christian life is like and how to know God. For a person seeking a relationship with God not based on subjective realism but on solid truth, this book will be a welcome addition to your library.God bless and Jesus loves you.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Hafemann writes VERY well. This book is full of striking, concise phrases which penetrate and stimulate the reader.There is plenty of room for theological discussion and disagreement with many of Hafemann's positions, but his insights into the nature and purposes of suffering are some of the best I have ever seen. That section alone is worth the reading even if disagreements over other theological issues (the nature of faith, the function and place of obedience, the limits of Jesus' atoning death and the manner of its application, baptism, etc.) might be an initial distraction.The purpose of this book is admirable and timely. Hafemann's call for obedience and trust is a welcome reminder that nothing in the Gospel of Jesus Christ is compatible with that current Evangelical misunderstanding that is commonly called \"easy grace\" (see explicit statements, pg. 180ff). I suppose, apart from very strong objections to his views on certain theological doctrines, my most serious concern with this book is Hafemann's implicit or explicit focus on quantitative gains in sanctification (obedience) as the grounds for personal assurance in the life of a believer. He discounts `striving' in favor of `victory' in my reading. In his formulations he tends toward an \"enlightened self-interest\" as the basis of our faith, a problem he shares and perhaps derives from John Piper. I agree that yearning for the Kingdom of God and for the Glory of God through Christ is the key to our motivation and the most certain indicator of the indwelling of the Holy Spirit in our lives. But the blessings that accrue to us in the fulfillment of all these things is a by-product, a fruit of them, rather than the ultimate motivation for them. If we simply lived and died and our existence was given up to oblivion such that the future hope of the Glory of God through Christ would not be our experience, yet it is something to be desired and loved and cherished for its own sake. It is wonderful that God blesses us also, but it is not absolutely essential, in our regenerated hearts, that the blessing we receive must be the motivation for our actions.Hafemann's identification of \"faith\" with trusting God as provider based on what He has done in the past is unnecessarily reductionist. Trusting God as provider based on what He has done in the past is one aspect of faith and a very important one, but not the sum of it. I prefer a wider-orbed definition that essentially describes it in terms of world-view. \"Faith\" is the manifestation of a renewed mind and heart such that a person understands and embraces all the universe, its history and its future, including himself in it, in terms of God the Father, His Son Jesus Christ and the Holy Spirit as is taught and revealed in the Holy Scriptures.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the great doctrines of the bible",
        "description": "This study is a good coverage of the Biblical basis of Catholic theology, covering everything from the nature of the Trinity to the Resurrection of the Dead. William Evans outlines ten Biblical doctrines. His work is well organized and touches on most of the points people have questions on. He provides plenty of Bible verses as references to lead the serious reader into a deeper study of each subject.",
        "authors": "['William Evans']",
        "infoLink": "https://play.google.com/store/books/details?id=PybDDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Dr. Evans in this book teaches on the Doctrine of God, Jesus Christ, Holy Spirit, Man, Salvation, Church, Scriptures, Angels, Satan, Last Things. There is also eighty additional entries by Maxwell Coder. I particularly enjoyed the doctrine of God (about 50 pages) wherein he argued not only the characteristics of God but also the existance of God using a view philosiphical arguments. It is however clear from reading the book that it is quite old and it's theology the same - written in the beginning of this century. For those looking for a more modern approach I would not recommend it, but for general study, looking for a good supply of scripture references and sufficient notes on different doctrines, this book is worth having.",
                "review/helpfulness": "80/82",
                "num_reviews": 82
            },
            {
                "review/text": "\"Great Doctrines of the Bible\" by William Evans is a necessary addition to any Christian's personal library. It thoroughly outlines the ten great doctrines of the Bible and explains each one in a way that is easily understood to improve one's faith and ability to share the Gospel truths with others. The ten doctrines explained are: God, Jesus Christ, Holy Spirit, Man, Salvation, The Church, Scriptures, Angels, Satan, and The Last Things. I highly recommend this book to all Bible students and Christians looking to increase their knowledge of basic Biblical doctrine. A strong foundation is necessary for all Christians and this book will benefit all who read it.",
                "review/helpfulness": "42/43",
                "num_reviews": 43
            },
            {
                "review/text": "This is a very good introduction to Christian Theology. It is basic and concise. Not as thorough a treatment as some might wish, but very well laid out and user friendly for developing your own lessons on the subjects it covers.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "I am a Pastor and I use this book as part of our Church ministerial studies courses toward obtaining a minister's license through our ministry. This book is very informative and gives our ministers a better unstanding of the doctrines of the Bible. I would recommend this book to anyone who wants to have a better understanding of who God is, Who Jesus is, and Who the Holy Spirit is as well as all the other doctrines that are covered in this book.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "A must read and \"must keep\" for basic scholar theological reference.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The book is a must read for the Born Again Christian. It helps to deep seat the doctrines of the Bible into the heart helping you to see clearly those great doctrines that define our faith, and separates our faith of distinct truths from other religions.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "19 gifts of the spirit",
        "description": "CHARISMATIC? YOU CERTAINLY ARE...IF YOU ARE A CHRISTIAN AT ALL. But perhaps not in the way the term is frequently used today. Charismata is a Greek word meaning \"gifts of grace.\" It refers to the gifts or special abilities given to Christians by the Holy Spirit--all the gifts, not just speaking in tongues or miracles or healing. -> What are the 19 gifts? -> Are they all for today? -> What is their purpose? -> How can we discover and put to use our own gifts? All of these questions, plus a careful examination of gifts revealed in the Bible, are included in this in-depth study, first published in 1974. If you want to know what the Bible says about spiritual gifts, this book is for you. Dr. Leslie Flynn is the former pastor of Grace Conservative Baptist Church in Nanuet, New York, where he served for 40 years. He has written more than 30 books, among them this classic and The Twelve.",
        "authors": "['Leslie B. Flynn']",
        "infoLink": "https://play.google.com/store/books/details?id=p6dTJFPT8tAC&source=gbs_api",
        "review": [
            {
                "review/text": "Dr. Flynn states that his book is Charismatic and that the gifts are supernatural. Unfortunately, his definitions of some of the gifts are limited. He does not use the traditional definition of charismatic. He holds to the convention that God gives no new revelations, only that written Scripture is clarified.For example, &quot;Word of Knowledge&quot; according to the author, &quot;enables the believer to search, systemize and summarize the teachings of the word of God.&quot; It is then shared with others. The difference between this and teaching, he says, depends whether we emphasize communication or knowledge. Thoughout the book, he implies that some of the gifts are not for today and if they are for today, that they are for set and determinable circumstances.A good point the auther made, was lack of a gift does not excuse us from abstaining in a particular area. For example, we all should give and exercise mercy regardless of whether we have the gifts or giving and mercy. He made many other good points as well.What we have to realize is that we are all the body of Christ. How we define the gifts is not something that will keep us out of heaven or get us in.For most of my Baptist brothers and sisters in Christ, this book is for you. My Assembly of God brothers and sisters probably will not agree with some of the definitions used and some of the limitations placed on the gifts. My other brothers and sisters, it depends on your definition of &quot;charismatic.&quot; I have to admit, if I was Baptist, I'd give the book a 5 star rating.In addition, regardless of the interpretation of the Scriptures on this subject matter, the book is well written and well organized. It is easy to follow and holds your attention.",
                "review/helpfulness": "46/49",
                "num_reviews": 49
            },
            {
                "review/text": "I read this book when it first came out in the 1970s and recently got the updated version. I have always found it helpful, but wish Flynn had not limited himself to 19 gifts (what about the gifts of intercession, creativity and craftsmanship?). The book is very helpful for the gifts it does cover, though.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "Dr. Flynn does a great job of breaking down a large subject that can be difficult to understand. Unlike many commentaries, this one is straight forward, with illustrative stories. It is biblically sound and the women in my Bible study have found it very helpful in furthering their understanding (as well as mine) of spiritual gifts in general, as well as which gifts they possess. I highly recommend this book!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Ever read a book of this type that just drones on and you say to yourself, \"just get to your point!\" Well, this one makes the point without being wordy. It's great to use for busy adults who want something thought provoking with great scripture referance. It's great for adult Bible Studies for folks that don't have alot of time for homework or prep but want to grow spiritually and be challanged on what was thought to be their Spiritual Gift(s). Only negative is that this rewrite from the original (1970's)could have updated some of the examples that adults under age 40 may not be familiar with.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I found that this book wrote more on the indiviual gifts than most commentaries and theologies that I've read",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was a huge learning for me! I understand myself and my gifts more fully and I am using it daily in my coaching practice! I thoroughly enjoyed reading this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "In the spirit of the fruit - the main one - love, I respond. Having read the book, I too found the information more useful toward the Baptist denominational followers more so than Charismatics just as one other reviewer has mentioned.I disagreed respectfully with a number of statements which seem almost qualified with scripture given but leave somewhat of a questionable nature on the actual and factual method for delivery.It would seem the gift Giver is obviously the one to seek, not the gifts. Jesus pointed out He would send the Helper and greater things would be accomplished. Nevertheless, Jesus did point out the Helper would be sent. Since the Helper is the Holy Spirit and the giver of gifts then why wouldn't anyone want to follow through with their ministry or just being a Christian in seeking out the most beneficial gifts that would make that person a more effective Christian in his/her life as well as a giver of the message of love to all those in the world?In a nutshell, you may have some success as many ministers, evangelists, etc. have had in doing the good battle and having done all stood; however, some of the persons quoted as not having the Baptism of the Holy Spirit but still leading effective ministries arises for question as well. Dr. Moody I believe is one of the prime examples that questioned two women in his services as to why they prayed for him and their response to effect being 'because you need power'. To which on a later date he sought that power and upon receiving it became aware that his effectiveness in preaching advanced by leaps and bounds from his previous methods.Billy Graham in his book on the Holy Spirit even admits there are some things he cannot explain. Could that be because there is an actual furthering beyond the intial salvation experience. And again, the query as to what constitutes an \"experience\" vice a validated biblical foundation for such an action is qualified by Christ -Amplified Bible, Mark 16:17 \"And these attesting signs will accompany those who believe: in My name they will drive out demons; they will speak in new languages; they will pick up serpents; and [even] if they drink anything deadly, it will not hurt them; they will lay their hands on the sick, and they will get well.\"Then why not ask for it? Amplified Bible, Luke 11:13 - If you then, evil as you are, know how to give good gifts [gifts that are to their advantage] to your children, how much more will your heavenly Father give the Holy Spirit to those who ask and continue to ask Him!About those \"tongues\", the statement in the book similar to \"why didn't the converted 3,000 at Pentecost speak in unknown tongues if it was to be an evidence of the Baptism of the Holy Spirit?\" Who's to say some did not? The initial focus was upon receiving Christ as savior first and foremost; however, that does not nullify the possibility that those same 3,000, or a part thereof, sought the gift of the Holy Spirit and speaking in tongues.I find it rather difficult to equate the gift of such a wondrous and divine experience to Hindus, Mormons, Zulus, etc. as mentioned in the book without qualification of 1 John 4:1-4 Amplified Bible, 1.BELOVED, do not put faith in every spirit, but prove (test) the spirits to discover whether they proceed from God; for many false prophets have gone forth into the world.2By this you may know (perceive and recognize) the Spirit of God: every spirit which acknowledges and confesses [the fact] that Jesus Christ (the Messiah) [actually] has become man and has come in the flesh is of God [has God for its source];3And every spirit which does not acknowledge and confess that Jesus Christ has come in the flesh [but would annul, destroy, sever, disunite Him] is not of God [does not proceed from Him]. This [nonconfession] is the [spirit] of the antichrist, [of] which you heard that it was coming, and now it is already in the world.4Little children, you are of God [you belong to Him] and have [already] defeated and overcome them [the agents of the antichrist], because He Who lives in you is greater (mightier) than he who is in the world.It is interesting that the author points out \"forbid not\" under the portion concerning speaking in tongues. This seems to be a qualifier in itself.Another questionable avenue of thought in the book was the \"inconsistency of Paul to deliver in his other letters more information concerning this most controversial of gifts \"speaking in tongues\" which the author points out as a proof that it is not that important. His argument is the Corinthians had a problem which needed to be addressed. I would have to say to that point, aren't we all Corinthians in this day with not only that problem but others as well? Paul on the other hand addressed other problems - law vs faith as in Galatians for example in which he was very upset with that group of followers. How about in the book of Romans in having to settle that the Gentiles are also given the gift of salvation?And what about Paul speaking more than anybody else in \"tongues\"? I don't think he really had a problem with it. Why should we?People don't just automatically start speaking in tongues, there has to be a source. I would think it's obvious - the Holy Spirit if asked will bless. If you ask for healing do you receive it, if you ask for anything from God do you not expect Him to answer. Doesn't it say:Amplified Bible: Matthew 7:7,8 - Keep on asking and it will be given you; keep on seeking and you will find; keep on knocking [reverently] and [the door] will be opened to you.8For everyone who keeps on asking receives; and he who keeps on seeking finds; and to him who keeps on knocking, [the door] will be opened.Obviously the other gifts are not questioned, but this one is isolated. Rather than isolating it and the Baptism of the Holy Spirit, perhaps it should be characterized as the will of God as a sign as was indicated in the early Church and is still being used as such in this day and present age; and, perhaps we should be a lot more careful on trying to disprove it and rather accept it having studied and gained and move in faith.Amplified Bible: Hebrews 11:6 But without faith it is impossible to please and be satisfactory to Him. For whoever would come near to God must [necessarily] believe that God exists and that He is the rewarder of those who earnestly and diligently seek Him [out].Do we disqualify angels because they were present in the past? Do we question God and say that was then, this is now and different? Do we discredit God by saying we are in the age of science and therefore faith has no substance?In essence, do we put God in a box and expect Him to stay there because of our humanism and lack of understanding?To that I say, choose. Either God is real or He is not. If He is, then why wouldn't all of the signs and wonders and gifts and the Holy Spirit follow just as Jesus said. And more that He hasn't even revealed to us yet? God, being so loving and having such long-suffering puts up with us. We're the problem, but He has given the solution.As far as entries on Campus Crusade for Christ as a foundational stone to go by in the book, here is my experience. In the year 1973, March 14 at New Mexico State University, I received Jesus Christ as my Lord and Savior and became acquainted with Him through a reading of the tract the 4 Spiritual Laws. The blessed man who led me to the Lord, Gary Ramm, who I thank and think very highly of to this day and discipled me in sharing my faith with others was an incredible person to look up to. My experience was a complete turn around so much so that a great many students on the campus became quite aware of my life changing experience, many of which could not explain what happened to me but said at the time \"He Got Religion\". I did not get \"religion\" but it became quite clear what I did get was Jesus Christ and a 180 degree about face. I became BOLD and ON FIRE for the Lord.I also read the other tract Campus Crusade for Christ had at the time about the \"Infilling of the Spirit\". I knew there seemed to be more than just the initial faith-based asking of the Lord into my life (Revelation 3:20). Later, as my student teaching proceeded in my next to last semester at Las Cruces, New Mexico, I went back to Aztec and Farmington, New Mexico. There I met a couple that were Christians but very unique. I queried that difference and was told to read 1 Corinthians 12, 13, and 14. I studied those chapters inside and out, upside and downside, but they just did not make any sense. I questioned the authority of the Baptism of the Holy Spirit, I even went so far as to attend a Full Gospel Business Men's Meeting in which the Lt Gov of New Mexico spoke. I listened intently. When the invitation for receiving Christ as saviour was given I saw nothing contrary to what I had seen before and the enriching and overflowing of love that poured out was inspiring. Then the call for those who would like to receive the Baptism of the Holy Spirit went out and I went up. I did receive the gift of the Holy Spirit and arose laughing and speaking in tongues. I became BOLDER and MORE ON FIRE for the Lord.Upon my return to NMSU, I ran into a fellow Christian. After a short but pleasant visit and fellowship we set about to drive onto the campus. However, his car would not start. I told him, let's pray and lay hands upon it. We did and the car started right up with the lights on. He told me, this is just like some of the things that had happened in the past.When I met the one that led me to the Lord, he could not explain what had happened to me, but did tell me he thought I was going down the wrong path. Talk about an unsettling experience! Here I was attempting to follow the Lord closer than I've ever been and to be told I was wrong - well, it was heartbreaking. I could not deny what happened to me, but yet the enemy sought to set me on a path of questioning myself as well as those whom I knew were sincere Christians.Later, the Campus Crusade for Christ members along with the Navigators held a meeting to discuss the strange happenings that were taking place all over campus as the Holy Spirit continued to be poured out upon more and more students. From my roommate's feedback who attended the meeting, \"They decided it is not for today and there's nothing to it.\" Eventually, my roommate attended a Full Gospel Business Men's Meeting within the city in which one of his former employers was the speaker. This man whom my roommate had a close kinship to convinced him that the Baptism of the Holy Spirit was real. My roommate asked for the gift and came back speaking in tongues. Before this he would attempt to do so and it was obviously just jibberish, the transition to the real deal was incredibily wonderful.I could go on and on about how my dearest friend the Holy Spirit has done miraculous things in my life and has led me to the feet of Jesus in understanding more and more the sacrifice the Father allowed to happen.And normally, I would let this pass; however, I think I would be remiss if I did not say something.The good Doctor's book does have some wonderful direction, but it seems to lack \"meat\" and I mean to say that in the most respectful way I can. It leads to the possibilities of interest and \"experiences\" which is in opposition to \"biblical based\" guidance as he puts it. However, let's just say suppose the Holy Spirit, Jesus, God the Father - the trinity wants you to pray for someone to receiver their sight? Can you do it? What if you're the only one around that person trusts to pray for him/her? Are you going to shirk and pass it off or will you allow God to give you the gift necessary to accomplish the task as it presents itself. I think a lot of us feel very disqualified when God is actually telling us you are equipped, if you're not then ask and get equipped. That's not to say just go out there without the direction of the Holy Spirit, but it is saying maybe He's calling you for greater things and \"us\" being just a bit shy may be holding things up. Again, seek the gift giver.For those of you seeking the Gift Giver, I would highly recommend Catherine Marshall and her book \"The Helper\". In fact, Doctor, I would highly recommend it for you as well, I think you will see something even more incredible and I look forward and challenge you to write a better update on your book after you have studied a lot more.And as far as Campus Crusade for Christ, they gave me the left foot of fellowship simply because I was too on fire for the Lord for them to handle.Be it known, like Joshua, Amplified Bible: Joshua 24:15 - And if it seems evil to you to serve the Lord, choose for yourselves this day whom you will serve, whether the gods which your fathers served on the other side of the River, or the gods of the Amorites, in whose land you dwell; but as for me and my house, we will serve the Lord.Let me tell you of a dream I once had and then a second dream of like nature. I saw Jesus standing to my left facing me. To my right was a door. I watched as Jesus opened the door outward. Inside was a room full of glittering gold and silver objects. I smiled and picked one of the objects up and turned to the Lord. To my dismay, I saw a saddened look upon his face and I realized what I had done. Instead of being intent upon the Lord, I was intent upon the gift but now the door was closed and I could not put the object back. A few months later I had a similar dream, but this time when the Lord opened the door I did not take anything, instead I put the gift back that I already had and looked up at Jesus. He smiled at me and said, \"Now you have learned that I am your source for all good gifts and the focus upon which you should concentrate, the door is opened for you to use any gift I desire for you to use for the benefit of others, enter and I will guide you.\" To that I reached up and took hold of Jesus hand and we entered the room. To my surprise I discovered it was a storehouse of gifts without end.From the two dreams I have found whatever gift the Lord wants to use on a day by day basis seems to be the right one. Oftentimes, it's more than one. Sometimes it's praying for someone to receive a physical heart for a transplant, sometimes it's simply a kind word to the janitor and letting her know she's doing a great job, sometimes it's speaking to a supervisor to let them know I work as unto the Lord.But sometimes it's praying in tongues while taking five mile long walks, praying with the gift of faith with a pastor who's church was vandalized and burnt to the ground and expecting the rebuilding to begin immediately with funding sources God opens up, or speaking to people who have died and come back from the dead with a good report that Heaven does exist. And sometimes it's demonstrating the act of writing which I believe is a talent God has given me and which more and more of you will witness as I allow my Lord and Saviour to use me as He sees fit.One more thing which I do agree with the good Doctor on that I did learn from his book concering prophesy involving encouragement. If this be prophesy then it be a good thing: May God, the author and finisher of your faith, enrich your lives and direct your paths in all the ways that you should go and strengthen your hearts with the truth of the word as directed by the Holy Spirit. And as Campus Crusade has indicated: God does love you and does have a plan for your life.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you are tired of the Charismatic and Pentecostal confusion surrounding the subject of the Fruits of the Spirit this book is a breath of fresh air. Written from a dispensational interpretation of the Scriptures it tenderly encourages the use of and development of your own Fruit of the Spirit to the betterment of the Church of Christ as a whole and even your own local church of which you may be a member.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "historical criticism of the bible",
        "description": "A former liberal scholar and student of Rudolph Bultmann and Ernst Fuchs tells how modern biblical scholarship has drifted far from the truth, and why its assumptions are nonetheless so influential and thereby dangerous.",
        "authors": "['Eta Linnemann', 'Robert W. Yarbrough']",
        "infoLink": "http://books.google.nl/books?id=gVfFwAEACAAJ&dq=Historical+Criticism+of+the+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Linnemann brings a refreshing corrector to the many nonsenses of higher criticism/s. Her conversion story (covered partially in her introduction - pages 17-20) is a beautiful example of God's sovereign grace.The term \"Historical Criticism\" is really only defined by the translator - page 7. This may be because Historical Criticism is a more well-known term in the German. It does not seem to be the same as \"the Historical-Critical Method\" which Edgar Krentz writes about in the Fortress Press offering in the \"Guides to Biblical Scholarship\" series. Rather, it includes all the higher criticisms, such as form and redactional criticism. Textual criticism is an example of lower criticism, which, used honestly and properly, glorifies God because it is aimed at ascertaining what the text of the original languages actually says, rather than dodging the commands of a holy God. Good introductions to Textual Criticism are Clayton Harrop's \"History of the New Testament in Plain Language\" and D.A. Carson's \"The King James Version Debate\". The latter is not simply a polemic against the KJV, it is also a very helpful primer on textual criticism. For those who want to get more serious (or who have slightly deeper pockets), Bruce Metzger's \"A Textual Commentary on the Greek New Testament\" is indispensable.There are three reasons why I was lead to this book:1) It is in the \"For Further Reading\" section of \"Theological Liberalism: A Handful of Pebbles\" by Peter Barnes (along with Machen's \"Christianity and Liberalism\", Murray's \"Evangelicalism Divided\" and Shaeffer's \"The Great Evangelical Disaster\". After having read Barnes' excellent book on theological liberalism I decided to work my way through his whole \"For Further Reading\" section.2) I enjoyed, Linnemann's \"Is there a Synoptic Problem?\", which is also translated by Yarbrough.3) The overall importance and urgency of the subject matter that Linnemann covers.I thought that the rather lengthy proposal for evangelical learning centres should have been in the latter part of the book, rather than the former. But this is a minor gripe, and the book thoroughly deserves 5 stars.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "Eta Linnemann studied under Germany's elite biblical scholars--Rudolph Bultmann and Ernst Fuchs, Friedrich Gogarten and Gerhard Ebeling. She passed the exacting hurdles which grant entrance into academia, ultimately becoming an professor of New Testament at Philipps University in Marburg. Along the way she published books and articles espousing the \"historical-critical\" methodology she'd been taught. In Historical Criticism of the Bible: Methodology or Ideology? (Grand Rapids: Baker Book House, c. 1990), she announces her repudiation of that methodology--which she now insists is an atheistic ideology or \"theology\"--and sorrows for the damage it's done to the Church of Jesus Christ.She also laments the young people historical criticism has harmed: \"We have put generation after generation of believing Christian young people, who were willing and eager to serve God, through this fire, sacrificing them to the Moloch of an atheistic theology. The result has been generation after generation of misguided guides\" (p. 117). In her introduction, which reads much like an impassioned manifesto, Linnemann declares: \"My 'No!' to the historical theology stems from my 'Yes!' to my wonderful Lord and Savior Jesus Christ and to the glorious redemption he accomplished for me on Golgotha\" (p. 17). Furthermore, \"on the basis of various observations, discoveries, and a resulting self-awareness, I was forced to conclude two things I did not wish: (1) no 'truth' could emerge from this 'scientific work on the biblical text' and (2) such labor does not serve the proclamation of the gospel\" (p. 17).On a personal level, her lifelong immersion in biblical studies, following the \"historical-critical methodology,\" resulted in a \"profound disillusionment\" which led her into a variety of \"addictions\" (TV and alcohol). Graciously, God brought some believers into her life who cared for her, prayed with her, and helped her find the living Lord. In time, \"By God's grace and love I entrusted my life to Jesus\" (p. 18). That surrender resulted in a deliverance from her addictions and an entrance into the life she'd long longed for. It was as if she emerged from the fog into the sunshine. \"I was able to recognize sin clearly as sin rather than merely make excuses for it as was my previous habit. I can still remember the delicious joy I felt when for the first time black was once more black and white was once more white; the two ceased to pool together as indistinguishable gray\" (p. 18).Concurrently she discovered the integrity and supernatural inspiration of God's Word--\"I recognized, first mentally, but then in a vital, experiential way, that Holy Scripture is inspired\" (p. 20). Quite a revelation for a German university New Testament professor! Eyes opened by miracles taking place even today, her \"scientific\" biases against biblical miracles quickly dissolved. She also found Christ's atoning work for sin on Calvary freed her from her own sins. In view of all this, \"That is why I say 'No!' to the historical-critical theology: I regard everything that I taught and wrote before I entrusted my life to Jesus as refuse\" (p. 20). She has tossed into the trash, with the emotional zeal of a new convert, all the books and articles she earlier wrote--and she urges all who have them on their shelves to do likewise! She turned her life over to God's guidance and went to teach in a Bible college in Indonesia, hoping her biblical studies could contribute to spreading the Faith and furthering Christ's Kingdom.In the first chapter, she evaluates the modern university and its impact on biblical studies. In her judgment, universities since the Enlightenment have been atheistic in their assumptions and pagan in their functions. Thus any education which hopes to be truly Christian \"can be established only by conscious dissociation from the modern European university and its history\" (p. 49). That dissociation must be radical! Simply gathering Christian teachers and students together will not suffice. Beginning classes with prayer may be pius, but not efficacious. \"The content of the activities must be fundamentally transformed from the ground up. Entire areas of intellectual inquiry must be grounded in God's Word\" (p. 49). The Bible must be brought to the heart of every academic discipline. She writes as an advocate, it would seem, of Bible colleges--or at least Christian colleges completely suffused with Scripture.For only the Bible is forever relevant to man's endeavors. In a profound sense, Linnemann takes Luther's adamant sola scriptura principle with utter seriousness. In fact, the Bible is more \"modern\" than the illusions which were judged \"up-to-date\" two decades ago! The \"modern man\" of the French Revolution, worshipping the goddess Reason, seems curiously antiquated compared with father Abraham! For Linnemann it's back to the Bible if we're to deal with what's to come.Having critiqued the university scene, she then discusses, in Part Two, \"God's Word and Historical-Critical Theology.\" Here she insists that biblical scholars, seeking to be respectable and \"scientific,\" have deserted their true calling. \"The Bible is no longer esteemed as God's word in the way it is handled. It is taken for granted that the words of the Bible and God's words are not identical\" (p. 83). \"Using grotesque literary methods\" which would be shoveled aside in other disciplines, university researchers capriciously label \"inauthentic\" (i.e. non-Pauline) such canonical books as the pastoral letters, Ephesians and Colossians or dismember the Pentateuch with variations on Wellhausen's scheme.At the heart of this endeavor, lies a \"faith in theology,\" a \"fundamental presupposition\" which dictates all that follows: \"that the final authority regarding what is true is the trained, professionally informed, regimented critical intellect. That is, holy Scripture is subordinated to reason\" (p. 107). Such a presupposition clearly leaves God the Holy Spirit, both as inspirer and interpreter of the text, out of the inquiry. So it's time we call it what it is: \"Historical-critical theology is heresy\" (p. 124). Though usually guarded and gracious regarding individuals, lamenting rather than lambasting their errors, Linnemann leaves no doubt that she considers her former mentor, Rudolph Bultmann, utterly heretical!What Linnemann urges is a \"theology of faith\" rather than a \"faith in theology.\" Only when we're surrendered to the Word of God, open to its truth, submissive to its instructions, can we rightly read it. Consequently, \"Questions are solved on one's knees, not through ransacking commentaries\" (p. 112). Certainly it helps to study carefully, to master the original languages, etc. but a \"theologian does not, by virtue of his academic study, occupy the judge's bench. God does\" (p. 113).For her, Scripture is verbally (though not mechanically) inspired, inerrant \"not only in the area of faith and life but also in all other areas\" (p. 147). How interesting to find a onetime \"higher critic\" ending up a virtual Fundamentalist!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Etta is a brilliant scholar, but she writes so the average reader can understand her point. Will we be 'God-centered' putting our total trust in God's Word or will we be 'Man-centered' trusting the methodological method that trusts induction? She makes a strong statement that the Church must be 'God-centered', putting its faith in the revealed Word of God not the reasoning of limited man.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "nine oclock in the morning",
        "description": "Experiences of an Episcopal minister in the charismatic movement.",
        "authors": "['Dennis J. Bennett']",
        "infoLink": "https://play.google.com/store/books/details?id=RiqRFdcJULQC&source=gbs_api",
        "review": [
            {
                "review/text": "When I first read this book several years ago, I was very skeptical about the gift of tongues and other physical manifestations of the presence of the Holy Spirit. This book taught me so much and answered so many questions I had about the Holy Spirit and his importance in a deeper relationship with God the Father and God the Son. I am most grateful for Dennis Bennett's ministry and the willingness he had to share it with us through his wonderful book.",
                "review/helpfulness": "38/38",
                "num_reviews": 38
            },
            {
                "review/text": "Dennis Bennett was a logical, rational man and a respected priest in the Episcopal Church. In the 1960's he met the third person of the Trinity, the Holy Spirit, and the encounter changed his life. This book helped change mine. Do you want a deeper relationship with God the Father, and Jesus Christ, his Son? Read this book. Ask the questions Bennett did. Let God have all of you.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "This book was handed to me, by someone in the prayer group that I was a part of at that time. I think everyone who has serious questions about the full gospel, or charismatic christian experience, should read this book, because this is one informed believer that didn't get into extremes after receiving \"it\"-namely, the operation of one or several of the manifestations, or gifts of the Holy Sprit.I have only one cavet about this book. Please understand-the author of this book is A PASTOR. Full gospel believers who are Bible informed, know that a pastor in the christian faith, is an office of our faith-and must be called by, and empowered by-God. You can't twist his arm-he gives to whoever, and however he chooses to.Dennis saw many manifestations of the Holy Spirit in his life, because he was in the office of a pastor. After reading this book, I was somewhat disappointed that I did not see some the same manifestations in my life, especially that of seeing others healed.God DID choose to let me have a taste, in ministering to a lady, who I had ministered to for 3 years. She wasn't growing, and wasn't attending church regularly, and I felt that I had done all I could do for her if God didn't majorally intervene. I saw her touched as a result of my laying hands on her. So God did let me see it operate in the life of someone not called into the full time ministry.I will tell you that I did receive the manifestation of devotional tongues. But I will also tell you, that if you are struggling with surreder to God on several issues at the time that you do receive, you will prob not majorally benefit fromthis priviledge until you surrender ongoing, known sin.Please do not judge your spirituality by what God did in this author's life. Let me say-God wants to move through whosoever will-but he does it his way, not yours, and in his time-not yours.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "FOR ALL THOSE WHO HAVE WONDERED WHAT FAITH IS ALL ABOUT, THIS BOOK IS A MUST. IN CLEAR, EVERYDAY LANGUAGE IT TELLS WHAT AN ELECTRICAL, AWE INSPIRING EXPERIENCE IT IS TO MEET THE HOLY SPIRIT, FACE TO FACE. YOU GO FORTH WITH A FRESH UNDERSTANDING OF GOD THE FATHER, GOD THE SON AND GOD THE HOLY SPIRIT. I READ IT WHEN IT WAS FIRST PUBLISHED AND HAVEN'T LOOKED AT LIFE THE SAME WAY SINCE.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "I met Dennis Bennett at a week long charismatic conference in San Jose, CA back in 1974. Although an ordained Episcopal priest, I had searched the New Testament back in 1972 and had determined that God intended a \"Pentecostal\" event for ALL Christians as a part of HIS definition of the \"good news\" of the gospel. At the end of that year, after three months of receiving prayer and the laying on of hands, God filled me with His Holy Spirit (after doing some serious \"plowing\" of my scholarly pride, my unforgiving attitudes and sins that for which I had not yet entered into what HE defined as repentance). I continued to be skeptical -- and still do -- of the reality of many Pentecostal claims, since I find them so ready to numerous numerous commands of Jesus and the apostles. But I found Dennis Bennett's story very believable. And when I met the man I was deeply impressed with his gentleness, good will and thoughtfulness. He was a VERY believable person, and I hope you will find his story to be believable enough for you to search the New Testament for yourself.Sincerely,Reed Merino[...]",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an excellent book for those who are seeking a closer relationship with God through the Holy Spirit",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A true and excellent book by Episcopal priest, Father Dennis Bennett, relating his own experience(s) regarding the outpouring of the Holy Spirit in the 1960s and beyond. A truly authentic, accurate and wonderful book which inspires, comforts and informs the reader about the Third Person of the Trinity. I recommend it to all.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Dennis Bennett's account of his Christian walk with the Holy Spirit is a timeless inspirational classic on the charisma that God gives through the Holy Spirit. This book gives the story of Bennett, an Episcopal priest, learning about the \"baptism of the Holy Spirit\" and experiencing it for himself in the mid-60's. His life and ministry are radically transformed by the overwhelming presence of God's Spirit and the gift of praying in tongues.Bennett tells the story of his own tranformation and people's reaction to his new experience. His ministry changes and blossoms, as he begins to experience and witness God's power. He sees his congregations transformed, and some people reject this move of God and become embittered.This is a story of the Pentecostal fire of the Holy Spirit spreading through his church. It makes me hungry for a contemporary movement of God's Spirit as Bennett and those around him experienced.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I read Nine O'Clock in the Morning years ago and it changed my life, now all these years later I needed to reread it and was so glad it was still in print...this book was the beging of my desire for more of Holy Spirit I loaded it to a friend and it touched her heart soooooo much.. the anointing is still on this book..",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was foundational in introducing me to the Holy Spirit as a witness for Jesus. It describes that \"Charismatic\" experience of a long time Episcopalian priest. As there are as many opinions about religion as there are about politics, I simply say, \"If you are looking for more in Christianity; especially if you were brought up Catholic or Anglican, then I recommend it.\"",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the silence of god",
        "description": "Where is God today? How can he allow evil and suffering in the world? Have miracles ceased? Sir Robert Anderson, one of the most popular lay preachers at the turn of the 20th century, devoutly believed that the Bible was the inerrant word of God, and in this classic of Christian apologetics, first published in 1907, he attempts to answer these conundrums for the faithful through appeal to Scripture. Seekers after spiritual succor will find comfort in Anderson's arguments, while anyone interested in the rise of fundamentalist Christianity in the 21st century will find a fascinating illustration of the movement's beliefs. While at Scotland Yard, Irish police official and religious scholar SIR ROBERT ANDERSON (1841-1918) helped investigate the Jack the Ripper murders, but he is best remembered for his works of Bible study, including Forgotten Truths, Daniel in the Critics' Den, and The Coming Prince.",
        "authors": "['Robert Anderson']",
        "infoLink": "https://play.google.com/store/books/details?id=rq6vqzdOwFwC&source=gbs_api",
        "review": [
            {
                "review/text": "I would strongly recommend this book for anyone who is interested in finding a Biblical approach to miracles and understanding how God operates. The only &quot;problem&quot; with the book is that it makes you think, which tends to slow down your rate of reading. However, it's worth it to read a book founded on Scripture which gives a great understanding into who God is and how the grace of Jesus Christ makes a difference for us now. If you like this book, you must check out everything else he has written.",
                "review/helpfulness": "35/37",
                "num_reviews": 37
            },
            {
                "review/text": "When I first read this book it helped clear up a good deal of confusion I had concerning God's current dealings with men today, and why we live under a silent Heaven.This book is very relevant today in view of all the terrible violence around the world, and will help believers young and old with such questions as \"Why does God allow suffering?\" and \"What has happened to miraculous interventions?\"The chapter on Satan is especially informative.I strongly recommend this book.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "Sir Anderson does not mince words, and beware, his literary conventions are well beyond new-millenial standards. Have a dictionary handy. You'll need to ponder his words carefully, but it is well worth it. Anderson gives a thorough treatise on the subject, shedding light where it is absent on a phenomenon that few are capable of answering. Why is God so quiet? I'm sure you have wondered, and if like most, eventually shrugged it off. Yet, Anderson squarely addresses the ramifications of that attitude, and the result is to restore faith where it wanes. Thus, a superb book, and one that is perhaps more appropriate nearly a century after it was penned than in the day it was.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Sir Robert Anderson has answered the bothersome question, \"why does a loving God do nothing when children are being murdered and innocent people are being destroyed?\"The short answer to the question is, Jesus came the first time as our kinsman redeemer to save us, and bring us into a period of grace. When He comes again, it will be as the avenger of blood. His silence of the present time gives us the opportunity to repent and accept the gift of His salvation. When God does act, then Armageddon will ensue and Judgment (no more chances).Anderson's work cuts through the misconceptions taught by many Christian religions by going directly to the Bible. His study of the Bible is a great help to our own discoveries inside the Word of God.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This was a great book. Sir Robert Anderson disagrees with a couple of the more widespread views in modern Christianity such as the role of Satan in everyday life. I thought he laid out his arguments well. I found myself wanting to study my Bible more and clarify my own views better after reading this book; anything that drives us back into the Word is helpful in my opinion.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Apart from the Bible, Anderson's book provides hard to find information one needs to have on how to discern why God is silent . . . and how to find the \"right\" church.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the believers authority",
        "description": "As a young preacher, Rev. Kenneth E. Hagin asked himself this question. He studied the subject and concluded the following: \"We as a Church have authority on the earth that we've never yet realized... A few of us have barely gotten to the edge of that authority, but before Jesus comes again, there's going to be a whole company of believers who will rise up with the authority that is theirs. They will know what is theirs, and they will do the work that God intended they should do.\" During the past 30 years, over a million readers have been blessed by this classic faith-building message by Rev. Hagin. In his clear and illustrative style, he uses the Word of God to explain the authority that belongs to every believer. Book jacket.",
        "authors": "['Kenneth E. Hagin']",
        "infoLink": "http://books.google.com/books?id=utUOAAAACAAJ&dq=The+Believer%27s+Authority&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Believer's Authority will change the way the believer appraches prayer, life and God.\"The trouble is that we've preached a \"cross\" religion and we need to preach a \"throne\" religion\".\" (Page 16) There is power after redemption - a life worthy of our inheritance from the king and access to the throne of God for all who would believe.Through an insightful examination of Ephesians, the believer comes into understanding of his \"inheritance\" from God and authority, through Christ, over a defeated enemy; his attacks, weapons,and strategies. Through access to the throne, the Christian believer has an inheritance in this world and the next, from the treasury of Christ Jesus. An inheritance of peace, joy, strength, health, power, provision, love and much more. Hagin encourages the believer to \"enter in\" and receive all the fullness of God.There is power in the tongue - even life and death. And the spoken word from the mouth of the Christian is powerful and pursuasive. Power to bless, to heal, and to overcome the evil one in the name of Jesus.Throughout this interesting and powerful book, I was reminded of the teachings of Smith Wigglesworth and felt agreement in my sprit, as well. Thank God for this timely book and the teachings of brother Hagin.",
                "review/helpfulness": "55/55",
                "num_reviews": 55
            },
            {
                "review/text": "The author explains that not only do we as Christians have authority, most of us do not know about it or even how to use it. Once we are aware of this authority, we will be able to do the work God has called us to do.This is book consists of only 70 pages but each page is packed with power and scripture.",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "Superb Biblical teaching in this book. For any Christian struggling with freedom from strongholds, I highly recommend this book or the CDs. After listening to the CDs, my life has forever changed. Hagin's teachings led me to understand that I am already free Luke 10:19, Colossians 1:13. Whom the Son sets free is free indeed. I thank the Father, Son, and the Holy Spirit.Luke 10:19-20Behold, I give you the authority to trample on serpents and scorpions, and over all the power of the enemy, and nothing shall by any means hurt you.Colossians 1:13He has delivered us from the power of darkness and conveyed us into the kingdom of the Son of His love",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "In my opinion, 5 stars go to the simple and powerful message of the book, \"The Believers Authority\".And no... Neither Kenneth Hagin, nor Rev. MacMillan was original with that message... Don't tell anybody, but it was borrowed from the Bible.I have been in ministry for 30+ years and met more men and women of God who credit this book for a major and positive change in their lives --- more than any other book (other than the Bible).Whether you are Baptist, Methodist, Pentecostal --- or 'Bapticostal' --- it's good to know how to stand strong and take your authority in Christ. God has used this little publication in a marvelous way to teach believers how to run the devil off God's property. It's therefore not difficult to know the source of some of the attacks on the book and its author.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "If you're reading this out of curiosity concerning &quot;The Believer's Authority&quot; or Brother Hagin's ministry, let me recommend both of them to you. As a young pastor, this book, as well as the ministry of Brother Hagin has greatly impacted my life and ministry. In a very simple, easy to follow manner, Brother Hagin explains what authority is and how a Christian can live above the mess that the world and the devil has to offer. I recommend it highly!",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book is the 1984 revised edition of the book that was originally written in 1967. In the Preface, Kenneth Hagin Jr. wrote that \"Dad has gained even more light on the subject of spiritual authority. He often said he wished this book could contain these insight.\" Hence, this is the expanded version which I think is a great book from the Word of Faith movement. I believe that what begin as the Word of Faith movement has gained maturity and balance. In fact, Hagin writes, \"It's easy to get into the ditch on either side of the road - the excess, wild fire, and fanaticism. Let's go down the middle of the road and maintain balance.\" (pg. 18)I recommend this book to you, and just as I have been blessed, so will you. As Hagin wrote about the spiritual authority of the believer, I would like to add in his quotation of James 4:17 the first part which was not quoted, i.e. Submit to God. Hagin quotes, \"resist the devil, and he will flee from you.\" I believe that spiritual authority comes from a heart submitted to God and living a life of obedience to Him. Also, a man with authority is a man under authority. In the reading of the book, you can imply these truths from what was written.I have thoroughly enjoyed re-reading this book after many years, and have found it refreshing and ministering. The following are the chapter titles of the book.1. The Prayers of Paul2. What Is Authority?3. Seated With Christ4. Breaking the Power of the Devil5. Exercising Authority6. Risen With Christ7. The Weapons of OUr Warfare8. Authority Over Demon Spirits, Not Human Wills",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "In order to stand your ground against the spirits of darkness (demons) one must know who they are in Christ, and that as a Believer you have the spiritual weapontry to do so. But if you do not know this, then you will be a defeated foe.This book set me free way back in 1985 when a Pastor told me about it. I got it read it and started taking back what the devil had stolen from me.This a must for all Christians to have in their Faith Library. Hagin is down to earth in his teachings of the authority of the believer, and he tells it like it is.GET THIS BOOK!!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Whether John Macmillan, E.W. Kenyon or whoever wrote this type of a book first is irrelevant. The point is that this book points out who the born again Christian is in Christ Jesus and that Satan is defeated and powerless against us. Moreover, once we realize this we will be able to live a life of victory. I loved this book. It was one of the best I've ever read, however if you want a book more to the point then read The Wonderful name of Jesus by Kenyon. He's a little more descriptive and doesn't need to tell a bunch of stories to get his point across. But don't get me wrong...the Believers Authority is a life changer if you give it a chance. God Bless!",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Awesome read..I highly recommend this book to any new Christian who struggles in any area of life....this book explains the believer's authority in this world as the authority God gave us when he created man.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Dad Hagin teaches in a simple easy to read manner what every Christian should concerning their Authority given to them in Christ. Based out of Ephesians this book will give insight into our position of righteousness.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "seeking him experiencing the joy of personal revival",
        "description": "OVER 400,000 COPIES SOLD! Revival isn't just an emotional experience. It's a complete transformation. It can happen in your heart, in your home, in your church, and in your world. Restore your first love. Develop a heartfelt desire for God's Word. Resolve conflicts. Repair relationships. Remove bitterness, fear, and worry. Refresh your spirit. Renew your mind. Reenergize your life. You can't get back your passion and zeal for the Lord. Begin by Seeking Him! \"Seeking Him was transformative for me. ... It brought me nearer to the Father and helped me learn how to seek Him with joy. I totally believe it can do the same for everybody else.\" Jackie Hill Perry, Author, speaker, artist \"Every pastor's dream. Finally! A guide to assist every member in personal revival and every church in corporate revival.\" Tony Evans, Oak Cliff Bible Fellowship \"An intimate and insightful guide to holy living, a heaven-blessed soul, and a happy heart that can't help but to be on fire for the Lord Jesus!\" Joni Earackson Tada, Joni and Friends",
        "authors": "['Nancy DeMoss Wolgemuth', 'Tim Grissom']",
        "infoLink": "https://play.google.com/store/books/details?id=Xy-JDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Don't bother with this study unless you're willing to be truly honest with yourself and with God. But if you're ready to take a good hard look in the mirror and allow God to search your heart, this is a wonderful tool for personal revival. The study is thoroughly rooted in scripture and broken into very manageable daily segments over the course of the 12 weeks.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "This is such a wonderful book if you feel you have drifted away from the Lord, or if you feel that you would like to go deeper with Him. I drifted away from the Lord for about a year and got myself involved in all kinds of sinful things. \"Out of the blue\" one day I received a free sample chapter of this book in the mail. Tired of living the way I was and experiencing the consequences of my disobedience, I opened my heart back up to God and worked the chapter. I soon bought the book and it really helped me to \"re-bond\" with my Father and I'm so grateful. This book is full of conviction (with hope) and godly wisdom. There are lots of personal stories in there, so you won't feel like you're the only one who has stumbled in your walk. There are also a lot of questions to help you do some prayerful soul-searching and personal application. This book is certainly not just for men, or women. It can easily be used by both. Be blessed!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "then this is your book. It's a wookbook designed to find road blocks to having the spiritual life you want. Even though I worked it in a group, I think it would work equally well as a solitary study.I must warn you, it will make you look at yourself with unvarnished honesty. Some of the excerises will make you squirm! However, if you have the guts and honesty to face yourself, it will help you find your way back.B. Story",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I thank God for introducing me to such a study. It is such an awesome, honest and reflective study of the Word and Heart of God for His people. The study is geared toward women but is also excellent for men who are seeking to have a closer walk with the Lord. God wants a revival of our churches which begins with a revival of each individual. We selected this for our women's study group. This material helps one to take an honest look on the inside to discover what is keeping us from Seeking Him. This is best taught with the video that can be purchased with it.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This study is written to help the reader recognize their need for a closer intimacy with God. I've only read and completed the first week in the lesson, but it penetrates the heart and reveals areas of sin and weakness, leading the reader to depend upon the Lord in every area of life. It is an excellent study for friends who want to draw nearer to God, experience accountablity to and with each other, forgiveness for others and self and all together know and live their own personal revival as God changes their hearts by His Spirit's work.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have done several Bible studies and this was one of the hardest, most depressing, joyless one I've ever done. Very little diving into scripture, emphasis on corporate confession was discussed in several of the lessons, lots of lists to see what you may or may not be doing as a follower of Christ (which are incredibly impossible to do), and the faith builder lessons are stories about people understanding their need to confess something after having a revival at their church. Yes it is important to address the issues of sin and to confess them to God and others you've wronged, but only God can cleanse you through Jesus Christ. There is alot of guilt and condemnation after completing pages of lists. It is difficult to look at ourselves and to see areas in which we need to admit and confess sin to God, but we did not touch on the gift of Grace and forgiveness of sins through Jesus Christ and His work on the Cross and His resurrection. All the stories seem to end up hunky dorey and were pretty unbelieveable. Each week our small groups discussed how the material was presented and we had to infer what the author was trying to say. There were many questions and comments that were truly misleading. I don't doubt that the author's intent was to help, but this study could damage people and relationships if not guided by Christian counselors and Pastors. To tell someone who may have been physically hurt or sexually abused to ask the offender to forgive you for for responding incorrectly was a little bit out there. I still have 2 lessons to go so maybe it'll change? I just keep coming back to the point that it is my confession to Jesus Christ that washes me clean, that it is God working in me that changes me - not Christ plus me... but Christ alone that reconciles me to a God that loves me beyond my wildest dreams. This study depressed me and did not create a revival at all in me. My husband asked me to please quit taking it as it was not healthy for me or for our marriage. I know this study received high ratings, but I don't understand why. Ugh! It was based on a 12 step program and not focused on the grace and mercy of God through Jesus Christ. I hated it and quit nit.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I used this study in a Sunday School class. It is absolutely solid and, if followed as written, will draw you to the bedrock issues of genuine personal revival. Nothing in the book indicates an orientation toward women. I would recommend doing it in a small group setting instead of Sunday School to allow for full discussion (90 minutes/lesson is suggested by the book). Some sort of accountability to ensure that you don't glide over uncomfortable questions would also be wise. The companion DVD is not necessary but could enhance. Overall: Outstanding!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Seeking Him was purchased for a ladies only home Bible study group. There are 15 members, all of whom are believers in Christ, but of various ages and levels of spiritual maturity. We prepare the lesson ahead of time at home during the week, then discuss each question as a group. It will take us longer to complete the study, but speed is not the object. A closer walk with Jesus is the goal for each of us. Seeking Him provides an excellent, thought provoking study that is guiding us into serious reflection and soul searching. All 15 of us would highly recommend this study for other groups!!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an incredible Bible Study on personal revival. Over 70 women in our church are involved in this study. If you want lasting lifechange, this study is for you. This study is heart surgery.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am only into the second week, but this bible study is one that hits home. It is easy to read and get into. We (a group of teachers)are doing this study before school and it sets the tempo for the rest of the day. All of us are benefiting, thus far, and developing a closer walk with our unfathomable God. I would recommend it to anyone who wants an \"attitude chech\" with God.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "from faith to faith",
        "description": "Now you can have a word of encouragement...a word of inspiration... a word of faith...every day of the year! Written by Kenneth and Gloria Copeland, From Faith to Faith daily devotional deals with real living. From their own experience, the Copelands know the fight of faith isn't won overnight. It's won little by little in the practical territory of everyday life. From Faith to Faith talks about the struggles you face every day...struggles with weariness, irritation, children, finances, even overeating. Kenneth and Gloria show you how, by applying the Word of God, you can make major changes for victory in every area of your life. Just think...breakfast, your Bible, and a big word of encouragement and faith from Kenneth and Gloria Copeland every day of the year. You will grow From Faith to Faith.",
        "authors": "['Kenneth Copeland', 'Gloria Copeland']",
        "infoLink": "https://play.google.com/store/books/details?id=xvucDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "this book has been a tool that helped guide me thru life with my daily struggles and decisions. it is a good mental reference for me because everything in this book is so positive and on point. it gave me knowledge and wisdom that i could understand and incorperate into my daily life because its seems so real and todate. i read this book years ago and bought it for a friend, just like someone did me, and the person always tells me that they see a bit of me in every page of the book. its amazing how a daily reading tool could not only stick with you but rub off on to others. i offer this book to anyone who is searching for all the good things that influential words can bring. i promise you it wont be a waste.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is a progressive study that will teach you daily how to walk in the victory that was provided by our Savior and Lord, Jesus Christ. Kenneth and Gloria Copland challenge you to build your faith daily by becoming a doer of God's Word not merely a hearer.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "What an excellent devotional! The best of many I have read because it is scripturally sound, based on truth, dares you to challenge and increase your faith and it's brief enough to easily handle daily.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book so much that I have purchased it for many of my friends. I read this book faithfully, and it is my favorite daily devotional!! Faith to Faith will inspire you!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I cannot recommend this more strongly. I read this Devotional everyday and it is the most uplifting thing you can do first thing in the morning.It starts out with a scripture. Then Gloria or Kenneth expand on that scripture with faith, power and authority. It then gives you further bible reading for the day.The Copeland's are real Faith preachers! It is all WORD, WORD, WORD!If you are hungry for some spiritual meat, you can get it right here!I love the Copeland's. God bless them!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I've read through the entire book twice now and have only one problem with it: I have to keep purchasing new copies because I always seem to find someone to give my current copy to -- leaving me with nothing to read! All kidding aside, its a great foundational study broken down into realisitic bite size pieces for daily reading. The lessons are totally scripture based and are written in such a way that you'll find it easy to apply them to your life.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Every morning I read it along with my Bible, then I speak in tongues and am set to go Spirit filled with fire in my bones, ready to preach the Gospel to anyone... This is really a good devotional especially for those who want to acquire and strenthen your faith. The Copelands came and preached at my Church and they really are great teachers of the Bible and NOT religion or traditions of man. Great book!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "From Faith to Faith has really helped me in my Daily relationship with God. I have grown spiritually and would recommend this book highly. Kenneth and Gloria talks from the heart in this book and it is refreshing to know that some spiritual people have problem like average families. However, knowing how to overcome every situation and walking on a daily basis in the blessing of God is wonderful. May God continue to bless and prosper you Ken and Gloria. Your in Christ - Ozie Adams",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book has got me started on the Word of God, which I have been struggling for years. The revelation truths that accompanied the Word have been inspiring, giving so much help to the study of the Word, and making it so easy to understand the truth of the Word. The application of the Word to everyday living is powerfully life changing. Thank you brother Kenneth and sister Gloria for such a wonderful gifts of God to us. May the Lord bless you and your family richly as you continue to be a blessings to all. P.S. I have been waiting for months now to buy a few more books to bless my Christian friends this Xmas.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Look no further! This devotional is fantastic! It's not just another &quot;feel good&quot; ear-tickler--it presents powerful application of God's Word that will benefit any Christian in their walk with God. I get encouraged, rebuked, exhorted, and strengthened; I laugh and I cry; old revelation is reaffirmed and I receive new insights. One year is not enough to get all that is to be gotten out of this anointed, super-charged hunk of paper",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "destined for salvation gods promise to save everyone",
        "description": "God will-not abandon-lost people, in this life or the next, but will continue to work for the conversion and transformation until every one is saved. This view was widely held by early Christians, and is supported by many passages of Scripture and by the contention that God is more patient, loving and forgiving than human parents who would never punish their own children without end. This is important because the teaching of a God of eternal damnation causes many people to reject God and consequently experience hell. On the other hand, the message of an unconditionally loving, forgiving and saving God leads many previously disillusioned people to cheerfully embrace God. Also, people's perception of God determines how they live their lives. If they believe God is judgmental, vengeful, and unforgiving they can easily justify acting that way themselves. But if they believe God is loving, kind, patient and forgiving, people are more likely to act that way themselves.",
        "authors": "['Kalen K. Fristad']",
        "infoLink": "http://books.google.nl/books?id=3LuzAAAACAAJ&dq=Destined+for+Salvation:+God%27s+Promise+to+Save+Everyone&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "DESTINED FOR SALVATION: God's Promise to Save Everyoneby Rev. Kalen FristadRev. Fristad is a dedicated Universalist who writes about Christian Universalism in a logical and loving fashion. The strength of his book comes from his twenty-seven years' experience as a United Methodist minister in communicating to parishioners rather than to academics. He feels so intensely about the need to spread the Good News of Universal Salvation to everyone that, in the tradition of St. Paul and John Murray, he has been traveling around the country in a mobile home speaking to groups from various denominations. When he was recently in Houston, I had the privilege of hearing him speak and conversing with him.Interestingly, he begins his book by presenting the scriptures that are commonly sited as raising questions about Universal Salvation. After dealing with these questions, he moves on to a sampling of major verses supporting Universal Salvation. Additional Universalist proof-texts are scattered throughout. Next, he deals with Judgment and the fact that all punishment is \"to make the wrong-doer a right-doer\". Rev. Fristad sites Biblical verses stating that God's love is eternal and that God does not give up on us, even in Hell. He notes that after Jesus' crucifixion, Jesus went to Hell to bring out \"all the people who in former times did not obey\" (I Peter 3:18-20, 4:6). He adds that modern-day near-death experiencers report that such rescues are still occurring. Rev. Fristad says that God is more gracious than the best of we human parents and that God is always waiting for us to come home --- not only Here but in the Hereafter. Rev. Fristad uses M. Scott Peck's developmental theory of four stages of spiritual growth to illustrate how humans at different stages of development view God. He notes that people at Stage II (formal/institutional level) are the ones most likely to oppose Universalism. Those who oppose Universalism are sometimes doing so because of the theological lens through which they view Biblical verses, but more often their opposition is based on wanting to be in God's exclusive club. (This problem is as old as Jesus' disciples jockeying for position in the Kingdom of God.) Next, the history of Universalism is presented from the 2nd Century to the present. The final chapter deals with how the traditional message of Christian exclusivity alienates people from God. The book ends with an Appendix on how to spread the word of Universal Salvation.This easily readable and well-organized book is a \"must\" for any Universalist and a source of comfort for all traditional Christians who have agonized over the fate of their non-Christian loved ones.This article originally appeared in the UNIVERSALIST HERALD, May/June, Vol.156, No.3.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "If you buy and read this book, I think it just may shift your thinking a bit. It is a wonderful book that presents God as very loving, and concerned about each and every one of us. It is easy to read plus Biblically based. I thoroughly enjoyed it and recommend it to all, particularly to those who are tired of hearing God presented as a damning God, fire and brimstone. This is a much more reasonable understanding of, who I think, God is.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "Destined For Salvation is a well written, thoughtful, convincing book about Christian Universalism, the belief that God will eventually save all people through Jesus Christ. There are many books available on this subject, but Kalen Fristad's is one of the best because it is easy to read and suitable for a general Christian audience.Fristad does more than simply quote verses from the Bible that support universal salvation. He explains how the key themes of scripture point toward a universalist interpretation of the Gospel, and he is fair in recognizing that not all Bible verses seem to support universalism. He also discusses the many negative effects of belief in eternal damnation and argues that belief in universal salvation has a positive effect on the way we live and treat each other.One of the best ideas in this book is that salvation is about spiritual growth, an eternal process of growing into God's likeness, not just one moment of going down to the altar and professing a religious doctrine about Jesus. Another book that I highly recommend which more fully develops this theme is Christian Universalism by Eric Stetson.I would give Destined For Salvation to anyone as an introduction to the Christian teaching of universal salvation. Definitely one of the top books about Christian Universalism!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Destined For Salvation is like a cup of cold water on a hot day for those of us thirsty to understand Christian Universalism. Rev. Fristad's book is easy to read, and includes many modern day references to helpful insights, particularly how the co-dependency of the traditional church perpetuates the doctrine of eternal hell. Many who have quietly believed in their hearts that Jesus is the Savior of all people will find great comfort in the pages of this book. I recommend it highly to anyone seeking a closer walk with Christ that affirms the worth and dignity of all God's children.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "A well written book. Makes a good case for the unconditional love of God. I have a few other books to read on this topic yet, but this is definitely on my list to give to others.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "humility the beauty of holiness",
        "description": "\"It is a most valuable book, inasmuch as it brings many of the choicest gems from the works of this eighteenth century teacher of holiness within the compass of a handy volume.\"-Record.Despite being written in the nineteenth century, this little book on the topic of humility remains a treasure for Christians today. If you truly want to know how to be a humble Christian-and discover the beauty of holiness-you will be sure to read this work from Andrew Murray.",
        "authors": "['Andrew Murray']",
        "infoLink": "http://books.google.com/books?id=_UaLDAEACAAJ&dq=Humility:+The+beauty+of+holiness&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a must read for every Christian. I have never read a book which so accurately defines Biblical humility. Murray shows how humility is a mindset and lifestyle, not a feeling. Humility is the one-word definition of every Christian's life--or it should be. Humility is the one-word description of all Christ was and is and of how He lived as our example to follow. The most amazing truth in this book is that which speaks of humility being a quality not resulting from sin, but from grace (God working within the believer). Jesus was perfect in humility, yet He never sinned. Humility was required on the part of the Son of God in Heaven before He ever became incarnate, so humility is a heavenly, Godlike quality. We need not sin to be humble; we need to be like Jesus as found in Mark 10:45 to be humble. In other words, for a Christian to be perfectly humble, he/she must be the greatest servant, not the greatest sinner. And if one could be totally sinless in this life, he/she would be perfectly humble. This book is too short, too low in cost, and too easy to read (though challenging in virtually every sentence) for any Christian to have an excuse not to read it.",
                "review/helpfulness": "106/108",
                "num_reviews": 108
            },
            {
                "review/text": "This book delivers way more than one would expect. Let me explain that. First of all it is not that long of a book. But for many people it takes a long time to read because the points he makes on every page are so convicting. Also, it is written by a South African pastor in the 1800's, and has a woodenness to the English that slows you down. This gives the topic a KJV feel to it in some places. Some people don't like that, but I found it enhanced the whole experience of reading this powerful little book. I asked a man in a church about 30 years ago why he was so short and his son was so tall (his son was well over 6'4\" and he was 5'5\"). He said something to me that I never forgot. He said, 'dynamite comes in small packages' so don't ever underestimate a small person. That's exactly how this book it. There is spiritual dynamite on the pages and so don't underestimate the transformational power in this little paperback (or hardback).It leveled me to the ground about 12 years ago. It is still at the top of my list.As a pastor, I have recommended this book to many, many people. It usually changes their lives. The fruit tends to be enduring and deep.I think this book should be read by every Christian. If you don't have a copy, buy an extra one so that you can have a loaner.",
                "review/helpfulness": "69/73",
                "num_reviews": 73
            },
            {
                "review/text": "This is a timeless piece. I own an original and this one that has some minor change to the text. (This just makes for a little easier reading and does not alter the message.) This will speak volumes to any Chirstian wanting to understand the posture we assume when we are meeting God. This has become one of my reference books that aids in Scripture study.",
                "review/helpfulness": "35/39",
                "num_reviews": 39
            },
            {
                "review/text": "Anddrew Murray writes with the simplicity and love of a pastor, without soft-soaping or sugar-coating the truth. His abandonment and love for Christ is evident in all of his works and, therefore, qualifies him, in my opinion, to write a book on humility. You can tell he has experienced humility and that it is not just an intellectual excercise.The one thing I took away from this book is that humility is indeed an experience; you can hear about the need to be humble, read, and even study about it. But unless the Spirit makes humility real personally to the individual, it is possible to become haughty about the need for being humble.Andrew Murray's works have added so much to my Christian life; I feel closer to G-d because of the things he has written.",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "Humility is a book that belongs on the desk (not just the bookshelf) of every Christian leader. It is a small book-- only a little over 100 pages-- and it was a quick and easy read, as far as reading words goes. Digesting the book and, more importantly, living out the book, will require much more time, diligence, and intentionality. I read the Bethany House version with updated language which probably made the reading process a bit smoother.It is packed full of Scripture, quotes from the Church Fathers, and challenges to a life that will require every ounce of our attention, prayer, and devotion.Murray begins with a examination of humility as exemplified and taught in the life of Christ. He then continues to look at humility in the lives and teachings of the disciples. Finally, he shows how humility is practically linked to our faith, relationships, happiness, and even success in life. He examines some of the false views of humility and gives a Biblical-based definition of humility as \"the displacement of self by the enthronement of God. Where God is all, self is nothing.\" Simply, humility is \"being fully occupied with God.\"In the midst of a lot of self-help Christian writings, this book was refreshing and challenging. It helped me gain a new and more Biblical understanding of humility, and it moved me to do a lot of prayer and self-examination. I probably marked and underlined and commented more in this book than any other I have read. Humility should be read by every Christian leader, and it is a book that I will surely revisit often over the course of my life.Pastor C. J. Mahaney wrote a book by the same title, Humility, and I am currently reading it. I am curious to know how the topic is addressed over a century later.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "\"Humility\" is a profound work written in the late 19th century by a man who found organized religious bodies and those who led them both lacking the very virtue necessary to achieve a true spiritual connection with God. The root of all virtue is humility declares Andrew Murray. And we all lack it.We have, Murray asserts, no way to reduce our ego--our self-centeredness, our self-glorification--without first totally emptying our spirit before God. It is when we reduce the prideful, egoic self that exists within us--that occupies our spirit--that we gain the opportunity to experience God filling our spirit with the only ingredient that assures us that we can practice the presence of God in our daily interaction with others.Andrew Murray's \"Humility\" points out that to be humble before God is meaningless if we are not humble in our words, thoughts and actions toward others. Put God first, others second and yourself third. This takes faith in the goodness of God, and belief that it is in this goodness that others experience God's love.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "&quot;Humility&quot; is a simple yet profound work that has had life changining consequences for me. It has given me a clearer perspective of who God is and how I need to relate to Him and others. Andrew Murray is clearly legitamate in his life and a credible source of leadership in an area where to many are afraid to go, to a place of dependence on God and service to our fellow men. Don't miss this opportunity to be transformed.",
                "review/helpfulness": "15/19",
                "num_reviews": 19
            },
            {
                "review/text": "I am certain that Andrew Murray's books can be read with great benefit(and 'Humility' is one of his finest books)but some discernment is necessary because there are some erroneous views on sanctification in his writings.While there is a mystical element to the Christian life,I think Mr.Murray is overly mystical in some of his beliefs.Though some caution and discernment are needed when reading Murray the benefits far outweigh the dangers in my judgement.There is an undeniable devotion to God and many nuggets of spiritual treasure throughout what he has written on the important grace of humility.The authors definition is outstanding:\"Humility is the place of entire dependence on God\" and is the root of every virtue.Equally important is his observation that pride (the absence of or loss of humility)is the root of every sin and evil.Murray understood and emphasizes that as humility was a distinguishing feature of the Lord Jesus,so it should be of His followers.Babes in Christ are often ignorant of this but those who have walked with the Lord for a time should not be.Andrew Murray believed that a level of sanctification was possible(that from a Biblical standpoint)in this life is unattainable(though Christians should and must strive to be holy and blameless).He writes \"the new nature in its divine humility be revealed in power to take the place of the old\".The new nature and the principle of indwelling sin are something the believer will have struggles with(there will be constant warfare)until the day they die.The principle of indwelling sin(and the sruggles that Christians have with it)are never eradicated in this life,though Mr.Murray seemed to believe this was possible.That is why the Bible exhorts Christians 'to mortify the deeds of the flesh','to make no provision for sin'and to 'set their minds on the things above'(this is a part of the continual warfare that the saints are engaged in).The apostle Paul describes this struggle and warfare in Romans Chapter 7:19 'for the good that I would I do not:but the evil which I would not,that I do'.The apostle is here presenting (throughout chapter 7 of Romans)the battle that all Christians experience when they are seeking to live for God(they must deal with the principle of remaining sin,though sins enslaving power is broken at conversion its presence remains until death).When God's people trust in Him for strength to overcome they experience many victories but there are often failures(which under God's blessing will help to work humility in them).The author writes about submission to and dependence on the Father's wiil and on p.29 he makes this statement(speaking of Christ)\"God honoured his trust and did all for him\".Murray in exhorting Christians to do the same(entire self abnegation and absoulute submission to the Fathers will) and then the Father will do all for them.The author is correct that God's people should entirely submit to the Father(and there will frequently be times of wholehearted submission but this will be interrupted with times when self will prevails).When saints wholly submit to God it is not correct or Biblical to say God does everything for them but rather that they overcome sin and temptation through God's enabling power.I believe Mr.Murray embibed the unbiblical teaching of 'Let go and let God'.The Scritures clearly teach believers to 'Work out your own salvation with fear and trembling,for it is God which worketh in you both to will and to do His good pleasure'.God doesn't do it for you(fight sin and temptation)but when you rely on His strength and power He works in you to accomplish His will and enables you to do that which you could not in your own strength.Here is another quote to provide further evidence of the great value of this work \"It is the humility that brings a soul to be nothing before God,that also removes every hindrance to faith,and makes it only fear lest it should dishonour Him by not trusting Him wholly.\"Though Murray's thinking in some areas of sanctification is off ,this is still one of the best books on this Biblical grace and can be read with great profit to one's soul.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "What is true humility? Where did it have its beginning? Is humility necessary for me to have a relationship with God? How do I obtain humility? The answers to these questions along with their Biblical reference are given in this book. This book is to the point on the need for and how to have a servant heart. All of the writings of Andrew Murray are foundational to the Christian faith. The Christian way of life.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "If you really think about, Christ's primary attribute is humility. We think His primary attrbute is love. But how could Christ even have come to earth and loved us but for humility. This book opened my eyes to the fact, if this were such an attribute in Christ, I must allow Him to work it into me as well.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "no little people sixteen sermons for the twentieth century",
        "description": "Most Christians take an honest look at themselves and conclude that their limited talents, energy, and knowledge mean that they don't amount to much. Francis A. Schaeffer says that the biblical emphasis is quite different. With God there are no little people! This book contains sixteen sermons that explore the weakness and significance of humanity in relationship to the infinite and personal God. Each was preached by Schaeffer at L' Abri Fellowship in Switzerland to the community that gathered there to work, learn, and worship together. The focus of this collection is the lasting truth of the Bible, the faithfulness of God, the sufficiency of the work of Christ, and the reality of God's Spirit in history. The sermons represent a variety of styles-- some are topical, some expound Old Testament passages, and still others delve into New Testament texts. No Little People includes theological sermons and messages that focus specifically on daily life and Christian practice. Each sermon is a single unit, and all are valuable for family devotions or other group study and worship. Readers will be encouraged by the value that God places on each person made in His image.",
        "authors": "['Francis August Schaeffer']",
        "infoLink": "http://books.google.com/books?id=maQNAQAAMAAJ&dq=No+Little+People:+Sixteen+Sermons+for+the+Twentieth+Century&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is truly a good read. It is what I have personally come to expect from Francis Schaeffer. It is a bit disjointed, but that is because that is what it is intended to be (a collection of different sermons).It essentially hinges on the idea that with God \"there are no little people or little places\".I found it interesting, inspiring, and a worthwhile read.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Schaeffer never ceases to fail to bring God's word into our hearts. Through these sermons, given at the L'Abri chapel, and throughout Europe, and many other countries, are messages for the twentieth century----and now. With God, there are no little people.The focus: 1) Humbled leaders----where Schaffer says, \"if in any of our relationships of life we demand perfection or nothing, we will have nothing.\" 2) A personal God 3) Sweeping away modernism to find Gods truth----and he says here, \"the Christian must always say, 'I want the state and society to have its proper place. But if it tries to come into the center of my life, I am against it because Jesus only is there'.\" 4) Workings of the Holy Spirit 5) Humanism 6) Joseph 7) OT tabernacle 8) David----good and bad 9) Elijah/Elisha----great and minor prophet 10) Christ rescuing the three men from the furnace 11) The Christmas story 12) Jesus----centered on Him 13) Christ----the water of life 14) Revelation----in brief 15) The true God, and finally 16) Materialism----where is your treasure----where he discusses the traps that we Christians can fall into, what he calls \"practical materialism\": \"We all tend to live 'ash heap lives'; we spend most of our time and money for things that will end up in the city dump.\" And, \"Let me say with tears that as far as material possessions, time, energy, and talents are concerned, all too many Bible-believing Christians live as though their entire existence is limited to this side of the grave.\"to eat, to breatheto begetIs this all there isChance configuration of atom against atomof god against godI cannot believe it.Come, Christian Triune God who lives,Here am IShake the world again.F.A.S.Wish you wellScott",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "\"No Little People\" is one of the first Kindle freebies I got. I've had it for a while; almost two years. I finally got around to reading it.Many of the people who have influenced me were in turn influenced by Francis Schaeffer in a previous generation. Unfortunately, Christianity seems to externally manifest in the silly little displays (often verbal) of piety from it's members and adherents. This drives many others to frustration and often away from the church. It keeps people out.Francis Schaeffer seemed able to cut through all that get to the heart of the matter. He ministered to the generation of the 60's and 70's. Many in that generation credit Schaeffer with bringing them back to what really mattered about the faith. Schaeffer himself was almost driven away from Christianity when he realized how much meanness and infighting happened within his own denomination. What he witnessed in the actions of others contradicted the way the Bible says to act and to serve. As he says in his book \"True Spirituality\", he went back to his agnosticism and looked at the claims of the Bible through as much of an original lens as possible, unpolluted by his experiences as an ordained minister within a once-great denomination. \"True Spirituality\" details that journey of his. I'll review that book separately.The Premise of \"No Little People\" is \"With God, there are no little people!\" A statement from the Introduction (written by Udo W. Middelmann) says:\"While all religious and secular standards judge a person by his or her accomplishments toward the end of life, the God of the Bible gives value to the person from the beginning. Man not only becomes someone but is a person from conception on, forever. It matters who you are, not what you have produced, earned, or been noticed for. \" -Schaeffer, Francis A. (2003). No Little People (p. 8). Good News Publishers/Crossway Books. Kindle Edition.Thankfully, Amazon finally implemented a copy function in Kindle for PC.This book is a collection of 16 sermons Francis Schaeffer delivered. The back cover of the book indicates they can be used for family devotions.As Schaeffer was a minister, and this book is a collection of sermons, you can imagine they tend to go on for a while. This is a trend I notice with pastors and writing: they keep going with example after example long after the point was made. With Schaeffer I don't mind so much. He seems to have something to say to fill the space, but at times I felt like I got the point and the chapter just won't end.The first chapter begins with Moses' staff. That's right. Moses' staff. God used a piece of wood carried by a shepherd for years if not decades in the wilderness. This staff eventually budded in a test of who the true leader was. That's impressive considering this staff could have been more than 60 years old by that point.The book goes on exploring the lives and roles of other Bible participants, such as Joseph, David, Elijah and Elisha, and Daniel and his three friends. Then in Chapter 11, it becomes a review of the Christmas story, then (at least in my opinion) degenerates into the typical Christian book review of \"Jesus loves me, this I know, for the Bible tells me so\". Schaeffer doesn't treat this material like some pastors and Christian writers I've been exposed to, where after providing some meat, he suddenly assumes he's writing for somebody who has never heard the Gospel and for some reason picked up and read most of a Christian book, so why not go back to Pre-school Sunday School and review the basics? But still, I would have preferred less \"I already know this stuff\" and more \"Let's look at what we know in a new light\". I assume the latter is what Schaeffer was going for.I think this book could be a valuable read for many Christians.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the power of suffering strengthening your faith in the refiners fire macarthur study series",
        "description": "In today's modern world of convenience and comfort, suffering can seem senseless. This idea has even crept into the church, where many believe that if we make the right choices and do the right things, pain can be avoided. So it's little wonder that when do encounter tough situations, we face even tougher questions: Why does God allow suffering? Where is God when I'm hurting? The Power of Suffering takes an in-depth, honest look at the reality of pain and hurt in the life of a believer. Filled with rich Biblical truths and fresh insights, this study explores how God ultimately uses suffering for good in the lives of His children, and offers encouragement and hope for the heavy heart. Includes a guide for both personal and group study and features discovery questions, suggestions for prayer, and activities, all designed to connect life-changing truths with everyday living.",
        "authors": "['John MacArthur, Jr.']",
        "infoLink": "https://play.google.com/store/books/details?id=RXN4lkgikbwC&source=gbs_api",
        "review": [
            {
                "review/text": "There is no doubt that suffering is one of the hardest topics there are to think and talk about. It is a subject that makes us uncomfortable and many times we want to avoid it. In the Christian's life, however, this subject is one that should be seriously pondered upon. As witnesses of light to a darkened world it is important that we know what God has said in His Word about this subject. Many non-Christians (and some Christians) struggle with the question of why a loving and all-powerful God would \"allow\" suffering to occur on the earth and this is one reason why some people reject the Gospel. Christians should be knowledgeable about what the Bible says on this topic in order to proclaim God`s truth revealed to us in His Scripture and in order to be strong witnesses who are pleasing to Him. In addition, it is important that Christians know what God has said about suffering in His Word because He wants us to know about it: \"All Scripture is inspired by God and profitable for teaching, for reproof, for correction, for training in righteousness; that the man of God may be adequate, equipped for every good work.\"--2 Timothy 3:16-17. Not knowing what He has revealed to us in Scripture about this topic is crippling to a Christian's faith and leaves us unprepared for trials, persecutions and sufferings.This book is wonderful and challenging. At the beginning of the book, MacArthur writes about how suffering is in the plan of God (Isaiah 45:7, see also Deuteronomy 32:39, 1 Samuel 2: 6-8 ) and he provides several reasons why He sends trials, sufferings and persecutions into our lives. Some of these reasons include:1. To test the validity of what believers profess.2. To test the strength of our faith.3. To humble us.4. To wean us away from worldly things.5. To call us to a greater realization of our eternal hope.6. To show us what we really love.7. To teach us to value the blessing of God.8. To enable us to help others in their suffering (empathy).9. To develop us in enduring strength for greater usefulness.He states that God will give believers what they need to get through every suffering, persecution, etc. by His Spirit and His Word. He provides commentary about believers in the Bible who served as wonderful examples for how we should deal with persecutions and sufferings in this life. He also writes about Christ's own example that has been left for us, preparing for suffering, dealing with suffering, and the lessons from suffering. MacArthur boldly proclaims the truth that God is more concerned about our growth in Him rather than our temporal happiness on this earth. The Lord sends sufferings into our lives to sharpen us and prepare us for the world to come (Psalm 66:10--\"For Thou hast tried us, O God; Thou hast refined us as silver is refined.\"). This is a wonderful book that is sure to challenge your faith and well-equip you for future sufferings and trials that are inevitable to come in this life.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "This book is so chalked full of powerful messages that give fantastic understanding to why there is suffering in God's world, that I feel there is not a soul on earth who would not be able to take away something helpful from this book. Macarthur is outlines his messages in a very comprehensible way.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "rebuilding the real you",
        "description": "DIVRebuilding the Real You, Jack Hayford's landmark teaching on the Holy Spirit, unfolds a clear picture of the process by which the Holy Spirit works in the life of the believer. For anyone who has experienced times of brokenness, the book is a handbook on/div",
        "authors": "['Jack W Hayford']",
        "infoLink": "https://play.google.com/store/books/details?id=EXvx6Dcj8WUC&source=gbs_api",
        "review": [
            {
                "review/text": "Nehemiah's work in the Old Testament is used as an anology for this study of improving one's self. This rebuilding of the wall of the city is similar to the process of God restoring His people today. Pastor Hayford discribes the mission of the Holy Spirit as that of helping you to maximize your potential. We're reminded of God's original intent in creating us, i.e., &quot;man, created perfectly 'in the image of God,' was designed for large purposes and deep fulfillment.&quot; He adds, &quot;relationship and rulership are fundamental to our created purpose.&quot;An excellent point is made on time spent with God. It is essential above all else. Dr. Hayford tells us that we discover self-understanding when we're in God's presence. God's nature is revealed to us in His presence, i.e., to save, to heal, to rescue, to redeem, to provide, and to answer.This is a deeply solid book. It is filled with insights that will transform your thinking. Reading it will bring you closer to God. Your confidence will increase as you are reminded that you are His project. He has committed Himself to you and He is working all things together for the good of those who love Him and are called according to His purposes. This book will build your faith and the just shall live by faith.",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "\"Rebuilding The Real You\" by Jack Hayford is a great encouragement and challenge to allow God to restore you instead of trying a self-improvement program that is doomed to fail when done only in our strength.Among some of the points covered by Hayford include:1. Rebuilding a human personality is an undertaking the Holy Spirit will take on when we allow Him to do so.2. Jesus said that unless we come to Him as a child, we cannot truly live as a child of God.3. When hard times come, lean on the everlasting arms of the Almighty.4. God is for us and is committed to our total restoration.5. Regardless of how bleak circumstances are, Jesus Christ has given us the power and resources to overcome.6. The devil will constantly try to hinder God's program for you.7. Our vertical growth in Christ cannot be disassociated from our horizontal growth with people around us.A great read. Highly recommended!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Jack Hayford is a unique Bible teacher, pastor, and leader. Every word evokes a myriad of feelings, thoughts, and ideas. This is a wonderful work and I was fortunate to get the earlier version too. It is amazing how well this teaching has withstood the test of time. This will make an EXCELLENT small group study, individual development or devotional.You are worth the investment in yourself that the price of this book requires. More than that, you are worth the investment applying the teachings in this book will require of you.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I've been reading some of John Eldredge's and Ransomed Heart's materials, and this is consistent with the notion that the Christian life is available, but rare... it is the life of Christ - living now in us. As Jesus lives in us (through the Holy Spirit), we become restored and renewed. We get to live the life Jesus lived, and we get to live the lives that God always intended for us to live (i.e., the Real You - Restored).Highly recommended reading!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This study will help anyone understand the deeper meaning of the book of Nehemiah . I really enjoyed the way author Jack Hayford show that the Holy Spirit wants to rebuild walls in peoples lives today like Nehemiah rebuilt Jerusalem. A great read. Also very good to use in a small group Bible study.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The prophet Nehemiah rebuilt the broken walls and gates of Jerusalem and shows him to be a type of the Holy Spirit and His work in rebuilding the ruins and broken walls of our lives. The parallels are astounding, very encouraging, and healing. I would recommend this book to every Christian believer, as we all have broken places in our lives where our enemy can enter.This book would also make a great small group study if the leader were willing and able to design a format to that end. I did wish there were a workbook or a 12-week structure for a small group, but it's excellent for personal study and application!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "come away my beloved",
        "description": "Treasured for more than 30 years, \"Come Away My Beloved\" has drawn countless believers into God's presence and into richer relationships with Him.",
        "authors": "['Frances J. Roberts']",
        "infoLink": "http://books.google.com/books?id=-ZjqMQAACAAJ&dq=Come+Away+My+Beloved&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In the hurried pace of today's world, it is imperative that believers actively pursue a close, personal relationship with the Lord. However, in order to do that, each of us must set aside the time to come away and seek out the Father's presence; for though we know and believe that God is with us everywhere, still, we must learn be quiet and to shut out the noise of the world in order to listen instead to the voice of God. Then, and only then, can we be renewed and refreshed. Come Away My Beloved, written by Frances J. Roberts, is a devotional classic that seeks to help us do just that. In its updated form, it has the potential to minister to the hearts of a whole new generation of Christian believers.According to Adrian Rogers, Senior Pastor at Bellevue Baptist Church in Memphis Tennessee, \"Frances Roberts has blessed the multitudes with this book. In a world of speed and noise, this volume is a quiet oasis for the weary soul. It deserves wide distribution and personal appropriation.\" Based solely upon and filled with God's written Word, Come Away My Beloved provides a mix of comfort, conviction, and compassion; it is designed to draw the believer, in whatever stage of Christian growth he or she may be, into a more intimate fellowship with the Lord.Underscoring the truth that God says to us all, \"Only as you know Me can you come to be more like me,\" this unique devotional book is a wonderful aid that can be used alongside the scriptures in a daily quiet time with the Lord. Truly, \"The earthly obscures the heavenly,\" but this book allows its reader a glimpse of eternity through the eyes of Christ, and opens the door to closer fellowship with the Father through the power of His Holy Spirit. Its insights are suitable for all believers. -- Nancy K. Brown, Christian Book Previews.com",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I have had this book for a long time now, but only recently started to discover what a gem I had. I found it, a good few years ago, among a pile of second hand books I was rummaging through. About 2 years ago I read one or two extracts and found it so comforting that I immediately passed it on to a friend! Two months ago it came back to me - unread! But what a blessing it has been.I think the author is a lady, but I'm not sure. One thing that I am sure of though, is that it is authored by a saint. It is written, in the main, \"as if\" the Lord were speaking directly to Frances. She/he seems to be documenting the constant love and comfort, and also loving correction, that the Lord is pouring into her life. It is this heavenly perspective which interprets and redefines all that comes her way - the nominal church, the demands on time, the lures of the flesh etc. Superimposed upon all the manifold and varied revelations is one of a gracious, tender, loving and strong Father. The true Christian will immediately recognise that One to be his God.Because all believers who truly long for closeness with the Father and with His Son Jesus Christ, share a similar pilgrimage, you will find, as you come to this book, prayerfully (or at times in utter spiritual bankruptcy), that again and again it will speak precisely to your condition. But don't make it your God - heed the warning given often in this book of finding God for yourself. Frances wants you to come to Jesus and hear what He has to say to you, in your circumstances and calling - and so does Jesus, I might add. But get a vision of love, sacrifice, discipleship and devotion here that has almost been lost in the polarising camps of the laid-back-Christian-seeker-friendly-entertainment cult and the over-doctrinal-classification-artistes, who want a revival of Puritanism in our day. Get to the marrow - you'll find plenty of that here.(This review relates to the non-updated version)",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is a beautiful book. It is beautifully made and more beautifully written. I got it at a time in my life that I felt spiritually dry. It has helped so much! It makes you realize that you have a loving Heavenly Father. Not One who is just waiting to punish you. It is like love letters from God. I thank God for such a blessing!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I have had this book since the early 1980's. It is marked in and worn out. I know if I was ever on a deserted island and I could only take two books, this one would be second to the Bible. I have rejoiced and wept at his wonderful insight and thoughts. What a blessing to own this book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "It will touch your heart, pierce your soul and correct wrong mindsets. It will make you weep Godly tears of joy. It will bring you closer to your Heavenly Father with words of wisdom and insight. A must for any Follower of Christ hungry for a deeper relationship with God. Ready for a touch of fire from the Holy Spirit? Then this book is for you. Read it often and always.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Come Away My Beloved is more than a devotional. These are love letters from God. My son, 15, says, &quot;Mom, this really encourages me in my life to live more for my Heavenly Father.&quot;I read the Psalms to be encouraged...and now I also read Come Away My Beloved..it's food for my spirit!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you are trying to get to the next level in God, this book used as a devotional is a great way to get there. If you read a passage or two before praying, your desire becomes more of God and less of the stuff you were originally going to pray about. This book also shows you how the Lord chastens and rebukes those that He loves in love. Not only do you hear what is wrong, but you also find out what He wants you to do to fix it. The most awesome thing is that you know that this comes from the word. I recommend this to anyone who leads praise and worship or who is on a praise and worship team.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is a quiet retreat away from the daily distractions of our world. It is precious time spent with the creator of our universe. This book helps me get the real priorities in order. I highly recommend the book to anyone who wants to know God in a real way.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I have had a copy of Come Away My Beloved for several years. I treasure this book and I have decided to buy one for each of my two daughters. The book speaks to me as though straight from God. It has great depth. Surely Frances J. Roberts has a special relationship with the Father to have written such a special book. Thank you Frances!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is amazing and really sinks in the personal relationship that we have offered to us from God. Many times the reading was just what I needed to hear for the day and I would recommend it to anyone who desires to know the Lord in a personal way. Next to my Bible, it is my favorite way to \"hear\" from Him.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "god calling",
        "description": "A journal prepared by two women who call themselves Two Listeners contains prayers, messages, and inspirational thoughts from God for each day of the year. Reissue.",
        "authors": "['A. J. Russell']",
        "infoLink": "http://books.google.com/books?id=weLbDwAAQBAJ&dq=God+Calling&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I give God Calling 5 stars. I'm giving Barbour Publishing, and any other publisher that is printing edited down versions of this book 1 star or less. I have a paperback edition that was printed by Jove Books in 1978. I just got a new hardcover edition printed by Barbour in 2000. I was going to throw out my tattered paperback, but I did a coursory comparison of a couple entries and discovered the new Barbour hardback entries all had entire paragraphs removed. And from a spritual point of view, they were VERY IMPORTANT paragraphs. Upon investigating, MANY of them have had sentances and paragraphs removed. You're better off going to a book store, and looking for an edition that that says \"this book contains the complete text of the original hard cover...\". The passages have completely new meanings when you read the full text as God intended. Whoever decided to edit this down should be ashamed of themselves.",
                "review/helpfulness": "235/237",
                "num_reviews": 237
            },
            {
                "review/text": "This book is dangerous in the way that it purports to be channeled revelation from Jesus. Accepting this extreme claim leads people away from studying Scripture and into a search for subjective personal revelation. The book sounds very good in many parts, but a closer reading reveals the shallowness of what is actually taught. For example, March 13 says, \"Spiritualism is wrong. No man should ever be a medium for any spirit, other than Mine.\" Yet the \"Listeners\" were anonymous mediums, who sat with paper and pen and wrote what \"came to them!\" This book gives no credentials as to why we should believe that the \"spirit\" they wrote for is the Holy Spirit. Technically, we have no proof that the \"two women\" even existed, let alone that they were Christians. We are simply asked to take this on A. J. Russell's word. (He helped found the Oxford Movement, which became the Moral Rearmament Movement, known today as the \"Initiatives for Change.\" This quasi-religious international group pursues world transformation through steps like: \"A daily time of silence where we listen to our conscience or 'inner voice'- for people of faith, the leading of God - for direction and correction.\" Not exactly Jesus' mission program, is it?)March 16 says \"Do you realize that I am telling you truths, revealing them, not repeating oft-told facts? . . . All down the ages, men have been too eager to say what they thought about My truth, and so doing, they have grievously erred . . My words need none of man's explanation. I can explain to each heart . . .\" This directly contradicts the Bible, which says that God gave pastors and teachers to the church to help equip the saints for the work of the ministry. We're supposed to take the edited words of two unknown women as perfectly from Christ and avoid \"man's explanation?\" Sounds like an open door to any number of cults to me. Another line from March 16 - \"To lead a soul to Me is one thing, to seek to stay with it to interpret, mars the first great act.\" This is contrary to Biblical commands to \"make disciples\" by \"teaching,\" \"doctrine,\" \"reproof,\" and \"exhortation.\" The New Testament is filled with commands to teach new believers to study the Bible and interpret it.Another point - the \"Jesus\" of this book doesn't have the facts about His own birth right. December 24 says that the Magi visited Christ in \"the Bethlehem Stable.\" Funny - \"Jesus\" should have known that the Magi visited the Child in a \"house,\" according to Matthew!I agree with Steven Tsoukalas, who says of \"God's Calling,\" - \"The popularity of this book is a symptom of what ails the Church today-virtually no discernment, no deep biblical knowledge, a sugar-coated view of God, and a desire for the what-can-I-get-out-of-God rather than a desire to know God more deeply through the study of His Word.\"Don't wander after shortcuts. Get in the Book - the real Book!",
                "review/helpfulness": "85/126",
                "num_reviews": 126
            },
            {
                "review/text": "God Calling is a great daily devotional. I have been reading it on a daily basis for five consecutive years and cannot imagine starting my day without it. It was given to me as a gift by me wonderful sister, Mary Lou.The book, based on apparitions of our Lord to two women living together in England in the 1930s, is organized by month and day with a daily message from God (through the apparition of Jesus) on how to live our life. A.J. Russell helped in the organization and editing of the book. What has been accomplished is superb as one cannot help but feel that God is calling him/her to meditation, love, and/or action.God Calling has been vetted by the Anglican Church to insure Scripture accuracy and adherence.I have given God Calling to many friends who were either searching for a good devotional or had become stumped spiritually. I have recommended it to many more. I know that I am not alone in my feelings for this book since most that received it or purchased a copy also begin their day with God Calling to them.",
                "review/helpfulness": "63/66",
                "num_reviews": 66
            },
            {
                "review/text": "God Calling is a great daily devotional. I have been reading it on a daily basis for five consecutive years and cannot imagine starting my day without it. It was given to me as a gift by me wonderful sister, Mary Lou.The book, based on apparitions of our Lord to two women living together in England in the 1930s, is organized by month and day with a daily message from God (through the apparition of Jesus) on how to live our life. A.J. Russell helped in the organization and editing of the book. What has been accomplished is superb as one cannot help but feel that God is calling him/her to meditation, love, and/or action.God Calling has been vetted by the Anglican Church to insure Scripture accuracy and adherence.I have given God Calling to many friends who were either searching for a good devotional or had become stumped spiritually. I have recommended it to many more. I know that I am not alone in my feelings for this book since most that received it or purchased a copy also begin their day with God Calling to them.",
                "review/helpfulness": "62/65",
                "num_reviews": 65
            },
            {
                "review/text": "I bought this book at the recommendation of a friend and became very concerned about the content of the book when I read the statements in the preface by one of the &quot;two listeners&quot;. The statements were as follows, &quot;We were being taught, trained and encouraged day by day by HIM personally, when millions of souls, far worthier, had to be content with guidance from the Bible, sermons, their churches, books and other sources.&quot; &quot;So to us this book, which we believe has been guided by our Lord Himself, is no ordinary book.&quot; I read a review of God Calling from the Christian Research Journal, Summer 1998, that said, &quot;If you accept these statements as true, the implications are immense. That would be saying that personal guidance is better than the Bible and that God Calling has more actual words of Christ than the Bible. There is no denying that many statements in the book are inspiring. Scripture is often quoted in God Calling. But cultic literature often quotes Scripture. Reading Scripture wherever it may be found and being blessed by it does not automatically legitimize the publication in which it is included.&quot; There is much more information in this review by the Christian Research Journal that I think any discerning Christian should read before they decide to use this book or recommend it to their friends and family.",
                "review/helpfulness": "44/61",
                "num_reviews": 61
            },
            {
                "review/text": "I came across this book by accident at the bookstore. There it sat, one lonely copy with an intriguing title. The daily words of inspiration seemed to speak directly to me. With uncanny precision it has constantly provided me with support during difficult as well as happy times in my life. After owning this book for 4 years and reading it daily, I now know that it was no accident that the only copy left at the bookstore was meant for me. Buy this book....I doubt you will ever regret it.",
                "review/helpfulness": "45/48",
                "num_reviews": 48
            },
            {
                "review/text": "I came across this book by accident at the bookstore. There it sat, one lonely copy with an intriguing title. The daily words of inspiration seemed to speak directly to me. With uncanny precision it has constantly provided me with support during difficult as well as happy times in my life. After owning this book for 4 years and reading it daily, I now know that it was no accident that the only copy left at the bookstore was meant for me. Buy this book....I doubt you will ever regret it.",
                "review/helpfulness": "44/47",
                "num_reviews": 47
            },
            {
                "review/text": "I just submitted a review and I should have read the &quot;example customer reviews&quot; before writing my first one. To anyone who would question the motive of the &quot;two listeners&quot; or A.J. Russell, I would encourage you to get a copy of the journal edition that includes at least one scripture related to each day's devotion. It is inferred in the book's introduction that it was through the studying of the Word of God on a daily basis that these two women grasped the insight found in God Calling. It is a supernatural event when our limited human minds take hold of divine truth, when we are given &quot;revelations&quot; concerning that which we formerly did not understand, that which we have not been formally educated concerning. This is not cultish or pagan mysticism at work. This is the grace of God to us who believe. If it was evil, it seems to me that another &quot;fruit&quot; of that evil would be for worldly fame and recognition for such profound writing. Instead, all we know is that 2 women faithfully and humbly took God at His Word that He would guide them into all truth and teach them all things and that a publisher, who loves God, decided to let the world enjoy the fruit of these women's faith. I thank God for all three of these people and I am challenged to read the Word of God for myself DAILY that I, too, may know God more fully and intimately. I applaud the attempt at warning all of us against being led astray by mystic sentiment but this book does nothing but support the foundation of solid, Biblical principals. If it repeatedly celebrates and admonishes fruits of the Spirit- LOVE, JOY, PEACE, PATIENCE, KINDNESS, GOODNESS, FAITHFULNESS, GENTLENESS, SELF-CONTROL- reason tells me that it is indeed, FRUIT of the Spirit of God Himself. Remember, even Jesus said, &quot;for the tree is known by it's fruit&quot; (Matt. 12:33)when He was accused of being in league with satan. This book edifies God, encourages further study of the Word of God, and had the potential to transform my mind and heart to more closely resemble that of God the Father, Jesus the Son &amp; Savior, and of the Spirit, Who is our Guide into all truth.(John 14:26) God bless all of you who are earnestly seeking Him!",
                "review/helpfulness": "36/39",
                "num_reviews": 39
            },
            {
                "review/text": "In 1935, two women who remain anonymous and wanted to be known simply as \"Two Listeners\", have been given these messages from the living Christ. These messages give hope, comfort, wisdom, challenges and most of all love to it's readers. In the midst of poverty and disillusionment these two women were able to find comfort from words spoken in the depths of their hearts. We too can find wisdom if we listen with an open mind and heart, Christ will speak to us and lead us on our way to becoming our other self, with hearts renewed by Christ himself. God Calling and God at Eventide are daily meditations that can be read each day. I also like to read excerpts fromThrough Seasons of the Heartby John Powell and GraceGrace in Every Season: Through the Year With Catherine De Hueck Doherty",
                "review/helpfulness": "30/34",
                "num_reviews": 34
            },
            {
                "review/text": "I too have been reading this for about 20 years and it's been a lifesaver for me. I've purchased and given so many away that I really couldn't say how many over the years.Before this book, I had so many pre-conceived ideas about who Jesus was by all the things I had learned as a child. This book has allowed me to know Him in such an intimate way. I was so wrong about EVERYTHING! Matter of fact, I've discovered that most of the things I learned about him were 'exactly' the opposite of who He really is. Every day I learn something new about Him or myself or others I'm dealing with, by reading that days message. Even though I've been through the book so many times, I find I understand things I didn't in the years before. I attribute that to spiritual grown and understanding.It doesn't get old. You just find out more and more about who you are and who He is. To me that is the key to life.I've taught those who have received this from me not to look ahead because it could discourage you thinking 'Next Tuesday looks scary as He's talking about the hardship you are going through.' Yikes!!I've discovered from this book that when you listen to the birds song, it actually imprints Joy on your soul. A bank if you will to be used during times of sorrow or heartache. What a gift huh? I learned that when you look at a flower, it's beauty is imprinted on your soul and comes back into the world as a smile or a cheer for others. What a guy to think of all these ways to concur evil.I recomend this book to all who question the reality of God or His Son. See if you can find all of the times He says \"FEAR NOT\" in this book. It's amazing that it's probably the most used word He spoke and yet we that proclaim to have Faith, never heard it or don't believe it.This book has been the lifeline to overcoming hardships, finding Hope when I thought all Hope was lost, hanging on in His Strength when I couldn't hang on another minute, but most of all, this book has introduced me to the guy I've always been looking for. A very human Jesus.",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            }
        ]
    },
    {
        "Title": "the other side of the river",
        "description": "Explores America's racial antagonisms through the story of two Michigan towns--one white and wealthy, the other Black and poor--and a Black boy's death and its repercussions",
        "authors": "['Alex Kotlowitz']",
        "infoLink": "http://books.google.com/books?id=8tE90cxVYtwC&dq=The+Other+Side+of+the+River&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a \"must read\" for anyone who has come to their senses within an apostate church and wondered what to do and how to do it. The Bible is clear that we are to mark and avoid false teachers (Rom. 16:17) and separate ourselves from those involved in sin (1 Cor. 6:17) while continuing to pray for them. But the issue of rejecting heresy and false prophesy becomes a matter of personal fortitude and deep emotional hurts when it involves close friends who have been brainwashed by \"the river\".My testimony is similar to Kevin's in certain ways, though the Lord saved me from deep involvement in the Third Wave. I lost a number of close personal friends when I found myself in the position of either obeying the Lord and His Word or coming to consensus with men. But the Bible does not give Christians an \"option\". We are to stand for the truth whenever and wherever it is demanded of us, whether in the world or in the churches. We must stand for unity, but that means we are to put on the unity of the Spirit and strive for unity in the Faith (Eph. 4). When unity of the Faith (unity in the core doctrines as taught by Jesus Christ and the Apostles) is not being upheld and taught, then the individual Christian is duty bound to reject that heresy and seek fellowship elsewhere. The Bible is clear that those who obey the Lord prove they love Him, and conversely those who disobey Him prove they do not love Him (John 14:15, 23, 24). We have many choices each day whether or not to obey the Lord. All of us fall down on this account. But we cannot be reconciled to the Lord without (1) repentance of sin and (2) not allowing ourselves into a situation of habitual, continual sin. Staying in a church that is teaching heresy, participating in false prophecy, and promoting false anointings (which are of another spirit) is putting yourself in a position where you are violating both of the above criteria for staying in the love of Christ. Only Jesus Christ can save because of His perfect substitutional salvation He purchased for us with His blood on the cross. But we must repent of our sins and turn to Him, taking up our cross daily and following Him. You cannot follow the Lord while living in habitual sin, and you will not be saved as long as you remain unrepenant. Remember that many will come saying \"Lord, Lord\" in the end but they will go to hell. They are those who think they will be justified by their many works of doing miracles, prophesying, casting out demons, etc. Today we have a whole generation of Christians who are enamored with works, and defend those they follow by constantly referring to them. But the Lord says this:Matt. 7:21-23 \"Not everyone who says to me, `Lord, Lord,' will enter the kingdom of heaven, but only he who does the will of my Father who is in heaven. Many will say to me on that day, `Lord, Lord, did we not prophesy in your name, and in your name drive out demons and perform many miracles?' Then I will tell them plainly, `I never knew you. Away from me, you evildoers!'What is the will of the Father? That we obey Jesus Christ. Jesus says we are to reject heretics by marking and avoiding them. The commands of the Lord are simple, but the reality of obedience is not. But we cannot be blessed by the Lord and gain eternal life without obedience.",
                "review/helpfulness": "19/23",
                "num_reviews": 23
            },
            {
                "review/text": "The Other Side of the River is the true-life memoir of author Kevin Reeves, detailing how a spiritual movement called \"the River\" (also known as the Third Wave or the Latter Rain) and its repercussions within his family's church, the New Covenant Fellowship, affected his life and faith, as well as that of his loved ones. The Other Side of the River tells of how warnings of divine retribution were used as threats to keep members in line; how such blatantly false or nonsensical beliefs such as the idea that faithful women never feel pain from childbirth (since pain of childbirth is allegedly the legacy of the Original Sin) were prevalent; questionable worship practices; the author's own search for truth in the words of Jesus Christ and scripture even as he became increasingly disillusioned with the cultlike behavior he saw; and much more. \"...the true prophets of old and the original New Testament apostles didn't charge at all for the Gospel, but today's prophets, acting more in the know than even Paul or John, make a hefty living drawing in the crowds. As long as they're able to come up with one more hidden key to spiritual prosperity, as long as they can persuade the average believer that he is lacking in some Christian fundamental, today's gospel merchandisers will continue to draw the misinformed with their promises of more. And make them pay through the nose with it.\" A sober and reflective testimony on the misuse of religious leadership, trust, and authority, highly recommended.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I left these practices years ago and this book hits the nail right on the head. Excellent reading - won't be able to put this book down. Recommended reading for all Pentecostals and Charasmatics.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "II Timothy 2:15 tells us, \"Be diligent to present yourself approved to God, a worker who does not need to be ashamed, rightly dividing the word of truth.\" Much of modern Christianity has strayed from this important truth to their own hurt. Having been in the Charismatic movement for a number of years myself, I can relate to what Keven Reeves has to say about it's numerous excesses. For having the guts to expose the error in his own charismatic congregation, I admire him.I John 4:1 tells us, \"Beloved, do not believe every spirit, but test the spirits, whether they are of God, because many false prophets have gone out into the world.\" If this was true in the first century of John's day, how much more so are we seeing an abundance of false teachers or prophets dispensing teaching contrary to Scripture today! No longer are we encouraged to test the spirits, but rather exhorted to unreservedly enter into the latest move of God.Just as a person can be addicted to drugs, food, alcohol, spending, etc, they can also be addicted to emotional religion. While at first a little satisfies, just as with any other drug, you need ever increasing doses to get the same high (emotional rush).Having said that I really believe our God is the same yesterday, today and forever. Just as he healed when on earth, he still heals today. The important thing to remember is that when our Messiah did miracles in the gospels, people weren't rolling around on the floor, barking like dogs, writhing like snakes and on and on. In fact the Scriptures tell us that after being set free, a man who had moments before been inhabited by a legion of demons was \"clothed and in his right mind.\" (Luke 8:35) It was before Jesus set the man free that the demonic manifestations were taking place. Even if the leadership claims that a weird manifestation is of God, I contend that if what you see looks and acts like a demonic manifestation it undoubtedly is.While much of information in Reeves book is excellent, I have two problems with his presentation. First of all, Even though at times he comes across that way, he does not have the last period on Scriptural truth. None of us do.Also, while much of the Charismatic movement if full with error, we need to be careful not to throw the baby out with the bath water. While there are counterfeit healings, there are also genuine ones. Satan can't create anything. He's the master at counterfeiting God's wonderful works.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "I found Mr. Reeves' book after I bought \"Why I Left the Prophetic Movement\" which was very disappointing! Mr. Reeves shares his struggles with questionable teaching in the charismatic community in a way I found refreshing! He points out how a lot of what is being taught isn't found in the Bible but is based on experience and opinion. Much of what is being taught, especially in groups that adhere to the so called \"Toronto Blessing\" is actually heresy and Mr. Reeves' backs up what he's teaching with sound Scriptural teaching that sticks to what the Bible actually teaches and not what someone else may want it to say when it actually doesn't.I also found Kevin Reeves to be a man of godly humility and someone I can trust. He gives us freedom to doubt & question & helps us focus back on the truth of God's Word.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book was very helpful in understanding what the deception is that my own parents have been enamored with. It is a must read for anyone who is battling with loved ones who have fallen away from the truth and become involved in practices that contradict the Bible. My battle has lasted 5 years now, but I continue to pray that God will remove the scales from their eyes. Very definitve on Word of Faith, Charismatic and \"spirit-filled\" deception.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "If you have serious questions about what is God, or False folly that is breaking out in curches everywhere since the Toronto manifestations began, this is a book to read. It is an eyeopening account from a man who was in leadership for many years, and who has now bravely discarded 'the lie'. I suspect most christians will identify fully with the encounters he 'tolerated' despite his growing discomfort, due to the 'false' dilemma of loyalty to leaders versus loyalty to the WORD OF GOD.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is great for anyone that had never practised discernment and a must for people that were or are involved in word faith, charasmatic, holy laughter movements etc.I gave a book to my pastor and he asked if I had other copies so he could pass them on. If you have a loved one caught up in these things give this book to them to read...they will thank you for it.This is a must read!!! Highly recommended.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is a must read for anyone who has seriously questioned the new-thing approach to church and to Christianity itself. It is a lovingly worded corrective written beside a deeply personal reflection that draws us back to a faith that is upheld by the Word and lived out in love and integrity.I bought ten extra copies to pass along to friends. All have been read and appreciated.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "A great book by someone who was deceived for many years by the \"River Movement\", which also is related to the \"Word of Faith\" and \"Dominion/Kingdom Now\". These movements are endorsed by people like Benny Hinn, Kenneth Copeland and many other TBN heretics. Other well-known names to watch out for are Jesse Duplantis, John Wimber, and Rodney Howard-Browne. I would honestly like to see the amounts of money being made by any one of these people. It's a shame that Christians do not compare what these people say with the Holy Bible (KJV).So-called holy laughter, shaking, heat sensations, etc are not holy at all. Thank you Mr. Reeves for having the courage to come forth with your story and enduring the chastisement from others and also the embarrassment that comes with acknowledging your errors after searching the Scriptures.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "how to listen to god",
        "description": "How do we listen to God speak to our hearts, minds, and wills especially above the noise and stress of the modern world? What is the process of discerning God's will? Best-selling author and popular EWTN host Fr. Mitch Pacwa, SJ, tackles these and other questions in this comprehensive book on discernment. He says that first we need to believe in God and his moral laws and make a commitment to please him in all that we do. Then we need to pray so that we can experience the peace that can come only from God. Fr. Pacwa draws from St. Ignatius' Spiritual Exercises, using plenty of everyday examples as well as stories from Scripture to help clarify his points. He encourages readers to develop a rich prayer life and says we can learn to listen to God's powerful voice and hear him speaking lovingly to us even when we are suffering in some way. Confronts modern-day assumptions that can prevent us from being open to God's will for our lives. Emphasizes the many ways we can develop our prayer life to nourish an authentic relationship with the Lord.",
        "authors": "['Mitch Pacwa']",
        "infoLink": "http://books.google.nl/books?id=mFkkkgAACAAJ&dq=How+To:+Listen+to+God&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Contrary to an earlier review, Dr. Stanley does not profess to be the only speaker for Jesus Christ, instead, he encourages the reader to listen to Jesus Christ.The chapter's contents are as follows:1. Is God Still Talking?2. God's Goal in Communicating3. How God Gets Our Attention4. Identifying the Voice of God5. Factors That Determine How God Communicates6. Are You Listening?7. Sitting Before the Lord8. Your Spiritual Mind Set9. Hindrances to Hearing10. Listening and Obeying11. The Life That Listens - A Well-Built LifePersonally, I'd rather listen to the Holy Spirit any day - He is infinitely wiser than any human being, including Deepak Chopra!Read and be encouraged to listen to the Holy Spirit - God wants a relationship with you more than you do with Him and He will speak if you only listen! The book serves as an excellent guide to point the reader to Jesus Christ.Highly recommended!",
                "review/helpfulness": "38/42",
                "num_reviews": 42
            },
            {
                "review/text": "This book should be the second best book in your library. Charles Stanley teaches us the most valuable lessons any believer would want to know and that is how to listen to God. I was on vacation when I read this book, I couldn't put it down.",
                "review/helpfulness": "36/41",
                "num_reviews": 41
            },
            {
                "review/text": "Before I came to know the wonderous glory of our God (Yahweh) and his son Jesus Christ (Yahshua), I would have seen this book as narrow minded and harsh. But each time God makes his presence known to me I am one step closer to understanding the glory that awaits those who are brave enough to be loyal Him and No Other. This book is so loving in its careful interpretation of biblical passages relating specifically to our personal relationship with God and Christ. I truly feel that Mr Stanley was divinely touched in its creation. For anyone who desires the &quot;TRUE&quot; path I HIGHLY recommend this book! Blessings to all. Thank you Charles for your hard work and good ear!",
                "review/helpfulness": "28/32",
                "num_reviews": 32
            },
            {
                "review/text": "This book is the best of any I have. Stanley points out some simple yet profound things that you can do to hear from God. It is the most accurate, detailed, and helpful guide to prayer and a personal relationship with Christ that I have ever seen.",
                "review/helpfulness": "24/30",
                "num_reviews": 30
            },
            {
                "review/text": "How to listen to GOD, changed my life. By learning to listen to him, I learned to know him. If you read one book this year, read this one. Your life will be dramatically effected!",
                "review/helpfulness": "22/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book was wonderful. It gave new and practical insight into how we can truly hear from God. Stanley captures scriptural doctrine into every day practices that every Christian can and should implement.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I'm just finishing reading this book. I've been reading this book as a read along with the Bible. On a daily basis of reading the Bible and \"How to listen to God\" I was made to feel like I was in better understanding of the word. I learned to take the word by the letter. And, listen to Him. This was all accomplished by following what Dr. Stanley says in this book. It's a must read.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Charles Stanley delivers an excellent guide for everyday Christians.Deeply rooted in God's Word he explores the Bible and shares personal testimonies on finding out God's will for our life.This is one of the very best books written on this subject... and this subject can actually mean the diferrence between success and failure for a Christian.Get this book, study it, and study the Word of God. Knowing the Word of God, the Bible, is actually one the most accurate ways to know what God thinks about an issue. Charles Stanley adds more insight into areas like, being in peace in your spirit, having good counsel and so much more... in the end if you seek the Lord's will, you will know, but knowing how to pray and where to look for his will will help you in your journey.Five Stars... definitely worth every penny and even more.Jose L. HurtadoToronto / Canada",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Before I came to know the wonderous glory of our God (Yahweh) and his son Jesus Christ (Yahshua), I would have seen this book as narrow minded and harsh. But each time God makes his presence known to me I am one step closer to understanding the glory that awaits those who are brave enough to be loyal Him and No Other. This book is so loving in its careful interpretation of biblical passages relating specifically to our personal relationship with God and Christ. I truly feel that Mr Stanley was divinely touched in its creation. For anyone who desires the &quot;TRUE&quot; path I HIGHLY recommend this book! Blessings to all. Thank you Charles for your hard work and good ear!",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "What an author! This book reads very easily. His stories inserted periodically keep you riveted and drive home the information. Stanley is obviously an expert in his field. His passion for teaching Gods word is what makes this book a work of art. His principals taught throughout this book hit me like a ton of bricks ... really gave me the insight I have been searching for to get closer to the source of my life! Everyone should read this book ... really!",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "the torch and the sword the sequel to the final quest and the call",
        "description": "The Torch and the Sword is the long-awaited sequel to The Final Quest and The Call. Written for mature Christians, this book is not recommended for the spiritually timid. Continuing themes established in the previous books, The Torch and the Sword carries these themes further and deeper while venturing into new spiritual territories The Torch and the Sword paints an increasingly broad and clear spiritual picture of our times. As Christians, we are called not only to endure the challenges with which we are faced, but also to prevail, seizing the great spiritual opportunities available to us. The truth of the gospel of Jesus Christ is the light which is stronger than any darkness. This book is a call to those who will love and stand for the Truth until His victory is complete.",
        "authors": "['Rick Joyner']",
        "infoLink": "http://books.google.com/books?id=E9zZAAAACAAJ&dq=The+Torch+and+the+Sword:+The+Sequel+to+the+Final+Quest+and+the+Call&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Each time my husband Phil and I read one of Rick Joyner's works, we walk away challenged in our spiritual walk and refreshed and empowered by God's Spirit.We have read both prior works (\"The Final Quest\" and \"The Call\"), and this sequel really brought home several truths which spoke to us personally as well as corporately.The three main points that spoke to us were:1) The children being raised up within the church to their rightful spiritual destiny.2) Women being released in power and ministry.3) The creative Hand of God shining through His people.Although an avid reader, I would have to say that most books I read have some level of \"fluffer fill.\" This book does not. It is a very strong message of repentance balanced with a message with encouragement and an impartation of God's strength. We highly recommend it.",
                "review/helpfulness": "48/52",
                "num_reviews": 52
            },
            {
                "review/text": "This is a must read for people who want to walk it the calling that God has given them. His revelation books have had a great impact on me. It has given me great understanding about the Bible, and has changed the way I think about Christianity.The book is a combination of many visions the author had. The main vision depicts the Armies of God fighting the Armies of the Evil one. Many great insights are revealed by the way these armies fight, their tactics, what weapons they use, the mistakes they make, the opportunities they miss, etc. The vision continues with the author walking in the Judgment Hall of Heaven, meeting may past saints, and hearing their stories.The Book, The Vision and also the Torch and the Sword, had a profound effect on me in these ways.1. It has dramatically increased my faith in Jesus.2. It has demolished any faith I had in Myself, Mankind, or Man's wisdom.3. It has given me a sobering awareness of the Evil one's tactics and craftiness.4. It has revealed many empowering and glorious resources of the Lord that I did not consider which has given me more Hope.5. I started to see the overall picture of God's Plan. And different parts of the puzzle started fitting together in harmony, and I got answers to many of the Hard Questions of Christianity.6. It has shown many of the Pitfalls and Traps that even the Seasoned, Mature Christians will fall into, and yet not even know they have fallen. The lessons were profound yet simple. They were they same lessons learned from the Bible, yet even I who have studied the bible have many times overlooked them. The Lord could not trust people with much anointing or power, until they learned the lessons.7. It reveals a great deal about those who hate the book, fight against it, and think it is from the Devil. He meets many of those types of people in Heaven, and their stories radically change after hitting the Judgment Seat. You can hear the MP3 of the book at SpiritLessons dot com. Hope you enjoy.You can read and hear many revelation by Rick Joyner [...]",
                "review/helpfulness": "29/33",
                "num_reviews": 33
            },
            {
                "review/text": "Eye opening for those who are seeking to walk by the Spirit of God and discern spiritual things.All of Rick Joyner's books are helpful. The Surpassing Greatness of His Power is a foundational book that I encourage you to read first. The Final Quest and The Call will help those more discerning folk.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is the third in a series of books by Rick Joyner in which he had a series of visions where he was allowed to see The Church of Jesus Christ as God really see's it. Not as we see with smiles and fascades.We see the Saints of God (the people who have asked Jesus personally into their lives) in an actual real live battle and we see Armies, Angels and Demons.We see the body of Christ deeply divided and many struggling in fear, unbelief, unforgiveness, bitterness, sexual and many other sins and the saddest part of it is they don't even realise what is happening. They think this is their 'lot in life' and put up with it.Then the Lord starts to restore His Church.But not without severe opposition from both inside the Church and the World.In the visions Rick himself makes many foolish mistakes which leave him open to attack and little by little he and we hopefully learn how to walk with God as He wants us to in love and faith.If you liked 'The Pilgrim's Progress' by John Bunyan (which was also given as a vision in a dream and has blessed millions world wide.) then you should like this too.I recomend you read the other two books first being in order; 'The Final Quest' and 'The Call'.All three books are excellently written too and with wondefull descriptions of Heaven and of our lovely Lord Jesus.These would be great books for a new Christian as they could jerk the slack out of his life and help him press deeper into the Lord.May God really bless you.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book was so interesting, I read it in two days which is something I haven't done in awhile. It has a lot of nuggets in it. It makes me look forward to what God is going to do with His people, mainly for the youth in ministry.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "I'm glad Joyner has taken the time to draw near to God and be sensitive to his calling to enlighten a confused generation by adding a depth of understanding and wisdom. As a literature teacher, I endorse all Joyner's books rather than the negative influences out there which often twist truth. I haven't met anyone yet who hasn't experienced a deeper level of conviction upon reading any of Joyner's books, though some must guise their convictions with criticism and some clearly are just plain confused. In my opinion, it's a \"must read\" for anyone who is hungry for Christ.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Rick Joyner is always good to read.His book has no redundancy; his logical flow is so natural.He is surely a master of a biblical knowledge and history, and its experience and practice alike. Especially his emphasis on \"humility\" at the end of the book is so overwhelming and engaging and even awesome.It is full of so many vivid imageries and powerful insights. I should say, \"Strongly Recommended Book to Everybody, Especially to the End-Timers!\"",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "so you want to be like christ eight essentials to get you there",
        "description": "Inspired by the acts of sacrifice and discipline exemplified by the D-Day generation as well as the current generation of young American soldiers, many Christians today are looking for an obedient, disciplined approach to faith. This user-friendly study guides readers toward a greater understanding of eight spiritual disciplines of the Christian faith-prayer, humility, self-control, sacrifice, submission, solitude, silence, and hope. Each chapter defines and discusses the concept, then provides interactive assignments and suggestions for further study, as well as content summaries and outlines that aid in retention. Activities can be revisited again and again for a new outlook or just for a periodic refresher. Perfect for individual or group or family study, So, You Want to be Like Christ? is just right for anyone desiring to delve deeper into the fundamental elements of Christian life, and essential for all who hunger for authentic faith experiences. It is destined to be a classic text on the practice of Christianity.",
        "authors": "['Charles R. Swindoll']",
        "infoLink": "https://play.google.com/store/books/details?id=M1DG67z6qtYC&source=gbs_api",
        "review": [
            {
                "review/text": "\"So, You Want to Be Like Christ?\" combines two essential ingredients: crisp, creative, practical writing with a meaningful, relevant, topic. For the first time, Chuck Swindoll focuses his literary skills on the ancient art of Christian living through spiritual discipline.While some assume that the current generation lacks discipline and the will to sacrifice, Swindoll recognizes that the opposite is true. Today's generation could become \"the greatest generation\" if they were mentored into the historical practices of the Church.Swindoll provides the mentoring-in-writing through his user-friendly examination of eight classic disciplines: prayer, humility, self-control, sacrifice, submission, solitude, silence, and hope. Though these are familiar to readers of books by Foster and Willard, they are not the standard practices of most evangelical Christians. With Swindoll's reputation, he may well incite a new wave of spiritual formation.As with his other writings, Swindoll provides ample biblical content to ground his topic theologically, then surrounds his chapters with timely illustrations, helpful suggestions, and practical exercises. For those hungry for an introduction to a deeper, more disciplined spiritual life, \"So, You Want to Be Like Christ?\" does indeed provide \"eight essentials to get you there.\"Reviewer: Dr. Robert W. Kellemen is the author of \"Soul Physicians: A Theology of Soul Care and Spiritual Direction,\" \"Spiritual Friends: A Methodology of Soul Care and Spiritual Direction,\" and the forthcoming \"Sacred Companions: A History of Soul Care and Spiritual Direction.\"",
                "review/helpfulness": "33/35",
                "num_reviews": 35
            },
            {
                "review/text": "I think this is the first book I have ever read from Brother Swindoll. I just finished it reading a few minutes ago and I have come to the conclusion that this is a book that should be part of every Christian's personal library. Though he mentions \"Eight Essentials To Get You There\" (there meaning to be like Christ), I think of these essentials as selective ones and not as exhaustive. He is a great writer and this book flows easily from topic to topic. It covers these essentials in a brilliant, straight-forward manner that will make the reader examine his/her own life in contrast with that of Christ.The only thought I disagree with in this book is found on page 63 where Brother Swindoll states the following: \"I do not believe that people today receive audible instructions from God, receiving them directly from somewhere within their spirits. Our only reliable source of communication from God is the sixty-six books of the Bible.\" If this is so, and if I am understanding correctly what Brother Swindoll is stating, then there are three problems with this assumption or belief; 1) If the Bible is the only reliable source of communication from God to His people, then why did God Himself \"gave some to be apostles, some prophets, some evangelists, and some pastors and teachers, for the equipping of the saints for the work of ministry, for the edifying of the body of Christ,\"? 2) If the Bible is the only reliable source of communication from God, what would happen when God sends an angel with a message for a particular person as He sent an angel to Cornelius? 3) If the Bible is the only reliable source of communication from God, are we not putting God in a box by refusing to accept that He can choose to speak audibly to whosoever He desires at the time and place of His choosing? By accepting the belief that God cannot audibly speak to His people, are we not stripping Him of His sovereignty? I hope this is not the case. Other than my disagreement mentioned above, I feel this is a great book for helping us to want to be like Christ.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "This is one of the best 'spiritual guidance' books I have ever read. I think because his thoughts and points of view were coming from his personal experiences, rather than what he thinks things should be like. I definitely look forward to reading another book by Swindoll.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Readers of Charles Swindoll know what they're in for - a well-written, scripturally sound treatment of the subject at hand. This is, to my knowledge, the first time Swindoll has tackled spiritual disciplines, and he's as insightful as ever. Excellent review for mature Christians, and a good beginning text for those new to the faith.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I was humbled and uplighted by this book. For years Chuck has been a favorite of mine. His candor and preciseness are the qualities that draw me to his writes. As a young pastor I look to him for pastoral advice and I find them in his writings.This volume is primarily about eight disciplines that must be at the center of everyone's life, esp. if you are a pastor, leading God's people. I especially like his chapter on Surrender. Thank you, Chuck.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is surely one of Swindoll's finest, there seems to be a humbleness and passion in these pages that carries these special thoughts along. Eight disciplines are developed in a devotional style, wrapped around a core development of discipline and intimacy with God. I'm not quite through the first reading yet, and I'm already sure that I'll need at least two more times through, probably slower each time, before I can expect to see real application. I'm being challenged deeply, by a pastor who really cares about Christlikeness, in his own life and mine.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a great book for whoever wants to make changes in his/her own life and be closer to God. The suggestions Swindoll gives are very appicable to everyone's life. It's somethig anyone can do, provide there is the desire to become more like Christ.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is a must if you want to walk with Christ on a daily basis and be what He intends for us to be. It's encouraging, insightful, and easy to understand. In our busy world, we need to unclutter our minds and focus on Him, that is what true success is all about and to be a light where Christ has placed us. I highly recommend this book, it will guide you on the right path.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Along with the workbook, this book is not for those who are content with their relationship with Christ, but for those who desire a deep intimacy with Him. Practical applications abound.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Very inspirtional reading pastor Swindoll really helps in showing us how to walk in this life and hold to the teachings of our lord Jesus.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the place between amen and ive got it why some receive sooner than later",
        "description": "For those waiting somewhere between a prayer and an answer, Russell Plilar helps readers consider why some people receive answers sooner rather than later from God, and offers thoughtful encouragement in the face of the countless questions believers ask while waiting on answers to prayer.",
        "authors": "['Russell Plilar']",
        "infoLink": "http://books.google.com/books?id=JVfFswEACAAJ&dq=The+Place+Between+%22Amen%22+and+%22I%27Ve+Got+It!%22:+Why+Some+Receive+Sooner+Than+Later&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a dynamic teaching on Christian living and how to obtain the fullness that God has to offer for your life. If you have any questions concerning why you are going through a particular trial or hardship, you will find the answer in the pages of Pastor Russ Plilar's new book. Pastor Russ goes through several &quot;roadblocks&quot; that stop people from receiving the blessings that God has promised them, and reveals truths from the Bible that will make you stop and think for a moment about where you stand with God. The Contemporary English Version of the Bible says in 2 Corinthians 10:5, at the latter part of the verse, that we (Christians) are to capture peoples thoughts and make them obey God. If there is one statement I can make about this book, it is that it will capture every evil way of thinking that the devil tries to put in your mind, and force you to change your way of thinking to be like God's way of thinking. Every Bible believing Christian knows that God's thoughts are higher than our thoughts as humans in general. This book will drive you to repent of the things you have done against the will of God. The word &quot;repent&quot; literally mean to change your mind and turn around, or, more simply, to change your thoughts to be God's thoughts. When you start thinking the way God thinks, you will no longer give sin a place in your life. In Romans 6:12 the apostle Paul warns us to not allow sin to reign in our mortal bodies. Sin is the one thing that seperates us from God. When Man fell in the garden of Eden, it was sin that was added to the human body that seperated us from God, becauses God has no sin. 2 Corinthians 7:1 tells us that we as Christians are to cleanse ourselves of the filthiness of the flesh and spirit, which means that we have to remove the sin from our life, which is only possible through the shed blood of Jesus Christ when He was crucified on the cross as a sacrifice for our sins. This shows us that the only way to become what we were created as, in the likeness and image of God (Genesis 1:26,27), is to repent and change our ways to be like God's ways. &quot;The Place Between Amen And I've Got It,&quot; is a book designed to help people everywhere to turn from the sin that has them enslaved and draw near to God. Colossians 3:2 tells us to set our affections on things above, not on the things of this world. Pastor Russ's book will help you to focus on God, the source of your blessings, your health, your prosperity, and your life. Through his own personal testimony Pastor Russ will take you to a place between the shout of Amen when God promises you abundance of blessings and life, and the time when you will actually receive these things. He helps you to understand how the devil operates to destroy you during this crucial time, the time between the planting of the seed and the harvest. The Bible says that as long as the earth remains ther shall be seedtime and harvest, but if you do not understand the work that must be done between the time os planting and reaping, you may never see your harvest. This book is a must for anyone who wants to know how they can receive the fullness of what God wants to do in your life. Buy it, read it, and apply it to your life, it will truly bless you.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book should be required reading for every Christian on the road between &quot;AMEN and I've Got It!&quot; I grew up in the &quot;Faith Camp&quot; and have seen many &quot;shipwrecked&quot; Christians that never understood the principles taught in this book. Pastor Russell Plilar walks you through all the major roadblocks to obtaining the promises of God found in the Bible. He is no novice when it comes to the walk of Faith. The examples he uses from his own life are supernatural and inspirational. The &quot;Faith Message&quot; has been criticized by many in the Church because of their lack of understanding of the things discussed in this &quot;Faith Saving&quot; book. If you believe that God really does want you to be blessed and successful in this life - OR if you are beginning to have your doubts - this book will save your faith! I wish I would have read this book 20 years ago! Get it! You won't be sorry!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "beyond failure discovering grace and hope in the hard times of life",
        "description": "\"Beyond Failure\" defines success and failure according to the Bible. Scudder examines the life of Peter to show how God uses our failures as stepping-stones toward becoming more like Christ. Practical and relevant, readers can learn how to have fulfilling joy in spite of the ups and downs of life as well as being equipped to encourage others struggling with failure.",
        "authors": "['James A. Scudder']",
        "infoLink": "http://books.google.com/books?id=qMOfgnk6hNAC&dq=Beyond+Failure:+Discovering+Grace+and+Hope+in+the+Hard+Times+of+Life&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a great book. Extremely well written and easy to understand. It should provide many with encouragement through the difficult times in their lives, and help to bring them through it. This book is a must read.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "What a great book! It's so comforting to know, from the Bible, that no matter what we've done, where we've been, God does not give up on us. This book focuses on the life of the Apostle Peter, who actually denied Christ, and how God still used him. Through use of Scripture, Dr. Scudder explains how to get up, get moving, and get back on track after failing our Lord. What a blessing! Thanks, Dr. Scudder, for this vital encouragement that every Christian needs!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "There is not a person in the world who hasn't fallens short of what they feel they should have become. Parents, siblings, teachers and spouses hold us up to expectations of which we fall very short.Dr. Scudder delivers a delightfully refreshing look at success and failure--in real terms. Closely examining the life of the Apostle Peter, Beyond Failure discovers the true secret of the Christian life. It's not about what we do or what we achieve. It's what Christ can do through us.At first glance Peter was a failure--and so are we. Yet, at the end of his life, we was martyred for the Lord--the ultimate Christian success story. He also wrote two New Testament books, which inspire and motivate Christians to this day. This embattled, impatient, impulsive apostle realized that true failure is not in the falling down, but in the staying down. We all make mistakes, put our feet in our mouths, and make poor decisions. The questions is will we use them as stepping stones to success?Dr. James Scudder's Beyond Failure will inspire you to keep going--to finish the race. Filled with personal anedotes and real-world illustrations, this book is a much-needed oasis in a dessert of disappointment. Pick it up today and be refreshed.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Failure is inevitable. Chapter one tells us that anyone who achieves will experience it at some point. However, Christians can overcome satan's weapon of discouragement during seasons of failure, but knowing the truth. The encouraging news we're told is that God's ways are greater than what we can imagine. Scudder says encouragement of his nature helped him through seasons of testing, along the way he gained strength from such truths. The author reminds us that God is with us and has never left us.On the issue of significance, Scudder writes \"Every one of us is a unique creation of God, and every one of us has a different purpose and calling in the Christian life\" (p. 11). In emphasizing that everything is significant, he adds, \"The true mark of a spiritual man or woman is the desire to do any job, no matter how 'lowly'\" (p. 26). He talks about working in a responsible way unto God, not unto man.Spending time with God is a necessity for spiritual growth. Through prayer and Bible study, God is given a chance to work he tells us on page 34.In the section toward the end of the book on love, he says he learned to love even when it wasn't returned. \"When you get a rude comment, learn to forgive\" he tells us (p. 158). This is a particularly insightful section in a book full of spiritual depth.I strongly recommend this book as it has practical advice that will make any person heeding the words more effective in their spiritual arena.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how to let god help you",
        "description": "This beautiful, sweet book was first published in 1956 as a collection of Myrtle Fillmore's letters and other documents, compiled and edited by Warren Meyer. This edition is faithful to the original, yet fills in missing details with citations of Bible verses and the sources of other quotes that weren't annotated there. It is a classic in the Christian New Thought movement that marries the Bible with metaphysics and practical everyday understanding and activity.",
        "authors": "['Myrtle Fillmore']",
        "infoLink": "http://books.google.com/books?id=047GAQAACAAJ&dq=How+to+let+God+help+you&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Myrtle Fillmore was born in the mid-1800's and was a very accomplished and inspiring woman - her contributions to this world go well beyond being co-founder of the Unity faith. The Unity faith helps one find ways to receive the Spirit of God and develop the power of God within you. It tries to give you tools to take responsibility for your life, to grow and develop spiritually. It dares us to really connect with God and work on ourselves, rather than just sitting and waiting for something good to happen out of the blue. Myrtle's book here presents her religious philosophy very well. This little book is a goldmine of inspiration and teachings.I don't think that one even necessarily needs to be of the Unity faith to get a lot out of this book. From reading through it, I think anyone whose faith centers around believing in Jesus and God learn a lot from this book on topics like prayer, healing, etc. I wish I would have bought this years ago. Most of the chapters are short and I really enjoy reading a chapter or two right before I go to sleep at night.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "A great book Should be required in everyone's library. A great roadmap to our life's journey I keep in my car and read it during my lunch hour",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]