[
    {
        "Title": "hungarian lonely planet phrasebook",
        "description": "Lonely Planet Hungarian Phrasebook & Dictionary is your handy passport to culturally enriching travels with the most relevant and useful Hungarian phrases and vocabulary for all your travel needs. Get local recommendations for thermal baths and the best wine -all with your trusted travel companion. With language tools in your back pocket, you can truly get to the heart of wherever you go, so begin your journey now! Get More From Your Trip with Easy-to-Find Phrases for Every Travel Situation! Order with confidence, explain food allergies, and try new foods with the menu decoder Save time and hassles with vital phrases at your fingertips Never get stuck for words with the 3500-word two-way, quick-reference dictionary Be prepared for both common and emergency travel situations with practical phrases and terminology Meet friends with conversation starter phrases Get your message across with easy-to-use pronunciation guides Inside Lonely Planet Hungarian Phrasebook & Dictionary Full-colour throughout User-friendly layout organised by travel scenario categories Survival phrases inside front cover for at-a-glance on-the-fly cues Covers Basics - time, dates, numbers, amounts, pronunciation, reading tips, grammar rules Practical - travel with kids, disabled travellers, senior travellers, sightseeing, business, banking, post office, internet, phones, repairs, shopping, bargaining, accommodations, directions, border crossing, transport Social - meeting people, interests, feelings, opinions, going out, romance, culture, activities, weather Safe Travel - emergencies, police, doctor, chemist, dentist, symptoms, conditions Food - ordering, at the market, at the bar, dishes, ingredients The Perfect Choice: Lonely Planet Hungarian Phrasebook & Dictionary, a pocket-sized comprehensive language guide, provides on-the-go language assistance. Great for language students and travellers looking to interact with locals and immerse themselves in local culture. About Lonely Planet: Started in 1973, Lonely Planet is the world's leading travel guide publisher with guidebooks to every destination on the planet. Check out our Fast Talk Phrasebook mobile app for on-the-go language needs. (Available languages: German, Latin Spanish, European Spanish, French, and Italian.)",
        "authors": "['Lonely Planet']",
        "infoLink": "http://books.google.nl/books?id=jBcnyQEACAAJ&dq=Hungarian:+Lonely+Planet+Phrasebook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Well, I am a native speaker of Hungarian myself, so I was quite curious to see this book.For the most part, I found it very good.The main part of the book, the phrases are quite good and natural - it really shows that they had native speakers check it.The phrases cover all sorts of issues from shopping to visiting a doctor or even dating and having sex!The boxed texts on culture are also quite good and often amusing.It has only 12 pages on grammar, but that's quite spot on.It does include a box on present tense verb conjugation (taking vowel harmony into account!), and has even devoted a whole page to conjugating four common, but irregular verbs (come, go, eat, drink). Another box conjugates \"to be\" and yet another shows the suffixes for possessions. I guess it's quite OK for the space.The 2000 word dictionary at the back is quite comprehensive.A weaker point is the \"phonetical transliteration\" system used - Hungarian is written fully phonetically in its original form (thankfully also presented here), but the phonetical transliteration provided here for English-speakers may result in blank looks in many cases - you could always choose to ignore it.The intro contains useful facts about the history and roots of the language, though the map showing where Hungarian is supposedly spoken might raise some eyebrows in neighbouring countries! ;-)The layout is attractive, with color illustrations.I even like the cover (different from what is shown on Amazon)- certainly better than a kitshy horseman or traditionally clad dancer could have been! ;-)Overall: RECOMMENDED.If you are planning to spend any time away from the major cities and tourist areas, you will find it VERY useful!",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "With help from this guidebook I was able to pronounce words off of menus well enough to where servers were pleased with me and eager to help me out. My last phrasebook left people in Poland laughing at me as the phonetic guides led me astray. The problem with this guide is that it was not correct with some of the basic words a traveller would want. Our hotel staff told us that we were using antiquated, formal versions for certain greetings and interactive words, and gave a lesson on what to say (and when) instead. We also found that we got blank stares when we asked about dinner at a resturant. We pointed out the word in the book and the server looked very confused. I guess this book fails to even provide a correct translation for \"dinner\"...and who knows what else? I was glad to have this book along -- it is basically useful -- but I've got to assume other guides do a better job with getting some of the basics right. If you book at a big hotel you can save a few dollars by getting a free, accurate lesson from the staffers, and forgetting this guide.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "I took one term of Hungarian in college, and I've been to Hungary a few times (but only for a few days each time). So I tried getting this book to relearn some of the language before going back to Hungary this year. It helped me do just that, and I was able to converse with plenty of non-English speaking Hungarians. This is a well-written book.But how much will this book help you if you don't know Hungarian at all? I'm not so sure. To communicate in a language, I think you really need to hear it spoken and painstakingly learn a bunch of vocabulary words (I like using flashcards to do this). I think it will be more of a help to those who already know something about the language, or at least have access to someone who can help them practice it.I'm glad I got this book. I recommend it.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This phrasebook is filled with loads of well-organized information and superb vocab words - I thouroughly enjoyed reading it from cover to cover while on the plane to Budapest. However, once I arrived in Hungary I was a bit disappointed to find that everyone spoke English (at least in the Budapest area). The phrases I tried got a few smiles, but the only truly useful part of the book was the dictionary. It was quite helpful in reading signs, ads, posters, menus etc.In spite of the little use I got out of it, I would still recommend taking this phrasebook to Hungary. It provides a bit of security for the short-term traveler and would become more useful the longer you stayed (especially for those who can speak a bit of Hungarian already or those who are studying the language).",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This pocket book is a must-have for anyone who, like me, has an interest in learning Hungarian or who plans to visit Hungary. Concise & comprehensive, it's a winner. The only drawback is that the 'pronunciation' provided seems to be geared to travelers from the UK &, as such, can cause difficulties for No. Americans. This ancient, beautifully soft, & richly vocalic language is certainly complicated for an English speaker. Along with a T&ouml;rkenczy grammar any traveler should be speedily humming along in party town Budapest. These people are warm, friendly, & openly admire most anyone willing to tackle their tongue, not to mention the cuisine & the wines!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book. It's small enough to just throw in your bag and go when you are exploring a new city. Since moving to Budapest, it has come in handy several times over - and the pronunciation is superb! It has every helpful phrase you need when traveling abroad!I think this book could be used for travelers of any age - though the \"romance\" section may be limited to the younger population.One thing I would like to see in future publications though is maybe a map of the city - or at least a map of the metro.I would buy this book - and others from the series - without hesitation in the future. I am a huge fan of Lonely Planet products so having this book in my library is just the icing on the cake!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I purchased this before a recent trip to Hungary and was pleasantly surprised. It is pocket sized and easy to carry (which wasn't clear to me from the other info on Amazon). It has all the necessary basic phrases divided into useful categories, and a nice little glossary in back. It doesn't offer an extensive vocabulary, but for me it was the right amount and the limit was worth keeping the book small and easy to carry. I would say it is perfect for someone with no or almost no experience with Hungarian who needs just the basics for a trip.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the oxford picture dictionary englishvietnamese editon the oxford picture dictionary program",
        "description": "Vibrant, realistic illustrations and unparalleled teaching support make the Oxford Picture Dictionary Program what every classroom needs to build students' vocabulary, reading, and critical thinking skills.Help your students picture their journey to success with the Oxford Picture Dictionary Third Edition - now enhanced with new topics to prepare learners for work, academic study, and citizenship.* Increase vocabulary retention with over 4,000 words, 421 verbs and practice activities - available as an American English dictionary or in 5 bilingual editions (Arabic, Chinese, French, Spanish and Vietnamese).* Prepare students to meet the requirements of their daily lives with updated content including Job Search, Career Planning and Digital Literacy.* Access everything you need for a successful classroom from the online Teacher Resource Center - giving you more time to focus on teaching!",
        "authors": "['Jayme Adelson-Goldstein', 'Norma Shapiro']",
        "infoLink": "http://books.google.com/books?id=6fPmjwEACAAJ&dq=The+Oxford+Picture+Dictionary:+English-Vietnamese+Editon+(The+Oxford+Picture+Dictionary+Program)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I purchased this book to assist a Vietnamese immigrant that I work with. She knows very little English, but attempts to communicate ideas and concepts with her co-workers. This can be very frustrating for her because we speak English, and have little motivation to learn Vietnamese. So, she's stuck having to learn the language from people that are not teachers, speak too fast, frequently use common slang terms, and have an attitude that \"She'll eventually pick it up\". I feel sympathy for her, so I bought it for her.This book contains a few thousand words and pictures, all in the context that they're seen and used. For example, there is a two page spread of an intersection of roads. In that picture, there are pictures of various businesses such as laundromats, bakeries, beauty salon, and such. Car, motorcycle, truck, bus, etc. Parking meters, traffic lights, crosswalks, road, curb, corner, mailbox, fire hydrant, parking space, and many other things you'd find at an intersection of streets in a city. Many of these picture spreads also have verbs identified with a picture. For example, there is a picture of a car backing into a parking spot and noted \"park the car\", a bicyclist is noted with \"ride a bicycle\", \"wait for the light\", \"walk across the street\", etc.What makes it perfect is that beneath the English word is the Vietnamese word so the student can identify the nouns and verbs more clearly and what action the picture is conveying, such as \"learn to drive\", \"plant a tree\", \"hang up your clothes\", \"wash your hair\", etc. In certain instances, the verbs are presented in the order they'd be performed, such as: Wake up, take a shower, eat breakfast, go to work, leave work, go shopping, go home, eat dinner, go to bed. This helps with associating the nouns and verbs with the situations. Pick up the receiver, listen for the dial tone, put coins in the telephone, dial the telephone number, have a conversation, hang up the receiver. That sort of thing. All with clearly identified pictures.The amount of material is pretty extensive, covering 3,700 words. These words are grouped into 12 broad categories: Everyday Language, People, Housing, Food, Clothing, Health, Community, Transportation, Areas of Study, Plants and Animals, Work, and Recreation.Each category is then broken down into several picture spreads with all the pictures and activities defined. For example, the section on community is broken down into these picture spreads: City streets, an intersection, a mall, a childcare center, U.S. Mail, a bank, a library, the legal system, crime, public safety, emergencies and natural disasters. All things and related concepts are identified in English and Vietnamese. Very nice.Some spreads resemble comic book panes. Job Search is an example showing a young man looking for a job, looking for a Help Wanted sign, Looking in the newspaper, Calling for information, asking about the hours, filling out an application, going for an interview, and eventually getting hired. All with relevant and understandable pictures.For a beginner who knows little English, this gets them started so they can identify time, days, past, present, future, emotions, and other concepts they'll encounter every day. They will still need a native speaker, or someone who is fluent in English, who can assist with correct pronunciations.After several months to a year (depending on the students circumstances) of studying this book, they will need to move onto an English *grammar* book so they can construct their sentences correctly, instead of the typical, \"Me go home\", \"You no work tomorrow?\", or \"I are use blue cleaner, yes?\" and that sort of thing. There is some coverage of verb forms, but it's virtually useless without more extensive coverage (and definitely needs a teacher).The back of the book contains an index, in Vietnamese, so the student can look up Vietnamese words and flip to the page were the English word, picture, and spelling is. There is also a simple English dictionary with pronunciation key, but will be of little help to a Vietnamese speaker since the English pronunciation key will be as clear as Arabic or Hebrew. How can they possibly understand the difference between \"a\" as in \"Bake\" or \"a\" as in \"Father\" unless they actually speak the language? Therefore, this pronunciation key isn't going to be very useful until they are very familiar with a few hundred words or more, along with their correct pronunciation. Then they may associate how to pronounce \"a\" (with the little straight line above it) with \"cake\".Overall, this book, along with a native speaker, is an outstanding start for a new Vietnamese student of English. I highly recommend this book.- Alleyrat",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book was exactly what I had been looking for! It was easy to comprehend and the pictures are well done. The pictures are also a great learning tool. If you are looking for a great English/Vietnamese dictionary take advantage of the time I spent researching this product and buy it. You won't be sorry!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "Excellent resource book both to refresh my own limited knowledge of Vietnamese and to find the right English/Vietnamese equivalent for my Vietnamese students.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I am an ESL teacher and tutor 5 Vietnamese students. They all have purchased this book and we are using it with hands on lessons for each chapter of this dictionary. There are no other books that I have found in the 15 years I have tutored that are more descriptive and the illustrations helpful for teaching English.Enjoy!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "say it in danish dover language guides say it series",
        "description": "DIVContains over 1,000 useful sentences and phrases for travel or everyday living abroad: food, shopping, medical aid, courtesy, hotels, travel, and other situations. /div",
        "authors": "['Dover']",
        "infoLink": "https://play.google.com/store/books/details?id=SMHCAgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This pocket size book attempts to teach the reader basic phrases and sentences in Danish by printing them phonetically in English. This is a great concept- but instead of spelling things foe-net-ik-lee, they use all of those annoying symbols that one generally finds in a pronunciation key at the begining of an american dictionary (the upside down and backwards e, the little lines over an a or an e, etc. for example). So unless you are an English major and understand the meaning of these american language symbols- you will never understand this book. Also, even when you try to figure out what all the symbols mean- the pronunciation that you end up with sounds nothing like the danish word. My husband is from Denmark and I have been struggling with the language for years. I suggest that you get Colloqial Danish with the audio tapes if you don't know anyone who can demonstrate the pronunciation for you.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is the best language book I've ever bought, and I speak good German and Spanish in addition to English. I picked this book up used for [cheap] at a cozy bookstore in historic Julian, CA. Frustrated to death with tapesets that have no booklets, booklets that are impossible to read, rote memorization of \"vocab\" lists that aren't used in conversation-- this book was a refreshing alternative. As someone who speaks English and German, Danish was an easy-to-comprehend mixture of the two. The book starts out with hundreds of common phrases \"I'm from America\" \"I'm here on business,\" \"Where can I find good theaters...\" and then introduces more vocabulary words. They've brought out all the essentials of the language, in a clear, pocket-size manual you can carry around in your shirt pocket while bicycling Europe. If you get one Danish book, get this one-- and buy some others from the set. Say it in Japanese, Say it In Norwegian, Say It in German, Turkish, Arabic, French... the list is comprehensive. All the books follow the same excellent model. I totally disagree with the reviewer who hated the phonetic symbols. What's so hard about the shwah (backwards e), long a, short a, etc.? Any high-school grad should understand these symbols. It's the ONLY way to communicate pronunciation clearly. That's why dictionaries use it. Can you understand the dictionary? However, her recommendation of the other tapes was helpful... maybe I should check those out!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "conversational italian in 20 lessons cortina method",
        "description": "Cortina Method Conversational Italian in 20 Lessons, Illustrated Step by Step, these twenty lessons, with charming and helpful illustrations, will enable you, regardless of previous languge training, to read, write and speak Italian in the shortest possible time. The Cortina Method has been time-tested and is the quick, easy and natural way to learn a language. It has received the approval of teachers, students, schools, colleges, and business firms all over the world. Guide to Pronunciation and Spelling Explains how to pronounce the sounds, words and phrases of the language through simple phonetic symbols based on English spelling. Rules of spelling are also explained. Twenty Conversational Lessons These lessons include useful vocabularies and everyday conversations. Alongside of each word and sentence is given the correct pronunciation and English translation. Easy-to-understand grammatical footnotes are combined in this Method to make your language study effective and interesting. Complete Reference Grammar Provides a complete and clear explanation of every rule of structure. It is cross-referenced with and adds to the explanation in the conversational lesson footnotes. Bi-Lingual Dictionary Italian-English/English-Italian Dictionary contains all useful words and terms you need to know, so you can locate them easily.",
        "authors": "['Michael Cagno']",
        "infoLink": "http://books.google.com/books?id=Pw1ks4FqgAEC&dq=Conversational+Italian:+In+20+Lessons+(Cortina+Method)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am making the transition from Spanish to Italian and this book has been an indispensible resource. It includes conversational Italian, vocabulary, grammar, verb conjugations, etc. I haven't found a more complete tool yet!",
                "review/helpfulness": "20/25",
                "num_reviews": 25
            },
            {
                "review/text": "These Cortina books have probably the best phoenetic spellings of any text I have come across--far more accurate than Berlitz and others. If you do not have access to language cassettes to help you with pronunciation, this Cortina series is the next best thing.Unfortunately, the grammar and vocabulary are EXTREMELY outdated--particulary for the Italian course. Not only are the vocabulary and some of the spellings antiquated, but the verb forms are all presented in old literary Italian. NOBODY SPEAKS THIS WAY. Not only will your speech be outdated and clumsy, but you will not understand what Italians are saying to you, because so many of the words are no longer used at all.I have checked my opinions with native Italians--as well as professional translators--and all have told me that the Cortina books' vocabulary is old-fashioned even for the 1950's and 60's (which is when all of these editions were originally published. Check the copyright date.) Unfortunately, the other Cortina courses seem to be equally outdated (see Spanish in 20 Lessons customer review by P. Santiago, September 27, 2001).They are useful as review, because a veteran student will be able to recognise the outdated material, but I do not recommend these for the absolute beginner. For the novice, supplementary books are essential.I fear that the people writing rave reviews about these books have not yet actually field tested what they have learned. I felt the same, until I actually came into contact with the modern spoken word. These reviewers may find that they are not as well-prepared as they think.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I enjoy using this book because it is easy to understand and I am able to make up sentences and phrases of my own that I will use.The pronunciation of the words is clearly understandable... I have ordered a another copy for my sister...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the basic oxford picture dictionary englishspanish 2nd edition",
        "description": "A comprehensive, flexible, and up-to-date vocabulary reference and teaching tool for English language learning. The Oxford Picture Dictionary and its components create a highly teachable programme that can be used as a complete, four-skills beginning course, or as a language development supplement and practical reference. h4span style=\"font-size: smaller; color: #ff0000\"NEW /span Grammar Activity Book/h4",
        "authors": "['Renée Weiss', 'Jayme Adelson-Goldstein', 'Norma Shapiro']",
        "infoLink": "http://books.google.com/books?id=QWNUPgAACAAJ&dq=The+Basic+Oxford+Picture+Dictionary:+English/Spanish,+2nd+Edition&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This dictionary is very excellent for both the native spanish speaker who wants to learn english and native english speaker who wants to learn spanish. The pictures are well thought out and illustrate the meanings very effectively.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I got this book to aid in teaching English to Hispanics. There are a lot of good pictures and phrases that they will use in daily living. Great resource for vocab. I wish there were more phrases. I bought this one week on amazon when it was $4.99. Maybe the price will go down again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "business glossary englishportugueseportugueseenglish business glossaries",
        "description": "This is a must have dictionary for the office, business traveller or professional translator of English and Portuguese. It is an indispensable tool for those who work or travel in Portuguese-speaking countries. It is fully up-to-date for 2015 and complies with the latest, international Orthographic Agreement between Portuguese speaking countries. It is comprehensive and easy to consult with over 28,000 references, including terms and phrases used in banking, business and management, a glossary containing many definitions of terms and phrases, and a list of abbreviations. It also contains sections listing Brazilian, Portuguese, Angolan, Mozambican, Cape Verdean, Guinean and Sao Tomean government departments, institutions, organizations, conventions and agreements.\"",
        "authors": "['Victor Da Cal']",
        "infoLink": "http://books.google.com/books?id=IL0gjgEACAAJ&dq=Business+Glossary:+English-Portuguese/Portuguese-English+(Business+Glossaries)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My Portuguese was weak in financial and business terms. I found this small glossary helpful in almost everything that I needed. This book is great for general use, although a more specialized book may be necessary for particular areas of expertise (investment banking, for example). Whenever I need to use Portuguese business terms, this is the source I look to first.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The Glossary has a lot of tecnical terms, but it is a little bit poor in financial terms. It is good to someone who's learning english as foreign language or doing some business course. Is does not have especific terms about some subject like financial and accounts.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "turkish berlitz phrase book dictionary arabic turkish edition",
        "description": "Berlitz Phrasebook and Dictionary Turkish Compact, clear, and packed with key words and phrases to help conversation, this pocket-sized Turkish phrasebook and dictionary from Berlitz's trusted language experts (with free app) is a trusty travel companion, and all you need to make yourself understood - and to understand others - when you're out and about in Turkey. - With its emphasis on conversational usage, and up-to-date language on social media, leisure, business - and more - this is the only phrase book you'll need when exploring Turkey - Includes 3000-word bilingual dictionary - Visually appealing colour-coding system means you can find what you want, when you want, and fast - The simplified Berlitz pronunciation system will ensure you're clearly understood - Stunning colour photography enhances the expert content, and makes this series the most visually attractive phrase book on the market About Berlitz: Berlitz draws on years of travel and language expertise to bring you a wide range of travel and language products, including travel guides, maps, phrase books, language-learning courses, dictionaries and kids' language products.",
        "authors": "['APA Publications Limited']",
        "infoLink": "http://books.google.com/books?id=QujOzgEACAAJ&dq=Turkish+(Berlitz+Phrase+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "One book is never enough if you're trying to learn even a little Turkish! But phrase books are a good starting place, and this is a good little phrase book (though not my favorite) -- to carry around. It has a dictionary in the back, and is divided by category. Some seem a bit off -- in the socializing area there are invitations to go home with strangers (and a way to say no..but still...) Dining out, drinking, tourist areas, camping, even complaints are briefly covered.This book has details beyond what I hope I'll need in Turkey. Aside from the foods, it offers all the parts of an automobile (including a diagram of the inside of a car) and body parts (no diagram!).Interesting reading -- it has little bits of information that could be useful. Don't bother with the tape -- there are better ones offered (see other Turkish language book reviews!)",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I compared this phrasebook with the Lonely Planet Turkish phrasebook in the bookstores. Which one won? Berlitz is newer and had a fresher layout.For good focus on situational social communication, Berlitz spells it out pretty well. Phrasebooks aren't like dictionaries though--you need to spend some time reading it prior to going if you want to make it more useful.It's not as 'scholarly' as Barron's At A Glance and Vocabulary/Grammar books, but it does very well for just one travel language aid.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is kind of handy to have when traveling around in Turkey. It's color coded so it makes what your looking for easy to find. It's small so it can fit right in your pocket. There is a small dictionary in the back too. Useful.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the rough guide to dutch dictionary phrasebook rough guide phrasebooks",
        "description": "The Rough Guide Dutch Phrasebook is the definitive phrasebook to help you make the most of your time in The Netherlands. Whether you want to book a hotel room, ask what time the train leaves or buy a drink from the bar, this new phrasebook has a dictionary of over 5,000 words and will help you communicate with the locals in no time. The free audio downloads, recorded by native Dutch speakers, can be downloaded. They allow you to listen to the correct pronunciation of essential dialogues and are ideal for practicing before you go or while you're there. There's even a regional pronunciation guide and Rough Guide travel tips section, so wherever you are you can get around and speak the lingo. The Rough Guide Dutch Phrasebook has an extensive two-way dictionary packed with vocabulary and includes a helpful menu and drinks list reader, perfect for choosing the right dish in any restaurant. With this phrasebook you'll never run out of things to say! Make the most of your trip to The Netherlands with The Rough Guide Dutch Phrasebook.",
        "authors": "['Rough Guides']",
        "infoLink": "https://play.google.com/store/books/details?id=wHa0BgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book before going over to the Netherlands for a business trip. I found the book VERY confusing and VERY unusable. The pronunciation guide is very misleading. For example, it leads you to think that the &quot;n&quot; at the end of every word should be pronounced as &quot;u&quot; as in bus, which is totally untrue. The content is arranged in dictionary format, and is thus unhelpful at all for the beginner. I highly recommend AGAINST this book. BTW, most people in the Netherlands can understand and many can speak English, so if you go over there for a short stay, you don't need to learn Dutch at all.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Since I am a beginner in studying Dutch, I try every possible way to look for books and courses which are able to help myself improve my knowledge of the Netherlands. To know a country or a state or a nation, the best way is to understand what the people think, how the people lead their lives and the language they use. &quot;The Rough Guide to Dutch&quot; I think it is good for the beginners. It is a so-called &quot;dictionary phrasebook.&quot; you can get not only basic vocabulary and phrases but also daily life information. In my opinion, to choose the book is a good idea to help yourself. It is a pocket book that you can bring it to everywhere without any trouble. Everytime and everywhere you want to enlarge your vocabulary, it is at hand. It is full of basic &amp; daily vocabulary. The more you attempt, the more you earn!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I took a copy of this along with me on a trip to the Netherlands, primarily for assisting in understanding signs and menu items more than as a phrase book. Unless you plan to travel to very rural areas, you will have absolutely no problem getting along/around in NL. Just learning a few phrases of greeting, please/thanks, and goodbye (for courtesy's sake) is sufficient.A plus for providing some Dutch grammar basics, which might spark an interest in more in-depth study. A minus for an unnecessary section on vulgarisms. The translations of some phrases are a bit too &quot;interpretive&quot; for my taste, some of the translations could be a bit more literal (or provide a literal meaning of the Dutch phrase). The pronunciation guide is not completely accurate, either.If you're just heading to the Netherlands or Belgium on a brief holiday, you really won't *need* a phrase book. A waiter will be happy to decipher the menu for you if it is not multi-lingual. You won't really need to know the road signs unless you're driving (and with the excellent public transportation system and bicycle paths/lanes, you probably won't). And if you're seriously interested in learning Dutch, it won't offer you anything you can't learn in a more substantial book.Save the money, and put it toward your Lonely Planet guidebook.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "conversational spanish in 20 lessons cortina method",
        "description": "Step By Step, these twenty lessons, with charming and helpful illustrations, will enable you, regardless of previous language training, to read, write and speak Spanish in the shortest possible time. The Cortina Method has been time-tested and is the quick, easy and natural way to learn a language. It has received the approval of teachers, students, schools, colleges and business firms all over the world. Guide To Pronunciation And Spelling Explains how to pronounce the sounds, words and phrases of the language through simple phonetic symbols based on English spelling. Rules of spelling are also explained. Twenty Conversational Lessons These lessons include useful vocabularies and everyday conversations. Alongside of each word and sentence is given the correct pronunciation and English translation. Easy-to-understand grammatical footnotes are combined in this Method to make your language study effective and interesting. Complete Reference Grammar Provides a complete and clear explanation of every rule of structure. It is cross-referenced with and adds to the explanation in the conversational lesson footnotes. Bi-Lingual Dictionary Spanish-English/English-Spanish Dictionary contains all useful words and terms you need to know, so you can locate them easily. Over 2,500,000 Cortina Method language books have been sold.",
        "authors": "['R. Diez De La Cortina']",
        "infoLink": "http://books.google.com/books?id=5J3CihX9_L0C&dq=Conversational+Spanish+in+20+Lessons+(Cortina+method)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "this book is a good resource in despite of my rating. however, it is a good resource only for someone with previous knowledge of spanish. the final chapters are literature excerpts, but contain no translation which i would find frustrating if i were a novice.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "If you want a good grammar reference, this is the book. However, the text is old. There are several vocabulary items that reveal the original age in which the course was written (1882). For example, in the travel chapter, it has the Spanish word el vapor, steamship. Hey, we don't even call them by that term in English!Also, the pronunciation guide is for the Madrid dialect only, with no variation for Latin America. Sr. Cortina had a good idea in 1882, but the methods and language have changed over the last 120 years. Perhaps the publishers should consider either updating the material or taking this one out of print.By the way, I am a Spanish teacher who was looking for a simple conversational book for adults with little or no background. Needless to say, I had to do a lot to supplement this text.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "dari darienglish englishdari dictionary phrasebook hippocrene dictionary phrasebooks",
        "description": "Compiled by a linguist specializing in the region, this two-way pocket dictionary and phrasebook offers a map of Afghanistan; information useful for relief workers, business people, and travelers; and a concise grammar, pronunciation guide, and alphabet for one of the country's official languages.",
        "authors": "['Nicholas Awde', 'Asmetullah Sarwam']",
        "infoLink": "http://books.google.nl/books?id=fEXh5Z11lUMC&dq=Dari:+Dari-English+English-Dari+Dictionary&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "It's easier to be a critic than an author; much easier in the case of \"Dari Dictionary & Phrasebook.\" An internet search on \"Nicholas Awad\" introduces a true polyglot, from Hausa to Armenian, and it appears from the content of this work that Awad and his collaborators have a mastery of classical Persian -- and a very quirky understanding of Afghan Dari. It's an excellent phrase book, but many of the Dari terms used would raise eyebrows from Mazar to Kabul. If you don't mind occasionally being in the position of a guy walking into a biker bar and saying, \"Ho, good innkeeper, willst thou draw me a draught of your finest ale?\", this book provides an interesting, and indeed useful, introduction to Dari. Provided the barman gets beyond your initial, \"Ho . . .\" The pronounciations sometimes follow the Iranian more than the Afghan model, many of the words use the Iranian rather than the Afghan varient (q.y., beer, strawberry), many of the phrases are far more flowery than commonly used, and the pronunciation guide and the verb forms used -- well, an additional expression that could well have been used in the book is \"be-resh\" which literally means \"beardless\" but the metaphorical meaning transcends \"campy.\" Go ahead and buy this book if you are heading toward Afghanistan; your ear will quickly atune you to the pronunciation and verb forms commonly used. Think of Dari as probably the easiest language for a native English speaker to learn, perhaps the second easiest after Malay, study the book, and be confident in your conversation with Afghans. Most of them are pretty forgiving in matters of language.",
                "review/helpfulness": "71/72",
                "num_reviews": 72
            },
            {
                "review/text": "This is an excellant book for travel. The book gives you common pharses used for every day conversation and also an english to dari or dari to english dictionary.It even has a special section for pharses used by aid workers.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "As somebody who has not yet begun to seriously study Dari, I have found this to be a very helpful companion. It has helped me unravel the Dari words and phrases used in guide books and travelogues on Afghanistan, and the short guide to Afghan history is concise yet insightful.The \"Very Basic Grammar\" and \"Pronunciation Guide\" provide key building blocks to understanding and speaking the language. The dictionary, at 87 pages, is by no means comprehensive, but covers simple vocabulary beginners need to know. And the phrase book pulls together basic words and phrases for a myriad of situations one is likely to face as a tourist in Afghanistan.All in all, not bad for a book of a little more than 200 pages that can fit in your back pocket.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was quite useful. The only complaint I have is that the terms that are given, some are extremely proper. Which I guess is better than being too informal but you get some funny looks sometimes when you are having a casual conversation. Overall its a great book and I would recommend it to anyone that is traveling to Afghanistan or anyone that wants to learn this language.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "hindienglishenglishhindi dictionary and phrasebook",
        "description": "Includes over 3,400 Hindi-English/ English-Hindi dictionary entries and a handy phrasebook that covers transportation, dining, shopping, and more. Ideal for tourists, students, and business travelers.",
        "authors": "['Todd Scudiere']",
        "infoLink": "http://books.google.com/books?id=MqVQKdKuIVoC&dq=Hindi-English/English-Hindi+Dictionary+and+Phrasebook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I went to the same University of Wisconsin India program that Todd Scudiere graduated from, so I can attest to the quality of his prior training.I think this is a great pocket Hindi reference, but no substitute for proper language training. The vocabulary and phrase collections are very good and accompanied by devanagari script and Roman transliteration. I am currently using the book to develop a set of Hindi flashcards.To go further than this you will need the Oxford Hindi-English-Hindi dictionaries and a good course such as \"Colloquial Hindi: The Complete Course for Beginners (Colloquial Series).\" It is really tough learning how to make some of the consonant sounds just from a book or CD.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a great book. It has many useful entries with helpful phrases for a tourist as well as a brief covering of basic grammar points. Also it contains a dictionary with over 3,000 entries. These are in English-Hindi and Hindi-English and do include the transliteration in alphabetical order based on the English alphabet. This is VERY helpful for a learner. One thing I might mention though, and what is keeping me from giving this 5 stars is the fact that when I looked up a simple word just to see how the dictionary was, I was shocked to discover that there was no word for friend. Not \"mitr\" or \"dost\" nor was the word \"friend\" listed in the English-Hindi section. This I found to be rather peculiar. That is a very common word which one would think would be included. Overall though, I would suggest getting this book. There are plenty of other useful entries and helpful little tidbits that a tourist or someone learning the language could make use of, even if you won't know how to call someone friend :p",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I bought this item for my new student from India to use on class assignments. He actually spends his time reading it as well and is learning English in leaps and bounds.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This review is a warning for a person, who wants to learn Hindi for more than a short tourist trip. All its sections are too basic, and could be printed in a much smaller book -- on average, it contains 7 expressions per page. And its only advantage is very good print quality.\"Say it in Hindi\" is a much better option in terms of expressions and vocabulary. The only its disadvantage is small and unclear font. And H-E/E-H dictionary by Rupert Snell is a much better alternative for a dictionary, grammar, and the word use (included in many entries of the E-H part).If someone needs this book, I gladly give it away.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I accidentally put the review for the other book I purchased here. (See below). I'll leave it for comparison. The Scudiere dictionary/phrasebook is the only inexpensive source I have found that has romanized Hindi, obviating the need for learning devanagari script. (I simply don't have the time to learn the script.) It could be better; there are many words the author could have chosen rather than using space to say that \"condom\" is \"kondom\" in Hindi. Still, it has advantages over the Dover book.The \"Say It In\" series from Dover is a known product - most I have used are somewhat dated, without up-to-date expressions for new ideas. But they offer good windows on their target languages, good for comparison to other language sources and for carrying in your travel pack. This one appears to be no exception. I am well satisfied with the purchase and with service from the seller.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a wonderful product for people beginning to learn the language of Hindi. The shipping and delivery was excellent. I am not a beginner but was looking for a Hindi English dictionary to expand my vocabulary and be on my to becoming fluent, unfortunately this dictionary doesn't have much in it so it wasn't a big help to me. I recommend this for absolute beginners only, otherwise look for something with a bit more substance. It is a good product, but I would suggest the seller put more information regarding its size and the lower skill level it is meant for. If I had known more about it, I wouldn't have bought it. Despite of of this, the product is still wonderful for beginners.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "somalienglishenglishsomali dictionary phrasebook hippocrene dictionary phrasebook",
        "description": "This book is very helpful for travelers to Somalia. Included in the book are vocabulary sections, a phrasebook, pronunciation, and a brief outline of the language's grammar rules and information on local culture.",
        "authors": "['Nicholas Awde', 'C. Quadir', 'Martin Orwin', 'Cabdulqaadir Xaaji Cali Xaaji Axmed']",
        "infoLink": "http://books.google.nl/books?id=4ADKFWu2rwcC&dq=Somali-English/English-Somali+Dictionary&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I purchased this small book for a refugee I am sponsering from Somalia. He was very excited to get this book and told me this is an excellent reference he can keep with him in his pocket while he is learning english and starting to work in america.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I'm learning Somali in order to better communicate with recently arrived refugees in the US, most of whom are from southern Somalia. Many of the entries in this dictionary are words used in the north of Somalia and are not understood by many from the south. People from Mogadishu, Kismayo, Jilib, and Galkaayo have told me this. That said, I have found the dictionary to be useful at times and is just about the only printed Somali-English/Eng-Som dictionary I have found.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "As an English teacher for Somali refugees this has been of great help. It doesn't always have all the words that we use in the US, but it does help me get the message accross. It has also has helped me understand their problems without having to always go to an interperter. It has alowed me to teach some difficult concepts when you are only panamiming. The students have really enjoyed me learnign their language. It gets me close enough to the correct pronunciation that they can correct me.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Of course, when I bought this dictionary, there were no others on the market at all. There are still only a few Somali language resources, but this one packs a punch. For a small book (176 pages), it covers a lot of ground. The first 80 pages are straight dictionary pages. (English to Somali and Somali to English). The remaining pages are organized like a phrase book, ordered by category. The book also covers how to read and pronounce Somali. (Though it's written in Roman characters, there are some pronunciation guidelines, like Pinyin for Mandarin).I'm just a Somali language enthusiast and not fluent by any stretch, but this book is great. I've worked with and been around a lot of Somalis (in the Minneapolis area) and they are always shocked and thrilled to encounter a non-Somali speaking Somali.I bought two copies of this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I work with children from all over the world, and I've encountered many speakers of Somali. They love that I'm attempting to speak their language, and I've been told this is the very same book that some parents are using to improve their English. It's extremely useful, but the pronunciation guide is a little cryptic, and it lacks the international phonetic spelling. That would be a 5-star improvement, but I'm giving it 4 stars because it's a great introduction to the Somali language, and I'm learning. Thanks for reading.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "creole made easy",
        "description": "Two CD set pronunciation practice guide accompanies the book Creole Made Easy. Ideal for students of the Creole language, newcomers, and visitors to Haiti. The CD set covers: How to pronounce Creole letters and words, the basic elements of Creole grammar, sixteen easy 15-20 minute lessons, and easy practice exercises in English with Creole translation. The Creole words and sentences in each of the sixteen lessons of the book Creole Made Easy are spoken so that the student may listen and practice. The Creole words and phrases are first spoken slowly and deliberately for maximum pronunciation emphasis. They are then repeated at a slow speaking pace with slight inflection for better contextual practice.",
        "authors": "['Wally Turnbull']",
        "infoLink": "http://books.google.nl/books?id=tBqNPAAACAAJ&dq=Creole+Made+Easy&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is not appropriate for learning Haitian Kreyol on your own - it's some way between a phrase book and a useful reference on the more important grammar. What's really good about it is the glossary, more like a small dictionary, which is more than enough for most everyday purposes, including a little on computers etc.I'd say this book is best for someone visiting Haiti for more than a holiday and ready to put in more work - useful for phrases/terms and explanation when faced with a grammatical construct not obvious from listening.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "I am a student of Haitian Creole, and I found this book to be an excellent supplement to a course or other methods of study. It has an extensive glossary and easy to follow lessons. The only thing is book is missing is a phonetic pronounciation key. Other than that, this book will definitely help beginning speakers of this language.",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "&quot;Creole Made Easy&quot; gives the reader every day words and sentences. I keep this book with me while at work either in the office or field in order to get a better understanding of what is happening around me. It gives you a base that you can start to &quot;speak creole&quot; the same day you pick it up.However by learning these simple 16 steps and using them each day in some sort of converstion with the Haitian people, you can start to pick up on the meanings and uses that each word has. For example, most commonly used to refer to a person, place, or it, is li. This is spelled out and used in the first lesson.I will say that one of the most important thing to remember to learn is tann isit, wait here, this will help you out when you want your cab (top-top), to wait for you while you are either shopping or asking information.The dictionary in back of the book helps to explain different words and give you an idea of the English to Creole-Creole to English explaination.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I found this a very useful book to get an idea what Creole is all about. It is short and simple and each chapter makes you more eager to go on to the next. I had the advantage to have learned French in school. Without that I imagine it can be difficult to get an idea how the Creole words should be pronounced. A simple audio tape in addition to the textbook would be most welcome indeed.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Great book. A lot is covered in the 16 lessons, nice exercises to practice. The dictionary at the back is quite extensive and covers most of the words that I've wanted to look up, including some basic medical terms that I found lacking in other small dictionaries.If you get the pronounciation guide as well, you won't have spent much and you will be much further along in your quest to learn creole. I rarely have to call for a translator now when dealing with my patients.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I recently took a trip to Haiti, and in preparation for the trip I used the Creole Made Easy materials, including the Pronunciation Guide cd, and the Workbook. I used all three of them together, so I'll review them together as well.Creole Made Easy is an excellent introduction to the Haitian Creole language. It provides the basic building blocks in terms of grammar and sentence structure from which to go further. This book is not an \"emergency Creole\" book, and didn't have anything by way of greetings, phrases to use while traveling, etc. Being in Haiti, those things were very easy to pick up, especially with some of the basic grammar under my belt. The Workbook is split into two sections, the first with exercises that correspond to each of the 16 lessons in Creole Made Easy. The second half of the workbook has more practical lessons like: numbers/time, months/days/seasons/weather, colors, family/friends, marketplace/food, around the house, and health and medicine. Indispensable to learning any foreign language is listening to it, and the Pronunciation Guide cd was excellent in that regard. I found that it was great practice for listening to the native speakers (though even then, I was listening too slowly most of the time) and great for understanding how to pronounce all of those nasal sounds. There were a couple of moments of frustration in using Creole Made Easy: there were a couple of misspellings; sometimes a word or phrase was used seemingly out of nowhere and wasn't listed in the mini-dictionary in the back of the book; a couple times a grammatical structure or phrasing was used and I had no idea why it was used that way, and it wasn't explained. This happened very few times, and can sometimes be a good problem-solving exercise that you need good practice for when trying to have actual conversations with Haitian people.Of the eight people who went with me on my trip to Haiti, I was one of two who used Creole Made Easy, and the only one who completed all 16 lessons. I think some of the others used the Pimsleur cds (not any books). I was by far the best Creole speaker/listener and felt like I was in a perfect position to learn exponentially more while I was there. I was told over and over again \"ou pale Creole byen!\" (\"you speak Creole well!\") which I shrugged off for awhile until it began to sink in that this was true. Also, I wish I would have brought Creole Made Easy along with me instead of the Hippocrene Haitian Creole/English dictionary, because I think the dictionary in the back had a better selection of words and phrases I wanted to say. The Hippocrene has no phrases at all, and often didn't have the words I was looking for. All this said, I would strongly recommend the Creole Made Easy materials to anyone interested in learning Haitian Creole.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have taken a face to face course in Haitian Kreyol and this book was an excellent supplement to it. Anyone could use this book and learn to speak Kreyol quickly. The glossary is in depth and includes all the most often used words and the lessons are easy to follow and do.An excellent book!!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "It is the only Haitian Creole translation book that I have found which makes sense of this difficult language. I would recomend to anyone who wants to learn casual Creole in preparation for travel to Haiti or while there.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I just purchased the new edition of Creole Made Easy by Wally Turnbull. I must congratulate him for a job well done. The extensive dictionary is super and certainly long overdue for speaking Creole as a second language. I was tutored in Creole with the old 1945 book, the only one available when my husband and I went to Haiti 15 years ago. It is my humble recommendation that all new non-Creole speaking missionaries MUST have this book to get started on their road to learning the language. Bravo!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Haitian Creole is a fun language, especially if you know French and can see the correspondences. However, you'd be best served getting the entire package - this book plus the CD and the workbook. The workbook provides an excellent expansion on the meager detail in the book. No where does any of the books provide a section on greetings - these have to be gleaned from the dialogues (Bonjou, etc.). I guess that's what the Hippocrene phrasebook is for. Otherwise, it's a fun set of books that will give you the base you'll need if going to Haiti (or Miami) and want to start communicating in Kreyol.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "danish compact learn to speak and understand danish with pimsleur language programs",
        "description": "Beginner's Danish offers basic language instruction in the national language of Denmark, presenting grammar, vocabulary, and common phrases in clear, concise lessons. Perfect for both classroom and independent students, each of the 13 lessons opens with dialogues on topics such as greetings, family, athletics, dining, illness, holidays and celebrations. Following the dialogues are vocabulary lists, explanations of grammar, and exercises. Two audio CDs accompany the lessons, providing correct pronunciation of all the vocabulary and a selection of the dialogues, with pauses for repetition by the student. Also included are an exercise key, Danish-English and English-Danish glossaries, as well as an introduction to Danish history and culture.",
        "authors": "['Nete Schmidt']",
        "infoLink": "http://books.google.com/books?id=86GneiJS4Z8C&dq=Danish,+Compact:+Learn+to+Speak+and+Understand+Danish+with+Pimsleur+Language+Programs&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Unless you are incredibly terrible with languages do not waste your money on this. It will not teach you anything very useful. You end up learning about 20 very basic phrases that are not so flexible in various situations. I recommend borrowing it from the library as a first step, to get used to danish pronunciation and purchase Bente Elsworth's Teach Yourself Danish.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "I bought this CD set because I am going to Denmark soon, and I wanted to be able to at least ask where the bathroom was.... :)My mom (who is a Danish national) said that my pronunciation is great - I guess that's because I have listened to each lesson at least twice... so far anyway... It helps to have her, so I can see how her mouth is formed during words, because SOME of the Danish words I couldn't quite make out - that's why I only gave it 4 stars... well, that and the fact that people were looking at me crazy when I was sitting at traffic lights, repeating phrases... ;)",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "This was my first Pimsleur course. It is remarkable how well it teaches you a spoken language - all of which you can do in your car. Because they are constantly asking you how to put together words and phrases that you know, they reinforce what you have learned and force you to invent new combinations. Very effective. Unfortunately there isn't a longer version of this available. It is just 10 lessons.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have used the Pimsleur method for learning Spanish, and it was a good start, along with Learn Spanish in Your Car (CD plus booklet) and some grammar. But this Danish course is extremelyl frustrating. First, a huge amount of time is wasted with the annoying \"Ask; try to say; now try to say; try to say the answer\" etc. etc. praompts. Also, all of these English prompts distract from the Danish. In teh Spanish Pimsleur tapes the prompt \"listen and repeat\" is in Spanish. In Danish, nohting useful is in Danish, it is all in Engliah. To the extent that prompts are necessary (and generally they are totally unnec) they interject English into your head when you are trying to learn Danish. Worse, however, is the pedagogical approach. I don't actually see any approach in terms of content. The lessons jump around from one topic to the next and make absolutely no use of the idea of learning patterns. Anew word is introduced, and instead of practicing it you are prompted \" NOw, aske where Michael Brygge Street is.\" Really ? Why? Aren't we learning the use of \"also\"? The scriptwriters seem to have no ability to focus on one learning task and present it in such a way that you learn it. Another problem is that the pronunciation issues are not clearly dealt with---yet pronunication is probably the biggest challenge for anyone learning Danish. Pronunciations differ for the same word, sometimes from one example to the very next (e.g., \"gade\" in \"reading\" exercise for unit 5). And what's with the way these are \"reading\" exercises are designed? We don't need a prompt: \"now try to read the next word.\" We need to hear the next word, and other words with similar pronunciation patterns. And why must we hear the names of two streets in C'hagen repeatedly? Two streets with complicated names? Why not teach the pattern for \"Where is ...?\" with a number of useful completions, such as \"the post office?\" \"the bank?\" the bus?\" etc. Very irritating, pedagogically weak, and a big waste of time, aside from the few phrases that you might be able to take away from this. Such as \"No thank you.\"",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "The Pimsleur Danish course is an extremely useful way to learn Danish. I have been going through the lessons every day and it's amazing how quickly you can pick up the language. As reported here on other reviews there are some limits, it would be nice for the book to have the lessons written out as well so you can read what you are saying. This would help with the the differences in little things like Jeg Ved and Jeg Vil.Also the course is only 10 units long and as such is enough to give you excellent practice in the first steps of learning but only a limited vocabulary and not many useful first phrases. It would be great if Pimsleur would extend this course into the full Phase 1 plus Phase 2-3&4 like other languages.I highly recommend getting this course as an introduction to the Danish language. You will get a lot more benefit out of it if used in conjunction with a Danish dictionary. I contacted them about extending the course and they said it will happen but in time. If it was more popular then it would happen sooner. So if you want a longer course then go the the Pimsleur home page and send them a request. They will listen if enough people want it.All up I give it 4 stars because it is limited in its scope and could use a better learning booklet.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the big book of beastly mispronunciations the complete opinionated guide for the careful speaker",
        "description": "This guide to the most commonly mispronounced words in the English language is revised and expanded with one hundred new entries including words like al-Qaeda, machismo, curriculum vitae, and Pulitzer.",
        "authors": "['Charles Harrington Elster']",
        "infoLink": "http://books.google.nl/books?id=YtojrMr0Ft4C&dq=The+Big+Book+of+Beastly+Mispronunciations+:+The+Complete+Opinionated+Guide+for+the+Careful+Speaker&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Read in the proper spirit, this is an absolutely hysterical book (in whatever sense of \"hysterical\" one choses). Elster's methodology is simple enough: for any given word he defers to dictionaries and pronunciation guides from the first half of the 20th century. Works from the 19th century are cited if they support his conclusion and ignored if they do not. Works from the second half of the 20th century are cited, either to support his conclusion or to decry the corruption of the language.So far this is fairly uninteresting. The reader could simply buy an old dictionary from a used book store and get the same information. The humor comes from the justifications Elster presents. Is his favored pronunciation used by most educated people? That proves his point! Is it used by virtually no one? That proves the need for this book! If he favors an anglicized pronunciation of a borrowed word, well, we are speaking English and the foreign pronunciation is pretentious. If he favors the foreign pronunciation then only ignorant buffoons anglicize it! If a word is used in print more than in speech, and many readers phonetically (mis)pronounce it, he will chastise them for not checking in a dictionary. This is often followed by the information that the unapproved pronunciation in fact occurs in modern dictionaries. Apparently we are being chastised for not checking an *old* dictionary.Best of all are those instances where it is his ox being gored. These are rare. Ordinarily his devotion to authority is slavish. But the few occasions are worth the search. He will go on for pages explaining how on this occasion the authorities are wrong and that in this rare case the pronunciation used by everyone (read: Elster himself) is correct. Check out his discussion of \"modem\" for a good example.If you want a guide for pronunciation, buy a good dictionary. If you want a treasure trove of humorous bathroom reading, this is for you!",
                "review/helpfulness": "49/59",
                "num_reviews": 59
            },
            {
                "review/text": "[...]. the author's rules are, indeed, entirely arbitrary.simply performing a mental utterance of many of his \"proper\" pronunciations affected me as strongly as a fingernail on a blackboard.i take particular exception to his endorsement of the mutilation of the many japanese words that have found their way into our vocabulary.for the most part, our alphabet is capable of approximating japanese words. as in spanish borrowed words, where one shouldn't be expected to trill the \"r\", (i loved the reference to the saturday night live sketch with jimmy smits!) the pronunciation can be anglicized, but i don't understand his endorsement -- and sometimes origination -- of whimsically swapping out entire syllables.i can guess what he considers to be the correct pronunciations of \"tokyo\" and \"kyoto\". but i assure you, each of these words have TWO syllables -- not THREE, not FIVE.additionally, (and i may be in a minority here) i'm bothered by his overweening love of the schwa, with which he replaces almost every instance of a short vowel in an unstressed syllable, thus endorsing an inarticulate mush-mouthed uh-mur-uh-cun-uh-zay-shun of the language and his erratic syllable division greatly reduces the already shrinking list of words which have etymologically sound pronunciations.",
                "review/helpfulness": "32/53",
                "num_reviews": 53
            },
            {
                "review/text": "If you've been looking for a book that will teach you to be a complete drag about pronunciation, look no further. Elster's extremely prescriptivist point of view is very straightforward: there are correct pronunciations, and there are &quot;beastly&quot; pronunciations. Anyone who uses one of the latter is a clod. If you pronounce certain words of foreign origin with too much of their original flavor, you are pseudo-sophisticated; if you pronounce others with too much Anglicization, you are illiterate. If you drop certain syllables through syncope, you are a lazy speaker; if you include others, you are over-nice. In short, the only way to be a careful speaker is to pronounce one's words exactly as Elster does.It's perfectly appropriate for a pronunciation guide to be firm in its opinions. What's not appropriate is for those opinions to be capricious, and defended with extreme violence. To read this book is to wade through a torrent of bile and abuse. Lest you think I exaggerate, here are a couple of samples: &quot;... the next time you pay a visit to the monkey house at your local zoo you are sure to hear Joe and Jane Average and their unexceptional kids say ur-RANG-uh-TANG.&quot; &quot;The imbroglio ... over *bulimia* and *bulimic* proves yet again that human stupidity is rampant at *all* levels of speech, from the most ignorant, beastly mispronouncer to the most erudite, self-important egghead. What is wrong with everybody, anyway? Is the word really so hard to pronounce properly?&quot;On the plus side, most of his pronunciations are perfectly reasonable (i.e., the same ones I use, or, from time to time, genuinely better). If, though, like me, you spent a few formative years in the UK, you'll get a bit tired of hearing your perfectly natural pronunciations derided as &quot;affected&quot; (a particularly amusing insult coming from one who says DES-pic-a-ble, gri-MACE, and pro-MUL-gate). Elster has no use for the language except as a weapon, and he assumes everyone chooses their pronunciations either out of a desire to impress or a lazy denial thereof; regional variations, and those due to personal history, get no slack from him.In short, there's no reason to put up with Elster's attitude when a dictionary will suffice.",
                "review/helpfulness": "23/30",
                "num_reviews": 30
            },
            {
                "review/text": "Elster could be a blow-hard. He could be a nauseating pedant. Instead, he's the charmingly gnomish author of this magnificently entertaining book. Like many of us, he had a mother who would pin his ears to the wall if he dared confuse who with whom. And this guy's mom knew that &quot;flaccid&quot; is pronounced &quot;Flak-sid&quot;, did you? Or how's this: try ordering a &quot;daiquiri&quot; (Dy-kuh-ree). Good luck; but of course you'll be correct. This very BIG book of &quot;beastly&quot; mispronunciations is gleefully entertaining. You won't just get the correct pronunciations, but concise reasoning on why a word crept into the language, why it should be tossed out, who corrupted it, and why we tend to garble nuclear (N(Y)oo-kle-ur), while clinging to the &quot;psuedo-French&quot;- ified envelope (AHN-vul-lohp). This could be nothing more than a pesky book, but Elster is so passionate about the Language, and so wildly fun that it's just great reading-- if not terminally humbling. Three distinct groups deserve this gift: Post-modernists who will turn away in horror (then read it on the sly), people who speak English, and those who find in words the delicate beauty of a very good opera-- when sung correctly.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "I couldn't disagree more with the first reviewer from San Fran. Few disagree with standards for spelling, grammar, or definitions; why should pronunciation be any different? I don't agree with all of Elster's prescriptions, (yes, it is prescriptive-- is Webster's not?) but he gives well-presented reasons for all of his conclusions and admits when he's just being arbitrary. Just like bad spelling, improper speaking does and should separate the careful from the cloddish. The author openly says the book is intended as a guide to American pronunciation, so Brits and Cans need not be offended (e.g. it doesn't necessarily matter how Newfoundlanders pronounce Newfoundland-- they don't speak American English). Of course for those of the, &quot;make a mistake often enough and it becomes correct&quot; school of thought, it will be of no use.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "The book is quite enjoyable, but ought not to be taken too seriously. There is one major error, though. His suggested pronunciations for the word &quot;Newfoundland&quot; are simply wrong. I should know. I'm a Newfoundlander. No-one in Newfoundland would use either pronunciation given in the book. His suggestion 'N(Y)OO-fun(d)-lund' marks anyone who uses it as American. We tend to regard it with polite exasperation. We are not a part of the United States and don't really expect Americans to be able to pronounce it properly. The other suggestion: n(y)oo-FOUND-lund is even worse. It marks you as Canadian and is likely to produce hoots of derision if you use it in earshot of a Newfoundlander. What is the proper pronunciation? It rhymes with &quot;understand.&quot; nyoo-fund-LAND. Sometimes there is slight secondary stress on the first syllable. When referring to the dog, the main stress is on the word DOG, with approximately equal secondary stresses on the first and third syllables of Newfoundland. Never, ever is it pronounced Nyoo-FOUND-lund!",
                "review/helpfulness": "20/23",
                "num_reviews": 23
            },
            {
                "review/text": "I found myself roaring with laughter one minute, with chagrin the next, and occasionally rage. Some of his favorite pronunciations I would wager have never been heard, nor spoken, west of the Mississippi. On the other hand, his preference for trauma (trawma rather than trowma) made me a friend for life. By condemning nu-cu-lar and sim-u-lar, two abominations used repeatedly by my inlaws, he gave release to thirty years of frustration that I could not afford to vent.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "Admit it: from time to time, we all like to use a ten dollar word to demonstrate our mastery of the English language. As President W. Bush can attest, however, nothing's more embarrassing at such moments than discovering you've just mispronounced the word.To our rescue comes Charles Harrington Elster, an expert in the ways of saying words correctly. In &quot;The Big Book of Beastly Mispronunciations,&quot; he provides not only an almost exhaustive list of frequently mispronounced words, but clear and entertaining explanations and arguments of why his pronunciation is correct.Elster has carefully researched each word, providing evidence from dictionaries, usage in broadcast media, and historical linguistics to explain why a word ought to be said in a certain way.Elster is someone who cares about the English language. The role of language is to communicate, and communication is impossible if we cannot understand one another. Thus, common pronunciation of words is significant.On the whole, Elster prefers pronunciations that have history and permanence. Many arguments for words I thought I'd been saying all along were clearly presented with his preferred pronunciation in my dictionary. He does concede in some cases that a common mispronunciation of a word has become correct, by sheer weight of usage. He also is careful to note pronunciations that differ between British and American English. He also provides the correct pronunciation of some names and places.As someone who shares Elster's love of the language, I recommend this book highly. It's one of my most-used reference books, and not just because it's stored in the guest bathroom.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "If you care about how you sound and the way you come across to other people, you'll want this book. It's a reference you'll want in whatever room you're in. You'll discover everyday words that are being mispronounced by newscasters and, more likely, by you. At least I did. And I'm a writer who prides herself on knowing words well! This book is for the American. It gives American pronounciation that is accepted by the educated class. It disdains words that are used for effect. And if a word is right in the UK but not America it will tell you so. Words like Missouri, Vase, the days of the week, yesterday, rather, begin and hundreds more are explained. You will learn the background on the usage. You will learn how to correctly pronounce February. Now that's a challenge! This is a terrific book and I highly recommend it. If I could give it more than five stars I would! Buy it!!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I opened this book first to the entry &quot;pronounciation&quot;. The author wondered if I said it this way (I did). He then pointed out that there was no such word! Egad, he caught me! Although there is a word &quot;pronounce&quot;, there is no word &quot;pronounciation&quot;. The word is proNUNciation, not proNOUNciation. I suppose this could be considered a trivial difference, and many of the pronunciations in this book are somewhat of this nature. But the book is a quick read and always interesting. I for one found I was making many of these type mistakes.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "say it in yiddish",
        "description": "You don't have to be Jewish to get back at the shmendriks* of the world Yiddish. It's the most colorful language in the history of mankind. What other language gives you a whole dictionary of ways to tell someone to drop dead? That schmuck who got promoted over you? Meigulgl zol er vern in a henglaykhter, by tog zol er hengen, un by nakht zol er brenen. (He should be transformed into a chandelier, to hang by day and to burn by night.) That soccer mom kibitzing on her cell phone and tying up traffic? Shteyner zol zi hobn, nit keyn kinder. (She should have stones and not children.) If You Can't Say Anything Nice, Say It in Yiddish is the perfect glossary of Yiddish insults and curses, from the short and sweet to the whole megillah (Khasene hobn zol er mit di malekh hamoves tokhter: He should marry the daughter of the Angel of Death.) Complete with hundreds of the most creative insults for the putzes** and kvetchers *** of the world, this is an indispensable guide for Jews and Gentiles alike. When it comes to cursing someone who sorely needs it, may you never be at a loss for words again. *Idiots **More idiots ***Complainer; a pain in the tuchas**** **** One's rear end",
        "authors": "['Lita Epstein']",
        "infoLink": "https://play.google.com/store/books/details?id=EWYjH_sCgPcC&source=gbs_api",
        "review": [
            {
                "review/text": "This book is extremely useful for anyone who wants to learn Yiddish. It is filled with just about every phrase you could possibly think of, and even has an index of every single word in the whole book, which comes in very useful. It has not only phrases, but also lots of popular single words (such as east, west, good, bad, etc.). One thing that I really liked about it is that it uses the Yiddish alphabet, instead of that stupid romanization that you see in every other modern Yiddish book. For people who can't read the Yiddish alphabet, it has a very nice guide to all of the sounds and names of the Yiddish letters. It unfortunately doesn't contain a thing about grammar or gender of nouns or using verbs, but just the same, this book is extremely useful for the Yiddish learner. I personally think that it is the best book that you will ever find for it's low cost. I would recommend it to anyone of any age that wants to learn Yiddish.",
                "review/helpfulness": "52/53",
                "num_reviews": 53
            },
            {
                "review/text": "After reading the reviews, I wrongly assumed that this was a book that had a number of humorous phrases in Yiddish. If had known what it really was, I would not have ordered it. I might be the only person on earth that had this mis-conception, however.Regardless, this is a handly little book. The book is tiny and designed to fit in a shirt pocket, hence the tiny price.There is an index of words and there are major sections such as \"parts of the body\" and \"business\" and \"restaurant\" vocabulary.The book is very business like and it is apparent that it is intended to be an easy-to-access phrase book for folks new to Israel or any area with a large Yiddish-speaking population.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "There aren't many places left in the world where Yiddish is the primary language; exactly why there would be a travel-phrase book like this one is a little bit perplexing to me. Of course, it was published decades ago, and apparently hasn't been reprinted since, so used copies are the way to acquire this little gem. It is organised in the typical fashion on any travel phrase book - basic expressions; greetings and general social conversation; travel expressions concerning hotels, boats, airlines, etc.; useful words about the house; sports, school, professions; and, of course, caf&eacute; and restaurant information. There are also sections for numbers, dates, seasons, and the like.As the introduction states, whenever Yiddish is spoken, it is usually through the lens of dialects - Yiddish not having a solid geographic home in terms of major national or primary language support, the language is (for all its 'traditional' aspects) a rather fluid thing. Yiddish is, unlike English and more like German, fairly consistent in spelling and pronunciation, so once the basic pattern of pronunciation of letters is mastered, the speech is relatively simple to engage. Yiddish has strong Germanic tones despite being written in the Hebrew (Aramaic) script - this phrase book incorporates the original script as well as transliterated pronunciation. Yiddish, like Hebrew, is written and read right to left, but the transliterations are put in left-to-right for ease of English speakers.Yiddish has had a good deal of influence in English through popular use, entertainment and literature, as well as some business and marketplace uses. Yiddish is becoming more popular in recent years, including being used in schools in some parts of North America as an important secondary language.This is a phrase book, not a grammar. It shows the rudiments of pronunciation and provides handy access to ready-made phrases, but does not develop ideas of grammar and syntax, nor does it have any background of history or sociology - like a travel phrase book, it consists of pages of phrases grouped topically, with an index in the back, and sized to fit easily into a pocket. For a more extensive introduction to the Yiddish language, one might combine this with the book Complete Idiot's Guide to Learning Yiddish by Rabbi Benjamin Blech.For a travel phrase book, it is a real gem.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Great little book !! Very handy and easy to use. Comprehensive listing of all the words and phrases you need. A recommended must in your Yiddish collection.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "portuguese brazilian 8 lessons basic",
        "description": "Brazilian Portuguese made easy--and fun! The Everything Learning Brazilian Portuguese Book makes Brazilian Portuguese a breeze to learn! Author Fernanda L. Ferreira, Ph.D., provides you with step-by-step instruction in vocabulary, grammar, and pronunciation. Learn how to: Understand Portuguese grammar Improve pronunciation Ask questions in Portuguese Have basic conversations when traveling, dining out, conducting business, and shopping Packed with dialogue examples, self-tests, and English-to-Portuguese and Portuguese-to-English dictionaries, The Everything Learning Brazilian Portuguese Book will have you speaking--and understanding--Portuguese in no time.",
        "authors": "['Fernanda Ferreira']",
        "infoLink": "http://books.google.com/books?id=hmnsDQAAQBAJ&dq=Portuguese+(Brazilian)+8+Lessons+(Basic)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This program is a good way to learn to pronounce and understand a few phrases in Portuguese. It is an effective way to learn the language, although the vocabulary is limited.It definately does not have the coverage, background and vocabulary of a course that has a printed book to go with it, and I missed that. I need to know how to read and pronouce words too, or I can't use a language dictionary!However, it is very effective if you don't have the time or discipline to devote 30-60 minutes a day to doing nothing but study a language. With this method, you can listen to the tape while doing somthing else.Be aware that the full beginners course of 30 tapes cost $300, and this is just the beginning of that.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This four tape (eight lessons) set will not teach you enough Portuguese to be useful. But if you want an introduction to the Pimsleur technique, which involves listening to native speakers, repeating what they say, and translating from English (no text), then consider buying these tapes. It will allow you to see if this method of instruction is for you before buying the full, two volume course...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "croatian lonely planet phrasebook",
        "description": "Never be stuck for words with our extensive dictionary. Our phrasebooks give you a comprehensive mix of practical and social words and phrases. Chat with the locals and discover their culture, a guaranteed way to enrich your travel experience. Get more from your trip with easy-to-find phrases for every travel situation. Order the right meal with our menu vocabulary. Use our carefully selected words and phrases to get around with ease.",
        "authors": "['Lonely Planet', 'Gordana Ivetac']",
        "infoLink": "http://books.google.com/books?id=ncrGuwEACAAJ&dq=Croatian:+Lonely+Planet+Phrasebook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This should be a good phrase book. All new phrase books from Lonely Planet are modelled on the same base, and that base is modern and extensive. So why is this Croatian phrasebook so bad despite being modelled on the same base.Silly mistakes:To take one funny example, the Croatian phrase \"I'm here with my boyfriend\" is translated by the English phrase \"I'm here with my girlfriend\". Of course, the Croatian phrase \"I'm here with my girlfriend\" is translated as \"I'm here with my boyfriend\". Needless to say, this could make for some funny situations.Confusion with Serbian:Despite being a Croatian phrase book, this book often uses the Serbian form of a word instead of the Croatian one. Although the scars of the wars are healing, this is not the best way to make friends.Outdated words:Many of the words and phrases used are correct, but very outdated and never used in normal speech.Grammatical errors:Now and then, you see things like \"poslati cu\", even a beginner would know that it's \"poslat cu\".The silly mistakes and the grammatical errors are not very common, but the confusion with Serbian and the use of outdated words is much too common. The language used often sounds stilted.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This book covers the basics in a way that is simple and useful. Three topics are covered in the book: the basic grammar, useful phrases and a 2000 word dictionary. The book is small enough to fit in your pocket and covers each of these topics with an efficient layout.For the grammar, first of all its usually missing from most phrasebooks and dictionaries. But, when you find a grammar section, its usually not useful for travel because its too much detail. For example, in \"Barron's TravelWise Croatian\" book, four standard verb endings (-am,-jem,-em,-im) are described for present tense conjugation. What that book lacks is information to figure out which ending goes with which verb. In this book, a \"rule of thumb\" way to add a single ending to all verbs is described. Its simplier to learn and works well with the format of the book. Its not prefect so maybe language experts cringe but its practical.For the phrases, it is a majority of the book. A couple things I liked were that for phrases that begin with the same words, the words are not repeated. The other is it includes an English pronunciation hint for the Croatian phrase. Both might seem like common sense but several books don't do this.My main criticism with this book is the English pronunciation hint seems strange. The stressed syllable uses italics instead a bold font. And the transliteration use combinations of english letters for one sound. Compare these \"ya ne go-vorim\" and \"ya ne gaw-vaw-reem\". Which is easier to use?For the dictionary, it is not huge but its a two way dictionary with gender and pronunciation. Its more words than you can memorize for a trip anyway. There is also a separate culinary reader for looking up food dishes. If there were a second edition to this book, the author should fine tune the vocabulary in this book. Its kind of funny seeing \"Tequila\" as a drink but not finding \"Lobster\" or \"Squid\" for food. Why go to Croatia to drink tequila? And of course its translates to \"Te-kee-le\".This book is not prefect so it gets 4 stars not 5. For a Croatian language reference book that fits in your pocket this is the best book out there. If you have more time to study, review the \"Teach yourself\", \"Colloquial\" and \"Barron's\" Croatian books.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "essential cantonese phrase book essential phrasebook series",
        "description": "A concise Cantonese phrase book and guide to Cantonese language, Essential Cantonese contains basic vocabulary necessary for communicating in Cantonese. Have you ever considered learning Cantonese, but been put off by the unusual look of the characters? Don't let yourself be scared away! Part of Tuttle Publishing's Essential Phrasebooks Series, Essential Cantonese is a great first introduction and beginner guide to the language of Hong Kong. Perfect for business people or tourist traveling to Canton or for students who want to supplement their learning (and get an A in Cantonese class!), this book's easy indexing feature allows it to act as an Cantonese phrasebook or as a Cantonese to English Dictionary / English to Cantonese Dictionary. A clever \"point to\" feature allows you to simply point to a phrase translated in Cantonese without the need to say a single word or read a single character. You will soon find yourself turning to Essential Cantonese again and again when visiting and working or interacting with Cantonese speakers In this book you will find: Over 1500 practical sentences for everyday use. A glossary of over 200 terms and expressions. Terms and phrases covering essential aspects of traveling and living in China. Titles in this bestselling series of phrasebooks include: Essential Japanese, Essential Chinese, Essential Korean, Essential Tagalog, and Essential Arabic.",
        "authors": "['Philip Yungkin Lee']",
        "infoLink": "http://books.google.com/books?id=__7EwAEACAAJ&dq=Essential+Cantonese+Phrase+Book+(Essential+Phrasebook+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a great, pocket sized helper, with clear, easy to understand romanized Cantonese words and phrases. It is set up in sections so you can get the word you need, when you need it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This was one of my primary resources for a 10 day trip to Hong Kong. I am lucky to have 'an ear' for the tones of Chinese languages, but this book helped to provide me with enough vocabulary to communicate in simple Cantonese and be understood. You should understand that the Cantonese speaking regions of China are a madhouse mix of languages and accents, and if an elder Hokkienese speaker doesn't understand your mangled \"Guangdonghua\" it's not the book's fault, it's just part of being in China. :-)Overall a very helpful resource at a good price, fairly durable and fit easily into a hip pocket or belt-pack.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "longman language activator dictionary",
        "description": "Presents linguistic as well as lexical information.",
        "authors": "['Della Summers']",
        "infoLink": "http://books.google.com/books?id=mcNWAAAAYAAJ&dq=Longman+Language+Activator+(Dictionary)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Now that it exists the list of your reference books will never be complete without it!Does your English-English dictionary always satisfy you especially when you are working on your own creative writing or just formulating your ideas?Alas! However good an English-English dictionary may be it can only show you that the way you've chosen to put something into words is acceptable, or (at its most) it provides you with one or two synonyms.So being a non-native speaker of English, you never get rid of the feeling that there is at least one better way of expressing your thought, the way that would make it sound really English. And now here it is!Productive - this is what Activator all about!Formulate your idea in one simple word and find dozens of different ways to express it with whatever shades of meaning you desire.It guides you to Proficiency. Gives you confidence and what's more - real satisfaction!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "The Longman Language Activator is a new kind of dictionary - it is a dictionary that enables language students to selectively encode what they want to state in English to a degree of linguistic accuracy that had hitherto been impossible using conventional dictionaries. Basically speaking, the Longman Language Activator is a dictionary of ideas. These ideas are the1052 key words that have been distilled from a spoken corpus of 10 million words and a written corpus of 30 million words. From these key words, the student is presented with options to help guide her in homing in on the most semantically relevant word for a particular context or situation. All the options are common, and are shown in order of frequency. The great strength of this dictionary is that it gives clear guidance on how words are normally used, and in which context they are appropriate, whether it be spoken or written, formal or informal, child or adult, or American or British. I particularly liked the dozen or so illustrations that demonstrate how proper use of the dictionary can train the learner to select words and phrases that a native-speaker would use, and perhaps I would have liked to see more of them. The Longman Language Activator is an excellent reference guide for teachers, and simply a must have for any advanced learner hoping to turn passive knowledge into active use.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "As an instructor of English as a Second Language, I can highly recommend the Longman Language Activator (and its lower-level relative, the Longman Essential Activator). This book is designed for non-native language learners and is ideal for building vocabulary and idiomatic use of language. Students absolutely LOVE a book that finally explains the many different words -- this is a place where thesauruses really fail the ESL learner. I can see why other reviewers fail to find what they need, because this book isn't designed for them, but for anyone trying to make sense of English expressions and build a strong vocabulary, this book will be the ideal support to classroom work. The best parts of this book are the examples, which are drawn from real-world texts, and the comparisons between words, their connotations, and the grammar that goes with each of them. A superb teacher resource for explaining complex words in simple language. Six stars if I could give them!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Longman Language Activator is fantastic. Other dictionaries are useful when you're reading a book and don't know the meaning of a word. But when you want to write, they're useless.With Language Activator you can find the right word for what you want to say. For instance, you want to say \"X is guilty\" but you're looking for a better way to put it into words. So you open your dictionary and find an entry for \"guilty\". You are presented with a lot of words and expressions to choose from. Guilty, responsible, culpable, the culprit, incriminate and so on. There's an explanation to help you choose the best word to express your ideas. Now you can confidently write \"X is the culprit\" or \"X is responsible for...\", whatever suits your ideas well. I use it all the time. My book is falling to pieces.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "For centuries, ESL learners have been familiar to use the traditional or \"passive\" dictionary but things have changed and things will be changed with the publication of this innovative or \"active\" dictionary. It gives the leaner the helpful tool to SPEAK and to WRITE actively.I totally agree with a reviewer's statement that, we, as intermediate and advanced ESL Learners, always have the feeling that there must be at least a better/more suitable word to express exactly what do we really mean in a given situation, in writing or in speaking. We all have wondered where to find that word and more importantly, why to choose that word. This dictionary helps me get rid of that feeling by giving me the exact words I want to convey in every particular situation.I strongly recommend its \"lower-level\" dictionary - Longman Essential Activator to intermediate or upper intermediate students. In building our strong vocabulary we all know that, for some words we only need to know its meaning but for some essential words, we must use actively and more importantly, make them our OWN words. All the words in the Longman Essential Activator are the crucial bricks which helps us build our strong wall of English vocabulary. In addition, this dictionary also has many word banks i.e. bank of basic words for popular topics. If you are an intermediate learner, buy this one, and believe me, you won't regret!I believe this kind of dictionary has a bright future and it paves the way for other dictionaries of the same type in the future.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I study English on my own and I have always been trying to find a tool that could help me write (and speak) natural English. It is very hard to accomplish this, especially living in a foreign country (I am Brazilian) and to make things worse I don't live in a big city which would present far more opportunities to enhance my knowledge and practice. So, in order to improve my knowledge I try, as far as I can, to embed English language in my every day activities. I work in a bank and have to be constantly reading manuals to learn procedures, etc. So, all notes I make, since they will be for my own purpose, I write in English. The problem is translating them into authentic English. As an example, I needed to write some important details about giving the customer an overdraft limit. Overdraft limit in Brazilian Portuguese is written \"limite de cheque especial\", which literally translated would be something like \"special check limit\". I am sure neither British nor American say it that way. I searched through Longman Language Activator and I didn't manage to find a definitive answer. I found the word \"overdraft\" in the OWE keyword. There isn't a keyword such as \"BANK\". If you look up the index for the entry \"BANK\" you will find the following reference (LINE 6; SIDE 2 it won't break the bank; CHEAP 1). But I also have a copy of Longman Essential Activator and this book does have an entry named \"BANK\" where I finally found what I was looking for: the term \"overdraft limit\".Longman Language Activator is not the suitable book if you need words related to a particular situation such as being in a HOTEL, AIRPORT, RESTAURANT, etc. There aren't even such entries in the book. But if you'd like to say how BAD something is, what terms could be used in the sense of \"PREJUDICE\", for example, this is the book for you. It could be compared to a thesaurus apart from the fact that this book has tons of natural examples with sections that describes another related senses of the term. If you find the entry \"IGNORE\" you'll know how to express these ideas in a variety of ways: 1) to not pay attention to what someone says or does; 2) to rudely pretend not to notice someone; 3) to ignore something bad, even though you know it is wrong.This book really deserves a 5 star review because it is very good if you know how to use it. It isn't fair to review it with a low rate only because it is not suitable for your current needs.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "beginners persian beginners guides new york ny beginners foreign language",
        "description": "Farsi Persian, the official language of Iran, is spoken across the Middle East and Central Asia by a worldwide community of over 60 million people. Farsi's linguistic and literary legacy is over 2,500 years old, and continues to play a central role in Near Eastern politics, business and culture. Persian is the dominant language of Iran's international business world and a critical language to understanding the intricacies of Middle Eastern literary, historical and cultural trends. Equally suited to both new students and heritage speakers, Beginner's Persian with Online Audio features 10 carefully-paced and practical lessons with dialogues, vocabulary, and expressions. It also includes: A guide to reading and writing Persian Exercises for each lesson with answer key Persian-English and English-Persian glossaries An alphabet and pronunciation guide Online MP3 audio files for free download featuring pronunciation by native speakers.",
        "authors": "['Mohammad Mehdi Khorrami']",
        "infoLink": "http://books.google.nl/books?id=fsAjtAEACAAJ&dq=Beginner%27s+Persian+(Beginner%27s+Guides+(New+York,+N.Y.).)+(Beginner%27s+(Foreign+Language))&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Well this is not a book to learn persian, but it is a book for turists who may wish to go to Iran.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "This is a tourist phrase book pure and simple, but when it is offered online, and cannot be previewed, the title is apallingly misleading. It presents words and phrases in various categories, with Persian script, transliteration and English equivalent, as any good phrase book should. It will be of use to travelers and it can be used for additional vocabulary and examples of colloquial language by students who have mastered the elementary level of Persian.Sudents who want to learn Persian should look at the books by Wheeler Thackston, Serge Obelinsky, and Ann Lambton.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "This 288 page book consists of three parts: Part I: An intensive guide to Persian phonology. Part II: Seven (7) categories of survival expressions &amp; vocabulary in English with their Persian equivalents in phonetic transcription followed by the Persian script versions. These categories are: informal talking, general data, arrival-departure, in town, general needs, health, and amusements. Part III: Information about Iran divided into 3 sections: geography, travel and sights. The most important part of the book for me was discovering the sounds of the language through the phonetic symbols. To make the best use of the book, the student has to work hard on this section to be able to read and pronounce the transcriptions in the categorized parts of the book Without mastering the phonetic transcriptions, pronunciation of the words would be a daunting exercise. In my opinion, BEGINNER'S PERSIAN, with its rich vocabulary categories, was meant for people who already have some knowledge of the language. Complete beginners, like me, would need a tape to assist them in pronouncing the Persian properly.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I speak persian, but I thought this book could help me broaden my persian vocabulary. EVERY SINGLE CHAPTER of this book is full of mistakes. They're not even minor mistakes; but obvious ones! The persian translation of many of the words in this book are COMPLETELY WRONG. This book is a complete waste of money and needs to go back to the publisher for major revisions.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "norwegian in 10 minutes a day",
        "description": "Who knew learning Norwegian could be so much fun? Now with a new digital download, the ever-popular \"NORWEGIAN in 10 minutes a day\" Book makes learning Norwegian simply a breeze. It's the perfect blend of education and entertainment. Full of fun activities and useful study tools such as Sticky Labels and a Cut-Out Menu Guide, it'll have you saying \"god dag\" in no time. Whether you're exploring your Norwegian heritage or cruising the fjords, you'll have more fun if you can speak Norwegian. Perfect for travelers and students of any age. The \"10 minutes a day\" Program: The \"10 minutes a day\" proven methodology guarantees success--all you have to do is set aside 10 minutes and you'll be on your way. Why 10 minutes a day? Because 10 minutes is doable, it fits easily into your life and it's not overwhelming. The program is created so that you can work at your own pace. You set the pace and you decide when you're ready to move to the next Step. The book is purposely designed to look like a child's workbook--it's not intimidating or overwhelming. Instead, it's approachable and engaging for everyone at any age. The book covers material equivalent to more than a year of high school Norwegian or the 1st quarter of Norwegian at university. The vocabulary hones in on key essential words that you'll actually use when traveling. You'll learn Key Question Words so you can ask for what you need; money and numbers so you can shop and pay bills; directions so you can get to your destination smoothly, and so much more that will make your experience abroad enjoyable. Study aids and fun activities such as word games, puzzles and interactive modules are academically designed and strategically interwoven into the program to help you succeed. Contents include: The 132-page illustrated workbook: Use the book to guide you, step-by-step, through learning and speaking Norwegian. Full color throughout: Visually engages you and is conducive to learning quickly. Digital download of \"10 minutes a day\" language learning software: Use the interactive modules to hear the words, practice and play, track your score and have fun! (PC and Mac friendly) 150 Sticky Labels (both in the book and for your computer): Place the Sticky Labels around the house and office to learn new words without any extra time or effort. Use the interactive Sticky Labels module on your computer to hear the words, review, keep track of your score and improve. Ready-made Flash Cards (both in the book and for your computer): Take the ready-made flash cards with you and review your vocabulary on the go. Use the interactive Flash Card module on your computer to hear the words, practice and test yourself. Cut-out Menu Guide: Practice at your local restaurant and take it on your trip. Pronunciation Guide: With the Guide and simple phonetics above each Norwegian word, it's easy for native English speakers to begin speaking Norwegian with the correct pronunciation. Over 300 \"Free Words:\" Sounding similar to their English counterparts, these Norwegian words take no extra effort to add to your vocabulary. Glossary of over 2,000 new words, definitions, and pronunciation: So you can quickly look up a Norwegian word, its pronunciation and definition.",
        "authors": "['Kristine K. Kershul']",
        "infoLink": "http://books.google.com/books?id=dqQnjwEACAAJ&dq=Norwegian+in+10+Minutes+a+Day&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I teach English to immigrants and international students in the U.S., so I'm very familiar with techniques for teaching and learning languages. If you are not planning on actually taking a class, I would say that this book is excellent. It provides tips on pronunciation based on American English. (Most other books don't have the pronunciation tips, but you have to spend extra money on a cassette or CD.) The person who complained about the book missed one important factor. This book provides language than gradually integrates it into the &quot;directions.&quot; Most book give directions in English only, this one substitutes those words that you've learned already in Norwegian! It also does what is called &quot;Scaffolding&quot; - they introduce an idea or word in one place, then re-introduce it later. This book is also very colorful and offers flash cards, sticky-labels and more! Personally, I recommend the English as a Second Language version of this book to my beginning level students- because if you really are interested in learning the language, this is a very inexpensive and effective tool. The down side to this book is that some of the sticky-labels don't make any sense. For instance, where are you supposed to stick &quot;Good morning???&quot; Others, like &quot;Kitchen&quot; or &quot;glass&quot; are better. I would recommend doing this book first and then moving on to &quot;Teach Yourself Norwegian&quot; - or use both at the same time, because they reinforce each other.",
                "review/helpfulness": "50/51",
                "num_reviews": 51
            },
            {
                "review/text": "I can't say enough good things about this book. There's so much useful information, including common words and how to pronounce them. Best of all, it's presented in an entertaining, fun way that makes you want to use it. In addition to reading, you have to write the words and phrases, which as anyone knows from school is the key to remembering what you've learned. I particularly like the stickers for rooms and items around your house. Every time you look at the item or room you see the sticker and this helps to reinforce the Norwegian words. Before long you're counting to yourself or looking at things and mentally saying the Norwegian word. Finally, there are cut-out flash cards and a laminated pocket guide to take with you so that you can work at learning Norwegian wherever you are. I wish there were intermediate and advanced versions of the book. This truly does make learning fun. I highly recommend it.",
                "review/helpfulness": "51/51",
                "num_reviews": 51
            },
            {
                "review/text": "I see another review on this book and I believe that author missed the point of this book. The objective of this book is not to have you write a sentence in English then translate to Norwegian, nor be a comprehensive source for learning Norwegain, but expand your vocabulary used in learning the language.The book has several mutually supportive exercises in expanding vocabulary and proper word usage. There are sentences with fill-in-the-blank missing words. There are little stickers to help you memorize the names of common household items. There are also exercises that help with gender, numbers, and common expressions.This book is definately not going to teach you Norwegian except when used with other resources, but this is a great addition to the other tools that one uses to learn Norwegian.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Having been raised in Norway, I can say that a non-native speaker or someone without previous exposure to the language will probably have difficulty with pronunciation. The book tries to sound it out for English speakers, but that only serves to make you sound like a foreigner :) Nonetheless, it's a good, fun way to learn the grammar, vocabulary, and begin to put together some of the sounds. The variety of \"games\" and exercises help keep your attention while you learn.A good intermediate step as a refresher, most definitely.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book may not be the ultimate resource for learning Norwegian (it has no audio recordings to help master pronunciation), but it is an inexpensive and very helpful way to get started with the basics of vocabulary and grammar. It is like a child's workbook, with illustrations, games, exercises and lots of helpful guidance to make everything perfectly clear. I would say it is an essential starting point for anyone who has never studied a foreign language, and a great help to experienced linguists who are taking on Norwegian self-study. Match it with Einar Haugen's Norwegian English Dictionary, Pimsler's audio program to master pronunciation, and Norwegian: An Essential Grammar, and you'll be building a firm foundation for later intermediate study.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "\"Norwegian in 10 Minutes a day\" is designed for the person who is self-motivated enough to devote at least ten minutes a day to the lessons and who is familar enough with the study of foreign languages to pick one up without outside coaching. The study guide is highly portable and can be used anytime the student has the opportunity.The guide covers the basics of the Norwegian language in a self-paced manner. Dedicated study should enable the traveler to Norway to acculmulate a basic vocabulary sufficient to read signs, menus, and other public displays, handle money, and to ask and answer simple questions. The lack of an audio feature with this guide would make it pretty challenging to master conversational Norwegian without resort to other training materials, classroom instruction, or practice with someone already familar with spoken Norwegian.This guide is highly recommended to the beginner in Norwegian looking for a basic introduction to the language, and to the student with some pre-existing familarity with Norwegian who is looking for a refresher course.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was looking for Norwegian books that would help me improve my knowledge of the language as I've been studying it for over a year, so I went through all the available ones over there.With this book (taking me back to my beginner days of learning the language), I found it interesting how the writer wrote in English at the start of the book, but as you gradually progress through the pages, the words that you've already been taught were written in Norwegian (so, it was like a mix of English-Norwegian).You're also provided with stickers so you can label certain objects and a little pocket book found at the back so you can take it around with you and quizzes where you're required to fill in the blanks. I found that enjoyable.The disadvantage is, the book is without audio. It's no problem for me, as I already know the pronunciation of words well, but for the people who have had no previous knowledge of the language may find it difficult. There is a pronunciation next to the Norwegian word, but how do you know if you're pronouncing the word right or wrong?Overall, I found the book quite enjoyable and keeps you pretty occupied with the fun stickers and games.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was a good starting point to learn Norwegian. The biggest complaint is that without an audio tape, I wasn't quite sure about some of the emphases in saying sentences. I also didn't have a dedicated 10 minutes a day for the several weeks I had the book before going to Norway. Then, of course, everyone in Norway speaks English, so learning Norwegian wasn't that important after all. The stick-on labels should have the English on the back, because otherwise it was hard to remember what the words referred to long enough to go seek them out in the house.I think if you really apply yourself, it is a good system to learn by.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Love this book.............I would like to know this language because it is the language of my heritage...........this book makes it much easier than I thought...THANKS!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I bought this book for my boyfriend who had recently been to Norway and fell in love with the language and wanted to learn. He has told me only wonderful things about it and uses it every day. He says it is easy to follow and provides for great practice. He has even been able to hold a conversation with his Norweigan friend quite well since using it. I would highly recommend this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ultimate portuguese basicintermediate living language",
        "description": "'Ultimate Portuguese Beginner-Intermediate' includes - 40 lessons in a comprehensive 416-page textbook - Each lesson contains a lively and authentic dialogue, vocabulary, grammar and usage, step-by-step character writing, cultural highlights, and plenty of practice; 8 hours of recordings with an ingenious two-step approach - Learn at home and Learn on the go.",
        "authors": "['LIVING LANGUAGE STAFF', 'Living Language']",
        "infoLink": "http://books.google.com/books?id=3yENmgEACAAJ&dq=Ultimate+Portuguese:+Basic-Intermediate+(Living+Language)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This set is by far the best product available for the intermediate student of Portuguese on the market. It combines a complete review of grammer with extensive vocabulary and idiomatic expressions presented as an introduction to numerous cultural notes. The cassettes are indispensable to the course since Portuguese pronunciation is certainly somewhat trickier than that of other Romance languages for native speakers of English. The accents on the tapes focus on the Brazilian variety and are very easy to understand with sufficient time to repeat for the non-beginner. The set also devotes sufficient time to the culture and accent of Portugal. It even discusses the use of Portuguese in Africa. The book starts with the basics and proceeds to an advanced lever; however, the recorded material may be spoken far too fast without sufficient pause to respond for the absolute beginner. Nevertheless, the course as a whole is fantastic. I especially was impressed with the way that it builds upon materials presented and laps back to repeat certain lessons without becoming boring. I would recommend this set as the best available grammatical review and practice of the spoken language for any student beyond the beginning level.",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "This is a great course and value for the money. The speakers and recording quality are excellent. After taking Pimsleur Portuguese I and Barron's Portuguese, I found the approach in this course to be fun and interesting with lively, relevant dialogs.If you already know Spanish, you can pick up Portuguese very quickly after learning the rules of pronunciation, because so many of the words are exactly the same or nearly the same as Spanish. However, be forewarned, Portuguese has several sounds that don't exist in English or Spanish. Also, the same word can have different pronunciations, so herein lies challenges of learning Portuguese. However, the tape series provides you with a realistic experience of the various pronunciations that you will encounter with different Portuguese speaking people.If you are a raw beginner with foreign languages, then the pace of the spoken dialogs and the rapid introduction of new words and tenses in this series may be challenging, but don't become discouraged. Repetition is the mother of all language learning, so review each chapter and tape several times before proceeding. You will find that it gets easier each time that you review.My only criticism is the number of typos. I saw 5 in the first 185 pages, e.g. pg. 185, &quot;agora = know&quot;, but it should = &quot;now&quot;. The book was just published in 2000, so hopefully the editors will correct the errors in future editions. But don't let a few typos stop you from buying and enjoying this course. I have purchased several of the Living Language Spanish tape series in the past, and I found this Portuguese course to be the best and most enjoyable one to date.Since there aren't as many courses available in Portuguese as some other languages, I just hope that Living Language will soon publish an &quot;advanced&quot; series by the same authors as a sequel.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "My wife and I are moving to Brazil for two years this month, and neither of us speak Portuguese. We plan on spending the first few months of our trip focusing on language learning, but we wanted a head start before we left. So we spent hours in bookstores this week looking for the right program. We settled on this Living Language set and we're happy with it.We put the first tape in on the way home from the bookstore. The tapes are ONLY Portuguese, which allows you to be saturated with the sounds of the language. The book lets you follow along with the tape and read the English translations. Once you've gone through a lesson on the tape and have read the lesson in the book, you can play the tape over and over again without the book to practice pronunciation and memorize the words and phrases.Perhaps what I liked best about this program is that you can use the book without the tape. The book is a real language textbook which can be read and used without listening to the tape. So, when you can't listen to a tape, you can still be reading dialogues, memorizing vocabulary, and learning grammar.The lessons are paced well, accomodating any level of learner. If you want to focus on one lesson you can do that easily. The lessons are broken up into 10 minute or so chunks. If you want to keep going and soak up several lessons at once you can do that, too.The vocabulary and grammar is immediately practical. From the very first dialogue you are learning everyday conversation. It's not just a &quot;phrase book&quot; however since the book also covers the grammar that is introduced in each dialogue.We're happy with Ultimate Portuguese, and I'm sure that it will be a worthwhile investment.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Portuguese is my native language. I just want to help the reviewer from Bradford who is curious about the use of the word MEIA when we refer to number six on the phone. &quot;Meia&quot; is short for &quot;meia-d&uacute;zia&quot; that means &quot;half-a-dozen&quot;. The pronunciation of numbers 3 and 6 are nearly similar, and could be easily mistaken one for another it the line were bad. Remember, in English, many say, for instance, two-oh-oh-9 and not two-zero-zero-nine, for 2009, where we certainly mean the number and not the letter of the alphabet, and so on. I hope that can help.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I don't recommend this book because it is very confusing. It tries to put Brazilian portuguese and continental Portuguese into one. Therefore, you're learning a mixed dialect and won't be able to fully understood in either places. Also, you're pronunciation is going to be awful. The tapes switch from Continental portuguese to Brazilian Portuguese without even indicating it and the two different kinds of Portuguese languages are pronounced differently. For people looking for strictly Brazilian Portuguese or Continental Portuguese this isn't the course.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a valuable and beneficial book. It contains relevant and up-to-date information, but there were many typographical errors. These ranged from incorrect spelling (in both English and Portuguese)to obvious mis-translations of basic and familiar words and phrases. I have only a slight background in Portuguese, and was able to spot many mistakes. These may go unnoticed by a novice reader of the language. Nonetheless, when completed with this course you should have no problems in conversing with Brazilian and European speakers.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought the book and got to page 91 so-far... I think the method of learning Portuguese with English translation should work fine for English speaking students.What bothers me is that there are too many errors in spelling, and translation. It seems like whoever wrote the dialogues and exercises was not the same person who translated them, otherwise they would have noticed that some examples that were chosen do not translate well. This results in confusion and contradiction along the book. If you already know some portuguese and aware of these errors, you can benefit from this book... otherwise, find another.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "czech start speaking today language 30 czech edition",
        "description": "This is Book 1 of Teacher King's English Speaking Course It contains 30 important lessons to help a student learn to speak English the right way! Level: Beginner to Intermediate - Students should have a basic knowledge of Speaking, Reading & Writing. Application: Self-learning & Classroom This workbook has been written for all ages, children and adults alike. This workbook features: - 30 excellent lessons with everyday topics - 300 important words used in daily life - 60 fun and everyday conversations and talks - Q&A section for each talk - 30 phrasal verbs for everyday topics - 30 verbs and different tenses - Easy interactive worksheets to learn speaking sentences correctly - Tests to reinforce knowledge of the lessons - Commonly used grammar tenses - Step-by-step grammar development - Vocabulary words include Czech translations Teacher King's English Speaking Course is the easiest way to learn English. Written by ESL specialist, Kevin L. King, who has taught English as a Second Language for over 30 years around the world.",
        "authors": "['Kevin L. King']",
        "infoLink": "https://play.google.com/store/books/details?id=bxUYEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I recomment this book for someone planning to visit Czecho Republic both on business or pleasure. The contents covered most of the situations we might encounter in the country and some crucial terms for emergency. Most sentences are concise and not long enough to make you feel tired of repeating them. Since the textbook is very compact, you can carry it in your bag, as well as your portable cassete taperecoder, and show some of the sentences to people, ask them to write down the answer. I would never say that you will become able to speak Czecho fluently by just learning the expressions in this book. But at least, you will be a bit familiar with one of the most complexed language in Europe.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "It is good if you want to learn a wide range of things. It has lots of phrases, and the phrase book is small enough to carry around, and you can use the index to flip right to pages with sentences using the word you looked up. For actual learning i dont think it is that great though. The tapes only say each phrase twice, and not slowly enough. Also, this set is just words and phrases- there are no activites or anything to give you practice using the language. If you just want to pick up some words for a trip, sure get this product, but for really learning some of the language i would suggest investing a little more $ in a more educational product.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "ntcs compact dutch and english dictionary",
        "description": "Introducing the first softbound edition of this indispensable resource for Dutch-speaking students of English and for English-speaking students of Dutch. It's scope is comprehensive, with 30,000 entries divided between the two languages, and its style is practical with current spellings and concise definitions in an accessible format. Also includes many phrases and compounds.",
        "authors": "['McGraw-Hill Education']",
        "infoLink": "http://books.google.com/books?id=-fg-PwAACAAJ&dq=NTC%27s+Compact+Dutch+and+English+Dictionary&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book offers little more than a list of words with no other information. It doesn't provide any guide to pronunication or usage and doesn't give the gender for nouns. I was also unable to find entries for some very common words and have spotted a few errors along the way. I recommend spending a little extra for the New Routledge Dutch Dictionary; it's much better.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The English word &quot;because&quot; is not in the English/Dutch section of the book. There are no genders of verbs or pronunciation guides.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "perfect prepositions a real life guide to using english prepositions",
        "description": "As high frequency words, prepositions are one of the most dynamic parts of speech. Perfect Prepositions shows the meanings and usage of prepositions in Modern English. Used in unstressed syllables and pronounced fast and softly in oral speech, prepositions are often barely distinguishable to the listener. Prepositions can also pose communication problems for English learners and even native speakers. Author Galina Kimber provides general and specific information on the meanings of prepositions as well as ideas on usage as they are applied today. Living languages constantly evolve over time, and reference books like Perfect Prepositions reflect these changes. Perfect Prepositions details different ways of defining the meanings of almost one hundred prepositions written in semantic categories and subcategories that are easy to understand and use in daily life. It's a useful resource for those desiring to improve their communication skills.",
        "authors": "['Galina Kimber']",
        "infoLink": "http://books.google.com/books?id=LLvzzgEACAAJ&dq=Perfect+Prepositions:+A+Real+Life+Guide+to+Using+English+Prepositions&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "We often take prepositions for granted. We notice themonly when we experience difficulties in deciding whichone to use in a particular case: In or into? In or on,as in the sentences `My Grandma was sitting in herchair' and `My Grannma was sitting on her chair.' Soselecting the correct word can be challenging, and`Perfect Prepositions' helps learners to get theanswers. This book can be looked at as a littledictionary as it provides a comprehensive list of 103commonly used prepositions. It also provides manyexamples for each meaning. I only wish the book wouldcontain a section on exercises as well, though theexamples can be used as excercises. What I findinteresting is that the examples help the learner tomake `his or her own rule' on a meaning. In this senseit is good for a self-directed use. It's certainly avery helpful learning device as it offers practicalguidelines for correct usage.Eva S. K., PhD",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "At first, after I bought Dr. Kimber's \"Perfect Prepositions\" I thought that it was just another impulse buying of no particular value. You see I just buy lots of books and sometimes do not even have time to read them.Then, one weekend, when the weather was bad, I started browsing through it. The more I read the more I liked it. Next Monday I recommended it for purchase at the college library where I teach.There are so many things in this book which I either did not know, or at least did not think about. This is a plethora of useful information both for students and teachers.The book is arranged in a simple and logical way, and very easy to use as a reference book.I highly recommend it as a tool for teaching and learning English (also as a second language). It should be available in the reference section of every better high school and college library.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the oxford dictionary of foreign words and phrases oxford paperback reference",
        "description": "This updated and revised edition is the authoritative guide to foreign words and phrases used in contemporary British and American English. Drawn from over 40 languages, the 6,000 entries detail the history of each word or phrase and provide selected quotations to clearly illustrate their use in the English language.",
        "authors": "['Andrew Delahunty']",
        "infoLink": "http://books.google.com/books?id=qB58QgAACAAJ&dq=The+Oxford+Dictionary+of+Foreign+Words+and+Phrases+(Oxford+Paperback+Reference)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you find yourself skipping words and phrases in articles and books that you sense everyone but you understands this is an excellent addition to your dictionary collection. After checking a number of similar reference books at the library I chose this one because it tells a little history of word/phrase usage in addition to just a translation, this allows you to put it into better context.",
                "review/helpfulness": "37/39",
                "num_reviews": 39
            },
            {
                "review/text": "This book is an ideal reference for those of us who need to make sense of the foreign (non English) words and phrases encountered in English.Examples include chaebol (Korean: a large business conglomerate); nebbish (Yiddish: a nobody); cum laude (Latin: with praise) and gung-ho (Chinese: work together).Each of these words has been adopted within English with similar - but not always identical - meanings.There are some 8000 examples of words and phrases from over 40 languages in this book.Recommended for those who are interested in seeing practical examples of how English evolves to encompass offerings from other languages.Jennifer Cameron-Smith",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Although not arranged by countries of word orgin, as is true of smaller dictionaries such as Le Mot Juste, this is a full-fledge dictionary of foreign words, that goes well beyond just cognates and borrowed words across national boundaries.It also gives some entomological information and pronunciation diphthongs as well as occasional synonyms and cognates.The best of a good lot. Five Stars.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "All lovers of language should consider purchasing this dictionary of foreign words & phrases. Without a doubt you will be enlightened by the wealth of information it has to offer. English is a widely spoken language with both native, second and third language speakers and many words and phrases used in English come from other languages especially French and Latin. This book provides many examples of these words and foreign phrases used in everyday speech as well as an explanation of the meaning and source language. This a recommended purchase and a very informative easy to read dictionary.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "collins cobuild dictionary of phrasal verbs collins cobuild dictionaries",
        "description": "This new edition of the Collins COBUILD Phrasal Verbs Dictionary offers comprehensive and up-to-date coverage of the most important phrasal verbs in English. Collins COBUILD Phrasal Verbs Dictionary gives learners of English detailed help with this often tricky area of the English language. Revised and updated to reflect changes in the English language, this new edition provides learners with detailed information on phrasal verbs in a language that is easy to understand. With new phrasal verbs and updated examples from the Collins Corpus, this edition is packed with information on how phrasal verbs work, what they mean and how to use them. The 2-colour layout of the dictionary means that it is easier than ever for students to find the information they need. The dictionary also includes an index of 200 single-word verbs and their phrasal verb equivalents, plus information on when you should use a single-word verb (for example, in academic writing) and when a phrasal verb would be more appropriate (for example, during an informal conversation with a friend). There are also collocations boxes, which provide students with the language they need to build natural-sounding sentences in English. There is also a self-study exercise section at the back of the book so that students can practise and consolidate what they have learnt. The particles index provides students with in-depth information on what particles mean, boosting their vocabulary and understanding of the language. As with all COBUILD products, the Collins Corpus provides thousands of examples of real English, showing words in context and providing essential guidance on usage. Attractively presented, the Collins COBUILD Phrasal Verbs Dictionary is invaluable for all learners of English wishing to gain a fuller understanding of phrasal verbs and use them more effectively.",
        "authors": "['Collins Uk']",
        "infoLink": "http://books.google.com/books?id=SvXMyAEACAAJ&dq=Collins+COBUILD+Dictionary+of+Phrasal+Verbs+(Collins+Cobuild+dictionaries)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a very good source for those who want to improve their spoken english as well as written english. In my opinion, this is the BEST book avl. on the market. Go for it.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an excellent dictionary of phrasal verbs for non-nativeEnglish speakers who have studied English for several years.The biggest advantage of a dictionary like this is that it can be really hard to find a phrasal verb in an ordinary dictionary.The definitons and example sentences are easy to understand for Intermediate and advanced level EFL/ESL learners.It has a very useful section at the back of the book about how the particles (in, on, up, down etc.) can be grouped together by meaning.The grammar explanations at the beginning of the dictionary can be difficult to understand sometimes...I recommend you buy it, especially if your English is reasonably good already...",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "pronounce it perfectly in english",
        "description": "ESL students, TOEFL and TOEIC test takers, and all others for whom English is a second language and who want to improve their pronunciation will find this book and compact disc combination especially instructive. The new edition presents many exercises that provide practice in every sound that is specific to American-style English. Emphasis is on the formation of the vowel and consonant sounds plus all of their possible spellings, the significance of correct pronunciation of grammatical markers, and stress and intonation patterns in conversational English. Recognition of these patterns is essential for fluent speech and listening comprehension. Four compact discs give students more than five hours of intensive speaking practice.",
        "authors": "['Jean Yates']",
        "infoLink": "http://books.google.com/books?id=6xoAMgEACAAJ&dq=Pronounce+It+Perfectly+in+English&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have gone through this book and still reading it regularly to keep on my practice. It has really helped me to know the trick of American English pronounciation by properly controlling the tongue and mouth movement. The pictures given in this book are of tremendous help to me. I would have liked to see some more words in the pronounciation list. Anyway, this is one of the greatest book for mastering the pronounciation of English.",
                "review/helpfulness": "43/45",
                "num_reviews": 45
            },
            {
                "review/text": "This is an excellent book for improving and mastering our pronunciation in this interesting language. I am a peruvian and as a Spanish speaker it was so easy to learn the English sounds, his rhythms and accents. All the book is perfect! :-) Now i can speak English better than before and I can understand English-speaking people better too. The voices recorded in the cassettes are very nice and clear. I like the voice of Julie because she have a sexy voice. The table of pronunciation symbols used by five international dictionaries is very important so we can compare and apply our learned symbols sounds in those dictionaries. This book use a standard English pronunciation...all English speakers will understand you! So i can say with a smile on my face: &quot;I really did a good buy!&quot;",
                "review/helpfulness": "32/35",
                "num_reviews": 35
            },
            {
                "review/text": "Finally, Jean Yates has taken something scary to so many, and made it so easy and fun--learning not just the words, but how to communicate! I was appalled by the previous review as I had been told how effective this book is prior to reading it...Upon seeing how this book helps people actually connect with, understand, and speak the language, it shows this reader 2 things: First, Jean Yates knows not only the language, but the art and importance of really communicating. Second, it shows the previous reviewer was simply pitching another book and didn't take the time to read this book and understand how it helps the confidence of those learning the language. Anyone trying a new language knows how frustrating it is to not only find the right words to say, but to find the right way to say them. Jean Yates comes across as a teacher of the language, and of confidence in those that want to learn it. Oh, and by the way, Jean Yates is a woman... Another observation missed by the previous reviewer.",
                "review/helpfulness": "20/26",
                "num_reviews": 26
            },
            {
                "review/text": "I tried many accent reduction series. This one is not so useful to me. The way she go over certain difficult sounds I have did not make sense (to my ears). It might work better for other accent (non Asian/Chinese). Very hard for me to distinguish some sounds from the tape.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am a student of languages and an ESL tutor. I like the \"Pronounce It Perfectly\" series for myself (French and Spanish) and for my ESL students (English).The material is a high quality mass-market version of professional ESL pronunciation workbooks. The audio is excellent and has a matching book. I like the following aspects: (1) each sound is covered in sufficient depth (variety and repetition) that a diligent student will acquire basic listening recognition and sound production skills, (2) there are examples of various spellings for a given sound (example: meet/meat) and again a diligent student will acquire basic skills at recognizing the probable spellings of a spoken word, (3) there are explanations of correct jaw, tongue and lip positions (very helpful!), and (4) important subtle details are covered (example: 'p' has a puff of air at the beginning of a word).For my ESL pronunciation lessons, I like to work with \"English Pronunciation Made Simple\" and to loan the student a copy of \"Pronounce It Perfectly in English.\"",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "lonely planet papua new guinea pidgin phrasebook",
        "description": "Lonely Planet Pidgin Phrasebook & Dictionary is your handy passport to culturally enriching travels with the most relevant and useful phrases and vocabulary for all your travel needs. With language tools in your back pocket, you can truly get to the heart of wherever you go, so begin your journey now!",
        "authors": "['Lonely Planet', 'Trevor Balzer', 'Denise Angelo', 'Ernie Lee', 'Paul Monaghan', 'Peter Muhlhausler', 'Dana Ober']",
        "infoLink": "http://books.google.com/books?id=C_7doAEACAAJ&dq=Lonely+Planet+Papua+New+Guinea+Pidgin+Phrasebook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Papua New Gunea has a myriad of local languages but one truly common language-pigdin English. Being able to communicate with the locals in even the most isolated of villages is both an advantage and an experience I highly recommend. The book itself is top pocket size (a huge advantage), well laid out and predictable. The only critism is that it is limited but then again so is the language. A must for travelling in PNG.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book teaches you Pidgn English.This language is spoken in Papua New Guinea,and other Pacific Island countries.It is great for the traveler.Pidgn is an extremely simple language for english speakers to learn.The pronnounciation is the same and the words sound exactly the same.The only problem is that it is a bit short,otherwise if you want to learn Pidgn,buy this book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]