[
    {
        "Title": "business glossary englishportugueseportugueseenglish business glossaries",
        "description": "This is a must have dictionary for the office, business traveller or professional translator of English and Portuguese. It is an indispensable tool for those who work or travel in Portuguese-speaking countries. It is fully up-to-date for 2015 and complies with the latest, international Orthographic Agreement between Portuguese speaking countries. It is comprehensive and easy to consult with over 28,000 references, including terms and phrases used in banking, business and management, a glossary containing many definitions of terms and phrases, and a list of abbreviations. It also contains sections listing Brazilian, Portuguese, Angolan, Mozambican, Cape Verdean, Guinean and Sao Tomean government departments, institutions, organizations, conventions and agreements.\"",
        "authors": "['Victor Da Cal']",
        "infoLink": "http://books.google.com/books?id=IL0gjgEACAAJ&dq=Business+Glossary:+English-Portuguese/Portuguese-English+(Business+Glossaries)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My Portuguese was weak in financial and business terms. I found this small glossary helpful in almost everything that I needed. This book is great for general use, although a more specialized book may be necessary for particular areas of expertise (investment banking, for example). Whenever I need to use Portuguese business terms, this is the source I look to first.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The Glossary has a lot of tecnical terms, but it is a little bit poor in financial terms. It is good to someone who's learning english as foreign language or doing some business course. Is does not have especific terms about some subject like financial and accounts.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "global electronic commerce theory and case studies",
        "description": "Provides an understanding of the technologies of electronic commerce. The text does not concentrate solely on the Internet but suggests that the Internet is only a bridge technology. Each chapter contains an overview of a theory or practice followed by one or more business case studies.",
        "authors": "['J. Christopher Westland', 'Theodore H. K. Clark', 'Theodore H. K.. Clark']",
        "infoLink": "http://books.google.com/books?id=lcY1A3jB9tIC&dq=Global+Electronic+Commerce:+Theory+and+Case+Studies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Global eCommerce is a good text book for eCommerce. Its a text book in terms of the style its written in, tone, and level of insight. If you are looking for a broad based reference book then its OK. Otherwise there are better books (eProcess Edge, Customers.com, and others) that provide more detail insight and understanding.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I find this book is a little too expensive for what you are getting in content and quality.The structure and the presentation of the book has not been planned out properly. Trying to read it is painstaking. I totally agree with one of the reviewers before me, it's full of gibberish. It's not worth the money spent. Very disappointed.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "music business a musicians guide to the australian music industry",
        "description": "L;fjjfjdfljldsajljjflkjdsakljjklfdjklajklf.",
        "authors": "['Shane Simpson', 'Jules Munro']",
        "infoLink": "http://books.google.com/books?id=gJBjMwEACAAJ&dq=Music+Business:+A+Musician%27s+Guide+to+the+Australian+Music+Industry&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "While this book is written principally for Australia and from an artist's perspective, it gives so much information about the intricacies of the music business that any one who is intending to make a career out of music should read it, regardless of what role you intend to play.Shane covers all the major players in depth, including artists, record companies, publishers, producers, session musicians. More importantly, Shane covers all the facets of the typical contract arrangements between them. The detail provided helped me to ascertain whether it is better or even feasable to do one's own marketing, label, publishing or contract them out. The book also helped me to understand that even if I do some of these activities myself, say through a company, contracts are still required to keep everything in order. The arrangements have to be clear and explicit for royalty accounting.While the examples focus on the Australian situation, they are always compared to US or European practice. This only served to deepen the understanding of the concepts behind why the business is so complex.This book conveys that the music business is full of complexities, but it is so helpful in making actual business decisions that I felt it was better than Tim Sweeney's books, which were more directed at the marketing and promotion side.Overall, while not leisuretime reading, I would consider this book an essential reference for anyone who wants a career in the music business.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book by Australian Entertainment Lawyer Shane Simpson is an absolute essential book for anyone working in the music industry whether they be a musician, promoter, band manager, record company suit or whatever you do. I highly recommend this book, and no Australian musician whose serious about their career should be without a copy.I've worked in the Australian music industry on and off for over 30 years as a musician as well as working in Record Companies, Band Management, Music Retail, Music Production, Radio and in the musical instrument / Pro Audio wholesale trade and I only wish I had Shane's book a few decades back to help me with my career. Although many of the examples and references are from an Australian perspective, it would also be of value for other territories as well with its insightful and well grounded advice. This book has real depth and has been an valuable asset in my work and business in the media and entertainment industries.I highly recommend it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "youre my little love bug parent love letters",
        "description": "Every child wants the reassurance that their parents love them no matter what happens. Through fanciful rhyming expressions of love, an original \"Love Bug\" song, and whimsical illustrations, You're My Little Love Bug captures all the fun ways parents can describe their love and implant it into their child's heart. When a parent and child cuddle up to read the You're My Little Love Bug book and sing the song together, it becomes a special and memorable bonding moment. Parents can personalize the book by inserting a picture of their child in the provided pocket.",
        "authors": "['Heidi R. Weimer']",
        "infoLink": "http://books.google.nl/books?id=W0FWuAEACAAJ&dq=You%27re+My+Little+Love+Bug+(Parent+Love+Letters)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "You're My Little Love Bug is a colorful and cheerily illustrated book from first-time author, Heidi R. Weimer. As you turn the first page, the book seems to twinkle with joy set to a delightful and cheery tune. While seemingly written as a children's book and as a parent's happy tribute to a well-loved child, the book could also be a great love treat for a special friend or buddy.You're My Little Love Bug has clever prose that rhymes and bounces! Each page is full of imaginative plaudits to a child through the imagery of animals, sweets, and other foods. The captivating prose is uplifting, cute, and full of word pictures.You will laugh your \"tickle toes\" off and feel as \"sweet as honey\" when you turn each sturdy page. Life is truly a \"bowl of cheeries\" with this sweet and lively feel-good book!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought this for my 9 month old daughter, because we love reading and the lights and music really keep her attention !! Definately a great book !!!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "In an impulse buy while standing on line at a discount store, I grabbed this boardbook as a Valentine's gift for my 3-year-old & 7-month old children. I didn't even get the chance to read it all the way through at the time. The battery was dead when I picked it up. But the illustrations were adorable & it fit the holiday theme, so I figured we could always replace the battery. We never did buy the special batteries (three LR1130 are needed) because it is a favorite without them. Even without the lights & sound, the whole family loves it!! The story is really just a poem of all the cutesy things a child might be called. The first page (stanza) of this book sets the stage: \"You're my little lovebug/My cuddly kangaroo/My funny bunny/Sweet as honey/All of this is true!\" Each of the 8 stanzas is illustrated on a 2-page spread in vibrant watercolor drawings. As with all boardbooks we've read from CandyCane Press, \"God\" is mentioned briefly at the end. The last page reads: \"You're everything that's wonderful/You're all of the above!/But most of all/What you are/Is God's sweetest gift of love!\" The book itself has heft to it - the lights & sound page is also the back cover, and is nearly as thick as the story portion itself. On that page there is a small, plastic sleeve for a picture of your child(ren), and the picture can be seen through a heart cut-out in each page. We've had this book over 4 months now & it is in the same condition as when I brought it home, despite the drool of my teething baby. My now 3-1/2-year-old son often chooses this story to sleep with at naptime. Though he certainly isn't reading yet, I hear him (fairly accurately) tell himself the poem as he turns pages in bed. In my opinion, that is the mark of a great book: one loved to the point of memorization, eagerly recited back! I highly recommend this singsong story for cuddle-time with your little lovebug!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "My daughter, and everyone else who has seen it, loves this book. It is cute, and fun to read, and the music and lights are well done. My 17 month old could listen to the music all day.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "My son loves to hear this book being read, he's still pretty young (3 months old) but he will hang out and listen to this book being read several times before his attention span is challenged, where with other books he gets frustrated quickly.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "My daughter and I love this book! She loves the music and the silly phrases. Also, having a spot to put her picture in the book makes it more special. It's our first to read every night. Beware though--the last page ususally makes me tear up because it's so sweet! I am ordering it for all her cousins for Christmas!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "You're My Little Love Bug is a must have for any parent and child. I have purchased it for infants, a two year old and six year old twins. For the little ones, the colors, music and lights catch their attention. As for the older children, they love the silliness of the words while grasping the meaning of the sentiment. The book is also a treat for the adult who reads it. It never seems to bore anyone who reads it or anyone who hears it being read. This book is a true delight!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this for my little boy for Valentine's Day. He was 4 months old at the time. he is now 9 months and this is his favorite book. He loves me to read it to him before his naps. I would love to find more musical books like this!!!A great buy!!!!Nolan's mommy",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is the absolute sweetest book ever. Your child/children will fall madly in love with it...even I did! Has the cutest little song that plays everytime you open the book; music plays very softly. It has catchy, cute little rhymes, or near rhymes on each page w/ cute little pictures that go along w/ the story. Also, there's a heart that has lights around it, so not only does the music play when you open the book, but the lights flash around the heart until the music stops! This is my favorite book to read my daughters and the best present my baby has ever received and she is 9 mos. old. She even grabs other books anticipating the music & lights and is incredibly disappointed when she finds out she has grabbed the wrong one! I am currently searching for others like it to buy her for Easter and her Birthday! You definitely won't be disappointed!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is SO FUN to read!! And it's fun too, for the little ones to hear!! I laughed out loud the first few times I've read it. Usualy my son will bring me a book to read, but when it's my choice, I pick this one!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "nanotechnology a gentle introduction to the next big idea",
        "description": "In Nanotechnology: A Gentle Introduction to the Next Big Idea, nanotech pioneer Mark Ratner and tech entrepreneur Daniel Ratner show how nanotech works, what's new, what's next, and why nanotech may be the next $1 trillion industry. They survey every area of R&D: nanobots, quantum and DNA computing, nanosensors, biostructures, neuro-electronic interfaces, molecular motors, and much more. Simple, brief, and nearly math-free, this is the perfect briefing on nanotech technology and business for every non-technical reader.",
        "authors": "['Mark A. Ratner', 'Daniel Ratner']",
        "infoLink": "http://books.google.com/books?id=m9Tn_V4an28C&dq=Nanotechnology:+A+Gentle+Introduction+to+the+Next+Big+Idea&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really wanted to like it, I didn't much care for the Ratner's Introduction to Nano. The two dish out a lot of hype (Imagine that... imagine that... Nanotechnology may do all of these things!) and not as much information as one would expect, even from a book mean to ease you into a topic.I found the writing totally average. Misconceived jokes and mechanical prose made reading the book most unpleasurable, and chapters are so divided that the book has very little continuity.Look somewhere else for a book on nano.",
                "review/helpfulness": "29/36",
                "num_reviews": 36
            },
            {
                "review/text": "I have been very interested in the field and study of nanotechnology. I recently bought some books of which one was Mark Ratner's--Gentle Introduction. I struggled about halfway through before finally putting it down due to the incessant babble about how good Northwestern is and that the book's examples were quite unhelpful.I understand that someone can be very proud of where they work and the type of people they interact with; and there is nothing wrong with that. However, I quickly became tired of how he thinks that the epicenter of the nanotechnological world revolves around Northwestern and his small group of colleagues. He seems to be kissing butt with his descriptions of them and rarely ventures to other areas of the world where other important research is going on.I also was quite unhappy with the explanations of both technology examples and pictures in the book. The explanations do not fully describe what you are looking at and if you do not already have an idea of what he is trying to explain (from another research source) you will find yourself feeling like you are lacking full understanding.This book is hardly a \"gentle\" introduction so don't waste your money on it like I did. It's more like walking down a dark path in a fog than receiving a clear understanding of where nanotechnology has come from and where it's going.-Matt",
                "review/helpfulness": "19/25",
                "num_reviews": 25
            },
            {
                "review/text": "I really wanted to like it, but I didn't much care for the Ratner's Introduction to Nano. The two dish out a lot of hype (Imagine that... imagine that... Nanotechnology may do all of these things!) and not as much information as one would expect, even from a book mean to ease you into a topic.I found the writing totally average. Misconceived jokes and mechanical prose made reading the book most unpleasurable, and chapters are so divided that the book has very little continuity.Look somewhere else for a book on nano.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "I am a general user of computer systems, and not schooled in nanoscience at all. What a relief to see that there's a book out there that can explain this emerging field to me! Not only is the book easy to read, it's fascinating, with a review of in-depth nan inventions, business aspects, and a general review of chemistry which is great because I had forgotten how it all fits together.I would recommend this book to the average user that wants to know about this science-it is really easy to read and it makes the entire science clear-I was not aware of the science before this except for general rumors of nanobots. It is a refreshing look at a science that has, until now, been under-reported.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is a great overview for the non-scientist. I found it to be an easy and quick read overall. This was the first book that I read on Nanotechnology and I understood about 80% of what was being said, after reading 3 more books on the topic and coming back to this one - I understood about 95% of what was being said. I have given this book to several friends that are interested in learning more about nanotechnology and they all find it to be and helpful.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "What a nice, easy introduction for the lay reader to an important new field of science that will be a part of our lives for years to come! I am a professional, non-scientist, and I found this intro to nanotech to be an easy-read that provided a perfect survey of the breadth and potential impact of this field. I have listened to a couple of lectures on nano-applications in medical science, but in comparison, this book was a more lucid and entertaining preview of this field.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "OK, the Internet boom is over. It looks like nano tech will be the next boom, and it will last a while. I wanted a book that would give me a good into to nano tech, but not be a dry read. This book is an excelent overview of the technology, and how it might be used. I really liked the color photos. In case you are wondering (I was), the thing on the cover is a &quot;Nano Tube&quot;. It is very small, and very cool!!",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a graduate student, I can appreciate this book for what it is - a very general overview for those without a technical background. Ratner sets the stage very well, describing why the nanoscale is a \"different kind of small,\" and what implications this has in several fields - medical, electronics, energy, consumer products, etc. Since we are talking mainly about the ability to very precisely design material properties, and every manufacturing-based industry is based on the use of some material, it is not too much of a leap to see that working at the nanoscale will be a huge source of competitive advantage in the coming years.The only portion of the book I found lacking was the investment/business section. Most non-technical readers of this book probably have a rudimentary understanding of business, if not an expertise in business, and this part of the book was a little too basic.One interesting point not mentioned in the book (And I wouldn't expect it to have been mentioned) - within the technical community, many folks shy away from using the word \"nanotech,\" largely because it is typically viewed as the next logical step in established fields. \"Mechanical Engineering at a smaller scale,\" \"More precise Materials Engineering,\" \"Business as usual for the chemists,\" etc. etc. It is a far more common word among lawyers, politicians, and business people, those who are looking at technology trends from a very high level. Still, I would have to say that Ratner gets it right - it is beneficial for the scientific and engineering communities to think about this as a new field, one in which knowledge of engineering, chemistry, and biology are all essential. Simply thinking in terms of this paradigm will encourage folks who may never have spoken before (i.e. - a mechanical engineer and a chemist) to realize that there is room for innovative collaborations. In addition to new designer materials, this may be the biggest result of the \"nanotech\" revolution.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I thought this book was an excellent introduction to the field of nanotechnology for the non-scientist. I highly recommend this book to those interested in cutting-edge scientific ideas as well as those with a particular interest in nanotechnology.I am a lawyer and graduate law student interested in the field of nanoscience from a legal/regulatory perspective. I have not taken a science course since early high school and I wanted a book which would give me a &quot;gentle introduction to/overview of&quot; the field so that I could grasp the science/technical basics. I found this book perfect for that purpose. It simplifies complex ideas without being simplistic. It starts with the very basics and explains simple concepts - like what is an atom, what is a molecule - without dumbing-down the information. It then progresses to the more complex, offering a terrific overview of nanoscience from the broadest possible perspective. It covers virtually every area - from optics, to electronics, to biotechnology, to ethics and investment issues. It even contains a helpful glossary of important terms.I thought that it was a wonderful book, intelligently written, brief and to the point. I can see how some people who are well versed in science might find this book too basic. However, as the authors point out in the introduction to this book, it was designed to introduce the scientific basics of nanotechnology to non-scientist professionals. It succeeds in doing just that. I know I will refer to it time and again during my research and I will recommend it to everyone with an interest in this fascinating field.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The book is what it says it is: A Gentle Introduction. If you want to know what Nanotechnology is before, for example, taking a course on it, this book will do the job.The authors state (on page 4) that they \"hope this book will be a quick airplane or poolside read...\". It will take somewhat more effort than that to grasp and retain what is written but it is still well within the compass of the \"intelligent layman\".From a stylistic point of view I found the book a little tedious hence four stars out of five.I also read \"Understanding Nanotechnology\" which covers much the same ground and which I prefered mainly on stylistic grounds.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "music publishing the real road to music business success",
        "description": "Music publishing is the industry responsible for connecting songwriters with appropriate recording artists, promoting songs, handling copyright registration, and supervising the very profitable process of royalty collection and payment. Long overshadowed by the more glamorous recording industry, music publishers are at the pivotal center of the music industry and the incubators of every hit record. Music Publishing: The Real Road to Music Business, now in it?s sixth edition, provides a completely updated introduction to the lucrative music publishing business and includes advice on how to break in. Detailed chapters cover acquisitions, copyright, contract fundamentals, licensing, marketing, and the basics of running your own music publishing business. The new edition takes into account the rapidly changing nature of the business with updated copyright laws and international treaties, revised sample contracts, new material on marketing, sales, and distribution channels, and updated royalty scales and business models.",
        "authors": "['Tim Whitsett']",
        "infoLink": "http://books.google.com/books?id=O_UYLgEACAAJ&dq=Music+Publishing:+The+Real+Road+to+Music+Business+Success&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "At first glance this is a rather pricey manual for starting a publishing company, but MUSIC PUBLISHING covers the process from top to bottom, beginning with the obvious first step of setting up the business and continuing clear down to the more sophisticated problem of administering others' catalogs. Each music business author has a unique approach, and Whitsett proves to be unusually well qualified to advise publishers, thanks to his wealth of domestic and foreign experience working with major publishers. The mouth-watering chapter in Whitsett's book, which echoes most young songwriters' first question, is &quot;How Much Can I Really Earn from a Hit Song?&quot; For anyone contemplating a venture into publishing, I strongly recommend Tim Whitsett's guidebook. Ron Simpson",
                "review/helpfulness": "65/68",
                "num_reviews": 68
            },
            {
                "review/text": "\"Music Publishing\" by Tim Whitsett is a value tool to understanding, filing, and starting up any goals in the music industry. The biography of the author is amazing and what he shares through his years of being as music publisher is invaluble. At first look I was skeptical and assumed that my many other books would cover the information in here. I was wrong, this book is detail in, not only, what music publishing is, but how to publish music. The slant of the author is clear when he states that he can never understand why an artist would not publish his/her own music. Another good book about publishing is \"Music Publishing: A songwriter's Guide,\" (it is cheaper than this book) which the author has just as much creditals as Tim Whitsett, but Whitsett goes into more depth making this book a more value tool.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "I have to rate this publication highly because it really explains in simple clear language the whole business of music publishing. I have to acknowledge the fact that it assisted me in landing a deal with an independent film company in Germany. I would say buy this book you will make back the cost believe me. It is my second bible.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I highly recommend this book to gain greater insights in the Music business or any business. donald does it again. this is one of the only legal books on the Music industry I would recommend. It was a great buy along with a couple of manuals I purchased from Musicbrains.net entitled the Indie label Kit.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "The invaluable information in this book is a must for everyone in the music industry. Publishing is how the monies from musical works are generated, handled, and distributed. This book goes beyond the pay one is stipulated to receive and explains the origins and derivations of such stipulations. Mr. Whitsett has amassed IMPORTANT information here... good for him... great for us.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Normally, these type of books are very boring. But this one isn't. It's easy-friendly reading. Recommended!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the craft and business of song writing",
        "description": "The essential guide for success in songwriting In this comprehensively updated 3rd Edition, John Braheny teaches you the craft of songwriting and then goes behind the scenes of the music business to unearth insider secrets that will make your songs stand out. You'll find exercises and anecdotes to help you: -> Develop a \"songwriter's consciousness\" for picking out original ideas -> Collaborate effectively with co-writers -> Break into songwriting for film & TV, children's music, and commercials -> Use the internet to best advantage for pitching songs, networking, and publicity -> Understand the business of demos and song contracts Braheny also brings you up to date with ongoing changes in online digital song distribution, podcasting, song-pitching services, home recording technology, production music libraries, and web hosting services. It's everything you need to know to make your mark on the world of music!",
        "authors": "['John Braheny']",
        "infoLink": "http://books.google.com/books?id=uK1PEAAAQBAJ&dq=The+craft+and+business+of+song+writing&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The first Edition of the book, was a must read, now this 2nd Edition, updated with new information and current song references, is also a must read for everyone that writes songs. The most complete songwriting book, for beginning songwriters to the aspiring, to even pro writers will learn from the book. I often refer to it as \"The Songwriters Bible\", just full of information that we need in the world of songwriting.I have been a Nashville Songwriters Association International coordinator in Charlotte for (6) years, and do at least one activity or read a quote from a hit writer or music professional in the book at every meeting. This book is years of songwriting seminars and workshops all in one. The reader will learn just like the title says, the craft and business from someone who knows what they are talking about, and has led workshops for some of the best songwriters of all time, including the awesome Diane Warren and several other hit writers. John Braheny made a difference with hit writers, with myself, and other songwriters that I have recommended the book to in the past 14+ years of reading the first edition, and now the 2nd edition. I recomend this as the very first book for every songwriter to read and study. If you know someone who writes songs, buy the book for them, and a copy for yourself. Buy a highlighter or two, to use when reading the book. ...Doak Turner...",
                "review/helpfulness": "28/30",
                "num_reviews": 30
            },
            {
                "review/text": "One of my most basic problems when starting off as a songwriter, was the lack of background and knowledge on how to approach a new song. I am talking about your basic strategies and how to structure them into a final product. Where does one begin, what do you need to take into account, what to do first, how to approach rhyme, basic tips about melody, chords etc. I found this book to answer these type of questions in a simple and interesting way.The author is obviously a specialist with a very good track record. He taught me how to analyse existing songs to expand my knowledge. No more do I just listen to music, I learnt the skill to expand my songwriting knowledge whilst listening to other songs on the radio or on CD.I have learnt how to decide on a basic structure, how to approach the most important issue of finding a &quot;hook&quot; for your song and refining it to something useful. I have discovered that it is O.K. to rewrite songs, but I have learnt how to approach it. This book has taught me how to make songs more interesting and it has made songwriting a more interesting hobby for me.I think the most important lesson from this book is how to grow from a songwriter that tries to express his/her own feelings to himself/herself and a few close friends, to someone who can express his deepest feelings in such a way that his song could be loved by millions and could become a commercial success. It also contain an abundace of valuable information on the industry and how to promote your music.If I did not read this book I would have missed something for sure. If you are serious about songwriting you cannot go without this book.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Although this book isn't as comprehensive as others in the songwriting department, it presents information in a very concise and interesting format. It also has a comprehensive section (half the book) on the BUSINESS. It's a quick, easy read and definitely worth the price. But if you want to get serious about songwriting, you'll also need a book with more theory such as WRITING MUSIC FOR HIT SONGS.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "In this nearly end all, be all songwriters tome &quot;The Craft and Business of Songwriting,&quot; John uses a down to earth, layman's style and demeanor to clarify and communicate the intricacies of this &quot;oh so treacherous&quot; road of Songwriting. He has paid our dues so you don't have to! John has the experience of a seasoned pro, the wisdom of a great master of the arts and a personality that makes him one of the Just Plain Folks of the first order! And I know Just Plain Folks! Buy this Book if you are serious about understanding your craft and your business! Brian Austin Whitney, Just Plain Folks International Songwriters Organization",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "The book, whether he's talking about the creative process or the nature of the business, is filled with snippets of humour that made me chuckle. John starts out with exercises and suggestions about how to get your creative juices flowing. He speaks of using his guidelines as &quot;principles&quot; rather than as &quot;rules&quot;. After all, rules are made to be broken, right? Principles leave one much less constricted and guide rather than hem in. The book is designed with that in mind. There are examples and explanations about types of rhyme, different types of formatting for verses and choruses and even discussion about song dynamics such as changes in meter and density of lyrics. I'm only touching on a few of the *many* fine points raised. He even goes into details on different methods of writing music and talks about how to make the most of a collaboration along with the legalities involved. Mostly, the first section of the book dealing with the creation of the song itself, gets the reader *thinking*. I know from personal experience that I need exactly that when I'm sitting down to write. Where does one look for inspiration and what does one do with it once it's found? The second part of the book deals with the business - and that's where John's true mastery comes out in impressive detail. Having been involved in various parts of the business over a length of several years, he's very well suited to know what will work and what won't (though he's quick to admit there are exceptions to every rule). The business section deals with such gems as royalty questions, publishing issues, when and why to self-publish, how to choose a studio when making a demo and what you can get away with doing at home, and how to go about marketing your music. The bibliography even makes a very handy reference guide to trade magazines, songwriting organizations and other resources as well as many other books on the subject of songwriting. John addresses every point with his humorous, no-nonsense narrative and quite apart from being an extremely handy resource, it's a pleasure to read. I still don't believe he got all that information into one place. Talk about &quot;bang for your buck&quot;! This is a keeper I'll be going back to on a regular basis.--Jodi Krangle ~ The Muse's Muse ~",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is the most comprehensive, well rounded book on the subject of songwriting by a man who is considered the formost authority by many. As founder of the Los Angeles Songwriters Showcase, John Braheny has earned the respect and admiration of the songwritng community at large.What makes this book so powerful is John's unique ability to cover the craft of songwriting equally as in depth as the business end. Therefore, having this much information on both aspects of songwriting makes this my number 1 choice as a point of reference for all related topics. Think of this book as a very good investment if you wish to pursue songwriting as a career.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the history of musical instruments",
        "description": "Written by a distinguished musicologist, this comprehensive history of musical instruments traces their evolution from prehistoric times in a fusion of music, anthropology, and fine arts. Includes 24 plates and 167 illustrations.",
        "authors": "['Curt Sachs']",
        "infoLink": "https://play.google.com/store/books/details?id=W615TIDz97UC&source=gbs_api",
        "review": [
            {
                "review/text": "As it is really the first complete work on the history of musical instruments, this is a foundational text. In the sixty years since its publication, though, opinions and interpretations have changed, and better research has been done.Nonetheless, the very readable style and global scope make this a worthwhile investment. The illustrations are very good for the time it was published. The organization is clearly structured by chronology and geography, yet connections are made across these boundaries. I enjoy the book immensely, both as a reference and for pleasure.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book provides a thorough description of the evolution of musical instruments from a multidisciplinary point of view from prehistoric times to mid-20th century. It comprises most historical epochs and geographical regions.Good things about the book: it's a classic, very comprehensive (except for the electrophones), very clear in the technical descriptions, nice figures and pictures (although not enough for the many instruments discussed), it's a must-read for people interested in musical instruments and its evolution. I've learned a lot reading the book.Bad things: it's aged in many respects. The language isn't politically correct when referring to some countries and peoples; it's too European-focused; gives too much importance to several simphonic orchestra instruments in comparison to other very popular instruments (the guitar family and its evolution is poorly treated, for instance); the electrophones are very badly treated and with some contempt. I know this is a 1940/1968 book and the electromechanical and electronic instruments were still in it's infancy, but some were already there (theremin, ondes Martenot, electric guitar, early synths) which would have deserved a much better treatment. Finally, I didn't like the author's remarks about some other people's work. Although he is an acknowledged scholar, sometimes he sounds very petulant.I also disagree with the author in some technical aspects. For instance, his classification of musical instruments, although universally accepted, has several weak points in my opinion. Many scholars have followed Sachs' terminology too literally; that's why nowdays some people call 'lute' to any stringed instrument with a handle and neglect its original local name. The results is that a Spanish 'bandurria' is a 'lute' as well as a German 'Laute', or a North African 'gnbri'. That is very confussing and wrong.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "intelligent decision support methods the science of knowledge work",
        "description": "This is a comprehensive explanation of how powerful technologies work in business, using a pragmatic business approach in describing when and how they should be used. Detailed case studies are provided in management information systems, information systems, computer science, and management. The text focuses on modeling techniques such as rules, case-based reasoning, fuzzy logic, neural nets, genetic algorhithms and machine learning.",
        "authors": "['Vasant Dhar', 'Roger Stein']",
        "infoLink": "http://books.google.com/books?id=lvgYAQAAIAAJ&dq=Intelligent+Decision+Support+Methods:+The+Science+of+Knowledge+Work&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "These authors have also written a book titled &quot;Seven Methods For Transforming Corporate Data Into Business Intelligence&quot;. The two books (&quot;Intelligent Decision Support&quot; and &quot;Seven Methods&quot;) are virtually identical. They have the same content, the same graphics, the same layout, the same case studies. The basic content (first 202 of 250 pages) is word for word, page for page IDENTICAL. The ONLY diffference between the 2 books is that &quot;Seven Methods&quot; includes suggested solutions for the case studies (adding about 1 page for each of the 7 case studies. If this book (&quot;Intelligent Decision Support Methods&quot;) appears to be of interest, buy &quot;Seven Methods For Transforming Corporate Data Into Business Intelligence&quot; instead. Do NOT buy &quot;Intelligent Decision Support Methods&quot;. It is twice as expensive with no benefit.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The book presents an excellent treatment of intelligent systems technology. It provides enough technial details in a non-technical language to help understand the technologies. In addition, the technologies are described within the context of business problems that they can help solve. By providing this very well balanced approach, this book fills an important need.An excellent book for the business reader interested in intelligent technologies or a technologist interested in business applications. Also, serves well as an excellent textbook.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "banking barrons business library",
        "description": "A summary of how small-to-medium-size businesses fulfill their banking needs. Topics include understanding business loans and their details, account analysis, evaluating a bank's services and how they fit specific business needs, a list of internet resources, and much more. Titles in Barron's Business Library series are currently being revised and updated, and re-set in an attractive new paperback format. They are written especially for men and women starting a company or managing a small-to-medium-size business. Emphasis is on practical problem solving, and examples cited in these books are based on realistic business situations.",
        "authors": "['Theodore A. Platz', 'Thomas P. Fitch']",
        "infoLink": "http://books.google.com/books?id=b5lUswEACAAJ&dq=Banking+(Barron%27s+Business+Library)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I purchased this book to gain a better understanding of the industry as a whole. It served it's purpose! I am new to working in banking and I will have to learn how my bank operates, but now I can ask the right questions to speed up the process.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a starting foundation for entering banking (specifically when I joined IndyMac Bank). When I joined retail banking (previously only having worked in Investment Banking at Morgan Stanley) I was able to expand my knowledge on various areas of the retail banking beyond just what I-Banking had taught (e.g.,, valuation, SEC II & SEC III stat techniques, tax implications and flippying and insider trading tips of how to find/negotiate the best properties).I would highly recommend this book to others in this field.- Jameson Thottam",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Includes a lot of information about banking but not in much detail. A handy reference afterall. But for the folks who want more in depth knowledge into banking, go for a larger volume.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the professional bondsman how to start and operate your own bail bond agency",
        "description": "This new Second Edition is packed with information that is yet to be found anywhere. It is the source for complete information about how to start & operate a Bail Bond agency. This acclaimed book has been featured in many business opportunity magazines & is considered the bible for most in the industry. Topics include: starting your business; staying in business; negotiating & when to write a bond; dealing with bounty hunters & bail jumpers; plus more. In addition to the expert focus on daily operations of the business, actual cases are described & discussed. Preparing for the Bail Agent's exam & possible questions are also featured. The easy-to-read format includes documents & forms used in the business as well as a glossary of terms. A review by a veteran Bail Bondsman, C. A. Johnson, states: \"Absolutely essential, serves as a great reference book as well as a good read.\" To order, call or write The Dragon Press, 4230 Del Rey Ave., Suite 445, Marina Del Rey, CA 90292, (213) 913-2277.",
        "authors": "['Richard Wills']",
        "infoLink": "http://books.google.nl/books?id=U2XxPQAACAAJ&dq=The+Professional+Bondsman:+How+to+Start+and+Operate+Your+Own+Bail+Bond+Agency&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My mother always told me not to say a word if I didn't have anything nice to say. I was going to take that advice but felt compelled to speak up when I saw all the rave reviews appearing.This book was very disappointing and painful to read for a number of reasons: 1) The font size was too small; 2) It was poorly written; 3) It lacked logical structure.My eyes hurt from straining to read the text. I believe it was an Arial font size 8. It is my belief that this approach was a misguided intent to save paper (and printing expenses) at the cost of your eyes.I'm no English major but this book was written as if some country farmer had taken dictation word-for-word -- complete with run-on sentences, grammatical errors, and misused clich&eacute;s. My favorite was the use of \"spending your wheels\" instead of \"spinning your wheels.\"I am confident that the author has the functional knowledge to be a bail bondsman. However, I question his ability to clearly and coherently convey that knowledge to the written form of the English language. I recommend that the author contract to have future editions proofread.Reading the other reviews...left me with one question: Did we read the same book?",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "&quot;The Professional Bondsman - How To Start and Operate Your Own Bail Bond Agency, 2nd Edition&quot; is the first and only book on the market that details the ins and outs of this very profitable and very secretive business. This book provides the reader with real life situations encountered in the business. The reader will learn how to write a bond, when to write a bond, now to deal with indemnitors, bail jumpers, the courts, how to file motions and most importantly, how to operate and stay in business. Also included, you will find a glossary of terms, forms and documents used in the business as well as actual case studies. This book is used as a training manual by many insurance agencies across the country. It's easy to read and serves as a great reference for the novice as well as veteran bondsmen with many years in the business. Whether you aspire to become a bail bondsman, already in the business or just want to know what to do if a friend or family member lands in jail, this book will provide you with the most current information that can be used immediately.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The book helped me prepare for the bail bond exam. Without it I never would have had a clue. Nothing comes close to this book that I've seen.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Being new in the business (secretary of a bondsman), I wanted examples and info on bail bonding. I found the book very informative. The writer got the point across and briefed me on the business, and that is what I needed. It actually was the only book available on this subject! (thanks Mr. Wills) I am glad I discovered this book and am very happy with the information I received.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "it investment making a business case computer weekly professional series",
        "description": "Frequently not enough attention is given to producing a comprehensive business case or to producing an economic justification for an information systems investment. In fact many organizations are not clear as to what constitutes a sound business case and how to go about producing one. This Professional level book for the Computer Weekly Professional Series will show how to go about justification for I.T. spend. This book is designed for all those who are involved in the decision to invest in information systems. This book is especially relevant to senior business executives, senior financial managers and IT executives. Business consultants, computer and corporate advisors will also find the ideas and material addressed in this text of particular benefit as will anyone involved in corporate and strategic planning.In addition, senior students such as those working towards their MBAs will find this book of use.A business case is a statement or a series of statements that demonstrate the economic value of a particular intervention, a course of action or a specific investment. A business case is not simply a financial forecast of the hardware and software costs and the expected benefits. A business case for an information systems investment involves a comprehensive understanding of both the likely resources as well as the business drivers which will assist business managers improve their performance and thereby obtain a stream of benefits from the investment.In general there are approximately six steps in producing a business case for an information systems investment.1. Determine the high-level business outcomes that will be clearly and comprehensively expressed as a set of opportunities the organization can take advantage of, or problems that need to be rectified.2",
        "authors": "['Dan Remenyi']",
        "infoLink": "http://books.google.com/books?id=8LCEswEACAAJ&dq=IT+Investment:+Making+a+Business+Case+(Computer+Weekly+Professional+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The primary audiences of this book are: (1)IT governance boards for whom the summaries at the end of each of the eleven chapters will provide ample information, (2) program management offices, which can use this book as the basis for business case standards, policies and procedures, (3) upper IT management who will greatly benefit from the skillful blending of strategy and cost management, and who will also get excellent ideas about how to better support their business customers, and (4) project managers. For the last group this book represents a valuable resource - PMs managing projects in accordance with the British standard called PRINCE2 will have a ready made reference for business case development, which is a requirement for the Managing Stage Boundary (SB) process, and those who are working within the U.S. standard defined by the Project Management Institute's Project Management Body of Knowledge (PMBOK) will find that this book will greatly augment the scope knowledge area and associated processes.Each chapter follows in a sequence. Chapter 1 introduces the author's model and how it will benefit you. Pay close attention here because chapters that follow require hard work and commitment from many stakeholders. This means resistance, and you'll find the material here useful if you wind up in the odd position of making a *business case* for implementing a business case methodology.Chapter 2 covers preparing a business case. I like the way the author breaks down the elements of an IT business case and how it's cast into a process. The next chapter discusses how to objectively evaluate a business case and is another highlight of this book. Strategy and analysis are blended in Chapter 4, which covers the business outcome. This chapter has some interesting approaches, including the development of a macro model (with an example provided), and how this is decomposed into micro models that examine factors and assumptions from which to derive a quantifiable business benefit. What makes the approach here so interesting is the relationships between and among the micro models are also carefully examined using a &quot;Meso&quot; model (this model type is commonly used to analyze complex physical interrelationships in weather forecasting). Common sense needs to be applied here - you will not use the entire array of techniques to support a minor project. On the other hand, a strategic decision like web-enabling an enterprise or a high-value e-commerce initiative certainly should be subjected to the painstakingly detained process given in this chapter.Stakeholders, strategic alignment of IT to business and technology issues are the topics of Chapters 5 through 7, each of which contains essential information for implementing the author's business case approach. Project managers will greatly appreciate the material in Chapter 8, which covers risk identification and management. I like the 3x3 IT project risk framework provided. Chapter 9 is a thorough treatment of business case accounting (also known as cost/benefit analysis). Here Mr. Remenyi dissects the topic with precision, covering cost items, estimate sources (cost and benefit), and a number of analysis techniques. This is one of the best chapters in my opinion.Chapters 10 and 11 are devoted to evaluating, weighing and prioritizing business cases, and how to effectively use business cases in conjunction with project management. The latter is completely consistent with the PRINCE2 method I mentioned earlier. The remainder of the book consists of a case study, and appendices that provide an extensive collection of questionnaires and forms, and a nicely done description of financial measures used in cost-benefit analysis.It all boils down to whether or not you are serious about developing business cases and doing them right. If you are this book is essential. I give it five stars for thoroughness and the added value of more forms and checklists than I've ever seen collected between two covers.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "The book is quite superficial, it states the obvious and does not go enough into detail in order to be of any practical value.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "confessions of a record producer 2 ed how to survive the scams and shams of the music business",
        "description": "(Book). Now completely updated and revised, this streetwise guide helps musicians, producers, and others protect their rights and preserve their assets in today's cutthroat music recording industry. Industry insider Moses Avalon tells it like it is how producers dip into budgets, artists steal songs, labels skim royalties, lawyers write contracts in code and shows readers how to survive in the wake of these and other unfortunate truths. Deconstructing actual major record deals, Avalon dissects each party's involvement and perspective: what they actually do, how much they get paid, and what's really on their agenda. This second edition examines the impact of recent developments in the industry, including Internet file sharing and streaming, mergers and acquisitions, trade associations and their agendas, and more.",
        "authors": "['Moses Avalon']",
        "infoLink": "http://books.google.com/books?id=5b435hAb2CUC&dq=Confessions+of+a+Record+Producer,+2+Ed:+How+to+Survive+the+Scams+and+Shams+of+the+Music+Business&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I met Moses Avalon at a conference. He admits Moses Avalon is a fake name (supposedly his real name is Josh melville). When we talked he spent the conversation trying to get me to go to a seminar-a seminar designed for lawyers although Moses has no law background. rumor is that he was never a great producer and created the personna of moses avalon to make money by selling his book. Kind of a sinner turned saint to enlighten innocent artists. It's worked. He is without a doubt a great self-promoter. I've read the book and there is some good info but other books have the similar info (what they won't tell you about the music business is a great book).However, I have a real problem with this man turning himself into a fictional character, misrepresenting himself all to make a buck. I asked him why he changed his name. His reply was that he couldn't legally use the wrong-doers exact names without getting himself sued. So I said why was it so important to name names. he said he thought it was important to make sure they were exposed. hmmmmm. so to damage the careers of a few people, he decided to discard his whole identity. That didn't set well at all with me.Also I have a problem with his negative comments regarding CD Baby. I am not friends with Derek Sivers, but I've heard him speak and met him a few times. This guy works his butt off and has opened more doors for independent artists than anyone else in the music business.I am not saying 'moses avalon' doesn't have any information to give because he has been around the business and is very smart. However I do doubt his credentials and wonder at the extremes of his behavior. But there are real producers who have written books/articles with actual credentials. I'd rather get their advice.",
                "review/helpfulness": "14/22",
                "num_reviews": 22
            },
            {
                "review/text": "This book provides some useful information, but contains quite a few errors. It seems Mr. Avalon (who for some unexplained reason is apparently afraid to use his real name) has a bone to pick with the music industry. Maybe he's one of those guys who just couldn't make it and is resentful. For a more accurate take on the music biz, check out Don Passman's \"All You Need To Know About The Music Business\" and \"The Musicians Business and Legal Guide (by various authors). Also, there's a really good, easy to understand book on copyright law called \"Music Copyright For The New Millennium\" which is worth a read as well.",
                "review/helpfulness": "14/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book takes you through almost every aspect of the music industry. He tells you of scams of entertainment lawyers to dirty tricks by the big labels. At the same time he opens your eyes to just how successful you have to be to make money of your recordings (more than you think). A must read for people even considering a career in the music industry. All this is done with a sense of humor and language you can understand. Complete with real life examples. Great book.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "You dont have to be aiming at a future record deal to be interested in such a book. Even as an avid music fan you will find information and inside knowledge here that will enlighten you in the mysterious and more often than not wicked ways the music industry works.It's a great eye-opener then, one that will obviously be more useful to musicians who are either looking forward to getting a deal or were not satisfied in their initial one. Written by a producer with years-long experience in the business, it provides crucial info on what to be careful about concerning:-contracts and the various angles one should be careful in order to avoid a bad deal (a story often read about concerning groups or solo artists).-differences in signings between majors and indie labels. An in-depth analysis on the difference between an indie label and a major.-an explanation on the finances of such deals.-copyright and sampling analysis.The above are just headlines of course, as each chapter is very comprehensive and covers to a very adequate degree the subject it deals with. Written in simple language so that all the legal mumbo-jumbo becomes understandable for the layman, and with a healthy dose of humour and cynicism to drive the various points home, it's a great book to go through. Categorised according to subject for easy and simple reference.\"Confessions of a Record Producer\" demolishes a lot of myths about the music business and reshapes certain false sources of ill-gotten optimism that new musicians nurture and which lead them into well-documented traps. What in fact is introduced here first and foremost is hardcore realism. Without that element anyone entering in negotiations with the music industry is a sheep among wolves.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Before reading this book I was very anxious to enter the music world as a producer, having a slight idea of what I needed to do to accomplish that goal. Well, I realize that I did not even know the difference between a Label, a record company and a distributor and the role each plays in getting a record to the shelves of Sam Goody or HMV at your local mall. Moses breaks down every aspect of the Music Biz, from writer, to artist, to producer, to session musician and even explains how each gets paid! He Even explains why you see so many logos on the back of every record you buy. It is an effort of many people and many different companies in direct collaboration with each other.This is very valuable information for anyone in the Music Biz. I feel that I am better prepared now than I was 4 days ago..the time it took me to read this book I simply could not put down once I started reading.Mr. Avalon explains all the \"Industry Jargon\" in plain simple english anyone with at least a high school level education can understand.The best part of the book is how he even breaks down the \"dirty\" scams that everyone tries to impose on an artists/producer or writer.I Pity the fool who signs a contract with a major record label for 3 Million dollars and 5 albums w/o reading this book. They will, like TLC, file for bankruptcy after selling 11 million records..find out why...",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "When I picked up this book I expected another boring book from some out of touch \"has been\" trying to make a buck. Instead I found a book full of insight. Half way through the book I was blown away with the amount of knowledge (and I still had half a book to go).Fact: the music business is full of weasels. They feed on the excitement of new (naive) artists, get them to sign a poor contract, and milk them dry. Well this book shows you the business from many including the artist, producer, label, and lawyers side (and more).From assembling your team of managers, lawyers, producers, to payola and kickbacks, to copyrights, publishing royalties, sneaking lawyers tricks Moses covers everything in great detail. Typically when a book is this thorough there are parts that you end up skipping as it doesn't apply, but Moses insights of the \"squeezing\", back stabbing, and shenanigans kept me glued to every page.If you are thinking that life would be great if you could just get signed to a major label, you REALLY need to read this. Moses shows you how you can sell 1,000,000 records and still owe money (if you're not careful). He shows you every detail, and then brings it home by breaking down in a table format (making it easy to see exactly where the money goes). The section titled \"A Major Label Deal is like having a Credit Card at 66% was extremely eye opening.OK, anybody can throw number on a page. So who is Moses Avalon? It turns out he has worked with Warner Brothers, Atlantic, and BMG. He has worked Grammy wining artists (he has worked on 5 platinum recordings). He is also a composer who has had his compositions used in commercials, and award winning independent films.If you are someone looking for management, or getting airplay now and on the verge of breaking, READ THIS BOOK. When snakes surround you, it pays to know which ones are poisonous.Dave JacksonMusician's Cyber Cooler",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "IF YOU PLAN TO WORK IN THE INDUSTRY YOU SHOULD READ THIS BOOK. It describes royaties to artist and how you may not see them. Scams pulled on bands.Items that should be in your contracts. How record companies rip you off. Examples on how songs are stolen. How producers hide money for themselves. Independent labels, Majors and Distribution both Major and Indie. Moses Avalon takes you from the first steps through the entire music industry process and tells you how much money you will have at the end(theorectically). This book is the one you should buy before all others.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is my new favorite book on the music business, and I've read a lot of them! It went straight to the top of my required reading list for anyone interested in a music business career. This book tells you what the other books won't. This is not a &quot;how to&quot; guide to music business success, but it will tell you what to watch out for, and makes you reconsider if going after the elusive Major Label Record Deal is really worth it or not. It breaks down the numbers of a typical recording deal in terms that everyone can understand and shows you how you most likely will never see ANY record sales royalties from a major label deal as a new artist. This book prepares you so that you won't get taken advantage of by anyone in the music business.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Not only is this book (and it's sequel, &quot;Secrets of Negotiating a Record Contract&quot;) the real deal, so is the man who wrote it. I was so impressed by this, his first book that I contacted him as a consultant on a producer/artist agreement I was negotiating (I am a producer). My goal was to come up with something that was actually fair to both parties and Moses got us to that point quickly. His suggestions were works of innovation that surprised and satisfied everyone.I also attended his 2-day seminar which dissects recording contracts. Here he dispelled the many misconceptions I had about record companies and their contracts AND he helped me to understand what is really being said in these contracts (and it's scary!).He is not a lawyer, but one of the most insightful men I've met. Lawyers pay HIM for his advice. He REALLY understands contracts and explain things in a manner no one else seems to be able to do - it must be a sixth sense.. Highly recommended reading. Both his books should be permanent reference books for anyone in the music business. Besides, they're fun reads, unlike most other &quot;how-to&quot; music-biz books.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I'm only half way through the book at this point, but I must say, if the book ended here, I would not be disappointed. This is an excellent educational and reference guide especially for someone aspiring to be a part of the music business. It is packed with tidbits, very helpful information and insight! He gives it to you straight! I have read a lot of other music industry books, but this book is highly recommended and worth the money, no hands down! This is definitely a keeper!",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the new harvard dictionary of music harvard university press reference library",
        "description": "Revised edition of Harvard dictionary of music.",
        "authors": "['Willi Apel']",
        "infoLink": "http://books.google.com/books?id=jbSMrlb9MFgC&dq=The+New+Harvard+Dictionary+of+Music+(Harvard+University+Press+Reference+Library)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "942 pages jam-packed with information about music. If you are skittish about this rewrite of Willi Apel's classic dictionary, don't be. Yes, it does have a host of non-European entries, politically correct in this age of diversity. No, it does not overwhelm (nor does it inconvenience you in reaching) the European material you need to get your hands on quickly. Recently amazon.com raised its price for this book by a couple of dollars. Believe me, it's still an incredible bargain. Even if it weren't on sale at all, it would still be a book that any serious music student would want to own and consult frequently. I've owned the new Groves Dictionary ever since it came out, and guess what: some entries that do not appear in Groves do appear in the New Harvard Dictionary!",
                "review/helpfulness": "100/102",
                "num_reviews": 102
            },
            {
                "review/text": "The two reviews already submitted of this dictionary range from the sublime to the ridiculous. Unfortunately the poor review also contributed a rating of one star, which is averaged with the good review to yield an overall rating of 3 stars. The effect of this is to perhaps cause a modern shopper to purchase the older edition of this work edited by Willi Apel, instead of this more up-to-date volume.It seems that the negative reviewer is reacting to the presence in this dictionary of new entries such as &quot;Bluegrass Music&quot; or &quot;Rock 'n' Roll,&quot; as if the inclusion of such entries automatically removes other entries relative to 'classical polyphony'--evidently a topic close to his heart. Polyphony is covered in the Randell edition by it's own entry and through numerous other articles such as &quot;Counterpoint,&quot; &quot;Palestrina style,&quot; and others. Just as a modern dictionary of English must cover the language as it is really spoken, including slang and profanity, a modern music dictionary must also cover music as it really is. A good dictionary cannot assume the ascendency of one particular type of music or musical point of view, and ignore all other trends and developments. The expanded treatment of &quot;Blues,&quot; for example, is especially welcome. No service would be done for modern readers if common musical terms were ignored by the editors.Both editions of this dictionary are fine references. The Apel edition served the prior generation of readers very well. The new edition by Randell builds on the strengths of its forerunner and adds much new information. At the same time, the new edition does not ignore the categories covered by the earlier edition.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "This is absolutely the finest music dictionary that I have used. It is concise in its definitions, and very useful with the information presented. Whenever I need to look just what exactly &quot;Die Zauberflote&quot; is, I often find myself reading on and on and on for pleasure. This is absolutely the only dictionary that I've ever found myself captivated by. I definitely recommend this fine musical reference.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a great reference book. This is just as good as any of them. It happens to be just a little less expensive than the Oxford Edition and you still get the same results. The explanations are very easy to understand and the dictionary explains in detail whatever it is you want to be informed about. A great buy that will last forever.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I got this book as a present from my flute teacher, and was a bit skeptical of what i could get from a music dictionary, but now i understand. I love this dictionary, sometimes i just pull it out of my shelf and open it to a rondom page to see what new music terms i can learn. i reccomend it to all musicans and even to some non-musicans who are interested in music.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "I recieved this book as a christmas present from a family member. Upon looking through it I found just how helpful it really is. I plan on getting a career in music education, and although I have been studying music for about 6 years, there is material in the book that I did not know. It is excellent if you need more information, or just want to know more about music and music theory. I have not looked at the older version, but am sure that it is possibly just as informative as this one is. However, I strongly feel this is a good peice of work, and very educative for people like myself who just want to know more.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "harvard dictionary of music",
        "description": "This classic reference work, the best one-volume music dictionary available, has been brought completely up to date in this new edition. Combining authoritative scholarship and lucid, lively prose, the Fourth Edition of The Harvard Dictionary of Music is the essential guide for musicians, students, and everyone who appreciates music.",
        "authors": "['Don Michael Randel']",
        "infoLink": "https://play.google.com/store/books/details?id=2udRDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This reference book has it all. I have never been disappointed when looking up a musical term -- everything from musical periods, notation, tempo markings in all languages I've come across, descriptions of musical forms, and theory concepts. It should be on the bookshelf of every serious musician.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "This is the dictionary that I used when I attended the USC School of Music. The entries are unsurpassed so far as classical music is concerned, but I did have to look for other resources when I needed accurate indepth information on jazz or popular music. It would be difficult in this day and age to have one all-encompassing reference on every musical style in existence, so I think that the work stands on its own and may dilute its effectiveness if it were to overextend itself by trying to accomodate everybody. As a former composition student and someone who scored in the top 3% on the music theory portion of the graduate record exam, I wholeheartedly recommend this dictionary.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book, together with 'Baker's Bigoraphical Dictionary of Musicians', is one of my most frequently used reference books. The edition I have is Willi Apel's second edition, revised and expanded; there is a later Harvard Dictionary of Music done by another editor, but this one has been on my shelf for over twenty years, and I have come to find it incredibly useful for ready reference as well as giving information for further research.Most entries have citation and bibliographic information so that further research becomes an easier task; my one regret in this direction is that there has been so much scholarly work done in the past thirty years since this publication that is missed from this listing, but much of music reference material is not that time sensitive.This is a very comprehensive text with regard to music technical information, particularly when it comes to ancient, medieval, Renaissance, Baroque, Classical and Romantic periods. In the modern area, it is a little less helpful, and does not really address the area of pop music at all.The one thing I could wish for would be an index of some sort in the rear; even designed as a dictionary, many articles become encyclopedic in length or nature, and an index would have made this that much more useful. However, there is a good deal of cross-referenced material, making it easy to use in research mode.The entries themselves range from just a few words (for example, Gusto, con [It.] - With style, with zest.) to multi-page entries (examples include the entries on countries such as France and Germany, discussing their histories of musical tradition). There are entries of history, of technique, of composition, of instruments, even of the mathematics and physics of sound, harmony and rhythm. Many major opeas and other musical pieces have entries - however, this is not a biographical dictionary, so there are very few entries of this sort. The listings go from Mozarabic chant to Mozarteum, for instance, without Mozart between them.One might have minor quibbles here and there with the data (and no such undertaking as massive as this dictionary can be without fault and error), but in general, this dictionary serves the general seeker and the student of music very well.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the naked corporation how the age of transparency will revolutionize business",
        "description": "Welcome to the world of the naked corporation. Transparency is revolutionizing every aspect of our economy and its industries and forcing firms to rethink their fundamental values. We are in an extraordinary age where businesses must make themselves clearly visible to shareholders, customers, employees, partners, and society. Financial data, employee grievances, internal memos, environmental disasters, product weaknesses, international protests, scandals and policies, good news and bad; all can be seen by anyone who knows where to look. Don Tapscott, bestselling author and one of the most sought after strategists and speakers in the business world, is famous for seeing into the future and pointing out both its forest and its trees. David Ticoll, visionary researcher, columnist, and consultant, has identified countless breakthrough trends at the intersection of technology and business strategy. These two longtime collaborators now offer a brilliant guide to the new age of openness. In The Naked Corporation, they explain how the new transparency has caused a power shift toward customers, employees, shareholders, and other stakeholders; how and where information has exploded; and how corporations across many industries have seized on transparency not as a challenge but as an opportunity. Drawing on such examples as Shell Oil's reinvention of itself as an environmentally focused business, to Johnson & Johnson's longstanding and carefully nurtured reputation as a company worthy of trust-as well as little-known examples from pharmaceuticals, insurance, high technology, and financial services-Tapscott and Ticoll offer invaluable advice on how to lead the new age, rather than simply react to it. The Naked Corporation is a book for managers, employees, investors, customers, and anyone who cares about the future of the corporation and society.",
        "authors": "['Don Tapscott', 'David Ticoll']",
        "infoLink": "https://play.google.com/store/books/details?id=HcBWcUZo9p8C&source=gbs_api",
        "review": [
            {
                "review/text": "This is a very good book which has opened my eyes into looking for companies that are honest and transparent with their customers, shareholders and employees. This book calls companies to stop hidding behind secrets that destroy corporations (Enron and others) and start being transparent, by providing informaiton to your customers, shareholders and employees. Companies need to show that they are responsible to the environment, to their stakeholders and other corporations. This book is calling companies to be ethical in their daily transactions and gives example after example of corporations who have fallen because they tried to hide the truth. This book shows that we need strong ethical people to run todays corporations and we as investors need to reward companies who are starting to become transparent. At the same time we need to punish companies who are not taking responsibility for their actions and wrong doings. This book also points out that most investors are blind with their investments and don't even realize what their largest investment is invested in (for most people their largest investment is their pension plan, and I admit I don't know what mine is invested in). This is a very good book and has opened my eyes to at least see what's going on out there and provided me with the tools to do some research and make sure I reward companies that are making an effort to save our environment and be honest with employee's, investors, stakeholders, and customers. The one question I have is are we raising a generation that will be able to have thequalities needed to run the corporations of tomorrow... Great book...",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The Naked Corporation provides the best business case to date for corporate openness and transparency. It convincingly argues that the ability of our major corporations to practice openness, honesty and trust is today much more than an off balance sheet activity measured using traditional tactics such as strategic philanthropy or corporate spin doctoring. The authors compellingly argue that today's technology and information-centric business environment is forcing companies to build characteristics of transparency into the day-to-day operating environments of their companies. With rich data and case studies, the book delivers clear and irrefutable evidence that, in the age of globalization and information, those that reject transparency in favour of the information hoarding, deceitful practices of the past do so at the risk of painful and powerful rejection from customers, employees, communities and shareholders. A must read for those who want to understand some of the context behind Enron, Worldcom and other crises of transparency and for those who want to begin to execute new practices of openness inside their own organizations.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Obviously, The Naked Corporation was a difficult book for Tapscott &amp; Ticoll to write. Perhaps their best book yet, but most likely the book that will attract fewer readers than one would expect. Why? - because The Naked Corporation describes a significant shift in business. Many companies will fear or try to ignore the shift and a few companies will embrace the shift. The Naked Corporation is a must read for executives and managers of performing/troubled/transitioning companies. Tapscott &amp; Ticoll provide a compelling prescription for business success. Reading The Naked Corporation, I identified 24 &quot;gems&quot; (actions) to improve corporate performance and competitiveness. If you can't find at least 24 &quot;gems&quot; for your company to improve performance and competitiveness, then I suggest you ask Tapscott &amp; Ticoll to help you, or get them to write a followup! Good luck and good business!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Tapscott and Ticoll have written another very detailed, practical and profound book about business that shows their knack for zeroing in on the heart of a momentous change that is stirring in the world and explaining it all clearly and completely. At the heart of The Naked Corporation is the notion that shareholders and other stakeholders are empowered by technology to know more and more about organizations faster and faster, which in turn greatly emboldens them to take action based on their new knowledge. In other words, perhaps the old adage \"there's one born every minute\" needs updating. They're still being born, but hopefully now only a few per hour? Corporations \"getting naked\" can't be good news for marketing departments. Their job can no longer be about creating a nice rosy image; companies and products must be the image - for real. Yikes...David Brett, Founder, Knexa.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Don Tapscott and David Ticoll's book is truly much needed in America's befuddled corporate climate. The authors show how companies do serious damage to themselves and others by concealing the truth and not playing straight. Tapscott and Ticoll present compelling arguments for corporations to, like they are, be honest and forthright, showing how the truth can directly benefit everything from brand value to everyday operations. The Corporation is packed with real world examples, a clear indicator that this is not just another management book, but rather the truth. What more do we need in this odd time we live?",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book explains how transparent and open the world has become. But better than that, it articulates why it is benificial. With so much information at our disposal, it is at times overwhelming, is it not? This books will show the way to cope in the jungle of infomation.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Finally, the book we have all been waiting for, which explains, in no uncertain terms, the emerging age of business which requires corporate responsibility and accountability via transparency. The book outlines the systemic changes, brought about by technology and other factors, which are driving this change. Most importantly, The Naked Corporation explains stakeholder engagement and empowerment in detail - which is important for all of us to understand....this book is not only a \"business\" book, but a book for those of us whose lives are affected by business - all of us. It outlines the power we all have as stakeholders to effect change. The book is well-written and well researched. I find the concepts and the diagrams very useful and easy to follow. Great job!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Tapscott and Ticoll launched the Digital 4Sight research program two years before the buzz of ethical misconduct by Enron, Tyco, Woldcom, Arthur Andersen and others finally set off alarm bells and made front-page headlines. Once again, they are ahead of the curve in accurately predicting and understanding critical businesss and cultural shifts that have enormous impact. Their thesis that greater transparency is the core of the solution seems like a &quot;no brainer&quot;. However, the response of most corporations seems to be shallowly focused on compliance with S-OX regulations--missing the point of the exercise. The authors argue that this is the time to rethink the fundamental values and leadership of the corporation in context of external and internal stakeholders. It is heartening to see examples of leaders that live and manage to their values and take the bold steps to go beyond focus on their quarterly financial results and regulatory compliance. This book convincingly outlines both the business rationale and the path to a return of trust and loyalty in the instituions we invest in, do business with, work with/for. I see light at the end of this very dark tunnel in the evoluion of business and personal conduct, only if we all take action and accountability.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a practical guide to crm",
        "description": "In today's global economy the customer has more and better choices than ever before, bringing on one of the biggest challenges the business community faces today - customer loyalty and retention. To thrive in today's customer-driven economy a company need",
        "authors": "['Janice Reynolds']",
        "infoLink": "http://books.google.com/books?id=Ke8OtAEACAAJ&dq=A+Practical+Guide+to+CRM&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The author has clearly explained CRM, its premise, it application within the workplace, and its components, processes and technical underpinnings. The book provides the reader with a coherent definition and then backs it up with a CRM action plan that provides a distinct link to business essentials within the scope of a concise understanding of the broad range of processes that it takes to implement CRM. The author does a great job of explaining the necessity of bringing together the business, its processes and technology and does so in a very down to earth manner (no technospeak). The book then provides the reader with a very clear diagram of what is needed to bring a specific CRM application to fruition.This book provides a very balanced picture of CRM. So if you need to understand CRM, its value, how it relates to business processes and what it takes to implement it, this book is for you. The checklists are invaluable and it gives you basically everything needed for a successful CRM implementation.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The book should be on the reference shelf of any manager or executive contemplating, implementing or working with CRM since it does a wonderful job of covering the business issues and technical parameters and requirements of CRM. For example, the author goes into considerable detail about how and why CRM is important to meeting business requirements and devotes many pages to the vendor and partner selection process. Furthermore, the book covers CRM from not only the IT viewpoint, but also from the departmental manager and executive office's perspective. I think it would be hard to find a book with a more comprehensive road map to CRM. Yet, the book is an easy read.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "If you're involved in CRM, or are in a company that is considering CRM then this book should be your CRM Bible. It provides a thorough, well-organized treatise on all aspects of CRM. The author not only provides a full explanation of what CRM is and what CRM IS NOT, she also walks the reader through planning a business case, dealing with the human element, planning stages, project management and finally implementation. Every section is thoroughly covered, from RFP to vendor selection to outsourcing.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "business darwinism evolve or dissolve adaptive strategies for the information age",
        "description": "The survival of the fastest Information technology is now essential to business evolution.Companies that invest in IT as a future resource will live to seethe future. The rest won't. The hard reality of the new\"Information Darwinism,\" a term coined by author Eric Marks, isbrilliantly and provocatively described in e-Darwinism, a look atthe make-or-break impact of IT on accelerating the global strugglefor market share. The book offers a compelling look at just how theInternet has transformed business strategy and business strategycreation, IT strategy, and manufacturing strategy for manufacturingand service firms, and made significant inroads in driving revenueenhancement and cost savings as well as reducing a firm's time tomarket. The book also describes how much the ability to leverage IThas become a requirement for measuring-and selecting-futureleaders.",
        "authors": "['Eric A. Marks']",
        "infoLink": "https://play.google.com/store/books/details?id=JAtAvy9sOaUC&source=gbs_api",
        "review": [
            {
                "review/text": "Compelling insight on the importance of technology-driven business strategy. The only book that addresses this approach in a completely comprehensive way, challenging business leaders to rethink their approach to strategy and change. The &quot;flexing&quot; of business and IT architecture is thought-provoking, dynamic, yet critical to where business needs to be in the near future.And the &quot;evolve or dissolve&quot; subtitle best summarizes the nature of businesses today. I will read it again with my highlighter.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book helped me to rethink how I use the information available to me. It showed how to build information processes and businessinteligence into my core business operations. The case studies that were presented made the author's points even clearer. I would recommend this book to anyone who wants to ensure that their company continue to survive and profit in this age of abundant information.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Extremely informative with an interesting appeal to the modern world of technology and how it affects Business.This book provides an interesting and constructive overview on the implications IT strategy will have toward our next business era",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "optical switching and networking handbook",
        "description": "*Bestselling author Regis \"Bud\" Bates utilizes a market-driven, \"business needs\" approach to optical communications *Provides a concise analysis of systems and options without being overly technical and translates complicated jargon into clear business terms *Includes applications and implementation of technologies, regulatory and standards developments, product photos and descriptions, generic pricing, and business models",
        "authors": "['Regis \"Bud\" J. Bates']",
        "infoLink": "http://books.google.com/books?id=Xkmx-wWXBEYC&dq=Optical+Switching+and+Networking+Handbook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A topic that is comming of age. It is difficult to find much written material on the subject. If you have been looking for this type material, you have found a mother load! I am working in the telecommunication arena and am always trying to find material that discusses trends that are in their infancy.Mr. Bates has gathered a lot of information and has presented it in an interesting, readable manner. I have read a lot of technical material that has babbled on and on but not told you anything of interest. This book is succinct and easily readable. If you are a person working in the communications networking field or just interested in it, this book is a MUST read.Optical Switching is a major development in technology that you need to be familiar with to see where the industry is headed. I enjoyed the book and would recommend it to anyone with an interest in this area.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have been seeking information about optical switching and felt this to be one of the most informative books available. It is easy to understand for beginners and experts who work in a networking environment. I recomend this book to everyone who works in networking, and anyone who may have interest in networking.Senior Telephony Analyst FirstUSA",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "preventing internal theft a bar owners guide",
        "description": "It's an all new second edition of Robert Plotkin's best-selling book on theft behind commercial bars and how to prevent it. Losses due to theft can be staggering. Reduce your vulnerability by knowing exactly how employees steal and how you can stop it. The facts are clear. This book will pay for itself many times over, before you even finish reading it. This information is invaluable to the beverage operator.",
        "authors": "['Robert Plotkin']",
        "infoLink": "http://books.google.com/books?id=7YcHAAAACAAJ&dq=Preventing+Internal+Theft+:+A+Bar+Owners+Guide&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I wish I had found this book years ago. It explains all the differnet concerns regarding theft at a bar. It is easy to go through and pull out the information that most meets the needs of the business. Way to go Plotkin!",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book is very informative for most beginners, however, it's redundancy can drag the reader down at times. The length of the book could have been chopped down to 1/3 of it's size. The book has variations of roughly 20 different schemes devised from bartenders, waitresses, food servers, and Management. It will steer the reader/owner to the basics of protecting their business and patrons. Worth reading, could be more encompassing for length and price.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "from com to profit inventing business models that deliver value and profit",
        "description": "Until now, all it's taken to build a successful e-business is theright technology. An online storefront goes up and a company'smarket capitalization goes through the roof, despite low sales andno profits. But now the race to get online is over. As the neweconomy rapidly becomes the only economy, Internet companies mustlearn how to create sustainable value if they're going to survive.This book provides the solid business basics companies need to movefrom the old era of .com to the next era of .profit. Nick Earle, the driving force behind Hewlett-Packard's worldwideInternet strategy, and Peter Keen, a visionary in the world ofbusiness and technology, have been anticipating online trends andcommunicating them to managers for over twenty years. Here theyteam up to forecast the future of Internet commerce and to lay outthe six key imperatives that will determine the difference betweensuccessful and unsuccessful e-business in the coming decade. Earle and Keen show managers how to perfect the logistics,cement the relationships, build the brands, transform the capitaland cost structures, harmonize the sales channels, and provide theservices that are crucial to delivering both value and profits onthe Web. Using examples from HP and other top companies around the world,the authors go beyond Internet hype to lay out strategic action inthe key areas of technology, finance, and marketing. In theprocess, they provide all the useful information, timely insights,and practical advice managers need to build business plans for thenew economy that really work.",
        "authors": "['Nick Earle', 'Peter G. W. Keen']",
        "infoLink": "https://play.google.com/store/books/details?id=2yvdmcxP_D8C&source=gbs_api",
        "review": [
            {
                "review/text": "The authors tell us that the purpose of the book is to answer this question: &quot;What can business do -- and do now -- to set priorities and competitive direction for being on the Web so as to provide value to customers and generate profits at the same time?&quot; In answering this question, they have a point of view. &quot;It's not transactions or price that create the value that gets customers coming back to a seller. It's relationships, collaboration, and community.&quot;This book is for people who have not thought about what elements must be present in a an e-business model in order to ensure profitability, sustainability, and success. If you company is starting its first e-business initiative, this book could save you some lost time and money.If you have done this thinking, chances are that you will not learn much from this book. I found no concepts that I had not read in at least 5 other books about e-business success. The microeconomic analysis of creating a profitable business over time was also incomplete in that it did not pay enough attention to the role of speeding up progress, reducing start-up losses, and creating permanent advantages. I graded the book down one star for these missing elements.The book focuses on six areas for progress (value drivers, in the parlance of the book), and provides an imperative for each:1. Relationships (cultivate your long-term customer relationships)2. Logistics (perfect your logistics)3. Branding (build a power brand)4. Channels (harmonize your channels on behalf of the customer)5. Intermediaries (become a value-adding intermediary or use one)6. Financial Dynamics (transform your capital and cost situations)Each value driver and imperative is detailed with check lists to consider and useful, contemporary examples that you can check on on the Web for yourself.A weakness of the book is that it pushes a bit too hard on the idea of building relationships as the primary way to create profit. Certainly, relationships will always be important, but I suspect that most successes in the future will be built on superior, trustworthy service rather than on relationships per se. The book is also too quick to abandon being the low-cost provider of superior products and services as a valid, broadly-available business model. With specialization, many will be able to achieve that. Further, the book is not imaginative enough in thinking of new ways to add value to customers that cannot be done except on-line.On the other hand, it is the best book I have read for explaining the importance of having a carefully considered e-business model, and providing a structure for examining the options.In the final chapter, the authors look at new trends in technology (especially wireless applications) that will affect how you help customers.The authors have excellent credentials. Nick Earle is the head of HP's E-Services.Solutions group, and Peter Keen has written widely on business and the Internet. The final chapter also draws on the thinking of Rajiv Gupta, general manager of HP's E-Speech operation. The quality of their backgrounds show in the clear articulation of their points of view and the examples they choose.After you finish this book, ask yourself the question of how you can create advantages for your business that customers feel are very important and can never be overcome by competitors. And don't limit yourself to on-line solutions to get there. When you come up with a solution, you'll be off to a good start in creating a superior business model.",
                "review/helpfulness": "44/48",
                "num_reviews": 48
            },
            {
                "review/text": "Dot-profit provides a good review of the economics and fundamentals of electronic commmerce. This is particularly needed given the state of the market. While the book is good for understanding the sources of value and benefit found in eCommerce.The book while strong on rational does not provide enough detail to implement. I like Peter's books so I read his other books on eCommerce. I found the eProcess Edge out at about the same time as a good refernece for building what it takes to move from dot-com to dot-profit. Reading both has given me the high level business strategy and the business operations requirements needed to act on the advice.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This solidly researched and written guide shows you how to move into the next phase of e-business operations: actually making them profitable. The authors call this era .profit (dot profit), and aside from that little gimmick, the book is refreshingly free of space-filling babble. Instead, it concentrates on the elements needed to make a profit on the Internet, and gives plenty of examples from cyberspace so you can learn from those who are already in .profit world. We from getAbstract recommend this book to anyone charged with developing business strategy.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the ultimate competitive advantage secrets of continually developing a more profitable business model",
        "description": "Using dozens of concrete examples, the authors define a single process that companies can use to perpetually stimulate new growth and profitability.",
        "authors": "['Donald Mitchell', 'Carol Coles']",
        "infoLink": "http://books.google.com/books?id=DMjYY68YwY0C&dq=The+Ultimate+Competitive+Advantage:+Secrets+of+Continually+Developing+a+More+Profitable+Business+Model&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "On an attentive reading of this book I must say it does not live to its rich promise as far as I am concerned. And it promises a lot which even transpires from its elaborate and frankly immodest format of introductions to introductions and forewords to forewords. No assurances of authors that the reader is dealing with a break-through knowledge can - though - replace the hard earned content. And the content shows surprisingly little home work done on the promised in-depth analysis of a hundred successful business entities. Instead one gets a series of real life business stories related. Not a very creative thing to write if you read business press today. Comparing this book to those of Mr.Collins who so meticuosly presents results of his research of the best companies or to such a thorough job on business models as that done by Mr. Slywotzky in his rich and clear &quot;The Profit Zone : How Strategic Business Design Will Lead You to Tomorrow's Profits&quot; leaves one truly unsatisfied.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "Donald W. Mitchell is Chairman and CEO of Mitchell & Co., a Boston-based management consulting firm. Carol Bruckner Coles is cofounder, president and COO of the same company. They are the authors of 'The 2,000 Percent Solution' (1999) and 'The Irresistible Growth Enterprise' (2000). This book on is split up in four parts, whereby each part consists of 2-to-3 chapters, plus an useful introduction, prologue, and epilogue.In this book the authors aim to answer one of the ultimate business' questions of all time: \"What one thing can most improve a company's growth and profitability?\" The authors believe that the answer is: \"having the best process in your industry for continuing business model innovation.\" The improvement tips in book are based on research into 100 CEOs and their companies, who (1) had been publicly held for several years and above a certain market capitalization size; (2) fastest growing stock prices during the previous three years; and (3) the same CEO was in place throughout the three years. Some additional examples were taken from the 'Value Line Investment Survey' between 1989 and fall 2000.The 'Introduction' discusses business model innovation and the race for leadership and prosperity. \"It is that business model obsolescence is THE major unperceived opportunity for and threat to all businesses now.\" In the 'Prologue' they introduce some great examples of business model innovators, ranging from gold-mining Goldcorp to entertainment giant Disney(land).In Part I - 'The Most Productive Areas for Business Model Innovation' the pleasure of this book really starts. Mitchell and Coles start discussing the areas where companies can improve their operations. They split these areas up in three. The first is increasing value without raising prices and costs; the second is to adjust pricing to increase sales profitably; and third, reduction of costs that reduce customers benefits. The authors use a wide range of examples to explain their points.Part II - 'Provide Sustained Benefits for All Stakeholders' discusses the difficult stage after the initial success of a business model innovation: The view that one success can threaten to dismantle the foundation of that success. The authors discuss methods for building a buffer for lean times and establishing a good ethical base for the company. They also discuss how leading business model innovators reward all stakeholders fairly in ways the stakeholders prefer.In Part III - 'Expand Business Model Innovation', Mitchell and Coles explain that companies should never be satisfied with their current business model and should keep innovating. \"Start first and stay focused on adding business model innovations to gain and keep a profitable competitive advantage.\" There is also advise how to create a culture for nurturing ongoing business model innovation within organizations. These two issues should be seen as one of the highest priority on an executive's agenda.The final part, 'Pursue Higher-Potential Business Model Improvement', discusses how you can improve a business model innovation. This sounds strange, but by looking closely at areas of high growth and profitability can lead to exceptional results. Another method is by closely looking at the benefits you can provide and share. Especially this last method is overlooked very often by successful companies and can ultimately lead to disastrous times. Finally, the 'Epilogue' provides the five principles which can guide companies to a positive future.Yes, this is a good book. It is not just about innovation and idea creation, it also discusses the difficult second and further stages which are often overlooked. It fills you up with an enormous amounts of tips and ideas on how to improve your current or future business model. And I do believe that that is probably the strongest point of this book, you can feel the ideas and energy flowing into your body and mind and cannot wait to start implementing them into your organization. The authors have provided a short list of key questions at the of each chapter which you should ask yourself. I have just one minor comment: The term 'business model' could have been discussed in some greater detail - I refer to Joan Magretta's Harvard Business Article 'Why Business Models Matter?' (May 2002). Highly recommended to executives, managers, and, especially, entrepreneurs. The book is written in simple business US-English.",
                "review/helpfulness": "16/20",
                "num_reviews": 20
            },
            {
                "review/text": "Crowned with valuable topics, whose orientation included questions and answers, &quot;The Ultimate Competitive Advantage&quot;, is surely a product of research and documentation.Anybody who reads this book would cherish how it bared the anatomy of strategic marketing, while at the same time, adhering to its concise pattern. Students, professionals, and enthusiasts who have flair for marketing should pay close attention to it. Remarkably encouraging is how Parts One and Three (of the book) dissected all the elements of competitive decisions. Various skills and methodologies were explained: with each chapter honing the noble goal of success. Equally important is the simple language used in the definition of terms and concepts.Overall, this is a nice manual to have at hand. Its contents reflect the refinements and consolidation of various marketing theories. There is hardly any tangible flaw which debased the quality of this book. I am very pleased with its management polyphonics.",
                "review/helpfulness": "14/19",
                "num_reviews": 19
            },
            {
                "review/text": "Some wag, a few years ago, audaciously claimed that there really was no such thing as a \"business model.\" It is probably true that many businesses aren't so much the realization of a carefully designed model as they are the products of happenstance, survival-driven evolution, and habit. And it's probably also true that many top executives cannot articulate the model upon which their business is based. But, of course, every business is most definitely based upon a model (intentionally crafted or not).Authors Mitchell and Coles both define what a business model is, and declare that continually tinkering with your business's model gives you the Ultimate Competitive Advantage (which is, in their words, \"products and services [that] can be provided in ways that deliver more sales, higher profitability and greater cash flow than would occur if a competitor supplied the same customer\"). They proclaim that the \"big idea\" of their book \"is that business model obsolescence is *the* major unperceived opportunity for and threat to all businesses now.\"Innovation, the authors argue, belongs not only in the R&D; lab but in every facet of your operation. This constant reinvention, the authors argue, truly is a matter of survival: Businesses too easily get trapped by their own traditions inhibiting growth or responsiveness to changing conditions, or they fail to distinguish themselves from equally capable and awfully similar purveyors of goods and services.Drawing on research spanning more than a decade, the authors tracked companies that performed above their competitors for at least three years under the same CEO. Interviews with CEOs provide many of the \"secrets\" offered by the book. The topics span pricing, corporate values, financial management, rewards for various stockholders, innovation, and many of the multiple facets that go into creating a distinct and successful business model.In addition to providing examples from traditional corporations, Mitchell and Coles also draw insights from philosophers, point to a few examples from the not-for-profit world (e.g., Habitat for Humanity), and provide case studies of individual innovators (such as chronicling an enterprising golf caddy, tracing the exemplary evolution of Peter Drucker as a thought leader and consultant, and reviewing the career of the avant garde architect Frank Lloyd Wright). In presenting their concepts, the authors also employ devices and metaphors such as the familiar child's lemonade stand, an orchard, and a (thoroughly tortured) lily pond.This book doesn't fall prey to the all too common ploy of promising \"three easy steps to instant success,\" but neither does it present a linear, prescribed methodology for a reader who is eager to implement The Ultimate Competitive Advantage.Yet the book is still process-oriented. There are plenty of insights and relevant inferences waiting to be drawn, and there is considerable practical information available to someone willing to meander through the many diverse examples and case studies while picking up the gems along that path.My advice is to read this as an executive thought-starter: flipping, skimming and pouncing. That is, flip through the book while skimming each page. There are many helpful subheadings, salient thoughts from the text --- conveniently bolded and boxed, and especially stimulating and useful questions at the end of each chapter.The content warrants the five-star rating, though I'm less enthusiastic about the structure. (E.g., there are more than 70 pages of preamble and stage-setting with two guest Forewords, a Preface, an Introduction, AND a Prologue all preceding the nuts and bolts. Whew!) But you'll get your time and money's worth from this research-based look at a new way to see what your business is really all about --- especially if you are a CEO, general manager, or a unit or division head (or aspire to be one).My advice: spend time with this book. Grab it now and then as a source of stimulation for revisiting your own assumptions about your business. Using the many varied and detailed examples, rethink your truths and view them through the lens of the scores of innovative companies and inspiring individuals profiled throughout this unconventional book.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book does two things - (1) it describes how to achieve and sustain competitive advantage by examining your current business model and refactoring it to take advantage of emergent opportunities or changing business climates, and (2) it teaches you how to think out of the box.Thinking out of the box is a prerequisite for refactoring your business model, and unlike the plethora of books on this seemingly ineffable topic, this book will provide you with the knowledge and skills to do just that. Excellent example of thinking out of the box are immediately given in the introduction - each mini study set in text boxes is anchored to one of more factors in business model innovation, and illustrate how thinking out of the box by individuals led to radically new ways of viewing their business, and the successes that came from acting on these insights. Everyone will find at least one inspiring case study in this book that elicits an Eureka! Mine was the GoldCorp case.However, case studies--no matter how inspiring--are nothing more than interesting reading without knowing the common critical success factors in detail. This is where the book shines, because these details are exposed, analyzed and the reasons why they are important are given in a compelling way. Part One, which addresses value, cost and price is by far the most influential 114 pages I have read in any book. Most of the techniques can be found in any college-level text book, but the manner in which it's presented, and especially the chapter on eliminating costs that reduce customer and end user benefits, will inspire you to think broadly and deeply about these issues. Part Two covers how to provide sustained benefits to all stakeholders. In theory this seems easy, but too many organizations acknowledge the benefits without acting. The authors show you how to transform the theory into action and results. They also tackle the messages in Parts Three (Expand Business Model Innovation) and Four (Pursue Higher-Potential Business Model Improvement) with the same painstaking detail as in the first two parts.This book has clear, lively writing that will hold your interest from the first page. In fact, it is so well written that you may easily overlook the experience, knowledge and skill that is woven into this excellent book through carefully chosen case studies, key questions that cause you to think, and copious use of text boxes to highlight key points or impart quick pieces of essential information. In that respect not only is this book a valuable addition to any executive's reading list, but it's a masterpiece. It deserves a place alongside the works of Michael Porter, Kaplan &amp; Norton, and Drucker.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I would liken myself an aficionado of great business books--I'm always reading new books wanting to gain new perspectives on various dimensions of business--in general, I have found that Amazon user reviews can be quite helpful. However, in the case of this book, I have to say that I am left scratching my head. This book is mediocre on many levels, in my opinion, and I will highlight just a few.First off, there is little structure to the chapters with stories thrown in here & there and little \"wisdoms\" peppered throughout--NET-NET the book is about 95% air and about 5% substance. The authors do not dive into the nitty gritty of business model innovation or discuss the tools and methods that one can use to better their existing models. Sure, some questions to ponder are thrown in at the end of each chapter, but none of them carry the type of weight which would send you on a journey of real insight, discovery, and new opportunity. As an MBA who is generally unhappy with books that don't \"dive into the guts\" of a subject, it's quite possible that I have come to demand a level of rigor within business books that is comparable to the rigor of my business school education.-Dougwww.mindofmarketing.net",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "Too many business managers focus on a successful company's minimum requirements. Have customers; collect receivables; remit payables; weather disasters; out-maneuver competitors and not unimportantly; report profits.Donald Mitchell and Carol Coles, two Massachusetts-based business consultants, in their third book, challenge managers to recognize that business model obsolescence is the major unperceived opportunity for and at the same time threat to their enterprises. By simply adding these five foundational principles to the list, they can become \"all they can be\":1. Serve more people with what is perceived as improved performance, more rapidly and in more ways with fewer resources.2. Make each thought and activity apply to people and their purposes that are not now being served.3. Involve more people when considering each thought and activity.4. Begin each morning with the thought you are starting a new company.5. Strengthen your stakeholders' commitment to these principles.There can be little doubt that if more managers attached each day armed with these principles, their companies, customers and everyone they contacted would experience improved lives.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "Consultants Mitchell and Coles have written an easily approachable business book. The book argues that every business manager should ask how to improve the existing business model. Answer? Expand your business and focus it to the areas where you can gain competitive advantage. But isn't the argument too vague and self-evident? Of course you can make more money if you have a better business model than your competitors do.Perhaps more interesting than the argument itself is therefore the tips and expreriences Mitchell and Coles share with their readers. Based on extensive interviews with hunders of companies they tell us success stories from diverse fields of businesses ranging from computer industry to airlines and gold mines. They pose practical questions and call for an open mind. Where can you cut cost without compromising value? How could you share benefits with all who contribute? And so on...All in all, don't take the book's title literally: I didn't find any ultimate solution or secrets in this book. Don't expect anything you wouldn't have read from somewhere else. Don't expect any detailed case analyses either. But do expect good narrative, upbeat tempo and belief in the human values. Expect an American business book par excellence. So get inspired and go create!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "According to the authors the obsolescence of a company's business model is that company's greatest threat. And few companies are addressing the issue in any systematic manner. The concept of a business model includes \"the who, what, when, where, why, and how much a company uses to provide its goods and services and receive value for its efforts.\" The authors are basically suggesting that if businesses are not improving their performance relative to their competitors, that is changing their business model, in terms of \"sales, profits, and cash flow,\" they are probably facing a decline in their prospects.It is claimed that the right business model innovation will be beneficial to stakeholders across the board: \"customers, end users, employees, partners, suppliers, distributors, lenders, shareholders, and the broader community.\" But the focus of the book is on obtaining, enlarging, and protecting competitive advantages, that is, to expanding both market boundaries and share, and, of course, on profitability. The authors demonstrate the workings of several approaches to achieving these ends by including any number of brief glimpses of various companies. Among those approaches are \"adding value for customers and end users\" without raising prices; devising astute pricing schemes; and eliminating costs that impact customers by adopting such measures as outsourcing, reallocating resources, changing practices, and using more appropriate materials.A somewhat suspect example is of a major communications company who, through FCC abdication of its responsibilities, has been permitted to achieve a monopoly of radio and television stations in several metropolitan areas of the country and then offers customers value-added advertising deals that they could little afford to not take (not the authors' words). That is certainly one form of \"locking out\" competitors regardless of any ethical issues.The idea that all stakeholders within or connected to a business deserve fair, if not equal, treatment has gained currency in the business press in recent years. But that notion is often limited to one appealing to some form of material self-interest, which leaves lying below the surface any examination of any fundamental or potential conflicts among the various stakeholders. In a somewhat revealing example, one CEO regards his customers and consumers as \"citizens\" of his company with quasi-rights to input. But employees are like \"paid volunteers\" because of their alleged devotion to the company's direction. It is an idea that distorts what employment could be. Employees, in actuality, are members of a genuine workplace community with a need for formal rights of input and, in fact, do not have the transient and casual attachment to an organization characteristic of volunteers. The almost cynical psychological manipulation of employees also seems to fall within the concept of fair reward. For example, it seems that airline employees, after a market expansion program by management, should see their reward in knowing that they are helping more people make their way to family reunions, birthdays, etc. Or publishing company workers should be satisfied in knowing that are advancing the spread of knowledge and progress with increased book sales. One has to wonder if all stakeholders in those two examples were rewarded only with warm thoughts.The authors stress the necessity of \"developing and implementing a superior management process to continually improve an organization's business model.\" Curiously, the authors devote virtually no space to describing any such process. The greater emphasis is on describing a variety of actual business strategies that could be selected such as, adding value, pricing, cutting costs, etc, to effect competitive advantages. The reader will be left to puzzle over the who, when, and how of the structure of a typical, ongoing process of defining the next business innovation.The primary point of the book that businesses should reassess their model, orientation, manner of working, etc can hardly be disputed. There are some brief overviews of some possible strategies to employ with a heavy emphasis on brief descriptions of attempts to implement those strategies. Some of the points are obscured by the endless presentation of examples and in some cases are just not well presented. The book is much too long for the points delivered. After the first of the book describes business model innovation, the last of the book purports to expand the topic. In actuality, the earlier points are redundantly made in another iteration of example companies.The book only minimally delivers. Surely, most any business of any sophistication would be well aware of this material. Furthermore, it is hard to see how this is groundbreaking material as claimed. There is generally a poor development of the concept of stakeholder in relation to business innovation and more broadly. This book is probably best regarded as a basic book on marketing.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "You do NOT have to be in business to glean wisdom from this awesome book. Chapter 9 Expand The Benefits Your Provide And Share is worth the price of the book, simply because it gets to the heart of what makes a company survive and thrive thru good as well as bad times. This chapter also touches on one of our hands on as well as financial causes, namely Habitat For Humanity. In this chapter the authors give numerous examples of the positives that come when a business no matter how small or big, gives back, rather than simply take take take.I also call your attention to the subtitle of the book which is &quot;Secrets of Continually Developing a More Profitable Business Model&quot;. As the authors show throughout the book, businesses that fear change, become stagnant and die. Whereas the successes are those who never lose their vision and wonder of what could be and then take goals and dreams and make them a reality.Buy a copy of this book for your local library!",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "pricing for profitability activitybased pricing for competitive advantage",
        "description": "Three things can happen when establishing a product price. A price set too high is a lost sale that could have been profitable at a lower price. A price set too low is rewarded with unprofitable work. Only when a price is set appropriately does a company make both a sale and a profit. Just as activity-based costing and activity-based management revolutionized the cost accounting world, activity-based pricing will bring a disciplined approach to developing pricing. Activity-based pricing examines the relationships between price, cost and sales volume and how this relationship effects profitability. Pricing for Profitability joins the disciplines of marketing, economics, business strategy, engineering and cost accounting to achieve maximum profitability.",
        "authors": "['John L. Daly']",
        "infoLink": "http://books.google.com/books?id=52ZSUZtA14UC&dq=Pricing+for+Profitability+Activity-Based+Pricing+for+Competitive+Advantage&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Pricing for Profitability is a refreshing new look at pricing strategy the combines the disciplines of Business Strategy,Cost Accounting, Economics, Marketing and Business Strategy to create an approach where each of these disciplines will surely find a solid common ground.The book concentrates on maximizing profitability, rather than maximizing revenue, convincingly refuting the approaches of other pricing books (written by marketing professors) that say &quot;the more sales the better&quot;. He reminds us that revenue does not equal profit, but that profit = revenue minus expenses.Mr. Daly asserts &quot;there are three things that can happen that can happen in product pricing and two of them are bad&quot;, the most devestating result being that many companies underprice difficult or low-volume bids sometimes loosing significant amounts of money. He believes that many organizations have an inadeqate understanding of their costs which leaves them at a competitive disadvaantage.This book is a must read for any manager who has pricing responsibility.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "John Daly has written an excellent book with important insights into the desirability and mechanics of using Activity Based Pricing to achieve a profit-driven pricing model.Why is this important?If you really understand and properly allocate your costs and use that understanding to develop an Activity Based Pricing model for your products and/or services then you are pretty well assured of profitability, particularly as you increase unit volume. Of course, this assumes you can sell at a price higher than your fully loaded, properly allocated costs.As Mr. Daly clearly describes, traditional cost allocation methods (not to mention back of a napkin allocations) result in problematical cost distortions and lead to potentially serious pricing errors.Anyone with profit and loss responsibility, or who would like to get there, would be well served to buy this book, read it and take it to heart. It is well written, coherent and was a pleasure to read. Daly has struck an excellent balance in that the book is not so filled with technical accounting/finance detail it is inaccessible to a non-accountant and yet it has sufficient substance to be of interest to accounting and finance specialists.As investment bankers we receive financing requests from many companies seeking capital that are not profitable or not as profitable as they could be. Activity Based Pricing is one of the disciplines we are introducing to our clients and prospective clients to help them achieve profitability or become more profitable in order to better position them to compete for capital.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Pricing for Profitability has allowed our company to intelligently quote new projects and answer a critical question during price negotiations - &quot;Should I walk?&quot;. We have also found the activity based pricing concepts useful for evaluating the countless cost down requests we get from our customer and understanding what we can and cannot do. I would recommend this book to anyone in a highly competitive, tight margin business.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "understanding electronic commerce strategic technology series",
        "description": "The Business of Ecommerce explains how to conduct business over the Web. Accessible and useful to both technical and nontechnical readers, the book describes the relevant business issues to technologists and technical issues to business managers. Paul May combines his experience as a consultant to both blue chip companies and Internet startups to provide a generic model for understanding ecommerce opportunities. He makes accessible all of the relevant technologies. This book empowers technical and business decision-makers to maximize the opportunities of ecommerce.",
        "authors": "['Paul May']",
        "infoLink": "http://books.google.nl/books?id=5Al1t0U3thEC&dq=Understanding+Electronic+Commerce+(Strategic+Technology+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I will preface by saying that the book is outdated(i.e., referring to the typical fastest modem speed in homes as 14.4) but nothing that any knowledgeable person couldn't insert more current info.Anyway...the book is excellent for providing an overview of E-commerce...it is a very easy read, could be finished in a day or two...the best part may be the case studies at the end. They describe the situation of each company/website and detail how they developed a solution for furthering E-commerce. It even describes what kind of system hardware/software utilized.I strongly recommend you buy this book. Other books could provide more detailed, supplemental info.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I found this book to be a good intro to the possiblities of E-Commerce for management-types; however, the book seems to spend a fair amount of time rehashing topics that were discussed earlier. In addition, if you are a techie, you will find the writing style rather wordy and &quot;very&quot; non-technical.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "3 stars may have been generous for this title. This book was released in 1997, which probably means it's over a decade old in IT years. This book provides the most basic of introductions to the whole idea of e-commerce. I think this book is good for a certain type of person. If you fit this description, you will benefit by reading it. You obviously have to be interested in learning e-commerce. Maybe you know what they are, but you shouldn't be able to give in-depth descriptions of protocols, networking, security or encryption. The case studies were disappointing. I only really liked the Gateway one. Again, very outdated. The best part of the book has to be the diagrams. I'm a Master's IT candidate and they even help me. Simple with icons to represent a supplier or buyer, it's the easiest way to describe a situation (like electronic processing using Verisign) without giving someone a long, confusing speech on each step. One final warning, while this book covers all these topics and concepts, all it really does it provide definitions of them and moves on to the next one. Perhaps information overload?",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you dont know anything about ecommerce. This book will help you understand the whole picture of the ecommerce. (The payment and security sessions are quite useful for beginner) But if you are seeking book about technical implementation, this book are too simple for you. To sum up, it is a good book for who dont know anything about ebusiness. Especially, the payment and security sections",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Everyone seems to be talking about e-commerce. And so did I. Not knowing what e-commerce is actually all about. The book gives a very good picture of what is e-commerce. And the 6 case studies in book actually proved to be a very good tutorial. Good to have as the first book about e-commerce.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Hey, it's Microsoft Press. This was the first place that you could get a glimpse of how Microsoft might be viewing the e-commerce space from a business perspective. Kosiur is an excellent writer - very clear and concise. The graphics are excellent summaries for the text. The case studies are lightweight but provocative. Business managers can read this as a starting point before wading into the flood of new books on e-commerce.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the golden egg book big little golden book",
        "description": "A Golden classic about a bunny-and a little duck that is about to hatch! A perfect gift for your child on Easter. Once there was a little bunny. He was all alone. One day he found an egg. He could hear something moving inside the egg. What was it? The tale of a bunny's discovery of a mysterious egg--a Big Golden Book beloved by generations--is available for the first time in the Little Golden Book line, with its original illustrations by Caldecott Medalist Leonard Weisgard. This Springtime classic by the author of Goodnight Moon is now perfectly sized for Easter baskets!",
        "authors": "['Margaret Wise Brown']",
        "infoLink": "https://play.google.com/store/books/details?id=OOsCBAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I loved this book as a child, and still find it magical after more decades than I'd like to admit. It's a gentle story about wonder, imagination, surprise, and friendship, and Weisgard's illustrations are enchanting. It just doesn't get much better than this. I'm in the book biz, and in my profession I look at lots and lots of picture books.\"The Golden Egg Book\" has a universal appeal that still holds its own after all these years, and will continue to engage children for a long time.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I had fond memories of this little book (and one called The Whispering Rabbit), and the images were etched in my mind, so I searched for them to have to read to my little ones. I was thrilled to find both books, and ordered them, only to be disapointed that the illustrations were not the same as I remembered. Upon further research, I found the original on ebay in a book titled The Whispering Rabbit and Other Stories by Margaret Wise Brown, Copyright Weekly Reader Book Club Edition, 1965. The Book includes the 2 aforementioned stories, and The Friendly Book, Scuppers Song, and Rabbit Poem.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Charmingly written by Margaret Wise Brown and superbly illustrated by Leonard Weisgard, The Gold Egg Book is a true picturebook classic telling the story of the rambling imagination of one little bunny as he tries to figure out just what is inside a beautiful blue egg. A whole new generation of children ages 2 to 5 will delight in this lively story as the bunny tries to shake, push, and even jump on the egg in his attempts to break it. But the egg won't hatch until it is ready! The Golden Egg Book will prove to be an enthusiastically popular addition to family, preschool, and community library collections.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "My mother used to read it to me and now I am reading it to my daugther (she's 2 1/2). It is a family favorite. The story is beautiful, touching, sweet, etc. I love the language/word choice used by the author. I could read it to my daughter every day and not get tired of it. And, the illustrations are exquisite. They are so detailed and beautiful. If you do not own this book, go and buy it. It's worth every penny. You will not be disappointed. They don't make them like this anymore! This is a classic.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I did not know this book as a child, but have come to revere Margaret Wise Brown's books as I read them to my boys, and this is now my favourite book (the kids love it too). It has such a silly humour in it, as a little bunny wonders what is in the egg (A little boy? An elephant?), tries to find out (rolling the egg down a hill, throwing a little rock at it), then finally fally into a deep sleep. The duckling that emerges from the egg is equally puzzled by the bunny (What could this little fur thing be?), and proceeds to subject the sleeping bunny to the same treatment he got, trying to wake him. In the end all that matters is that they are friends, \"And no one was ever alone again.\" I cant think of a more comforting thought to send a child to sleep with.The illustratins are gorgeous, and the book is worth every penny.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "What a sweet \"friend\" book. WARNING There is violence. The bunny threw a rock at the egg, but he was a very small bunny and it was a very small rock, so the egg did not crack. In the end, there is the promise to never be alone again. What more can one want?",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I found an old, beat-up copy of this book at a used bookstore and even with a few torn pages, it has become one of my 2 1/2 year old son's favorite bedtime stories. The story of a lonely bunny who finds, first an egg, and then a friend, is really sweet. But it's the illustrations that I absolutely love. Every page has different, lovely flowers, plants, butterflies or small animals. (Although my copy is pretty old so I'm not sure they are the same as this print.) Highly recommended.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The first book I can recall my Great Grandmother, who raised me, reading to me was The Golden Egg book. Grammie had a farm, and I was so surprised every time any of the eggs would hatch from either the chickens or the ducks.It was given to me as an Easter gift and by my birthday I knew it by heart.I read it to my children, and I now read it to my grand children. I have a new copy of this book for my grand children when they have their first child for them to read to them.To me there is something so wonderful as a child asking that question,\"Read to me mommy?\"",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This gorgeously illustrated book is a must-have in your toddler's library! The story is sweet and simple and encourages curiosity (What's inside that egg?). This one is read and re-read after many months of use, and when my son can't decide which book to choose for bedtime, he'll gladly accept this one!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sap r3 process oriented implementation iterative process prototyping",
        "description": "This book puts forward a method (Iterative Process Prototyping) for defining a company's business process and their interconnectinos so the R/3 system can be modeled accordingly. Because R/3 is a single, corporate wide system it must be set up to reflect the way a company does business.",
        "authors": "['Gerhard Keller', 'Thomas Teufel']",
        "infoLink": "http://books.google.com/books?id=QYBxQgAACAAJ&dq=SAP+R/3+Process+Oriented+Implementation:+Iterative+Process+Prototyping&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you want to understand what SAP's R/3-system really does, this book offers you the best way to get a grip on it. By mapping the system's transactions to the underlying business processes you can easily follow and understand the core functions of the model company. The EPC-methodology provides a perfect framework for describing processes in such a way that the user can understand the different threads as well as the guys who implemented the system. Reading this book I realized for the first time how I can benefit from the use of SAP in my company.BTW: The book has more than 840 pages, not 448 as mentioned in the book information!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The rich and sometimes jargon ridden world of complex ERP software like SAP R/3 is best understood with the help of a proper guide. There are not many books in the market that unravel this world to a beginner in ERP systems and this book more than adequately fills that void. Despite the somewhat prosaic language in the book, the authors do a wonderful job of starting with a survey of basic technological, organisational and business trends and go on to developing a framework for enterprise and process modelling. In my large library of SAP realted books, this one stands out and I will not hesitate in recommending it to anyone interested in this area.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "antique brass wind instruments identification and value guide",
        "description": "Collecting antique brass musical instruments involves a fascinating and wide range of subjects, including music history, art history, political history, industrial history, and changing aesthetics. Designed for musical instrument collectors and those who regularly encounter antique brass musical instruments made before 1920, this book features more than 100 original line drawings from musical instrument catalogs as well as interesting new information regarding these instruments. Readers with a background or interest in music and musical instruments will find this book a valuable resource for years to come and one that will enhance their knowledge and collection. Antique Brass Wind Instruments also includes a helpful value guide, a glossary of terms, a bibliography of scholarly reference books, and several appendices of particular interest to beginning collectors.",
        "authors": "['Peter H. Adams']",
        "infoLink": "http://books.google.com/books?id=PDUFAAAACAAJ&dq=Antique+Brass+Wind+Instruments:+Identification+and+Value+Guide&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book has lots of illustrations taken from old music catalogs and limited text. Most of the text that is there is quoted from other sources. Information on about 10 companies only and skips some of the largest including Conn, Buescher, York, and Boosey and nothing on some of the smaller old brands like Lehnert. The valuations given are for specific instruments, and the guidelines for generalized pricing are next to useless, with statements such as: &quot;Valuing antique brass instruments is like shooting at a moving target in the dark.&quot; All in all some limited information about a number of companies, and many interesting old illustrations of historic instruments, but not of much use in determining value of instruments other than the specific ones in the book.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book has lots of illustrations taken from old music catalogs and limited text. Most of the text that is there is quoted from other sources. Information on about 10 companies only and skips some of the largest including Conn, Buescher, York, and Boosey and nothing on some of the smaller old brands like Lehnert. The valuations given are for specific instruments, and the guidelines for generalized pricing are next to useless, with statements such as: &quot;Valuing antique brass instruments is like shooting at a moving target in the dark.&quot; All in all some limited information about a number of companies, and many interesting old illustrations of historic instruments, but not of much use in determining value of instruments other than the specific ones in the book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the musicians handbook a practical guide to understanding the music business",
        "description": "Offering straightforward information and insights for musicians of all level of experience, a thoroughly revised handbook provides up-to-date guidelines on music industry trends, details on pricing and legal issues in the digital age, how-to tips for do-it-yourself and independent musicians, and tips on royalties, advances, live performances, merchandising, and more. Original.",
        "authors": "['Bobby Borg']",
        "infoLink": "http://books.google.com/books?id=Vd15PwAACAAJ&dq=The+Musician%27s+Handbook:+A+Practical+Guide+to+Understanding+the+Music+Business&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an excellent book for someone just getting into the business. Not just for rockers, either! Easy to read and understand. The best part is, this guy's not bitter about the whole industry! It's great to read a book that doesn't just tell you how horrible everything is in this business and how you are destined to fail! He just gives you the facts along with great anecdotes.You MUST buy this!!!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Bobby Borg's book is a MUST HAVE! It's easy to read and he divides the book up in a way that you can skip around for quick references. I carry this book with me everywhere!!! His book is really a collection of facts that all artists need to know. Even if you are not an artist (exe upcoming manager) you still need to read this book. This is a step by step, no nonsense, straightforward understanding of every area in the music industry.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The Musician's Handbook by Bobby Borg has to be one of the greatest and helpful resources out there for all levels of people in the Music Business. If you only had one book to accomplish your musical achievements this would mean all the ENCOURAGEMENT in the world for you. Every Dreamer, Visionary and Thriver deserves to have this book in their corner for the knockout punch to overcoming and persevering through all the obstacles that exist in this Industry. From the very first page, all my friends and myself have become much more educated, pro-active and determined to succeed in our Music Business Careers. I respect and commend this author for the blood, sweat, tears and time he sacrificed to make his Purpose a Reality and for not leaving any topics missing. This book is going to be a very significant and strategic part in creating a whole new definition for Music Business Professionals: Beginner/Intermediate/Advanced for the 21st Century Generation and Beyond!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I would recommend this book to anyone who is a SERIOUS musician or if you are truly serious about being in the entertainment business! I bought this book at the TAXI Music Convention in Hollywood, California after sitting through one of Bobby Borg's seminars. I thought to myself why not buy it and read it after all that is why I attended the Music Conference in the first place: to expand my knowledge about the music industry! That is exactly what this book does! In fact I like this book so much I bought 4 extra copies for my bandmates and a couple other people that I work with in the entertainment industry. This book is very easy to read and has tons of useful information in it. Once again if you are SERIOUS about being in the Music Industry you owe it to yourself to read this! Trust me you WON'T be disappointed!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is commonsense advice that could save you years of time and thousands of dollars. Drummer Bobby Borg, who worked with Warrant, Left For Dead, and Beggars &amp; Thieves, has authored an accessible music business book, The Musician's Handbook - A Practical Guide to Understanding the Music Business, which makes it obvious he studied a lot more than cymbals and sticks during his 12 years as a major label artist.Borg explains the nuts and bolts of the music business - like recording contracts, royalties, merchandising, publishing, managers, talent agents, and more - from his unique perspective as a signed musician. The book is not written in &quot;legalese&quot;, but in layman's terms, allowing you to more easily understand a subject like &quot;recording contracts&quot;. He uses many real-life examples which make complex topics easy to digest, and easy to apply to your own situation.The book is loosely focused on bands close to signing a label deal, and includes valuable advice about contracts, financial arrangements, and how to build your professional team. However, indie bands will also find much to learn in The Musician's Handbook, because Borg has included everything you need to know to do it yourself, too.Probably the most valuable aspect of The Musician's Handbook is the easy to understand financial information. Borg uses detailed examples of musicians' income and expenses, and then offers useful advice on how to maximize earnings and longevity. It never bogs down into complex accounting and boring contractual verbiage (save that for more formal and academic texts), but instead gives the the musician a broad-based and thorough understanding of the important aspects of the music business.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Bobby Borg's book, The Musicians Handbook: A Practical Guide to Understanding the Music Business, screams at you with logic and confidence. Unlike your parents' advice of having something to fall back on if the music doesnt pan out; Bobby is your encouraging uncle who says \"you can do it, just watch your ass and listen up\".Pointers, suggestions, annectdotes, and accolades. Bobby put it all down in a book that any musician (even drummers) can understand and reference. A recognizable face or song and no money in your wallet is a sad fate. This one book can replace that shelf of manuals written for lawyers and suits. Be a musician, but act like a pro. Carry a tune and carry this tome.-Pesci (Gany-Made Music Pitching) / (Performer)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "From one musician to another, let me tell you - this book is fantastic. I probably own six different books on 'how to make it in the music business', and this one stands alongside only a few others as being one that I actually finished! Not only that - it is one of the only ones I read and thought: 'Okay, I can do this!'. Most books in this genre get bogged down in 'legal speak' or feel the need to go deep into explanations of situations the everyday musician is not going to find themselves in. I found this book to be a good read (the style is very direct and conversational) and full of practical advice that has helped me to navigate the music business better. Most helpful to me was getting an improved view of the 'big picture' of the music business, so that the goals I am setting for myself are now based in reality, not my own version of what I thought the music business was all about.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book has been a tremendous help in my career as a professional musician. I have been a seasoned pro for over 20 years and I thought I knew it all, yet there is so much I didn't know which I should have known years ago. They should teach this stuff in any music school. It is written in accesable language and as far as I know this is the only book on the music business written by a professional musician instead of some lawyer or retired record executive.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Besides time with Warrant and Beggars &amp; Thieves as well as his own band Left for Dead, Borg has a long history writing music magazine columns and method books. In this book, Borg unites his experience in working bands with his journalistic experience for an informative and detailed text on the mechanics of the music business. Along with bandmates, a musician needs a more extensive team to navigate the practical matters of a career in music. Borg details the roles of the attorney, personal manager, business manager, talent agent and record producer in this team. Borg also goes far to explain the perennially mystifying topic of royalties, advances and music publishing in the complex revenue stream generated by songs and recordings. Borg also explores different employment scenarios, like contract versus self-employment as well the approach of being a solo artist/employer. These helpful chapters are unusual in books of this type. Sections of the book are enhanced with Q&amp;A interviews with such people as Henry Rollins, Fred Croshal (GM at Maverick Records) and Neil Gillis (VP of A&amp;R at Warner/Chappel Music).",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Well, I read this book cover to cover. It's a definite must read for the serious musician who wants to learn about the music business and how it works. The music business is pretty confusing but this book is written in a way that is completely understandable. It has a lot of information such as music publishing, legal topics, and agreements. It also has Q&A sections from Henry Rollins, Fred Croshal (Maverick Records) and Neil Gillis (VP of A&R at Warner/Chappel Music). Bobby Borg was my instructor and I know he knows his stuff. The music industry is an arcane language, but this book makes everything easy to understand. Everyone in our class was happy to be able to study of off such a book. Buy it! it's worth it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "greenhouse operation and management 6th edition",
        "description": "Based on the author's life-long practical experiences both in the industry and in research, this best-selling, state-of-the-art guide to the operation of commercial flower and vegetable greenhouses presents coverage in the order in which decision-making concerns occur. Exceptionally comprehensive-yet accessible-it provides detailed, step-by-step instructions in layman's terms for ALL aspects of the business-from the physical facilities, to the day-to-day operations, to business management and marketing. Specific chapter topics cover greenhouse construction, heating, and cooling; environmental control systems; root substrate; root substrate pasteurization; watering; fertilization; alternative cropping system; carbon dioxide fertilization; light and temperature; chemical growth regulation; insect control; disease control; postproduction quality; marketing; and business management. For individuals entering the greenhouse business.",
        "authors": "['Paul V. Nelson']",
        "infoLink": "http://books.google.com/books?id=T3VFAQAAIAAJ&dq=Greenhouse+Operation+and+Management+(6th+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Nelson's text is probably the most widely used on college campuses offering greenhouse management. It is up to date, full of technical information, and the chapters are well-ordered.My only complaint is that it is VERY badly formatted and so, difficult to read. Like the Biblical book of Numbers, it will have you sawing logs if read at bedtime. The publisher could learn alot from Boodley's The Commercial Greenhouse, which is much more readable.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is a very informative book on greenhouse structures, systems, and operations. It gives a detailed approach to opperating small and large scale greenhouse ranges. There are no color pictures, but other than that, it's a good buy.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "atomic spectra and atomic structure a dover paperback",
        "description": "For beginners and specialists in other fields: the Nobel Laureate's introduction to atomic spectra and their relationship to atomic structures, stressing basics in a physical, rather than mathematical, treatment. 80 illustrations.",
        "authors": "['Gerhard Herzberg', 'John William Tranter Spinks']",
        "infoLink": "http://books.google.com/books?id=MxdxGPk-LqoC&dq=Atomic+spectra+and+atomic+structure+(A+Dover+paperback)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Updated classic paperback text that covers a broad area from Balmer series to Nuclear Spin. Written without alot of complex mathematics, this is a good introduction to Atomic Spectra for specialists in other fields. I loved the coverage on quantum numbers and alkaline-earth elements.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Unfortunately, unless you can get ahold of an older, unmarked copy, you may be disappointed by the \"new\" book sold through Amazon. Spectra are cut off, along with the legends. The pages look like they were photocopied, poorly, in some cases and the text on several pages is blackened by photocopied handwriting within the book. Strange, as Dover is typically very conscientious. I found another older copy and must say, I really do enjoy this book. It reads well and Herzberg describes many aspects of atomic spectroscopy and how structure is related quite brilliantly. I can highly recommend the book, but not this particular printing.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "It is a very good book but the pages are not so good because are copies, anyway is not difficult to read.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    }
]