[
    {
        "Title": "sometimes form sometimes vessel a collection of poetry",
        "description": "Four separate generations of nameless characters struggle for redemption, love, and peace in a lyrically weaved collection of stories.",
        "authors": "['David Belczyk']",
        "infoLink": "http://books.google.com/books?id=Zxw2LwEACAAJ&dq=Sometimes+Form+Sometimes+Vessel:+A+Collection+Of+Poetry&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The first poem I read from this book - I wasn't sure how I felt. The poem was more than just description, it captured a certain sense within its words. As I read more, things began to fit together, and eventually, I felt like I got it. The poems are more like seeing something than reading it - more like touching something than thinking about it. It is visceral poetry! And I believe it is breaking new walls for modern poets. Five stars!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "An excellent book - I enjoyed this author's sophisticated word choice and philosophical insights. Top notch poetry, which is difficult to find out of contemporary poets. Hopefully there will be some form of follow-up to this great piece of literature!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I got this book on a suggestion from a friend, and I'm glad I did. The forward explains that the whole book is actually the poem and that the individual poems within reference each other to add meaning throughout the book. That was something that I had never seen before, and I though it made the book very interesting to read. I came back to things I had read before, because I saw how their meaning could change based on things I read later. It's a great book if you're like me and you enjoy thinkning about the poems and trying to figure them out.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "then suddenly pitt poetry series",
        "description": "Finalist for ForeWord Magazine's 1999 Poetry Book of the Year A reader and a writer don their respective roles and embark on the journey of a book. This is their story--ultimately a love story--darkly funny, mournful, testy. It is about a reader who at times presides over the page like a god, and at others follows the leash of the author's voice through the dark streets of the book like a dog, and it is about a writer of determined slipperiness. As we read, we think that each of us is The Reader, the one who knows the Real Story. But the more we think we understand, the more the story moves away from us-all is not what it seems. This eagerly awaited third volume by the poet whose work The New York Times described as \"at once charmed and frightening\" is a book of high-spirited subversiveness, a work of argument, seduction, and a relentless devotion to language. Then, Suddenly- bristles with the sound of the author's voice--insistent, vital, hilarious, and iconoclastic--tearing away at the confinement of the page and at the distance between the page and the reader. Emanuel's images are dazzling. She creates a performance that is fearsome and funny in its portrayal of the argument between the work of the text and the world of the body. The Gettsyburg Review has called her a writer of \"exquisite craftsmanship\" who can \"strike from language . . . images chiseled clean as bas-relief.\" Then, Suddenly- is a book of spectacle and verve, part elegy, part vaudeville.",
        "authors": "['Lynn Emanuel']",
        "infoLink": "http://books.google.com/books?id=Ob44zwEACAAJ&dq=Then,+Suddenly+(Pitt+Poetry+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I saw some wonderful cagy things going on in Emanuel's first two books. But now comes THEN, SUDDENLY, which deconstructs itself word by word as it goes along, and in a very transparent manner. (The everyperson's answer to Jorie Graham will have to wait.) THEN, TO TOP IT ALL OFF the poems are flat. The life seems to have been revised right out of them. &quot;When the reader's radar tracked me down&quot; Emanuel writes. What happened? The answer is, You thought about it too much and the result is stiff, self-conscious poetry.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "An amazing book of poems, or a book of amazing poems, or both. The bongo-madness rhythms of the voice linger in your head after you put the book down. Serious without being solemn, playful without being silly. I read this book first time through in a single sitting, and when I was done I knew that I had started somewhere and ended up somewhere else, though the precise names for either place eluded me. A very interesting, very smart, very pleasurable book.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "&quot;~Glad to see someone else (and Kevin Canty, no less) thinks this book is good. I read the first stanza and immediately knew it was for keeps. It's a book of poems about a book of poems, about an author of a book of poems, about the aboutness of an author making a book of poems.&quot;~ happen up front, center stage.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "fishbone",
        "description": "The imaginary Lucas Fishbone fosters a special relationship between a grandmother and her granddaughter.",
        "authors": "['Gregory Maguire', 'Frank Gargiulo']",
        "infoLink": "http://books.google.com/books?id=BHCpKQAACAAJ&dq=Fishbone&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I had to buy this book for class, true, but wow, it really opened my eyes up to a whole new kind of poetry--one that isn't boring and one that made me want to write and write and write!and that hasn't happened with any other book. EVER! it's just a small collection but i think there will be another one by this poet soon??--watch out: Aimee N. is SURE to take the poetry world by storm with her candor, humor, honesty and utter charm. even if you think you don't 'get' poetry--BUY this book--guaranteed to change your mind!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My roomie had to read this for a class and she left it on the table over break and I never read poetry before so I thought why not but wow this book blew me away. I love how this poet uses neat scientific ideas to color her metaphors even more. You can tell she is a nature fan, in almost every poem, even the ones about relationships, there is a smidge of small but extraordinary moments observed in nature, it helps make her experiences come alive to me even more. Nezhukummatathil can be funny too, and sarastic, and sensuous. A hard feat to accomplish all three!! You can tell she seems real and doesn't take herself too seriously. Seriously, like I said, I NEVER read poetry, but this little book was quick and easy and a delight to read. My only problem was that it was too short? When will she write more???! Highly recommended.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "rommel drives on deep into egypt",
        "description": "\"Rommel Drives on Deep into Egypt is Richard Brautigan's eighth poetry publication and includes 58 poems. The title of the book echoes a 1942 San Francisco Chronicle headline describing a successful operation by Rommel during the North African Campaign of World War II.\" -- Wikipedia viewed April 27, 2021.",
        "authors": "['Richard Brautigan']",
        "infoLink": "http://books.google.com/books?id=9k1aAAAAMAAJ&dq=Rommel+Drives+on+Deep+into+Egypt&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I first discovered this book on my parent's bookshelf when i was six or seven years old. Bored with sesame street picture books, i read it. I felt rather violated by it at first because many of the poems were impossible for me to comprehend and seemed rather nonsensical to me at the time. Yet I was intrigued. This untraditional book challenged me in a way no robert frost or ogden nash book ever did. Convinced that there was some deeper meaning that I wasn't picking up on, I read the book many times over . The more I read these poems the more i understood them and they began to take on definite shape and character. They began to make A LOT of sense. This book may be a difficult read for a seven year old, but i grew to love it then and i havent stopped loving it since. Now ten years later, at seventeen, let me tell you this is a phenomonal book. I've read a lot of books over the past decade but none of them compare to this one. These poems are so beautiful, so unique, so powerful that they will haunt you for an entire lifetime...Richard brautigan was a genius.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I love Brautigan. This poetry collection is the best I've read of his. There's something about his poetry that distills everything down to a simple unique thought and gives it the attention it deserves. While his prose is beautiful (and poetic) as well, I like his poetry better for it's amazing simplicity and depth. If you've never read a Brautigan, start here, then go to TROUT FISHING IN AMERICA.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Richard Brautigan was crafty. I read once that he wanted to write the perfect poem and that poem would be about the shortest period of time one could imagine. That poem would be one word. Nobody has ever heard the word yet. It hasn't been created. Everyone knows what it means. We've always known. If you are buying your first Brautigan book I highly reccomend starting here and finishing when you own everything he's written.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Do you think of me as often as I think of you?R. BrautiganThe photo on the cover would be worth the price of the book even if the poems were awful, and they're not. In fact, they're great. Light, withought being trivial, this one's a quick read that stays on. Brautigan's uniqe humor is pervasive and nothing is quite as simple as it might seem at first glance. Warning: Don't think about them too much. These are not grab on and chew kinds of poem-lettes. They're funny ineffable little beasts. I especially like Donner Party and Clad in Garments Like a Silver Disease. A great book just to have knocking about the house. Rock on Brautigan!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the golden treasury of poetry",
        "description": "SUMMARY: Over 400 poems ranging through all periods of English literature, simple verses, then progressing through twelve categories including animal poems, portraits and nonsense poems.",
        "authors": "['Louis Untermeyer']",
        "infoLink": "http://books.google.com/books?id=C-sFAQAAIAAJ&dq=The+Golden+Treasury+of+Poetry.&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have read this so many times my copy is literally falling apart. I am 37, and to this day entire phrases still ring in my head from classics like The Highwayman, Paul Revere's Ride and Jabberwocky (&quot;beware the Jub-jub bird and shun the frumious Bandersnatch!&quot;). In fact, when I took the GRE several years back, my acquaintance with this collection was of more value than my college literature classes. Not only for children - although I would buy a copy for every child I care about if it was still in print.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "...Begins one of my many favorites introduced to me by this book. My mother (a librarian) first read poems such as &quot;Wynken, Blynken, and Nod&quot; to me from this book, and I continued to read them until a hiatus where a young man disdains poetry as not being macho. I rediscovered many an old friend when I started reading these poems to my own children. Now the book is in tatters (glueback bindings do not stand the test of time, especially not in dry Colorado), and I search for a replacement. If the reissue has indeed been 'sanitized' in the name of political correctness, then I fear much will have been lost, and I will be reduced to trying to rebind my tatters.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am 45; I grew up with this book as our family poetry book-I am no poet but gained magic from having this book on the upstairs shelves to read when I wanted to--my folks didn't push it. I know there are many others but this one let poetry into the life of a hard core boy. I would like to get it for my son.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I fell in love with this book in my elementary library. I've paid enough late fines on it in the last 15 years to have bought the book several times over. It's here that I fell in love with Lady Clair and a million other classics that have resurfaced over and over in my classes in grade school and college. I want my own copy!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "how to read a poem and fall in love with poetry harvest book",
        "description": "An exploration of the reasons for and meanings of poetry analyzes poems by Wordsworth, Plath, Neruda, and others to define their unique power and message",
        "authors": "['Edward Hirsch']",
        "infoLink": "http://books.google.com/books?id=fL7rF7LZFgkC&dq=How+to+Read+a+Poem:+And+Fall+in+Love+with+Poetry+(Harvest+Book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Edward Hirsch has written a meticulous analysis of the art of poetry, imbued with an authentic love of the form. From page to page he dissects and interprets; his enthusiasm remains high throughout. Not just the poetry, but also the poets themselves are lavished with heroic praise, their craft transcending the mortal. Their words are golden strands of virtue more appropriately whispered into the ears of gods.But, but...For those of us uneducated in the art of poetry there is a much more basic level of understanding that has to be achieved first: Why no punctuation? Why do sentences break in mid-breath? How does one find the meter in a poem? How does one read poetry without the stops and starts from line to line? Perhaps we should have learned this in school, but we didn't, so we bought this book.This is a good book, really, but it is not what its title suggests. It should rather be entitled \"The Love of Poetry\", or \"Falling in Love With Poetry\", or \"Furthering Your Love of Poetry\", or something else emotive. \"How to Read a Poem\" sounds mechanical, the basics, just what those uneducated among us get when we do a keyword search on how to read a poem.Select another book in order to learn how to read a poem, then graduate to this one once you comprehend the basics.",
                "review/helpfulness": "92/100",
                "num_reviews": 100
            },
            {
                "review/text": "I got this book because I'm a complete novice who would like to learn to enjoy poetry. The book certainly put me on the right track, as it was inspiring more than anything else.My one gripe is that my biggest problem with poetry is that I simply don't understand much of it. Any time I pick up a poem, I will, sure as anything, hit a line or two (at least) I can't figure out, and then I lose interest in the poem. There is a skill to reading poetry and I don't have it yet. Hirsch at his best would pull a poem apart and explain his reading. However, many times he would quote a few lines and talk about how wonderful they were, without explaining what they meant to him, and I was clueless. It was fustrating to have a book that purports to explain poetry to novices assume I would understand something I didn't.That said, I understood about 75% of the book, thought it beautifully written, and am now looking for other introductions to move me along the path.",
                "review/helpfulness": "68/77",
                "num_reviews": 77
            },
            {
                "review/text": "A mentor of mine always used to say &quot;There are two kinds of people in this world!&quot; and he would then expand on whatever dichotomy was on his mind at the moment. He might well have said that there are those who &quot;get&quot; poetry, and those who don't. I have always been firmly in the latter camp, but perhaps am more recently moving toward the former. Though I still have quite a ways to go, this book really helped move me along. This is a very well-written introduction to the joys of reading poetry. Besides presenting the reader with examples of many different types and styles of poetry it's just very enjoyable to read this author's writing.While my reaction to the poems in the book is not even on the same scale as the author's very visceral, emotional responses, I feel like I nevertheless grasped enough of his reaction to know what he was feeling, and what he was getting at in his description. But I'll admit that some of the poems I read over and over again trying to detect some of *his* response in *me*, and I rarely did. I think this has more to do with my naivete, and I sort of envied the author's obvious depth of feeling in response to these poems.Anyway - it's a great read and if you're a lover of poetry or even just curious about it, I recommend this book highly.",
                "review/helpfulness": "57/60",
                "num_reviews": 60
            },
            {
                "review/text": "I really enjoy reading Hirsch because he has a romantic love affair with poetry and his enthusiasm is infectious in the extreme.This is an excellent introduction to what poetry is and what it can do. Hirsch focuses on the romantic/spiritual side to poetry, his favourite poets being Whitman and Emerson.He does get a bit carried away with this at times and is best introducing new and obscure pots such as the modern Greek poet Cavafy.It is not the sort of book you read over three days. I found myself reading very slowly, like eating a big rich chocolate dessert.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Anyone fortunate enough to read an Ed Hirsch column in the American Poetry Review knows that this man's enthusiasm for poetry is unparralleled. In this Book, Hirsch offers his bottomless understanding of poetry's necessity, and his ability to dig into the souls of poets shines. I found myself smiling and shaking my head in agreement with his comments about poets I've never heard of. When someone can get me so interested in a poet about whom I know nothing with just a few pages in a book, I know I am reading the work of an incredibly deft mind. Yes, this book does have the ability to transform people into poetry fans, but readers must first have some sort of interest or passion for poetry. If you've got that, Ed Hirsch does all the rest for you.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I was utterly charmed by this book, but unfortunately lost my copy half way through. I bought a second, determined to have it on hand to be a primary guide as I try to learn more about poetry. For those of us with &quot;literal&quot; minds, Hirsh's words offer plenty of reasons to persevere over what may at first seem to be imponderable communications. He emphasizes the excitement of puzzling out messages poets leave for us and the thrill of the feelings they elict in response. This is a very good book to have if you are growing into poetry or have wondered what all the fuss was about.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "In his acknowledgments, Hirsch states that &quot;this book was conceived as a whole.&quot; That's a little hard to believe; there is only a slight sense of overall organization to the volume. Readers might be better served by approaching this as a collection of separate but related essays in which Hirsch offers his interesting and perceptive thoughts on individual poems and on poetry as a genre. These essays do not offer any sort of step-by-step approach to reading poetry (as a reader might infer from the title), but by modelling his own readings of well-selected poems, Hirsch will both inspire and inform you. This is not a beginning-level book, but those with a modest knowledge of poetry will find this to be an enjoyable next step, and the glossary and reading list at the end are valuable resources.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Hirsch has created a marvelous and exciting book revealing the art and mystery of poetry from Classical times to the present. I cannot believe that anyone reading this work will not be inspired to read more poetry.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I read &quot;How to Read a Poem and Fall in Love with Poetry&quot; by Edward Hirsch as part of an ongoing study of the Psalms that I am engaged in (The Psalm are poems after all). Hirsch's book is oceanic. The waves of Hirsch's passion for the written word break again and again over the reader. It is not an &quot;easy&quot; book. Still, there is much to that can be taken away from these pages. My favorite image is that of a poem being a spell that is cast by its author (using this imagery, the Psalms are then spells cast by God through the hands of humans who are steeped in the raw earthiness of their experience--spells cast to bring future generations up in the training of prayer). The suggested reading list at the back of the book is worth the price of the book all by itself. &quot;How to Read a Poem and Fall in Love with Poetry&quot; is a great book that more than rewards the reader for their effort.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I wish this book was twice as long, or that Mr. Hirsch would do a follow-up book to this one. As with the best poetry, this book speaks to your heart as well as being very instructive. He covers such a wide range of territory in such a quick read. After finishing it I immediately wanted to go back and read it again. He gave me so many interesting fresh thoughts to ponder. This book is not just for those who want to get started with poetry, it is also for those of us who are already true believers but are looking for ways to become more deeply connected.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "party summer fear street super chillers no 1",
        "description": "Three girls are terrorized at a summer beach resort.",
        "authors": "['R.L. Stine']",
        "infoLink": "http://books.google.com/books?id=fcgRlAEACAAJ&dq=Party+Summer+(Fear+Street+Super+Chillers,+No.+1)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Four teens trek up to a supposedly hauntel hotel to fix it up, find a cave inside it, and are hunted down by a psychotic butler with multiple personalities and a big gun. The first in the SUPER CHILLER division of FEAR STREET is boring to no explaination point, the suspense is all padded and muffled, and the ending is stupid. And to top all of this, it's extremely long.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I do not really remember what the story was about except some parts. I am in the 8th grade and had last read the book in the 5th grade when the other day I started thinking of the book and how good it was. I couldnt remember the title and I have spent hours trying to find this book on the internet. After I looked at some titles that looked familiar I found Party Summer, and knew that was the book. I looked at some of the reviews, and sure enough it was! I was sooo happy and after I am finished writing this review I am going to buy this book! Please read, because after about 4 years I remembered how good the book was, and I know that you will love it too. Dont listen to the bad reviews because if you do, you dont know what youre missing! Read!Read!Read!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Despite what others said about this book, i think it was very good. The reason i think everyone didn't like it was because it wasn't that scary! I mean, it was good but it was more adventerous and thrilling, than scary and chilling! It was pretty good! Not the best Fear Street book ever, but it was definitley good! I recommend this book if you are looking for a good Fear Street book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "In the book Party Summer R. L. Stine starts the book out as an exciting vacation and a job at an old inn for a couple of teenagers looking to get away from home for the summer, but things turn out the worst. In the book there are four teenager characters that have disagreements and one of the teenagers is studying witchcraft. They go to the inn and find out that the inn has been closed for remodelling. Then people start disappearing and people start being chased, in the end it's a matter of life or death, will they come out alive? I recommend this book to younger kids into the horror things. I liked it but it wasn't that scary. I like scary books like Stephen Kings Pet Cemetery; though this was a good book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you haven't read this book....please do! You will not be dissapointed at all! Sure some parts were unlikely....but, come on, thats what made the book so good. If you are planning to read this for the first time: don't trust anyone because you never know what might happen.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "rhymes reason a guide to english verse",
        "description": "Poet John Hollander surveys the schemes, patterns, and forms of English verse in this classic text, illustrating each variation with an original and witty self-descriptive example. In new essays for this fourth edition, J. D. McClatchy and Richard Wilbur each offer a personal take on why the book has played such an important role in the education of young poets and student scholars. \"How lucky the young poet who discovers this wisest and most lighthearted of manuals.\"-James Merrill \"Marvelously comprehensive, clarifying and useful, and a delight to read.\"-John Reardon, Los Angeles Times Book Review \"A virtuoso performance and a mandatory text for poetry readers and practioners alike.\"-ALA Booklist",
        "authors": "['John Hollander']",
        "infoLink": "http://books.google.nl/books?id=XcxvBAAAQBAJ&dq=Rhyme%27s+Reason:+A+Guide+to+English+Verse&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I can hardly contain myself. After reading through several books about how to write poetry I came to this one. Though I am almost jumping for joy, I have a soupcon of sadness, because I wish I had started here. Hollander's book is like a good poem: concise, entertaining, and ultimately full of wisdom. Just compare Hollander's examples on forms (in the forms!) to the lackluster examples in The Book of Forms by Lewis Turco.Don't be fooled by the title. This book is about all aspects of poetry, including free verse (and even 'concrete' poems). While Rhyme's Reason has a smaller selection of forms than The Book of Forms and a shorter discussion of prosody than All the Fun's in How You Say a Thing, it had more than enough meat for me. And I can unhesitatingly recommend it for first forays into the appreciation and composition of poetry. Make sure to get the Third Edition, of the year 2000, which has a few added goodies. Enjoy!",
                "review/helpfulness": "56/57",
                "num_reviews": 57
            },
            {
                "review/text": "In this day and age of free verse and English classes where almost no poetry is read, much less written or memorized, John Hollander's little book, &quot;Rhyme's Reason,&quot; is a life-saver for all English majors, teachers, and wannabe poets. Teaching each and every poetic meter and form ever used in the English language, John Hollander creates a few lines of poetry that teach by their existence meter, rhythm, and poetics. Although I prefer the shorter first edition, the second edition will serve if that's all you can find. This book taught me everything my grandmother had learned about poetry by the time she was in third grade; even on her deathbed, she could run off lines of poetry she had memorized as a child, showing off various meters at the drop of a hat. Yet another skill we've lost in this modern age, prosody is an essential craft for any poet, songwriter, or lover of poetry. Find this book!",
                "review/helpfulness": "40/43",
                "num_reviews": 43
            },
            {
                "review/text": "Clear, concise, informed, and witty. This guide to the forms of English verse from our greatest living verse technician goes beyond counting beats and diagramming rhyme schemes to discuss the formal aspects of rhetorical figures -- and how all these help create poetic meaning. All told, it's the most valuable book of its type I've ever read.Contrary to one reviewer, I find the expansions of the second edition -- especially the analysis of verbal mimesis -- useful, and prefer this over the other editions. The third edition has added an anthology of examples taken from the wild, in addition to Hollander's well-bred examples, of forms discussed in the text. This is nice enough in its way, but not essential. Worse, it has (in the first printing at least) a large number of infuriating typographical errors, including incorrect page references.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "This little volume is the single most useful book on formal poetry I've ever owned. It explains the history and the rules of pretty much every verse form there is, with examples that make me want to run for my notebook to start playing with them myself. If you love formal poetry, you must own this book. (And if you don't, maybe it will change your mind...)",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "For those not well-schooled in the vocabulary and techniques of verse, the book is an exercise in frustration. The author seems more interested in showing how clever he is than actually explaining different poetic forms. I was profoundly disappointed with the book . . . a real waste of money. My advice for the neophyte is, \"STAY AWAY FROM THIS BOOK!\" Perhaps its a treasure trove for those with a substantial background in poetry, but for someone relatively new to this art form, I would urge them to buy something else.",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "For those who equate poetry with free verse, this book is a wonderful introduction to the rich variety of traditional English verse forms, a subject that doesn't seem to be taught in school any more. Hollander manages to make a potentially bewildering and dull corpus of material exciting and fun, through his well-chosen examples and delightful commentary. If you love poetry, if you want to learn more about poetry, or if you just want a good read, buy this book. You won't be sorry.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This is a clever and masterful book. The author demolishes the new fashional nonsense about rhyme being creatively passe. Rhyme is not necessarily restrictive or formulaic. It can still be powerful, enjoyable and richly expressive.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Hollander's book is a solid little primer on some of the major issues of poetry. Using the technique of \"formal self-description\" Hollander provides examples of various meters, rhetorical figures, and forms of verse. The writing is clever, and the self-descriptions are insightful.That said, I think the book is not super useful for teachers, as a textbook that is. Were I to teach a poetry or literature course, I would probably only copy those sections out of the book that cover specific rhetorical figures and stanzaic forms that I planed to teach in my class. Otherwise, a lot of the material will seem superfluous to the work you're doing.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I bought this book for a class and it is my favorite of all our poetry texts. It is just plain fun to read. Hollander presents poetic forms by using them as he explains each concept. I noticed that some people thought this was \"too witty\" to learn from, but I found it helpful in that I forgot that I was trying to learn and simply just began playing with language. Which is as it should be when writing poetry!Overall a great book, I recommend it for beginning poets especially. But I'm guessing it would be a fun refresher for veterans of word-craft as well.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Author launches into examples of concepts which were not previously explained. The examples he gives are often his own explanations in verse form. Not an easy book to understand. Perhaps would be worthwhile to a reader who is already familiar with the basics.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "poetic meter and poetic form",
        "description": "Excerpts from distinctive poems illustrate the author's appreciation of the metrical and formal aspects of poetry",
        "authors": "['Paul Fussell', 'Donald T Regan Chair of English Literature Paul Fussell']",
        "infoLink": "http://books.google.com/books?id=8Fx6AAAAIAAJ&dq=Poetic+Meter+and+Poetic+Form&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I was 21 and in my first year of graduate school, Paul Fussell's &quot;Poetic Meter and Poetic Form&quot; was one of the first text books assigned to me. When I bought the book and saw how slim it was, I snickered, &quot;Grad school's gonna be a walk in the park!&quot;Yeah, RIGHT!This densely packed tome is not for the uninitiated and definitely not absorbed in just one reading. On and off, over the last 20 years, I have come back to this book to refresh my memory and, usually, to astonish myself. The book's real strength, besides Professor Fussell's obvious command of his subject, and his ability to convey that command, is in the sprinkling of dozens of anecdotes by and about poets about other poets and poetry. Even at this late date in my life, I can't pretend to understand the entire book but what I do understand I admire and respect. &quot;Poetic Meter and Poetic Form&quot; is not recommended to anyone studying poetry; it is urgently required.",
                "review/helpfulness": "62/68",
                "num_reviews": 68
            },
            {
                "review/text": "Fussell's foreword says that his book is for aspiring readers, not aspiring writers. But if you are an aspiring poet, I think Fussell has something to offer that is absent in most \"handbooks\".One of the most important things Fussell addresses is how the form of a poem affects the meaning and impression of the total poem. For example, he notes how many poetic forms are inevitably coloured by their initial or most famous use. He says regarding Tennyson's In Memoriam stanza-form, that it \"is now so closely associated with the sturdy, serviceable elegaic atmosphere of In Memoriam itself that...its uses now seem limited to occasions which either resemble or mock the original\" (Ch 8 The English Stanzas).Another chapter that poets will find helpful is Metrical Variations, in which Fussell examines how poets substitute variant feet to create particular effects. Or if your interest is in free verse, he devotes a chapter to examining the characteristics of successful free verse, including how line breaks create effects.This is not a substitute for a general handbook of poetry, and assumes a minimal knowledge of poetic technique, meter, &c.; But if you are serious about reading or writing poetry, I don't think you can afford to miss this book.",
                "review/helpfulness": "62/63",
                "num_reviews": 63
            },
            {
                "review/text": "This book is a classic of prosodic exposition. (And understand, when I call a book a classic, I am not just lapsing into a cliche; it really IS a classic.) Fussell shows us the relations between form and content, between rhyme and rhythm on the one hand and the function of these formal devices to illuminate meaning on the other. The book also devotes a chapter to empirical observations on the properties of free verse, and it includes a concise bibliography of other works on prosody. Highly recommended.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I came across this book for my Poetic Analysis class in college. It is an exellent book on meter and form. I can't even say how much this book has helped me with both reading and writing poetry. If you want to write better poetry or understand the poetry you read, then this is a good book to pick up.",
                "review/helpfulness": "16/22",
                "num_reviews": 22
            },
            {
                "review/text": "This is a lucid, engaging short book on the elements of poetry listed in the title: meter and form. Fussell does not provide the kind of encyclopedic information found in many poetry &quot;handbooks&quot;; what he does offer is a basic approach to scansion and analysis, and models for using these techniques in reading and writing about poems. This is a classic text, written with a great love of formal poetry, and referred to often by students and writers of poetry. The only thing that keeps my rating under 10 is that it is fairly out of date, and there are more recent texts that cover contemporary poets and verse forms with more rigor than Fussell. But for a readable treatment of the accentual-syllabic tradition and the first century or so of free verse, this book is a gem.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book is wonderful. Fussell in opinionated and unafraid to display his own taste, but I find that a good thing (uncommon in academic writing in my experience). My favorite idea of Fussell's is that for a stanza break to be merited, something must happen in the white space _between_ the stanzas: there must be a shift of register or mood.I can't wait to read his most famous book, The Great War and Modern Memory, on the literary impact of World War I.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Fussell's command of formal verse is extensive and even if you're more inclined to free verse I highly recommend his book because it provides essential tools for becoming a more critical poetry reader. Scansion and the additional vocabulary have been the most useful tools for me.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "poetic meter and poetic form random house studies in language and literature sll3",
        "description": "This bibliography is the second revised edition of a book first published in 1978 under a somewhat different title. Apart from correcting mistakes, the second edition extends the coverage of material until 1986 and includes many items from 1987 and 1988. It also adds numerous items that should have been included in the first edition but had somehow escaped my notice.",
        "authors": "['K. P. S. Jochum', 'Klaus Peter Jochum', 'Allan Wade']",
        "infoLink": "http://books.google.nl/books?id=JIRbAAAAMAAJ&dq=Poetic+meter+and+poetic+form+(Random+House+studies+in+language+and+literature,+SLL3)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I was 21 and in my first year of graduate school, Paul Fussell's &quot;Poetic Meter and Poetic Form&quot; was one of the first text books assigned to me. When I bought the book and saw how slim it was, I snickered, &quot;Grad school's gonna be a walk in the park!&quot;Yeah, RIGHT!This densely packed tome is not for the uninitiated and definitely not absorbed in just one reading. On and off, over the last 20 years, I have come back to this book to refresh my memory and, usually, to astonish myself. The book's real strength, besides Professor Fussell's obvious command of his subject, and his ability to convey that command, is in the sprinkling of dozens of anecdotes by and about poets about other poets and poetry. Even at this late date in my life, I can't pretend to understand the entire book but what I do understand I admire and respect. &quot;Poetic Meter and Poetic Form&quot; is not recommended to anyone studying poetry; it is urgently required.",
                "review/helpfulness": "62/67",
                "num_reviews": 67
            },
            {
                "review/text": "Fussell's foreword says that his book is for aspiring readers, not aspiring writers. But if you are an aspiring poet, I think Fussell has something to offer that is absent in most \"handbooks\".One of the most important things Fussell addresses is how the form of a poem affects the meaning and impression of the total poem. For example, he notes how many poetic forms are inevitably coloured by their initial or most famous use. He says regarding Tennyson's In Memoriam stanza-form, that it \"is now so closely associated with the sturdy, serviceable elegaic atmosphere of In Memoriam itself that...its uses now seem limited to occasions which either resemble or mock the original\" (Ch 8 The English Stanzas).Another chapter that poets will find helpful is Metrical Variations, in which Fussell examines how poets substitute variant feet to create particular effects. Or if your interest is in free verse, he devotes a chapter to examining the characteristics of successful free verse, including how line breaks create effects.This is not a substitute for a general handbook of poetry, and assumes a minimal knowledge of poetic technique, meter, &c.; But if you are serious about reading or writing poetry, I don't think you can afford to miss this book.",
                "review/helpfulness": "62/63",
                "num_reviews": 63
            },
            {
                "review/text": "This book is a classic of prosodic exposition. (And understand, when I call a book a classic, I am not just lapsing into a cliche; it really IS a classic.) Fussell shows us the relations between form and content, between rhyme and rhythm on the one hand and the function of these formal devices to illuminate meaning on the other. The book also devotes a chapter to empirical observations on the properties of free verse, and it includes a concise bibliography of other works on prosody. Highly recommended.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I came across this book for my Poetic Analysis class in college. It is an exellent book on meter and form. I can't even say how much this book has helped me with both reading and writing poetry. If you want to write better poetry or understand the poetry you read, then this is a good book to pick up.",
                "review/helpfulness": "16/22",
                "num_reviews": 22
            },
            {
                "review/text": "This is a lucid, engaging short book on the elements of poetry listed in the title: meter and form. Fussell does not provide the kind of encyclopedic information found in many poetry &quot;handbooks&quot;; what he does offer is a basic approach to scansion and analysis, and models for using these techniques in reading and writing about poems. This is a classic text, written with a great love of formal poetry, and referred to often by students and writers of poetry. The only thing that keeps my rating under 10 is that it is fairly out of date, and there are more recent texts that cover contemporary poets and verse forms with more rigor than Fussell. But for a readable treatment of the accentual-syllabic tradition and the first century or so of free verse, this book is a gem.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book is wonderful. Fussell in opinionated and unafraid to display his own taste, but I find that a good thing (uncommon in academic writing in my experience). My favorite idea of Fussell's is that for a stanza break to be merited, something must happen in the white space _between_ the stanzas: there must be a shift of register or mood.I can't wait to read his most famous book, The Great War and Modern Memory, on the literary impact of World War I.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Fussell's command of formal verse is extensive and even if you're more inclined to free verse I highly recommend his book because it provides essential tools for becoming a more critical poetry reader. Scansion and the additional vocabulary have been the most useful tools for me.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "casanova was a book lover and other naked truths provocative curiosities abt writing selling reading books",
        "description": "Everyone knows which books people buy; they can just look at the best-seller lists. But who knows which books people steal? Who, for that matter, knows that authors ruin the book market by writing too much? Or why book critics are not critical? Or why librarians need to throw out more books? Who, indeed, knows the answer to that all-important question in our democracy: should presidents and presidential candidates write books? (The answer is no.) In this irreverent analysis of the book industry, John Maxwell Hamilton -- a longtime journalist and public radio commentator -- answers these questions and many more, proving that the best way to study books is not to take them too seriously. He provides a rich history of the book -- from the days when monks laboriously hand-copied texts to the tidal wave of Titanic tie-ins -- and gives a succinct overview of the state of the industry today, including writing, marketing, promoting, reviewing, ghostwriting, and collecting. Throughout, Hamilton peppers his prose with spicy tidbits of information that will fascinate bibliophiles everywhere. For instance, did you know that Walt Whitman was fired from a government job because his boss found Leaves of Grass, and its author, immoral? Or that the most stolen book in the United States is the Bible, followed by The Joy of Sex? How about that Dan Quayle's 1989 Christmas card read, \"May our nation continue to be a beakon of hope to the world\"? Or that Casanova was an ardent lover of books as well as women? Hamilton offers an inside look at the history and business of book reviewing, explaining why, more often than not, reviewers resemble \"counselors at a self-esteem camp\" and examining the enormous impact of the \"Oprah effect\" on the market. As the self-appointed Emily Post of the book world, he advises publishers, authors, and readers on proper etiquette for everything from book parties (\"Feel free to build a party around a theme in a book, no matter how tacky\") and jacket photos (\"You should not show off your new baby unless [your] book [is] about raising kids\"), to book signings (\"Just because an author has given you an autograph does not mean they want to become your pen pal\") and promotion by friends and relatives (\"They should carry the book at all times on public transportation with the cover showing\"). Both edifying and enjoyable, Casanova Was a Book Lover fills a Grand Canyon--sized void in the literature on literature. It is indispensable for book enthusiasts who want to know the naked truth about reading, writing, and publishing.",
        "authors": "['John Maxwell Hamilton']",
        "infoLink": "https://play.google.com/store/books/details?id=M79HuG-HhzMC&source=gbs_api",
        "review": [
            {
                "review/text": "8 Stars ********This was the first book I have read in years that I was sorry to reach the end of. Each sentence is there to delight you. Each story is there to enthrall you. Each chapter encompasses a microcosm of the wonderful world of books. If you love books, are interested in authors, wonder about reviewers, or find dedications and acknowledgments intriguing, you've found just the right book!One of the things that makes the book especially delightful is that it does not take the subject too seriously. For example, the dedication (in part) is to all book reviewers so that they will not pan the book (I would have praised the book anyway!). You will also learn which authors wrote in the nude on their porches. There really is a section on the writing career of Casanova.From readers, to the economics of authors, to what happens to all those books that go to the Library of Congress, to which books are stolen most often, it's all here. Each seemingly irreverent thought though builds into a fascinating picture of the role that books play in the lives of authors, readers, reviewers, publishers and book sellers. You will get insights from Gutenberg to Amazon.com.Here are some of the chapter titles to give you a sense of the book's coverage and mood:-- T. Roger Claypool's Fish Store -- Art of Marketing -- Artless Thank You's -- A Guide to Good Book Behavior -- Inglorious Employment -- Literary Luck -- Best Stolen Books -- Dear Mr. Politican, Please Don't Write A Guide to Good Book Behavior tells you what to do and not to do when you friend writes a book. You'll learn the etiquette of writing an autograph if you are an author.The material is so good that this could be turned into a one person Broadway show. That would be wonderful!Have a great time reading this book. It is best taken in laugh-size bites!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Where do I begin the praise for this extraordinary book? I could start with the brilliant prose, that makes every passage sparkle. Or I could comment on the ingenious content, that unleashes its wisdom upon the reader as each page is turned. Perhaps I should begin with the witty satire, that provides comic relief throughout the whole of this magnificent book. No, I don't think there is just one facet of Casanova that makes it the wonderful piece of literature that it is. Rather, it is the sum of its parts that makes me read it over and over and over, until I have been able to memorize and recite entire chapters at a time. Like a fine french wine, say a '75 Rothschild, this book has to be savored. Every page has to be drunk deep into the readers' psyche. I would suggest you buy several copies, just as insurance in case one or two are destroyed. My father really needs the money from the royalties.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Hamilton does what needs to be done to the book industry...this book pulls no punches and exposes all the tie-ins and problems with critical reviews, including the problems with the one I'm writing right now! It really is an eye-opener and has helped me be more critical of the quality of books now being published and to distinguish between the plethora of junk and self-promotional drivel. Good read!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "John Maxwell Hamilton, in Casanova was a book lover, obviously researched his material extensively. Yet a credit to him is the fact that this book is the opposite of dry. Casanova was a Book Lover is wetter than the Amazon(no pun intended) Rain Forest, as he adds dashes of wit to his wisdom regarding his subject matter. There were passages I literally laughed out loud even as my uneducated (respectively speaking) brain soaked up his tidbits of knowledge. This text isnt perfect obviously, and confession time I skimmed a page here and there. Overall though it is arguably the best book on books writtin within the last decade. Perhaps the greatest compliment is his ability and agility in appealing to both the Literrati, and layperson in this book;s text and factiods. A fine touch of irony in that he seems disparaging of the Amazon review process, and I see his point in many ways, yet his work gets glowing reviews(mine isnt first or hopefully last). Well done Mr Hamilton, though you may snort if you happen to come across this review teehee, I stand by my critique.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This work appeals on many different levels. With the author's sparkling wit a constant companion, the reader is taken on a veritable Aeneid through the literary world. Everything from vanity presses to coming-out parties to the hype machines that drive sales to the overloaded Library of Congress make appearances. The breezy style lulls you into enjoying every little tidbit until you look up to realize that the ride is at an end.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the drunken driver has the right of way poems",
        "description": "A provocative, humorous collection of poems by one of the movie-making \"Coen Brothers\" covers a wide array of bizarre topics, from Mamie Eisenhower in love to the poet's own battle against amphetamines. 25,000 first printing.",
        "authors": "['Ethan Coen']",
        "infoLink": "http://books.google.com/books?id=FdmODQAAQBAJ&dq=The+Drunken+Driver+Has+the+Right+of+Way:+Poems&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have never read a book of poetry from cover to cover before...mainly due to induced narcolopsy after the first few pages. It was therefore with some degree of drowsy trepidation that I received this gift from a close friend. I read the first poem, then the next, then the last...and wondered where this guy had been all my reading life.I found these poems to be surprising, cleverly metered and worded, and very, very funny. I loved &quot;Agent Elegy&quot;, a scathingly intimate portait of a Hollywood agent in repose. I laughed out loud over &quot;Churchyard&quot;, a collection of cautionary epitaphs, and I completely fell off my chair for &quot;The Hopping Poem&quot;, &quot;After Bukowski&quot;, and many others. Any book that has a chapter entitled &quot;Clean Limericks--What's the Point, After All?&quot;, you gotta like. There's plenty of the other sort as well.I find the fact that these works are the cast-off thoughts of an author who is accomplished and celebrated in another medium to be nothing short of amazing.Don't be put off by the highbrows and their sneers...this is truly poetry for us huddled masses of lowbrows yearning for rhymes a little less rarefied. This is a wonderful book!",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "I certainly enjoy classic poetry, but I also enjoy parody and fun poetry. This short book has some absolutely hysterical poems, and many of them parallel the classics. The title poem is actually making a great point about how the reckless people in life force the rest of us to yield to their desires.The more bizarre/extreme works in the collection might offend some people, but if you have a good sense of humor and don't get upset easily, then you'll certainly enjoy this work.A quick story: I brought this book into school and passed it around the English department ... almost everyone found a poem to read aloud, and we all had fun discussing them. The consensus favorite was the poem &quot;Reunion,&quot; where Coen perfectly hits what goes on at the 10, 20, or 25 year high school reunion. Pick this up and pass it on ... you'll laugh at the least.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Open-minded adult readers who love rhyming poetry, humor and cutting through facades and baloney to the truth about anything will instantly love this little book. It will keep its owner chuckling, nodding in approval and thinking of giving it to someone as an inexpensive gift.Those who say whatever they feel like saying and relish the work of writers who do the same will be in their glory reading Coen's poems. Those who favor moderation in speech and writing might have reservations. They don't need to be prudes to feel this way. Some are getting tired of writers who flaunt their \"openness\" when discussing vaginas, penises, drunkenness and the like. If these poems were part of a movie they would be rated R.The quality of these poems is highly variable. There is some filler in this collection. The best one by far is \"The Drunken Driver Has the Right of Way.\" It is worth the price of the book to read this one and a full third of the others.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "candy is dandy the best of ogden nash",
        "description": "A bumper volume of the best poems by a hugely funny and quotable writer.",
        "authors": "['Ogden Nash']",
        "infoLink": "http://books.google.com/books?id=PiCTAAAACAAJ&dq=Candy+Is+Dandy:+The+Best+of+Ogden+Nash&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Nash's work is too often regarded as light and meaningless; admittedly some of the work is very much \"of it's time\" now, but it is largely rich, diverse, insightful and wonderfully clever.The rhymes are complex and intriguing and form great volumes of biting social comment. They are deliciously constructed and achingly funny at times.Yet he seems to be an almost forgotten \"Children's\" poet, even if this were the case, are not some writers for Children so good as to far exceed the virtues of those who write for adults?Rhold Dahl, J K Rowlins, Lewis Carrol and E Nesbitt spring to mind, Nash needs also to be on that hallowed list.He really should be regarded as an American National treasure!",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "I usually dont read poetry. This book was an impulsive buy. It has become one of my most treasured possessions. Given that most bookshops relegate poetry to a dusty out of the way shelf, finding more titles by the poet in India was impossible.The book is full of funny limmericks, touching poetery and serious emotions expressed in teh most beautiful way.Buy it and treasure it foreever. I haven't bought any of the other books.... too expensive and they dont ship to India",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "Being poem-illiterate, this book came by as a pleasant surprise to me.This book is a collection of light, humurous poems. Most of the poems are about children, but there are poems on other subjects too, like marriage. Children rule the roost though.Its the kind of book when you glance through your book rack, spot this book, pick it up to read just one poem, but can't put it down until you have re-read all the poems. I highly recommend this book to anyone who wants to sit back and enjoy a humurous poem peppered with puns. And if you dislike children, this book is written for you.Its a book that you got to have on your shelf.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "Ogden Nash is a poetBut he doesn't noetIf you love lines that do not bother too much about archaic rules of spelling and poetry, and are out to have fun, then here is a world you cannot miss.This book is best enjoyed read aloud, with a few friends, with a few drinks:-)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Nash's verse blends sense and nonsense in a way that all makes sense--with odd observations, words made up or transformed just to make the rhyme scheme, and idiosyncratic metaphors and analogies. Read them aloud, to your parents, your children, your students, your teachers, your friends. You get the idea.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "theres a fly on my toast",
        "description": "THIS IS AWESOME! Reviewer: A reader This book is SO MUCH fun! I have read and reread the funny, peculiar, thought provoking poems so many times with my daughter that it is already showing great signs of wear, after only two months. I hope this author is discovered by some big time talk show people. He deserves to be known as well as some of the others such as Shel Silverstein, Jack Prelusky and the others that keep us laughing. Encore! Encore! Encore!",
        "authors": "['Justin Matott']",
        "infoLink": "http://books.google.com/books?id=TSQeAgAACAAJ&dq=There%27s+a+Fly+on+My+Toast&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am nine years old and I think that Justin Matott's books are great for young kids to read. I have read all of them many times. My favorite poems in \"There's a Fly on My Toast\" are, \"Revise This, Revise That\" and \"There's a Fly on My Toast.\" I can't wait for his next book!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "my mom got me shawn silverstine books and i read them all. I like crazy poems and then I got this one. It is so funny and has a ton of different kinds of things to read about. The pictures are funny too and i want to read more of Mr. Mattott books.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the nokia revolution the story of an extraordinary company that transformed an industry",
        "description": "This potent study of breakthrough innovation and strategic transformation takes readers behind the scenes of the legendary, yet enigmatic, Nokia Corporation.",
        "authors": "['Dan Steinbock']",
        "infoLink": "http://books.google.com/books?id=o2RnQgAACAAJ&dq=The+Nokia+Revolution+:+The+Story+of+an+Extraordinary+Company+That+Transformed+an+Industry&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Did you know that Nokia started out in the mid-1800s as a forestry plant in Finland? Yes you heard right: a forestry plant! This is a very well written book about the history of the Nokia Corporation, its ups and downs, successes and tragedies. If you've ever wanted to know what Nokia was like before it became a mobile communications giant, then you should read this book. However, be forewarned that this book is not for the casual reader as it can get very technical in terms of economics.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Nokia Revolution has such a detailed history of this famous cell phone company from its very beginning of a wood pulp factory to the leading mobile and internet company now, that it taught me a lot more about how a business really works than how a successful company looks. Nokia, according to my poor knowledge before, is merely a famous company whose cell phones are said to be the most durable product that won't be broken even if you drop it a thousand times to the ground. This book makes me think much deeper into the struggle the company went through to get this kind of fabulous quality and services to satisfy customers' needs.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Dan Steinbock gives you a riveting look at one of the most important companies of our time in an elegant, storytelling style. His text is rich in detail and seems to capture every conceivable perspective on every possible event in Nokia's 140-year-old history. Writing almost at the level of a fictional narrative, Steinbock adroitly takes you through the company's highs, lows and pivotal moments from its origins in the timber industry in the 1860s and the merger in the 1960s that first gave it an electronics division, to the suicide of its influential CEO in the 1980s. It's all here, along with Nokia's strategies and values. We [...] recommend this book to anyone who relishes well-written corporate adventures or who harbors a certain curiosity about events inside influential companies (or about corporate thought in Finland, for that matter).",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Before reading that book you should to ask your self why you reading it. Did you read it because of fun or as a buisness searching source. If you reading it for fun the book would be kind of boring and dump, but if you read it as a source you would benifit and that will be great for you. The book is a kind of historical book, the author just put facts on his own way. Althought the book have no fun it is generally a good historical book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "maxwells train",
        "description": "Burnt-out intellectual Harry Maxwell, employed as a cleaner for the Washington Terminal Company, becomes involved in a plot to steal a U.S. Treasury currency shipment from the railroad, a scheme that embroils him with the World People's Army, an international terrorist organization",
        "authors": "['Christopher Hyde']",
        "infoLink": "http://books.google.com/books?id=pBNM-8B2hnsC&dq=Maxwell%27s+Train&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Love this book. I've always enjoyed train movies, and this is my favourite train book. Non stop action! Like the other reviewer said, the main character is no saint, with a less than savoury past, but you are cheering for him at the end, because there is much worse than him around - especially on this train.A recomended read if you run across it second hand.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is my favorite book!!!! If you had to pick 1 book to read, pick this. A book you can't put down. &quot;You feel the same as the train, racing down the track at 79 mph&quot",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The hero is no saint! Yet his motives and methods make him a role model (not that I recommend robbing a train!) I read this book when it first came out and have read it several times since. I have kept it through four moves and expect it will stay on my shelf for some time.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "But this book sucked. I gave it 2 stars out of respect for the author. I started with 2nd Assassin, loved it, then it was Gathering of Saints, love it, then Wisdom of the Bones, and I loved it, but this early work by Hyde just didn't cut the mustard with me. I found it slow, and awkward, and it felt as though it was written by a novice. I didn't finish, barely got half way, which is pretty rare for me. I've got to really dislike a book to not finish. If I had read this book 1st I wouldn't have read any of his work since this one. Glad I didn't start here.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how does a poem mean",
        "description": "Explains the basic elements of poetry, and groups poems to encourage an analysis of similarities and differences",
        "authors": "['John Ciardi', 'Miller Williams']",
        "infoLink": "http://books.google.com/books?id=HAtlAAAAMAAJ&dq=How+does+a+poem+mean%3F&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was a text book for me as I wandered, wonderingly, into the world of freshman college English Lit. in 1960. It has made th cut on all of the 27 &quot;moves to new digs&quot; that I have made since then. It is now like an old friend--treasured, respected, loved. I am sorry it is out of print because my copy is held together with tape and cannot last too much longer. It is written with such an obvious love for the subject matter (the poem) that one is caught up in that love and swept along with it. Yet, the writing is simple, clear, and constructive. It is an introduction to poetry for an adult of any age. For me, it was, and is--priceless.",
                "review/helpfulness": "49/52",
                "num_reviews": 52
            },
            {
                "review/text": "John Ciardi's How Does a Poem Mean? is an intriguing, unorthodox, and surprisingly effective introduction to poetry. He argues that the question: \"What Does a Poem Mean?\" is too often a self-destroying approach that results in paraphrasing and misses the point of poetry. A poem is to be experienced, not simply interpreted. Unlike prose, a poem is primarily a performance.How does a poem build itself into a form out of images, ideas, and rhythms? How do these elements become the meaning? How are they inseparable from the meaning? John Ciardi's remarkable textbook answers these questions, makes enjoyable reading, and is a five star introduction to poetry.This text, published by Houghton Mifflin, was adopted by many colleges in the 1960s and 1970s. Inexpensive, used, soft cover copies are still fairly easy to find.The eight chapters are titled How Does a Poem Mean?, A Burble Through the Tulgey Wood, By Rippling Pools, The Words of Poetry, The Sympathetic Contract, The Image and the Poem, The Poem in Motion, and The Poem in Countermotion.I encountered many familiar poems as well as others new to me. Among the latter, I list several to illustrate the wide range of Ciardi's selections (and to remind me to return to these poets): The Listeners (Walter De la Mare), Mr. Flood's Party (Edwin Arlington Robinson), The Death of a Hired Hand (Robert Frost), Burning Love Letters (Howard Moss), Snake (D. H. Lawrence), Blue Girls (John Crowe Ransom), Medusa (Louise Bogan), A Subterranean City (Thomas Lovell Beddoes), and What the Sonnet Is (Eugene Lee Hamilton).Also, I especially enjoyed three closely related poems: Departmental (Frost), Heaven (Rupert Brooke), and A Deep Discussion (Richard Moore).Like most collections of poetry, How Does a Poem Mean? is best enjoyed if read in a leisurely fashion over several months. The overall time commitment may be substantial, but John Ciardi's fascinating text will reward your efforts. Take your time. Enjoy yourself. Remember, poetry is to be experienced, not simply analyzed. Cheers.",
                "review/helpfulness": "47/48",
                "num_reviews": 48
            },
            {
                "review/text": "This was a textbook I had in AP English in high school twenty-something years ago, and it is the only high school textbook of which I remember the title-- it was that memorable. A Great book. This textbook both defined and expanded the world of poetry for me, and I hope to again get a copy of it. Until I can find it again somewhere, I will have to be content with with some of the samples of poetry that I can still remember from outstanding book.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "My college professor recommended this to me when I expressed interest into poetry. This book has had a profound impact on my understanding about poetry and my ability to write poetry. The author does an excellent job of really answering HOW a poem means and not WHAT a poem means. Not only does he do a great job of explaining poetics, he also fills the book with many great poems. Forcing yourself to read all of them will leave you with a much deeper appreciation and respect for the art form.If you are at all interested in verse, this should be essential reading.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is probably the greatest book of literary criticism and advice ever offered to readers of poetry. It is wise, funny, playful, thorough and never interpretive. I recommend it to anyone who really wants to learn to read and love poetry.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "make four million dollars by next thursday",
        "description": "Jason Nozzle, multimillionaire. It has a nice ring to it. But can an ordinary kid really make that much money in one short week?",
        "authors": "['Stephen Manes']",
        "infoLink": "http://books.google.com/books?id=SzKqPwAACAAJ&dq=Make+Four+Million+Dollars+by+Next+Thursday!&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I first read this book in the third grade and still love it!!! I am in the eighth grade now and still enjoy it. It is very funny,and easy to read. One of my favorites!!!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is about a boy named Jason. One day he loses hisallowance and uses his brother's metal detector to try tofind it. It doesn't work, but he does find a book. The bookis called \"Make Four Million Dollar$ By Next Thur$day\".He reads this book and follows all the directions. Thedirections are to do all kinds of crazy things. It is funnybecause they are things you would not expect. Does he makefour million dollars? You will have to read the book to findout.I would like to have four million dollars, but my family ismore important.I recommend you first read Stephen Manes' other book \"Be aPerfect Person in Just Three Days\" because it is containedin the storyline of this book. I only gave this book 3 starsbecause \"Be a Perfect Person...\" was funnier.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Quick! Open up this book and begin reading immediately! Dr. Pinkerton is at it again with this second book on how toaccomplish the impossible. It's funny and easy to read (allow45 minutes). Like the previous book, Be a Perfect Person inJust 3 Days, the author has a talent for making you feel likeyou are there. Each page leaves you wanting to find out whatcomes next. Then suddenly, the book is over. Well, it wasn'tas funny as the last one but if I see another book like this,you bet I'll read it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "jessica next stopjr high sweet valley twins diaries 2",
        "description": "Traveling to Costa Rica to help those in need, Elizabeth is disappointed by the group's perpetual partying and fears she is falling in love with, J.P., a boy who originally repelled her.",
        "authors": "['Jamie Suzanne', 'Francine Pascal']",
        "infoLink": "http://books.google.com/books?id=qPzWxQ-Y9WcC&dq=Jessica:+Next+Stop,Jr.+High+(Sweet+Valley+Twins+Diaries&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Three words... THIS WAS AWESOME!!!!!!!! After reading Elizabeth's diary, I was positive this one was going to be just as good. I was right! It may have been better, I can't decide. I was just thinking as I read the book that me and Jessica are totally alike! That is sooo cool! She can be snobby at times, sweet and caring, and fashionable! I loved how Wiley broke up with Lila at the end! Lila deserved it! I can't wait to read the Jr. High books!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Ok this book was totally awesome, here are some reasons why you should read this book. It is great, and Jessica stands up to her snobby Unicorn friends. Also, Lila gets the suprise of her life at the end which she deserved for treating Marissa that way. If you wanna know more you are going to have to read the book because it really rocks.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I absolutly loved this Book. But Like My title states it is a little far fetched. Overall I enjoyed the book so much I could not Put it down! The only thing I really Hated was the ending. I can not Wait to read lizzies book.Ps I'm an old Fan of The sweet vally series!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "models of the universe an anthology of the prose poem",
        "description": "Here at last is a comprehensive anthology of one of the world's most fascinating literary hybrids. This strange sub-genre encompasses the history of modern poetry, from its beginnings in romanticism (Bertrand, Turgenev, Baudelaire), its adolescence in Symbolism (Mallarme, Rimbaud, Trakl), its maturity in high modernism (Stein, Williams, Kafka, Montale, Follain, Char, Vallejo, H.D., and others), and its middle age in post-modernism (Cortazar, Bishop, Ashbery, Simic, Edson, Bly...) up to the present.",
        "authors": "['Stuart Friebert', 'David Young']",
        "infoLink": "http://books.google.com/books?id=k8wNAQAAMAAJ&dq=Models+of+the+Universe+:+An+Anthology+of+the+Prose+Poem&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The prose poem, as noted in the introduction to thiswonderful anthology, has had a long and varied history.Widely regarded as an outsider to poetry, and rejected bymany critics, the prose poem reminds us that the natureof poetry itself is the continual act of questioning andpushing the boundaries of definition. With examples fromthe very first prose poet, Aloysius Bertrand, all the wayto the present, this anthology deserves a prominent placeon the bookshelf of anyone interested in the past, present,and future of poetry.",
                "review/helpfulness": "20/25",
                "num_reviews": 25
            },
            {
                "review/text": "Although I've been studying poetry for decades and working with other poets for a long time, too, I had no interest in prose poems. The musicality of traditionally metered poetry and the gorgeous imagery of free verse drew me into reading, writing, and studying those forms, but prose poems seemed to look and act about as much like poetry as a business letter! While people drooling over the works of, say, Bertrand, Baudelaire, Mallarme, and Rimbaud might need a Kleenex, I felt more inclined to ask for one of those little bags in the back seat pocket of an airplane.In a belated attempt to be open-minded or maybe relieve boredom on a rainy day, I read the anthology of Great American Prose Poems edited by David Lehman and fell in love with prose poetry. These poems were accessible. These poems allowed me to do things in poetry I had not yet tried. And, most amazingly, these poems reached out to general readers and non-poets, making poetry accessible again to regular people.Wanting to find out more about the genre, I checked the titles by Oberlin College (a great proponent of poets, poetry, and the literary arts) and saw that Amazon listed this book among other interesting titles. When I saw the 1995 copyright date, however, I almost emptied my cart, but I'm very glad I did not.This book provides exactly what I wanted - a sweeping view of prose poetry beginning with those \"masters\" I had previously avoided (yeah, Bertrand, Baudelaire, Mallarme, Rimbaud, etc.) and whose work (at last in the context of its intended form) I now \"got.\" In addition, this anthology provides us with a well-selected overview of the works written today by prose poets from around the world.Some of my favorite American poets such as Robert Bly, John Ashbery, W.S. Merwin, Charles Wright, and Charles Simic have been included, of course, and so have poems by Vallejo, Eugenio Montale, Jorge Louis Borges, Wislawa Szymborska, and Tomas Transtromer, thereby lifting the book to its title, Models of the Universe. Besides providing us with exemplary models of prose poems written across diverse times, cultures, and geographies, this highly recommended anthology also gives us a uni- (as in one) -verse too - a poetry that warmly greets and surprises, one paragraph, one verse at a time.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "this book seemed like a good idea when i bought it. but after living with it a while i feel there must be better prose poem collections out there. about half the book--up to robert bly, say--name-checks the hoary old classic, mostly european, proponents of the genre. i say name-checks because only a couple of works by each poet is included. the book justifies its price with a comfortable type size, generous margins, usually one poem per page--but the result of the consequent stingy sampling is that one tends to read through as if it was by a single author. and the choices in the second half of the book, with its heavy emphasis on american authors, seem arbitrary. i think this book tries to do too much.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "nightmares poems to trouble your sleep",
        "description": "Twelve poems featuring a vampire, werewolf, ghoul, and other monsters.",
        "authors": "['Jack Prelutsky']",
        "infoLink": "http://books.google.com/books?id=ZF5_QgAACAAJ&dq=Nightmares:+Poems+to+Trouble+Your+Sleep&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I used to check this little book out from my library practically every week back in the early 1980's. As a kid I was always fascinated by horror and monsters, and this book was a natural companion. Very well written and full of beautiful illustrations, I am not surprised that it is still in print. As for the one reviewer who claims that children should not be exposed to this material, I beg to differ. Children are always fascinated by the strange and unusual, especially scary monsters. The verses in this book were very tasteful, not graphic or &quot;disgusting&quot; at all. Besides, even as a kid, I knew that the monsters in this book paled to the human monsters that still lurk in the world today...and who commit their crimes with government and &quot;moral&quot; sanctions.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I remember reading this book when I was in elementary school. I was an interesting lad that had a fascination for dreams and nightmares and how they worked, even at such an early age. When I came across this book, I couldn't help but read it. The poems I always enjoyed and could never forget, even at my current age of 31. Imagine my teacher's surprise when it was my turn to bring up a book to be read to the class, and I started spouting these poems. The other kids never looked at me the same again. Recently, I just happened to do a search for it, and here it is at Amazon, along with the other book (that I had no knowledge of..it was always the one book I remember). So after a hasty order, I'll be happy to add these to my collection of things to remember, and close another chapter in my own life and memories.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I basically grew up on this and \"Headless Horseman Rides Tonight\". This is something that you can appreciate whether you're a child or an adult, especially if you're like me and you checked it out of the school library religiously. There was a review that said it was \"unsuitable for children\", ummmm yeah sure. As someone who was reading this book at the age of eight years old I can say that it helped expand my imagination and got me really interested in literature. One day I hope my little nephew will read this book and experience the same joy I did when I was little.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The reader who didn't like this book needs to lighten up. Kids love spooky, scary stories. Just ask the Brothers Grimm! This book has wonderful, simple poems with a beautiful rhythm. Perfect for bedtime reading.The book is not gory at all. Sure it mentions eating children and such, but look at Hansel &amp; Grettle or the Three Bears! Ah well. I highly recommend this book for anyone, child or adult, who enjoys fun, creepy poetry and bleak, haunted illustrations. Wish I'd found this book when I was a kid. I'd have loved it!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I read this interesting book of poems as a young child and I've never forgotten it. As my introduction to reading poetry for pleasure, Nightmares was a delight and I still remember some verses probably 15 years later. I'd definitely recommend this book to anyone.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I must have read it at the age of seven or eight. I can still remember choosing the the slim volume off the shelf, and the gleaming skull cradling the bouquet of wilted roses, grinning at me from the cover. I recall vividly the &quot;Will O'The Wisp&quot;(what was it?), the Goblin (perched on the monkey bars, salivating over the prospect of a banquet soon to come), and the Werewolf (prowling the cobbled streets, and knowing EXACTLY where I was). I fell in love with these poems, and I &quot;relished the picters&quot; (Lovecraft). My mother hated them, with a passion, and that is probably why I was so quick to pursue the sequel: &quot;The Headless Horseman Rides Again&quot;. I have not read the verses or seen the illustrations for years, yet I remember them clearly, and a mere four nights ago, I dreamed of standing alone on a desolate, rain-slicked street, purchasing roses for my sweetheart......from the Reaper.Thank You. --C. M. Kallenberger",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I first read it when I was in the 2nd grade about 1979, and to this day, I still remember the drawings, and the frightening poetry that went along with it....a wonderful scary-first book for every child with an imagination.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "top ten of everything 2001",
        "description": "A collection of top ten lists of facts and trivia updated for 2000.",
        "authors": "['Russell Ash']",
        "infoLink": "http://books.google.nl/books?id=V2GFJwAACAAJ&dq=Top+Ten+of+Everything+2001&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is awesome. It makes a great bathroom reader and fact book. It's fun to read it aloud to other people, too. I really reccomend getting 'Top 10 of Everything 2000'. You will really enjoy it. A great companion to this book is 'Guiness Book of Records 2000(hardcover)'. These two books are great fact books and entertaining too. AWESOME!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I found this book to be almost addictive. I originally saw it in a doctor's office and thought of taking it with me, but didn't. I left his office and imediately bought it. The text is well orginized and to the point, with hundreds of little known facts. An excellent book for the Cliff Claven (from Cheers) in all of us.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is very cool. It's a cool book to just flip to a page and start reading. It's a coffee table book, totally addictive for the whole family. Once I start reading it aloud, everyone gathers 'round and pretty soon we're all in stitches. It has all sorts of facts and it have even helped me with homework. This is just a fun book, not serious reading just cool to have around.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "if this book were in a smaller size, it would make a perfect book full of reading material to brouse while in the bathroom. People will think you have died in there because you will be reading so long. It's both interesting and funny.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "midwest eclogue poems",
        "description": "\"The most expansive and moving poet to come out of the American Midwest since James Wright.\" Marilyn Hacker\"",
        "authors": "['David Baker']",
        "infoLink": "http://books.google.com/books?id=55sJHQAACAAJ&dq=Midwest+Eclogue:+Poems&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "...And I read a lot of books. If you are looking for a book of poems by a smart, humane, passionate poet, here's the book you need to read. If you're tired of the pretentious incomprehensible word constructions of the hip ironic poets, read these poems instead. If you like poetry that's both musically rich and emotionally adult, complex and yet precise, here's your book. The poem \"Hyper,\" about his daughter's diagnosis of ADHD, is by itself worth the price of the book. I'll be reading this collection for years to come.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "The poetry in this book is stunning. Two of Baker's favorite poets are Emily Dickinson and Walt Whitman, and it really shows. The language is tight and flowing and beautiful, and his poetry addresses many different issues: ADHD, cancer, environmental ruin, etc, in a story format.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "while searching for love and self a journal in prose and verse 19862003",
        "description": "On the eve of his 18th birthday, a young man pens a letter to his future self. This will be the first entry in what will become a 17-year journal in poetry; poetry which embraces the hopes and heartbreaks of his relationships until the day when he, at last, answers his letter from so long ago. This true-life journal confronts emotions ranging from quick wit to those which are rarely discussed by men. While Searching for Love and Self is an honest, as-it-happens account of life and love, from adolescence to adulthood, that provides us all with an \"I've been there\" nod of the deepest understanding.",
        "authors": "['Don Paul Martin']",
        "infoLink": "http://books.google.com/books?id=HIn059OBoKEC&dq=While+Searching+for+Love+and+Self:+A+Journal+in+Prose+and+Verse+1986-2003&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "At first, I thought that \"While Searching for Love and Self\" was going to be some kind of \"Sex in the City\" style diary, denoting the author's experiences in dating. When I received my copy, I was surprised to open it up and discover that it's actually a poetic depiction of important moments in a man's life as he enters adulthood (I suppose the subtitle, \"A Journal in Prose and Verse, 1986-2003\" should have given me a clue). I was hardly disappointed! I read through it at a leisurely pace in two days. Then I read it again, from introduction to the back cover. I had at least a half-dozen epiphanies each time I read it. It didn't matter that I am not a man; the book centers on his (the author's) experiences, yes, but its themes are universal. It focuses on relationships, not only romantic, but also with family, relationships with friends, community, with pets (a poem that made we weep until my tear ducts were sore), and a rag doll he had as a little boy (which made me cry even though my tear ducts were sore).The poetry is not complicated. It is easy to read and enjoyable, vivid, and what made it fascinating to me was that in reading it from cover to cover, you saw this man evolve from a seventeen year old to a mature adult. I have kept journals since I was 13, and reading this book made me wish that I had kept mine in poetic form too, or even better, made me think about taking my writings and converting them into poetry so I can relive my life in my words as I have relived his as an observer.I highly recommend \"While Searching for Love and Self\" not only because I enjoyed it and will certainly enjoy it again, (and find more layers in it each time), I also recommend it because everyone will find forgotten memories and emotions in it. It's impossible not to.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "After the first few poems, I thought I'd made a mistake and should have borrowed another book from a friend who had pushed this one on me. You can tell that the first few poems were written by a teenager, and I was at the point where I was just going to put it down and watch tv instead. But then I read &quot;Where Once There Was a Cage&quot; and I found myself going from my cranky mood to just having a complete tearburst, and then I was hooked. I realized that the poems before that WERE written by a teenager, and that is the POINT of the book. It takes you from that awquard stage of adolescense and moves you forward, as if you were developing (not aging, so developing is the only word I have)from the perspective of the writer. Like, these are his thoughts and emotions from the most personal perspective that you can get in a book, as if you had the driver's seat in his heart and mind. And the book brings you places that I as a woman don't think men go to often enough, or at least I don't see it often enouth, but that's my issue!There was some stuff that I thought he experimented with that didn't quite work for me. There are two poems that he frames into shapes, one of a dollar sign and one of a skull. I thought the dollar sign one was very funny, but it was gimmicky. The skull one was too bitter, but I guess that's an emotion too. The &quot;Ode to a Rag Doll&quot; poem was very touching, and for my whole life I wish someone had written a poem like &quot;Forbidden&quot; for me. And there are a couple of others in there like that, really good love poems. The two haiku poems were really good; one was very amusing and the other I just adored because my mom was Japanese and she loved eastern poetry and she would have liked that one alot. Theres probably more than 80 poems, so I can't review them all, and I'm not even mentioning my favorites (except for the Cage and the Forbidden poems).The closing was very fitting. Someone else wrote that now she wanted to know what happens to the man next, and I hope I don't have to wait more than a decade to find out, either.To summarize, I gave this book four stars because I think five star books should be classics or staples on everyones booksehelfs. But I am very glad that I read past the first couple of poems because it was so worth it, and it took me on a ride that I was in no way expecting. It was very emotional and fun. Each poem made me think about my experience through life, and like my life I didn't know what the next poem was going to be about, or how my life would turn. I related to it FAR more than I thought I would relate to a book of poetry written by a man. It wasn't an artsy-phartsy collection of poetry, it was just very open, honest, and I have to say really brave for the man to let you in the way he did.I have read the book twice, and my advice is to pick up a copy and do the same. Bring kleenex and let a friend borrow it.Fran",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "love that dog",
        "description": "Jack Room 105 -- Miss Stretchberry September 13 /center I don't want to because boys don't write poetry. Girls do. Meet Jack, who tells his story with a little help from some paper, a pencil, his teacher, and a dog named Sky.",
        "authors": "['Sharon Creech']",
        "infoLink": "http://books.google.nl/books?id=1z2GKxGjWxcC&dq=Love+That+Dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As Jack tells us in his writing journal on the first day of his class' poetry unit: &quot;I don't want to/because boys/don't write poetry./Girls do./I tried./Can't do it./Brain's empty.&quot; But as hard as he resists the idea, poetry begins to seep into that empty brain. At first the works his teacher, Miss Stretchberry, introduces make little sense to him. &quot;Why doesn't the person just/keep going if he's got/so many miles to go/before he sleeps?&quot; Eventually, the poetry seductively captures him, and he writes about William Blake's, The Tiger: &quot;I am sorry to say/I did not really understand/the tiger tiger burning bright poem/but at least it sounded good/in my ears./Some of the tiger sounds/are still in my ears/like drums/beat-beat-beating.&quot; When Miss Stretchberry reads Walter Dean Myers', Love That Boy, it all comes together, and Jack is finally hooked, &quot;I copied that BEST poem/and hung it on my/bedroom wall/right over my bed/where I can/see it when I'm/lying/down.&quot; As the story continues, he begins to open up, write his own verse, and with the guidance of his teacher and inspiration of his new favorite poet, finally puts down on paper the poem that's been inside of him all along just waiting to come out; the story of his beloved dog, Sky, who was hit by a car..... Newberry Award Winner, Sharon Creech, has outdone herself with this marvelously sensitive, sometimes poignant, often amusing little masterpiece. Her simple text, told in free verse, and written in the voice of a ten or eleven year old, explores the power of words, their rhythm, and energy, how they can inspire, captivate, and elicit feelings. Young and old, alike will be entranced as they begin this wonderful journey with Jack on his lifelong adventure with the love of words. Ms Creech has included the poems used by Miss Stretchberry at the end of the book, and this is a good starting point for young poetry lovers. Perfect for kids 9-12, Love That Dog is a treasure to be read and shared by everyone.",
                "review/helpfulness": "34/35",
                "num_reviews": 35
            },
            {
                "review/text": "A wonderful story told in free verse and in journal format. As a teacher, I cannot think of a more valuable tool for modeling how to write poetry, a response journal, and elements of a story. The story evolves in a series of short, pithy poems written by Jake as he responds to his teacher's attempts to introduce a love of poetry and elicit more information in his responses. It is told completely in Jake's words, although you can easily infer the teacher's comments. I have to admit this is my favorite book that I have read this summer (over 75) and can't wait to use it in class. An extra treat is the inclusion of an appendix containing most of the poems mentioned in the story.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This short 86-page poetic novel is made for every child who has ever resisted reading a poem, or writing one.The story pulls details from eight poems. In September, Jack, the child narrator in Miss Stretchberry's Room 105, can't understand an unnamed \"poem about/the red wheelbarrow/and the white chickens\" (William Carlos Williams). In October, a few pages later, he fails to grasp \"the tiger tiger burning bright poem/but at least it sounded good in my ears\" (William Blake). By January, he's concluded that \"Mr. Robert Frost/ who wrote/about the pasture/ was also the one/ who wrote about/ those snowy woods/ and the miles to go/ before he sleeps---well!\"That is also the month Jack writes a poem about his family's trip to the dog pound. There, he chose from among \"big and small/ fat and skinny/ some of them/ hiding in the corner/ but most of them bark-bark-barking and/ jumping up against the wire cage\" a yellow dog standing \"with his paws curled around the wire/and his long red tongue/ hanging out\".By March, Jack has waxed enthusiastic about a poem by \"Mr. Walter Dean Myers/ the best best BEST/ poem/ever.\" He has even related it to his experience with the yellow dog, whom he named Sky. In April, Jack writes to Mr. Walter Dean Myers. And in May the poet agrees to visit the school. As Mr. Walter Dean Myers reads poems to the class on June 1, Jack finds \"All of my blood/in my veins/ was bubbling/and all of the thoughts/ in my head/ were buzzing.\" That's about how it feels to love a poem.Several other important details make this book a keeper--not least, what happened to Jack's dog, and his closing poem.At the end, Creech shares the eight poems to which she refers throughout: William Carlos Williams' \"Red Wheelbarrow,\" Robert Frost's \"Stopping by Woods on a Snowy Evening\" and \"The Pasture,\" William Blake's \"Tiger,\" Valerie Worth's \"dog,\" Arnold Adoff's \"Street Music,\" S.C. Rigg's \"The Apple,\" and Walter Dean Myers' \"Love That Boy.\"If you want children to love poems, just give them this one. Alyssa A. Lappen",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "I was delighted to discover this book and have thoroughly enjoyed sharing it with my students as well as my own children. LOVE THAT DOG is a delicious way to introduce young readers to free verse poetry...However, in reading this book we are to believe that the poems are written by a young elementary student. In all honesty, Jack's attempts read very much like prose that is simply rearranged on the page with poetry-like line breaks. Students I have worked with through the years are capable of so much more!So, while I LOVE this book and will continue to use it in my classroom, I certainly don't intend to neglect other poetry books that have delighted and inspired my young creative writers such as: ALL THE SMALL POEMS by Valerie Worth and LITTLE DOG POEMS by Kristine O'Connell George. LITTLE DOG POEMS, in combination with LOVE THAT DOG, is particularly powerful since these short poems are not only about a much-loved dog, but are also written in a first-person child's voice.Worth, George, and other many other poets are needed in the &quot;mix&quot; to help young writers and readers understand that poetry is not *just* short lines and a lot of white space -- but that poetry is also about metaphor, imagery, and some of the amazing and surprising connections that can be made through lanaguage when we write poetry.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "I fell hard for this book. I love poetry, I love my dogs, I love my kids, who, like Jack in this book, are developing a sensitivity to language. I'm also a huge fan of Karen Hesse's _Out of the Dust_, not only because it tells a meaningful, heartfelt story, but also because it's told in blank verse. If children are read and fall as hard as I did for _Love That Dog_, I and my fellow college and university English teachers will not have a problem once the kids make it to higher education. They'll already love poetry.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Love that Dog is about a boy named Jack who had a dog that died, and now he is writing in his poem journal, but he believes that poetry is not for boys. Yeah, right. He writes some beginner's poetry but they are inspired by other professional poetry, and he gets better and more confident at writing poetry throughout the book. He writes poems inspired by the works of Robert Frost, Arnold Adoff and many more.This is a book of humor and poetry, similar to Amelia's Notebook and a Shel Silverstein book combined. The author writes this way because emotions are better expressed in poetry than in prose. It shows young writers how to get ideas inspired by another author. It is a good book for people who like letter books where the whole book is letters. It is for young readers who like poetry. This is a very good book by a very good author.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "A must have to share with kids! It is about a fifth grade boy who detests writing, mostly poems. Creech does an amazing job of taking you through a diary of the boys writing journal and his thoughts that coincidently turn into superb poetry. He thinks poetry is for girls but realizes that poetry doesn't have to rhyme and more importantly need not be only for girls. Very inspirational for students' writing and heart felt as the boy deals with his feelings about a dog he sees at the pound.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "LOVE THAT DOG By Sharon Creech is a touching story of a boy who doesn't like poetry. \"I don't want to because boys don't write poetry. Girls do.\" This book is written in a diary form and shows how Jack grows and learns to like poetry. He is inspired by his teacher, famous authors/poets and the love he has for his dog. As he begins to write poetry he is not too sure of himself because his words don't rhyme. After reading poems by famous authors he realizes they don't have to rhyme and becomes more confident and allows the teacher to post his poems on the bulletin board. At first his poems are anonymous then as he becomes more confident he adds his name and recieves many compliments from his classmates. Jack is particulary inspired by Walter Dean Myers and writes him a letter asking him to visit his school. Can someone that famous take the time to visit Jack's school?",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "Sharon Creech, a well known and amazing author, who's written many books. Love That Dog, I believe is one of her best! A touching book about a boy who rebels on poems for school. When I saw the book it was only made up of poems and I was not interested, but reading other Sharon Creech books, Chasing Redbird, Bloomability (etc.) I thought I should give it a try. What a good choice! The book is a heat-warming story of a boy and his love of his dog. I believe it to be one of Mrs. Creech's best!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I thought this book was really good.So next time you want to read a poetry book you should read Love That Dog.Its a must-have-book.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "lunch box mail and other poems",
        "description": "Poems about school and other topics, such as haircuts, food, and going to bed at night.",
        "authors": "['Jenny Whitehead']",
        "infoLink": "http://books.google.com/books?id=B1qsp0Xr3ZoC&dq=Lunch+Box+Mail+and+Other+Poems&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This was the most highly anticipated book of the season! The drawings are excellent and the poems are quite entertaining. look for all the little touches on each page, like people's names. I highly recommend it!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a treasure- I've given copies to all my friends who are moms. The kids just love it, and ask me to read it again and again. Of course, they know their favorites by heart.... how can you resist a poem about Rutabaga?The variety of the poems and the delightful (and funny) childhood adventures/experiences each relates are just as enjoyable for parents to read as they are for children to hear. The illustrations are charming and full of thoughtful details for little eyes to find. This is our favorite family book- I can't wait for her next one!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Lunch Box Mail is a wonderful children's book of poetry. It's nonsensical,fun, light, entertaining and definitely a way for children to get a great start in reading on their own. The illustrations are creative and childlike.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I read this book to my nephew as often as he asks, which is just about every night, which I don't mind at all. It's amazing how we're both still completely tickled by the fun and ingenious wordplay and the colorful artwork that this book brings together perfectly over and over again. And somehow the author makes it look easy to do.My nephew knows most of these clever and sweet poems by heart, and I have to admit, so do I. If you're a cynical ex-kid like me, this briliant book will take you back to a time when puddles and bugs and sticky stuff were fun things to be played with, not avoided. Thanks for reminding me of how I used to look at the world when I was young and innocent like my nephew, Ms. Whitehead, and also for giving he and I a whole lot of great laughs together!We can't wait for your next book of poems to come out, 'Holiday Stew'...I'm sure we'll be memorizing all of those poems, too...and we'll be loving it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This was a delightful book! The poems were great and the drawings were excellent! I agree that the &quot;little touches&quot; made the book extra special. I particually liked the inclusion of a PURPLE COW!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "laugh at the end of the world collected comic poems 19691999 american poets continuum",
        "description": "Three decades of the Knott at his iconoclastic best, showcasing his versatility & ironic wit. Contains many Knott poems which are not otherwise available in print.",
        "authors": "['Bill Knott']",
        "infoLink": "http://books.google.com/books?id=UwhbAAAAMAAJ&dq=Laugh+at+the+End+of+the+World:+Collected+Comic+Poems+1969-1999+(American+Poets+Continuum)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This collection of poems includes some of Knott's greatest works, including many poems I hadn't read before. To any Bill Knott fans, this is a must have. And to anyone unfamiliar with his poetry, you should immediately check it out; it is a very unique combination of formalism, surrealism and futurism. These isms don't quite cover it, however. He seems to be looking at the entire English lexicon, from ultra-modern slang to archaicisms, when he composes his poems, choosing fresh and surprising combinations of words to fill every line.Some of the best works in the book are his sonnets. (In the future I would love to see a collection of just his sonnets.) I didn't count them, but there are more than twenty sonnets in the collection and each is excellent. Knott uses the form of (usually) the Petrachan sonnet to make entirely fresh and moving poems again and again. One of the most impressive and entertaining of his sonnets is, \"The Sonnet in ix\" (which was first published, I believe, in an earlier, truly excellent, Bill Knott BOA edition book entitled, \"The Quicken Tree\"). The poem is a translation/parody of the Mallerme sonnet. Knott shows off his linguistic prowess by rhyming every line with \"ix\" without in anyway compromising the poem. It is a feat of shear brilliance.Congrats to Bill Knott on a great collection of poetry and thank you to BOA for publishing it.BUY THIS BOOK!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Just buy it! Don't ask questions. Buy everything that Knott has written. Read them all. When you're done, buy everything that James Tate has written. Read them all. If you've not run out of time, re-read them all. Then quit and think about things for a while.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Even Robert Pinsky says so, and, yet, astoundingly, every time I mention this man's name in mixed, literate company, people scratch their heads.I'd like to respond to the accusation in the above PW review that his work &quot;bleeds into inanity...&quot; Maybe there's some truth in that, but so what? I find it both comforting and refreshing that words like &quot;warty-poo&quot; crop up in Knott's work. It's nice that in a medium that's so often sobre and bloated with self importance that there's someone out there who seems to be having FUN, for cripe's sake. These &quot;inane&quot; words and phrases add a little childish delight. What other poet will leave you moaning with heart break on one page and giggling with pleasure on the next.I can't understand why more people who consider themselves &quot;well-read&quot; aren't familiar with Knott. I'm not well-read, and I've read all his books. What's your excuse? Huh?",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Every Bill Knott book I have read as been a liberating experience for me. He continues to redefine the &quot;rules&quot; of poetry. And puzzlingly, not many people have heard of him. Those who have read his work, always swear by it. I have yet to meet someone who had something bad to say about Knott's poetry. Unfortunately for all of us, almost all of his books are out of print. However, there are enough gems collected in this edition to illuminate your perception of poetry, and to turn you on to him for life--perhaps leaving you, like me, scrambling to buy his out-of-print works for rediculous prices.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "now we are sixty and a bit",
        "description": "When Christopher Matthew was six, the poems of Milne always reassured him that other children were as naughty as he was, so on reaching sixty he decided that he should adapt Now We Are Six, for an older audience. Now We Are Sixty is often hilarious, sometimes rueful and always thought-provoking. Some verses are about realising we are not as young as we thought, while some are about the more disconcerting problems of modern life; mobile telephones on trains, anti-social behaviour, traffic jams and the internet.",
        "authors": "['Christopher Matthew']",
        "infoLink": "http://books.google.com/books?id=3EB6DWofoHMC&dq=Now+We+Are+Sixty+(And+a+Bit)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "my son gave me this book on my 60th birthday. I grew up with the milne books and read them to my boys. In fact, our oldest, Christopher, is named after Christopher Robin. Get out your old book of Now We Are Six, and keep it next to you while you read this book. So charming. So clever. Makes me feel like a kid again and it makes me smile....alot.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This collection of short poems is an ode to the person whose age is sixty or better. Some are light, describing the pleasures of age and how your perspective changes. When that hurdle is jumped, many of the things that were so critical before now become superficial. This is summed up in the last two lines of the last poem in the book.But now that I'm sixty I've got to confessThat more often than not, I couldn't care less.Some of the others are less light hearted, describing the downside of aging. Financial fears, forgetting simple things, having to face young criminals and ways to try to recapture some of the exuberance of youth are all mentioned. However, even these topics are dealt with in a light-hearted manner, so there is never a point where the tone turns depressing.Whatever your perspective is on turning sixty, this book will make you smile at some of the consequences of reaching that mark. Matthew is a very good poet and his prose will lighten your feelings, no matter how dark they are.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the well wrought urn studies in the structure of poetry a harvest book",
        "description": "Critical analyses of ten English poems reveal changing styles from Donne to Yeats",
        "authors": "['Cleanth Brooks', 'Paul Rand']",
        "infoLink": "http://books.google.com/books?id=bDXkK4C6CDAC&dq=The+Well+Wrought+Urn:+Studies+in+the+Structure+of+Poetry+(A+Harvest+Book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I first read &quot;The Well Wrought Urn&quot; in 1978, when I was a first year grad student. Now I assign it for English majors taking their final undergraduate seminar. &quot;The Well Wrought Urn&quot; is a collection of essays on various poems. The essays were published in various journals in the 1940s. Why is the book still read? It is read because these essays are superb examples of literary criticism at its best: insightful, accessible, graceful, witty. It is read because when one reads a poem, then reads Brooks' essay about it, then reads the poem again, one learns a great deal about how to understand poetry and gain from it meaning and pleasure. Brooks' insights aren't the only valid insights into these poems, but they are good ones. It's not that we read these essays to understand these specific poems, but to understand how to approach any poem. There's a lot of interesting literary criticism available in libraries, though far more is not very interesting or graceful. Few essays, however, are more helpful to students as tools for teaching the technique of literary analysis. Of course, Brooks, as a New Critic, is using a style of literary criticism not presently trendy. Still, the technique of discovering insights about poetry is still the same, no matter what the theory one uses.The review below this one is worthwhile, but I would suggest that the author misses the joke. What he takes as condescension is a condescension that includes the readers within the circle of initiates. It doesn't scoff at the reader. Thus, it is meant to help English majors think that they are a sort of blessed priesthood who have been initiated into the secrets of the fellowship. (When I was in grad school, that's what I thought we were.) Of course, this is all somewhat tongue in cheek and meant to be witty.About twelve years ago I had the pleasure of hearing Brooks, then quite elderly (I don't know if he is still alive), present a paper at a conference. I remember him as slim, polite, self-effacing--the essence of the Southern gentleman at his best.",
                "review/helpfulness": "35/37",
                "num_reviews": 37
            },
            {
                "review/text": "Never have students and those interested in liberal education needed more to read Brooks' &quot;Urn,&quot; for in clear, readable, and rememberable language Brooks anticipates the neo-nihilism of postmodernism and gives it the lie.",
                "review/helpfulness": "16/25",
                "num_reviews": 25
            },
            {
                "review/text": "This book, written nearly a half-century ago, has never been out of print. To read it is to see why. With Cleanth Brooks, who taught at Yale for most of his career, you feel as if you are sitting in a seminar with the most brilliant professor you've ever known, one who is also a true gentleman with extraordinary solicitude for his students/readers. He takes you through the poems line by line and helps you to *see* the artistry of the poet at work. And so sparkling is his prose style that the essays are themselves works of art. This book is especially appropriate for students who are just beginning to appreciate poetry.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is the kind of elegantly written criticism that makes one want to take poetry seriously. One finds no rant or cant, no impenetrable jargon. Brooks takes a broad selection of English poems across periods and styles, and analyzes their rhetorical structure. He seeks the essence of poetic thought and offers the notion of \"paradox\" as a possible key. The usefulness of extra-poetic ideas is not denied, but he rightly insists that a poem's meaning is not reducible to a simple prose statement. If it is so reducible, then the poem may be judged as true or false by the historian, scientist or philosopher. The book also contains several essays of generalization and the texts of most of the scrutinized works. One of the most satisfying books on the rhetoric of poetry that I've read.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "circles on the water",
        "description": "More than 150 poems from her seven books of poetry written between 1963 and 1982.",
        "authors": "['Marge Piercy']",
        "infoLink": "https://play.google.com/store/books/details?id=4b8eAAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I truly love this book. It includes a fine sampling of Ms. Piercy's work. There are love poems, feminist poems, poems about animals and vegetables and living at the Cape. I bought the book about 15 years ago and I continue to read these poems. Each time I do I get something new. A must-have for anyone who loves poetry!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I had never read Marge Piercy until I found a poem of hers in an anthology and then rushed out to find whatever I could find written by her. That is substantial. I love this book. It contains a wide range of emotions and subjects, all written in a style that makes the poem easy to identify with, while containing multiple layers that make it new every time you read it. Highly recommended.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I love Marge Piercy's poems and this book is the best collection I know. Her clear thinking, uncompromising feminism, her brassy humor, and her hopeful insight have been a delight that I return to again and again",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    }
]