[
    {
        "Title": "contemporary british slang an uptodate guide to the slang of modern british english ntc reference",
        "description": "Criss-cross (crossword puzzle), jam sandwich (police car), and pull the moody (sulk) are examples of nearly 2,000 amusing and quirky slang expressions defined and included in over 4,000 example sentences. This is an abridged edition of NTC's Dictionary of British Slang and Colloquial Expressions' extensive cross-referencing.",
        "authors": "['Ewart James']",
        "infoLink": "http://books.google.com/books?id=wCqLQgAACAAJ&dq=Contemporary+British+Slang:+An+Up-To-Date+Guide+to+the+Slang+of+Modern+British+English+(Ntc+Reference)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I was very disappointed to find out that the number of entries in this reference book is so shamefully small. The problem with this book is therefore not its contents, but rather its failure to present the multitude of contemporary British slang. Actually, I've felt deceived.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I was very disappointed to find out that the number of entries in this dictionary is shamefully small. Therefore, the problem with the book is not its contents, but rather the multitude of contemporary British slang that is not included. I am sorry to say that I've felt deceived.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Anyone who reads English mystery novels or who watches British TV series (especially those intended only for domestic viewing, where the writers haven't made allowances for a residual U.S. audience) occasionally runs into slang and cant that is part of the mental furniture of most Brits but which can be puzzling to Americans. I imagine everyone knows what a &quot;lift&quot; or a &quot;lorry&quot; is (neither of which is included in this book), but where in the world is &quot;Honkers&quot;? And what are &quot;maggies&quot; or &quot;nadgers&quot;? Having spent some time in Britain, and counting a number of Brits among my friends and colleagues, and being a student of language (I'm an editor), I'm always interested in books like this -- but this one is a decided disappointment, lacking in many areas.First: There are many words and phrases here that aren't exclusively, or even predominantly, British, including &quot;graft,&quot; &quot;grand&quot; (meaning a thousand dollars or pounds), &quot;gold widow,&quot; &quot;push-start&quot; (referring to an automobile), &quot;foodie,&quot; &quot;take a pew,&quot; and &quot;the mind boggles.&quot;Second: The author includes words that are certainly British but are not slang in any sense of the word, such as &quot;longstop&quot; and &quot;googly.&quot; These are simply technical terms in cricket -- and the author doesn't both to explain what they actually mean, or their derivation, in any case.Third: There are quite a few *good* inclusions for which a simple meaning is provided, but which really ought to have had more etymological detail. What *is* the &quot;spanner&quot; that gets in the works? *Why* is a convertible called a &quot;drophead&quot;? Where does the &quot;spare&quot; come from in &quot;go spare&quot;?Fourth: There's far too much rhyming slang in this slender volume -- maybe a third of the listings -- and the majority of them aren't even close to being &quot;contemporary,&quot; as the title claims. I ran a number of these laborered constructions past my Brit friends, and they had never heard them, either. Does *anyone* who isn't being self-consciously cute refer to a waistcoat as a &quot;Jimmy Prescott&quot;? Does anyone outside Ascot even *wear* a waistcoat? And I note that the crude term &quot;Kermit,&quot; meaning a Frenchman (a &quot;frog,&quot; that is) is also described as rhyming slang, which it isn't.Fifth: I know no such compilation could ever be complete, but I was able to think almost immediately of a number of reasonably common, non-obvious terms you won't find here, such as &quot;Oz&quot; for Australia, &quot;dropsy&quot; for a bribe, and &quot;lifted&quot; for being arrested. Also, James includes &quot;go down a treat&quot; (speaking of food) but makes no mention of the more threatening (and more common) &quot;do you a treat, mate.&quot; There's no information regarding the author's background for this sort of assignment, but it can't have been much.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "nog a novel",
        "description": "A man drifts through the American West in the 1960s with an octopus in tow, inventing and discarding memories as he struggles to make sense of his life and his surroundings.",
        "authors": "['Rudolph Wurlitzer']",
        "infoLink": "http://books.google.com/books?id=1dDcOwAACAAJ&dq=Nog%3B:+A+novel&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There were very few exemplary novels to come out of the 1960s: maybe &quot;The Crying of Lot 49,&quot; by Pynchon, &quot;Been Down So Long It Looks Like Up To Me,&quot; by Richard Farina [which unfortunately has not worn well], &quot;Twilight Candelabra,&quot; by William J. Craddock [okay, I'm not completely serious here], and the best one of all, the one that social anthropologists should consult when trying to make sense of that mad decade -- &quot;Nog.&quot;Wurlitzer went off to Hollywood soon after, and certainly never achieved this kind of inspired prose again -- though &quot;Flats&quot; influenced Sam Shepard a great deal, and &quot;Slow Fade&quot; has its moments, but more recently he seems burned out.&quot;Nog&quot; is the quintessential &quot;stoner&quot; novel of all time. As such it's a significant document; more importantly perhaps, it's endlessly entertaining and diverting. Wurlitzer was here as original as anyone writing in English since WWII.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "I wish that I could take credit for the &quot;unhealthy ...&quot; quote, but it is attributed to Donald Barthelme from his capsule review which appears on the back cover of my old paperback copy. Writing about Nog, Pynchon proclaimed, &quot;The novel of bull **** is dead.&quot; I thought that the book was marvelous. Wurlitzer has a field day with issues of identity, integrity and all sorts of other topics that, as far as I am concerned, were explored in a manner that was much more compelling during the late '60s and early '70s. The notion of a character who invents/chooses his &quot;memories&quot; tickled my fancy then as much as now. Wurlitzer has always been willing to step out into areas where other authors were either afraid or simply unwilling to follow. Try to find the video of &quot;Two Lane Blacktop&quot; if you haven't already seen it. Wurlitzer wrote the screen play and that of &quot;Pat Garrett &amp; Billy the Kid&quot; as well. If unhealthy mental excitement is appealing to you, I would recommend this work highly. If not, save your yourself some upset and read something a bit more tame.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I may have been one of the first people to read this book. God knows for years I would thrust my tattered copy at friends and insist they read it. My best friend and I still use phrases in conversation that we picked up from the book 20 years ago (&quot;hasten a focus&quot; comes to mind). For some reason I even remember the moment I purchased the book, in paperback, in a Woolworth's back in 1970, mostly because of its &quot;psychedelic&quot; cover art and the promise that &quot;Nog is to literature what Dylan is to music.&quot; After a single, futile attempt at reading it, I found it on the shelf in my old bedroom at my parents' house one day in 1974, and noted that a glowing blurb from my favorite author, Thomas Pynchon, graced its back cover. If there is a message in &quot;Nog&quot;, it may be: mental illness and hallucinogens are probably not a very good combination. Then again, there's more to &quot;Nog&quot; then meets the eye.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Reading \"Nog\" is a little like living in the mind of Zen monk strung out on drugs. Whatever, whoever Nog is, I'm not sure that he's human. If a human being is one step removed from reality-having to interpret the physical world through the senses and through the mind-then Nog is about four or five steps removed. Impressions from the world come in, bounce around inside his cavernous mind and finally end up distorted beyond recognition, which is where the fun begins.Nog strives to maintain a maximum of three memories, considers facts subjective, and will not, under any circumstances, give out information. But don't get him started on the octopus...&quot;He kept complaining about a yellow light that had been streaming out of his chest from a spot the size of a half dollar. We drank and talked about the spot and the small burning sensation it gave him early in the morning and about his octopus. He had become disillusioned about traveling with the octopus and had begun having aggressive dreams about it. He wanted to sell it.&quot;Rudolph Wurlitzer's style is reminiscent of other writers of the era-Hunter S. Thompson, William S. Burroughs, et cetera-and the novel's genre is the good old American \"yarn.\" As with Mark Twain, Wurlitzer just wants to keep pulling your leg as long as you'll let him. This sort of thing is difficult to sustain outside the confines of a short story, however-and, like some of Twain's novels, \"Nog\" does lose a bit of its steam somewhere. The opening of the book is absolutely priceless, but soon Wurlitzer must do something to up the ante in his narrative con game. This, unfortunately, means falling back on an listless plot to move Nog around and add fodder to that bizarre imagination. If \"Nog\" never quite surpasses the flair of the opening chapters, Wurlitzer has still achieved a deliciously eccentric style and created one truly unforgettable character.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Combine Donald Barthelme (how about The Dead Father), the more benign elements of William S. Burroughs (oh, let's say, the chapter &quot;Shift Coordinate Points&quot; from Nova Express), throw in a pinch of Alaine Robbe-Grillet (hmmm... maybe Project for a Revolution in New York or Last Year at Marienbad), beat well, simmer over a low psilocybin flame, then serve in a small, locked, pitch dark room, with a only tiny square window high up in the door, set R. D. Laing outside the door to intone &quot;grace&quot; over the whole business, and you've got &quot;Nog&quot; --or something like it. There is no discernible &quot;plot&quot; or &quot;point&quot; to the &quot;story&quot; to speak of, just hallucinatory narration from a seemingly disembodied mind that seems to have woken up in a storage room in some nameless and bizarre house or is trying to wake up from some tripped-out nightmare but can't quite pull it off. There's an octopus, or some concept of an octopus, that creeps in now and then, and &quot;conversations&quot; with faceless and nameless persons beyond the confines of the narrator's (Nog's)&quot;world.&quot; Don't worry: there aren't any &quot;spoilers&quot; in this review.&quot;Nog&quot; starts out intriguing, but then becomes contrived and tiresome after the first 50 pages (luckily, it's a relatively short book)when, hoping against hope, you realize that, indeed, &quot;this isn't going anywhere.&quot; The prose has it's interesting moments, deft turns of phrase here and there, but, ultimately fizzles. Worse yet, it's not even funny. I read this book for the first time, 12 years ago, when I was recuperating from a major bout of the flu. &quot;Nog&quot; made absolutely no sense, but I chalked it up to my fever-addled brain. I tried reading it again, recently, thinking time and a prior read would offer some kind of Rosetta Stone for this puzzle. No dice. In fact, &quot;Nog&quot; was even less understandable.Bottom line: This was an interesting experiment that was in harmony with the &quot;oh wow, it's art!&quot; absurdist sensibilities of the late 60's when it was written. It's really more of a curiosity than any serious effort at literature. Now, if you're a serious student of the psychedelic era, &quot;Nog&quot; deserves a read, if only to take you to the outer boundaries of a literary genre we probably won't see again.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "After being badgered by the Casa Marina Reading Club in the late '70's to read this (resulting in my subsequent slide into Nog-like obscurity), I can state with some experience that this book exerts an influence on its readers. Rumors abound that Wurlitzer was an itinerant goat herder who strived to simplify his life: to date these rumors are unsubstantiated. However, there is evidence that \"Nog\" is an influence in the writings of Thomas Pynchon and Christopher Moore. Chuck Norris has been known to quote significant passages from the book in some of his Westerns and credits the book with his zen-like approach to martial arts. A good read - and a way of life.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "bigger secrets more than 125 things they prayed youd never find out",
        "description": "A compilation of important and banal inside information such as the secret recipe for Oysters Rockefeller and the phone company's own unlisted numbers",
        "authors": "['William Poundstone']",
        "infoLink": "http://books.google.com/books?id=Twr1KAGlgDUC&dq=Bigger+Secrets+~+More+Than+125+Things+They+Prayed+You%27d+Never+Find+Out&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "You probably have not read my review of &quot;Big Secrets&quot;, so you have no idea of my absolute disdain for that work. So the fact that I have pumped my opinion of this one up to four stars probably will not shock you at all.It's obvious that Poundstone has learned since releasing &quot;Big Secrets&quot;. He's learned to tell a better story, learned to create suspense, learned what information is utterly useless dreck and what is genuinely entertaining. Both he and the reader benefit from this a great deal.He's still making wildly speculative guesses about food contents, but here we get a nice tale about how he went about obtaining a sample of Oysters Rockefeller and sent it to a lab. He's still giving away magicians' secrets, but now we are amused by the little backstory he gives his investigation. Overall, this book is better written and is a better read.One complaint I still have is Poundstone's attitude. His tone is snotty throughout the book; he is critical of people who don't know enough to dress for Antoine's restaurant, of Disneyland, of magicians in general. Rather than revel in the fun of discovery and slyly let you in on the joke, he uses his words to puncture secrets and deflate them, like an evil older brother spilling the beans about Santa Claus. If you are a fan of Disneyland's Haunted Mansion, his expose' will seem particularly harsh.&quot;Secrets&quot; is fun and will definitely entertain you. I hope the author continues to learn and grow with each book. If so, I look forward to &quot;Biggest Secrets&quot;",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "&quot;Big Secrets&quot; (and its sequel, &quot;Bigger Secrets&quot;) are wonderful. The thing I like best about them is Poundstone's own honesty--he doesn't keep any secrets of his own. He tells you exactly _how_ he found out what he found out.A Shriner may pledge that if he divulges the secrets of his order, he may incur &quot;the penalty of having my eyeballs pierced to the center with a three-edged blade.&quot; But Poundstone discovered a Masonic supply house (&quot;The Geo. Lauterer Corporation&quot;) that works by mail order and doesn't check ID, ordered a selection of titles, and tells us all of the inside skinny on IAOM and Tubal-Cain.&quot;Big Secrets&quot; tells as much as Poundstone could find out about the secret formula for Coca-Cola and Kentucky Fried Chicken. It tells how the Rorschach test works and how to cheat on it. It tells several methods by which magicians saw a woman in two (you see, one of them is patented, so if you write the patent office and ask for patent #1,458,575...)&quot;Bigger Secrets&quot; is equally good, maybe better. I think my favorite is his description of what the Rosicrucians are really like, but his explanation of how David Copperfield made the Statue of Liberty Vanish and his analysis of backward and &quot;subliminal&quot; messages in records and movies are also excellent.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Bigger Secrets, the best of Poundstone's Secrets trilogy, solves the mysteries behind everything from the ingredients in heavily-guarded recipes tobackwards masking in records. I have read the book again and again, not only to refresh my memory on some of the facts he includes but alsoto enjoy Poundstone's concise and drily witty prose. In short, this book will rock your house(and give you cocktail party chitchat fodder foryears to come)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a musical feast recipes from over 100 of the worlds most famous musical artists",
        "description": "These practical and useful lesson plans promote teaching information and computer skills as an integral part of the middle school curriculum. Emphasizing the vital role shared by media specialists, teachers, and administrators in connecting students to the Information Superhighway, this new edition contains current goals, terminology, learning strategies, and resources that encompass the Information Age.",
        "authors": "['Lucille W. Van Vliet']",
        "infoLink": "https://play.google.com/store/books/details?id=-zyrFAQQwssC&source=gbs_api",
        "review": [
            {
                "review/text": "I received this book as gift from my son and didn't think I'd actually use the recipes - I'm more of a fan of the musicians. Whoe, the recipes are terrific and this is such a phenominal cause to help. Can't wait for another book like this! Peace, rock on, and cook for a cause!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "the greatest book it's colorful, collectors item, great recipes from dolly parton to hootie and the blowfish, healthy or sinful recipes, and the best it has raised over $300,000 for the homeless through sales! thanks amazon for supporting a great cause and book",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "2/24/03 This book(Library of Congress Catalog #95-78322) was purchased in one of the Urban Supermarkets in an agendae of the author to help the homeless via 4 organizations(listed on Pgs 110 &amp; 111)....It begins with a recipe from musical group(A-Z)such as : &quot;Ace of Base&quot;'s Ulf Buddha Eckberg for Chicken in a Clay Pot Served With Roasted Potatoes and Gravy (Pg6) &quot; the Bee Gees&quot;(pg 15)'s of Sunday Morning heaven From Robin Gibb's Kitchen , a &quot;Cher's&quot; Tuna Pasta(Pg 25),a &quot;Tracy Lawrence's&quot; 'Tracy's Arkansas Stes &amp; his Recipe for Hush Puppies(Pg 55),&quot;Jessye Norman's&quot; Quick Dessert Cake (Pg73),&quot;Salt n' Pepa 's&quot; &quot;Jerk Chicken(Pg 86),&quot;Don Was(Was Not)'s&quot; Grilles Noam Chomsky-Style Salmon Steaks with Pacific Rim Glaze &amp; his herb-Roasted Allen Ginsberg Potatoes(Pg102), followed by an Index Pgs 105-108 listings by recipes (bread to vegetables) after &quot;Tammy Wynette's&quot; 24 Hour Salad &amp; her Marie Meier's Cranberry Salad(Pg 104),with one last recipe following the info(pgs 111-112) on the 4 non-profit organizations on Pg 113- &quot; Sawyer Brown's(Band of 5)'s &quot; Open Face Peach Pie&quot;).The book has a few corporate sponsors within its pages and a small bio on author ,president of publisher Global Liaisons,Incorporated ,Ms Wendy Diamond on the inside of the back cover .",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the book of heartland cooking",
        "description": "Applies the author's professional expertise as gleaned from work under such chefs as David Bouley and Shea Gallante to classic Midwestern dishes from her childhood, demonstrating how to best enjoy simple heritage fare that is plentiful, affordable and seasonal.",
        "authors": "['Amy Thielen']",
        "infoLink": "http://books.google.com/books?id=VXeEAAAAQBAJ&dq=The+Book+of+Heartland+Cooking&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This colorful cookbook has photos of the finished dish next to every recipe! The introduction explains where a lot of the recipes are from and also discusses the ingredients. There are many creative tasty recipes in this cookbook for everyone in your family to enjoy. It has unusual recipes such as &quot;Wild Rice Pancakes,&quot; &quot;Sausage Waffles,&quot; &quot;Venison Cabbage Rolls,&quot; &quot;Spicy Venison Chilli,&quot; &quot;Bell Pepper Antipasto,&quot; &quot;Curried Cranberry Chicken&quot; and more! If you like being creative in the kitchen and trying tasty new dishes this is a great cookbook to add to your collection!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have had this book for 10 years. I have used 6 or 7 of the dishes over and over again to the raves of my family and friends. The value of any cookbook is if you use even one of the dishes so often it becomes a part of your life. This book has paid it's way over and over again. Try the Swedish meatballs or the Tosca cake. Tired of regular eggs? Try the baked eggs - easy and tasty!Bob Swan",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "letters of transit reflections on exile and memory",
        "description": "\"Moving, deeply introspective and honest\" (Publishers Weekly) reflections on exile and memory from five award-winning authors. All of the authors in Letters of Transit have written award-winning works on exile, home, and memory, using the written word as a tool for revisiting their old homes or fashioning new ones. Now in paperback are five newly commissioned essays offering moving distillations of their most important thinking on these themes. Andre Aciman traces his migrations and compares his own transience with the uprootedness of many moderns. Eva Hoffman examines the crucial role of language and what happens when your first one is lost. Edward Said defends his conflicting political and cultural allegiances. Novelist Bharati Mukherjee explores her own struggle with assimilation. Finally, Charles Simic remembers his thwarted attempts at \"fitting in\" in America.",
        "authors": "['André Aciman']",
        "infoLink": "http://books.google.nl/books?id=b3LgHAAACAAJ&dq=Letters+of+Transit:+Reflections+on+Exile+and+Memory&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "&quot;Letters of Transit&quot; is a collection of five essays originally presented, in somewhat different form, as lectures sponsored by the New York Public Library from November, 1997, through February, 1998. Andre Aciman, the editor and author of both the Foreward (&quot;Permanent Transients&quot;) and the first of the essays (&quot;Shadow City&quot;), focuses on the theme of being an &quot;exile&quot; (as opposed to being an &quot;expatriate&quot; or a &quot;refugee&quot; or an &quot;emigre&quot;). Aciman suggests, in his Foreward, that &quot;[w]hat makes exile the pernicious thing it is is not really the state of being away, as much as the impossibility of ever not being away.&quot; He goes on to elaborate, in his ensuing essay, that the exile is not just someone &quot;who has lost his home; it is someone who can't find another, who can't think of another.&quot; Aciman, impressionistically explores the way in which living in a new city (New York) can vividly reincarnate the memories of cities in which the exile has lived previously (the &quot;shadow cities&quot; of his title). Aciman's essay is fascinating, perceptive and insightful; it is a wonderful short piece which illustrates why his much-praised memoir, &quot;Out of Egypt&quot;, has become a minor classic of the genre.Similarly, Bharati Mukherjee's essay, &quot;Imagining Homelands&quot;, provides thoughtful elaborations on the nuances and connotations of the words &quot;expatriate&quot;, &quot;exile&quot; and &quot;immigrant&quot;; she draws fine and interesting distinctions among these words and carefully entwines these distinctions with an elaboration of her own life experiences.The strongest essays in this collection, however, are those of Eva Hoffman, Edward Said and Charles Simic. All three of these writers provide classic insights into the experience of &quot;exile, identity, language, and loss&quot; which are worth careful thought and consideration. All three suggest (as does Mukherjee when she describes herself as an &quot;integrationist&quot; and a &quot;mongrelizer&quot;) that the exile can only ultimately be redeemed by rejecting irrational devotion to the narrow and myopic tribalism of nation, ethnicity, religion, and ideology which so often encumbers the exile community; that redemption comes only through freedom, reason and syncretism. Thus, Simic writes, in concluding his essay, &quot;Refugees&quot;, that the poet &quot;is a member of that minority that refuses to be part of any official minority, because a poet knows what it is to belong among those walking in broad daylight, as well as among those hiding behind closed doors.&quot;Hoffman's essay, &quot;The New Nomads&quot;, is clearly the best of this collection. She carefully delineates the universality of the exilic experience, an experience which can be found in the Ur-text of Adam and Eve's exile from the Garden of Eden. She then discusses the way in which exile can magnify the impulse to &quot;memorialize&quot; the past. The result, she suggests, is that exile distorts the vision of the past, tending to make it an idealized &quot;mythic, static realm&quot; which forever impedes the ability to deal with the present (what Hoffman perceptively characterizes as the &quot;rigidity of the exilic posture&quot;). She then provides an interesting discussion of A.B. Yehoshua's provocative essay, &quot;Exile as Neurotic Solution&quot;, wherein he postulated that there were many opportunities for the Jews (prior to the creation of the modern State of Israel) to settle in Palestine more easily than in countries where they had chosen to live, but it was the one location they avoided. In Hoffman's words, &quot;[i]t was as if they were afraid precisely of reaching their promised land and the responsibilities and conflicts involved in turning the mythical Israel into an actual, ordinary home.&quot; The ultimate result of the &quot;memorialization&quot; of the past and the &quot;rigidity of the exilic posture&quot; is that exile communities often cannot function in the locus of the larger society; rather, they conceive of themselves as perpetually &quot;Other&quot;.Edward Said's essay, &quot;No Reconciliation Allowed&quot;, describes the dislocation of the exile in vivid terms: &quot;a Palestinian going to school in Egypt, with an English first name, an American passport, and no certain identity at all.&quot; Thus, he finds himself in a secondary school where only English is permitted to be spoken, even though none of the students is a native speaker of English. While his entire educational experience is Anglocentric in the extreme, he is also trained to understand he is a &quot;Non-European Other&quot;, someone who can never aspire to being British in any true sense of the word. While Said has been criticized recently for allegedly misrepresenting his past, he is quite forthcoming in this essay in acknowledging his admiration for &quot;self-invention&quot;. In some sense, Said's essay and the narrative of his life reflects his theory, specifically the notion that we can (and do) use language instrumentally to construct social realities (in this case the reality of his life).While somewhat uneven, as all collections are, &quot;Letters of Transit&quot; ultimately provides a rich, varied and deeply insightful range of readings on what it means to be an exile.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "This is a great book for those who want to be able to place Exile, Identity, Language and Loss in some kind of coherent context. It allows the reader to be able to understand his/her own behavior and the behaviors of those around them. It can also be applied to novels written in the various genres that deal with immigration and exile--to understand the motivation of the authors regarding plot and character development.There is not, however, based on just one perspective. We read five different authors' point of view and their personal experiences, which allows for a range of inquiries.I highly recommend this book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a very important book from 5 writers who have suffered the unease that comes from being \"neither fish nor fowl\", something I've always felt as a Jew, but never related to other immigrants, expatriates, or those in exile. This book also draws in writers and their craft, the work that comes out of \"homesickness\", the instinct to \"memorialize in prose\". I read this book in a light trance, feeling if but for a moment as if I lived somewhere. Anyone looking for where they come from or even where they got to should read this book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the heaven makers a del rey book",
        "description": "Kelexel, an immortal alien, journeys to Earth to make sure his colleagues have not been interfering with that planet's affairs",
        "authors": "['Frank Herbert']",
        "infoLink": "http://books.google.com/books?id=78o_PgAACAAJ&dq=The+heaven+makers+(A+Del+Rey+book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The feel to &quot;Heaven makers&quot; is similar to that of &quot;Godmakers&quot; and &quot;Whipping Star&quot;. Herbert again manages to bring to life a complete future world. In true Herbert fashion, he continues to surprise and fascinate as you try to get your mind around his wonderful, amazing ideas. The Chem are an immortal species, whose greatest fear is boredom. The story focuses on one of their ways to amuse themselves by &quot;experiencing stories&quot;, a sf- version of watching movies. Only these stories are the real lives of people, who are being manipulated by the Chem to provide a good &quot;movie&quot;. One of the countless people manipulated in this fashion are humans on Earth... As the story unfolds around these main ingredients, Herbert manages to put forward some fascinating, mindboggling views on life, deah and immortality, as well as creating a great deal of suspense. If you like Herbert, you will like this book the same way you liked his others, although still nothing tops &quot;Dune&quot;. If you don't know Hebert, here's an excellent way of making your acquaintance.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Frank Herbert produced a number of pot boilers, such as the &quot;Whipping Star&quot; series, before creating &quot;Dune&quot; which, excluding some of its sequels, must rank as the definitive alterntaive future history with a unique depth of characterisation and &quot;world building&quot;. This book has a couple of gimmicks to it, some salacious imagery, but the metaphysical value of it all escapes this reviewer (apologies to our Dutch contributor). There is a good point about the comparative difference between human/organic potentials and closed, mechanistic systems, but that isn't enough to sustain the read. Read &quot;Dune&quot; or &quot;Dragon under the Sea&quot; (a.k.a &quot;Under Pressure&quot;) for better Frank Herbert.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "thin he was and filthyhaired",
        "description": "Robert Llewellyn is now an actor and alternative comedian and plays Kryten in Red Dwarf. This is an account of one year in his adolescence, in the early 70s when he was 16-17. He left a solid middle-class home in Witney to live an alternative life in squats in the middle of Oxford: a life of drugs, pre-aids sex and naive political fantasies.",
        "authors": "['Robert Llewellyn']",
        "infoLink": "http://books.google.nl/books?id=qJtTAAAACAAJ&dq=Thin+He+Was+and+Filthy-Haired&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Bobbie, I am extremely annoyed that a middle-class bastard such as yourself should write a book this good, which is why I am trying to reduce your average star rating. And subtitling it Memoirs of a Bad Boy? Everyone knows I'm the bad boy of the Red Dwarf cast and you're just an overprivileged middle-class whiner. Everyone: read my books instead! They're honestly quite good!",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "For fans of Red Dwarf or Junkyard Wars, the early years of Robert Llewellyn's life will leave some wondering &quot;How did he ever wind up as an actor?&quot;, and for others it will all make sense. This wonderfully written auto-biography invites us into the '70's world of sexual self-awareness, upper-class prejudices, free-spirited hippies, silver polishing, party crashing, toast, weed, and geodesic domes.Mr. Llewellyn manages to keep the reader trans-fixed from beginning to end. His &quot;tell it as it is&quot; writing mixed with copious amounts of humour makes for some embarrassing moments if you're reading this in public places.I highly recommend this book for true Llewellyn fans. It's a very revealing look into his youth and his background. From cartoonist to convict, from visionary to drag queen. You'll laugh, you'll cry, you'll laugh some more, but all through-out the book you'll never stop wondering &quot;this guy is Kryten?!&quot;&quot;Thin He Was and Filthy-Haired&quot;, &quot;Man in the Rubber Mask&quot;, &quot;Man on Platform 5&quot;, &quot;Punchbag&quot;, and &quot;Sudden Wealth&quot;. An impressive collection of truly wonderful works.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I love Mr Llewellyns books. &quot;Rubber mask&quot;, &quot;Punchbag&quot;, &quot;Platform 5&quot;- they are all first rate. I finished reading &quot;Thin he was...&quot; his teenage autobiography last night and I have to say its my favourite so far. The title is derived rather arcanely from a quote about aliens- &quot;Dark they were and golden eyed&quot;.The novel tells the story of Rob(the cartoonist) who in his teens went ever so slightly off the rails. He lives in a geodist dome, smokes weed and crashes Oxford balls in drag. A fantasy writer called Duncan finds Robs rebellious behavoiur extremely rich and makes a pass at him. Young Rob is flattered, but his hormones are too much raging for attractive females. He is also desparetly seeking a direction in life. His romantic and anarchic ideals seem to have no place in &quot;The System&quot;.Unlike anything else Llewellyn has written, this storys innocence goes straight to the soul. He perfectly captures the sights and sounds of the time and his characterisation is utterly charming. At one point he mentions having never read &quot;Catcher in the rye&quot;. This is interesting because his book has a similar engaging narritive with the wild excitment of &quot;On the road&quot;.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the book of spanish cooking",
        "description": "One of our foremost authorities on Mediterranean, North African, and Italian cooking, Claudia Roden brings her incomparable authenticity, vision, and immense knowledge to bear in The Food of Spain. The James Beard Award-winning author of the classic cookbooks A Book of Middle Eastern Food and A Book of Jewish Food now graces food lovers with the definitive cookbook on the Spanish cuisine, illustrated with dozens of gorgeous full-color photographs that capture the color and essence of this wonderfully vibrant nation and its diverse people, traditions, and culture.",
        "authors": "['Claudia Roden']",
        "infoLink": "https://play.google.com/store/books/details?id=mrWzCUFxchcC&source=gbs_api",
        "review": [
            {
                "review/text": "This book has easy to follow directions, pictures which show the process step by step, and contains ingredients readily available in the United States.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "Great collection of tasty recipes with photos for every recipe! The introduction explains spanish food customs &amp; ingredients. Lots of vegetarian recipes like &quot;Rice with Chickpeas,&quot; &quot;Fideua,&quot; &quot;Bell Pepper &amp; Onion Tart,&quot; &quot;Potatoes with garlic sauce,&quot; &quot;White soup with grapes&quot; and &quot;Gazpacho.&quot;Of course there are still lots of meat recipes such as &quot;Quail with Grapes,&quot; &quot;Duck with Pears,&quot; &quot;Lamb Chilindron,&quot; &quot;Shrimp stuffed Eggs,&quot; &quot;Empanada&quot; and more. It's worth adding to your cookbook collection!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the gifted adult a revolutionary guide for liberating everyday geniustm",
        "description": "Are you relentlessly curious and creative, always willing to rock the boat in order to get things done . . . extremely energetic and focused, yet constantly switching gears . . . intensely sensitive, able to intuit subtly charged situations and decipher others' feeling? If these traits sound familiar, then you may be an Everyday Genius--an ordinary person of unusual vision who breaks the mold and isn't afraid to push progress forward. . . . As thought-provoking as Daniel Goleman's Emotional Intelligence, psychologist Mary-Elaine Jacobsen's Gifted Adults draws on a wide range of groundbreaking research and her own clinical experience to show America's twenty million gifted adults how to identify and free their extraordinary potential. Gifted Adults presents the first practical tool for rating your Evolutionary Intelligence Quotient through an in-depth personality-type profile. Demystifying what it means to be a gifted adult, this book offers practical guidance for eliminating self-sabotage and underachievement, helping Everyday Geniuses and those who know, love, and work with them to understand and support the exceptional gifts inherent in these unique personality traits.",
        "authors": "['Mary-Elaine Jacobsen']",
        "infoLink": "https://play.google.com/store/books/details?id=GDDqBQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "&quot;The Gifted Adult&quot; is an excellent book, and provides one of a few lone voices drawing attention to &quot;A Group Society Would Rather Pretend Doesn't Exist:&quot; The Gifted Adult.Adult Giftedness is one of the &quot;Ugly Stepchildren&quot; in the field of Psychology. Whereas researchers, psychologists and society in general go to great lengths to study, understand and help those who dwell a long way below the mean intellect, those living their lives an equal distance the opposite side of the mean often find themselves living in a void of confusion, misunderstanding-- and misinformation. Their lives are perhaps complicated by a &quot;split personality&quot; support system that provides tools and special programs to gifted children, but then vanishes into thin air once the gifted individual is deemed &quot;Adult&quot;-- in some cases providing an abrupt perception change from giftedness as having positive &quot;value&quot; to suddenly being a reason for discrimination and sneers.Gifted Adults are &quot;statistical outliers.&quot; As such, they often have special issues, living in a world whose actions are centered around accommodating the &quot;norm.&quot; At best, a Gifted Adult seeking to have his/her needs understood, may hear the words &quot;Well, we're ALL gifted, in our own special way.&quot; At worst (and more frequently) they will hear &quot;How can you have problems, if you're so smart?&quot;-- words that reflect a popular view that giftedness is a &quot;privilege&quot; that exempts a person from having any difficulties in life. Yet, Gifted Adults discover that working harder, seeking answers, seeing therapists and trying to contribute often leaves them with a sense of &quot;emptiness&quot; and lack of fulfillment.Mary-Elaine Jacobsen's book is a much-needed tool to help gifted adults understand themselves, and accept the fact that their brains work a little bit differently. Real differences, I might add, that change the way a gifted person views their interactions with the world, their road to self-actualization, or considerations for seeking therapy.In Part I of the book, Jacobsen starts to define her own view of giftedness, and addresses some of the Societal Myths (Giftedness = High IQ), and influences (Gifted adults' tendency to deny their giftedness) established by conventional thinking.In Part II, she presents her alternative theory for measuring giftedness-- a broad system she has named &quot;Evolutionary Intelligence&quot; (or EvIQ). Although Jacobsen &quot;borrows&quot; heavily from the &quot;Multiple Intelligences&quot; theory originally set forth by Howard Gardner at Harvard, she adds a number of new facets, presented in a 240-item &quot;self quiz&quot; in Chapter 7 of the book. Unlike &quot;standard&quot; IQ tests, this is NOT a timed exercise with &quot;right&quot; and &quot;wrong&quot; answers, but rather a self-evaluation. Of course, honest self-scrutiny is central to obtaining a &quot;valid&quot; result-- which may present difficulty for some.Part III explores most of the common &quot;misunderstandings&quot; gifted adults encounter in their interactions with daily life. Topics include &quot;self mis-diagnoses;&quot; the issues associated with &quot;Failing to Fit In;&quot; rewriting personal history and past events through understanding &quot;common criticisms&quot; often heard by gifted adults (&quot;Can't you just stick with ONE thing?&quot; &quot;Where do you get those wild ideas?&quot; &quot;Can't you just slow down?&quot;); the &quot;False Self&quot; and dumbing yourself down; as well as the &quot;Impostor Syndrome&quot; gifted adults often experience.Parts IV and V offer a series of tools and possible solutions to help gifted adults reorient their energies in an effort to create lives that let them be &quot;true to themselves&quot;-- while still fitting into the &quot;normalcy&quot; of their surroundings. In part IV, Jacobsen explores both career issues and personal relationships, however, I found this section to be a bit general and &quot;pep-talkish.&quot; The final section deals with summarizing and then applying the lessons learned in the book.Observations: My general inclination is to say &quot; Buy this book! Buy it NOW! Read it! Learn!&quot;However, the potential reader should understand just what the book will do for them. &quot;The Gifted Adult&quot; (Formerly published under the name &quot;Liberating Everyday Genius&quot;-- the name change is a GOOD idea!) is long on presenting Jacobsen's theory of Evolutionary Intelligence, and long on providing self-understanding for the gifted adult-- but somewhat short as a &quot;How-To&quot; guidebook on how to live life. If you're looking for &quot;connect A to B&quot; solutions, you'll find only a limited number here.The author is also quite &quot;liberal&quot; with her use of the designation &quot;gifted.&quot; Normally, the term is used to describe approximately 2% of the population. Jacobsen's definition may include as many as 10%-- and whether this is merely a technique to sell more books, or a figure backed by scientific research, I do not know. It doesn't detract materially from the value of the information presented-- but at times the writing does become a little bit &quot;fluffy&quot; and lacking in focus.Some personal thoughts (Caveats): Society is engaged in a long-term love affair with the idea of &quot;pathologizing&quot; any behavior not tightly clustered around a narrow definition of &quot;Normal.&quot; Incorrectly diagnosing and medicating giftedness as ADHD or Bipolar Disorder responds to a popular need for &quot;A Quick And Easy Fix.&quot; If AT ALL possible, we want a &quot;magic pill&quot; rather than &quot;hard work.&quot; And whereas disorders certainly DO occur, Adult Giftedness-- and the psychological makeup specific to it-- is NOT a pathology.Overall rating: Outstanding (9.5 bookmarks out of a possible 10), not only for the gifted adult and anyone living with a gifted adult, but the book also should be required reading for any psychologist/therapist who's been asked if they are &quot;familiar with the psychology of Adult Giftedness.&quot;",
                "review/helpfulness": "119/121",
                "num_reviews": 121
            },
            {
                "review/text": "This is a review of the book \"Liberating Everday Genius\" by Jacobsen; I'm not sure if this book is the same under another name or if this new book offers more than the older version previously published.I read this book in hopes that it would actually teach me how to liberate my creativity and intelligence. Unfortunately, most of what it offers is mere information and theory regarding what \"everyday genius\" is and how to tell if you are one using a rather generic \"test.\" It then goes on to dispel myths and stereotypes that most \"geniuses\" seem to experience. I know that I found a lot of myself in this book although I'm not sure I'd call myself a genius. Perhaps I overestimate what the term really means, thus fitting in to the descriptions she gives of how society pushes down anyone who thinks differently than the majority. Sadly, none of my big questions were answered such as, \"how do I overcome this programming?\" I am just as confused and feel just as alone as I did prior to reading the book, so I can't say it has been any help to me except to point out that maybe there are others out there like me. What's the point if I still feel too lost to find them and to express my \"true\" self? Much of the material is repetitive in that she presents the same ideas and concepts over and over again. I assume she's trying to drill it into the head of the reader, but perhaps it's just book filler. I think she could have compacted the material into a book half the original size, thus lowering the price in the process. If you buy it, expect to be reading a Tony Robbins type self-esteem booster...do not expect to find real answers.",
                "review/helpfulness": "56/62",
                "num_reviews": 62
            },
            {
                "review/text": "In general, I found this book very enlightening. I differ in one respect from most of the &quot;everyday geniuses&quot; the author describes: early in life I was identified as having a high IQ. But my parents and teachers suffered from the misconception that this was an isolated trait and, in all other respects, I was a completely normal child. It was fine with them that I learned quickly, but the qualities that they found less agreeable (my determination, enthusiasm, sensitivity, and immensely wide variety of interests) were redefined as negatives: I was &quot;stubborn,&quot; &quot;unfocused,&quot; &quot;hasty,&quot; &quot;too emotional,&quot; and so on. Plus the ideals that I was supposed to achieve -- get straight A's in school, be quiet and well-behaved, specify a career goal and pursue it -- didn't appeal to me in the least; I didn't want an ordinary life, I wanted an extraordinary one. But I grew up believing that, by refusing to squeeze myself into the slots that society provided, I was &quot;failing to live up to my potential.&quot;It wasn't until recently that I learned that there's more to giftedness than a high IQ or a talent in a particular area. Palladino's &quot;Dreamers, Discoverers, and Dynamos,&quot; Gardner's work on &quot;multiple intelligences,&quot; and many other books point out that the gifted child's mind actually works differently: intensity, drive, and sensitivity are all part of the package (which Palladino characterizes as &quot;divergent thinking&quot;). But the dividing line between genius and ADD is a blurry one, and our educational system's emphasis on normality and conformity often leads to defining any &quot;divergence&quot; as pathological or, at best, as misbehavior.This book is a great antidote to such thinking. The author gives a self-test that enables the &quot;everyday genius&quot; to identify his/her strengths and personality traits, and I found the results interesting. Also very helpful are the lengthy sections on redefining your supposed negatives as positives: you're not someone who needs to &quot;slow down&quot;; doing things quickly is normal for you. I was greatly reassured to discover that my burning desire to &quot;make a difference in the world&quot; didn't stem from arrogance (which more than one teacher had scolded me for), but was, rather, a typical part of the high-EvI package. Although I don't agree with all of the author's suggestions in the &quot;self-help&quot; chapters, I think she's making an important point: the &quot;everyday genius&quot; can live and work effectively in the world not by suppressing his/her strengths, but by practicing self-discipline to use these strengths in the service of a higher goal. Given the scarcity of books written specifically for gifted adults (rather than children), this book fills a great need, and does it well.I have only one quibble with the book, but it caused me to rate it with four stars rather than five. The author says things like &quot;studies have shown ...&quot;, but she almost never gives the references for these studies; the footnotes to the chapters rarely mention research at all. I realize that she's writing a &quot;popular&quot; book rather than a scholarly work, and that many of her conclusions are based on her experience with her clients rather than on scientific research. But I feel it would give her conclusions far more credibility if she backed them up with harder data.",
                "review/helpfulness": "53/54",
                "num_reviews": 54
            },
            {
                "review/text": "I checked this book out of the public library in hopes of gaining some insight into the many kinds of difficulties an adult faces upon learning of his/her giftedness. Instead, this book was full of Oprah-like perky advice, sprinkled liberally with sleep-inducing anecdotes about \"Heather\" and \"James\" et cetera.The author does not have the gifted reader in mind with this book. It is overstuffed with fluff and not enough substance. I have yet to find a book on gifted adults that speaks to us at our own level of intellect and cogently outlines issues and strategies that we face with our unique brains.",
                "review/helpfulness": "26/40",
                "num_reviews": 40
            },
            {
                "review/text": "Throughout most of my 50 years of life, I have felt out of place. Like an alien being dropped upon this earth, I use a different vocabulary, have unusual bursts of energy, have a mind that travels at light speed, am highly reactive to external stimulus, and even sleep in a different pattern than most people. The labels given me are endless: too emotional, over-reacting, moody, anxiety disorder... even bipolar with hysterical mania, but without depression (the newest and my favorite!).This book gave me great peace. I understand myself better now. With an IQ of 150 and a life-long creative (writer and artist), I am normal for me... and, there are others like me out there!Those who are not &quot;gifted,&quot; do not comprehend the lonliness or the anguish experienced by this misunderstood minority. I invite everyone to read this book, to gain insight into themselves, into loved ones, and/or into the world of the gifted.Let us celebrate who we are, and the contributions we can give to society.",
                "review/helpfulness": "28/30",
                "num_reviews": 30
            },
            {
                "review/text": "Mary-Elaine Jacobsen brings the largely invisible plights and possibilities of the gifted adult to our attention. As an intense, complex and driven gifted adult, myself, I truly appreciate her contribution to my life and the lives of others I know who've read the book. As a therapist to gifted adults for many years, Jacobsen knows what she's talking about and gives us many moving stories to find ourselves, our friends or our parents in. I cried many tears reading this book, remembering experiences in my own life and seeing them in a more self-compassionate light.I've known I was smart, intense and driven but Jacobsen helped me to see why and what to do about it to have a happier, more fulfilled life. I'm probably writing this review right now because of the influence of this book. I've always craved to get my ideas out in the world and here on the Net and in my blog (tokerud's technology treats) I've sought out ways to do that. Jacobsen gives the gifted adult the good news and the bad news. The good news is great. I can forgive myself. The bad news is, that the only way things are going to change is for me to change some bad habits and be constructive and persistent in the world and express my gifts. If you know you are intense and driven and probably pretty smart, pick this book up. It could change YOUR life too.This book is a well-written but occasionally dense read. However, it will be a page-turner for a gifted adult. And, for that matter, gifted adults tend to like dense books. One of the unfortunate facts that Jacobsen points out is that gifted adults have usually learned to keep a low profile about their giftedness. They've learned to cover it up and at a certain point in their lives, many gifted adults forget they are gifted. It is a convenient but, ultimately, very harmful defense mechanism. That's why I said earlier that if you merely suspect you might possibly be a gifted adult, read this book! It will shake you out of your unconsciousness and get you back on the track of getting your gifts out into the world where they belong!",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "I had to laugh at the editorial review, which accuses Dr. Jacobsen of being \"elitist,\" one of the many criticisms that gifted people receive. Maybe that reviewer should have read the book more carefully. This is a terrific book that will help people realize their potential. That's a good thing for the world and should not be discouraged or belittled.If you have struggled with fitting in only to feel like you cannot be your authentic self, this book will help you discover why. I also recommend \"Dark Side of the Light Chasers\" and other books by Debbie Ford to help you discover the damage done by all those messages to play small, and begin to heal, giving yourself permission to be BIG.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "I give this book three stars because everything the author says is right on the money. I did not give it 5 stars because the book is repetitious and the language rambling. I was really looking forward to reading this book, but I had trouble finishing it. I would have liked less preaching about liberating yourself and more insights on how to do it from examples of people who have done it. There are examples, but not as many as I would have liked, and not described in enough depth.I gained more insights from &quot;Gifted Grownups&quot; by Marylou Kelly Streznewski. Her section about the physiology of giftedness, in particular, covered material I have not seen anywhere else.In the end, how much you enjoy this book will depend much on how comfortable you are with your giftedness. If you have not become comfortable with being &quot;different&quot;, you will probably value this book. If you are comfortable with the real gifted you, this is probably not the book for you.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "For someone who's gifted, Jacobsen's book can bring a sigh of relief and recognition. &quot;I'm not an ugly duckling after all! I was meant to be a swan.&quot;While some reviewers criticize this book as &quot;elitist,&quot; I find the opposite. Jacobsen doesn't suggest that anyone be exempt from social norms or rules. To the contrary, she shows that the gifted may face a tougher challenge than the less-gifted: they must learn to accommodate to a society as an invisible often-resented minority group. It's up to each gifted person -- hopefully aided by mentors who can take advantage of &quot;teaching moments&quot; -- to learn to swim. That means adjusting a blunt style of speaking, communicating in a new style and, always, dealing with the loneliness of being &quot;different.&quot; Gifted people tend to attract envy, not empathy, and they don't always grow into rich and successful adults. Indeed, without recognition early in life, the gifted can become severely depressed, mainly due to isolation.Once you read this book, it's easy to recognize evidence of giftedness in yourself and others, including autobiographical accounts. A combination of characteristics -- sensitivity, high-speed, high-energy -- can appear frustrating to those who don't realize what's going on. Many gifted children get diagnosed as hyperactive, depressed, socially inept and worse.I'm not overfond of pencil-and-paper tests, but Jacobsen offers ways to identify specific areas of giftedness through some simple questions. Readers can ignore this part if they choose.Counselors, career coaches, therapists, managers, guidance professionals -- all should have this book on their shelves. When they find themselves getting overwhelmed by a gifted client, they need to know what's going on.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "In a way this book scares me because if I had read this book before I read &quot;Driven to Distraction&quot; by Edward Hallowell, MD and John Ratey, MD (on Attention/Deficit/Hyperactivity/Disorder or ADHD), I would have done a true disservice to my family, especially my very gifted (and very hyperactive daughter) by believing she was just gifted. As it was, in reading this book, I found that the descriptions of the author's &quot;gifted&quot; patients could just as well have been used by the authors of &quot;Distraction&quot; to describe their patients. Additionally, the author's descriptions of the traits of &quot;gifted&quot; adults are essentially the same as those that could be used to describe the very smart hyperactive impulsive individual with ADHD. Only in this book, those same traits are given a positive spin. For example, when her &quot;gifted&quot; adults get into trouble by saying whatever is on their mind (i.e., not editing anything before it comes out), they aren't being impulsive, they are just being &quot;truthful&quot; in a way others don't want to hear. And when their impulsivity leads them to be impatient with others, it is just that everyone else in the world is too slow. All of that being said, the author's specific suggestions for dealing with those traits are helpful. We just need to do more to understand the neuro-chemistry of thing called ADHD or the neuro-chemistry of being &quot;gifted&quot; (a subject there appears to be zero research on, no doubt because &quot;gifted&quot; is terminology developed in the educational field and not the medical field). If the traits the author describes as &quot;gifted&quot; are really just the way those highly intelligent people act when there is a dopamine dis-regulation in their brains (the problem with ADHD), we need to look at this. As the other reviewer said, it is all a matter of which part of the elephant one is looking at -- the author is looking at one part and the ADHD researchers are looking at another. Meanwhile, those labeled &quot;ADHD&quot; are disserved by notions that their traits are all negative and those that are labeled &quot;gifted&quot; are disserved by not understanding the entire picture -- and the possible positive effects of ADHD treatment.",
                "review/helpfulness": "14/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "60 greatest science fiction shows selected by ray bradbury",
        "description": "Provides alphabetically-arranged, biographical entries of favorite contemporary writers of fiction, including Maeve Binchy, Michael Crichton, and Anne Rice, and presents insights on the creative process from each individual.",
        "authors": "['Bernard Alger Drew']",
        "infoLink": "http://books.google.com/books?id=K3IfAQAAIAAJ&dq=60+Greatest+Science+Fiction+Shows+Selected+By+Ray+Bradbury&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "H.G. Wells, Jules Verne, Robert Heinlein, Isaac Asimov, Fredric Brown, Fletcher Pratt, Phillip K. Dick, William Tenn, Murray Leinster, Robert Sheckley, Frederik Pohl, Gordon R. Dickson, Theodore Sturgeon, James Blish, H. Beam Piper, Kurt Vonnegut, Robert Sheckley, and Ray Bradbury. A veritable pantheon of great science fiction authors.&quot;The War of the Worlds,&quot; &quot;The Martian Chronicles,&quot; &quot;Donovan's Brain,&quot; &quot;Earth Abides,&quot; &quot;Nightfall,&quot; &quot;20,000 Leagues under the Sea,&quot; &quot;The Roads Must Roll,&quot; &quot;Knock,&quot; &quot;Frankenstein,&quot; &quot;Lulungameena&quot; (a Dorsai story), &quot;Dream of Armageddon,&quot; and &quot;The Country of the Blind.&quot; A library of science fiction classics.Excellent stories, excellent authors, well done plays. One of the selling points for science fiction back in the 50's was its &quot;predictive&quot; aspect. Today's fiction was touted as tomorrow's fact. I loved scifi as a kid, but on listening to the plays, I was somewhat amused at how badly most of the shows got the future wrong. Some of the &quot;future&quot; dates from many of the stories have come and gone without the fabulous scientific achievements presented in the stories. Two stories stand out as highly predictive, however.&quot;A Logic Named Joe&quot; was a comedy, but it predicted not only the internet, but also two of the internet's greatest problems: loss of privacy and unrestricted access to sensitive information. &quot;The Roads Must Roll&quot; missed badly when it predicted that mass transportation in the USA would be on gigantic conveyor belts, but it also predicted the great mischief that a handful of political zealots could wreak when they commandeered a portion of that mass transport system.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I've recently gotten into old-time radio broadcasts and this one is my favorite. It really is the &quot;Theater of Imagination.&quot; The writing is superb and suspenseful on these shows. I can't wait to introduce my son to these broadcasts.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the role of thunder in finnegans wake",
        "description": "The study establishes the nature and aims of Finnegans Wake as Menippean satire and interprets the Wake in that light. McLuhan examines Joyce's use of language, and in particular his use of ten hundred-lettered words (thunderclaps).",
        "authors": "['Eric McLuhan']",
        "infoLink": "http://books.google.com/books?id=Q3dyExo_y7AC&dq=The+Role+of+Thunder+in+Finnegans+Wake&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The bibliography alone is worth the price. Prof. McLuhan describes the Menippean tradition beginning with Lucian and traces a continuous line to Joyce. He describes the breakdown of the Greek Logos into the Trivium, and how the ratio between Grammar, Rhetoric, and Dialectic (and the culture itself) changes under the influence of technology. He shows how Joyce uses the thunders as rhetorical gestures enacting the transformation of culture by technological metaphor using textual context and multilingual etymology. Sounds horribly stiff, perhaps; its really much more fun (and much freer) than most over-conceptualized scholarship.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Yes I said yes. (Now and then I realize how esoteric my books about Joyce and &quot;Finnegans Wake&quot; are.) Anyway, Marshall McLuhan's kid Eric dove headlong into the Frey oops fray and came up with a winner. &quot;FW&quot; takes place on a Thursday, as does &quot;Ulysses.&quot; And Feb. 2, 1882, was a Thor's Day too. Oh my gosh...how does one write a review of this book. I guess it's for Joyce fans, or those who have read &quot;Finnegans Wake&quot; more than once. To me, reading &quot;about&quot; the Wake is as fun as reading the Wake. &quot;Oh; THAT'S what that means!!&quot; Let's face it, we all need a lot of help. If you've seen the paperback &quot;War and Peace in the Global Village&quot;---where, I think, the page called &quot;What the thunders said...&quot; is found---you'll have a headstart. Enough! or too much. Thanks, Eric McLuhan.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book make FW a bit less obscure. First he narrows his focus to the ten 100-letter Thunderwords in FW and shows that, like DNA in a chromosome, each Thunder contains all the themes of its section in microcosm. (find the Joseph Campbell on Finnegans Wake video and hear him read the first thunderword for the full effect) Second, he fits FW in the genre of Minippean satire, so its disorderly mess has a bit of company on the bookshelf. Hey, &quot;Every artist creates his own precursors&quot;, Borges wrote. When I went to school, it was Horatian and Juvenalian, nice and nasty, Garison Keillor vs Howard Stern. Well, now there's room for Tristram Shandy and Frank Zappa, too. A good entree to the subject.trivia: The author's dad was the guy Alvy Singer produced to silence the movieline bore in Annie Hall.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the new book of rock lists",
        "description": "Gathers unusual and little-known facts about rock and roll performers, groups, recordings, and history",
        "authors": "['Dave Marsh', 'James Bernard']",
        "infoLink": "http://books.google.nl/books?id=_dEddefiYx0C&dq=The+New+Book+of+Rock+Lists&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Looking forward to fun book along the lines of THE BOOK OF LISTS, I instead found myself assaulted by an opinionated trashing of a number of performers, a fawning over P-Funk that takes up three pages, (yes, a great band but George Clinton's names for himself as a list, PLEASE!)This book is far too involved with personal attacks to be interesting. I finished based on the idea that I wanted to see who was going to fall victim to the &quot;critical axe&quot; and at the end found this less than rewarding. Even factual errors like song titles (Zevon's &quot;Carmelita&quot; as Carmelita's Way&quot; or Thin Lizzy's &quot;Jailbreak&quot; as &quot;There's gonna be a Jailbreak&quot; were distracting. There is also whole chapters dedicated to rap which is interesting concept in this book of Rock lists. I read this type of book for snippets of info and a few laughs but I just found myself annoyed at the end.",
                "review/helpfulness": "14/22",
                "num_reviews": 22
            },
            {
                "review/text": "....one that is marred by strident retro-male leftism (I don't know if it comes from Marsh or Bernard) I mean, I agree that Clinton's no better than Bush, but I find it funny that Marsh and Bernard refer to Al Gore as &quot;liberal&quot; (he himself openly admits he's not) in the contemptous way many leftists use the term, while many feminists might find THEM to be &quot;liberals&quot; in the same negative sense for defending the Rolling Stones as the &quot;first victims of political correctness&quot; Having said that, I still like the book. The best parts are when they display a sense of humor. Example: in response to a religious-right rock-hater's charge that a song by the Cars has Satanic &quot;backwards-masking,&quot; Marsh and Bernard reply: &quot;Well, now we know how he (Cars frontperson Ric Ocasek) got (80's supermodel) Paulina.&quot;",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have owned two previous editions of &quot;The Book of Rock Lists&quot; and will soon be buying &quot;The New Book of Rock Lists&quot;. Why? Because it's fun to read, witty, and incisive! The rock and roll heaven portion, where various deceased rock stars are broken down in terms of how they died, is definitely worth reading.One or two others have already castigated author Dave Marsh for having somewhat of a left leaning bias in his stinging criticism of the PMRC and certain religious zealots, as well as his categorization of famous right wing rockers. I disagree with the reviewer who referred to Marsh as being &quot;PC&quot;. However, if you turn your political filter off and you're not thin-skinned, you'll have some fun reading.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the low fat indian vegetarian cookbook",
        "description": "A massive collection of tasty, low-fat recipes for vegetarians and vegans, from appetizers to desserts. This edition of 1,001 Low-Fat Vegetarian Recipes is completely revised to reflect current food trends and styles of cooking. Catering to the needs of today's busy cooks, from committed vegetarians to \"flexitarians\" to those simply looking for inventive ideas for peak-of-season produce, the recipes are easier and faster to prepare, with fewer ingredients and more concise cooking methods. The recipes, which all adhere to American Heart Association guidelines, emphasize \"super foods\" -foods that boast high nutritional, antioxidant, and phytochemical qualities-including blueberries, pomegranate juice, edamame, leafy dark greens, beans and legumes, nuts, seeds, whole grains, and soy. Included are recipes from every category, from appetizers through desserts, with more than 500 entrees, offering a superb assortment of satisfying meals that are low in fat and rich in flavor. Each recipe is labeled with an identifying icon for vegan, lacto-vegetarian, ovo-vegetarian, and lacto-ovo-vegetarian. Nutritional data and diabetic exchanges are provided for each recipe.",
        "authors": "['Linda R. Yoakam']",
        "infoLink": "https://play.google.com/store/books/details?id=UfaSJlGMN9sC&source=gbs_api",
        "review": [
            {
                "review/text": "Mridula Baljekar's THE LOW-FAT INDIAN VEGETARIAN COOKBOOK isn't quite what I expected -- \"low fat\" cookbooks, in my experience, tend to eschew deep frying and ingredients such as butter, to offer alternative cooking methods that still capture the flavor of full-fat recipes, and to list the nutritional information for each dish. This one does none of these. Baljekar's idea of low fat is to suggest using half & half in place of full-fat cream. The \"High Days and Holidays\" chapter, filled with fritters, batter-fried vegetables, and eggs, has a disclaimer that the recipes therein should \"be regarded as occasional treats by anyone following a low-fat diet.\" A helpful warning to be sure, but I spent my money on what I thought was \"the\" low-fat recipe collection.American cooks -- at least those who do not live in big towns with specialty grocery stores -- may be frustrated by the lack of suggestions for replacing hard-to-find items like creme fraiche. I am also disappointed by the lack of Indian names for standard dishes, either on the recipe titles or in the index. Nonetheless, the recipes in THE LOW-FAT INDIAN VEGETARIAN COOKBOOK are fairly simple to prepare and tasty. While I would not recommend the book to those who are just beginning their foray into Indian cookery and want to know more about its traditions, or to those who are trying to count calories while they liven up their menus, it is a nice supplement to other Indian cookbooks.The table of contents:1. Starters and Appetizers pgs. 1-132. Salads and Chutneys pgs. 14-413. Soups pgs. 42-474. Protein Dishes pgs. 48-785. The Bread Basket pgs. 79-956. The Rice Bowl pgs. 96-1227. The Vegetable Basket pgs. 123-1698. Cooking Sauces, Marinades and Seasonings pgs. 170-1819. Desserts pgs. 182-19510. High Days and Holidays pgs. 196-25311. Drinks pgs. 254-264",
                "review/helpfulness": "34/36",
                "num_reviews": 36
            },
            {
                "review/text": "These are recipes that western cooks could make with western ingrediants for Indian guests with complete confidence.If you love Indian food but worry that the food is often too high in fat: swimming in delicious clarified butter but too rich to be eaten more than occassionally, this book is the answer. The recipes are easy and quick to prepare. With the help of this cookbook you can have healthful Indian meals every day.The author is a British writer of Indian cookbooks and presenter of TV cooking series. Her recipes are very clever in the way they reduce fat and enhance flavor. One of her secrets was revealed in her previous book &quot;Indian Cooking Without Fat&quot; c.1999; she roasts spices on a dry frypan, she does not fry them in oil. You'll have to read the book to discover more of her ingenious and simple cooking techniques.There are only a few Indian ingrediants that are hard to find anywhere else but the imported food section, these are: asafoetida (a dry powdered spice, you may substitue garlic powder), besan (chick-pea flour), rose-flavored syrup.There might be one fault with the book, and that is that it was written for a British audience but was not translated into an American-English version. To help, I flipped through the book and found this list of translations that might be helpful; although most are fairly obvious.Some &quot;British&quot; to American translations:&quot;aubergine&quot; = eggplant&quot;bicarbonate of soda&quot; = baking soda&quot;beetroot&quot; = beets&quot;caster sugar&quot; = granulated sugar&quot;cornflour&quot; = corn starch&quot;coriander&quot; = cilantro&quot;courgette&quot; = zucchini&quot;creme fraiche&quot; = sour cream&quot;desiccated coconut&quot; = shredded coconut&quot;double cream&quot; = heavy cream&quot;English mustard&quot; = dry mustard powder&quot;fromage frais&quot; = cream cheese&quot;glace cherries&quot; = marachino cherries&quot;root ginger&quot; = ginger root&quot;semolina&quot; = wheat flour&quot;semi-skimmed milk&quot; = 2% milk&quot;soda water&quot; = club soda&quot;star anise&quot; = anise seed&quot;stoned dates&quot; = pitted dates&quot;sunflower oil&quot; = safflower oil",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            }
        ]
    },
    {
        "Title": "candide and other stories worlds classics",
        "description": "\"The story of Candide, a naive youth who is conscripted, shipwrecked, robbed, and tortured by the Inquisition without losing his will to live, is accompanied by four other stories\"--NoveList.",
        "authors": "['Voltaire,']",
        "infoLink": "http://books.google.com/books?id=mgMUDAAAQBAJ&dq=Candide+and+Other+Stories+(World%27s+Classics)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book has the title &quot;Candide and other stories&quot;, but the exciting part is the other stories. Yes &quot;Candide&quot; is a great work and perhaps the best satircal work of the 18th century, but it alone does not do justice to Voltaire's genius.Like a lot of people I had read &quot;Candide&quot; years ago for school and was impressed with the work. However, I soon forgot about it and never really thought about Voltaire's other works. As I was browsing Amazon one day I saw this book and thought it was time to revisit this old friend. Boy was I lucky.Three of the &quot;other stories&quot; are every bit as good as &quot;Candide&quot;. &quot;Micromegas&quot; is a fine SciFi work from the 1740's. It comes complete with a Saturnian and Syrian and relates their struggle to understand the Earth's philosophies. &quot;Zadig&quot; unfolds in a similar manner to &quot;Candide&quot; but may be even more biting. Finally &quot;The Ingenu&quot; holds special interest for Americans as it chronicles the problems encountered by a young Huron &quot;Savage&quot; as he relocates to &quot;Civilized&quot; France. The final story &quot;The White Bull&quot; is not in the same class as the rest of the works in this book, but still is a fun read.It was nice to see my old friend &quot;Candide&quot;, but even nicer to meet the new friends that are here. If you are considering buying one of the other copies which have only &quot;Candide&quot; the extra works here make this version so much richer.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "Everyone has their own idea of the perfect book, a list of approved characteristcs they think will cohere into something magical. Instead of psychological realism or detailed descriptions of nature, I like brisk, multiplying narratives, stories within stories, digressions, picaresque journies, a profusion of character and incident, dreams, exoticism, strange lands, bookishness, adn relentless violence. 'Candide' has this, and more, and is therefore my perfect book. Like anything that is theoretically perfect (an equivalent in film might by Losey's 'Mr. Klein') is that one is left a little unsatisfied - after all, where's the element of surprise? There are further grounds for grumbling - Voltaire can often come across as an annoying, opportunistic jack-of-all-trades; while the sheer excess of plot, narrated in the same urbane toneslessness, always risks becoming monotonous. But such quibbles are ungrateful. 'Candide' is one of the few classics that is genuinesly entertaining and uproariously, blackly comic. The Enlightenment values today are less convincing than the deadpan depiction of pervasive evil and the randomness of human destiny. The book is full of horrific incident - earthquakes, massacares, gang-rapes, mutilation, burnings, etc. - and yet comes across as almost breezy, and always laugh-out-loud-funny. I wish Bunuel had filmed this.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Voltaire is a master saterist, not a comedian. As with all satire, it hslps if we understand the contemporary world in which the author writes, but Voltaire's skill raises Candide above this level of satirical writing. He is masterful in the use of comedy to poke fun at the customs, mores, and beliefs of his time and show us the silliness to shich theunenlightened mind can go in the pursuit of perfection in an imperfect world. As a commentator on human culture he is followed by Mark Twain. Not that Twain can match Voltaire in his skill, only in some of his perceptions. This is an \"old\" book by new world reckoning, but as a masterpiecce well worth the time and effort of exploaration it is a timeless masterpiece. I highly recommend it to both believer and non-believer.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Where else can one read the narration of an optimist who looses his friends to death, escapes the European mainland, discovers utopia, returns to the mainland, and reunites with friends who were believed to be dead, while infused with the philosophical and political wit of Voltaire? Fabulous example of satire and genius.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "jim fobels big flavors",
        "description": "Jim Fobel's Big Flavors is the big (more than 500 recipes and variations), exuberant result of award-winning author Jim Fobel's lifelong search for flavors that are bold, complex, aromatic, assertive, and always tantalizing. Every recipe is clearly presented and simple for the novice cook, and sidebars convey lots of information about buying, storing, and using all the essential big flavor ingredients. \"From the Trade Paperback edition.",
        "authors": "['Jim Fobel']",
        "infoLink": "http://books.google.com/books?id=T3S0AAAACAAJ&dq=Jim+Fobel%27s+Big+Flavors&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Out of the hundreds of cookbooks I have this is my most consitently used. Everything is absolutely incredible. Many of the recipes are a bit time consuming but very much worth it! It's full of neat info and tidbits of trivia. Try the bolognese sauce and the barbeque sauce. Both are out of this world.Ken",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "What a great cookbook! As the title suggests, this book is packed with &quot;Big Flavor&quot; recipes. Mr. Fobel has mastered walking that fine line between not enough and too much spice. The resulting recipes are awesome. My current favorites include &quot;Harlem Meatloaf&quot; and his fresh roasted &quot;green chili&quot; -- both of which are absolutely incredible.In addition to the recipes, his cookbook contains lots of little factoids about cooking, techniques, and ingredients.What a great book.Steve",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is one of my favorite cookbooks! Every recipe I have made from this book has resulted in a &quot;Wow&quot; response from my family. If you like food with bold flavor, this is truly a &quot;must have&quot;!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "disjecta miscellaneous writings and a dramatic fragment",
        "description": "\"[Beckett] is a serious writer with something serious to say about the human condition: and therefore one of the dozen or so writers those who are concerned with modern man in search of his soul should read.\"-Stephen Spender, The New York Times Renowned Beckett scholar Ruby Cohn has selected some of Beckett's criticisms, reviews, letters, and other unpublished materials that shed new light on his work.",
        "authors": "['Samuel Beckett']",
        "infoLink": "https://play.google.com/store/books/details?id=Z2VcU2BNCLsC&source=gbs_api",
        "review": [
            {
                "review/text": "The hard to find piece &quot;Dante...Bruno.Vico..Joyce&quot; is included in this collection, and for this piece only, this is valuable for all Beckett enthusiasts. &quot;Dante&quot; was the leadoff essay to a collection of essays by James Joyce's peers on &quot;Work in Progress,&quot; which later became &quot;Finnegans Wake.&quot; Beckett's insight into the works of Dante, Vico and Joyce is scary (I'm not sure that Beckett cared too much about Bruno). These three figures have come to be important influences in Beckett's writings, and the fusion of Dante and Joyce reveals the very core of Beckett's own oeuvre. (This is the piece where Beckett defiantly stated: &quot;Here form is content, content is form.&quot; Also, the line: &quot;Literary criticism is not book-keeping.&quot;) In any case, Beckett the great prose-stylist, a healthy rival to Joyce, demonstrates his worth as a critic, perhaps the best critic of Joyce. Also, included in this book is the &quot;Three Dialogues&quot; with Georges Duthuit. This is the classic pseudo-interview that reveals some of Beckett's greatests remarks on art:&quot;Yet I speak of an art turning from it in disgust, weary of its puny exploits, weary of pretending to be able, of being able, of doing a little better the same old thing, of going a little further along a dreary road.&quot;&quot;The stars are undoubtedly superb, as Freud remarked on reading Kant's cosmological proof of the existence of God.&quot;&quot;All that should concern us is the acute and increasing anxiety of the relation itself, as though shadowed more and more darkly by a sense of invalidity, of inadequacy, of existence at the expense of all that it excludes, all that it blinds to.&quot;Superb. It's hard to imagine giving good word to Beckett. It is better to let these words trickle, slide, and coagulate on their own. As Beckett quoted from Freud, &quot;The stars are undoubtedly superb...&quot;",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Beckett at 22. Who could write that essay at 22, but Beckett? In fairness, most of the ideas are from Joyce's mouth to Beckett's pen: but it is Beckett's pen, not Joyce's mouth that interests us. Lines scarely better than those in Beckett's &quot;Proust&quot;.The danger, after all, is in the neatness of identifications.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "richard wagner the man his mind and his music",
        "description": "Probes the factors and personalities influencing the great German musician's life and work",
        "authors": "['Robert W. Gutman']",
        "infoLink": "http://books.google.com/books?id=hdKKSQAACAAJ&dq=Richard+Wagner:+The+man,+His+mind,+and+His+Music&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an adequate Wagner biography. Though Ronald Taylor's &quot;Wagner&quot;, and Barry Millington's Wagner biography (sold on this site) are both better.Where Gutman's book falls down is in his tenditious interpretations of &quot;the mind and music&quot;.Here are two examples.1 There is a misprint in Act 1 of &quot;Tristan und Isolde&quot;: Isolde says that she spared Tristan's life (after she recognised the mortally wounded Tristan as the man who killed her husband) only so that the man who next won her (Isolde) could kill Tristan. The correct sense is obvious from the context. However, a misprint in the text has &quot;ihn&quot;, not &quot;ihm&quot;. With &quot;ihn&quot;, Isolde seems to say that she spared Tristan's life so that the man who won _him_, not her, could kill him.There are three possible interpretations, here: (a) There is a misprint, not too surprising in a long sentence with complicated syntax. Gutman even acknowledges that Wagner seldom bothered to correct misprints once they'd got into print;(b) Isolde means to insult Tristan, calling him a woman, or homosexual, who could be &quot;won&quot; by another man; or(c) There is an entire subplot, involving a homosexual triangle between Tristan, his uncle King Mark, and his treacherous &quot;friend&quot; Melot, established before Isolde arrived, and which is not referred to in Wagner's text or music anywhere except for this one &quot;n&quot; instead of an &quot;m&quot;: &quot;ihn&quot; instead of &quot;ihm&quot;.Of these three options, (a) is overwhelmingly most likely, followed very distantly by (b), while (c) is beyond far-fetched, and merely silly. Gutman chooses (c), an example of the kind of decision, when evaluating evidence, that recurs throughout his book.Another example involves the HG Wells Literary Time Machine. Gutman wants to read &quot;Parsifal&quot; as a racist, antisemitic parable. To do this he has to ignore Wagner's text and substitute a plot of his own. In Wagner's &quot;Parsifal&quot;, Amfortas is wounded by the Spear that pierced Christ in the side, when he (Christ) was on the cross. This contact with Jesus' divine blood, through the agency of the Spear, causes Amfortas permanent agony; as a mere sinner he cannot cope with this contact with the Divine.In Gutman's &quot;Parsifal&quot; Amfortas is actually injured by sexual contact with a woman called Kundry, and his wound won't close because of the mix of Amfortas' superior and Kundry's inferior blood. Problems with this include:(1) the wound was dealt by a Spear, not by sexual contact - because of an interruption there was no sexual contact anyway;(2) Amfortas specifically says his problem is his inability to cope with the contact, through the wound, with the Divine;(3) At the climax of the opera, Amfortas' wound is healed &quot;by the Spear that caused it&quot;;(4) Kundry is a sinner, like Amfortas, but there's no suggestion that she has &quot;inferior blood&quot;, or (which is what Gutman is really getting at) that she is supposed to be a Jewish character. In Act II, Klingsor points out that in one of Kundry's past lives she was Gunndryggia, a Valkyrie (just like Bru:nnhilde!) If Gutman is suggesting that Kundry and her sisters, the Valkyries, are supposed to be Jewish characters, and antisemitic caricatures at that, that could perhaps lead to an interesting re-reading of the &quot;Ring&quot;.But Wagner's text makes it clear that Kundry has been many people in many lives, and does not represent any particular racial identity. And she's always been the most faithful, enduring and bravest of the Grail's servants, except when under Klingsor's enchantment; though a sinner, she is nowhere presented as &quot;inferior&quot;. The concept of &quot;inferior and superior blood&quot; absolutely does not occur in &quot;Parsifal&quot;. It is not there in the text, implied in the plot, or in the music.Gutman, however, wants to present &quot;Parsifal&quot; as a proto-Nazi work, and even describes the Grail knights as a &quot;homosexual SS order&quot;. We'll leave aside Gutman's use of slightly far-fetched &quot;discoveries&quot; of homosexual content as a stick with which to beat Wagner; homophobia was more acceptable in 1968, when Gutman's book was written, than it is now.What's more interesting is Gutman's Time Machine. To back his case for his reading of &quot;Parsifal&quot;, Gutman would like to have Wagner influenced by the racist philosopher Gobineau. If Gobineau had influenced &quot;Parsifal&quot;, that would indeed be in a racist direction. Unfortunately, Wagner wrote his first draft of &quot;Parsifal&quot; in 1857, including much of the most important dialogue; and finished the complete draft of the drama in 1877. We know from Cosima's Diaries that Wagner first read Gobineau in 1881, four years after he finished the text of &quot;Parsifal&quot;. Gutman's reading of Gobineau into &quot;Parsifal&quot; involves time travel. It's an odd mistake, given how often Gutman cites Cosima's Diaries. How could he not know this?Anyway, Gutman tends to use any old device, any old how, to try to &quot;prove&quot; some of his points. And that's not a respectable procedure, and makes the book unreliable in many respects.Laon",
                "review/helpfulness": "46/53",
                "num_reviews": 53
            },
            {
                "review/text": "I've just re-read this book, after first reviewing it over two years ago. I noted Gutman's unreliability then, but on re-reading I can only report that my opinion of Gutman has fallen further. I originally awarded it two stars; I now think that was generous.This book is more careless of source material than any book has right to be, but it's not ordinary carelessness. All errors and misstatements happen to support Gutman's case for a proto-Nazi Wagner. When a book's errors all support one thesis, that pattern must raise questions not just of competence but also of integrity.For example Gutman claims Wagner was &quot;sympathetic&quot; to proto-Nazi Bernhard F&ouml;rster's attempted German community in Paraguay. But Cosima's Diaries show that Wagner held F&ouml;rster in general and the South American project in particular in contempt. Why this &quot;mistake&quot;? Because it suits Gutman's thesis.Or take Wagner's late essays. If you read the essays themselves rather than Gutman's profoundly dishonest exegesis, you find a man wrestling with his own racism.In _Heroism and Christianity_, for example, Wagner does take it as a given that white people are superior to other &quot;races&quot;. Wagner, like many other European and American artists, was the product of a racist culture and it is unhistorical to pretend otherwise. But then Wagner writes that although people find the idea of the commingling of all human &quot;races&quot; into &quot;a uniform equality&quot; distressing, this is because of their cultural blinkers. &quot;It is only looking at it through the reek of our own civilisation and culture than makes this picture so repellant,&quot; he says.Christianity, Wagner continues, is superior to other religions because it is aimed equally at all &quot;races&quot; while Judaism and Brahminism, for example, include noble ideas but are aimed at only one &quot;race&quot; or caste. Although (he writes) it is &quot;natural&quot; [meaning &quot;likely to occur in nature&quot;] for strong &quot;races&quot; to rule weaker &quot;races&quot;, the rule of one &quot;race&quot; by another has led to &quot;exploitation&quot; and an &quot;utterly immoral system&quot;. Wagner's answer is equality of all &quot;races&quot; under &quot;a universal moral concord&quot;, something Wagner suggests that Christian doctrines could bring about. (Wagner was not a Christian, but in later life admired Christian rituals and doctrines.)The essay is not enlightened by modern standards, but in its historical context it stands as Wagner's rejection of the proto-Nazi ideas of his own day. Gutman's systematic distortions are regrettable not just because they go beyond mere inaccuracy but also because they are much less interesting than the truth.A passage recently cited as an example of Gutman's merits provides another example of Gutman's method:&quot;Monsalvat was Wagner's paranoiac concept of a small self-contained elite group, uniquely possessed of the truth, obsessed with its 'purity,' and struggling with an outside world it held worthless. Redemption was promised the hard-pressed knights, but, obviously, the Wagnerian redeemer was not to be found among Jewish craftsmen or lepers. Not by accident did Guernemanz almost immediately remark upon Parsifal's noble, highborn appearance. He knew what signs to read. Racial heredity and strict breeding, not natural selection, formed the new mechanism of salvation. Wagnerian eugenics had come into being; in his latest writing the composer had embraced the darker implications of Darwinism.&quot;Problems? First, Gutman misses the way _Parsifal_ shows Montsalvat critically and ironically (our first glimpse is of its watchmen sleeping on the job), as a damaged community that fails to live up to its ideals. An example is the knights' and squires' rejection of Kundry as Outsider, a moral fault for which the saintly G&uuml;rnemantz, clearly Wagner's mouthpiece, reproves them.Second, the reference to &quot;Jewish craftsmen and lepers&quot; is Gutman's invention. Neither are mentioned, let alone disparaged, in _Parsifal_.Third, Gutman must know that the remark on the hero's &quot;noble appearance&quot; is standard in Wagner's source material, and referred not so much to race as to &quot;gentle upbringing&quot;, meaning having &quot;courtly&quot; deportment as opposed to the gestures and manners of a peasant. Example? In Wagner main source, von Eschenbach's _Parzifal_, similar observations are made about Parzifal's half-brother Fierafiz, whose mother was black.Fourth, the Montsalvat community is not &quot;self-contained&quot;. Wagner's text mentions that Gawain is a member of the Montsalvat community, though that character is also a member of Arthur's court. And Gawain, like the other Montsalvat knights, spends as much or more time out in the world than at Montsalvat.Fifth, Montsalvat's alleged &quot;racial hereditary and strict breeding&quot; is more Gutmanian invention. Not only does _Parsifal_ not contain any such idea, or anything remotely like it, but Wagner's text rules out the possibility. G&uuml;rnemantz tells us that Montsalvat was founded by Titurel, who has had one adult child and is still alive when the opera begins. G&uuml;rnemantz was also a founding Montsalvat member. &quot;Breeding program&quot;? When? Instead the Montsalvat community must have grown through that bugbear even of modern racists: immigration. Some of Montsalvat's knights and squires may be children of original members, but that's hardly a breeding program. (By the way, Wagner's Montsalvat is in Spain. Not Germany.)Can a passage so densely inaccurate be the product of mere carelessness? I think not.Actually Gutman misses an intriguing possibility about Parsifal's ancestry. Parsifal comes from \"Arabia\". His father Gamuret was probably Welsh or Cornish, but we are told that Herzeleide was pregnant with Parsifal when Gamuret was in \"Arabia\". Since knights didn't take wives with them on crusade, the implication is that Gamuret met Herzeleide in \"Arabia\". (Wagner's text concerning Herzeleide differs significantly from his sources.) It's amusing in this context to consider that Wagner's Parsifal may have been what the media is currently calling \"of Mid-Eastern appearance\", and quite ineligible for the Hitler Youth. Still, the Nazi thing is Gutman's obsession, not Wagner's. Oh, and far from loving _Parsifal_, as Gutman would have you believe, the truth is that the Nazis banned it.In short, Gutman's &quot;first casualty&quot; wasn't Wagner, but truth. An irresponsibly unreliable book.Cheers!Laon",
                "review/helpfulness": "29/34",
                "num_reviews": 34
            },
            {
                "review/text": "Gutman has an axe to grind. He despises Wagner and sets out to discredit the composer whenever possible. While it is true that Wagner had many despicable traits (antisemitism, mendacity, oportunism, megalomania, womanizing, etc.), Gutman creates a wholly unsympathetic picture of this musical genius. Gutman sees the influence of Wagner's antisemetism everywhere, similar to the way UFO enthusiasts see the influence of space aliens everywhere in our culture. As a result this biography is not fair and balanced. Gutman's goal seems to be to get the reader to despise Wagner as much as he does. Laon, in his review, gives many detailed examples of Gutman's intellectual slipperiness as a biographer. Gutman maintains that Parsifal is Wagner's antisemitic magnum opus and the fact that Wagner's text does not support his argument, Gutman regards as proof of how clever Wagner was in hiding his antisemitism in his artistic works. He hid it so well that only Gutman can see it. Give me a break! How could the fact that there is no evidence be proof of the agrument he is making?Regarding the \"ihn\" versus \"ihm\" controversy in Tristan, Laon does a good job in elucidating Gutman's silly inuendoes. There is another possibility, which is that Wagner was trying to emulate an archaic German, so he may have deliberately chosen the \"wrong\" grammar (by modern standards) to make the sentence sound like an older pre-modern Germanic tongue. Native German speakers sometimes have difficulty understanding Wagner's texts for that reason. I agree with Laon that Gutman's book is decent on the facts of Wagner's life but is biased and misleading on the interpretation of those facts. It's too bad that such a knowledgeable writer as Gutman could let his personal biases mar what could have been a balanced and thoughtful biography of this controversial musical genius. Gutman's logic appears to run as follows: Wagner was anti-Semitic, Hitler liked Wagner's music and ideas, therefore Wagner was responsible for the Holocaust.I read this book hoping to understand how Wagner, with all his character flaws, could write such beautiful and psychologically insightful musical dramas. Gutman did not answer my question, except to say that what appear on the surface to be works of genius are really clever attempts by a scoundrel to indoctrinate others into his antisemitism. How is it then that I come away from listening to Wagner with a loathing of anti-Semitism and a overwhelming experience of comapssion for the human family?",
                "review/helpfulness": "20/25",
                "num_reviews": 25
            }
        ]
    },
    {
        "Title": "the venus hottentot callaloo poetry series number 9",
        "description": "Four decades ago Tom F. Driver brought theater into discussion with religion and modern theology. It has been a rich ongoing dialogue, but one that now demands a bold new engagement. In Theater and Integrity, Larry D. Bouchard argues that while the \"antitheatrical prejudice\" regards theater as epitomizing the absence of integrity, theater's ways of being realized in ensembles, texts, and performances allow us to reenvision integrity's emergence and ephemeral presence. This book follows such questions across theatrical, philosophical, and theological studies of moral, personal, bodily, and kenotic patterns of integrity. It locates ambiguities in our discourse about integrity, and it delves into conceptions of identity, morality, selfhood, and otherness. Its explorations ask if integrity is less a quality we might possess than a contingent gift that may appear, disappear, and perhaps reappear. Not only does he chart anew the ethical and religious dimensions of integrity, but he also reads closely across the history of theater, from Greek and Shakespearean drama to the likes of Seamus Heaney, T. S. Eliot, Caryl Churchill, Wole Soyinka, Tony Kushner, and Suzan-Lori Parks. His is an approach of juxtaposition and reflection, starting from the perennial observation that theater both criticizes and acknowledges dimensions of drama and theatricality in life.",
        "authors": "['Larry D. Bouchard']",
        "infoLink": "http://books.google.com/books?id=Mbvi3uQX7WYC&dq=The+Venus+Hottentot+(Callaloo+Poetry+Series,+Number+9)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "&quot;All changed, changed utterly: A terrible beauty is born.&quot; --W.B. Yeats, &quot;Easter 1916&quot;&quot;a terrible beau- ty a terrible beauty a terrible beauty a horn&quot; --Elizabeth Alexander, &quot;John Col&quot;The parallel of Ireland's War for Independence to John Coltrane's jazz at first may strike some readers as a stretch. However, through the pen of Elizabeth Alexander, an African-American poet who manages to discuss at once important issues of race and myriad topics within history, art and music, any connection is elucidated with eloquence and power. In &quot;The Venus Hottentot,&quot; Alexander's first book of poems, the subjects range from personal memory to entire cultural memories to human subjects: John Coltrane, Romare Bearden, Claude Monet, a rare black cowboy. In the fourth section of her book, Alexander's essential message is one of unity in difference. &quot;I could go to any city/ and write a poem&quot; she states in &quot;Miami Footnote.&quot; And she does, writing out of Boston, Philadelphia, Brooklyn. Her subjects are black, Hispanic, and the eye with which she paints them has its own form of the Monet's xanthopsia in &quot;Monet at Giverny.&quot; Colors fade from the black and vivid blue of Bearden's collages into &quot;yellow freesia,&quot; &quot;red notes.&quot; In &quot;Today's News&quot;, she states that &quot;blackness is&quot; is a poem she does not want to write, because &quot;we are not one or ten or ten thousand things.&quot; The reader stands looking up and around at the montage, a Diego Rivera mural surrounding one with &quot;walls and walls of scenes of work.&quot; The &quot;Painting&quot; is effusive, so why not include the Irish? Out of the clashes of culture, the curious, though ignorant, manipulation of a race in &quot;The Venus Hottentot,&quot; a &quot;terrible beauty is born.&quot; Alexander sees this beauty in all its colors and musical shadings, none of which alone can describe a situation. Shading her vision with Irish green or Monet's blue, she lives true to the words of &quot;Today's News&quot;: &quot;Elizabeth,/ this is your life. Get up and look for color,/ look for color everywhere.&quot; Perceptive readers would do well to join Alexander in her search; they just might find something unexpected and lovely.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "If you're looking for an energetic, political, feminist poet who calls it like it is - you've got to read this book. It is beautifully provocative, and tightly written - very exciting stuff.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Elizabeth Alexander, The Venus Hottentot (University Press of Virginia, 1990)I started a number of poetry volumes over the weekend, including a much-anticipated one from one of my favorite poets, and none of them captured me the way The Venus Hottentot did. Elizabeth Alexander has a wonderful voice, and she knows how to craft it into strong, yet delicate, poems:\"I half expect him to pull silkscarves from inside me, paper poppies,then a rabbit! He complainsat my scent and does not thinkI comprehend, but I speakEnglish. I speak Dutch. I speaka little French as well, andlanguages Monseiur Cuvierwill never know have names.\"(\"The Venus Hottentot\")Wonderful stuff indeed.The entire collection is not as strong as this opening salvo; Alexander does devolve into polemic now and again, but usually manages to snap out of it within a few lines. This one goes on the \"highly recommended\" shelf. ***",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "word stems a dictionary",
        "description": "Provides a dictionary of common words and word stems along with lists of word stems with their definitions and roots.",
        "authors": "['John Kennedy']",
        "infoLink": "http://books.google.com/books?id=RUvPuNg7Ze0C&dq=Word+Stems:+A+Dictionary&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Linguists call roots &quot;segmental morphemes&quot;, but we know them as prefixes, suffixes, and elements. Kennedy's book provides a good reference regarding the roots of the 8,000 or so &quot;standard vocabulary&quot;. The secret in making these kinds of reference books work is to provide cross references that encourage the reader to explore and discover gems that they weren't looking for (something akin to &quot;surfing&quot; the book). The format of Kennedy's book, and the clarity of its presentation masterfully achieves this objective. My only gripe with this book is that it stops at the obvious - mainly the Latin or Greek source of the root. But we know that the words and their roots go much deeper into the past, to their Proto-Indo European source. If this book had gone that far back, it would have been the indispensible standard. Still, its a very good book and strongly recommended for the wordsmith.",
                "review/helpfulness": "69/70",
                "num_reviews": 70
            },
            {
                "review/text": "This is a useful book, especially for English teachers and really anyone interested in the etymological history of basic word roots in the English language. Sure we all know what prefixes like &quot;anti&quot; and &quot;post&quot; mean, or suffixes like &quot;ship&quot; or &quot;dom,&quot; but what about common word roots like &quot;cumb,&quot; as in &quot;incumbent&quot; or &quot;succumb,&quot; or &quot;sider,&quot; as in &quot;consider&quot; or &quot;sidereal&quot;? This book is not for everyone, but if you are interested in strengthening your vocabulary or just browsing the origins of words while taking a lengthy visit to the latrine, this is the book for you.",
                "review/helpfulness": "51/51",
                "num_reviews": 51
            }
        ]
    },
    {
        "Title": "without miracles universal selection theory and the second darwinian revolution",
        "description": "Without Miracles describes many remarkable examples of the fit of various structures, behaviors, and products of living organisms to their environments in a broad synthesis of humankind's attempt to understand the emergence of complex, adapted entities.",
        "authors": "['Gary Cziko']",
        "infoLink": "http://books.google.nl/books?id=v1JEypylerUC&dq=Without+Miracles:+Universal+Selection+Theory+and+the+Second+Darwinian+Revolution&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is surely a must for anyone interested in phylosophical discussions concerning &quot;darwinian&quot; (or better, neo-darwinian) evolution theory, and its potential to explain other fields where any kind of innovation is created. The author describes these innovations as &quot;puzzles of fit&quot; of an organism or of a system to another organism or system, and he brilliantly equals all these &quot;fits&quot; to &quot;knowledge&quot;. Cziko reached a good level of quality in his transdisciplinary approach, putting together data from fields like evolutionary biology, immunology, neurobiology, animal and human learning, human thought and language, scientific knowledge growth, and cultural adaptation. For this, he no doubt deserves a four-star ranking. But then, there come the flaws...The central issue in the book is that just any kind of innovation, puzzle of fit, knowledge growth, or whatever you call it, can only be achieved through a process very much like biological evolution as accepted by the neo-darwinian paradigm: cumulative blind variation followed by the survival of the fittest. Cziko also shows how explanations for these puzzles of fit have evolved in all fields from providential explanations (like in the book of Genesis, where things happened to achieve a pourpose previously devised), through instructionist ones (like Lamarck's &quot;Use and Disuse&quot; plus &quot;Inheritance of Acquired Characters&quot;, where the environment would &quot;force&quot; the individual creatures to change just in the right, successful way, and then the creatures would pass these changes on to their offsprings), and finally to selectionist ones (Darwin's Selection Theory). He says that only selectionist explanations can give truly &quot;scientific&quot; and &quot;naturalistic&quot; accounts for these fits, without recoursing to miraculous schemes. In short: Cziko brings us the good news that not only are we merely machines (like we have feared ever since the mechanical physics of Newton), but we are blind ones too!The starting point of his reasoning is evolutionary biology, and Cziko's understanding of it seems to me too narrow-minded, with a strong bias toward the old notions of New-Darwinism. Consequently, his report and deductions on it are misinformative. Evolution was (and, to a large extent, still is) thought to be based on &quot;variation and survival of the fittest&quot;. But in the past the view of the causes of these variations were believed to be basically errors: DNA damage by the environment, and failure of the organism to correct damages or to make precise copies of the DNA. It's been a long time now that this view has changed dramatically, and organisms, even as simple as bacteria, are now known (from before 1990) to possess amazing control over the ways and the contexts in which these variations happen. They can trigger DNA mutation under appropriate conditions (stress, threats to survival), and even control which areas of the genome will be subject to change. This renders organisms much more &quot;smartly&quot; interactive with the environment as might be expected from reading Cziko.So, what Cziko did not tell about the process of antibody creation by B-Lynphocytes is that when they undergo somatic hypermutation to fine tune their antibody production to the antigen, this hypermutation is, first, triggered by the interaction with the very antigen, and second, it is far from blind: the mutation happens only in a very restricted area of the chromosome, changing only the areas of the antibody molecule that interact with the antigen (and not even the whole molecule!). So this is a very &quot;thematic&quot; kind of mutation-variation; maybe &quot;short-sighted&quot;, but surely not &quot;blind&quot;!When he comments on the phenomenon of &quot;directed mutation&quot;, the strange capability of many procarionts (like bacteria) to seemingly direct their mutation to the desired result, he takes a rather cynical and slightly arrogant stand, apparently rejecting the existance of the phenomenon itself, even saying &quot;But let us continue to imagine for a moment that a bacterium was able to change just those genes regulating metabolism in just the right way to allow for the digestion of a foreign sugar&quot;. It seems that he read only two research articles on this, and not quite well, and draw much of his attitude towards the phenomenon from his academic-environment prejudiced and uninformed criticism. By the time he was writing his book , directed mutation had been fully demonstrated by many researchers, and not only by Cairns. Actually, even as early as 1984, four years before Cairns revolutionary and controversial paper on it, J.A. Shapiro had already shown the phenomenon fully (Observations on the Formation of Clones Containing araB-lacZ cistrons fusions. Molecular &amp; General Genetics 1984;194(1-2):79-80), only in a much more discreet maner. By 1995, a wealth of information was already available, from researchers like Shapiro and B.G. Hall, among others, and now even eukariotes (yeast) are known to perform &quot;directed mutation&quot; (Hall BG. Adaptive Mutagenesis: a Process that Generates Almost Exclusively Beneficial Mutations. Genetica 1998;102(103):109-125.). Strikingly, this process shows some resemblance to human B-lynphocyte somatic hypermutation!When Cziko moves on to the other areas, scientific knowledge growth, etc, the already &quot;short-sighted&quot; (and not blind) variation seems to have undergone a surgical operation on its eye and starts to see almost sharply. Also, the second step, that is, the survival of the fittest (in biology, through killing the non-fit) seems to change to a true &quot;selection&quot; process (choosing one among many, by identifying its desirable qualities, which is quite different from &quot;survival of the fittest&quot;). Even Campbell and Pinker, which he defines as fully (or almost) selectionists, seem to turn to rather providential viewpoints, like &quot;innativism&quot; and &quot;constraints&quot;, for triggering and orienting the variation, and guiding the selection, not succeding in solving Meno's providential dilema: &quot;...if you don't already possess the knowledge you are looking for, how will you know when you have found it?&quot;Cziko, like many, wrongly equals &quot;scientific&quot; and &quot;naturalistic&quot; explanations to &quot;mechanical&quot; ones, and since our mechanistic view of nature is basically deterministic, he only sees lamarckism as an instructionist process, not a &quot;freely-willed&quot; one, failing to address vital phenomena like human consciouness and apparent free-will.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book can be found at http://faculty.ed.uiuc.edu/g-cziko/wm/",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "We all know about the theory of evolution by natural selection, but what I didn't know was that this idea could be extended to any field in which something new is produced. Cziko brilliantly reviews the application of selection theory (blind variation followed by selection of best fits) to fields as different as neurology, immunology, linguistics, education, pharmacology and artificial intelligence, and presents a strong argument for the claim that innovation in any field can only arise through an application of selection theory. How does our immune system deal with a potentially infinite variety of antigens? Not directly through information contained in the genes, which are quite limited in number. Not through direct copying of the shapes of antigens, since no mechanism allows it to copy an infinite number of potential shapes. Rather, sequential generations of B lymphocytes produce antibodies that fit the antigen better and better, with continual selection of the B lymphocytes that produce the best-fitting antibodies. How do we acquire new knowledge? It is not innate, as Plato claimed. And we don't directly &quot;learn&quot; it from others, except in the sense that a parrot learns. Rather, we are constantly trying to make better and better sense of our perceptions, by building better and better explanations in our minds and rejecting inadequate explanations. Information and instruction received from others are only perceptions to us until we have incorporated them into our own explanatory schemes. So &quot;learning&quot; is actually an active process of explanation-building through trial and error, in other words, a form of blind variation of explanatory schemes and selection of the best ones.This book is well-written, clear, and immensely &quot;instructive&quot;, causing me to modify a number of explanatory schemes in my own mind. I put it alongside the best of Dawkins, Dennett and Wilson. It should have a much wider readership than it apparently has.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "That applies to this book, as well as the concepts described herein.When a book can alter your perception and understanding of the world for the better you reread it. I'm currently on my third formal reading of this masterpiece. I go back to it often.Cziko has brought to life the simple but powerful concept that Campbell called evolutionary epistemology: blind variation and selection. I use these concepts in everyday life (risk-taking, creativity, trade-off decision-making). Even if not useful, the concept would enegender admiration for its sheer beauty. The fact that it can be useful and fun is an added benefit.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "for the love of books 115 celebrated writers on the books they love most",
        "description": "What to read next is every book lover's greatest dilemma. Nancy Pearl comes to the rescue with this wide-ranging and fun guide to the best reading new and old. Pearl, who inspired legions of litterateurs with \"What If All (name the city) Read the Same Book,\" has devised reading lists that cater to every mood, occasion, and personality. These annotated lists cover such topics as mother-daughter relationships, science for nonscientists, mysteries of all stripes, African-American fiction from a female point of view, must-reads for kids, books on bicycling, \"chick-lit,\" and many more. Pearl's enthusiasm and taste shine throughout.",
        "authors": "['Nancy Pearl']",
        "infoLink": "https://play.google.com/store/books/details?id=ziNPBAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Shwartz is a Boston trail lawyer with an unabashed love for the well-written word. In the introduction Shwartz wrote about reading, &quot;I would read, as readers do, to tame the unfamiliar or see the familiar through new and enlightened prisms; to see how different or eerily familiar, another person's interior life could be from my own.&quot;This is a book of short commentaries by 115 writers on the books they love most. And indeed it is hard to flip many pages without finding the word love. Shwartz set out to produce the very book he couldn't find in bookstores!This is truly a book that your reading group could share. Buy one copy and bring it to meetings. It can give you a wealth of insights and ideas for books to read- read a book written by one of the 115 authors interviewed and then select a book to read that influenced that author. The bibliographical index is reason alone to buy this book. Shwartz has said that he always found himself asking what the authors themselves read; and here you'll find that answered both in text and in the index.Penelope Fitzgerald, author of &quot;The Bookshop&quot; wrote in her commentary that &quot;Fathers&amp; Sons&quot; was one of the books that made the greatest impression on her, &quot;I still feel close to weeping when I get to the end. . . &quot; John Irving, author of &quot;The Cider House Rules&quot; named &quot;Great Expectations&quot; and said, &quot;. . .the intention of a novel by Charles Dickens is to move you emotionally- not intellectually . . . &quot; And Anna Quindlen, author of &quot;One True Thing&quot; said, &quot;The books I've loved most were the books I could inhabit.&quot;Our interesting word selection was &quot;Verity&quot;&quot; The quality or state of being true or real. Faithfulness to aesthetic truth.Our favorite quote was by Anne Fadiman: &quot;I was so ludicrously unprepared for Humanties 190 that the course nearly proved my undoing. With a doggedness born of panic, I defaced nearly every line of Aristitle's poetics with citron Hi-liter and crammed the margins with felt-tip notations.&quot;Shwartz wrote that it was his hope that his book &quot;might inspire people to read more. . . &quot; Oh yes!",
                "review/helpfulness": "17/21",
                "num_reviews": 21
            },
            {
                "review/text": "the only drawback of this book is that it will rob you of precious hours devoted to reading other books! i'm being facetious, of course -- this is a wealth of reflections to (a) place by your bedside table, (b) in the glovebox of your car, and (c) dare i say, in the bathroom to savor whenever you get a spare moment -- or to enjoy simply for its own sake. it's very much like sitting down face-to-face with a garrulous, self-reflective author (or grandparent) and hearing a lifetime of wisdom squished into a few minutes. so grab a pencil -- you're going to need one! -- and mark what sounds interesting. funny how often &quot;the brothers k&quot; gets mentioned, &quot;moby dick&quot; etc. but so many wonderful surprises in store, too. thanks to kurt vonnegut's (brilliant) short essay, for example, i picked up &quot;candide&quot; and am much the wiser. oddly enough, no one recommends &quot;les mis&eacute;rables&quot; -- i can't imagine why not -- or &quot;musashi&quot; for that matter. but &quot;the tale of genji&quot; is recommended, so all is forgiven. &quot;for the love of books&quot; = beautiful!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "A wonderful collection of some of the most remarkable authors likes and dislikes and what books influenced them most. From childhood memories to adult appreciation, each author shares their favorite titles as well as how they came to appreciate reading and the written word.As a fellow author, I felt like I had a window seat into the soul of many great writers. &quot;WAR AND PEACE&quot; won many votes as a favored choice.Some authors distinguish between historic works and current favorites. Most agree that readers make writers! Each author seems to highly respect the written word.Truly enjoyed the stories told about what was viewed as the catalyst to an early appreciation of books. My only negative comment would have to be on the size of the text. Personal opinion is that with so much written word on a page, you can lose the interest of the reader. These stories should be appreciated and read.Easy to see why this would make an excellent choice for any adult book/reading group.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "grails quests of the dawn",
        "description": "Gathers stories by Jane Yolen, Andre Norton, Marion Zimmer Bradley, Gene Wolfe, Alan Dean Foster, and Orson Scott Card",
        "authors": "['Richard Gilliam', 'Martin Harry Greenberg', 'Edward E. Kramer']",
        "infoLink": "http://books.google.com/books?id=x75lAAAAMAAJ&dq=Grails:+Quests+of+the+Dawn&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Gaiman story in this collection is brilliant. There are other bright spots as well, particularly the contributions from Diana Paxson and Alan Dean Foster. Good, fun stuff.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Arthurian fiction in general is steeped with awful fiction, and short story collections are a mixed bag. Let me simply say that I was left unimpressed - and often disgusted - by the stories in here. There are some good ones, but they are few and far between. (Do not be led astray by the pretty cover art! It is pretty, but that's almost all it has going for it)We start with an icky poem by Jane Yolen; then a groanworthy Mercedes Lackey story &quot;The Cup and the Cauldron&quot; -- it stars girls and yes, has more Christian-pagan stuff if you're as sick of that as I am; an incoherent Andre Norton story &quot;That Which Overfloweth&quot;; Marion Zimmer Bradley's equally groanworthy feminist-Goddess-server &quot;Chalice of Tears.&quot; We hit something far better in Diana L. Paxson's &quot;Feast of the Fisher King,&quot; which is both well-written and entertaining, as well as being in play format; also Brad Strickland's enjoyable elf-fantasy-Arthurian story &quot;Gift of Gilthiliad.&quot;Then it's back into &quot;groan&quot; territory with Ilona Ouspenskaya's gypsy tale &quot;Curse of the Romany,&quot; where you wonder what-the-heck-does-this-have-to-do-with-it? James S. Dorr's &quot;Dagda&quot; is pretty; Gene Wolfe's odd &quot;Sailor who Sailed After the Sun&quot; is another where you wonder what the relevance is; Lee Hoffman's indifferently-written western-fantasy &quot;Water&quot; takes a long time to get to the point, as does Alan Dean Foster's &quot;What You See...&quot; and Richard Gilliam's &quot;Storyville, Tennessee&quot; and Jeremiah Phipps' &quot;Hell-Bent for Leather&quot; (are you seeing a pattern of irrelevance here?)Lisa Lepovetsky pens another icky poem; Orson Scott Card's &quot;Atlantis&quot; stretches indefinitely; Dean Wesley Smith's &quot;Invisible Bars&quot; is pretty amusing; Janny Wurts bores and annoys with &quot;That Way Lies Camelot&quot;; Kristine Katherine Rusch's &quot;Hitchhiking across an Ancient Sea&quot; is a pale, pale short story; Lawrence Watt-Evans's story has a good idea, but is poorly written; Lionel Fenn's &quot;The Awful Truth in Arthur's Barrow&quot; is just plain bizarre, as is Brian M. Thompson's &quot;Reunion.&quot; Margo Skinner redeems the poetry angle with &quot;Quest Now&quot;; Neil Gaiman's &quot;Chivalry&quot; is enchanting; Bruce D. Arthurs is weird again in &quot;Falling to the Edge of the End of the World&quot;, same with Rick Wilber's &quot;Greggie's Cup.&quot;As you can see, this mixed bag tends toward the dull, irrelevant, pretentious and just poorly written. Half the stories seem to have the Grail thrown in (if it's there at all) just as an afterthought. Except for Margo Skinner's poem, the poetry all stinks; only a few of the stories retain the beauty and prose that one espects to see in an Arthurian story. When I buy a book classified as Arthurian fiction, I WANT Arthurian fiction; I do not want stories about pregnant gypsies, fantasy westerns, or genies.There are much better collections out there, however bright the bright spots in this are. Read &quot;The Doom of Camelot&quot; and the upcoming &quot;Legends of the Pendragon&quot; if you want good Arthurian short stories.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "heart of the home a vegetarian cookbook for people who want to make a change but dont know where to start",
        "description": "'50s kitsch meets the Deep South in this collection of homestyle vegetarian recipes. Ann Jackson sings the praises of aprons and cast-iron skillets between tempting offerings of fried chicken tofu, mashed potatoes, mushroom gravy, and pralines. And don't stop there--buried in the instructions for everything from pizza to biscuits are tidbits of a Southern novel, just waiting to be discovered. Y'all come back for more!",
        "authors": "['Ann Jackson']",
        "infoLink": "http://books.google.com/books?id=YsBQXwAACAAJ&dq=Heart+of+the+Home:+A+Vegetarian+Cookbook+for+People+Who+Want+to+Make+a+Change+But+Don%27t+Know+Where+to+Start.&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book has some great comfort food recipes (biscuits, shortcake, pecan pie), but I was disappointed in its presentation and tone--there are many recipes that call for eggs with a cursory note to use &quot;egg replacer&quot;--I doubt whether the author has seriously tried to bake most of these recipes using vegan egg replacer. Also there are recipes that call for cheese--that again, I seriously doubt whether she has tried to make using dairy-free cheeses.There are typos all over the book, the degree sign for temperature is somehow missing, knead is spelled &quot;kneed,&quot; plum is spelled &quot;plumb,&quot; and there is no help as to number of servings each recipe is supposed to make. The references to &quot;big black mammies&quot; and, in the intro, for &quot;girls&quot;--&quot;find out what his favorite foods are&quot; and &quot;wear a little apron&quot; were unnecessary. While some would consider it irreverent, I find it annoying.This book could be great with a little editing and attention to detail. Maybe the fourth edition...",
                "review/helpfulness": "19/26",
                "num_reviews": 26
            },
            {
                "review/text": "I am vegan and bought this for a friend who is from the south and thought she'd get a kick out of trying some dairy free/meat free southern recipes considering the rave reviews it got. I don't understand how this cookbook can claim to be dairy free when many of the recipes call for buttermilk, cheese, butter, and condensed milk. For example, the cheesebread recipe calls for swiss cheese and cheddar cheese. Huh? I am disappointed but more confused than anything.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "&quot;The moon was in Scorpio, and I was three sheets to the wind_&quot; Thus begins the recipe for &quot;Enchilada Sauce,&quot; just across the page from &quot;White Woman's Bar-Be-Que Sauce.&quot;Both irreverent and down-to-earth; open at any page and you'll know &quot;Heart of the Home&quot; isn't like any cookbook you've seen before. This is vegetarian cooking, down-home country style, and this is literature.&quot;If you have Cancer in your astrological chart, you will love making gravy, stir to your heart's content.&quot; Reassuring those who haven't ever picked up a pot before, nudging old hands to take chances they've never taken, this is a book for anyone wanting to connect or reconnect with the essential experience of cooking for others. Beyond that, it's a walk into one woman's extraordinary collection of warm moments and memories of special encounters, mostly in the kitchen.Meet my old friend Ann Jackson. Truly a unique and original talent, when I first knew her she was the cook for a warehouse full of vegetarian men and women running one of the biggest natural foods operations in the West. I was the produce manager. Every morning Ann would come around the corner of that big walk-in cooler looking to see what was fresh and good and it was like the start of another day's adventure.There's a whole cast of characters here, and every recipe is delivered with definite personality. Patsy, Senter, Dorita, Lindsey, Licorice, Tommy Merritt and a roving cast of truckers, girlfriends, pets, produce dealers and crazy Italians wander the range of food and adventure, covering the ground from &quot;Prem Nagar Pea Soup&quot; &amp; &quot;Solidarity Borscht&quot; to &quot;Milwaukee Street Squash&quot; &amp; &quot;Nostromo Noodles.&quot; One of my favorites is &quot;Mama's Dark Secret,&quot; and if Ann didn't invent &quot;Chicken Fried Tofu,&quot; she sure perfected the form toward true immortality.&quot;What good is it how healthy something is if it doesn't taste good?&quot; Healthy and good food that doesn't weigh you down and doesn't bore you either. I remember Ann used to call it &quot;meat and potatoes vegetarian cooking.&quot; This is cooking for an American palette, without the usual American reliance on cheese and meat and processed additives. One of the author's goals is to encourage us to escape our dependence on cow, but she is never dogmatic, and most of the recipes can go either way. &quot;_If you don't want to use soy milk, fine, use milk, use cream for all I care (they're your thighs), just get in there and do it!&quot; Her other objective is to introduce us to a whole range of possibilities for vegetarian staples like tofu, tempeh, miso, seaweeds, grains, rice and noodles, while proving that we don't have to leave behind such traditional fare as Potato Salad (the best I've tasted), Corn Fritters, Chocolate Cream Pie, Hushpuppies and Baked Beans.Ann and her husband own and manage 'Time After Time,' a very successful 2nd hand clothes store in Chapel Hill, North Carolina. They live amidst a fantastic collection of folk art and memorabilia (from which the 50s illustrations that adorn &quot;Heart of the Home&quot; are taken). The kitchen is clearly near the heart of their home, and with this cookbook we're all invited to sit around the kitchen table to share a few good stories and a lot of good eating.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I've never been a big fan of the Moosewood series. This is probably a stupid reason, but I think I'm biased against Ms. Katzen's books because of a single recipe: miso soup. In one of her books, she published the most absurd recipe for Misoshiru that I have ever seen--taking one of the world's simplest, most sophisticated dishes, and turning it into a complex and garish production that completely misses the point of Japanese cuisine. So Molly gets a thumbs-down from me on the basis of a single recipe, and I'm probably not being at all fair. Ah, but I digress...Ann Jackson's books are for vegetarians as well, but they're quite different from most cookbooks you've probably seen. For one thing, they're, ahem... fairly casually written. It's not at all unusual to get the feeling when you're cooking one of her recipes, that you're being instructed by someone who's terribly busy and not really paying attention to what you're doing. Me: \"Say, Ann--how am I supposed to chop these rutabagas? Should they be diced, or minced?\" Ann Jackson (without even looking): \"They look great to me--you're doing a great job.\" You run across these moments in Ms. Jackson's books where you'll be asked to add butter to a dish--but if you don't happen to have any butter on hand, it's OK substitute sweet potatoes or creamed corn. I'm exaggerating, of course, but just barely. When preparing Ms. Jackson's recipes, I've become accustomed to doing my shopping, getting halfway through a recipe, and then realizing that I didn't pick up one of the ingredients because she didn't bother to list it--until the very end of the recipe. Is this incredibly annoying? Well, yes, at first. But the thing is, I haven't made a single dish from her cookbooks that didn't turn out great. And a few of her recipes are among our family's essential, once-a-week favorites (her mushroom and corn stew, served with biscuits, is simply not to be missed). Until you've tried her grilled carrot \"hot dogs\", you really haven't had all-American cuisine. Ms. Jackson's cavalier attitude toward details--while leading to some \"interesting\" moments in the kitchen--doesn't seem to harm the recipes one little bit.I've grown to love this cookbook, and have purchased copies for many, many of my vegetarian and non-vegetarian friends. It's probably my favorite vegetarian cookbook, and high on my list of all-time favorites--right alongside classics like Julie Sahni's \"Classic Indian Cooking\" and Shizuo Tsuji's \"Japanese Cooking - A Simple Art\"--books that inspire and educate as well as giving you specific examples of the cuisine.This is not a cookbook for people who are afraid of food, and it's certainly not a cookbook for people who demand precise measurements and dependably repeatable recipes. This is a cookbook for people who love food and who love cooks and who know that the dish will always turn out fine. Just make it taste good, and it'll be great.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This cookbook is both hilarious and delicious. Whether you are a full time vegetarian or just want to cook the occasional meatless meal, you will find numerous simple and healthy recipes to widen your repertoire and amaze your friends. Fried Chicken Tofu has become a favorite of my entire family and even is liked by my sons' teenage friends who would never before eat something called soybean curd. Please treat yourself to a good time and buy this book!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "There is something that happens to me when I read through Ann Jackson's cookbooks. Simply put: I am filled with the most pleasant longing for something GOOD. She makes my mouth water weather or not I am hungry upon the time of reading! I love her books so much that I've taken them both to bed to read. How many cook books are there that you can thoroughly enjoy from cover to cover like that?Any woman who can make me laugh while teaching me the alchemist craft of transforming tofu into something that tastes deliciously like chicken will now and forever more only receive my praises!Jackson writes the kind of cookbooks that are meant to be absorbed--and with her inspiring stories, charming anecdotes, FANTASTIC graphics and fun retro fonts it is easy to do just that. From there, all the actual recipies are easy and it's like by reading her cookbook she teaches you how to cook southern via attitude vs. precision.She makes you want to cook from the heart, while heartily enjoying your life in the process....and when I do just that, my friends think I'm the queen of the kitchen. Can you say that a cookbook has changed your life? Well, there...I just said it.xxoo, her biggest fan",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "when reggie white lost all that weight. he was asked how he did it? he said &quot;if it taste good dont eat it&quot;. pity he did not have ann jacksons book. fat or slim, young or old, rich or poor this can be your daily guide to great southern eating.to-fu fried chicken, gingerbread, cornbread. really you will love this cook...pass the gravy pa!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Heart of the Home, by Ann Jackson is an essential for every Southern vegetarian's kitchen. When I first bought the book I treated it lika a novel, reading each humorous story and looking over the recipes. A few hours later I was in the grocery store selecting ingredients for Southern Fried Tofu, Wee Blu Inn salad dressing, Milwaukee Street Squash, Palumbo's Provincetown Mushroom-Barley Soup and Gingerbread.The gingerbread is really wonderful. I've tried many recipes but Ann Jackson's is the BEST! The tempeh salad is to die for! It has become a lunch staple at our house.If you're a lover of cooking and good food, buy this book for, as Owen Meredith put it, &quot;We may live without conscience, and live without heart; We may live without poetry, music and art; We many live without freinds, we may live without books; But civilized men cannot live without cooks. He may live without hope, what is passion but pining? But WHERE is the man who can live without dining? (Taken from the pages of Heart of the Home.)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "ahh...my fear of the kitchen has been conquered. For someone that is all thumbs in the kitchen, I found this book to be funny, informative and most of all encouraging. The fried chicken tofu recipe is to die for. I found it a joy to read...who knew a cookbook could be filled with such great stories. Who knew I could be a good cook.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "this book is for the pro or beginner. if you get one you will find yourself using it daily. fried , chicken, gravy, gingerbread or doughnuts it is simply a must for any chefs library !!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the mask of nostradamus a biography of the worlds most famous prophet",
        "description": "A comprehensive critical biography of the legendary sixteenth-century astrologer examines the allure of the man and his ideas and clarifies his many famous predictions, such as Hitler's reign of terror and Watergate",
        "authors": "['James Randi']",
        "infoLink": "http://books.google.com/books?id=Wn7_wYlnwEMC&dq=The+Mask+of+Nostradamus:+A+Biography+of+the+World%27s+Most+Famous+Prophet&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Ignore the reader from NY. Like many he believes any small measure of &quot;psychic&quot; power &quot;amazing&quot;. What Randi finds amazing is what I myself do, the beauty and miracle of a flower growing, the skills of the pyramid builders, when you can do that &quot;psychicly&quot; then I'll believe all the money wasted on &quot;psychics&quot; worth it. In the meantime, don't be fooled, question, and ask yourself as Randi does, &quot;so what!&quot;",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Randi's book gives you an excellent--and most importantly--a reliable account of the life and alleged prophecies of Michel de Nostradamus. This book is truly a gem. It was really fascinating to read of the many instances of utter credulity (and unfortunately instances of dishonesty) that so many believers and followers have had to resort to in order to hold onto this illusion of mystical prophetic fulfillment. Though Randi (correctly) debunks virtually every one of Nostradamus' allegedly fulfilled prophecies, I believe it serves Nostradamus' memory finer, and ourselves better, if we remember and commend him for what he was, rather than for what he was not. That is what Randi has done. Nostradamus was a fine man and a fine physician, but that's all, and that only.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "acts of resistance against the tyranny of the market",
        "description": "\"In his most explicitly political work to date, Pierre Bourdieu, speaks out against the dismantling of public welfare in the name of private enterprise and global competitiveness.\"--BOOK JACKET.Title Summary field provided by Blackwell North America, Inc. All Rights Reserved",
        "authors": "['Pierre Bourdieu']",
        "infoLink": "http://books.google.nl/books?id=7s5qQgAACAAJ&dq=Acts+of+Resistance:+Against+the+Tyranny+of+the+Market&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Having read Bourdieu's book, and then the comments here, I find the most revealing response is the one by Brad Delong. Indeed, Delong's comments are almost a textbook case of everything that's wrong with the neoliberal paradigm of economic rationalism that Bourdieu's book so powerfully decries. It's helpful, though, to take Delong's points one by one --- albeit in no particular order --- and contrast them with what Bourdieu actually says.First, the notion that &quot;Acts&quot; is a &quot;mosaic&quot; and, as such, omits &quot;large and important pieces of the picture&quot; (Delong later claims that Bourdieu's &quot;position&quot; is less than &quot;coherent&quot;). That the book is an incomplete &quot;mosaic&quot; is true enough, but the implication that this amounts to a flawed set of arguments is unsupported by Delong. Though some of Bourdieu's mini-essays and speeches appear occasionally to wander from his main thesis, in reality, of the sixteen items in this book, all but two are concerned, directly or indirectly, with Bourdieu's &quot;resistance&quot; to the ideas and policies subsumed under the doctrine of &quot;neoliberalism.&quot; In fact, it's all summed up in the second part of his title: &quot;Against the Tyranny of the Market.&quot;Neoliberalism is the most pervasive economic doctrine today bolstering the &quot;tyranny of the market&quot; in its advocacy of privatization, exportation of capital to foreign countries (for the exploitation of cheap resources and low-wage workers), the bailing out of Wall Street investors with middle-class tax money, and the removal of legal restraints upon capital which, along with depredations on the working class, allows corporations to pollute the environment with near impunity. It's almost laughable, in fact, to see Delong list among his &quot;credentials&quot; his former tutelage under Lawrence Summers, among whose famous statements are the following from 1991:&quot;I think the economic logic behind dumping a load of toxic waste in the lowest wage country is impeccable and we should face up to that.... I've always thought that underpopulated countries in Africa are vastly under polluted; their air quality is vastly inefficiently low compared to Los Angeles or Mexico City.&quot;Summers, of course, later defended these statements as &quot;ironic,&quot; but nearly everything else he's advocated proves the opposite.Ergo, it's hardly surprising that a fervent apostle of neoliberal economics like Delong should have problems with Bourdieu. He attempts an affable rejoinder, granting Bourdieu's &quot;excellent&quot; points, but this sort of amiability seems oddly similar to the kind of bonhomie extended at business conferences to token liberals like Jesse Jackson. In other words, it's easy to be amiable when you're one of the main beneficiaries of the doctrines being denounced, especially when there's no foreseeable danger that said doctrines will be supplanted by &quot;mere&quot; verbal renunciation.Delong's main points are two. First, after characterizing Bourdieu as a &quot;friend,&quot; then backtracking to an &quot;ally,&quot; he resigns himself ultimately to &quot;someone who would be [i.e., an ally or friend] if he pushed his analysis just a little bit deeper, and made his position a little more coherent.&quot;Actually, Bourdieu's position is about as &quot;coherent&quot; as one could hope for, especially given the varied circumstances under which these articles were written, and they are also as &quot;deep&quot; as anything spewed up by the neoliberal camp. But this &quot;position&quot; is more than a distrust of &quot;intellectuals&quot;: it's a critique of a particular form of &quot;mathematical&quot; rationalism appropriated by the economics profession which, in its provinciality, attempts to reduce policy to formulae, and to simultaneously divorce these mathematical calculations from social consequences. In other words, what Bourdieu is denouncing is a prevailing economic policy that takes place in a moral vacuum, perhaps best summed up by the famous claim of Milton Friedman that companies have no &quot;responsibility&quot; other than those to their shareholders for the maximization of profit. Starting from this major premise of economic isolationism, myriad evils follow.Delong's claim that Bourdieu needs to go &quot;deeper&quot; (implicitly, to see the error of his ways) is also a familiar tactic of right-wing sciolists. It's an easy tactic to see through, especially when the tactician fails to present any evidence to back himself up. If Delong has gone &quot;deeper&quot; than Bourdieu into these matters, the obvious questions is why he fails to share the benefit of his depth. An old trick, and here again former examples come to mind, like the one the media orchestrated in the mid-90's, when pollsters were claiming that people disliked the &quot;Contract With America&quot; until it was &quot;explained&quot; to them (we can pretty well guess who the &quot;explainers&quot; were), at which point they seemed magically converted to the church of Mammon.Delong's other point relates to Bourdieu's classification of representatives of the welfare state (presumably as nothing more than a &quot;trace&quot;). &quot;That the main business of the late-twentieth century state is social insurance is an important fact,&quot; counters Delong, in the process failing to note (1) that he's uttering a tautology, (2) that Bourdieu is not defending the welfare state against leftwingers, but against rightwingers, and (3) that Bourdieu's use of &quot;trace&quot; in this context is a commentary on the fact that in all the advanced industrial economies, the welfare state is, as a direct result of neoliberal policies, no more than a &quot;trace&quot; of what it was during the bulk of the post-war period.In other words, from what little I can see of Delong's &quot;intellectual position,&quot; he needs to go &quot;deeper&quot; into Bourdieu.",
                "review/helpfulness": "61/74",
                "num_reviews": 74
            },
            {
                "review/text": "Straight from the sociologist's mouth, as it were, this book is a little gem which demonstrates that Bourdieu - far from being the pessimistic unveiler of rigid social structure which works such as 'La Distinction' hint at - is, in fact, as 'hip', contemporary and aware of the possibilities for individual political action as Foucault or Chomsky. Anyone who has followed M. Bourdieu's political life in relation to his theories might have previously been suprised by this apparent incongruity, but I was delighted to find that this little book contains enough thoughtful application of theory to fan the flames of dissidence and keep alive the hopes for a more accountable, 'rational' society. Bourdieu is not always right (naturally) and he does have a clear sense of his own importance in the French intellectual field, but to be perfectly honest, when the speaker is this informed and capable a little leeway can be granted. An excellent book, very readable and up-to-date, but not - it is perhaps worth noting - any sort of introduction to Bourdieu's dense theories, more a treasure trove of his shoot-from-the-hip polemics.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "I wholeheartedly endorse Kesler's response to Delong's criticism of Bourdieu, to which I add the following observation: there is no mystery as to why Delong wants to make Bourdieu his \"hoped-for ally\". As Bourdieu writes, his role as an intellectual is to \"critique...the [false] representations continuously produced and propagated by the dominant groups and their lackeys in the media\" (pg. 66) in order to expose the restorative nature (ie laissez-faire economics) of the neoliberal agenda. On the other hand, it is the role of the neoliberal pseudo-intellectual to \"contribute to the maintenance of the symbolic order which is the condition of the functioning of the economic order\" (pg. 82).Knowing full well that \"a 'turncoat' activist does more harm than ten opponents\" (pg. 6), Delong would like nothing better than to coopt Bourdieu to further the neoliberal agenda.But of course Bourdieu will have none of that. Bourdieu's reasoned arguments for dignity and human rights in \"Acts of Resistance\" will necessarilly stand in the way of the \"accountant's view of the world\" (pg. 105) that Delong subscribes to.In a world where corporate media favors conservative views, it is refreshing to read Bourdieu's intelligent yet sometimes bare-knuckled defense of people and society. Understanding both the value of high human cultural achievement and the threat of unchecked greed, Bourdieu spares no quarters when exposing those who aim to fill their pockets at the expense of the greater good.\"Acts of Resistance\" will help fix your moral compass and remind you that, in the end, it is people that matter most. Highly recommended.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book is not for those who desire an in-depth account of Bourdieu's sociological theory, but it does offer an interesting series of observations of and provocative challenges to the way we perceive our own perceptions. Bourdieu attempts to explain and militate against a tendency to allow power to legitimate itself--exposing a dangerous habit of seeing the world of power economics as a natural state rather than the product of an incredibly (and at times, unconciously) manipulative ruling class. Reading &quot;Acts of Resistance&quot; helps one understand the machinations of our political, economic, and social leaders who tell us that their interest is &quot;our&quot; interest.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "While some high-minded dilettantes from Cambridge, Mass and elsewhere might reject this book because it does not directly reference the high priests of continental philosophy, it is in fact an incisive critique of the dominant political and economic fictions of our time. The author composed many of these pieces for workers' rallies and political events. This sort of principled activism is refreshing and sadly all too rare for most academics in this country, whose lives are often all too removed from the very real struggles Bourdieu so astutely analyzes. And to top it off, his commentaries are often quite witty -- who else would have the gumption to blame increasing numbers of traffic accidents on &quot;the scourge of neo-liberalism&quot;? Essential reading for anyone -- academic or not -- who is interested in developing a progressive understanding of politics today.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "yonder a place in montana adventure press",
        "description": "The acclaimed travel writer offers a compelling visual and written portrait of the great Western state, focusing the history of the Bar 20, the thirty-six-acre ranch he owns in Montana. Reprint. 15,000 first printing.",
        "authors": "['John Heminway']",
        "infoLink": "http://books.google.nl/books?id=ZMKiTfgXfH4C&dq=Yonder:+A+Place+in+Montana+(Adventure+Press)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "John Heminway's hippie-commune-turned-subdivision is an environmental and community tragedy, but he and his trust fund find it a paradise. This book is instructive for its unintentional exposition of the hypocrisy, condescension, and self-absorbtion that the super-rich bring to &quot;their&quot; Montana. But if you know anything about the state, it's truly painful to read.Not just in need of the most basic proofreader, the book contains dozens of factual errors. (I was particularly surprised that National Geographic would place the Missouri River in Fargo.) Not only does Heminway blandly repeat the same old stories, but in getting them wrong (not only does he botch the story of Charlie Russell's painting &quot;Waiting for a Chinook,&quot; he even inflates its alternate title from &quot;Last of the 5,000&quot; to &quot;Last of the 10,000&quot;) he does a tremendous disservice to anyone who would find this representative of Montana.Avoid this book! If you want to read about this region, read Mark Spragg's &quot;Where Rivers Change Direction&quot; -- not only a more accurate book, but a truly eloquent memoir.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I loved Yonder. It is the story of John Heminway's search to uncover the history of a ranch in a beautiful Montana valley. John and his sister, Hilary, bought the ranch soon after they had found it with the help of a knowledgeable agent. As Yonder unfolds I fell under its enchantment and could not put it down until I found out what John had discovered through his search for its past owners. However, Yonder is more than a paean to Montana as moving as Ivan Doig's This House of Sky or Rick Bass's Seven Mile Wolves. It is also the story of the author's search for peace and joy. This is heartfelt book should fascinate those who enjoy interesting people and unique places.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "&quot;Yonder&quot; (subtitled &quot;A Place in Montana&quot;) by John Hemingway is an untidy book, but one I still recommend to readers interested in the west. Hemingway is an expert on Africa, a producer of documentary films for PBS, a writer, and a Montana &quot;hobby rancher&quot;. Noel Perrin used the phrase &quot;hobby farmer&quot; to identify people who buy farms in Vermont in order to feel connected with the soil and the hardy Yankee yoemen who till it, but who continue to derive most of their income from some other source. The book relates Hemingway's experiences after he and members of his family purchase first a ranch in central Montana and then a 36-acre mountain retreat, named the Bar 20, north of Yellowstone Park. He interweaves events and observations from his own life in Montana with his search for information about the previous owners of the Bar 20.One of the pleasures of the book is Hemingway's gift for vivid word snapshots of people he encounters in Montana. His filmaker's eye rests briefly on organic rancher Tom Elliott, BLM archeologist Michael Kyte, outfitter Larry Lahren, horse whisperer Ray Hunt, ranch foreman Floyd Cowles, teepee manufacturer Don Ellis, and his motley neighbors in the Boulder River valley. The sketches are illuminations of ordinary lives rather than (a la Annie Proulx) a lepidopterological display of &quot;characters&quot;. The book's other strength is the mini-biography of Stanley and Bab Cox, easterners like Hemingway, who owned the Bar 20 from 1933 to 1951 and who, unlike Hemingway, resided there continuously except for the war years. Hemingway's determined and ingenious research has unearthed a story worthy of a novel.&quot;Yonder&quot;, published by the National Geographic Society Adventure Press, is the worst-edited book I have encountered in some time. It is rife with typos: missing quotation marks, uncapitalized proper names, &quot;souh&quot; for &quot;south&quot;, &quot;there's&quot; for &quot;theirs&quot;, &quot;Yate's&quot; for &quot;Yates'&quot;, &quot;shooting match&quot; for &quot;shouting match&quot;, and a missing negative that turns a sentence about organic farming into nonsense. It is also guilty of dubious or incorrect word usage. Examples: three sheets of paper become in the next paragraph three sheaves of paper; a hinged bookcase hiding a door is called &quot;trompe l'oeil&quot;. And what is one to make of this sentence? &quot;While grounds for abandoning a six-year-old child seem inconceivable, we can speculate he justified his decision because, perhaps, he felt rejected by the Hydes, who clearly had never warmed to a man they regarded as a diffident provider, husband, and father.&quot;Hemingway grafts a couple of self-contained essays (previously published articles?) onto the stalk of his narrative. They deal with native American activities in other parts of the state and artist Winold Reiss. These are interesting in their own right, but anti-climatictic after the drama of the Cox research.&quot;Yonder&quot; will save future owners of the Bar 20 the trouble of playing detective in order to find out what John Hemingway was doing and thinking during his days in Montana.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "sweet dreams irene",
        "description": "Irene Kelly is a reporter with a fierce integrity. Detective Frank Harriman is her lover and friend. Now they're both about to be plunged into political hellfire when a ruthless politician rocks a race for district attorney with a stunning allegation: his opponent's son is in the clutches of a satanic cult. The charge takes a fatal turn when a local woman is brutally murdered, and the grisly crime scene bears unholy implications. Tracking the clues takes Irene behind the closed doors of an isolated home for troubled youths, where obscuring the truth is only part of a stranger's diabolic game. To win it, Irene will have the devil to pay.",
        "authors": "['Jan Burke']",
        "infoLink": "https://play.google.com/store/books/details?id=tNXhux8ZXOgC&source=gbs_api",
        "review": [
            {
                "review/text": "This is the second &quot;Irene Kelly&quot; from Jan Burke, who eventually went on to win an Edgar award for &quot;Bones&quot;. Kelly began life in &quot;Goodnight, Irene&quot; as a reporter in the city of &quot;Las Piernas&quot; (&quot;The Legs&quot;) on the coast south of Los Angeles. Kelly is the most assault prone reporter in the world leaving out Colombia and Chechniya. We have a newscaster in Chicago named Russ Ewing who has become the guy that accused killers call up to turn themselves in to so the police don't kill them. He has had something like 50 or 70 accused killers turn themselves in to him and hasn't been wounded once, yet Irene sustains more injuries than James Garner did in &quot;The Rockford Files&quot;. Go figure.Anyway, I wrote an Amazon review of &quot;Goodnight, Irene&quot; in which I identified many &quot;beginners' faults&quot; of detective writing. The good news is that &quot;Sweet Dreams&quot; corrects many of these faults and is thus a significant improvement over her first volume. I will take credit for this myself when I figure out how she read my review in 1993.To begin with, the plot, which involves real or imagined Satanist activity at election time, is a lot more original and better designed than in her first work. Irene has stopped riding around in the cop car with her beau Frank all the time, which was an improbable feature of &quot;Goodnight.&quot; She does more actual detection here than there. She tosses the blood around with less slapdash abandon in this book, although there's still room for improvement. For example, when a bloody human heart turns up, it doesn't get the attention that it really should, you know? The police test it to confirm that it's really human blood, but there doesn't seem to be much interest in WHOSE heart it is, etc., particularly considering that they should be able to make the same guess that the reader does.One carry-over from the first book is that Irene is still prone to falling into stupid traps, as Frank points out:&quot;Why the hell did you go out to that field that night?&quot;&quot;I've asked myself that question many times.&quot;&quot;I just don't understand it. You're smart. But I swear to God, Irene, sometimes you do something so...&quot;&quot;Stupid,&quot; I finished quietly.Well, *sigh* knowing you have a problem is the first step. Also, I have to say that the action flags a bit about three quarters of the way through, and after that there is some Penguin's Folly stuff. I just now invented that term. &quot;Penguin's Folly&quot; is from the 1960's Batman TV series, which was on for two half-hour segments per week. At the end of the Tuesday night segment, the Penguin (or whoever) would tie Batman and Robin to a death machine, and then RUN OFF AND LEAVE THEM UNATTENDED. Every time. And then at the beginning of the Thursday night segment, Batman and Robin would get out of it. Hence the term, &quot;Penguin's Folly.&quot;I also have to say that Kelly is not nearly so well-described or deep a character as she could be; she doesn't seem to have much in the way of higher interests, other than reporting, Frank's body, and staying alive. This has something to do with the breakneck style that Burke is using in these early volumes (she may change later), where you have not much chance to catch your breath, and the text is full of elaborate &quot;detective story style&quot; metaphors the way a box of Ghirardelli's chocolates is full of grams of fat.So there's still room for improvement in this volume, but the learning curve from &quot;Goodnight, Irene&quot; to this one is encouraging, and in fact her third volume, &quot;Dear Irene&quot;, is better yet.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Usually 2nd books by an author aren't quite as good as the 1st. I was happy to finish Sweet Dreams Irene just as happy as I was when I finished Goodnight Irene. Jan Burke has a way of giving her characters such interesting lives. Irene is a person most readers want to be. Her life is interesting and Frank makes her complete. The plot with the election,covens, and murders is as fun to read as most people would want. I'm sorry I waited so long to hear about Irene and I plan on reading more!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This one is miles ahead of &quot;Goodnight Irene,&quot; though I liked that one as well. It's just that the author has matured somewhat and so has the style. At any rate, &quot;Sweet Dreams&quot; is another in the &quot;Irene&quot; series and well worth the time and money you invest in it. Highly recommended--it's a fun read.Also recommended: Bark of the Dogwood by McCrae and The Da Vinci Code by Brown",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The annoying thing here is after being introduced to most of the cast in GOODNIGHT IRENE, several of their personalities seem to have completely changed as of this book (taking place several months later). Irene, still back at the newspaper, is covering the local election for District Attorney, and thanks to her involvement with homicide cop Frank, banned from crime stories. The son of one of the DA candidates comes to her, explaining that he is going to be accused by the other candidate of being a Satanist, by way of a photo of a group of Satan worshipers, and wants to tell his side of the story. Frank's elderly next door neighbor is murdered, the killer(s) leave satanic symbols at the scene. Irene suspects the symbols are meant to throw people off, although for a reporter she does very little research on Satanism and Wicca (what the group in the \"satanic photo\" claim to be) other than going to the local pagan shop and asking a couple questions of the owner. (ok maybe I am being biased here because I know a lot about Wicca, and some of the people who gravitate toward it). As in the first book Irene suffers from a total lack of foresight to call Frank or any of the other cops involved and share information, and this gets her into greater trouble. I am constantly frustrated by writers who use this \"give the reader everything but don't let the different characters share with each other\" method, and I just spend half the book screaming \"just call someone and tell them what you know and the murderer will be easy to spot\". I plan to continue reading the series, although I am currently not sure if this is because I hope it will get better, or because I am punishing myself.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "hawthornes short stories",
        "description": "Presents a selection of twenty four of the author's most notable short stories, including \"Young Goodman Brown,\" \"Rappacini's daughter,\" and \"The birthmark.\"",
        "authors": "['Nathaniel Hawthorne']",
        "infoLink": "http://books.google.com/books?id=58dvDwAAQBAJ&dq=Hawthorne%27s+Short+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In your face, obvious, and heavy-handedly allegorical, still Hawthorne manages to pique my interest and hammer home his point. Switching from historically based stories (&quot;The Gray Champion&quot; and &quot;Endicott and the Red Cross&quot;) to spiritual allegories (&quot;The Bosom Serpent&quot; and &quot;The Celestial Railroad&quot;), Hawthorne continually chips away at the danger of isolation. Although he clearly believed in the fallibility and evil of the human heart--particularly pointing out the religious hypocrites--he also believed that one must continue to risk and be a part of the community. In stories such as &quot;Young Goodman Brown&quot; and &quot;Wakefield&quot;, we see the gloom that comes over certain men who pull away.Hawthorne, like Poe, uses graphic and surreal imagery, sometimes repetitively, to set a mood and draw a picture. His characters and scenes are alive and psychological consistent with his tales, and he manages to wring a moral out of nearly every page.Heavy-handed? Yes, but he aims to state a message, and he states it clearly: The moral nature must never be sacrificed for intellectual pursuits (Ethan Brand). In a world of cheap commercialism and mindless brain fodder, at least Hawthorne has something to say.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Like most of us, Hawthorne was hot and cold. He is responsible for a few of the best American short stories, and a few of the very worst. But the bad ones - read &quot;The Bosom Serpent&quot; carefully, for example - are hilariously bad!",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "It's easy for our contemporaries to accuse Hawthorne of being formulaic or using timeworn themes. It must be remembered that in Hawthorne's own day, the many of the &quot;timeworn&quot; ideas represented a truly novel vision, and it was appropriate to use many different stories to convey its fullness. Just remember, if you think it's a &quot;cliche,&quot; it's probably because you've read a lot of post-Hawthorne &quot;wannabes&quot;!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "pink tanks and velvet hangovers",
        "description": "Lytle's travel book takes place in the months following the fall of the repressive Socialist government in Czechoslovakia. Lytle documents the first shaky steps to democracy and capitalism. He writes of the awkwardness and slights of a country in transition, the sights, smells, and incredible beauty he witnesses, and of a people and a government on the cusp of massive change.",
        "authors": "['Douglas Lytle']",
        "infoLink": "http://books.google.com/books?id=m8v9HAAACAAJ&dq=Pink+Tanks+and+Velvet+Hangovers&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I lived in CZ for four years (outside of Prague, a mysterious wilderness to this writer), where a lot of Americans have aspirations to write. Horribly enough, this book was the &quot;first&quot; to describe that whole Prague scene. I say horribly, because this book is likable -- but the narrator does nothing unusual, thinks nothing daring -- he more or less transcribes banal journal entries into a long artless book. I could go on about the amatuerish writing style (a good editor would have cut the book to about the length of a Lonely Planet review) -- or about the lazy typesetting (full of typos), and the benefit a little fact checking would've had (it's &quot;Havlova&quot; not &quot;Havelova&quot;, &quot;vul&quot; is &quot;ox&quot; not &quot;bull&quot;, and so on....). It seems this book is the kind that would make a mother proud, but would be met with sneers and jeers by all other &quot;expats.&quot; A lot of them held off writing this kind of book because they were waiting to synthesize and compose artfully from their Czech experience. What we have here, for all its description, is a &quot;nice&quot; American doing &quot;exciting&quot; things in a foreign country. I thought it was hard to get travel writing published, but now I see it doesn't take a hell of a lot of work. The author does nothing original, thinks no original thoughts, and pretty much stole the fire from anyone else who might put out a &quot;real&quot; chronicle of the Prague experience. Too bad.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The first reviewer got it right -- this is an artless and boring book. It totally fails to capture the excitement of the time it's purported to cover -- and contains a great many inaccuracies. The first &quot;half&quot; (I think it's actually less than half) of the book consists of entries from the author's own journal, which he obviously stopped keeping after a very brief period. The second part of the book picks up, chronologically, where the author's meagerly journal left off -- by summarizing the news and events of the period -- in rapid succession and without background information, personal or otherwise. As the author had ceased to keep his journal, this part of the book is sourced from archival stories from the Prague Post. Whether it is from that newspaper or from the author's own misperceptions that the numerous factual errors arise, it makes for a boring and inaccurate read overall.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    }
]