[
    {
        "Title": "autocad 2000 manual completo del usuario con cdrom manuales users en espanol spanish pc users la computacion que entienden todos spanish edition",
        "description": "Inleiding in het programmeren, bestemd voor programmeurs.",
        "authors": "['Niklaus Wirth', 'J. de Bruyn']",
        "infoLink": "http://books.google.nl/books?id=lafkAAAACAAJ&dq=AutoCAD+2000+Manual+completo+del+Usuario+con+CD-ROM:+Manuales+Users,+en+Espanol+/+Spanish+(PC+Users%3B+La+Computacion+Que+Entienden+Todos)+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Es un buen libro, tanto para principiantes como para usuarios avanzados, como yo, que lo utilizo continuamente como manual de consulta.Ademas hice el curso on-line de la Facultad de Arquitectura de la Universidad de Buenos Aires, que dirige Sorhanet y esta basado en este libro.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "El libro es bueno, porque, los coamandos estan en espa&ntilde;ol e ingles, asi que cualquiera que sea el idioma, ingles o espa&ntilde;ol, es muy utiL, tiene muchoes ejemplos, y es de bastante ayuda!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "la hojarasca spanish edition",
        "description": "Translated from the Spanish by Gregory Rabassa",
        "authors": "['Gabriel Garcia Marquez']",
        "infoLink": "http://books.google.com/books?id=dIvz8De4aXoC&dq=La+hojarasca+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "La Hojarasca es una historia que corre a la par con Cien A&ntilde;os de Soledad, se situa tambien en el m&aacute;gico Macondo aunque la familia Buendia no es la protagonista: es el pueblo en si. La hojarasca es como el fin de el orden establecido en Macondo. El libro es corto y muy sencillo para leer, adem&aacute;s tiene un peculiar estilo: tres personas narran la historia, el ni&ntilde;o, el Coronel e Isabel en tiempos paralelos. Es interesante y bien recomendado.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "Este libro expresa la preocupacion de Marquez: la soledad. La novela es contada por tres personajes - Isabel, su papa, y su hijo. El autor hace esto para darnos tres punto de vista de tres personajes de diferente edades- un ni&ntilde;o,una adulta, y un se&ntilde;or mayor, de lo que esta pasando.",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "En La Hojarasca (la primera novela de don Gabo), se destaca su habilidad innata de escribir. Las primeras respiraciones de Macondo como protagonista, la originalidad de su tecnica narrativa y la elocuencia de su sintaxis, visibles en sus futuras obras, nacen de esta. Fue un placer (al fin) leer la novela que es la cuna de \"Cronica\", \"Cien Anios\", \"El Coronel\", etc.Ciertos aspectos a cultura de Latinoamerica (el resentimiento, la aceptacion de lo socialmente correcto, etc) se conocen aqui por primera vez a traves de los ojos de Macondo de GGM.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "La Hojarasca, primera novela de Garc&iacute;a M&aacute;rquez, muestra el inicio y fundaci&oacute;n de lo que ser&iacute;a luego el pueblo de Macondo. Es una excelente obra para introducirse a la literatura de Garc&iacute;a M&aacute;rquez. La novela es sencilla, pero de riqueza literaria. En la misma se presenta la historia de un muerto, el m&eacute;dico, desde la perspectiva de tres personas. El desarrollo de las diferentes perspectivas se dan en un mismo tiempo y espacio.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la eyaculacin precoz cmo reconocerla tratarla y superarla",
        "description": "La eyaculacion precoz es una disfuncion sexual relativamente frecuente y extraordinariamente destructiva de las relaciones de pareja. Sus causas -solo en contados casos de indole fisiologica- son de caracter psicologico: familias problematicas, mensajes confusos sobre la sexualidad en la infancia, dificultades con la pareja..., que en casi ningun caso implican trastornos de la personalidad. Para los hombres que padecen esta disfuncion, este libro es una buena noticia: la eyaculacion precoz es facilmente curable en un noventa por ciento de los casos; ademas, uno mismo puede ser su propio terapeuta; para ello debe lograr una percepcion detallada de sus sensaciones sexuales, a traves de una serie de tecnicas que este libro explica e ilustra.",
        "authors": "['Helen S. Kaplan']",
        "infoLink": "http://books.google.com/books?id=01wNRCiDeNgC&dq=La+eyaculacin+precoz+:+cmo+reconocerla,+tratarla+y+superarla&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Este libro es maravilloso, sobretodo para los hombres con problemas en su eyaculacion. Es esta una de las disfunciones sexuales mas comunes en los hombres...pero una de las mas faciles de corregir. Claro, preciso, lleno de ejercicios guiados a lograr convertirlo a usted en el due&ntilde;o de su respuesta sexual, en su propio terapeuta. Le aseguro que si ese es su problema, encontro la solucion.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "tengo un problema con la eyaculacion precoz, quisiera obtener el libro de helen s kaplan, pero por otra via que no sea tarjeta de credito",
                "review/helpfulness": "25/30",
                "num_reviews": 30
            },
            {
                "review/text": "Hola, la verdad, estoy increiblemente interesado en este tema y me gustaria optener mas informacion sobre este libro, Me ustaria saber de que forma ustedes podrian facilitarme aunque sea un demo de este, aunque sea limitado...Gracias",
                "review/helpfulness": "26/29",
                "num_reviews": 29
            },
            {
                "review/text": "como conseguir este libre de kaplan en espanol solo tengo para enviar con mony orden por favor me pueden ayudar gracias",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "el evangelio segn jesucristo spanish edition",
        "description": "Focuses on the implications and central truth of the Gospel: Jesus is Lord and Savior.",
        "authors": "['John F. MacArthur, Jr.']",
        "infoLink": "http://books.google.com/books?id=UrPluHZ15I8C&dq=El+Evangelio+segn+Jesucristo+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Un d&iacute;a estaba caminando el escritor portugu&eacute;s por una calle, creo que de Sevilla, cuando al pasar por enfrente de un quiosco le pareci&oacute; ver un curioso libro titulado: El Evangelio seg&uacute;n Jesucristo, sigui&oacute; caminando con el libro en la cabeza, al no poder quit&aacute;rselo decidi&oacute; regresar para comprar el libro, pero ya no estaba, o quiz&aacute;s nunca lo estuvo. Suficiente se&ntilde;al para Saramago para decidir que ese libro necesitaba ser escrito, y as&iacute; lo hizo. El resultado, El Evangelio seg&uacute;n Jesucristo, levant&oacute; enormes controversias en el mundo cristiano, y el elogio universal de la crit&iacute;ca especializada.10 a&ntilde;os despu&eacute;s, cae este libro en manos de esta humilde venezolana, quien no puede evitar maravillarse y espantarse por esta lectura. El libro no deber&iacute;a titularse El Evangelio seg&uacute;n Jesucristo, sino seg&uacute;n Saramago, porque el gran protagonista de la obra, y sobre quien pesa todo el dilema moral de la culpabilidad, es el carpintero Jos&eacute;. La vida de Jes&uacute;s adulto ocupa menos de la mitad del libro, y se revuelve alrededor de la culpabilidad heredada de su padre por haber permitido la matanza de los inocentes en Bel&eacute;n. La prosa de Saramago es impecable y llena de humor, la impostaci&oacute;n de problemasen la prehistoria cristiana que podemos pensar como contempor&aacute;neos como crisis existenciales, ataques de p&aacute;nico, es realmente genial. La novela puede resultar a momentos demasiado irreverente para aquellos que a pesar de no ser cristianos practicantes, hemos nacido y hemos sido criados como cat&oacute;licos. Nuestra religi&oacute;n y la de nuestros ancestros es puesta en rid&iacute;culo.Todo sea por amor a la literatura.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "espero que este comentario salga, el libro es perturbador y emocionante, es una perspectiva diferente de lo que pudo haber sucedido, claro que en cosas de la historia original tendremos que atenernos a hacer conjeturas basadas en la biblia, ya que nadie mas narro esa historia y si asi fue, fue desde un punto de vista muy diferente. el libro se deja leer, es ameno y entretenido, esta muy bien escrito y la historia de saramago, se sustenta muy bien.luis mendez",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Jose Saramago, en este libro nos brinda una muestra de su perspectiva humana y cuestionadora de todos los aspecto cotidianos y humanamente posibles en la vida de un personaje humano, con todas las caracteristicas del hombre del carne y hueso: Dubitativo, Interrogante, Contradictorio y Desobediente que pudo haber sido Jesus. Simplemente trata de una forma facil y sencilla de capturar el mundo de Jesus desde un pustode vista humano. No creo que contradiga en nada al evangelio biblico que conocemos, solo es una revuelta de ideas hacerca de lo que pudo ser la vida cotidiana del hombre mas notable y polemico de nuestra historia. Muy buena imaginacion.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Brillante novela historica! Nos sirve para cuestionar a la iglesia y ver otro punto de vista de los hechos (que en realidad nadie sabe cuales fueron).",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Otra forma de leer sobre el Jes&uacute;s como Hombre y sus relaciones con la familia y otros aspectos de su vida, nos ubica en una situaci&oacute;n diferente tanto de la Iglesia Cat&oacute;lica como de La Ultima Tentaci&oacute;n del autor Griego Nikos Kazantzakis. Siempre que sale una historia de Jes&uacute;s se presta a nuevas interpretaciones de lo que pudo haber sucedido desde el punto de vista Hist&oacute;rico. Tal vez solo las bibliotecas del Vaticano tengan un poco mas de la verdad. De todas formas narrativamente esta novela es excelente! .",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Una gran visi&oacute;n de la vida de uno de los hombres m&aacute;s importantes en la historia de la huminidad. Un relato que describe una vida cargada de contradicciones, miedos y dudas. Importante es la descripci&oacute;n del manejo de la culpa que, ya desde ese momento, hace la religi&oacute;n, para manipular m&aacute;s facilmente las voluntades de los hombres. Gran descripci&oacute;n del rol de mujeres y hombres en aquellos tiempos. Desmistificaci&oacute;n de la religi&oacute;n y de Jes&uacute;s, lo cual lo hace ver m&aacute;s humano y alcanzable. Un giro del porque de tantas matanzas en nombre de Dios y lo inseparable que es el bien del mal. Lo mejor: el di&aacute;logo que establecen Dios, Jes&uacute;s y Pastor.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "este libro, es perturbador, pero asi deben ser los libros escritos cuandon buscan indagar un tema hasta el fondo y en este caso el autor aunque fantasea a veces, nos presenta lo que podria haber pasado a grandes rasgos en la vida de jesus de la cual tenemos poca informacion a no ser la que esta en la biblia que lo muestra sin cara o rostro, desprovisto de descripcion corporal, y con solo unos anos de su vida al descubierto. esta novela, nos muestra a jesus sintiendo miedo, dudas, en incluso en conflicto con sus hermanos, enganado por dios y por el diablo que rigen nuestros destinos y nos tienen como marionetas de su juego, cada uno necesitando del otro para poder subsistir. es un buen libro, aunque no se como lo tomara la comunidad cristiana, no es para nada blasfemo. muestra a un hombre como saramago, usando hasta el limite su libre albedrio para hayar las respuestas o si no al menos para indagar hasta el fondo de ellas. es un libro escrito en una bella prosa, imitacion de la biblia y del lenguaje poetico, un poco barroco a veces, pero siempre amena e interesanteLUIS MENDEZ",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Una perspectiva distinta de la vida de Jesus de Nazareth; una historia que pone a pensar a cualquiera que la lea, a preguntarse si esto o aquello de lo que dice Saramago pudo o no ser de esa manera.Excelente! ...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "libere su autoestima spanish edition",
        "description": "\"The revolutionary program by the founder of the world's most famous mind control course\"--Cover.",
        "authors": "['Jose Silva', 'Philip Miele']",
        "infoLink": "http://books.google.com/books?id=uv4yJaJBOKoC&dq=Libere+su+Autoestima!+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "en este libro que es cierto lo que dice respecto a que nuestra AUTOESTIMA EST&Aacute; SEPULTADA bajo muchas capas de timidez, temor a la agresi&oacute;n y a la soberbia, modestia mal entendida y muchos obst&aacute;culos m&aacute;s...Lo importante es aprender a libeararla de esas ataduras! Comprender y aceptar que somos la &uacute;nica persona con quien seguramente viviremos siempre y hasta la hora de la muerte..y que no es justo tener a esa persona nuestra en tan baja estima...Este libro hizo por mi lo que no pudieron hacer tres terapeutas: ME DEVOLVI&Oacute; MI AUTOESTIMA...!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "S&Oacute;LO DEJARLA SALIR Y VOLAR LIBREMENTE !Qu&eacute; libro tan precioso y tan acertado: Si no nos estimamos a nosotros mismos...&iquest;Qui&eacute;n nos va a estimar?Y no hay que trabajar mucho:Este libro da pautas muy sencillas para dejar que aflore nuestra estima por nosotros mismos.&iexcl;L&eacute;alo y ver&aacute; !",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "ENTRE EL INVENTARIO DE MI VIDA NO HABIA AUTOESTIMA...Pilar Yeres, la autora de esta obra, me ayudo a encntrarla y dejarla volar",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "SUPERACION MAS INTELIGENTES Y ACERTADOS QUE HAY EN ESPA&Ntilde;OL !NO solo se trata de que mejores tu autoestima, SINO DE QUE LA DEJES LIBRE, FLUIR Y PROYECTARSE EN LOS DEM&Aacute;S !!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "ESTE LIBRO LIBERA TU AUTOESTIMA QUE A VECES, POR MUCHOS A&Ntilde;OS, TENEMOS ENTERRADA O BAJO SIETE LLAVES !",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "en esto creo seix barral biblioteca breve spanish edition",
        "description": "Een prachtige roman waarin een vrouw terugblikt op het tumultueuze leven van haar ouders en hoe dat haar gevormd heeft. Open hart is gebaseerd op een familieverhaal. Het verhaal van Elvira's vader, over hoe hij als negenjarige jongen in de naoorlogse jaren door zijn moeder naar een kille en gewelddadige tante in Madrid werd gestuurd. Uiteindelijk vindt hij bij andere familieleden een warm welkom, maar hij hield er een pathologische angst voor eenzaamheid aan over. Die ervaring vormde de gepassioneerde maar verwoestende liefde tussen hem en Elvira's moeder en ook zijn vaderschap. Elvira Lindo vertelt eerlijk en vanuit het hart over hoe zij als dochter terugblikt op haar jeugd en probeert te begrijpen wat haar gevormd heeft.",
        "authors": "['Elvira Lindo']",
        "infoLink": "https://play.google.com/store/books/details?id=Zq1QEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Un ensayo en datos personales del autor llendose con orden alfabetico estricto, muy aleccionador y detallista de su vida, creencias, experiencias y etc'sLo mismo, si uno es lector de Fuentes te sientes como que estan en una rica conversacion tu y el autor",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "De esta manera termina este maravilloso libro del Sr. Fuentes, en el que nos acompa&ntilde;ar&aacute; en un viaje que empieza con \"Amistad\", y termina con \"Zurich\".Cada cap&iacute;tulo deshoja el pensamiento de uno de los mejores escritores en lengua hispana vivos, no s&oacute;lo acerca de cuestiones literarias (\"Balzac\", \"Faulkner\", \"Odisea\", \"Kafka\", \"Quijote\"), sino tambien filos&oacute;ficas (\"Amor\", \"Belleza\", \"Libertad\", \"Dios\"), sociales (\"Educaci&oacute;n\", \"Globalizaci&oacute;n\", \"Xenofobia\") y pol&iacute;ticas (\"Izquierda\", \"Revoluci&oacute;n\").Carlos Fuentes es, como todo ser humano, producto de su circunstancia, en este caso hispanoamericana, hija de los a&ntilde;os veinte y viajante. Como tal, se puede estar o no de acuerdo con sus ideas, pero inevitablemente admiraremos su elegancia de palabra y pensamiento, y la profundidad de su erudici&oacute;n.Probablemente no haya mejor obra que nos ayude a entender al escritor mexicano, tanto c&oacute;mo escritor, como persona.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Escrito por uno de los grandes nombres de la letra Hispanica, Carlos Fuentes nos lleva por un viaje de sus creencias. El modo es simplemente comenzar con la letra A y terminar con el Z del alfabeto. Tengo este libro en Espanol y Ingles y es interesante leer una letra en las dos idiomas a el mismo tiempo. Tengo que decir que si se pierde algo en algunos occasiones cuando esta en Ingles. Carlos Fuentes puede opinar y escribir sobre muchas temas pero siempre muchas cosas tienen una coneccion con la lectura, posiblemente porque el es un gran lector. Su favoritos incluye Don Quijote, (quien Fuentes dice es un lector tambien)y Cervantes, Faulkner(yo soy colectivo contra las fuerzas de la seperacion), Ortega y Gasset, Julieta Campos y Shakespeare entre otros. Pero tambien Fuentes utilize otras formas de arte como el pintor Velasquez entre otras temas. Pero el limite de ideas no para con estos grandes de lectura y arte porque tambien hay capitulos sobre los grandes de otros artes como Balzac, Bunuel, Kafka y Faulkner . Este libro es facil para leer y si vale la pena por que las ideas que presenta el maestro Fuentes te lleva en una viaje por todo el mundo explorando varios conceptos y gran personajes de la historia humano. Si te gusta Carlos Fuentes es necessario leer este libro para mejor entender el hombre y sus gran novelas y historias.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "el libro completo de magia hechizos y ceremonias spanish edition",
        "description": "Offers comprehensive coverage of the history of magic rituals and practices throughout the world, presenting information on voodoo, ancient Egyptian and Hebrew magic, palm reading, secret symbols, astrology, exorcism and spells to overcome enemies and obtain wealth",
        "authors": "['Migene González-Wippler']",
        "infoLink": "http://books.google.com/books?id=rRUTkulWOAYC&dq=El+Libro+Completo+de+Magia,+Hechizos+y+Ceremonias+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Una gran obra de nuevo por Migene Gonzales Wippler!!!este libro como dice el autor Ray Buckland se devio llamar, Todo lo que quiere saber sobre magia pero que no se anima a preguntar, bueno como referencias, rico en rituales, y abarca casi todo, desde la introduccion de magia ceremonial religiosa etc.un maravilloso libro que explica todo su contenido desde las introducciones hasta los ejersicios, no dudo en recomendarlo!Todo lo que quieres saber sobre ocultismo y mas esta en el!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Es un libro muy bueno con explicaciones amplias de lo que es la magia y su historia, tiene varios ejercicios a realizar, pero lo malo es que no muestra muchas recetas solo unas cuantas.Pero ahun lo peor es que en la parte donde explica los ritos de Mexico (pag.355) comete un error y es que dice lo siguiente:\"En 1847 veintidos mil prisioneros de guerra fueron sacrificados a lo largo de 4 dias de dedicacion al templo de Huitzilopochtli.Esta fecha de 1847 es un error porque el imperio azteca cayo en 1521 y la independencia Mexicana fue en 1810.Y esa leyenda de los 22,000 prisioneros fue contada por Hernan Cortes y que ahun no se constata si fue real o no; pues se cree que era una historia que le conto Moctezuma a el, y que este despues a su vez, la conto como un hecho que el habia presenciado pero para justificar su crueldad y las matanzas innecesarias que ejercio contra los Aztecas.El otro punto es que dice que la magia Mexicana se divide en 3 roja, blanca y negra; y que la blanca es para maldecir segundo error!Yo como investigador de la magia Mexicana estoy en desacuerdo con eso.Y por lo anterior de los errores que encontre en cuanto a lo que se refiere a la magia Mexicana y hasta en su historia, no quiero ni pensar que el autor pudo haber cometido el mismo error con las demas culturas que aparecen en el libro.Por eso yo recomiendo este libro unicamente como una guia muy generalizada pero no 100% fiable.Me parecen mejor sus anteriores libros como \"LUNA,LUNA\" y \"LA MAGIA Y TU\"Pero este libro me decepciono algo.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "quin se ha llevado mi queso como adaptarnos a un mundo en constant cambio en el trabajo y en la vida privada spanish edition",
        "description": "Four little friends in a maze find and enjoy some cheese, but when the cheese is gone, only Sniff and Scurry adapt and go searching for more while Hem and Haw wait for more cheese to appear. Includes a note to parents and discussion questions.",
        "authors": "['Spencer Johnson']",
        "infoLink": "http://books.google.com/books?id=YenNuQEACAAJ&dq=Quin+se+ha+llevado+mi+queso%3F+Como+Adaptarnos+a+un+Mundo+en+Constant+Cambio+en+el+trabajo+y+en+la+vida+privada+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Este es un excelente libro para todos nosotros que vivimos en una sociedad de tantos cambios como esta. Pero lo mas importante es que nos ayuda a todos a enfrentar cualquier etapa de cambios en nuestras vidas en todas areas.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Este peque&ntilde;o gran libro est&aacute; excelentemente bien escrito, en una forma clara y sencilla. Con una corta historia de cuatro personajes el autor nos presenta la problem&aacute;tica actual de las empresas familiares y no familiares: hay que planificar y adaptarse al cambio sin miedo.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Necesitamos actuar r&aacute;pido antes los cambios y quizas antes que estos sucedan....no tengas miedo....si necesitas inspiraci&oacute;n lee este libro de inmediato, te aseguro que te gustar&aacute; y te har&aacute; reflexionar.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Hace una buena comparaci&oacute;n a manera de fabula entre dos hombres y dos ratones, donde se presentan situaciones que vemos diariamente en el trabajo, en la universidad o en la casa con los familiares de uno. Es buen libro, pero muy corto, se podia haber extendido un poco mas!!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Quizas ha sido el libro que m&aacute;s r&aacute;pido he leido y el que m&aacute;s me ha afectado mi vida, me ha ense&ntilde;ado que debo hacer cuando las cosas cambian... todo el que necesite saber que hacer ante los cambios debe leer este libro. Lo recomiendo ampliamente",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "caracol beach punto de lectura spanish edition",
        "description": "Haunted by violent visions, a Cuban veteran of the Angolan war, the sole survivor of an ambush that killed the rest of his platoon, finds himself unable to take his own life and sets out to find someone who will pull the trigger for him. 15,000 first printing.",
        "authors": "['Eliseo Alberto']",
        "infoLink": "http://books.google.com/books?id=F5ddAAAAMAAJ&dq=Caracol+Beach+(Punto+de+Lectura)+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Desde que supe que Eliseo Alberto, el autor de Informe contra mi mismo y La eternidad por fin comienza un lunes, habia ganado el Premio Alfaguara, corri a buscar su libro. Y no me defraudo. Nunca me defrauda este autor. Su mirada es profunda, su universo es rico, su manera de narrar los hechos mas cotidianos como si fueron trascendentales hace que la lectura sea realmente un disfrute total. Es un autor con garra, con matices, con una voz muy propia.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "GANADOR DE UN PREMIO, ESTE LIBRO ES EXCELENTE POR SU TRATAMIENTO DE VARIOS TEMAS QUE SOM PERMNES Y QUE SON DE ACTUALIDAD, LA LOCURA, LA HOMOSEXUALIDAD, EL AMOR , EL DESAMOR, LA GUERRA, LA MUERTE , LA VIDA, EL INFORTUNIO, TODO SE UNE PARA FORMAR UNA TRAGEDIA DE UN SOLO DIA, PERO QUE TIENE SUS RAICES MUCHOS ANOS ATRAS. ESTE LIBRO TAMBIEN TIENE SUS MOMENTOS DIVERTIDOS ( QUIEN HA DICHO QUE NO DEBE HABER HUMOR EN LA TRAGEDIA). EL INFORTUNIO QUE CAE SOBRE LOS PROTAGONISTAS ESTA LLENO DE FATALISMO Y CASUALIDADES, QUE HUBIERAN HECHO LA DIFERENCIA SI NO HUBIESEN PASASDO, PERO LA VIDA ES ASI , NO LA PODEMOS CAMBIAR Y TENEMOS QUE ACEPTARLA Y VIVIR CON NUESTROS ERRORES POR EL RESTO DE LA VIDA. FACILITO, AUNQUE HAYA MOSCARDONES QUE NOS NUBLEN LA VISTA Y TIGUERES DE BENGALA QUE INVADAN NUESTRO SUENO, DEBEMOS SEGUIR ADELANTE Y NO DEJARNOS DOMINAR POR LA CAMISA DE FUERZA QUE ES EL MIEDO, SIEMPRE AMANDO A ALGUIEN , YA QUE NO AMAR A NADIE ES UNA INMORALIDAD. ES UN LIBRO EXCELENTE. SE LO RECOMIENDO A TODOS LOS QUE QUIERAN UNA TRAGEDIA MODERNA CON SABOR A CIUDAD.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "El manejo del absurdo en la novela es un arte bastante delicado pues se puede convertir en rid&iacute;culo o tonto con solo peque&ntilde;os errores. Estos est&aacute;n completamente ausentes en esta novela, en la cual la locura se explica a si misma a trav&eacute;s de millones de peque&ntilde;os sub cuentos que el autor logra enlazar una historia coherente, donde un cubano ex-veterano de la guerra de Angola en su desespero por escapar de un tigre alado imaginario ( o tal vez no) que lo persigue secuestra un grupo de muchachos que lo &uacute;nico que quer&iacute;an era un poco de sexo en su noche de graduaci&oacute;n del colegio. Sin embargo esta trama es solo incidental para que el autor nos pueda presentar como en un mundo incoherente la &quot;locura&quot; es un medio tal v&aacute;lido para darle sentido como cualquier otro.La novela es simplemente genial.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la transformacin total de su dinero spanish edition",
        "description": "Provides over a hundred \"rules\" about how to create wealth and make it grow, including saving, spending, investing, and enjoying money.",
        "authors": "['Richard Templar']",
        "infoLink": "http://books.google.com/books?id=_YShVxBBmpkC&dq=La+transformacin+total+de+su+dinero+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Lei la version en Ingles de este libro y me gusto tanto que compre una copia en espanol para mi familia en mi pais. Este libro no te da una formula magica para obtener exito financiero sino que te recuerda los conceptos que son basicos acerca de como manejar el dinero. Dave te da las herramientas para mejorar tu situacion economica y te explica como salir de tus problemas paso a paso. Si bien muchos de los ejemplos en el libro hacen referencia a la realidad en USA, las ideas se pueden aplicar a cualquier realidad.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Excelente libro. Lleno de casos, que ayudan a profundizar las ideas expuestas. Los temas est&aacute;n muy bien tratados. Y es muy pr&aacute;ctico. Me gusto mucho.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Excelente libro para aquellos que quieren alcanzar la independencia econ&oacute;mica. Muy bien enfocado en ayudar a conseguir los resultados esperados. Uno de los mejores libros de econom&iacute;a para el hogar que he le&iacute;do.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Este libro le ense&ntilde;a en peque&ntilde;os pasitos, como alcanzar la transformaci&oacute;n de su dinero, nunca nos ense&ntilde;aron esto en la escuela, pero SI funciona. Tomese su tiempo y vera que bien se siente estar libre de deudas y con la tranqulidad de jubilarse dignamente",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "el coronel no tiene quien le escriba no one writes to the colonel spanish edition",
        "description": "Written with compassionate realism and wit, the stories in this mesmerizing collection depict the disparities of town and village life in South America, of the frightfully poor and outrageously rich, of memories and illusions, and of lost opportunities and present joys.",
        "authors": "['Gabriel Garcia Marquez']",
        "infoLink": "http://books.google.com/books?id=7ZZUx2FccWUC&dq=El+Coronel+No+Tiene+Quien+Le+Escriba+/+No+One+Writes+to+the+Colonel+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Siempre es un deleite para nuestros sentidos -porque no s&oacute;lo lo lees sino tambi&eacute;n lo escuchas, lo degustas, lo hueles- tener en la mano un libro de Gabriel Garc&iacute;a Marquez. No importa lo que escriba: una novela, un gui&oacute;n cinematogr&aacute;fico, o simplemente una columna period&iacute;stica, &eacute;l le da ese toque tan personal que lo transforma todo en una bella historia literaria. &quot;El Coronel No Tiene Quien le Escriba&quot; no escapa a esta premisa.El escenario es nuevamente un t&iacute;pico pueblo congelado en el pasado. La &eacute;poca no importa porque lo maravilloso de aquellos pueblos -de su gente, su ingenuidad para ver y percibir las cosas- es que ser&aacute;n los mismos aunque transcurra el tiempo.&quot;El Coronel&quot; es un veterano de la guerra civil conducida por Aureliano Buendia -que m&aacute;s tarde se convertir&iacute;a en el m&iacute;tico personaje de &quot;Cien A&ntilde;os de Soledad&quot;-. Representa aquel provinciano de ideas rom&aacute;nticas e irrenunciables. De respuestas parcas y testarudez peculiar. Su esposa, una mujer pujante, sostiene una lucha aparte por evitar que ambos se mueran de hambre.El Coronel, y por a&ntilde;adidura su mujer, hab&iacute;a heredado dos problemas. De la guerra civil hered&oacute; un pensi&oacute;n vitalicia cuya carta de aceptaci&oacute;n esperaba todos los viernes y nunca llegaba. Y de su &uacute;nico hijo, Agust&iacute;n -fallecido un tiempo atr&aacute;s de un tiro de bala-, un gallo de pelea que se convierte en la esperanza de todos los galleros del lugar. El dilema surge al agot&aacute;rseles sus provisiones de dinero y tener que tomar la decisi&oacute;n de vender al gallo &oacute; alimentarlo a costa de ellos mismos. El Coronel, con esa tosudez que lo acompa&ntilde;a a todos lados, decidi&oacute; ..... comer mierda a cambio de mantener vivo a lo &uacute;nico que quiz&aacute;s a &eacute;l tambi&eacute;n le permit&iacute;a seguir esperando que alguien le escribiera: el recuerdo de un hijo que se fue y por alg&uacute;n motivo ten&iacute;a la esperanza que siguiera vivo ........ reencarnado en aquel gallo.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "Me deje llevar por este libro y me arrastro hacia un mar de deprecion que me tomo como tres semanas para volver a leer de nuevo, pero no culpo a Marquez por este libro tan desgraciado el cual su ficcion no esta nada lejos de la realidad si no a las miserias que muchos paises latinos han tenido que soportar a traves de los a&ntilde;os por culpa de gobiernos miserables y mediocres. El coronel no tiene quien le escriba es un verdadero clasico de la literatura hispana.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Sin lugar a dudas, &quot;El coronel no tiene quien le escriba&quot; del aclamado Gabriel Garcia Marquez, ha ganado su puesto merecidamente, no solo en el corazon de los miles de seguidores de este escritor, sino en la lista de libros del programa de estudios literarios de la prestigiosa organizacion del Bachillerato Internacional. Cuando comece a leer esta obra con mis alumnos de grado 12, surgieron varias inquietudes y posiciones ambiguas en torno al personaje del coronel... por que es tan pasivo?.... vale la pena su orgullo en medio de tanta miseria?... por que se aferra de manera tan ardiente a su pasado?...que es lo que verdaderamente espera del correo, su cheque de pension de guerra o la escusa para levantarse cada manana con el fin de prolongar su existencia a traves de la esperanza?... que es lo que significa ese gallo al que tanto cuida con esmero, como no lo pudo hacer con su hijo asesinado?... Estas y otras preguntas mas giran en torno a un simple personaje que dio su cuota al gobierno, peleando en una de las tantas guerras que pudieron haber tenido lugar en cualquier pais de America Latina. El paisaje descrito, tipica invencion del maestro &quot;Gabo&quot;, tiene como constante el calor; ese calor costero y pesado que hace que las situaciones se desenvuelvan y evolucionen criticamente mediante el paso de los meses. Los dialogos entre los personajes, cortos, tajantes y directos, nos muestran la autenticidad de los personajes, que malos o buenos segun las circunstancias, dejan entreveer con mas profundidad una faceta del protagonista principal. Es el coronel un heroe de guerra?, un antiheroe en la vida real?.... o una persona comun y corriente a la que le toco vivir la traicion del gobierno en carne propia, el hambre y la soledad?. &quot;El coronel no tiene quien le escriba&quot;, una de las obras mas cortas de la literatura latinoamericana, esta llena de amargura, ironia, desencanto, realismo y pesimismo, sentimientos que cualquier ser humano experiementa en algun momento de la vida. Definitivamente, es una de las novelas mas dicientes y a la vez mas sencillas, o acaso la que mas complejidad encierra, que se haya escrito en todos los tiempos. Entre todas las novelas que he leido, esta esuna de mis favoritas en cuanto a contenido y estilo. No hay que esperar interpretaciones o explicaciones de la misma, porque quizas no se encuentren; de hecho, hay que disfrutarla tal y como es: una historia con detalladas descripciones, sin rayar en el exceso. Un conflicto lento y conmovedor sin un final preciso, pero que deja una de las mas grandes y dificiles lecciones para cualquiera, la paciencia y la perseverancia.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Gabriel Garc&iacute;a M&aacute;rquez es, sin duda, uno de los mejores escritores del siglo XX. Su creatividad impresiona a todos los lectores. Y la capacidad de poner verosimilitud en sus historias absurdamente irreales es su gran virtud. Los mejores ejemplos de este realismo fantastico son los libros Cien A&ntilde;os de Soledad y, adem&aacute;s, El amor en los tiempos del c&oacute;lera. Son historias largas, con tantos personajes que confundem a los lectores (incluso los m&aacute;s atentos), sobre todo Cien A&ntilde;os, en el que los nombres de familia se repiten en muchas generaciones.En El coronel no tiene quien le escriba, el premiado escritor muestra que no son necesarias muchas palabras para hacer una buena historia. Este libro es lindo y, al mismo tiempo, muy simple y sabroso. Casi tan corto como un reportaje period&iacute;stico y tan atemporal como otras historias suyas (aunque siempre se vinculen a alguna situaci&oacute;n pol&iacute;tica), El coronel no tiene quien le escriba emociona al lector, y es una prueba m&aacute;s del gran talento de este maravilloso escritor, que sabe manejar las palabras como pocos.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "El coronel destap&oacute; el tarro de caf&eacute; y comprob&oacute; que no hab&iacute;a m&aacute;s de una cucharadita. Retir&oacute; la olla del fog&oacute;n, verti&oacute; la mitad del agua en el piso de tierra, y con un cuchillo rasp&oacute; el interior del tarro sobre la olla hasta cuando se desprendieron las &uacute;ltimas raspaduras del polvo de caf&eacute; revueltas con &oacute;xido de lata. Durante cincuenta a&ntilde;os _ desde cuando termin&oacute; la &uacute;ltima guerra civil _ el coronel no hab&iacute;a hecho nada distinto de esperar ... Enclaustado en el sopor de su pueblo, de su calor y de su hamaca protegida con mosquitera, el viejo coronel espera y espera, mas la prometida carta del gobierno, con la pensi&oacute;n que se hab&iacute;a ganado en la guerra civil, no llega. Invariablemente, el viejo coronel arriba a la altura del desembarcadero por donde ha de llegar el funcionario con la saca del correo, pero una y otra vez el resultado es el mismo, el coronel no tiene quien le escriba. Dram&aacute;ticamente pobres, el viejo coronel y su enfermiza esposa sobreviven a duras penas, compartiendo adem&aacute;s su escasa comida con el prometedor gallo de pelea en el que tienen depositadas todas las esperanzas (reales) de un futuro mejor, hasta el extremo de tener que plantearse si comer ellos mismos o darle al gallo, pues para alimentarse ya no quedaba en la casa nada que vender. Gallo que representa, adem&aacute;s, el &uacute;nico legado tangible del hijo que muri&oacute; acribillado, bajo la acusaci&oacute;n de distribuir informaci&oacute;n clandestina, por el mismo gobierno del que esperan la &quot;limosna&quot; de la pensi&oacute;n (pese a que el coronel se niegue a considerarla como tal, sino como algo que se gan&oacute; a pulso durante la guerra). &Eacute;sta es, pues, la historia de unos seres que de s&iacute; mismos concluyen: si nos fueramos a morir de hambre ya nos habr&iacute;amos muerto; la ilusi&oacute;n no se come _ no se come, pero alimenta. Un desgarrador relato sobre dos personajes abocados a la m&aacute;s absoluta pobreza, al m&aacute;s absoluto de los sopores, entregados por completo al sue&ntilde;o, la ilusi&oacute;n, la esperanza de un instante mejor, aqu&eacute;l tan s&oacute;lo en el que puedan al menos pagar las deudas a sus vecinos y echarse algo de comer a la boca. Hip&eacute;rbole de las peque&ntilde;as o grandes ilusiones de cada uno y la determinaci&oacute;n de la espera en la sempiterna convicci&oacute;n de falta. Pero a la vez tan real...",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Este libro, aunque solo lei una vez, fue buenisima, contando sobre el ambiente social, politico, y personal de un pueblito y los personajes que viven alli. Es misterioso, y hay que descubrir los secretos poco a poco, hasta el fin de libro con su conclusion que me dejo con una comprension verdad del general, y como va su vida. Lo recomendo a cualquier persona.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "personajes que se cruzan, que vienen de otras historias, vidas estancadas por largas esperas que se disuelven en la nada y el olvido,en la desesperanza. personajes que esperan y este coronel que espera una carta que nunca llega. es una buena historia, disfrutenla. LUIS MENDEZ luismendez@codetel.net.do",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Historia de penumbras y congojas, de zozobras y desasosiegos; de ilusiones perdidas que reavivan con menor esplendor cada vez que el Coronel recibe un No como respuesta en la Oficina de Correos.El Coronel es una aguda e incisiva metafora que se anida en la memoria maltratada y desamparada de seres quienes vieron pasar lo mejor de sus vidas al arraigo de una promesa, del pago puntual de una merecida pension por servicios prestados. El tiempo y el olvido son dos viejos amigos, y esa espera cotidiana se convierte en el unico asidero esperanzador que alimenta el deseo de vivir de un hombre ya olvidado, relegado por los nuevos tiempos, protagonista de hazanas crepusculares que inflaman la imaginacion historica y poetica, pero que poco o nada dicen a las nuevas generaciones.Una de las joyas cimeras de la Literatura Latinoamericana, El Coronel tiene ese sabor obsesivo del Tango, de lo que pudo haber sido y no fue. Este militar es un miembro mas de una legion de seres quienes vivieron seducidos por la palabra y aplastados por el burocratismo y el populismo. Poco importan las coordenadas geograficas y el entorno historico. El subdesarrollo, entendido como la incapacidad de transformacion, no tiene edad, pues como mala hierba, se reproduce en cualquier rincon de la naturaleza.Soberbio e inolvidable relato de este ilustre escritor colombiano, Premio Nobel de Literatura 1984.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "La Historia de un coronel retirado que tiene bastante tiempo esperando su pension. Narra las penurias que pasan el y su esposa tras la siempre espera de dicha \"ayuda\" del gobierno, se alimentan de esperanza y otros dias comen realidad..No creo que sea ficcion puramente, si hasta en los paises mas desarrollados existen casos de estos, que sera en la america latina?",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Gabriel Garc&iacute;a Marquez hace con esta novela una alegor&iacute;a de la propia vida humana, reflejada en la figura del coronel , Don Sabas, su mujer, su hijo, el gallo... todos los elementos de la vida humana y especialmente de la vida en LatinoAm&eacute;rica en esa &eacute;poca.El coronel no tiene quien le escriba trata de un coronel que vive en un pa&iacute;s en estado de sitio o excepci&oacute;n y que despu&eacute;s de haver luchado toda su vida por su naci&oacute;n lleva 19 a&ntilde;os esperando una carta del govierno para cobrar su pensi&oacute;n.El coronel vivia de lo que llevaba a casa su hijo, y ahora que su hijo muri&oacute; asesinado por repartir panfletos ilegales y no tiene nada que vender, lo &uacute;nico que le queda es el gallo, que su hijo le dej&oacute; como herencia y que es de alguna manera lo &uacute;nico que le queda de orgullo a este coronel.El coronel tiene que decidir entre mantener el gallo hasta enero que empiezen las peleas y dejarse a &eacute;l mismo y a su mujer sin comida o bien vender el gallo y ganar un dinero que le ir&aacute; muy bien.Una aut&eacute;ntica reflexi&oacute;n sobre el sentido de la vida humana.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "el libro de oro de la magia blanca spanish edition",
        "description": "Sheds light on Wiccan beliefs and practices--deities, priests, holidays, rituals, and rules--that are often unknown and frequently misunderstood by non-Pagans and the uninitiated, revealing what it truly means to be witch. Original.",
        "authors": "['Migene Gonzales-Wippler']",
        "infoLink": "http://books.google.com/books?id=eTb1zEm9RnQC&dq=El+libro+de+oro+de+la+magia+blanca+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "El doctor Allen se mete a fondo en las recetas de magia lanca que expone en este libro. Las hay para todos y para todos: Para recuperar un amor, auyentar malas voluntades, mejorar el negocio, terminar con antiguos pleitos y rencillas... Todo lo que pide es muy accesible: Desde yerbas que se utilizan para hacer t&egrave;s, hasta velas que podemos comprar donde queramos. De verdad, el libro es fant&agrave;stico y las recetas..M&Agrave;GICAS",
                "review/helpfulness": "50/50",
                "num_reviews": 50
            },
            {
                "review/text": "Una obra fabulosa que no pierde ni tiempo ni papel em tonter&igrave;as y rollos: Desde el principio, el doctor Allen entra directo en materia y nos regala el tesoro de su enorme cantidad de f&ograve;rmulas de magia blanca para que logremos obtener nuestros prop&ograve;sitos ..si son buenos. Las recetas son super sencillas y baratas. Los ingredientes se consiguen en cualquier super o mercado, como la flor de manzanilla,la yerbabuena o cualquier tipo de semilla o vela. Se los recomiendo &iexcl;EN SERIO!",
                "review/helpfulness": "36/37",
                "num_reviews": 37
            },
            {
                "review/text": "cuando ya nos ven&iacute;amos para ac&aacute;... Y mi esposa comenz&oacute; a hacer las recetas de magia blanca,La verdad, nos estaba yendo muy mail y comenz&aacute;bamnos a pensar en regresar derrotados a nuestra Guatemala...De pronto, todo comenz&oacute; a cambiar de una forma inesperada: Me llovieron los ofrecimientos de trabajos bien pagados. No tardamos en levantarnos y hasta en dar el enganche para una casita...Mi mujer segu&iacute;a entrad&iacute;sima en las recetas de este libro...y la verdad, creo que influyeron en mucho.Ya le&iacute; el libro:Las recetas son sencillas de hacer y hay para todo tipo de problemas.La verdad? &iexcl;SE LOS RECOMIENDO AUNQUE LES EST&Eacute; YENDO MUY BIEN ! LES IR&Aacute; MEJOR !",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "para todo y PARA TODOS !&iexcl;Y dan resultados!&iquest;No me crees??&iexcl;Prueba cualquier receta !!!",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "YOU LEARN HOW TO SOUND IN TUNE WITH MOTHER NATURE!Justinocent spells...but HOW STRONG !",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "NO TE SIRVEN DE NADA SI QUIERES HACER ALGUN MAL...Pero son buen&iacute;simas para protegerte y para conseguir o apresurar cosas buenas !",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "conservamos nuestro departamento..Una vecina nos hacia la vida imposible y agredia a nuestro hijo..Ya hab&igrave;a recurrido a la ley, y llego el momento en que decidimos mudarnos porque las amenazas de esa mujer, que ya habia estado tres veces en la carcel por lesiones, crecian mas y mas !&iquest;Y SABEN QUE ????FUE ELLA LA QUE SE MUDO !!!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "el camino del amor",
        "description": "A finales del siglo pasado y en Texas no es f& #225cil para una chica demostrar su val& #237a. No obstante, la atractiva Casey est& #225 dispuesta a conseguirlo pese a quien pese. Para empezar, le pesar& #225--y mucho--a su padre, que se opone rotundamente a permitirle llevar las riendas del rancho familiar. Pero Casey es una joven ind& #243mita que no se arredra ante nada, ni siquiera ante el principal obst& #225culo que entorpece sus aspiraciones, esto es, su condici& #243n femenina, a la que decide camuflar bajo un burdo disfraz masculino y lanzarse a galope tendido por el peligroso Oeste, ejerciendo una profesi& #243n a& #250n m& #225s peligrosa: cazarrecompensas...",
        "authors": "['Johanna Lindsey']",
        "infoLink": "http://books.google.com/books?id=Hp8CAAAACAAJ&dq=El+camino+del+amor&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I love Johanna Lindsey, and when I saw _El Camino Del Armor_ I jumped on it. It didn't dawn on me that it might not be in English. Silly me, I just thought that it would take place in Mexico or Spain. DON'T MAKE MY MISTAKE! Find some of Johanna's book that are written in English.",
                "review/helpfulness": "53/58",
                "num_reviews": 58
            },
            {
                "review/text": "cuando yo vi la descripcion del libro decidi comprarlo, pues ya yo lo habia leido en Ingles y queria mandarselo a mi hermana que esta en Cuba para que lo disfrutara. El libro en ingles se llama GENTLE ROGUE, y es la historia de Georgina que se disfraza de hombre y se enrola en el barco del capitan Hawke uno de los MALORY y es una trama bien bella y ocurre en Inglaterra. Pero que resulta que cuando yo recibi el libro EL CAMINO DEL AMOR es una historia bien linda pero es otra se desarolla en america y no tiene nada que ver con la saga de los MALORY. NO OBSTANTE yo recomiendo que lo lean Lindsey es una de mis escritoras favoritas y todos los libros de ella tienen romance, y son libros que uno disfruta a plenitud.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "cuando yo vi la descripcion del libro decidi comprarlo, pues ya yo lo habia leido en Ingles y queria mandarselo a mi hermana que esta en Cuba para que lo disfrutara. El libro en ingles se llama GENTLE ROGUE, y es la historia de Georgina que se disfraza de hombre y se enrola en el barco del capitan Hawke uno de los MALORY y es una trama bien bella y ocurre en Inglaterra. Pero que resulta que cuando yo recibi el libro EL CAMINO DEL AMOR es una historia bien linda pero es otra se desarolla en america y no tiene nada que ver con la saga de los MALORY. NO OBSTANTE yo recomiendo que lo lean Lindsey es una de mis escritoras favoritas y todos los libros de ella tienen romance, y son libros que uno disfruta a plenitud.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la magia y tu spanish edition",
        "description": "Offers comprehensive coverage of the history of magic rituals and practices throughout the world, presenting information on voodoo, ancient Egyptian and Hebrew magic, palm reading, secret symbols, astrology, exorcism and spells to overcome enemies and obtain wealth",
        "authors": "['Migene González-Wippler']",
        "infoLink": "http://books.google.com/books?id=rRUTkulWOAYC&dq=La+magia+y+tu+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Como practicante de Magia Blanca, les recomiendo este interezante libro. En el cual se usa un lenguaje sencillo y ameno para tratar el tema. Los rituales y recetas de este libro, se explican de una manera clara y f&aacute;cil de estender por cualquier persona que deseara practicar la MAGIA BLANCA. Recomiendo este libro lo mismo para principi&aacute;ntes que para los expertos que deseen enriqueser sus comocimientos.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Este libro es bueno para las mujeres casadas. Muchas de las recetas de amor requieren ropa de el novio y si no lo tienes, mejor no compres el libro si buscas recetas de amor. El libro tiene muchas recetas para tener buena surte y para salud. Las recetas de matrimonio tambien requiere de ropa de el novio y cabellos de el, este libro no es para mujeres solteras que no tienen ropa de el. Una receta para separar/alejar a una rival, requiere cabellos de ella, eso es muy dificil de conseguir si la mujer es tu rival o la amante de tu esposo/novio. Este libro se lo recomiendo a las mujeres que tienen ropa o cabellos del ser amado.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "la novia oscura spanish edition",
        "description": "A reading of contemporary women's fiction in Spanish America in which space, rather than time, is seen as the driver of the narrative.",
        "authors": "['Susan Carvalho']",
        "infoLink": "http://books.google.com/books?id=3inyhPz53cAC&dq=La+Novia+Oscura+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "zest than Garc&iacute;a M&aacute;rquez.A better knowledge of SpanishA high sense of poetic proseA bigger talent than Vargas LlosaA unique speed to keep you glued to her pagesA great pull to make you go back to certain paragrahps not because she is complicated, but BECAUSE YOU SAVOR THEM AS YOU WOULD ENJOY THE FINEST COGNACShe knows human nature.She paints her characters with realism.SHE IS UNIQUE...",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "Es un buen libro pues nos transporta m&aacute;gicamente y con una insuperable descriptiva a lo que debi&oacute; ser realmente la vida alrededor de un pueblo latinoamericano en los principios de su experiencia en el &aacute;rea de la explotaci&oacute;n petrolera. La autora deja asomar a trav&eacute;s de la trama que sufren sus personajes, ese tipo de sentimiento de atropello que tiende a aflorar entre los habitantes locales de un pueblo a causa del asentamiento de compan&iacute;as extranjeras; las cuales producen cambios radicales inevitables dentro de la comunidad previamente establecida. Nos plantea, de forma indirecta, pero constante a trav&eacute;s de cada una de sus p&aacute;ginas, los problemas que sufren las mujeres en las sociedades altamente patriarcales del pasado. Al finalizar, nos deja con una visi&oacute;n circular de la vida donde pareciera que todo se vuelve a repetir en un momento dado y que el destino es inevitable...",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Ni Allende, ni Gabriel Garcia Marquez sino pura y nueva escritura del fin de siglo latinoamericano que nos hace sentir muy bien pues es prueba fehaciente de que alguien pudo encontrar un nuevo camino o tal vez la sintesis de la obra de quienes fueron sus maestros.Esta novela que viene de la mano de una escritora premiada (y no lo encuentro raro) se nos presenta a traves de una estructura tripartita compuesta por una voz narrativa, el ni&ntilde;o (y luego zorrero) Sacramento y la ni&ntilde;a que este recoge y que luego se convertir&aacute; en Sayonara la diosa de la Catunga.Todo unido en esta escritura no meramente literaria sino cultural y antropologica: la descripcion de las casas pobres con la presencia eterna del cuadro del Sagrado Corazon de Jesus nos hizo recordar tantas casas vistas en los campos puertorrique&ntilde;os y por que no en apartamentos del sur del Bronx (y eso que la novela es colombiana!)Es una novela que hay que leer poniendo atenci&oacute;n al detalle y a las multiples referencias al propio canon literario que cita como Neruda, Ruben Dario, Borges (desde el primer capitulo) y debe ser incorporada a cursos de literatura latinoamericana y estudios sobre el genero y acompa&ntilde;ada por otra novela de recien aparicion con quien comparte ambiente y temas: Nuestra se&ntilde;ora de la noche, de la puertorrique&ntilde;a Mayra Santos.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Una Colombiana maravillosa...Que libro tan entretenido y triste al mismo tiempo. Resptrepo hace sentir tanto como Marquez el tropico con una historia no menos interesante que los de Marquez.Les aconsejo a todos.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "catecismo de la iglesia catlica",
        "description": "This is Spanish version of the new catechism of the Catholic Church, the first major revision in 400 years, the catechism that sets the standard for all teaching within the Church.",
        "authors": "['Catholic Church']",
        "infoLink": "http://books.google.com/books?id=Alb5rAXZiKQC&dq=Catecismo+de+la+Iglesia+Catlica&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Realmente extraordinario. Todas las dudas que tenemos se aclaran en una edici&oacute;n ordenada y con un &iacute;ndice fant&aacute;stico. Material indispensable para crecer en la F&eacute;. Dec&iacute;a San Anselmo que para crecer en la F&eacute; se debe conocer m&aacute;s y para conocer m&aacute;s hay que leer con F&eacute;. Se lee de forma amena y con much&iacute;simas referencias a paralelos b&iacute;blicos. Trae todos los temas relevantes en estos tiempos a consideraci&oacute;n a la luz de la F&eacute;.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Por fin un buen Catecismo, es peque&ntilde;o y alcansa en caulquier maleta o bolso pero eso no es todo las riquesas que guarda este peque&ntilde;o libro son innumerables, muchos textos de referencia, bien ordenado, muchas listas importantes que pueden ayudarte a comprender mejor tu fe, yo me decidi comprar uno para mi oficina, cualquier duda que se presente saco mi peque&ntilde;a arma secreta El Catecismo de la Iglesia Cat&oacute;lica.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "El Catecismo es excelente, un complemento ideal cuando estudiamos las Sagradas Escrituras, profundiza y amplia el conocimiento de nuestra f&eacute;. Altamente recomendado.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "embarazo y parto feliz spanish edition",
        "description": "First multi-year cumulation covers six years: 1965-70.",
        "authors": "['National Library of Medicine (U.S.)']",
        "infoLink": "https://play.google.com/store/books/details?id=-1i_YSF5kckC&source=gbs_api",
        "review": [
            {
                "review/text": "Ya sabes que en el embarazo surgen millones de dudas que generan temor.Y no importa si es tu primer o segundo embarazo...siempre es igual.Pues as&iacute; estaba con mi segundo embarazo...comi&eacute;ndome las u&ntilde;as, pensando si el beb&eacute; estaba bien, o si a la hora del parto tendr&iacute;amos problemas alguno de los dos o los dos.Fu&eacute; hasta el quinto mes, en que encontr&eacute; este libro en un exhibidor. Me llam&oacute; la atenci&oacute;n su hermosa portada, pero al abrirlo, recib&iacute; m&aacute;s de lo que esperaba.Resolvi&oacute; TODAS mis dudas y por lo tanto mis temores.Ojal&aacute; lo hubi&eacute;ra comprado desde mi primer embarazo.Como dato...mi segundo beb&eacute; ya naci&oacute; y estamos muy bien.",
                "review/helpfulness": "38/38",
                "num_reviews": 38
            },
            {
                "review/text": "this book will make it HAPPIER!AND WISER !",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "y este libro, comenz&oacute; a ser mi cimpa&ntilde;ero desde que supe que estaba embarazada...Me resolvi&oacute; todas mis dudas y disolvi&oacute; mis temores..Maravilloso si vas a tener un beb&eacute; ! Lo vas a amar ( Al beb&eacute; y al libro !)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "SO SCARED about her HIGH RISK PREGNANCY...Our Doctor gave us this book...and the remaining 7 months of pregnancy were blissful !!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Est&aacute; lleno de informacion, de la que jam&aacute;s tienen tiempo los ginec&oacute;logos de darnos...Nos resuelve todas las dudas y nos acompa&ntilde;a desde la concepcion del beb&eacute; hasta su feliz llegada !Este fue mi libro de cabecera cuando naci&oacute; MI TERCER HIJO...Y me hizo darme cuenta de QUE CIEGA ESTUVE DURANTE MIS DOS PRIMEROS EMBARAZOS !Ahora que nuestro primer nieto viene en camino, SER&Aacute; UN FARO DE LUZ PARA EL EMBARAZO DE MI HIJA LUISITA !Se los recomiendo much&iacute;simo...No importa que no sea su primer embarazo: Por primera vez contemplar&aacute;n el proceso de dar vida en todo su esplendor !",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la unica guia de inversion que usted necesitar the only investment guide youll ever need spanish edition",
        "description": "Explains how insurance works, reveals little-known facts about the industry, and suggests ways it could be improved",
        "authors": "['Andrew P. Tobias']",
        "infoLink": "http://books.google.com/books?id=tb9A8M-J92cC&dq=La+Unica+Guia+de+Inversion+Que+Usted+Necesitar+(The+Only+Investment+Guide+You%27ll+Ever+Need,+Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "No compres este libro en espa&ntilde;ol. Es una traduccion desastrosa. El traductor decidio traducir literalmente palabra por palabra y toda la exquisitez del libro en ingles se convirtio en BASURA. Si sabes un poco de ingles, lee la version original en ingles.",
                "review/helpfulness": "19/29",
                "num_reviews": 29
            },
            {
                "review/text": "El mejor libro de este tipo que he leido, no es complicado de entender, da ejemplos claro de todo. Realmente es la unica guia de inversion que se necesita. Puede que la traduccion no sea muy buena, pero eso no le afecta al libro. No se lo pierda.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "rebelion en la granja animal farm spanish edition",
        "description": "When the downtrodden animals of Manor Farm overthrow their master Mr Jones and take over the farm themselves, they imagine it is the beginning of a life of freedom and equality. But gradually a cunning, ruthless elite, masterminded by the pigs Napoleon and Snowball, starts to take control. Soon the other animals find themselves hopelessly ensnared as one form of tyranny is replaced with another . . .",
        "authors": "['George Orwell']",
        "infoLink": "http://books.google.com/books?id=lHo6zQEACAAJ&dq=Rebelion+En+La+Granja+/+Animal+Farm+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "El Sr. Jones no sabe lo que estaba a punto de ocurrir en su granja pero continuaba con su patron de explotacion hasta el dia en que los animales se levantaron para hacer justicia y buscar la igualdad. La trama gira en torno a la manera en la que los animales producen y llevan a cabo esta revolucion. Este es un clasico el cual estuvo prohibido y censurado en muchos lugares. Hoy podemos disfrutar de esta excelente obra de George Orwell. En esta edicion encontrara un prologo nunca antes publicado escrito por el autor, el cual es analizado en su contexto. Excelente obra facil de leer, entretenida y con un potencial historico extraordinario.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Dado que es un libro en espa&ntilde;ol, el \"review\" va en espa&ntilde;ol: excelente entrega, lleg&oacute; a tiempo y en perfecto estado. &iexcl;Genial!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was bought as a gift for a Spanish friend, and he loves it.I also bought Animal Farm so I could explain it better to him.The service from Amazon was excelent",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "El sue&ntilde;o del Viejo Manor (Lenin) de un mundo mejor para los animales conduce a una sublevaci&oacute;n en la que sus lideres Snowball (Trosky) y Napole&oacute;n (Stalin) apoyados por el resto de los animales de la Granja Manor (Rusia) derrocan y expulsan a Mr. Jones y sus peones (el Zar y la nobleza) y tras la euforia de la victoria viene la colectivizaci&oacute;n, el liderazgo de los cerdos (la nomenclatura) apoyados por los perros (KGB) que autom&aacute;ticamente se mudan de los establos a la casa (el Kremlin) creando poco a poco una dictadura represiva en la que Squealer (Georgi Aleksandrov, Ministro de Propaganda) no duda en mentir, culpar al enemigo de los fracasos de la Granja Animal (Uni&oacute;n Sovi&eacute;tica) justifica las formas de represi&oacute;n y ejecuci&oacute;n de los enemigos, fomenta el culto a la personalidad, endoctrina a las masas entonando siempre el himno \"Bestias de Inglaterra\" (La Internacional) para a la postre, despu&eacute;s de una guerra contra el Sr. Frederick (Alemania) termine sentado en la mesa celebrando con un grupo de granjeros (los Aliados) el pacto de paz y prosperidad mutual terminando siendo igual o peor que los seres humanos por imitaci&oacute;n.Novela escrita con un lenguaje sencillo, din&aacute;mico, lleno de simbolismo no es m&aacute;s que una cr&iacute;tica abierta al totalitarismo m&aacute;s absoluto denunciando las traiciones, crimenes, represiones, fracasos y corruptelas que van de la mano del poder absoluto, no es de extra&ntilde;ar que el autor tuviera problemas para publicar su obra editada por f&iacute;n en 1945 cuando Inglaterra y Estados Unidos viv&iacute;an a&uacute;n una \"luna de miel\" t&aacute;ctica con la Uni&oacute;n Sovi&eacute;tica para acabar de derrotar a las potencias del Eje y creyeran que dicha obra - tendenciosa en su contenido - pudiera traer consecuencias negativas a la alianza. Una obra a&uacute;n actual aplicable a decenas de dictaduras posteriores a la fecha de su primera edici&oacute;n y actuales escrita con el prop&oacute;sito de hacer pensar y recapacitar sobre el poder y sus lideres.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "One of my favorite books. It describes exactly what the present day communist society is all about. Excellent book condition, fast delivery. Thank you.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Vale la pena leerlo, es un cl&aacute;sico. Sin embargo no tiene la calidad y la imaginaci&oacute;n de 1984. Si disfutan la oportunidad de comprender e internarse en el desarrollo del pensamiento de un autor cl&aacute;sico, se los recomiendo; sin embargo, no deben dejar pasar por ninguna manera la obra maestra de Orwell, sin duda, 1984. Les recomiendo eso s&iacute;, para que no les altere la percepci&oacute;n del libro, NO LEAN EL PR&Oacute;LOGO o h&aacute;ganlo hasta el final.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "los horizontes ms solitarios del mundo",
        "description": "Tras escaparse de casa, Jack, el protagonista de 13 aqos de esta aventura, aborda subrepticiamente el Estrella del Sur\" un velero histsrico que ha sido restaurado para hacer el largo viaje de Inglaterra a Australia sslo para descubrir que la nave ha sido secuestrada y se ha desatado la violencia a bordo.\"",
        "authors": "['Gustavo Vazquez Lozano']",
        "infoLink": "http://books.google.com/books?id=zQoSPQAACAAJ&dq=Los+horizontes+ms+solitarios+del+mundo&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "La novela posee un aire de aventura de las cl&aacute;sicas historias &eacute;picas y una sensaci&oacute;n de nostalgia a la vez.Tiene un final emotivo y deja un muy buen sabor de boca.En verdad recomiendo el libro, especialmente a quienes disfrutan de narraciones llenas de im&aacute;genes.Espero especialmente que encuentre lectores j&oacute;venes.Felicidades al autor y gracias.Noah H.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Por una de esas extra&ntilde;as coincidencias, le&iacute; este libro unos cuantos d&iacute;as despu&eacute;s de que mi hijo menor cumpli&oacute; trece a&ntilde;os y, curiosamente, Jack, el personaje principal de esta novela, ten&iacute;a precisamente esa edad cuando escap&oacute; de su casa para embarcarse en la &quot;Estrella del Sur&quot;. Mientras le&iacute;a con inter&eacute;s el relato de las aventuras de Jack, me sent&iacute; transportado a un mundo que casi hab&iacute;a olvidado despu&eacute;s de mucho tiempo dedicado exclusivamente al trabajo.Me gusta mucho la literatura, sobre todo las novelas y la poes&iacute;a, pero hace muchos a&ntilde;os que no le&iacute;a un buen libro, escrito con imaginaci&oacute;n y buena prosa, en donde los personajes se enfrentan a la furia del mar y viven momentos de incertidumbre en una peque&ntilde;a isla perdida del Pac&iacute;fico Sur. Despu&eacute;s de leer este libro me siento m&aacute;s identificado con mi hijo, que casi sin darme cuenta, dej&oacute; de ser un ni&ntilde;o para convertirse en un muchacho que ahora sue&ntilde;a y observa con creciente curiosidad &quot;Los horizontes m&aacute;s solitarios del mundo&quot;.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "del amor y otros demonios of love and other demons spanish edition",
        "description": "This is a comprehensive reference guide for professional and student structural engineers containing key information required on a day-to-day basis. By bringing together data from many sources, this book should help engineers to apply classroom theories into practical projects on the ground. With quick and clear access to charts, tables and data it speeds up scheme design in the office, in transit, or on the site.",
        "authors": "['Gabriel García Márquez']",
        "infoLink": "http://books.google.com/books?id=Lu2a9lqhsaEC&dq=Del+amor+y+otros+demonios+/+Of+Love+and+Other+Demons+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "En Del Amor y otros Demonios la intolerancia cristiana juega un papel muy importante, si no el principal. La obra nos traslada a una &eacute;poca en que la Iglesia es el eje alrededor del cual gira la sociedad y en que las autoridades eclesi&aacute;sticas gozan de mucho poder. En las colonias hispanas, la Iglesia cumple una estricta funci&oacute;n evangelizadora y debido a la firmeza de sus preceptos, no tolera que ninguna otra cultura amenace o contradiga su autoridad.Sierva Mar&iacute;a de Todos los &Aacute;ngeles es v&iacute;ctima de esta intolerancia. Nace en el seno de una familia cristiana, pero vive entre esclavos a causa de la indiferencia de sus padres. Podemos decir, entonces, que ella es una mezcla de ambas culturas. Ella aprende las costumbres africanas, celebra sus ritos, come sus platos y habla su lengua a la perfecci&oacute;n, sin que sus padres se preocupen por ella o interfieran en su vida. Sin embargo, esto no impide que ella sea feliz e incluso &quot;en aquel mundo opresivo en que nadie era libre, Sierva Mar&iacute;a lo era: s&oacute;lo ella y s&oacute;lo all&iacute;&quot; (p. 19). En realidad, como dice su propia madre, &quot;lo &uacute;nico que tiene esa criatura de blanca es el color&quot; (p. 63).Al enterarse que su hija fue mordida por un perro rabioso, el marqu&eacute;s decide reintegrarla al mundo en que naci&oacute; creyendo que as&iacute; la har&iacute;a feliz y le devolver&iacute;a la salud. Sin embargo, no pudo lograrlo y opta por dejarla en manos de la Iglesia. El obispo interpreta sus convulsiones y sus alaridos en &quot;jerga de id&oacute;latras&quot; como &quot;s&iacute;ntomas inequ&iacute;vocos de una posesi&oacute;n demoniaca&quot; (p.76). La ignorancia es tal, que se piensa que &quot;entre las numerosas argucias del demonio es muy frecuente adoptar la apariencia de una enfermedad inmunda para introducirse en un cuerpo inocente&quot; (p.76).Los cristianos no son capaces de ir m&aacute;s all&aacute; de lo que dice la Iglesia; no pueden darse cuenta que los gritos desesperados de Sierva Mar&iacute;a son consecuencia de las pr&aacute;cticas de los curanderos que por ejemplo, le lavaron la herida con su propia orina y se la hicieron beber. Adem&aacute;s, pareciera que el obispo o la abadesa creyeran que lo mejor que pueden hacer por la ni&ntilde;a es encerrarla en una celda, mantenerla en terribles condiciones y finalmente, someterla a una serie de exorcismos tan crueles como innecesarios. Cayetano Delaura se da cuenta de la injusticia que se comete con la ni&ntilde;a y aun le insin&uacute;a al obispo que, en realidad, lo que les parece demoniaco &quot;son las costumbres de los negros, que la ni&ntilde;a ha aprendido por el abandono de sus padres&quot; (p. 126), pero sus palabras son inadvertidas. Siguen viendo al demonio en una ni&ntilde;a que simplemente no sabe comportarse en un mundo con costumbres tan opuestas a las suyas. Para la Iglesia es inaceptable que una ni&ntilde;a blanca se comporte como negra y por lo tanto, creen que las costumbres africanas amenazan su cultura.Abrenuncio tambi&eacute;n es discriminado por la comunidad cristiana. &Eacute;l es jud&iacute;o y portugu&eacute;s, &quot;el m&eacute;dico m&aacute;s notable y controvertido de la ciudad&quot; (p. 27). Los otros m&eacute;dicos no perdonan sus aciertos inveros&iacute;miles ni sus m&eacute;todos ins&oacute;litos y por este motivo es perseguido por el Santo Oficio. Adem&aacute;s, es partidario de la eutanasia en caso enfermedades terminales y considera que s&oacute;lo los buenos cristianos son capaces de cometerla. De los exorcismo, opina que entre eso y las hechicer&iacute;as de los esclavos no hay mucha diferencia, &quot;y peor a&uacute;n, porque los negros no pasan de sacrificar gallos a sus dioses, mientras que el Santo Oficio, se complace descuartizando inocentes en el potro o as&aacute;ndolos vivos en espect&aacute;culo p&uacute;blico&quot; (p. 98). Por ser tambi&eacute;n objeto de la intolerancia cristiana, Abrenuncio comprende a Sierva Mar&iacute;a y se compadece de ella.Finalmente, cuando Cayetano confiesa su amor por Sierva Mar&iacute;a, la Iglesia tampoco lo puede tolerar y menos a&uacute;n, porque &eacute;l es cura. Incluso en nuestros d&iacute;as, es muy probable que gran parte de la sociedad lo considere un exceso inmoral.Esa intolerancia religiosa, en mi opini&oacute;n, no es m&aacute;s que sin&oacute;nimo de injusticia e ignorancia. La Iglesia crey&oacute; estar en lo correcto sin siquiera tomar en cuenta las ense&ntilde;anzas referentes al amor y la fraternidad, y s&oacute;lo consideraron pr&oacute;jimo al hombre blanco. Tal vez la Iglesia ya no tenga el poder que tuvo antes, pero de algo s&iacute; estoy segura: ahora y siempre ha habido gente que ha llevado la religi&oacute;n m&aacute;s en las rodillas que en el coraz&oacute;n.",
                "review/helpfulness": "47/53",
                "num_reviews": 53
            },
            {
                "review/text": "Mucho se puede decir acerca de esta obra. Basta el saber quien es el autor para decidir leerla.La historia ocurre en una imaginaria &eacute;poca colonial. Tiempos de cucufater&iacute;as, en las que los esquemas estaban pre-establecidos por s&oacute;lo Dios sabe quien. Tiempos en los que la gente cre&iacute;a poder decidir el destino de los dem&aacute;s, como lo hicieron con Cayetano, un sencillo eclesiasta cat&oacute;lico, y Sierva Maria de Todos los Angeles, una ni&ntilde;a olvidada por sus padres -un noble venido a menos por su caracter indiferente, a quien no le importaba absolutamente nada, ni su propia hija; y su madre una mujerzuela que decidi&oacute; consevirla con la &uacute;nica finalidad de ser la esposa de un noble-.Debido al abandono espiritual de sus padres ella es criada entre esclavos. Los negros le hab&iacute;an ense&ntilde;ado todo acerca de su cultura: lenguaje, religi&oacute;n, danzas. Hab&iacute;a adquirido la humildad y conformismo de los esclavos; su mundo era la barraca, su familia ....los negros.Un buen d&iacute;a su padre, el segundo Marquez de Casualdero, nota que su hija mostraba una herida en el tobillo y es informado que un tiempo atr&aacute;s hab&iacute;a sido mordida por un perro. Preocupado por su salud lleva a Sierva Maria a un m&eacute;dico jud&iacute;o con ideas bastante discordantes con la &eacute;poca. Al no poder conseguir que su hija sea curada el Marquez relaciona su &quot;enfermedad&quot; con hechos ocurridos previamente. La escuch&oacute; hablar en una lengua que &eacute;l no comprend&iacute;a (un dialecto hablado s&oacute;lo por los esclavos), la veia bailar con movimientos extra&ntilde;os y, adem&aacute;s su sigilo al aparecer de sorpresa en lugares donde no se le esperaba -ella parec&iacute;a un fantasma-, llev&oacute; a su padre a creer que estaba pose&iacute;da por el demonio y decide que la iglesia deber&iacute;a hacerse cargo de Sierva Maria. De esta manera la interna en un convento y, nuevamente, se desentiende de ella. Su comportamiento en este lugar fue el mismo, pues ella hab&iacute;a nacido blanca pero criada negra y nadie iba a lograr cambiar a alguien que siempre fue y ser&aacute; la misma. Sorprendidas por su comportamiento &quot;anormal&quot; (los humanos tenemos un concepto muy especial sobre lo que debe ser normal y que no) y llegan a la conclusi&oacute;n que deben exorcisarla. Esta misi&oacute;n es encomendada a Cayetano quien en sus breves, pero bien aprovechadas visitas, se enamora de Sierva Maria.Sabiendo de lo que significaria para la iglesia decide azotarse creyendo in&uacute;tilmente que, empleando ese m&eacute;todo de auto-castigo, ese amor desaparecer&iacute;a. Al darse cuenta que era imposible se lo confiesa a su superior. Cayetano fue prohibido de futuras visitas al convento. Sin embargo, el amor hacia esa hermosa mujer hace que trepe muros y evada a las ocasionales vigilantes del calabozo donde hab&iacute;a sido encerrada su dama. Le escribe cartas y cita poemas de amor, uno de los que recordar&eacute; toda la vida es este: Por ti tengo la vida/ Por ti vivo/ Por ti he de morir (Garcilazo de la Vega). Poco despu&eacute;s ambos hicieron el amor por primera y &uacute;ltima vez. Cuando &eacute;l hab&iacute;a decido escapar con su amada, Sierva Mar&iacute;a de Todos los Angeles hab&iacute;a muerto. En su af&aacute;n de sacarle el demonio del cuerpo la maltrataron tanto que muri&oacute;. Pudieron m&aacute;s las creencias y estereotipos existentes que el amor m&aacute;s puro y tierno de dos hijos de Dios.Despu&eacute;s de esto Cayetano Da Silva fue trasladado de lugar, asign&aacute;ndosele otro cargo de menor grado por el &quot;pecado&quot; cometido. Pero nadie podr&iacute;a hacer que olvide a su amada porque de seguro que &eacute;l siempre la so&ntilde;ar&iacute;a comiendo del mismo plato de uva .... y las uvas jam&aacute;s se le acabar&iacute;an.La m&aacute;s bella historia de amor que nunca antes hab&iacute;a le&iacute;do. Si usted deja caer unas l&aacute;grimas no se preocupe que es Gabo exprimi&eacute;ndonos el coraz&oacute;n.",
                "review/helpfulness": "50/51",
                "num_reviews": 51
            },
            {
                "review/text": "Tras tres o cuatro excelentes libros (El coronel no tiene quien le escriba, Cien a&ntilde;os de soledad, El oto&ntilde;o del patriarca, El amor en los tiempos del c&oacute;lera), Garc&iacute;a M&aacute;rquez se ha dedicado a verle la cara a sus lectores, que seguimos esperando un poco m&aacute;s de sus libros m&aacute;s recientes. Cuando no compra sus historias - por ejemplo Relato de un n&aacute;ufrago, Noticia de un secuestro - o escribe cuentos pat&eacute;ticamente malos (no se hagan, &iquest;a qui&eacute;n le gustan los Doce cuentos peregrinos?), simplemente refritea sus novelas, es decir, expone temas ya tomados en cuentos publicados anteriormente y los entrelaza para formar una historia m&aacute;s extensa. Es &eacute;ste el caso de Del amor y otros demonios. Si quieres leer el libro &uacute;nicamante por el estilo y el realismo m&aacute;gico, adelante. Siempre he dicho que GGM es un poeta y su estilo es bell&iacute;simo, y ni se diga, junto a Kafka y Rulfo es de los grandes del realismo m&aacute;gico. Pero desde el punto de vista de la trama...no lo recomendar&iacute;a. Lee mejor los cuatro libros que mencion&eacute; arriba, y luego ya ver&aacute;s que a comparaci&oacute;n, Del amor y otros demonios es una narraci&oacute;n m&aacute;s bien sosa.",
                "review/helpfulness": "14/22",
                "num_reviews": 22
            },
            {
                "review/text": "la intolerancia, la ignorancia y la supersticion caracterizan esta historia, tambien el amor, ese pequeno demonio que esta dentro de todos nosotros latente esta ahi, en medio,al comienzo y al final de esta obra.una obra corta, consederando los libros de garcia marquez como el amor en los tiempos de colera y cien a&ntilde;os, pero con un ritmo incomparablemente bien llevado y de un realismo magico insuperable. esta pequena obra les hara disfrutar de un garcia marquez en la plenitud de su obra. LUIS MENDEZ luismendez@codetel.net.do",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "En el amor no importa la postura pol&iacute;tica, tampoco importan las diferencias sociales o la edad o la tradici&oacute;n, pareciera decir Garc&iacute;a M&aacute;rquez. Pero no explicita. Simplemente pone en juego elementos contradictorios que se resuelven con la muerte. Describe minuciosamente las diferencias, los choques, las distancias que conviven en una cultura que se muestra homog&eacute;nea ante los ojos del mundo, pero que est&aacute; carcomida en sus entra&ntilde;as m&aacute;s profundas.La vida de dos peque&ntilde;os personajes que podr&iacute;an no modificar en absoluto el discurrir de la humanidad pero que, en su intenso amor, en su propia tragedia, ponen de manifiesto la injusticia de las verdades innertes que rigen la vida actual. Una luz de esperanza que se apaga con el sufrimiento y la muerte, reescriben a Romeo y Julieta en el seno de las sociedades latinoamericanas, donde las diferencias y las supersticiones deber&iacute;an reconciliarse a partir de un relato que nos pone a pensar qu&eacute; ser&iacute;a de nosotros sin el amor, qu&eacute; absurda injusticia vive en los prejuicios que no entienden de otra cosa m&aacute;s que de su propia indiferencia para continuar vivos. Y Sierva Mar&iacute;a debe morir para que nosotros lo entendamos de una vez por todas.Excelente.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "To say the least, this book of G.G.M is defenetly one of my favourites. The reason? It portraites beautifully the complex reallity of my country (Colombia), and specialy the coast part. For the people who either does not know to much about Colombia, or to much of the &quot;bad&quot; things, this book offers an emotinal approach, an antropological view of the many paradoxes in the land of the richest coffe in the worl. One advise: read the book with the best of your concentration, due to the fact that G.M, is a genius creating and using words from the most rich Castellano (spanish) ever. Enjoy it ! Angela Alvarez.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Quizas no es el libro mas famoso de Garcia Marquez, pero es uno de mis favoritos. Bellamente escrito, ligero, divertido, interesante, ingenioso. Refleja muy bien los pensamientos de la epoca colonial y su intolerancia. Una bella historia de amor (entre Cayetano y Sierva Maria), rodeada por historias de pseudo-amor (el de los padres de Sierva Maria, por ejemplo).",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "indudablemente una de las mejores produciones de Marquez, una historia que nos narra las contrariedades de los amores imposibles, mientras nos pinta una semblanza del rigurozo y esquisito periodo criollo, me atrevo a decir que esta a la altura de macondo (cien a&ntilde;os de soledad). es una obra que cualquiera que ah estado enamorado de quien socialmente no debe,tiene que leer &quot;si padre estoy poseido... por el peor de los demonios el AMOR...&quot;",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "la autopista del sur y otros cuentos",
        "description": "A young girl spends her summer vacation in a country house where a tiger roams...A man reading a mystery finds out too late that he is the murderer's victim... In the stories collected here-including Blow-Up, on which Antonioni based his film-Julio Cortazar explores the boundary where the everyday meets the mysterious, perhaps even the terrible. This is the most brilliant and celebrated book of short stories by a master of the form.",
        "authors": "['Julio Cortazar']",
        "infoLink": "http://books.google.com/books?id=uZid9iGXwzAC&dq=La+autopista+del+sur+y+otros+cuentos&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "este libro es excelente. me encantaron los cuentos que tiene y ademas es mucho mas facil de leer que rayuela , el otro es un reto increiblemente delicioso para los lectores. este libro presenta casas encantdas, embotellamientos de traficos donde se recrean la absurdidad de la vida cotidiana y la ilusion de alguien que vive en dos mundos en la noche boca arriba. es una obra que se debe disfrutar despacion, un cuento a la vez para no perder el sabor a juego y anomalia que nos deja cortazar al leerlo.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Primero, debo confesar que soy un fan&aacute;tico de Cortazar. Este libro re&uacute;ne algunos relatos brillantes y otros que son dif&iacute;ciles de seguir. Pero debemos entender que muchos de los relatos de Cort&aacute;zar transmiten sensaciones, estados de &aacute;nimo, m&aacute;s que argumentos o cadenas de hechos. Estas sensaciones son casi siempre vagamente opresivas, sutilezas que nos absorven a su universo que nos puede parecer real, pero que siempre hay algo que no encaja en esa realidad. Cuando nos dimos cuenta, ya nos ha transportado a su mundo de fantasmas y estamos compartiendo un sutil sufrimiento con el autor y las protagonistas. Por esta razon, Cortazar es un maestro. En su mayoria, sus relatos tienen complejos vaivenes de argumentos, que siempre termina sorprendi&eacute;ndonos. Cort&aacute;zar juega con nosotros, los lectores, para conducirnos de la mano hacia un mundo de sensaciones y sorpresas que termina maravill&aacute;ndonos por la destreza de su gu&iacute;a.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Compr&eacute; este libro esperando que me sirviera de introducci&oacute;n al trabajo de Julio Cortazar. Logr&oacute; su cometido estupendamente, aunque el trabajo en si llega a los extremos. Desde cuentos absolutamente brillantes como La Casa Tomada, y Cuentos de Cronopios y Famas, hasta historias aburridisimas, que no llegan a ninguna parte. Una lectura muchas veces espectacular, otras monotona y dificil. Cortazar no ha ganado un nuevo fan&aacute;tico conmigo, pero eso no es motivo para parar a nadie a leerlo. Aquellos que lo disfrutan, lo disfrutar&aacute;n.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you would like to read Cortazar but are intrigued by his style, this great and simple yet mind challenging book showcases his great imagination and story-telling power. In &quot;Autopistas del Sur...&quot; he takes us through a wide range of stories, from childhood memories to enchanted houses to simple life events.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "este libro es excelente. me encantaron los cuentos que tiene y ademas es mucho mas facil de leer que rayuela , el otro es un reto increiblemente delicioso para los lectores. este libro presenta casas encantdas, embotellamientos de traficos donde se recrean la absurdidad de la vida cotidiana y la ilusion de alguien que vive en dos mundos en la noche boca arriba. es una obra que se debe disfrutar despacion, un cuento a la vez para no perder el sabor a juego y anomalia que nos deja cortazar al leerlo.LUIS MENDEZ crazzyteacher@hotmail.com",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Usted no necesita ser un experto en literatura para disfrutar de un buen libro. La clave en esta colecci&oacute;n es que reune los cuentos que contribuyeron a que Julio Cort&aacute;zar se convirtiera en el maestro latinoamericano del relato. Junto a antolog&iacute;as de narrativa corta de los grandes escritores nuestros y que recomiendo (El llano en llamas, de Juan Rulfo; Ficciones, de Jorge Luis Borges; Doce cuentos pregrinos, de Gabriel Garc&iacute;a M&aacute;rquez; y de recientes como Maldito amor, de Jorge Franco; y Desencuentros, de Edmundo Paz Sold&aacute;n, entre otros), La autopista del sur y otros cuentos es la mejor introducci&oacute;n que cualquier lector interesado puede tener en la literatura de Cort&aacute;zar y su alta influencia en autores contempor&aacute;neos, a&uacute;n si no se ha decidido leer Rayuela, su obra m&aacute;xima. Ya tendr&aacute; su momento. Lea este, y los dem&aacute;s llegar&aacute;n por a&ntilde;adidura.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "muchas vidas muchos sabios",
        "description": "El doctor Brian Weiss -- psiquiatra del hospital Mount Sinai de Miami, EE.UU.-relata en este libro su experiencia con Catherine, una paciente a quien trato bajo hipnosis, luego de intentar sin exito durante un ano la terapia convencional. En estado de trance profundo -- solo un 15% de los hipnotizados logran llegar a este -- Catherine recordo sus vidas anteriores y revivio sus traumas que eran la clave de sus constantes pesadillas y su ansiedad, comenzando cuando se llamaba Aronda, en Egipto, 18 siglos antes de Cristo. El escepticismo del doctor comenzo a diluirse cuando Catherine empezo a dar muestras de la existencia de \"espacios entre una vida y otra,\" con sorprendentes acerca de la familia del Dr. Weiss y de su hijo fallecido. Al utilizar una terapia de \"vidas pasadas\" el Dr. Weiss pudo curar a esta paciente y avocarse a una nueva y mas significativa fase de su carrera.",
        "authors": "['Brian L. Weiss']",
        "infoLink": "https://play.google.com/store/books/details?id=n99eOXNr2_gC&source=gbs_api",
        "review": [
            {
                "review/text": "SIEMPRE HE DISFRUTADO LOS TEMAS METAFISICOS. POR CONVICCIONES FAMILIARES Y EXPERIENCIAS PROPIAS SE QUE NUESTRO CAMINAR NUNCA TERMINA. NUESTRO DESTINO ES CRECER Y APRENDER DE LAS DIFERENTES ETAPAS QUE NOS CORRESPONDA &quot;VIVIR&quot;. POR LO TANTO, ES MUY ESTIMULANTE VER DESCRITAS POR OTRAS PERSONAS VIVENCIAS SEMEJANTES A LAS NUESTRAS. NO ES FACIL MANTENER LA CREDIBILIDAD Y RESPETO DE LOS EXCEPTICOS, CUANDO MANIFESTAMOS LO QUE SABEMOS ES CIERTO. LOS RELIGIOSOS SE HAN ENCARGADO DE ESTIGMATIZAR TODO LO QUE PUEDA CONSIDERARSE UN ATENTADO A SUS DOGMAS, YA QUE ESE CONOCIMENTO LES HARIA PERDER EL CONTROL ESTABLECIDO POR TANTOS SIGLOS MEDIANTE EL MIEDO. &quot;LA VERDAD NOS HACE LIBRES&quot;. NOS DA LA LIBERTAD DE ELEGIR LO CORRECTO MEDIANTE NUESTRAS PROPIAS EXPERIENCIAS, SIN IMPOSICIONES NI COACCION EXTERNA. LA SERIE DE LIBROS DEL DR. BRIAN WEISS ES MAGNIFICA. ABRE EL CAMINO DEL CONOCIMIENTO DE ESA OTRA &quot;VIDA&quot; DESPUES DE LA VIDA ENCARNADA Y NOS DA LA ESPERANZA DE QUE SIEMPRE PODREMOS ENMENDAR LO VIVIDO. TAMBIEN NOS PREVIENE DE HACER LO INCORRECCTO ANTE LA PERSPECTIVA DE QUE SIEMPRE DEBEREMOS PAGAR LAS &quot;DEUDAS ADQUIRIDAS&quot;.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Este libro toca lo m&aacute;s profundo del alma, y nos da una nueva visi&oacute;n de nuestras vidas, qu&eacute; cosas son realmente importantes, habremos estado juntos antes con las personas que amamos? Es un libro que habla del amor verdadero, de perd&oacute;n. En pocs palabras: es un libro maravilloso.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Soy una fiel seguidora del Dr. Brian Weiss, he leido todos sus libros y cada uno ha sido una experiencia maravillosa. Muchas Vidas Muchos Sabios (o Maestros) nos abre las puertas a un mundo totalmente espiritual, nos hace perderle el miedo a la muerte pues es solo un periodo de transicion. Mi padre es medico, Cardiologo, y aun siendo un cientifico, por su profesion el ha tenido experiencias con pacientes que han sufrido paros cardiacos y han regresado relatando experiencias muy similares a las que se narran en este libro. Muchas Vidas Muchos Sabios llego a mis manos en el momento de una perdida muy dolorosa, mi hermana menor acababa de fallecer en un accidente de autos. Ese libro fue un consuelo increible en ese momento, llego a mi vida en el momento en el que mas lo necesitaba. Cada vez que algun amigo o conocido esta pasando por una experiencia similar, sin pensarlo compro una copia de este libro y se la obsequio. Por su lado, Lazos de Amor es el segundo libro mas hermoso que he leido. Nos ense&ntilde;a que el amor es infinito y que nunca muere. Es lo unico que realmente vale, lo unico real. Recomiendo ambos libros al maximo, cambiaran la vida de los que lo lean!!!! GRACIAS DR. WEISS!!!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "La compilacion que ofrece este libro sobre diversos fenomenos en diversas epocas, y por diversos sabios es algo que realmente pondria a pensar a muchos escepticos sobre el tema.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "In my opinion, this is the best book of Brian Weiss. It changed my perspective about life and it helped me to understand that we have a reason to live in this world... and beyond.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Despues de leer este maravilloso libro mi manera de ver la vida es muy diferente, todo tiene sentido y gracias a estos conocimientos he podido ayudar a otras seres a vivir su vida con un proposito que es ser mejores cada dia para pasar de nivel en nuestro crecimiento espiritual; este libro no es para aquellas personas que le tienen miedo a la verdad; pero si te atrevez a leerlo te aseguro que tu vida jamas volvera a ser la misma.ATREVETE!!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "los nombres ms bellos y originales para tu nia spanish edition",
        "description": "Nieuwspraak, Big Brother, het vocabulaire uit 1984 is in onze taal opgenomen en een eigen leven gaan leiden. De roman van George Orwell uit 1949 over de strijd van Winston Smith, ambtenaar op het ministerie van Waarheid, tegen de alles doordringende Partij, en zijn gedoemde liefde voor Julia heeft niets van zijn literarie zeggingskracht verloren. In Orwells steeds weer herdrukte anti-utopie verkeert de wereld in de wurggreep van een systeem dat is gegrondvest op de verbreiding van angst, haat en wreedheid, en dat iedere vorm van persoonlijke vrijheid en indiviualiteit uitsluit. 1984 is onverminderd geldig als benauwend nauwkeurig blauwdruk van elk dictatoriaal regime.",
        "authors": "['George Orwell']",
        "infoLink": "https://play.google.com/store/books/details?id=gTx1AAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "y hasta el de mi hijo...porque puse Karla en masculino...Y luego, naci&oacute; nuestra &uacute;ltima hija..Y de ese mismo libro brot&oacute; su nombre...Deverdad es un libro que contiene nombres MARAVILLOSOS, EXCLUSIVOS PARA LAS PRINCESITAS...excepto por los que puede uno cambiar al masculino !Asi son de bonnitos, que hasta para el varoncito se antojanLa verdad, es buen&iacute;simo y no habr&aacute; nadie en el mundo que no encuentre el nombre PERFECTO PARA SU HIJA",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "NOt mixed with masculine names...Just for US!!!The sweetest and also the most strong names for that future lady of yours that now lies in your loving arms..She is BEAUTIFUL: GIVE HER A BEAUTIFUL, UNFORGETTABLE NAME !",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "My name is CITLALI, and I love it:It means FIVE FLOWERS !I am not just a Patty or a Jeannie...I am Citlali...Look for a beautiful name here and make your daughter as happy as I am...Citlali",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "el honor de utilizar un libro de nombres S&Oacute;LO PARA NI&Ntilde;AS !Este es el mejor que yo conozco y te lo recomiendo al 100% !",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "OBTUVIMOS EL NOMBRE DE NUESTRA &Uacute;LTIMA HIJITA !L&aacute;stima que no lo conoc&iacute;amos cuando nacio la primera !Si tienes una beba, NO DEJES QUE TE PASE LO MISMO Y ANTES QUE EN CUALQUIER OTRO, REVISA LOS NOMBRES DE ESTA PRECIOSIDAD !",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "los sueos your dreams 7a edicin",
        "description": "DREAMS, ADIVINATIONS, NEW AGE. USING DREAMS TO FACE PERSONAL AND PROFESSIONAL PROBLEMS.",
        "authors": "['Gayle Delaney']",
        "infoLink": "http://books.google.nl/books?id=Wefp5lHmlG8C&dq=Los+Sueos+(Your+Dreams+)7a+edicin&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "En todas sus interpretaciones...Me tom&eacute; la molestia de checarlo contra un texto de Freud...&iexcl;y dice la verdad!Se los recomiendo, porque siempre es importante saber QU&Eacute; SIGNIFICA LO QUE SO&Ntilde;AMOS!",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "dreams..You dream it, the book tells you the meaning of your dream..Really good and simple to understand. INformation packed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Interpretaci&oacute;n de los Sue&ntilde;os, conozco bastante lo que hay en mi interior, en mi subconciente.Esto no es materia de supersticion:La interpretaci&oacute;n de los sue&ntilde;os ES UNA CIENCIA.Este libro es el mejor texto pagra graduarte en la CIENCIA DE INTERPRETAR TUS SUE&Ntilde;OS...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Y es cierto: Los Sue&ntilde;os spn UNA VERDAD ABSOLUTA SOBRE NOSOTROS MISMOS y hasta sobre nuestro futuro:En nuestro sue&ntilde;os, el subconciente nos dice muchas verdades...O TODAS, SI SABEMOS APROVECHAR LOS SUE&Ntilde;OS !Me sorprendi&oacute; gratamente este libro, porque su interpretaci&oacute;n de llos SUE&Ntilde;OS ES CORRECTA Y SORPRENDENTE ! Yo lo comprob&eacute;!Adem&aacute;s, el libro es sencill&iacute;simo, no nos complica el entendimiento y nos d&aacute; claramente el SIGNIFICADO DE NUESTROS SUE&Ntilde;OS, significado que muchas veces, ni siquiera nos imaginamos:&iexcl;Palabra que es mejor que un PSICOAN&Aacute;LISIS !Nos permite bien conocer nuestras potencialidades, nuestros profundos deseos y nuestros pensamientos m&aacute;s escondidos.!Se los super recomiendo !",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "LOS MENSAJES DEL INCONSCIENTE !Extraordinario!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la piel del tambor spanish edition",
        "description": "An emissary from the Vatican investigates the foul play surrounding the pending demolition of a crumbling church in the heart of old Seville, in a sophisticated thriller by the author of The Club Dumas. Reissue. 25,000 first printing.",
        "authors": "['Arturo Pérez-Reverte']",
        "infoLink": "http://books.google.com/books?id=ECfRis60n24C&dq=La+piel+del+tambor+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Desde la primera pagina este libro me ha cogido y no me solto hasta que le&iacute; la ultima. Perez-Reverte es un autor con la capacidad de escribir sobre la condici&oacute;n humana como muy, pero muy, pocos. Su descripcion de la tentaci&oacute;n sentido por el protaganista es nada menos que excepcional. Por otra parte escribe con una atenci&oacute;n al detalle excepcional. Hasta ahora este misterio es mi libro preferido de el.This book grabbed ahold of me from the first page and did not let me go until the last. Perez-Reverte has a great capacity to write about the human condition as very, but bery, few can. His descrition of the temptation felt by the protaganist is nothing short of exceptional. On anopther front he writes with an exceptional atention to detail. Up to this point this is my favorite book by him.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Uno de mis buenos amigos cuya recomendaci&oacute;n en lo que se refiere a libros goza de gran credibilidad me ven&iacute;a recomendando que leyera algo de Arturo - P&eacute;rez Reverte y hay que decir que de nuevo peg&oacute; en el clavo.Aqu&iacute; tenemos un h&eacute;roe que es un sacerdote, con sus pies bien colocados en el mundo terrenal de las intrigas vaticanas y el &aacute;mbito nada santo de la iglesia, para el cual si Dios existe o no es lo de menos en su vida.Pero en su labor de guardi&aacute;n de los intereses del Vaticano lo mandan a investigar quien puede ser un \"hacker\" que ha logrado colarse al computador personal del Papa, a fin de abogar por la protecci&oacute;n de una iglesia barroca en Sevilla que ha sido abandonada a suerte por la curia de esa ciudad.En la trama nos encontraremos una villanos que no se pueden concebir como tales pues su conciencia &eacute;tica fue formada por Maquiavelo y otro grupo de sicarios que pareciera extra&iacute;do de los comics de Mortadelo y Filem&oacute;n.El paralelo que se da entre la historia de Carlota Breuer y la Iglesia, es completamente po&eacute;tica, apasionante y encaja perfectamente en crear una motivaci&oacute;n para la conducta final de Lorenzo Quart.De otra parte que podemos decir de los personajes? Cada uno de ellos es perfecto en su rol y completamente definido, no hay que hacer ning&uacute;n esfuerzo por imaginarlos, casi que bailan ante nuestros ojos.Son muy pocos autores quienes tienen la capacidad para formar una trama donde el trasfondo hist&oacute;rico, el misterio, la pol&iacute;tica las descripciones arquitect&oacute;nicas, el romance, la poes&iacute;a, el humor y hasta la acci&oacute;n se mezclan impecablemente de manera tal que esta obra podr&iacute;a ser catalogada en cualquiera de estos temas sin problema. Si anda buscando un libro que lo retire del mundo que lo rodea y lo coloque a caminar en la mitad de Sevilla para divertirse como loco, no lo dude, escoja este.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Unos amigos me regalaron la 17 edici&oacute;n de esta novela hace un a&ntilde;o. Aunque de P&eacute;rez-Reverte s&oacute;lo he le&iacute;do La Tabla de Flandes, me parece que &eacute;ste tiene que ser uno de sus mejores libros. Despu&eacute;s de leerlo, me es evidente la raz&oacute;n por la que es un autor tan popular.El punto fuerte de P&eacute;rez-Reverte es el detalle con el que define a sus personajes. Es f&aacute;cil llegar a conocerlos, se hacen de carne y hueso, y en consecuencia el lector desarrolla una empat&iacute;a con ellos, incluso con los malos de la historia. Esta novela, adem&aacute;s, tiene la ventaja de poseer un personaje central que se hace inmediatamente de querer. Es extra&ntilde;o, ya que el Padre Quart no es entra&ntilde;able, pero sus circunstancias, pasadas y actuales, ponen su papel en perspectiva favorable. Hablando de caracteres realistas, el que m&aacute;s dificultad tuve en aceptar es V&iacute;speras. Todo es posible en la Vi&ntilde;a del Se&ntilde;or, pero no s&eacute;, no s&eacute;...Una cosa que no aguanto en una novela es que el autor te lo ponga a tiro hecho. Hay veces que es tan obvio lo que va a ocurrir, o lo que de verdad ha pasado, que la trama pierde inter&eacute;s, y una se pregunta si el autor no podr&iacute;a haberle dedicado m&aacute;s tiempo o m&aacute;s neuronas a su escritura. En el caso de esta obra, hay cosas que s&iacute; adivin&eacute;, pero con algo de trabajo. Eso es exactamente lo que busco en un libro, algo que me haga poner el cerebro en movimiento. Este libro es de los mejores que he le&iacute;do en el a&ntilde;o 2000.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "You're going to love every character, but you never are going to forgot Priest Lorenzo Quart, he is a complex man but that is the best, that he is a man, no only a Catholic Priest, and also the story is excelent, the suspense and everything, you are going to enjoy it. Excelente libro donde se disfruta cada momento y cada descripci&oacute;n al m&aacute;ximo, con personajes inolvidables, todos y cada uno de ellos, donde nadie es totalmente bueno o malo, sino simplemente humanos. Pero por encima de ellos est&aacute; el padre Quart, un personaje complejo, pero al que se comprende y al que se llega a amar",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Parece que el Sr. Perez Reverte tiene muchos admiradosres y sin duda se lo ha ganado, pero este libro (que es el primero que leo de el)no me parece tan increible, esta lleno de descripciones, sin duda bastante graficas, que despiertan la imaginacion, pero tambien esta lleno de lugares comunes: la increiblemente bella aristrocrata venida a menos, el ejecutivo arribista, los malandrines de poca monta; por cierto me harto el caracolillo de la Ni&ntilde;a Pu&ntilde;ales, y el final fue bastante predecible. En fin he leido mejores.Le doy tres estrellas por sus descripciones en general.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "How Perez-Reverte manages to keep writing book after book which rivets the reader to the pages amazes me. Again, another masterpiece. From his seedy characters of the &quot;Seville underworld&quot; each with their own truckful of baggage, and their interestingly tight relationships; to the Seville elite, also each with a skeleton in their closet; to the complicated hierarchy and in-fighting of the catholic church. Only Perez-Reverte is able to bring these three totally different types of people together in one novel and make it believable and a pleasure to read. The reader is glued to the book after reading the opening chapter in which a hacker has broken into the Pope's personal computer, which sets in motion the investigation of small insignificant church in Seville and the identity of the hacker. A must read for all Perez-Reverte fans, and a good starting point for those new to this incredibly gifted author.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "caf nostalgia",
        "description": "Chic, sophisticated, seductive and enigmatic, the Parisienne possesses a je ne sais quoi that makes her difficult to define. But who or what is the Parisienne, and how is she depicted in cinema? The first book-length study on the subject combines scholarship in the fields of art history, literature and fashion to enrich our understanding of this intriguing cinematic figure, simultaneously offering new perspectives on film. Accessible and wide-ranging, it will be of immediate interest to students and researchers working in film studies, French studies and the broader humanities, as well as cinephiles and Francophiles alike.",
        "authors": "['Felicity Chaplin']",
        "infoLink": "https://play.google.com/store/books/details?id=hm-5DwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "El libro es excelente aunque el lenguaje que se usa ser&aacute; facilmente entendido solo por aquellos nacidos y criados en Cuba o entre cubanos. El lenguaje es muy t&iacute;pico, casi folkl&oacute;rico dif&iacute;cil de entender para otras personas que hablan castellano. Lo de la realidad cubana, muy bien plasmada, sufrimientos, miserias y frustraciones del diario acontecer habanero son sin duda alguna reales, me consta por que yo tambien los viv&iacute;. Felicitaciones Zoe, te la comistes.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Es una lectura excitante; lloras, ries y te sonrojas. El contenido es crudo. La realidad contemporanea cubana es asi y esa es Zoe. No obstante, le da esperanzas al que ha pasado por todo eso y concluye con un &quot;there's always tomorrow&quot;.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Caf&eacute; Nostalgia est&aacute; m&aacute;s all&aacute; de la pol&iacute;tica. Caf&eacute; Nostalgia narra, simplemente, una historia sobre seres humanos y no sobre el partido que &eacute;stos militan (porque los cubanos son, tambi&eacute;n, seres humanos, y no s&oacute;lo organismos vivos que deben definir su posici&oacute;n pol&iacute;tica constantemente). El contexto, para bien o para mal, es insoslayable. En ese sentido: contexto e historia, realidad y ficci&oacute;n, &eacute;sta obra resulta espasm&oacute;dicamente real y po&eacute;tica. Es la peque&ntilde;a historia de cada cubano, no importa del bando del que est&eacute; o haya estado. Es la agridulce cr&oacute;nica de cada \"aquel-isle&ntilde;o&quot; que ha visto partir, uno tras otro, desperdig&aacute;ndose por el planeta, a todos sus amigos. Y de aquellos que, en otra tierra, no logran quitarse de encima esa man&iacute;a de extra&ntilde;ar la isla de la que, a pesar de todas las carencias (materiales y espirituales), guardan los mejores momentos.Cuba no es s&oacute;lo un contratupunto entre Revoluci&oacute;n y &quot;gusaner&iacute;a&quot;. Cuba tambi&eacute;n es su gente: un pueblo normal y com&uacute;n, con sus achaques y virtudes, que r&iacute;e y padece, que goza y se lamenta. Que vive y ejerce su derecho a ser humano. Quien encuentre en &eacute;ste volumen s&oacute;lo una cr&iacute;tica al r&eacute;gimen, est&aacute; leyendo con los ojos de la predisposici&oacute;n y es, por tanto, parte del mismo juego. Est&aacute; en definitiva m&aacute;s politizado que como quiere hacer parecer a su autora. Qui&eacute;n califique este libro de panfleto carece de la m&aacute;s elemental sensibilidad. No entiende que lee sobre el dolor de la soledad y la lejan&iacute;a; sobre la esperanza que, aunque la pinten de verde, se va marchitando con la nostalgia. No comprende que en el fondo es un canto, con la voz &aacute;spera y grosera, gastada por el desaliento, a la amistad. A la amistad sin condiciones, que es m&aacute;s fuerte que la distancia, la pol&iacute;tica y el desarraigo.La amistad que, por fortuna, no se desinfla.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "No me ha gustado demasiado. La trama es casi inexistente, y el lenguaje parece poco cuidado, como si lo hubiera escrito de un tir&oacute;n, sin pararse a repasar lo escrito. Me gust&oacute; mucho m&aacute;s &quot;La nada cotidiana&quot;, que resultaba m&aacute;s fresco y vital.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Una vez m&aacute;s, los &quot;atrevimientos&quot; y estereotipos sobre la realidad cubana que eran de esperar. La repetici&oacute;n de la repetidera. Un globo que, como el de Mat&iacute;as P&eacute;rez, m&aacute;s tarde o m&aacute;s temprano se desinflar&aacute;.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "la hija del canibal novela booket numbered spanish edition",
        "description": "The question of \"women's writing\": a 'double-edged' double-bind? -- The reception and marketing of women writers in Spain -- Writers, the literary market and the construction of the public personae of Matute, Montero, and Etxebarria -- Matute, Montero, and Etxebarria on \"women's writing\" -- The 'spectral mother'",
        "authors": "['Mazal Oaknín']",
        "infoLink": "http://books.google.com/books?id=fPczvgAACAAJ&dq=La+Hija+del+Canibal+(Novela+(Booket+Numbered))+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Este es uno de los libros mas maravillosos que he leido. Es una obra que se puede leer en varios niveles. Es decir, se la puede tomar simplemente como una apasionante historia de secuestros, detectives e intrigas, o se puede ir mas alla y extraer el profundo mensaje que tiene.En esencia este es un libro en el que los personajes tratan de encontrar su mision en la vida, el significado de su existencia en este mundo y al final lograr aceptar el paso del tiempo apreciando que en cada etapa de nuestra vida tenemos algo que aprender y algo que ganar.Es un libro que lo recomiendo enteramente ya sea solo para pasar un buen rato leyendo una historia que te atrapa desde la primera pagina, o para quienes deseen comprender una muy interesante filosofia de vida.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "&quot;La Hja del Canibal&quot; is a surprising book due to its style and depth of narrative. The book is an introspective view of the world, an exploration of ones self identity as related to person, relationships with partners and parents. These plots are cleverly intertwined in a plot in which the main character, Lucia, tries to solve the abduction of her husband Ramon.The style is clear and concise, the plot unfolds quickly and keeps the reader guessing and interested. However, the real value of the narrative centers on the apparent subplots (which, in my view, are the crux of the book), in which Lucia explores her womanhood, her relationships with others and the meaning of ones self-identity.I find it unfortunate that the title of the book--meaning the cannibal's daughter-- will likely be a turnoff, and would decrease its readership. If you read it, you will understand how the title is appropiate and that it has nothing to do with real-flesh eating, but of the symbolic consumption of ones identity by others.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Titulo: La Hija del Can&iacute;bal. Autora: Rosa Montero 1997. IBSN:84-239-7669-6Mi pasi&oacute;n por la lectura, ha aumentado infintesimalmente desde que lleg&oacute; a mis manos,y finalic&eacute; la novela de Rosa Montero, &quot;La Hija del Can&iacute;bal&quot;. La autora ha logrado una obra maestra majestual en el g&eacute;nero &quot;literatura-ficci&oacute;n&quot; (&iquest;quiz&aacute; autobiograf&iacute;a?) que deber&iacute;a ser le&iacute;da por todos, quiz&aacute; como requisito en clases de Literatura, o por que no, en clases de secundaria.Su narrativa demuestra su excelente habilidad de combinar armoniosamente, palabras, ideas, sentimientos con met&aacute;foras, s&iacute;miles, analog&iacute;as, descripciones que utilizan palabras tan cultas, que no hay manera de que no sea sencilla y grata su lectura. Todo esto aunado al conocimiento de la sicolog&iacute;a humana de distintos tipos de personajes,en diferentes nos demuestra la riqueza lingu&iacute;stica como cultural que posee la autora.El argumento central gira alrededor del repentino secuestro de Ram&oacute;n Iru&ntilde;a por un Grupo terrorista &quot;Orgullo Obrero&quot;. Este rapto sucede mientras &eacute;l va al lavatorio del aeropuerto que los llevar&iacute;a a &eacute;l y a Luc&iacute;a a Viena un 31 de Diciembre. Ram&oacute;n, marido de la protagonista Luc&iacute;a por un espacio de diez a&ntilde;os, se desempe&ntilde;aba como ejecutivo de escalaf&oacute;n medio de un Ministerio, mientras, Luc&iacute;a, una escritora de cuentos infantiles que aparentemente no vend&iacute;an.Desde el instante en que Ram&oacute;n desaparece, y que comienzan a hacerse las pesquisas policiales y mentales, Luc&iacute;a se percata de lo poco que sabe y de lo poco que significa Ram&oacute;n para ella. Esto es evidenciado en la mitad de la novela mientras la juez le relata hechos comprobados sobre &eacute;l, y ella expresa &quot;los diez a&ntilde;os de convivencia con Ram&oacute;n cayeron hechos trizas bajo el terremoto de palabras de esa mujer. Pero qui&eacute;n era realmente mi marido, qu&eacute; pensaba, que hac&iacute;a. Y quien era yo, para no haberme enterado.&quot;Nos deja perplejos la realidad humana de personas que cohabitamos e inclusive dormimos sobre el mismo lecho y somos capaces de saber lo que a la vista est&aacute;.Lo cierto es, y para mi lo m&aacute;s impactante, es que en el interim entre el instante del secuestro y la aparici&oacute;n de Ram&oacute;n , Luc&iacute;a, Felix Roble un vecino octogenario que solo saludaba, y el veinea&ntilde;ero Adri&aacute;n (un perfecto desconocido) se instalan en la casa de Luc&iacute;a.Ellos tres logran transformarse en los mejores amigos, en los que esperan y comprenden la idiosicracia de un secuestro, y llegan a formar el perfecto equipo, compuesto por personas de 3 generaciones dis&iacute;miles, de 20 de a&ntilde;os de diferencia cada una. La autora ingeniosamente va relatando las vidas de cada uno de los tres, entre cap&iacute;tulo y cap&iacute;tulo, y pasado de un personaje a otro, como pasa a su vez de un relato en primera a un relato en tercera persona. Lo cierto es que F&eacute;lix, Luc&iacute;a y Adri&aacute;n se convierten en los mejores y m&aacute;s intimos amigos, se unen de una manera m&aacute;s estrecha de lo que normalmente se hace en familia, inclusive nace y crece una relaci&oacute;n m&aacute;s que &iacute;ntima sexual entre Luc&iacute;a y Adri&aacute;n.Cada cap&iacute;tulo nos regala una experiencia nueva, o se nos niega algo ya escrito por la autora, se nos van relatando las caracter&iacute;sticaspreocupaciones de cada una de las etapas que representan los protagonistas principales(de 20, 40 y 80), en fin es una caja de sorpresas, de realidades de la vida que son tan impresionantemente escritas, que nos transmite la clara idea de que puede haber muy bueno, como muy malo, pasi&oacute;n enceguecedora, como falta de ella, hombres viles, como nobles, etc. A su vez como en la historia h&eacute;roes, son recordados como cobardes, cobardes como h&eacute;roes. Todo esto con una fluidez lingu&iacute;stica envidiable. Y tampoco debo olvidar, un humor que te hace reir de verdad.Al final aparece Ram&oacute;n, el c&oacute;mo y el porqu&eacute; del secuestro, pero lamentablemente, eso se los dejo a ustedes para que lo lean y disfruten en su debido momento el final de esta pieza de literatura, que gan&oacute; por unanimidad el &quot;Primer Premio Primavera 1997. Adem&aacute;s hay que enterarse de porqu&eacute; era ella la hija del Canibal.Mizrod C.A",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "La novela me fascin&oacute;! Una mujer desencantada de la vida tiene la m&aacute;s incre&iacute;ble de las aventuras al iniciar la b&uacute;squeda de su esposo secuestrado.Rosa Montero se las arregla espl&eacute;ndidamente para contar, sin cursiler&iacute;as ni sentimentalismos, una divertid&iacute;sima historia con inmenso contenido humano.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "conocer a dios spanish edition",
        "description": "Spanish version of \"To Know God\"",
        "authors": "['Sarah Robb Purcell']",
        "infoLink": "http://books.google.nl/books?id=cifBxQEACAAJ&dq=Conocer+a+Dios+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Para los que se dan cuenta que estan en un proceso de evolucion del espiritu hacia sus origenes, Chopra nos presenta con un mapa de nuestro Ser mas profundo. Esta exploracion de la experiencia de Dios incluye un entendimiento en terminos biologicos y cientificos, exponiendo una secuencia del desarollo espiriual claramente explicado pero dificilmente logrado.Cada buscador de la Verdad y del Espiritu debe mantener los conceptos expuestos a mano mientras viaja en el camino del alma.&quot;Si queremos cambiar el mundo tenemos que empezar por cambiar a nostros mismos.&quot; Conocer a Dios el la meta, Chopra nos indica el camino pero Nuestro Camino se hace al andarlo.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Con este libro se puede conocer lafilosofia y psicologia que envuelve la concepcion delhombre de Dios",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "el camino de las lagrimas spanish edition",
        "description": "An innovative self-help program draws on a multitude of sources--including folktales, the Bible, Eastern philosophy, and the Torah--to explain how to overcome unhealthy behavior patterns by emphasizing the concept of \"self-dependence\" to promote self-awareness, personal happiness, independence, and successful relationships with others. Reprint. 20,000 first printing.",
        "authors": "['Jorge Bucay']",
        "infoLink": "http://books.google.com/books?id=KXKPkrOf1A4C&dq=El+Camino+de+Las+Lagrimas+(Spanish+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Everybody at least a few times in a life time will have some lost to cry for. But for how long? How deep is ok to suffer, to mourn for our lost? What if the lost is tremendous, can we recover from it?Jorge Bucay explains in a very simple way the phases we need to pass through the mourning process. There is hope, there is recovery, there is life at the other end.If you are suffering because any kind of lost, give yourself a relief by learning how to carry out a sane process of recovery.I really find this book very helpful because it provides that kind of knowledge that eases the flow of our emotions.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "El camino de las l&aacute;grimas es parte de la serie de cuatro libros conocidos como hojas de Ruta, el Dr. Bucay, con su claridad expositiva y su ya estilo tradicional de narrar cuentos nos da la sensaci&oacute;n que nos cuenta cosas que ya sabemos pero sin embargo no hemos podido ver antes y de una manera coherente nos ayuda a ver que el mismo camino lleno de lagrimas ha sido recorrido millones de veces por otros humanos ense&ntilde;&aacute;ndonos a reflexionar sobre todas las etapas que conlleva una p&eacute;rdida y esa obligaci&oacute;n que tenemos de enfrentarnos a la realidad con una actitud optimista.Describe esas peque&ntilde;as perdidas que tenemos desde ni&ntilde;os durante la escuela, explicando tambien el origen de el amor para luego pasar a describir las situaciones mas complejas y sensibles de la esperiencia humana frente a una p&eacute;rdida d&aacute;ndonos un poco de fuerza para batallar cada duelo. Cada dia hay que dejar ir algo para esperar uno nuevo y algunas veces dejar ir es llorar dejar que cada lagrima limpie nuestra alma y deje intacto nuestro corazon para que sea ocupado por algo nuevo. El autor nos muestra que quiza hayan muchos momentos en donde pensamos que no podremos seguir si perdemos algo o alguien pero en verdad el camino tendra un final; pero lo mas significativo de el final de ese camino es que no importa lo que hagamos para evitarlo ... siempre tendremos que estar presentes.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "De una manera tan simlple nos este libro no solo nos ayuda apasar todos los pequenos o grandes duelos a lo largo de nuestra vida ,sino que ademas con nos hace un llamado a no desperdiciar cada minuto tan valioso que vivimos , lo que me dejo este libro sin duda es que aun de el dolor mas grande se puede optener algo bueno, y como el autor dice .... lograr que los momentos plenos , felices ,sean los que abunden para que cuando ya no estemos alguien nos recuerde y sonria...",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    }
]