[
    {
        "Title": "fodors how to take a road trip 1st edition getting organized makes getting there so much more fun specialinterest titles",
        "description": "Arranged by state, this illustrated travel guide features more than one thousand unique and varied places around the country, including scenic back roads, country villages, and secluded beaches.",
        "authors": "[\"Reader's Digest\"]",
        "infoLink": "http://books.google.com/books?id=PwTi34hdNJoC&dq=Fodor%27s+How+to+Take+a+Road+Trip,+1st+Edition:+Getting+Organized+Makes+Getting+There+So+Much+More+Fun+(Special-Interest+Titles)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Unless you've had someone coddle you your whole life, Fodor's How to Take a Road Trip is a waste of time. Banal common sense info you don't need to buy. For example, it takes a whole page to explain where to find a road map: bookstore, autoclub, gas station, on line, rest stops. Don't expect any MacGyver tricks of the road---like how to open your car door if you locked your keys inside. Fodor's advice: bring a spare set. This book is nothing more than an empty gimmick.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "I wish I had read the reviews on this book before I bought it. The book talks about common sense items that anyone can figure out on their home. A waste of my money & time.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "The very best thing I can say about this lame waste of trees purporting to be a travel guide is that at least I didn't BUY it...It was just an impulse grab it at the library checkout desk. But still, I'll never get the time it wasted back. All copies should be burned with the author and editors on top as a warning to others.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "sew and go easy convertible projects for the active lifestyle creative machine arts",
        "description": "Provides instructions for creating such items as a picnic blanket car kit, travel hats, stroller and car seat bags, backpacks, insulated bottle carriers, rain poncho, beach towel tote, and travel journals",
        "authors": "['Jasmine Hubble']",
        "infoLink": "http://books.google.com/books?id=EqG0iwFbAFUC&dq=Sew+and+Go:+Easy+Convertible+Projects+for+the+Active+Life-Style+(Creative+Machine+Arts)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really enjoy the projects in this book. I have made many of the projects. When I made the travelling pillow that rolls out to a rest mat for my daughter and her friend I used flat sheets that I didn't have fitted shees to match any more. The girls love them. They have taken the pillows on vacation, on over nights and to summer camps. In using the flat sheets, I was able to recycle and save money. The sheets are more durable that some of the fabrics too because they are made that way. I encourage every sewer to buy and use this book. Use your imagination throughout too. The projects and gifts made from this book are originals because you make them. Many people like the personal gift and the thought and time put into it. So go and sew!",
                "review/helpfulness": "38/40",
                "num_reviews": 40
            },
            {
                "review/text": "Ms. Hubble has lots of great travel packing tips in this book, including how to tie a sarong. The patterns are intriguing--however, the directions are very sparse, for the most part. If you are not an expert seamstress, you will need help trying to figure out some of the directions. That said, several of the projects in this book can be sewn by the beginner.Her other books have good patterns too, but even worse directions. Look at this book first before going to the others.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "adventure travel in the third world everything you need to know to survive in remote and hostile destinations",
        "description": "Jeff Randall and Mike Perrin have years of experience leading travelers deep into the wildest cities and most rugged backcountry of the Third World. In this book, they help you recognize and minimize the many risks that come with venturing way off the beaten path so that you can come home with stories the average tourist will never be able to tell. The authors' hard-earned secrets for staying healthy and happy in remote and dangerous places include researching your destination the right way before you depart; arriving in your host country safely and with all your gear intact; acquiring guides for forbidden travels without getting rebuffed or shot; bribing and smuggling as last-ditch survival tools; dealing with the many and varied temptations of city and nightlife; being safe and self-sufficient while journeying deep in the bush; and much more.",
        "authors": "['Jeff Randall', 'Mike Perrin']",
        "infoLink": "http://books.google.com/books?id=v2MDAAAACAAJ&dq=Adventure+Travel+In+The+Third+World:+Everything+You+Need+To+Know+To+Survive+in+Remote+and+Hostile+Destinations&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is only of any value since nobody has any real alternative in finding this type of information elsewhere. The writing is quite poor, the text is disorganized and the authors often foolishly overgeneralize and at times hint at their ignorance of the host countries. Overall this book is a pretty pathetic attempt at a serious guide for travelers outside W.Europe and N.America, but, then again, there are almost no other books on the topic, so it looks like we're stuck with this.Don't get me wrong, there are some useful tips, but the authors dance around going into detail on articulating a lot of very important points, especially with respect to staying out of trouble, establishing rapport with your hosts, etc, etc. Thus, unfortunately, a lot of the most important topics only receive cursory mention and/or little explanation. Some of the 'tips' aren't even well thought-out. One example comes to mind: \"use dog tags on your luggage so you don't have to fill out an ID tag every time you fly. That'd be great if you were going to France or the UK, but if you're trying to get over the Colombian border or whatever, the LAST thing you want on your pack is a set of military dog tags.If you're going to be traveling in the developing world, and you feel like you absolutely MUST have a book on the subject, you might want to buy this book...used if possible. Mostly though, this information could be gleaned from a couple hours spent on a good web search.I give it two stars, one of which comes from authoring one of almost no books on the subject.",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "Prior to my recent retirement from the above agency, I had frequent occasion to familiarize myself with the goings on in the more dangerous parts of the world. And not just to familiarize, but how to survive these parts. Although the U.S. State Department web site has some valuable information, NOBODY had the quality, reality based third world survival oriented information that Jeff Randall does. In fact I purchased one of these books for my office operation. Jeff Randall met an operational training team of mine in Colombia, and I gotta tell you that he made a more favorable impression on them than any of the many Spec Ops types they have met down there. He is truly the real deal.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "A very good read that is easy to understand and follow. I would recommend anyone to read this book before traveling to any remote or hostile area of the world. Many points in the book can be applied right here at home when traveling. Besides not all hostile locations are located in some third world country.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "The authors are not your typical backpackers. They have hands on experience leading groups into uninhabited parts of Third World countries.They teach you how to research and prepare for your trip. How to get around and where to stay when you get there. How to deal with foreign governments, police and the military. How to enjoy a safe social life. And most of all, how to prepare for and travel in extreme environments where tourists don't go.If you're a seasoned traveler, but have never been to a tropical country, then you may find that all your gear will be useless when you get there. I have researched all the gear the authors recommended and compared it against everything else out there, and found that they know exactly what they are talking about.I noticed that some reviewers stated that you can find all the same information in this book online for free. I would disagree on that. In fact I spent a whole day trying to find the same stuff and could not. The unique thing about this book is that it is not only written for those who want to backpack around Third World countries, but also for those who want to travel off the beaten path and into the jungles and mountains where tourists have never set foot.Those of you who want to mount major expeditions into the jungle or just travel from locale to locale, may tend to disagree with some of the things in this book. But even then, one should be able to pick up lots of tips on how to make their adventure safe, healthy, fun and fulfilling.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the weekend sewers guide to dresses timesaving sewing with a creative touch lark sewing",
        "description": "Gathers over thirty dress designs to illustrate alterations that transform standard, familiar dress patterns into fabulous new looks",
        "authors": "['Kate Mathews']",
        "infoLink": "http://books.google.com/books?id=JahKAAAAYAAJ&dq=The+Weekend+Sewer%27s+Guide+to+Dresses:+Time-Saving+Sewing+With+a+Creative+Touch+(Lark+Sewing)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The photographs alone will send you to your sewing room. Kate Mathews offers over 200 photos of finished products plus the how-to instructions to produce them. The gist of her message is that you can take a dress pattern (she doesn't specify brand or number) and, with some planning and creativity, make it truly your own one-of-a-kind designer original. Her techniques are fun and trendy and she provides something for almost every sort of taste.The book offers something to dressmakers of all levels of expertise. To be sure, the more experienced will have less difficulty in mastering and adapting the suggestions. But the novice can be equally entranced by many of the techniques.This book is a joyful addition to a sewing library!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "It is truly flabbergasting how someone with such bad taste could regard themself as an authority on anything related to the world of aesthetics! The \"designs\" in this book range between the very-ordinary-nothing-special at best, and the plain dreadful at worst. Contrary to its claim, this is NOT a book that teaches you how to make dresses, it simply refers to READY MADE COMMERCIAL PATTERNS (which are NEITHER included nor explained) and shows how to \"create variations on them\". It is extremely MISLEADING to market it as a book that teaches how to make dresses, since NO SUCH INSTRUCTIONS exist on ANY of its pages!Not only are many of the designs plain ugly, but the \"presentation\" of them is unbelievably sloppy. The author, imagining that by taking \"your average Jane\" to model, would be providing an alternative to the pretzel-stick-ladies of the fashion world, which is all fine and good, BUT, why such average Janes did not even bother to brush their hair, and most of them look like they've been pulled out of bed and stuck in the dresses (without even washing their faces) is beyond me. Not just that, but most of the dresses DID NOT FIT them! Very often the waistlines were too high, the shoulders too wide, the sleeves too long, many of them were simply at least one size bigger than the lady modelling them, they looked RIDICULOUS, and to add insult to injury, some of the dresses weren't even ironed decently! Is this a bad joke? Bad taste? Sloppiness? NEGLIGENCE??There are a FEW pages in the beginning about \"sewing tips in general\" that have some merit, but, at the scale of one page every five or six, the rest is plain drivel, where the author just blabbers on and on like some compulsive-obsessive chatterbox. Examples are, talking about \"if you make a mistake\", then going into her own \"philosophy\" of why one might make a mistake (one or two paragraphs to that), then, of what one might feel when one realizes that mistake (another paragraph or two), and then, how one might \"be tempted to react\" after that realization (one more paragraph), and how she advises you to react instead (still nothing about the actual sewing, all psycho-babble, and another paragraph or two to that), and, maybe telling you exactly what to do to relax (another paragraph), and then, how you'd feel after you've relaxed (paragraph), and you'd think that it's ABOUT TIME she'd give some concrete sewing-related advice, but no, she'd get inspired for one or more paragraphs of \"why relaxation is good for you\", and so on for a page or two until FINALLY she'd write that ONE sentence of what CONCRETE ACTION to take in order to remedy that mistake.That is how the first sixty pages of the book proceed. Distill the bits-of-substance, discard the profound-nonsense, and you'd get some 8 to 10 pages of good value.As I mentioned earlier, this book WILL NOT TEACH YOU HOW TO MAKE DRESSES. Unless you buy the commercial patterns first, it is of absolutely no use. The unkempt-models-in-unironed-unfitting clothes are just going to make you angry you've been taken for a ride at every level.I have often suspected that when someone writes a review signed \"A Customer\", it's probably a friend of the author, since they are mostly raving ones (check them out). Well, after reading the previous two \"A Customer\" reviews, raving over such a sloppy and misleading book, this suspicion has now been confirmed..",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "2do before i die the doityourself guide to the rest of your life",
        "description": "What's on your list? Do you dream of writing a novel someday? Or of recording an album of your own music? Would you spend a month backpacking through China if you could? Have you always secretly wanted to try skydiving? Or snorkeling? Or snowboarding? Whatever your personal goals or aspirations, no matter how humble or highfalutin, this revolutionary interactive handbook will help you jump-start life changes, and experience this world to the fullest. Perhaps your life is in transition-and, after all, whose isn't? Whether you're changing careers, planning for retirement, or just starting out after graduating from school . . . whether you're plotting to make your mark on the world, contemplating how you might best contribute, or simply wondering what's next in your life . . . 2Do Before I Die will help you set personal priorities, identify life goals, and realize your dreams. Less \"how to\" than \"why not,\" 2Do Before I Die features eye-opening true stories of people who've changed their lives significantly in small ways (by learning to swim, growing a beard, working in a soup kitchen) or taken great, life-altering leaps (by starting a business, having a baby, traveling the world). With its provocative brainstorming exercises and ingenious practical tips, 2Do Before I Die encourages and enables you to create your own ultimate 2Do list -- one that can serve as your personal road map toward a uniquely rich life.",
        "authors": "['Michael Ogden', 'Chris Day']",
        "infoLink": "https://play.google.com/store/books/details?id=grUd6C0Lqo0C&source=gbs_api",
        "review": [
            {
                "review/text": "While browsing in a book store on a recent trip, this little tome with its bright red cover and the cute drawings on the cover caught my eye. Having just turned the big 6-0 a few weeks earlier, I was starting to grapple with the reality that I was somewhere near third base on the trip around the bases called life. If there were things I wanted to do, I needed to start doing them. But what should they be? I wouldn't want to miss any that could be important. Inspiration was needed.This little book proved to be just that. It's not a boring goal setting book with a kazillion exercises (most of which you'll never complete) designed to help you find your way. It's full of short essays submitted by people like you and me who have actually done the things they are writing about. And if those aren't enough, each section has some of those thought provoking questions about what is important to the reader as well as lots of other ideas of things to do in one's lifetime that didn't make the final cut to full essay status. It's an easy read but one that will keep you coming back to soak up the full richness of what the writers offer. And if the book isn't enough, the authors have a web site with more essays by people who have done the things you're dreaming about as well as the capability for you to submit your own.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I read this book whilst having a lazy morning. And it was a perfect time to read it - actually making time to reflect on my life and what I really want to make of it!This book is very provocative - it's essentially a collection of individual stories, hopes and thoughts, organized into 10 sections, combined with some helpful practical hints and tips. The aim is to enable each reader to begin, or to continue, planning what he/she really wants to achieve - whether that's making a major life change such as having a child, or daring to be spontaneous. I really liked the fact the wide variety of contributions from different age groups - it added to the book's legitimacy and its interest. It's also got some brilliant design which definitely added to the overall appeal of the book.I strongly recommend reading this and it's also a prefect gift for someone - especially if that person is at a critical juncture in his/her life, either positively or negatively. Enjoy!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Out of all the 'before I die' books -- and it seems there are a lot out right now -- this one is my absolute favourite. I don't know why it's stuck in the ghetto of self-help. Not at all chicken-soup. I usually run a mile from anything listed in that section but the graphics of this book caught my eye, along with its wide variety of true stories. And I like that while the book is obviously interested in some big topics, it keeps a nice sense of humour running throughout, while mostly letting the stories do the talking. It's mixed up, but feels fresh. An original in a world of copy-cats. It doesn't suggest it knows all the answers - but it does a great job at getting the conversation started. It has a slightly edgy feel that may just keep it from reaching blockbuster status, but I think an ever-growing cult status could beckon...I for my part am inspired to do the things I really want to do before I die.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "Without a hint of the 'do as I say, not as I do' this is a very brave idea, project and now book. From conception to delivery it is a liberation - I would lend you my copy but know I wouldn't get it back. It dares to 'think small' and celebrates the pleasure - personal or wide reaching - that freeing yourself from your own expectations can so often bring. But there are absolutely no excuses made for excuses and as the book says it is less 'how to' than 'why not'.People have been moved to tell their stories - lots of them. And these are sometimes funny or inspiring and not always perfect. This is a very generous book, in all ways.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "With this, their first opus, Ogden and Day have produced that very rare thing: a book one might read in the bathroom but that actually keeps you thinking after you have finished. My copy started out on the toilet shelf, and I duly chuckled at the funny pieces (\"Streak Naked\", \"Be Eccentric\") and sighed at the sad ones (\"Find My Natural Mother\", \"Work With The Homeless\") - but it was upon reading the nominally less-promising \"Open A Restaurant\" that I started to take more notice. For here was the tale of a life turned completely upside-down in order to follow one of those familiar 'what-if's, existing for months on nothing but insane confidence and friends' charity. After this, my book escaped the confines of the lavatory as I ploughed through the rest, finding whims that we often dismiss as impossible (\"Live In Italy For A Year\", \"Start A Second Career In My Spare Time\", even \"Come Out Of The Closet\") tackled with gusto and bracing humour. Refreshingly, the editors seem to have deliberately chosen stories that don't necessarily end happily or neatly: the new restaurant owner admits that his life has never been more replete with challenges and difficulties, but that he 'wouldn't change it for the world,' while the author of \"Run A Bed And Breakfast\" admits that her life has already moved on once more, but reflects back on the experience with an inspiring fondness.Best of all is \"Start All Over Again\" - written while the writer was travelling to begin a new life in San Francisco, as if dictated over an aeroplane telephone.A must.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I ordered this book from Amazon after browsing through it at a local book store. The design is what first caught my eye--it reminded me of one of those extreme survival guides that have been (are?) so popular. But most of us don't need to know how to survive a plane crash (good luck!) or a skydiving catastrophe (say splat!) or an alien invasion (could they really be much worse than who's running the show down here?) We just need to have a better sense of how to survive the trials and travails of Slogging Through Life in This, the World We Have No Choice But to Inhabit.Not that this book holds the secret to success or happiness or fulfillment. Who or what does? But it does contain a diverse array of beautiful examples of finding all three of those things in the march of moments that make up our lives. From the everyday to the extraordinary, I found it to be a powerful exploration of how to make meaning in a world that too often tries to make our meaning for us--and a powerful reminder of how important it is for all of us to try to do so, if we hope to die with the sense of peace and dignity we all deserve. (Not trying to be morbid, and the book certainly isn't at all--but if the inevitability of death isn't a powerful enough motivator to get us off our couches and into our own lives, what is?)I've always tried to live life on my own terms--sometimes I've succeeded, and sometimes I've failed. But after reading this, I guess I don't feel so alone in the attempt. And I feel even more inspired to keep up the valiant effort.2 Do Before I Die? Well, among many other things, stop buying books from Amazon and put all of my money into my local booksellers....until that happens, I guess I'll settle for encouraging people to check out this beautiful, inspirational book.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I've never read a book like \"2Do Before I Die.\" It's an uncomplicated way to review your life and plan for the future. Peppered throughout the book are thought provoking questions... smartly illustrated... that enhance the reader's experience.It reminds us that life can be exciting and fulfilling. It's a self-help guide to living your life without regrets!For me, it was an interesting look into other people's... dreams... and significant, life changing moments. It's insightful, uplifting, and has inspired me to think about what I want to do in my lifetime.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "I actually bought this book after I had already started my \"life list.\" I was going through a period in my life when I was trying to re-discover what I wanted to do with my life, who I was. I thought it might help me make sense of why I wanted to do some of these things so badly, or maybe make some suggestions I wouldn't have thought of. It did both.\"2Do Before I Die\" has a total of 100 stories/suggestions, split up into 10 different categories: Roots, Explore, Experiment, Challenge, Give, Learn, Express, Love, Work, & Legacy. After each section, there is a \"winding road\" of questions, such as: \"Is there anything from your childhood you feel you should apologize for?\" or \"Name one thing you wish you had done more of when you were a teenager.\" (Roots) \"If you used a false name, what might it be?\" or \"Name something you would like to try that would surprise someone you know.\" (Experiment) I kept a notebook/journal as I read this, answering the questions. It was very insightful & helpful.This book also includes the author's reason for writing this, ways to start, and even a place for you to create your own list in the back. Part journal, part inspiration, part guide, this is a fabulous book you can read over & over, and take away something different each time. As we grow, our answers and lists may change, and \"2Do Before I Die\" helps you along the way.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I first came across this book through the authors' website ([...]) and enjoyed the wide range of stories they gathered. It's an old idea - what do you really want to do before you die? - but I've never seen the question handled in such an entertaining, inspirational, and provocative way. And though it's useful as a conversation starter, or as a way to get one thinking of your own equivalents, the book can also be read just as an anthology of really good, well-told stories.The stories are divided into 10 categories, and though I didn't like them all, most were nicely written, and didn't get soppy or cliched. My favorites are 'Perform Stand-up comedy', 'Open a restaurant', and 'Build something that lasts' - but I also like the fact that serious stuff ('Come out of the closet') sits so well next to small, experimental stuff like \"Grow a beard\" and \"Plant a tree\".Overall, the book is a really refreshing take on the subject matter. I bought one for myself but plan to pick up a couple more as gifts. A nice surprise.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I have to say that this little book is very moving at times. Some of the stories are playful and carefree but there are some very introspective and powerful moments. I think people of all ages can find something emotive and empowering within its animated pages. High on the gift list! Cheers to all of the contributors!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "trash talk an inspirational guide to saving time and money through better waste and resource management",
        "description": "North Americans are overwhelmed by the immense environmental problems our world faces yet studies report that 66% would do more if they knew it had a measurable impact. Psychologists have long known that simply performing one small step will aid in defining a positive outlook on life and will inspire further participation from the individual.Trash Talk is about changing people's mind-sets by providing thought-provoking ideas that inspire readers to participate from the ground level in their waste reduction efforts. All the ideas are relatively simple and do not require any special skills or tools.",
        "authors": "['Dave Brummet', 'Lillian Brummet']",
        "infoLink": "http://books.google.com/books?id=XI0LAAAACAAJ&dq=Trash+Talk:+An+inspirational+guide+to+saving+time+and+money+through+better+waste+and+resource+management&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I was very young, the authorities drained most of a small lake in the state park near my home. My mother took my best buddy and me out to the lake, and we walked around for hours picking up trash. It was a stewardship lesson I never forgot. To paraphrase Audrey Hepburn in \"Roman Holiday,\" I will treasure that time cleaning up the lake for as long as I shall live.But, it was one of many lessons about being a responsible resident of the planet. I grew up in a home where we already practiced much of the advice in Trash Talk. That made us unusual, in a positive way. As an adult, I continue those same practices--because they are good for the earth and good for my wallet. They simply make sense.I did learn some new things from Trash Talk, which in itself was a surprise because I am noted for being able to stretch a buck and not waste things. I like the ability to live cheaply without being a cheapskate to do it. Not all surprises are good, but this one was. And I've already begun implementing some of what I've learned. Even very frugal, waste-conscious people are likely to realize monthly savings in excess of what they paid for this book. The average person could easily save that much each week.As a professional speaker on time management, I was delighted with the way the Brummets organized this book. The \"don't waste\" philosophy of Trash Talk also applied to the actual reading of the book. That shouldn't be surprising, as planning and organization are key elements of reducing trash and cutting costs.Trash Talk explains the three Rs: Reuse, Reduce, and Recycle. It then adds a fourth R: Refuse (as in, refuse to buy the wrong items). These principles form the foundation for the hundreds of useful tips in Trash Talk.The book is organized into four parts.Part One addresses commonly wasted items and explains how to reduce waste and extend the usefulness of each item. Every item has its own section, and each section ends with a bulleted list of the benefits from following the advice in that section. The items include such things as bags, carpets, cloth, containers, dryer sheets, furniture, glass, hangers, nylons, plastic rings, soap, and toothbrushes.Part Two is less oriented around specific products and more around areas of concern. Each of these has its own section, as well (again, with those wonderful bulleted lists). Areas of concern include energy use, holidays, indoor air, infant and feminine hygiene, kitchen waste, organic gardening, and water use.Part Three is really about saving trees. There's much more to this than most people realize. If everyone followed some simple steps, as outlined in Trash Talk, the benefit to our forests, streams, and air would be immense.Part Four provides short examples of good things happening. The point of including these is to show that significant trash reduction is a reality for many corporations and other organizations. An extensive list of resources follows the examples.Form is important and Trash Talk could use some editing. But even so, it was enjoyable read and easy to understand. This book is valuable, in many ways. First, remember that this book is a financial investment. It will pay dividends exceeding its purchase price, not long after you start putting it to use. Second, it provides badly-needed advice on how to be good citizens of the world. It's not a \"feel good\" book written by some politician or celebrity who wants to spout some politically correct blather. It's a practical \"how to\" guide written by people who walk the walk.Buy this book for yourself. But also consider giving it as a gift to others. It may be one of the most durable gifts you have ever bestowed on another person. Your planet will thank you.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Although many people and communities have developed an on-going commitment to recycling that has helped the environment deal with the vast amount of waste we have created, Dave and Lillian Brummet have written a book to help us go many steps beyond just recycling. They offer numerous environmentally friendly and cost saving benefits to reducing trash and reusing some of those maddening boxes, bags and other containers that plague the life of every consumer. The text is easy to understand, chocked full of ideas and tips, and contains a valuable resources list. Buy this book. Keep it in a handy place and check out some new and old ideas that can help make your home, your city, and your planet a safer, more user-friendly place to live.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Do you feel guilty when you throw away things like old brushes,cloth, containers and soap? What...no guilt trip? Well, you maychange your mind after reading \"Trash Talk\".I am amazed by the amount of research that Dave and Lillian havedon. This is a truly indepth study on dealing with waste and itshould be on everyone's bookshelf.Trash Talk is full of wonderful ideas on how to re-use items suchas pieces of carpet, dryer sheets, nylons, plastic rings,styrofoam and much much more, to make them useful again.Besides saving money by re-using everyday items, the wonderfullycreative ideas in this book will be helpful to the environment byproducing less waste.Each chapter ends with a special section on benefits from usingthe ideas in that chapter by pointing out all the ways you'vesaved money, improved on natural resources, saved time andperhaps created a new gift.This comprehensive, easy to understand, manual is recommended foranyone looking to save money, improve their lifestyle and helpprotect the environment. I know that I'll never again be able tolook at my used drying sheets in the same light! The money yousave by using some of these ideas will pay for this book manytimes over.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Trash Talk is a must read for anyone who is interested in helping the environment. It is an easy to read and understand manual, with practical tips for waste managment that anyone can use. It contains tips ranging from, how to use left over grocery bags, to, what to do with old toothbrushes, and at the end of each chapter is a nice summary of the main points. Every reader is guaranteed to find many practical ideas they can institute in their own lives",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "\" I was really impressed by the wonderful work done by the authors, Dave and Lillian Brummet as I read Trash talk. The results show how deep their research must have been and the pain they must have taken in producing Trash Talk, while they accepted the challenge to educate the people around them. This book is full of information and will ceratinly motivate it's audience to implement these simple life-changing habits. I would recommend this book with the higest rating of full five stars.\"Samia Muqueem,~ author of \"Visions of the Soul\"",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book should be required reading in classrooms. Our beautiful province will suffocate in trash if we don't teach our residents to handle their refuse in a responsible manner.Easy to read, great philosophy .... money and time well spent.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sewing 911 practical and creative rescues for sewing emergencies",
        "description": "This indispensable manual will be your guide to solving the most common sewing problems. From fixing clipped-through seams to correcting fitting flaws, master sewer Barbara Deckert offers 280 ways to repair more than 65 sewing mishaps. Clear step-by-step instructions and detailed photos make this guide accessible, humorous, and highly informative. Sewing 911 lends a helping hand when things go wrong. Book jacket.",
        "authors": "['Barbara Deckert']",
        "infoLink": "http://books.google.com/books?id=3xXKygAACAAJ&dq=Sewing+911:+Practical+and+Creative+Rescues+for+Sewing+Emergencies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an excellent book for &quot;disaster contros&quot; for the inexperienced or experienced sewer (I hesitate to say &quot;seamstress--probably not politically correct). She has a wealth of very practical advice for fixing or disguising problems ranging from scorched places from errant iron placement to creative solutions when suddenly you discover that there isn't enough fabric. She has an extensive section on stain removal, which is extremely useful. She knows what to do when that garment that one just lengthened still bears the tell-tale line where the hem was. She knows what to do when that buttonhole on the front of your garment looks bad or is too big or too small. She not only tells and has illustrations showing how to mend spots where there is a hole or the seam is trimmed too close or cut clear through; she also has very creative suggestions to disguise such things when mending them isn't practical. She knows how to fix it if the right and left sides of the front of a double breasted garment are not the same length, or if the underneath layer sags. This is a really useful book for anyone who sews. It opens up to lie flat so that as one works on a problem, using the book as a guide, one doesn't have to fight the book to make it stay open. The book, itself, does not present yet another problem. I highly recommend this book as an ideal gift for anyone who sews, including one's self.",
                "review/helpfulness": "37/38",
                "num_reviews": 38
            },
            {
                "review/text": "Don't feel like the Lone Ranger if you make an occasional sewing boo-boo. We all do, and author Barbara Deckert encourages us, through her imaginative examples, to find fashionable fixes for those annoying errors.Pesky puckers on a lapel? Neckline gaping immodestly? Bungled buttonhole? Now there's no need to toss that garment aside in frustration. Barbara addresses these and dozens more sewing emergencies with highly creative but perfectly do-ablesolutions. Concise, engaging, and packed with information, Sewing 911 will take the stress out of those inevitable sewingmistakes by sparking the sewer's aptitude for creative problem solving.I finished this book in one sitting because I was so riveted by the possibilities. Find out how disguising an accidental snip in your fabric can actually take your garment to the next level - from ordinary to designer-detail stunning.Sewing enthusiasts have long needed an author who is not afraid to admit that she, too, encounters the occasional &quot;oops!&quot; Barbara Deckert has made this taboo topic highly approachable and even fun to deal with. Sewing 911 is a must-have reference for every sewer's shelf.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "I found this book while away travelling. First of all, I like the hard cover and internal spiral. This book covers a lot of problems we sewists come across. Loads of fitting issues are addressed as well as those awful ironing accidents we tend to have.There are tips on what to do when you don't have enough fabric and how to fix those nasty buttonhole problems. I really enjoy the sense of humor that Barbara Deckert showed in the book. The book also gives solutions to machine problems and there is a very good stain removal chart at the end of the book.Her tips are sensible and helpful. I am very glad I stopped to purchase it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I haven't been able to really use this book quite the way I thought, but it has come in handy quite a few times. Very good for those &quot;oops&quot; moments!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a great book for anyone who sews or mends. It covers a lot of things that can go wrong while you're sewing -- accidents that you might think have just ruined your entire project, but which can actually be fixed if you're patient and careful, as well as things beyond your control, like holes or flaws in the fabric you're sewing with.Filled with excellent advice, highly recommended!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the illustrated hasslefree make your own clothes book",
        "description": "A straightforward guide to making one's own clothes explains how to use old clothing as patterns for new items, demonstrates how to alter clothing in accordance with new styles, and more, in a primer that shares step-by-step illustrations for a variety of projects. Original.",
        "authors": "['Joan Wiener Bordow', 'Sharon Rosenberg']",
        "infoLink": "http://books.google.com/books?id=FL3qCdjwuQgC&dq=The+Illustrated+Hassle-Free+Make+Your+own+Clothes+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is designed by hippies in the Haight for people who are scared of commercial patterns, so you'll be ahead of the game if you know how to sew at all. I've used this full version from the library and have the abridged version at home and used it for years. The system is based on simple cuts, minimal or no darts, few seams. You use clothes that fit you as the basis for making simplified versions and, if they're too small, draw larger versions. 80% of the design is in your fabric choices, after all. The same simple dress in printed velvet, chiffon, or plaid cotton is three very different garments. Patterns include a-line and dirndl skirts (leading to all kinds of peasant skirts); the sweeping sorcerer's dress, a true caftan, an empire dress, a turtleneck or hood for neck variations, and top versions of them all; fitted or elastic-waisted trousers; and some outer wear like ponchos and vests. The full version goes into more detail and variations, and includes projects in crocheting and knitting, like scarves, hats, and baby balls, and sewing projects like bags. If you're looking for simple, fun, comfortable, utilitarian clothes, this is a one-stop investment in place of buying twenty simple patterns.",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "It's a sewing guide for creating your patterns for making clothes, it was first published back in 1971 and written very much from a hippie point of view. The clothes are mostly dart free, free fitting things. Comfortable clothes for people who want to express themselves and don't wear bras. The language is fantastic. I can't stop smiling because it's almost like talking to my mom and her friends to read it. The clothes are great, and the authors make it clear it can all be done by hand if you don't have a sewing machine. It almost inspires me to sew some skirts for myself by hand. Almost. Machines do make everything quicker.Instructions for pants, dresses, skirts all illustrated by hand. If you like zine type illustrations, you'll love these. If you like sewing and you are more ThreadBanger than Vogue, you'll love this book.One of my favorite things about this book is the emphasis on mending, repairing and modifying existing clothes. We do a lot of shopping at thrift stores, and I try to keep my clothes going as long as possible with patches and mending. They recommend doing bits of embroidery to patch large rips and tears, and that idea is just great.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book gave me courage and inspiration when I was beginning to teach myself how to sew. It helps to have a sewing machine, but it isn't necessary. The extremely simple and charming illustrations and directions say it all. It's not haute couture, but it could be the beginning of it for an imaginative teen or budding designer. It was a lot of fun for me, and it demystified the craft of sewing useable clothing for myself and family.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This book said it was published in 2008, so I thought the cover font and such was an attempt to appear retro or whatever. But instead what I purchased was a book originally published in 1971! And has the designs to prove it. If you are into dressing like a hobbit or making your jeans into bell-bottoms with a nice patchwork contrast fabric or worse yet, if you want to add a ruffle to those jeans from the knees down, then you will love this book. But if you are normal and not dressing for a halloween party or comic-con -- DON'T BUY THIS BOOK. It is not modern or remotely fashionable at all; it's outrageously outdated. The illustrations are terrible and confusing. The instructions are all for things that look super home-made, like sixth grade home-ec home-made. And the book recommends hand-sewing over using a machine. I would return it, but don't want to go through the hassle. That said, if anyone would like to buy it off of me, let me know... I'll talk you out of it.",
                "review/helpfulness": "17/20",
                "num_reviews": 20
            },
            {
                "review/text": "If you're just starting out this book is great! It is very simple (which is awesome for me because I don't know jack about sewing) It gives you a great place to start. The only thing I didn't like about it, its very \"hippy\" there is a few things I would never use. But for the price they give you a huge amount of information and I will recommend this book to my friends.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have a copy of this book from the 70's. I happened upon it last night and showed it to my 20 year old son. What happened to the cover with the hippies on it? It is a really fun book that I think todays young hippies and homesteaders could learn from. I recomend it along with Alicia BAy Laurels clasic LIving on the Earth. Christa",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I stumbled on this book in the library this weekend, and devoured it in a few hours. This a wonderful, \"you can do it\" guide to sewing and making your own clothing. It's a refreshing change of course from the modern books that shroud crafts and sewing in pristine, white background mystique that make it seem like you can't create something unless it's perfect and that you're not going to get to perfection unless you invest A LOT of time and money.These guys jump in with remodeling your existing clothing, making some skirts and then pants. Pants? Wow- to hear most other guides tell it, those shouldn't even be attempted until you've perfected skirts and tops.I love that they advise making patterns- if you're going to use a pattern- from brown paper bag material. I love that they minimize the number of cuts you need to make- there are a few designs that have you cut front and back out of the same piece of fabric. They do note the difficulties attendant to set-in sleeves, but they describe how to get it done in less than five steps. Practice will be required, but it can be done!As they note in the introduction, this isn't where you're going to find steps to make the perfect button-down shirt or khakis. And why should you, when there are so many on the market (or in the thrift shops)? This guide will tell you how to make freer clothing (a lot of which can look great). It's a guide for men and women's clothes, but they shrug a little bit about the distinction- we're all wearing pants and tops, right?I loved the section on embroidery, which I've never had any interest in before, and now that I've read in other reviews that there was a section in here on knitting and crocheting, I feel cheated that it isn't in this one. There is, however, a section on making some accessories and children's clothing, toys and pillows.I hope these guys wrote more!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "working on yourself doesnt work a book about instantaneous transformation",
        "description": "Revealing a revolutionary new approach that allows readers to reach a state of awareness and \"centeredness\" that in the past was rarely, if ever, achieved, this book is a radical departure from the concept of working on oneself to bring about change.",
        "authors": "['Ariel Kane', 'Shya Kane']",
        "infoLink": "http://books.google.nl/books?id=s3gIAAAACAAJ&dq=Working+on+Yourself+Doesn%27t+Work:+A+Book+About+Instantaneous+Transformation&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I originally bought this book because the title intrigued me. You see, after reading many, many self help books and going to seminars by Tony Robbins, Zig Ziglar, Brian Tracy and doing several &quot;self awareness&quot; workshops over the years, I became jaded. Why, after reading and trying so hard, did things not work for me? Why do I go right back to frustration and dissatisfaction?I understood the reasons why after reading the Kane's book. I understood that transformation and change and &quot;self improvement&quot; doesn't have to be a struggle: that there is no way I can live the life I want to live by &quot;working on it.&quot;There are no techniques in this book. No 5 steps to success. No formulas. No, &quot;we've observed and studied happy/successful people for years and this is what they have in common.&quot; In place of that, they urge us to be where we are at. Stop judging and blaming ourselves and others (especially our parents) for how we &quot;turned out.&quot;. By just being aware of how we are in any given moment, and not judging that experience, we can transform. That is their message. Seems simplistic, doesn't it? It is far from it.It is hard for many of us to understand that non-judgemental awareness of how we are being in the world is the key. It is difficult to accept that fighting where we are at and how we are feeling keeps us in that space of pain and anger.This is not a rehashing of old ideas presented with new words in new ways. This was, for me, totally different than anything I had been exposed to. This is an easy book to read. it is very clearly written. I can't recommend it highly enough.",
                "review/helpfulness": "212/214",
                "num_reviews": 214
            },
            {
                "review/text": "I am a professional female that has felt out of place since I was 13. I have seen therapists and searched for something to fix myself my whole life. I have read many self help books and done The Landmark Forum. In 1998 I landed in an AA room and was taught the 12 Steps of recovery. I read the BIG BOOK and thought the stories were exaggerated since I couldn't relate to them. I stopped drinking and took the suggested steps; taking a \"fearless moral inventory\" of myself by identifying my so called defects of character. As I grew in recovery, I was to take a daily inventory of myself which constantly reinforced that there was always something wrong with me that needed fixing. I now have 7 years of uninterrupted sobriety and recently I had the pleasure of reading the book \"Working on Yourself Doesn't Work\" and WOW!!! Did I get it...See in AA we strive to live a day at a time but to be able to live a moment at a time was not something I had ever considered (I mean who can live in the moment there is so much to plan for?). It wasn't by doing the 12 steps that I learned I was living my life based on exaggerated truths made up as a child. These ideas ranged from \"don't let anyone ever tell you what to do \"to\" don't ever depend on any man\". These ideas never supported me in my life. They in fact have hindered every relationship I ever had whereby I never married or had children.Now that I am aware of those ideas thru reading this book, I have never looked back or thought about them again. I have quit trying to work on myself. I have accepted my life and everything about it.My life is so easy today. I have actually been able to save a relationship that I unconsciously have been sabotaging for the last 3 years. I saw clearly why I was afraid of success. Since I now have the insights, I choose not to go back to the past and judge myself or others for anything that happened. I also choose not to spend time in a place that doesn't exist yet. I can just concentrate on the fabulous moment and how it feels to be here right now. Talk about freedom from the bondage of self. My shackles have been taken off permanently. Thank you to Ariel and Shya for sharing their incredible experiences with the world and most importantly for the ease in which they do it.",
                "review/helpfulness": "149/155",
                "num_reviews": 155
            },
            {
                "review/text": "Working On Yourself Doesn't Work; that's a great title isn't it? It got my attention. I have observed over and over again that it is awareness of the impact of my actions that creates change, and once the awareness is there, the change comes through me rather than from me. Once I became aware that smoking was killing my mother and wasn't giving me anything that I truly wanted, I just stopped doing something that I didn't want to do.Having recently read and enjoyed Loving What Is by Byron Katie, I was drawn here by a review of her book which recommended this one as well. Then when I saw a couple of sour reviews, I dismissed them as negativity from resigned and cynical people who couldn't believe in the possibility of transformation.I rushed right out and bought the book that very night, and read it in a couple of hours.The conversations in this book are great. If you haven't come across them before, I think you'll love this introduction to them. So, I have no quarrel with those who love this book.I did find that I had already come across pretty much every conversation/idea presented in this book before. It appears to me that the Kane's wrote a book containing some of the more powerful conversations from The Landmark Forum. (Landmark is the current iteration of est.) The resemblance is just uncanny. Not that those ideas or conversations are even unique to Landmark, but the grouping and presentation of them, seems to defy coincidence. For instance:* Transformation is the result of awareness, rather than an effort to fix or change.* Who I am is not a function of my past, but rather the future I'm living into.* Forgiveness as an access to completion and growth.* When you see it as it is, it will disappear.* How to dissappear physical pain by paying attention to it.* What happened in the past is what happened; the meaning of what happened is something we placed there.* What you resist persists.* The difference between choice and decision.* The idea of an inner voice which is always listening and commenting on our experience and thoughts.So, if you feel that you are already well versed in these conversations, you can pass on reading this book. I personally don't regret reading it, or having it to lend to others.If the topics listed above are new to you, by all means join us in these conversations... through this book... through other books... through Landmark... there's lots of roads that lead here. And being in these conversations is extraordinarily valuable.--Frank Boyd",
                "review/helpfulness": "112/145",
                "num_reviews": 145
            },
            {
                "review/text": "This is a book that both enlightened and touched me on many levels. We live in a culture that is either striving towards the future, what is the next goal I need to achieve, or obsessed with the past, what wrongs have been done to me by my family, my culture, my religion, etc. The idea being that either achieving goals, or figuring out why I do the things I do will bring me happiness and self-satisfaction. I've personally tried both approaches and found them lacking. I have set goals and accomplished them. I read books and took seminars to &quot;figure out&quot; why I was the way I was. Neither of these approaches produced any lasting sense of accomplishment. At best all I got was a brief respite from a sense of despair.The Kanes have a different approach, awareness, being in the moment, is the key. The Kanes define awareness as a non-judgemental seeing of what is. This was a radically different way of looking at things and the effects on my life have been profound. I find that I have become vastly more effective with less effort. My relationships have never been so rewarding and my work is also greatly improved. I've bought copies of this book for my family and many of my friends. I recommended it to them, and I recommend it to you.",
                "review/helpfulness": "128/135",
                "num_reviews": 135
            },
            {
                "review/text": "This book was a disappointment! We have heard it all before, only it has been said better. To save you the trouble of buying this very short book (the advertising section for their other books and workshops is about as long as one of their few chapters)I sum it up for you:Live in the present,don't judge or critizise, just notice what happens, and the feeling will go away, don't resist emotions etc etc Some stories to illustrate their points are outright ridiculous,e.g.,the author gets a nasty burn on her leg while riding a motorcycle (and goes on and on about how much it hurt) but instead of going to a doctor she sits around hurting all day long, takes another bike-ride, puts a little ice on the wound and learns to live through the pain by visualizing its colour and how much water would fit into it (one of their principles- take whatever feeling comes and live it!)Not worth your time or your money!",
                "review/helpfulness": "110/129",
                "num_reviews": 129
            },
            {
                "review/text": "I purchased this book because a reviewer referenced this in relation to Eckhart Tolle's THE POWER OF NOW. It was a hugh disappointment. If you have never been exposed to anyone such as Deepak Chopra, Eckhart Tolle, Ken Wilber, or other insightful people, may-be it would serve as an introduction. The authors basically fit a brochure into the space of a book by double spacing, including useless drawings, and leaving lots of blank spaces. Skip this and go right to the THE POWER OF NOW.",
                "review/helpfulness": "86/106",
                "num_reviews": 106
            },
            {
                "review/text": "While the authors offer some good ideas, they show an astounding lack of self-awareness with regard to their own development. They seem completely unaware of how they arrived at their present state of consciousness. Consequently they give advice that is inconsistent with their own experience, as revealed by their stories. Their stories demonstrate, if anything, the OPPOSITE of the book's title: Working on yourself sometimes works!For instance, on their first date together (the authors are a couple), she was injured and he had the \"magical\" insight to help her relieve the pain. He did this through guided visualization, concentrating on the \"here and now\" in a spirit of calm acceptance. Terrific, yes? Yes. This is a story they tell you about half way into the book.And yet, they start the book describing how they--together as a couple--spent years attending self-improvement workshops. Apparently, whatever insight they already had on their first date was not enough. It was unsound, or they could not apply it consistently, or something else was wrong. They felt unfulfilled. So they looked and looked, trying many different ways to become they people they wanted to be.Finally, they attended a workshop that was actually more of an extended retreat. It was six months long and involved meditating all day, every day. And what do you suppose happened? They came home and realized that they had arrived where they wanted to be. They were finally at peace, living happily in the here and now.But do they credit the intense meditation practice for this astounding transformation? No they don't. Nor do they state appreciation for their other workshop experiences, nor their instructors, nor the various other people that no doubt helped them in large or small ways over the years. Instead, they write a book that says none of that stuff helped. Is this credible? I don't think so.Don't get me wrong. The Kanes advise us to adopt some wonderful practices, such as forgiveness, acceptance, and awareness of the present moment. That's all great. The problem is, the Kanes just don't account very well for how they arrived at their current capacity to engage in these practices themselves--what it took for them to get where they are. Far from it.The advice provided is in fact quite vague, so that it could be wrong just as often as it is right. For example, they state a spiritual principle that 'whatever you resist persists,' but if you think for a moment about this principle it makes sense only in a very specific psychological context: Mentally denying facts and feelings puts a person in a difficult bind. No argument there. But surely there are many other negative things in life that persist only if you fail to resist them, and may go away if you do. Isn't that what civil disobedience is all about--a peaceful and productive way to resist wrong-headed public policies? Isn't every act of courage a form of resistance? Resistance is sometimes important, and good to do. Even psychologically speaking, certain thoughts should be actively resisted, or else they will persist to your detriment. (For instance, see the book Feeling Good, by David Burns, on ways to resist and thusly to improve on thoughts that otherwise would persist as feelings of depression.)Ultimately, the Kanes are poor writers. What's more, they are poorly informed in matters that are core to their topic. But when the Kanes try to document their ideas for readers to use outside of the workshop setting, they fall down badly. They present poor, sometimes erroneous explanations that may work for some people (who happen to \"get\" the intended message anyway) but poorly serve readers who will not untangle the good ideas from the considerable store of misinformation loaded into the book.One important set of errors lie in the Kanes' gross misrepresentation of psychology. This is ironic, since they themselves offer what is clearly psychological instruction. The authors evidently have a very narrow view of psychology based upon a limited range of therapeutic approaches focusing on the past and slow, incremental improvement. The Kanes are altogether ignorant of other therapeutic approaches that are more compatible with the Kanes' own outlook and sometimes produce \"transformational\" change. The Kanes are equally naive on the topic of anthropology, which they contrast against psychology in a vain attempt to make some point about the value of dispassionate observation. It was sad to read such a mish mash of poorly constructed ideas and examples. A good editor would have seen to it this part of the book was rewritten before publication.The Kanes definitely are at their best when telling personal stories. These stories are often interesting and sometimes even touching. But even here they struggle, as they try and then fail to draw meaning from their experiences in a cogent set of general principles.I give two stars to this book (rather than one) since it offers a few worthwhile insights, even if it is otherwise muddled, confused and weakly developed. I would suggest looking elsewhere if you want a book that offers sound, well considered advice on achieving presence in the moment, self-awareness, etc. You might try Debbie Ford or Deepak Chopra, for instance. You also might skip quickly past the Kanes' explicit advice and concentrate instead on following their implicit example, doing the one thing that evidently led them to enjoy greater peace of mind: daily meditation.",
                "review/helpfulness": "77/100",
                "num_reviews": 100
            },
            {
                "review/text": "0I purchased this book due to the rave reviews but was verydisappointed. The authors claim to have developed a new 'technology'called &quot;Instantaneous Transformation&quot; which is about achange of states, shifting of realities. The concept is to accept andbe aware without judgement. This according to the Kanes can lead to aquantum shift in your life by teaching you how to remain centered, beincreasingly satisfied, develop better relationships etc. As I readthrough the book it all seemed so familiar. These concepts were verywonderfully presented over 15 years ago by Baba Ram Dass in a bookcalled &quot;Be Here Now&quot;. It was also written with wide spacingand simple sentences like this book. The concepts of&quot;Instantaneous Transformation&quot; are also used in many otherphilosophies. .... The book has little meat and many of the storiesdid seem to be judgemental. A characteristic they are opposed to. Ialso disagree with the premise of becoming one with yourfeelings. That is, if you are sad embrace it. There is much you can doto uplift your mood and why not be joyous if you can be! I find that Ireally can help determine my happiness. Yes sometimes I am down butthere is much I can do to brighten my day and why not do it instead ofsurrendering to gloom. The Kane's also state that being with someoneclose to death can be a rich experience and feel wonderful. Thissaddens me. I personally found no joy and delight in this book. ....",
                "review/helpfulness": "52/83",
                "num_reviews": 83
            },
            {
                "review/text": "Is this book for real? The Kanes' give us 2 main ideas (awareness and non-judgemental experiencing) and a whole lot of fluff. While these concepts are hugely valuable, they are nothing new (certainly not &quot;trademarkable&quot;!!) and have been elucidated and much better articulated by others: Huxley, Wilber, Krishnamurti, Batchelor, Joko Beck, Tart, just to name a few.Folks, these people are out to make money and this book (which is small on content and big on advertising) and their trademark is proof. Unfortunately their catchy title (as evidenced by all the positive reviews) is helping do just that. Don't be caught!! Spit the hook out and swallow something of substance.",
                "review/helpfulness": "60/75",
                "num_reviews": 75
            },
            {
                "review/text": "Working on yourself doesn't work - what a provocative title! Haven't we all tried for most of our lives to make things better, to improve ourselves, to grow? And there comes this odd proposition: Forget about working on yourself! I was confused and intrigued. Then I got really excited, as I started grasping the concept and its impact. I can stop trying to get somewhere. I can stop trying to become somebody else, a better version of me. I can relax, I finally can be myself.The Kanes' book opened the door to a new possibility for me, a new way of dealing with myself and others. Living in the moment is their key proposal, and throughout the book, different aspects and examples of living in the moment are given.It sounded odd and overly simplistic at first, but then I tried it and the magic began... It's not a book to be read and then pondered over, it is a book to be lived. When I started exploring how I dealt with past and future, looked at my patterns and ideas, an exciting journey of discovery, discovery of myself began. I found out that I don't need improvement. I found out that my friends, my husband, did not need improvement either. I rediscovered how to have fun and how to be fully engaged in what I was doing, rather than worrying about the past or planning for the future. And things have gotten easier - at work, at home. The greatest news is ... it doesn't seem to end. There is no limit to having a great life and it keeps getting better!Thank you Ariel and Shya Kane for a wonderful book that has shown me a simple yet so powerful new approach to my life.",
                "review/helpfulness": "64/66",
                "num_reviews": 66
            }
        ]
    },
    {
        "Title": "handmade bags",
        "description": "Fab and functional bags to sew ... that perfectly fit your life on the go! Favorite bag designers and top bloggers share 15 unique organizers, all tailored to a specific purpose. From a laptop folio or a gym bag to an airport sling or a trunk organizer, every tote has just the right features to keep your essentials within easy reach. Practical, stylish, and versatile by design, each carryall has multiple uses. Projects are organized by skill level, from confident beginner to more advanced, so you can grow as you sew!",
        "authors": "['Lindsay Conner', 'Janelle MacKay']",
        "infoLink": "https://play.google.com/store/books/details?id=Q9JsCwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "\"Handmade Bags\" has some really great project ideas. It starts out with the basics - supplies, sewing for beginners, etc. and then moves on to the projects (which have whimsical names like \"Red, red rose\" and \"Gilded cage\"). There are 30 professional looking project ideas - all with great illustrations and detailed instructions. Some of the projects use some interesting materials, however I was disappointed that there were a couple of \"knitting with wire\" bags - that's just not my thing.Although most of the patterns seem pretty straight forward, they are small grid illustrations - meaning you can't take the book to the copy machine and enlarge - you have to use traditional tailoring methods/measuring/etc. to scale up the pattern. For people who have never sewn, I would advise getting \"Making Handbags\" by the folks from FIT first and then use this book for additional creative ideas and techniques.",
                "review/helpfulness": "39/41",
                "num_reviews": 41
            },
            {
                "review/text": "I was looking for a starting point for making bags...this is not it. They have a few cool bags, but I was looking for something a little more &quot;practical&quot; and frankly, a little more &quot;cool&quot;. You know? Buy this book if you want a coffee table book, but don't buy it for anything else...",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "Handmade Bags is full of unique and gorgeous bags to make from a variety of materials, with detailed step-by-step instructions, tons of photos, and an introduction to basic sewing at the beginning.This would be a fantastic book, BUT and this is a big BUT-there are no patterns. For the purses made out of alternative materials or knitted, this is not an issue, as the instructions and photos clearly show how to make the purse. For the sewn purses there is a small photo of a grid with a pattern outline shown and each grid square equals 2\". The book has a section on how to make and use patterns, but for less experienced sewers this can be daunting. For purses in a basic square or rectangle shape making a pattern would be easy, but several of these bags have unique shapes so creating a pattern for them would be more difficult. Although it states how much fabric is needed for each purse, it doesn't give cut dimensions. Making the purses without patterns would be ok if the directions stated \"cut the shape with a 16\" base ending with a 20\" fan shaped top.\"Handmade Bags sends a mixed-message. It is written in a basic, mostly easy to use format that breaks the process down, so even a novice sewer could make make one of these bags, but the lack of patterns or cutting dimensions pushes it into the realm of experienced sewers. This makes the book frustrating for folks like me with basic sewing skills, but no experience or time to learn to make patterns.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "There are a lot of cool ideas in this book, along with 30 bag patterns for you to follow. In addition to traditional fabric handbags, here are several &quot;wire bag&quot; designs in this book.Written by professional accessory designers, this book is full of clever and innovative ideas. However, in spite of the creativity, I did not find many bags I would actually make.However, it is well written with many good sewing tips. It even includes a fully illustrated section on hand-sewing which I found very useful.If nothing else, this is a good &quot;idea book&quot;.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book is really well presented with amazing pictures and is easy to read. If you have any knowledge of sewing and any interest in making handbags that appear professional this is not the book for you, I think it should be reclassified as a craft book for kids. If you're an adult save your money.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Most of the purses in this book were so foolish looking I wouldn't use them if someone gave them to me, much less waste my time to make them. I was looking for bags to make and sell but I have found better ideas for free on the internet. To this books credit, it does give good instruction on construction basics such as pockets and linings.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mary mularis accessories with style",
        "description": "This guide features more than 40 sewing projects for accessories to wear and carry, made from a variety of fabrics and using techniques that are quick, easy and economical. The book contains a bonus alphabet for monogramming, and projects featured include scarves, jewellery, belts and bags.",
        "authors": "['Mary Mulari']",
        "infoLink": "http://books.google.com/books?id=cnZEuQEACAAJ&dq=Mary+Mulari%27s+Accessories+with+Style&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Truly a wonderful book. Beautifully photographed, this book is a treasure trove of ideas for creating innovative (and easy to make) &quot;comfort&quot; gifts - practical gifts you'd sew for special friends. My favorites include a nice, big bag made from window screen, a unique purse in the shape of a Japanese fan, a generously sized cowl poncho, and a multiple-use travel and television shawl (with deep pockets to store supplies or simply keep hands warm). I was especially thrilled to find full-size patterns in a pocket attached inside of the book. Each project is fully detailed and easy to understand, with many drawings that clearly explain the accompanying text. My Christmas gift-making is underway!",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I got this book because I plan to be travelling in the fall, and I wanted some ideas for things to make my travels easier. I love the &quot;poncho which folds up in its own pocket&quot; idea, as well as a warm wrap that would be just what I need for staying comfy on the plane, some slippers that would be perfect for travel, ideas for adding pockets to ready-made clothes, a &quot;purse/necklace&quot; great for carrying a credit card and room key, ideas for simple scarfs which will stretch my travel wardrobe, ... well, you get the idea. (I also orderd by the same author a book on Travel Accessories to sew, but that hasn't arrived yet. If it's anything like this one, I'm sure I'll be pleased!)",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "Full size patterns. Need i say more? But i will anyway.The accesories and bags are done in a more matronly style than i like, but i used my own funky fabrics, etc. and was VERY pleased with the ease i which the projects were completed and the adaptability of each project to my particular vision.And, full size patterns. With handbag patterns selling at [price] and up, i saved a ton with this book. Good for the beginner or those looking for instant (or as instant as this gets) gratification. Clear and concise instructions.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "If you're looking for some \"neat little things\" to make for yourself and for others, start here. Can't go wrong. I've made so many coin key pouches I can't count them. I give them away all the time, and it only takes a small amount of fabric, a short zipper, a small bit of ribbon and a \"split\" key ring (sold as \"split rings.) Wonderful also is the Ultrasuede belt pouch, which I made out of a nice striped denim when I couldn't find Ultrasuede. A little bit of accomodation for the different fabric, but it's wonderful for shopping, a quick trip somewhere, or when you are traveling. And that's just for starters. . .",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Wow, the previous reviewer who said it was lame and laughable was 100% correct. The projects are just jaw droppingly stupid, outdated and ugly. The materials used on the example projects are mauves and other 80's looking upholstery fabrics and colors. One bag looks exactly as if you were to sew a copy of a brown lunch sack and hang it on your back. The checkbook cover's pen holder isn't even sewn on straight, and speaking of the pics, wow bad photography. The bags blend into the backgrounds, the backgrounds are unattractive.. etc...There are some models in the book, all of them old grannies, and I am sure they are all sweet women. I have nothing against senior citizens, but maybe the fact that, that is who this book is FOR, should be mentioned in the description. Do you really want to make a bib for yourself to wear while you eat in your car... a bib made by sewing a high-necked piece of fabric to an entire bath towel? Do you like velcro alot? Lots of velcro in this book.I tried to like it, I tried to decide to keep this book and ignore the fabrics, photos, weird shapes from an 80's country crafting mindset, and make things look fresh by adding my own touches, but there really is no saving these sad projects. I am returning this book. It's too bad, because having the actual patterns included sounded wonderful.P.S.The big secret outside/visible zipper trick is no good. If you leave the edges of the \"zipper hole\" raw as instructed, the fabric will fray, threads will get into, and jam your zipper.Do not be fooled by the glowing reviews. This nice lady has written lots of books and has a following - that's great. Just don't believe the hype.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "I sew and sell on eBay and wanted to expand my knowledge so I could make purses and totes but had no clue as to construction. I am so happy I got this book.Besides the patterns in the back of the book, the most valuable part of the book to me was showing how to install zippers the easy way, and how to pre-sew &quot;anything pockets&quot;. Now I can draw up my own patterns and embellish them with detachable coin purses, zippered pockets any where I want, and I've got many more projects to &quot;study&quot; and learn from. The &quot;how to&quot; sketches in the book were easy to follow. This year I can make christmas gifts everyone will like! Fantastic book!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Again Mary Mulari has made sewing fun!! Great projects for friends and family. Useful items... things that everyone could use. Good pictures and directions. Quick and easy bag, ponchos and more. This book is a must if you have kids or teens that sew.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a good book, however, one should keep in mind that one can only use so many accessories presented. I gave this three stars as I thought it was overpriced considering that any one person would only use a few of the ideas & instructions presented. It does come with patterns for the projects, which is very nice. I was inerested in handbag ideas and I thought, for some reason, it would have more handbag illustrations. I am trying to keep in mind that any one book will be reaching many people and for every design I am not inerested in, many others would be interested.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sewing from square one turn simple fabric squares into 20 projects",
        "description": "\"Twenty simple sewing projects that begin with a square of fabric; no pattern necessary-for fashion accessories, home decor, and crafts. Each has step-by-step instructions with how-to photos. Many different sewing skills are learned\"--Provided by publisher.",
        "authors": "['Darlene Cahill']",
        "infoLink": "http://books.google.com/books?id=k35eAQAACAAJ&dq=Sewing+From+Square+One:+Turn+Simple+Fabric+Squares+into+20+Projects&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Ordered this book the first day available. Well written, lots of great pictures, very easy to follow and understand - like Darlene's presentations on HSN. This is pretty basic stuff but since Darlene could sell me sand by the truckload (insofar as sewing) in the middle of the Sahara, well, 'nuff said. Cannot wait until she gets a DVD ready for sale. I just always wonder why, as personable, friendly, helpful, and knowledgable as she is, she stays with this terrible line of products (Euro-Pro) when she could easily speak for any of the top of the line machine companies. Just as good as I hoped for, but be advised - pretty basic stuff. As always, thanks Darlene, and keep those tips coming!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I'll admit, I feared the sewing machine. It made me nervous. I couldn't understand (and still don't, really) how it worked, and so couldn't visualize myself doing anything effectively.This book, although it only contains a few patterns, was a great starter. It includes patterns, extremely clear directions, great tips on using your machine, and I was able to complete my first-ever project in just a couple of hours, including a set-in fringe (not so easy your first time out!).If you're an advanced sewer, this book will probably not be terribly exciting for you.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I love to sew and i teach and this book is great for a beinger who wants to sew and start sewing right away the instructions are easy and i love it i couldnt get the book at hsn because it sold out and i found it here for a better price thanks must buy !! for home projects its for any crafter who needs some easy and fun ideas thanks",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "limit of vision",
        "description": "Illegal nanotechnology, a dead scientist, a journalist investigating an enigmatic cult in the Mekong Delta, and a mysterious power hovering over the earth form the locus of this powerful new novel by the author of the The Bohr Maker. Reprint.",
        "authors": "['Linda Nagata']",
        "infoLink": "http://books.google.nl/books?id=W4XuL513rgkC&dq=Limit+of+Vision&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Virgil Copeland's little conspiracy is turning into a nightmare. When he and his colleagues smuggled a few LOVs to Earth and used themselves as test subjects, Virgil never suspected that two of his friends would soon be dead, and he himself on the run from international law, on his way to the place where the mutant LOV colonies made landfall...&quot;A Limit of Vision&quot; is confused. In the beginning it tries to be an edgy, sci-fi thriller, but soon slows down to a crawl and attempts to be a hard SF novel. The beginning features a moderately exciting escape sequence, a satellite crash, and a tidal wave, all in about fifty pages. Then the plot abruptly stops. All characters quickly and conveniently sort out into heroes and villains. The heroes suddenly become shallow and predictable, and what they're doing isn't very exciting: they farm the surviving LOVs in fish ponds, while the outside world tries to starve them out of their little reservation.&quot;Limit of Vision&quot; treats its general subject matter - LOVs, an intelligent form of nanotechnology - in an extremely simplistic and straightforward manner, with no ambiguities. Despite having an incredible knack for mutation and problem-solving, they don't seem to pose any threat at all, and their &quot;mind-enhancing&quot; capabilities are hardly taken advantage of.The book's tone is essentially dead. The narration moves quickly, but leaves no lasting impression. Characterization is lacking and follows predictable patterns: a blossoming romance between the male and female heroes (who would've thought!?); an enemy who becomes an ally, etc.In a nutshell: lacking in both premise and execution.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "I've read all of Linda Nagata's previous books. As a group, all of her previous books were enjoyable and reasonably well written. The characters were well described and the plots were interesting. The only complaint that I had was that the books really weren't that accessible because of the level of technical detail. While I enjoyed her \"hard science\" approach in her earlier books, I think it also kept her from getting a wider audience. From that perspective, I think that _Limit of Vision_ is an excellent attempt to broaden her audience while still remaining true to her original \"hard science\" roots. In addition, I think that with each book, Nagata's ability to create a thought provoking and challenging story has increased._Limit of Vision_ is set in the near future. A trio of scientists has been working on a project for a corporation basically exploring the feasibility of using organisms named LOVs (since they exist at the limit of human vision) for any practical purposes. Unfortunately, the scientists are hampered because all biotechnology is strictly regulated b/c of a horrible sounding accident caused by biotech gone awry. So, their LOV experiment actually lives on a space station in orbit around Earth. Before the LOVs were taken to the space station, the scientists stole some of them and implanted them on their foreheads.This book is about the unexpected and unpredictable consequences of that action. Some of the questions that were raised in the book include: what defines consciousness? At what point does an organism stop being \"animal\" and start being something else? If an organism has consciousness, then do we have the right to just destroy it? And if we don't destroy it, does it pose a threat to the very things that define us as humans?It's not a perfect book. It does leave some loose ends. It might even be missing some details throughout the book. But, that said, I absolutely had a GREAT time reading this book. It read almost like a thriller rather than some dry biotech story. In my mind, it encompassed many of the things that make sci-fi fun to read - a fast moving plot, lots of technology well used, a real concern about what might happen in the future. With a little stretching, I could absolutely see the vision Nagata created in _Limit of Vision_ as being a realistic possibility of what our future might look like. I was also really impressed by the strides that Nagata has made in creating realistic characters.I also want to stress that Nagata is not some \"new SF author\" attempting to re-write Bear's _Blood Music_. First of all, she's been around for quite a while. She has several other books out there that are really well written, although in a much different style than _Limit of Vision_. Second, Nagata has written about nanotechnology in basically ALL of her earlier books. She's not attempting to re-write _Blood Music_, she's continuing in exploring a subject that she's been talking about for quite a while. In my opinion, even if you just look at the quality of the WRITING, _Limit of Vision_ is a far superior novel.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "It seems rewriting Greg Bear's excellent \"Blood Music\" has become madatory for every new SF author to come along. This kind of recycling normally wouldn't bother me because it's a great plot worth revisiting from another author's perspective. What does bother me is they never get it right. An escaped biotech, nanotech, whatever-tech agent which alters people's minds and threatens a new order of human evolution should be scary. But though it's touted as hard SF \"Limit of Vision\" reads like a juvenile adventure novel and rarely generates anything more than mild suspense. It doesn't help that Nagata saddles her rogue whatever-tech agents with the unfortunate acronym \"LOVs\" --a name I can't help but associate with either Barney the Dinosaur or disposable diapers. But these LOVs are serious things which atain sentience (surprise), tear up a space station and start reproducing themselves after outgrowing their chemical-dependence safeguards (yep, JUST like in Jurassic Park).You'd think people would be a little hesitant to infect themselves with these LOVs (cute name notwithstanding), but not in this strange world where all natural human instincts are sacrificed to further the plot. Nope, in this world people can't wait to get their brains on the LOVs because LOVs \"intensify your mood\". Exaclty what \"intensifying your mood\" really gets you is never really nailed down, but it's a pale second compared to the host of freakish super powers imbued in \"Blood Music\" --or for that matter in any of the various Star Trek episodes of a similar plot. People may be willing to scrap The World As They Know It for an evolutionary upgrade, but it's gotta be a killer deal--imortality at the very least. I found myself rooting for the \"bad guys\" who spend the novel trying to stop the idiotic \"heroes\" from thoughtlessly passing out LOVs like M&Ms; even as they're mutating into that thing on the book cover. In the real world our response to such an outbreak could be summed up in two words: Daisy Cutter, and we'd be right. But who am I to question the author's assumption that \"intensifying your mood\" is worth the risk of having your world overrun by giant spiders a thousand times smarter than you who just outgrew what they used to eat.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I give mucho applause to Linda Nagata for her efforts in writing a book with so alien a plot. As an avid sci-fi and history reader, I'm always interested in moments of discovery and the unforeseen consequences.The author takes us on a very interesting ride through this story of computer/living matter confluence, and performs many aspects of plot-building and character creation very admirably. I have to say that I was truly intrigued with most of the book.The problem I have with this book is that it sounds like the author is trying to sound like a scientist without the benefit of being a scientist. A story this intriguing and mind-bending needed a lot of scientific extrapolation, and well-done extrapolation would have added a tremendous amount to the plot. I'm sure it sounds like I'm being picky, but this is very important for me as a reader. I don't want to have to fill in many, many details of the plot using my own belief system.Another problem was the ending. Very shaky and ill-conceived. I think Linda Nagata was trying to establish a creative and dramatic climax, for which I applaud her, but there were so many issues in the book that were left unresolved. I had no true feeling of conclusion when I finished the book. I don't think Linda Nagata did either.Great ideas, but it needed more focus, better scientific extrapolation, and more questions answered.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "____________________________________________I thought Limit of Vision was Nagata's best book yet -- she's gaining full knowledge & control of the novelist's toolkit. And I admire her essential sweetness of vision: that probems have solutions, & that most people, given half a chance, will act decently and kindly.Except the bad guys, of course...Hghly recommended.Oh, and her website is well-worth a visit:http://www.maui.net/~nagataHappy reading--Pete Tillman",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Nagata sets up the big questions in this book and then punts at the end. Her maturation as a writer happens right in front of our eyes but don't buy this book. The ending can only be described as 1) A cliffhanger designed to get you to buy the sequel, or 2) A failure of literary courage. In either case, this is editorial irresponsibility at its most heinous. Even the most transparent first book of a series resolves the major plot elements and answers the questions raised by the narrative. Not this time.None of this would matter if Nagata had written just another media tie-in, dumbed down and evanescent as rime. But it isn't. As Norman Spinrad noted in his review in the March 2002 Asimov's, this is a spectacularly well-written tale for literate adults, all too rare in the current market. If you must have more Nagata, enjoy the setup but don't expect a payoff. It isn't there",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Possibly the decade's boldest voice in speculative fiction. Most writers hobble and contort their ideas to fit a preconceived plot or theme, but Nagata's mind appears to be wired exponentially.The idea of brain-enhancing implants is hardly new, but until LIMIT OF VISION, we had never seen a full-throttle treatment. Nagata carries the idea to its logical conclusion, and while the fears of the technologically timid are duly noted, they're shown little mercy by the steamroller of progress. The future is coming on fast whether we want it or not, and the author's point rings true: it's way more fun to be _on_ the steamroller than under it.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "50 simple things kids can do to save the earth",
        "description": "Explains how specific things in a child's environment are connected to the rest of the world, how using them affects the planet, and how the individual can develop habits and projects that are environmentally sound.",
        "authors": "['The EarthWorks Group', 'Earth Works Group (U.S.)']",
        "infoLink": "http://books.google.com/books?id=I-P5V5Rwsb0C&dq=50+Simple+Things+Kids+Can+Do+to+Save+the+Earth&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I first read this book years ago as a child. Perhaps the few reviewers on here who do not like the book (and use this review as an outlet for their own personal politics) on here do not realize that parents, teachers, community leaders and religious leaders hardly shelter kids from the outside world as it is, and this book will not upset children, ruin their happiness or waste their childhood at all. As a kid, my friends and I readily accepted this book and were happy to carry out many of the suggestions. Adults seem to look down on kids a lot and think that they just want to play all day and have little care for anything but themselves. The things kids love, such as animals and the outdoors, are in danger, and this book lets kids contribute to help saving them. There are plenty of little tips in this book that do not advocate huge, drastic lifestyle changes. This book also does not come across as preachy or arrogant. Overall it is practical and enjoyable to read.",
                "review/helpfulness": "35/37",
                "num_reviews": 37
            },
            {
                "review/text": "This book is totally awesome. I am interested in the environment and since this book includes quotes by kids my age, I feel I am really connected. It makes me feel really cool, like I can really make a difference in the world. And it helps. It tells you ways to help the earth- simple ways. And I learned a lot from it. It has a lot of good, interesting facts in it too.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "I checked this book out from the library and we enjoyed it so much we had to buy one. This book contains simple eco-friendly ideas anyone can try, such as making a bird house out of a milk carton, planting a garden to attract butterflies and other creatures, how to avoid overuse of styrofoam and other non-recyclable materials. It does not suggest major lifestyle changes, just small changes that can add up over time. And it is fun to read! It contains mini-quizes for kids on each topic, such as: which of the following will a worm not eat- vegetables, dirt, or steak?(answer= worms don't eat meat). Each idea includes a question &amp; answer, a description of the concept (such as recycling), a few projects to try at home (such giving old toys to charity or having a yard sale instead of throwing them out), and addresses to write to for more information (such as the National Wildlife Federation, which can help you plan a custom made wildlife-friendly yard). Great, simple projects for kids - a grown-ups too. I am going to buy the sequel as well and look forward to reading it cover-to-cover.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "I like this little book because it's realistic and doesn't try to use scare tactics. It's not put out by radicals and it isn't trying to get us to take on too much, too fast. Those who politicize the ecology bug me to death. As if taking care of this planet that we fleetingly occupy is about whether you're on the right or the left, where you stand on gun control, taxes, what defines marriage, or whether the school board should remove Huck Finn from the high school shelves. Making the earth's environment better is selfish, because we stand to benefit from it. It's a planet we share, folks, and we're not doing all we could to leave it in good shape for those who are here now or will live on it when our time is done.Let's get this straight once and for all: being environmentally conscious does not mean you're a tree-hugging liberal! What it means is, you like a planet that doesn't make you, your children, your grandma and your pet golden retriever sick. The Soviets were a leftist nation and they destroyed their ecology past the point of no return. On the flip side, the right-wing American President Theodore Roosevelt, as Republican as can be, has as one of his legacies the establishment of the National Parks System. \"Saving\" the planet is not the exclusive domain of leftists, nor-saying it again here--does it equate you with \"tree huggers\" if you try to do something that benefits the environment. I personally like clean air, clean water, a place to take a walk in nature without stepping in a nice glowing barrel of toxic sludge, don't you? I don't care if you're farther right than Sister Attila the Fourth-Grade Nun you can't honestly say you don't want there to be forests for you to go hunting in, or unpolluted rivers left for you to take your grandkids trout fishing in, am I right? And, yes, we ALL can recoil at the well-intended but self-defeating environmental fanatics who alienate the mainstream society of America by being too extreme and dogmatic. This book is not written for those who chain themselves to an endangered species of mollusk and go on hunger strikes to protest a TV show on global warming. This excellent little book is not like that at all. It presents what I think are really worthy ideas for cleaning up around the neighborhood where you live. It sets some nice projects out for kids (and grown ups) to get done and that is surely better than not educating our young people in environmental responsibility.Okay, let me put it this way: would you rather have a child dear to you outside some weekend picking up litter, planting a tree in the side yard and sorting recyclable materials, or would you rather have that child sitting in front of the TV with a PS2, becoming another statistic in the epidemic of pre-teen obesity? This book is a small step in the right direction, and if it does nothing more than makes someone, whatever the age, think about the connection between personal behavior and the state of the earth's environment, then it's a nice investment of time and money.",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "I loved this great book on caring about the environment. It gave me facts and how I could help save the planet by not using my car, recycling and reusing. You Must read this book!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "raising pg kids in xrated society",
        "description": "In this expose of the seamier side of rock music, videos, movies, and advertisements, the co-founder of the Parents Music Resource Center presents guidance to parents who are outraged by sexually explicit and brutally violent media messages",
        "authors": "['Tipper Gore']",
        "infoLink": "http://books.google.com/books?id=rph_lGgMq7UC&dq=Raising+Pg+Kids+in+X-Rated+Society&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "First of all, I cackle at the reader who gave this five stars and heralded Tipper Gore as a &quot;brave woman&quot; who wrote this book as an &quot;act of love towards today's youth&quot;. Tipper Gore went to a Greateful Dead concert and hung out photo-op style with Jerry Garcia while drug agents busted many people for acid at the same concert. Hillary Rodham Clinton called this book &quot;good information&quot; for parents. In the back of the book there is a plug for the Back In Control Center in LA. Back In Control advocate that black clothing and high top tennis shoes are signs of devil worship. Other signs of devil worship included the peace sign and the JEWISH STAR OF DAVID. Tipper called Back In Control &quot;a family center...who helps people who are deeply involved with punk rock and heavy metal.&quot; This is a book of ignorance which brainwashes parents into thinking that music that makes any kind of political statement is a sign of devil worship and should certainly be avoided. As an advocate for the Censorship Movement, this book is a fine piece of anti-intellectualism and anti-individualism which promotes not thinking about anything...at all. After all, happiness IS the enemy of thought.For more information on this book, check out &quot;President McMuffin Tightens The Screws&quot; by Jello Biafra (of which I credit with most of this review)",
                "review/helpfulness": "19/25",
                "num_reviews": 25
            },
            {
                "review/text": "This book is, in a word, ludicrous. Attacking everything from Dungeons and Dragons to the &quot;vile music of our society&quot;, good old Tipper manages to paint a picture of misinformation in the guise of &quot;preserving family values&quot;. Avoid at ALL costs.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "Ok, the title is obviously sarcastic but it is also what I believe to be the underlying idea of censorship. Why does the government, Tipper Gore, or anyone else get to decide what is right and wrong for everyone else to see, learn and watch? This denotes that her opinion is somehow better than everyone else's and it isn't enough for her to be absolute in her own beliefs as an individual, everyone else has to agree.People should be allowed to freely express themselves by saying whatever they want to say no matter how many people find it offensive. If you don't like it, leave. Everyone is entitled to their opinion and has the right to express it (even Tipper). The problem comes when an opinion gets forced down everyone's. Censorship SHOULD be allowed in the private sector though, such as this very website, because censorship is a form of expression in itself when it comes to your own material. In other words, &quot;If you don't like my website because certain words aren't allowed, make your own.&quot; It is the totalitarian attitude that the government should be allowed to censor every single form of communication that blatantly disregards the very 1st amendment.Adults should be able to decide what they want to see hear and listen to. Now of course this book is directed at parents for their kids so that leads to the question, who gets to decide what kids can and can't watch? The answer is simple: their parents! I think it's a parent's responsibility to raise a child as they see fit. Given that in this book she only gives advice, but in the real political world she believes in imposing censorship. It's probably a good idea to know the author J. How would Tipper Gore like it if the powers shifted and someone was telling her how to raise her kids?ALSO: I highly recommend ALL PARENTS see the South Park Episode: Cripple Fight. It has great messages about censorship along with the private sector and the government and more! Plus it is great fun!",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "The most notable feature of this book was a chapter concerning Dungeons and Dragons. It states that there are more than 50 suicides per year because of it (????), and that it is satanic. I have experience with D&amp;D and it is nothing of the sort",
                "review/helpfulness": "10/15",
                "num_reviews": 15
            },
            {
                "review/text": "If there's one thing that makes a southern belle like Tipper Gore nervous, it's the endless throbbing of the drums from the slave quarters on a hot, still southern night.That pretty much sums up the real source of Tipper's discomfort with so-called \"obscene\" rap music.The irony is, this southern politician's wife is so completely obtuse, so tone-deaf, so just plain cotton-pickin' stupid that she still has NO IDEA why ghetto blacks would resent a patrician white woman (with a cornpone accent a yard long) lecturing them on \"justice\" and \"decency.\" Tipper Gore really, really doesn't understand that when she tells Ice T to clean up his act she sounds just like her grandmother complaining about those low-down, shiftless darkies -- and those drums. Always those drums, from the slave quarters late at night.Notice that Tipper's ideas about how art corrupts could be applied to books and poetry as well as to popular music. For example, one could argue that a beloved southern novel like GONE WITH THE WIND, with its images of sub-human darkies and benign slave owners, does at least as much harm as the worst of gangsta rap. One set of lies begets another set of lies. Hate makes hate. But this kind of insight is far beyond Tipper Gore, who finds no need to examine her own conscience or the dark side of her own heritage. All she wants to do is silence those drums -- those awful, throbbing drums.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "Im never suprised by what right wing fundamentalists will come up with next...There's often a string of ideas that are put together to form a belief system, but with this you dont even get that. It's a confusing read that seems to contradict itself...concerned with a way to raise your kids &quot;the good way&quot;... this is more of a list of how to find &quot;every nasty thing society has ever produced&quot; viewed by an artistically devoid and philosophically empty mind set. To me this seems like the sort of thing the SPANISH INQUISITION would be proud of touting about than a genuinely open minded aproach to parenting. Living in Europe Im removed from the blinkered media that exists in the US so can understand how someone could be allowed to release this as a viable parenting guide. Bordering on the edge of racism and blatant bigotist philosophy I feel that this book is a warning sign that shows that the people in power in the US are as removed from society as you could possibly get. This is more than out of touch. If you need this as a guide to parenting then you have failed in life due to the fact you have been sitting in a glass container for too many years.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "I should specify. I read this book four years ago after I heard about it from Jello Biafra, perhaps the most knowledgable source and victim of Tipper Gore's autocracy. I often feal that I have trouble finding new points to talk about as a political activist and speaker but his are just so shocking and therefore to my taste. If he has tried to point anything out through his spoken word albums and countless speaches (which belive me he has), his highlight would have to have been the energy he put into exposing Tipper's connections with the Religious Right. Phyliph Schalfly of the Eagle Forrum has stated being inspired by Tipper when Tipper spoke at one of the Eagle Forrum's functions ,these functions promoting that woman's place is the home, and tipper has worked with Joe Lieberman who has held six senate commities against rock and rap vs. Tipper's husband Gore's petty two. It is also widely acknowledged that the PMRC (Tipper's action group) sends its information out to people through mail-order christian and televangelist packages. Another reviewer has spoken about the Back in Control center so I don't think I need to continue with that but to sum this up, it is obvious that 'Raising PG Kids in an X-Rated Society' (gee what a creative title) is not the radical ideology and protection based book it claims to be, but works as a soap box for the Religious Right of America. I cannot tell you, furthermore how shocked I was to find that it may have caused complications to print this review four years ago when I read the book (I'm 16 now) makes me skeptical of the book's influence on major corporations like Amazone and whether they my be taking some of what Tipper says about out of control children to heart. To any concerned parent who would question my sanity after exposure unfiltered sex and violence, I would encourage them to come to my house, let me cook them dinner, discuss the issues Tipper fails to address properly in her book with me, and then invite them to hang out with my racialy and sexualy diverse friends while we engage in one of my favourite activities of the day: Discussing philosophy, poetry (often musical), religion, and American foreign policy over the low hum of music by the Dead Kennedies, Anti-Flag, Rammstein, Alexisonfire, Death by Stereo, Led Zeplin, and Pink Floyd. I would then challenge my guests to portray me and my friends as deranged psychopathic killers as opposed to modern day thinkers of truth and wisdom. Personnaly, I think Hobbes would have been proud.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is just an over protective mom with no creditials writing what she feels. It goes to link a man falling off bleachers and dying to violent lyrics in music? Sorry lady, people slip and fall sometimes. She continually condemns bands such as Def Leppard and Motely Crue for all of societal evils. The books seems to make the assumption that violence would not even exist if rock and roll were not around. This book is only good for research purposes to prove how wrong it is.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The content of this book makes no sense. I could hardly finish it. The droll opinions make absolutely no sense. Parents, watch out for the star of david. A jewish religious symbol is your ticket to heck. I censored that one just for you Tipper. Tipper Gore is an off her nut radical and needs to simply be quiet and sit down. ROCK OUT CENSORSHIP!!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I agree that this book was well written and that Ms. \"OMG! OUR KIDS ARE GOING TO DIE\" Gore (coincidence on the last name?) found a lot of research, but she made so many stupid assumptions that I can't begin to understand why a parent would even start to believe this! I am a teenager and I do know the difference between right and wrong. Just because Mrs. Gore doesn't belive that we have commone sense doesn't mean she's right!!!Parents, if you really don't trust your child's judgement (being that they're going to listen to a sad song about suicide and look up the words and find that the artist is telling them to kill themselves and you believe they'll do it) you need to look at yourselves. We learn most of our habits and beliefs from you. So, if we screw up, so did you. Don't assume that just because we are adolecent we're idiots.So.... Parents who read this book and agreed with it completely, I wish you luck in making your arguments to your children about how they can't go to Ozzy Osbourne concerts because are bad because Johnny fell off the bleachers and died.But, Kids who are looking for a really good persuasive essay and really like rock music, read the book. It's good information to argue with and if you're like me, you might even end up yelling at Tipper Gore for being such an idiot.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "lonely planet usa",
        "description": "Lonely Planet's USA is your most up-to-date advice on what to see and skip, and what hidden discoveries await you. Gaze into the chasm of the Grand Canyon, hang ten on a Hawaiian wave, and let southern music and food stir your soul- all with your trusted travel companion.",
        "authors": "['Lonely Planet']",
        "infoLink": "https://play.google.com/store/books/details?id=FIDZDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Whilst I didn't enjoy this guide as much as some of the other Lonely Planet books I have previously used, this was nonetheless a handy addition to a trip of nearly 3 months covering 9 States.Whilst I wouldn't recommend it for short trips or 1 state visits for longer trips then I think it is worth the money - even if you just need tips and advice on budget accommodation, motels and restaurants.Let's face it, trying to cram 50 States worth of information into one publication is not an easy task but in my opinion I feel that this book along with the rest of the Lonely Planet series continue to be the easiest to use and best guide books available.If you are planning on only visiting a few States or visiting for a short break then my advice would be to either buy an indiviudal guide for the relevant State/City, check the internet for useful information or ask someone else who has been before.For those of us who cannot lug or afford up to 50 separate books or are on a budget trip of some sort would find this guide useful if not at least for the information regarding local culture and customs.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book definitely proved useful in my first experience with LP guides: if it didn't already have the information, it would at least point you in the right direction as to where to get it. Though the information for big cities like NY, San Fran and Chicago are limited, it's extremely easy to pick up free guides in those cities anyways, so it doesn't matter too much.The recommendations for food were about 2/3 accurate in my opinion, regarding price, value and quality. It's great how downtown maps are included, and more comprehensive for the bigger cities. Contrary the opinion of another reviewer, I was grateful for the inclusion of suggested lodging- for all the times we didn't follow our itinerary and needed to check for vacancies whilst still driving. Because all the lodging suggestions are non-chains, I also stayed at one place the guidebook recommended that turned out to be excellent and because it was privately owned, I would have never found it otherwise. It was very homely and good value.Though I wouldn't carry the book around while actually wandering around the city (too heavy and thick), it was good for leaving in the hotel and planning the next day's activities. On the whole, the concisely outlines what is worth seeing in each state, but expects you to actively seek out more information for details: don't expect that you can rely solely on this guide, especially not if you're into seeing some non-touristy sites.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "If you are going to travel to/across USA Lonely Planet USA is a suitable and practical guide, in spite of its size. The suggestions about hotels, restaurants, sightseeing, sports and routes include both traditional touristic places and alternatives points too. The \"author's choices\" are great and help you a lot to choose the best options for small budgets. It works as a trustful friend telling you about the best things to do in your next travel. More maps showing cities and roads would be very useful in the next editions.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is huge!! Its worth a read, even if you won't be travelling throughout the country. I read everything relevant to my holiday, then went and read about the places i want to visit!A lot of information, although because it covers the whole country, it is not overly specific. Getting the relevant guide book for the place you are visiting is recommended.Still, as I'd like to return to the USA, I know that I can pick this book up at any time, and begin my holiday research!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "alaska off the beaten path 3rd a guide to unique places",
        "description": "Tired of the same old tourist traps? Whether you're a visitor or a local looking for something different, let Hawaii Off the Beaten Path show you the Aloha State you never knew existed. Pay respect to the 700-pound crystal shivalingam and experience a daily puja (purification ritual) at Kauai's Hindu Monastery. Hike through the natural splendor of Waipio Valley to reach Hiilawe Falls. Dropping more than 1,200 feet in free fall, the waters of Hiilawe make the longest unbroken descent in Hawaii. Follow Jack London's trail on Kalae Stables' \"world-famous Moloka`i mule ride\" to Kalaupapa Peninsula. Or dine on a \"plate lunch,\" the quintessential meal of Hilo, at Cafe 100, the city's first drive-in. So if you've \"been there, done that\" one too many times, get off the main road and venture Off the Beaten Path.",
        "authors": "['Sean Pager', 'Carrie Frasure']",
        "infoLink": "https://play.google.com/store/books/details?id=OY-R3RCzA78C&source=gbs_api",
        "review": [
            {
                "review/text": "this book is full of overpriced advertisements and we found this book completely irritating in a 6 week trip to Alaska. If you want to spend $3500 on a kayak trip this may be the book for you.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "The Off the Beaten Path Alaska guide is almost the counter guide for the main off the shelf tour guides like Foders. Yes, a lot of it is akin to advertising, but it opens up some of the possible opportunities and can give you a starting off place to learn more. The book was useful for looking at in small pieces - the narrative is rather plodding and seemingly unorganized - at least it's hard to find things quickly in it. But at the same time, if you are looking at Alaska as that once in a lifetime visit, then it presents the opportunities that are out there, especially those not covered in as much detail in the mainstream guides. Sure, many of the things listed are way out of most of our budgets, but I found myself contemplating trying to find some alternatives to side trips that I hadn't thought about. And it shows that it's written by someone on knows and lives the area - the description of travel opportunities often fall more in travelogue than guide book realm. Personally, as someone who is looking at visiting Alaska and hoping to go above the Arctic Circle, I got some ideas and had my options partially laid out. I now know what I might want to explore as options. I would never make this my only guide book - but it is good for what it tries to do. I do wish the maps were better and the text and maps corresponded more readily. Peruse it before you go - it's for planning ahead, not referring to on the trip.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "There are tours and travel opportunities to fit every traveler and every pocketbook in this book. Where most travel books on Alaska provide sketchy descriptions and outdated contact information we found the information in Alaska Off the Beaten Path to be solid.We enjoyed Melissa's first person accounts and descriptions too. I followed her directions and found giant sea lions right where she said they'd be, in the harbor in Kodiak.We carried it with us everywhere and haver recommended it to friends who plan to visit Alaska in the future.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "rick steves germany austria and switzerland 2004",
        "description": "Who but Rick Steves tells you what you really need to know when traveling in Germany, Austria, and Switzerland? Rick spends four months each year exploring Europe, and his candid, humorous advice will steer you to the very best sights and museums in the region. You'll beat the lines at the major monuments. You'll find hotels and restaurants that make the most of your vacation budget. You'll discover cozy villages that take you away from the tourist-beaten path. And at the end of the day, you'll know that you used your time well, spent your money without regret, and had some unforgettable adventures along the way. Book jacket.",
        "authors": "['Rick Steves']",
        "infoLink": "http://books.google.com/books?id=7MO3oz6UHf8C&dq=Rick+Steves%27+Germany,+Austria,+and+Switzerland+2004&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've been to Germany several times.....Frankfurt, Koln, the Mosel and Rhine wine tours, etc. Here are my reviews of the best guides to meet your exact needs.....I hope these are helpful and that you have a great visit! I always gauge the quality of my visit by how much I remember a year later......this review is designed to help you get the guide that will be sure YOU remember your trip many years into the future. Travel Safe and enjoy yourself to the max!Rick Steves' books are not recommended. They may be an interesting read but their helpfulness is very poor. They don't do well on updates, transportation details, or anything but the first-time-tourist routine and even that is somewhat superficial on anything but the mega-major sites.Frommer'sThese are time tested guides that pride themselves on being updated annually. Although I think the guides below provide information that is in more depth or more concise (depending on what the guide is known for), if your main concern is that the guide has very little old or outdated information, then this would be a good guide for you.Lonely PlanetLonely Planet has City and Out To Eat Guides. They are all about the experience so they focus on doing, being, getting there, and this means they have the best detailed information, including both inexpensive and really spectacular restaurants and hotels, out-of-the-way places, weird things to see and do, the list is endless.Blue GuidesWithout doubt, the best of the walks guides.... the Blue Guide has been around since 1918 and has extremely well designed walks with lots of unique little side stops to hit on just about any interest you have. If you want to pick up the feel of the city, this is the best book to do that for you. This is one that you end up packing on your 10th trip, by which time it is well worn.MapGuideMapGuide is very easy to use and has the best location information for hotels, tourist attractions, museums, churches etc. that they manage to keep fairly up to date. It's great for teaching you how to use the public transportation system. The text sections are quick overviews, not reviews, but the strong suite here is brevity, not depth. I strongly recommend this for your first few times learning your way around the classic tourist sites and experiences. MapGuide is excellent as long as you are staying pretty much in the center of the city.Time OutThe Time Out guides are very good. Easy reading, short reviews of restaurants, hotels, and other sites, with good public transport maps that go beyond the city centre. Many people who buy more than one guidebook end up liking this one best!Let's GoLet's Go is a great guide series that specializes in the niche interest details that turn a trip into a great and memorable experience. Started by and for college students, these guides are famous for the details provided by people who used the book the previous year. They continue to focus on providing a great experience inexpensively. If you want to know about the top restaurants, this is not for you (use Fodor's or Michelin). Let's Go does have a bewildering array of different guides though. Here's which is what:Budget Guide is the main guide with incredibly detailed information and reviews on everything you can think of.City Guide is just as intense but restricted to the single city.PocketGuide is even smaller and features condensed informationMapGuide's are very good maps with public transportation and some other information (like museum hours, etc.)MichelinFamous for their quality reviews, the Red Michelin Guides are for hotels & Restaurants, the Green Michelin Guides are for main tourist destinations. However, the English language Green guide is the one most people use and it has now been supplemented with hotel and restaurant information. These are the serious review guides as the famous Michelin ratings are issued via these books.Fodor'sFodor's is the best selling guide among Americans. They have a bewildering array of different guides. Here's which is what:The Gold Guide is the main book with good reviews of everything and lots of tours, walks, and just about everything else you could think of. It's not called the Gold guide for nothing though....it assumes you have money and are willing to spend it.SeeIt! is a concise guide that extracts the most popular items from the Gold GuidePocketGuide is designed for a quick first visitUpCLOSE for independent travel that is cheap and well thought outCityPack is a plastic pocket map with some guide informationExploring is for cultural interests, lots of photos and designed to supplement the Gold guide",
                "review/helpfulness": "51/61",
                "num_reviews": 61
            },
            {
                "review/text": "I'm both attracted and annoyed by Rick Steves' travel guides. I'm giving this book a 3, not because it's generally okay, but because it's an average of 1 and 5.Steves does some things really well. His maps are really good, for instance. Rather than try to show every street (you'll have an ordinary map for that), he makes it easy to find the places you probably care about (or the ones he thinks you should care about); the museums, train station, etc. are easy to find -- like the map you'd scribble on a cocktail napkin for a friend. Plus, he's reassuring about distances from one place to another (a ten-minute walk to the museum from the train station, etc.).He also does a good-to-excellent job at, hmm, how shall I put this -- describing the experience of a place. I haven't been to Munich, yet, and his is the only guide that tells me that the biergarten tables with no tablecloths are reserved for customers who are drinking only (no food, in other words). And to look for a vomitorium in the bathrooms (!). When I'm traveling, I'm tripped up by the &quot;ordinary&quot; things I didn't know -- so this sort of information is reassuring. (Why do none of the guide books tell you that &quot;Ausfart&quot; is the word for &quot;car exit&quot; on the autobahn? As a friend of ours said, &quot;The first time I saw all those Ausfart signs, I thought, 'Wow, this is a really big city!'&quot; Ausgang, by the way, is the word for *people*-exit, a helpful item to know when you're in an underground parking garage, looking for the way out.)Also, Steves is better at orientation than most. I think his is the only book that says you can get tickets ahead of time for the big Bavarian castles, so you don't spend time waiting in line. That sort of stuff is incredibly useful.On the other hand... his priorities and taste do not coincide with mine. As another reviewer pointed out, Steves gives you the itinerary *he* thinks you should follow, and ignores or disparages other destinations. Maybe he thinks that Triberg is a tourist trap, but I spent 3 days in the area (in Hornberg, a few miles north) and I thought it was both a lovely town and a great base of operations for Black Forest exploration.What finally turned me off was realizing how differently he travels than we do. (There. That doesn't seem so negative.) Steves gives a one-day itinerary through the Black Forest, starting in Frieburg and ending in Baden-Baden. To accomplish that, he has you zoom through the Clock Musuem in an hour (we spent two, though maybe it could have been less), and 1.5 hours at the Volksbaurnhof in Gutach. That's way too little time; we spent 3 or 4 hours there on two trips (obviously, we liked the place). Yes, in an hour and a half you can walk around this open-air museum, but you won't have time to watch one of the demonstrations, or read more than a few expanatory signs. If I followed his itinerary, I'd be skimming the surface of every destination rather than experiencing the place.I own several guidebooks to Germany. It's probably worth looking through this one, especially if you happen to be planning to visit the sights he says are worthwhile. But it's far from a complete guide to the country, and you're stuck relying on HIS opinions -- which may or may not agree with yours. I'm glad I read through this book, but it's sure not being stuffed into my backpack.",
                "review/helpfulness": "30/31",
                "num_reviews": 31
            },
            {
                "review/text": "I bought this book because I had seen (and suffered through) Steves' amateurish and infantile videos on visiting Germany. I was curious to see if his books were as bad as his videos. The verdict: they are equally as bad. The problem is, Steves isn't an innate or talented traveler, though he apparently has performed a miracle and makes money fooling others that he *is* a great traveler. The Arthur Frommer Guides are much better than these Steves offerings.Problems abound. Steves concentrates most of his time on two cities: Berlin and Munich. He hasn't a clue on how to locate a low-cost Pension and opts for dingy tents on the outskirts of town. His suggestions on eating are obtuse. Snacking in Germany is a cinch: go to a bakery in the morning, buy your rolls, cheese and coffee and be on your way. His suggestions of hanging around railway stations and saving a few pennies are insulting and poorly rendered.Similarly wretched is his advice on getting about the country. Forget the railway, you can rent an econo car for about $150 a week. Yes, gas is expensive, but driving is the only way to see these three beautiful countries. Another weakness is Steves' summation of Austria, which basically consists of 10 pages divided between Vienna and Salzburg. If that's all there is to see in Austria, then we're all in trouble. Truly, this is a terrible book written in plodding, patronizing style, guaranteed to set your nerves a-jangle.",
                "review/helpfulness": "18/29",
                "num_reviews": 29
            },
            {
                "review/text": "I bought this book before going to Austria and Switzerland and was shocked by how primitive and incomplete it was. On Geneva, he offers 2 lines - 'The most boring city, not worth a visit.' Hello? Guidebook? Same deal on Zurich. The author packs certain sophomoric smugness, a know-it-all frat brother who tells you how to sneak for free into the second half of a show, that sort of clever little corner-cutting. If you have any serious curiosity about a country and want to get a bit off his beer-drinking trail, his book becomes useless. I bought it here, returned it for a refund (thanks, amazon!) and bought a very smart Lonely Planet guide in Vienna for twice the price of this website. Get the Lonely Planet and get it here!",
                "review/helpfulness": "15/23",
                "num_reviews": 23
            },
            {
                "review/text": "My husband and I used this book to plan our honeymoon and found it to be phenomenal. Steves does a great job of rating what you should see with the time you have. So it was great for planning our scant two weeks. He very candidly describes different places and explains what he likes about them or why he rates them low. This is helpful in deciding what you absolutly have to do since time is limited. Steves also has wonderful tips for drivers, where parking is located for example, and for accomodations. We loved all of our hotels and they were all well located and reasonably priced.This tour guide has two drawbacks. One are the crude maps. They are fine for getting a general lay out, but buying detailed maps is a must, especially for drivers. It also has no pictures. Since I'm a visual person I also bought the DK Guide to Germany. It lists EVERYTHING and has a picture of EVERYTHING. So, once I used Steves to decide what to do and where to stay I would find out what it looked like elswhere.We are planning a trip to England for next year, I'm certainly not going without his guide.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "You can really tell that Steves loves Germany and Austria because this is one of the best guidebooks in his series. First things first--this is not a regular guidebook in that it doesn't show an endless list of cities that you will probably never visit. Instead, he figures that you'll have less than two weeks for your vacation, so he picks out the places that he thinks you will enjoy the most. If you are looking for a more complete listing, then another guidebook would be better. Getting back to the guide, he has a particular flair for finding the scenic beauty of this region of Europe, and he gives lots of advice for finding those picture perfect spots that you're looking for. Also, Steves is good at tapping into the beer hall scene, so if you're thinking of checking out Bavaria, you'll be able to get some good tips. Of course, you can get better recommendations from a local though. Just think of this as a starter kit, and once you make a few contacts and start talking to the locals, you'll be able to find the places that aren't list in any guidebook.Another good thing about this guidebook is that the maps are fairly easy to follow. The downtown maps for cities are especially good. However, this book is for train travelers. If you are going to be driving, you'll need to pick up a seperate road map because there aren't any good road maps in this guidebook.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "My teen-aged daughter and I used this book extensively on our recent trip to Germany and Austria. (My sixth visit to Germany.) No one has the time to poke around in every corner of a country during a vacation and Rick helps minimize wasted days by offering great tips and suggestions. His sightseeing recommendations all proved to be 'right-on', and we never regretted staying in one of his recommended lodgings, or following his suggestions for meals. We appreciated Rick's recommendations for rooms in Berlin, Dresden, Vienna, Salzburg and Hallstatt. The hotels were centrally located, clean, quiet, offered great breakfasts, and were staffed by friendly and helpful personnel. All at attractive prices. I have five guidebooks for each country that I used during planning, took my favorite two about each country to Europe with us, but it was Rick's book that we carried as we left the hotel each morning.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "We took this book along with us on trip to Germany and Austria and found it indispensable. Steve's hotel and sight-seeing information is well researched and accurate. Steve's books cater to the rail traveler, but traveling by car is just as easy and more economical if you have a family - not to mention that it allows you much more freedoom to explore. Make sure you have good detailed maps of the places you will be traveling to, as the maps Steve provides are hand drawn and not extremely detailed. We found that many American's use Steve's book to travel, so making friends by talking about Steve's book is a great conversation starter. Make sure you also ask about the discounts that hotels and services offer through Steve's book.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "First and foremost, to clarify, this product that you are supposedly reading reviews for is Rick Steves' MAP of Germany, Austria and Switzerland. It appears that the other reviews are of Rick Steves' guidebooks! Again, this product is NOT one of Rick Steves' famous guidebooks (which I would always rate as 5 stars, incidentally!). This map is very basic; don't count on using it to find your way around a country or city. Only the major cities and towns are marked. Likewise, in the city maps of Berlin, Munich, Salzburg and Vienna, only the major thoroughfares are mapped. You should use this map only as a reference to his guidebook of the region to plan your trip. You will want to get a 'real' map that's much more detailed, e.g. Michelin, when you arrive. Best part of this map? The cool water resistant paper on which it is printed. Especially if you have small children who are apt to spill liquid, as mine did on Day One upon receiving it from Amazon!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I am generally a fan of the Rick Steves series and just wrote a glowing review of the Paris 2004 guidebook. But this particular entry is simply too much crammed into too small of a space. Germany deserves its own guidebook, and in fact, there are cities in Germany that probably deserve their own guidebook. By lumping all of Germany, Austria and Switzerland together, Steves fails to go into the kind of great detail about any one destination that makes the Paris 2004 book such a winner.In usual Rick Steves form, this book attempts to answer the questions that you probably wouldn't think to ask before being on the ground in an unfamiliar land, e.g. how to buy train tickets, what the street signs mean, wie sagt man \"ATM Machine\" auf Deutsch, etc. And it is for this reason that I recommend these books, especially to first-time travellers who are going without a seasoned veteran to guide them.I ended up travelling around Germany and Austria without using this book much. I bought an ADAC map of the Autobahn and drove around, taking in the various little Alpen towns and having a great time. But when I made it to Salzburg at the end of my trip, Rick Steves once again proved to be a helpful guide and I used his walking tours to navigate the city, and although I ignored his advice about the quality of different sights, I had a blast and I think the helpful tips and navigation aids in this book can get most of the credit for that.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "future memory how those who see the future shed new light on the workings of the human mind",
        "description": "A frequent writer on near-death experiences and self-professed clairvoyant describes her own and others' ability to \"remember\" future events, and explores the possibility that clairvoyance is the mind's path to higher consciousness.",
        "authors": "['P. M. H. Atwater']",
        "infoLink": "http://books.google.com/books?id=6tFCAAAACAAJ&dq=Future+Memory:+How+Those+Who+%27See+the+Future%27+Shed+New+Light+on+the+Workings+of+the+Human+Mind&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "It's uplifting and transformational. Atwater tells us of her extraordinary experiences, and we are carried away to new levels of understanding of the Universe. Many of her Brain-shift experiences were mind-blowing, but they are presented in such a way that we can easily accept the truth which they suggest and know that it's certainly possible for those of us who have NEVER had an NDE to perceive this same reality as well.For me this confirmed ideas that have been brewing in me for a long time, and gave them substance and strength. So many of the books I have been reading lately are zeroing in on the understanding of how this whole existence can be happening right inside the mind of God, and that we are actively participating in the extraordinary evolution of the Creator of the Universe. This is big and it's important that we understand and accept the responsibility of this reality, and it's a joyful realization as well. Tears of gratefulness streamed down my face as I read of \"the wonders of spirit unveiled...a splendor forever seeking release in a desire to experience and express itself.\"Atwater's story is as poetic as it is scientifically compelling. It's so well-written and well-organized that it reads like a novel you won't want to put down, even though it's packed with a substantial dose of physics, metaphysics, and philosophy. Future Memory will put a smile in your heart which you will never forget. Find your place in the Cosmos and realize \"we are beloved thoughts in The Mind of God...the real heaven.\"",
                "review/helpfulness": "45/47",
                "num_reviews": 47
            },
            {
                "review/text": "Do you wonder what it's like to remember the future? How would it feel to remember events from both your future and your past? PMH Atwater's book, FUTURE MEMORY presents compelling evidence and a fascinating explanation of the future memory phenomenon, where people prelive future experiences while still active and functional in present time. Atwater's expertise in the field of Near Death Experiences (NDE) shines through as she shares many stories from her personal life and guides readers through the labyrinth of the mind and the fabric of time, space, and the universe itself. FUTURE MEMORY masterfully balances subjective experience with relevant theories and scientific findings, bringing the otherwise lofty material \"down to Earth\" for practical applicability in daily life. We can all experience expansive brain shifts when we experience the Void that lies at the heart of All That Is with patience and receptivity... and can benefit tremendously when our consciousness expands. I felt torn between devouring this book as quickly as possible and savoring each and every page. If you've been looking for a book that will shift your mind into higher gear, this is it!",
                "review/helpfulness": "36/38",
                "num_reviews": 38
            },
            {
                "review/text": "a delicate bouquet. This is a really good book. Very sincere and well written and truly interesting. This reviewer tends to shy away from New Age science, unless there's some hard scientific evidence to back up any claims. The author's science seems sound, but the crux of her message rests on her personal experience. Having had several uninvited experiences of some of the phenomena dealt with in this book (particularly Out-of-body-experiences)I can say that this book was well worth reading, a discussion on matters that should be discussed more in the way that this book does, because there's enough pompous charlatans out there ruining such discussion because they want to get money by titillating you into thinking you need them for some grand Answer.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is the second time that I've read this book and no doubt I shall read it many more times in the years to come. You see, like Bucke's _Cosmic Consciousness_,who the author credits and validates, this is one of the great Books of metaphysics. I can think of it in no other terms but a unified field theory of metaphysics. The torus/vortex ring model of creation and evolution is brilliant. So is her \"colloidal state\" of awakening and transcendence. Her model accounts for everything in the hermetic, theosophic, and gnostic sources. This book has the unmistakable ring of truth.As for the claim by some that the book is \"poorly edited\", this is simply not true. This book has been purposefully and masterfully crafted in the form of a prose labyrinth. It is constructed in such a manner as to help shake the reader's mind free of preconcieved notions and open them up. Any confused, small-minded, infant that would accuse this book of being \"poorly edited\" would no doubt have claimed the same of Joyce....",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "I really admire previous reviewers their apparent ease in reading this book. I found it hard to follow the lateral mental leaps P.M.H.Atwater takes in endeavouring to interpret her post NDE experiences and those of others. Autobiographical details (which I found highly gripping but hard to sort out chronologically because of the frequent retrospective leaps) are interspersed throughout a personal philosophy of reality that the author matches up with what seems to be a random selection of quantum theories.There are some real pearls of wisdom and some astute observations of human nature, but I find the likes of Tart, Tiller, McTaggart and others far easier to follow - and more orderly - than P.M.H. Atwater's conclusions. Her approach, in my view, is often speculative, although she speaks with complete authority. But all experience, even that of an NDE, is surely filtered through our personal perceptions. I like the poet Rilke's point that we need to have \"the courage to live the questions.\" I would have preferred the author to discuss possiblities rather than aim at certainties.I would also have liked her to include the fact that people who have survived a major trauma can also have the same kind of mind shift she refers to with NDEs. An important point I would think, because we don't all need an out-of-this-world experience to achieve the transformation described - there's a remarkably similar alchemy to be found in life at ground level.Perhaps the book was meant to convince (which I didn't need.) But I was disappointed there were few down-to-earth suggestions for approaching one's own reality shifts. To me, therefore, it was more a philosophical exploration than a pragmatic exercise.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a \"heavy\" book that shakes up all preconceived notions we have of memory, space, time, creation, and consciousness. The insights are based on P.M.H. Atwater's near-death experiences (she had three) and her scientific research, which include several hundred interviews she conducted with others who had near-death experiences. The author boldly declares that \"The brain can rearrange itself in as little as fifteen minutes, if excited in novel and creative ways. Time is accelerating. The atomic clocks have been reset 19 times since 1972. Recent shifts in the earth's magnetic and electric fields are affecting our immune systems, fatigue levels, and weather. To keep up with our changing times, we too must change. The future is now! Return to an awareness of the Spiral's Edge where all things can be seen. Guidance from your soul awaits.\"This book requires you to be completely open to new theories regarding our existence. For example, P.M.H. Atwater explains how movies appear to be continuous but are just a series of still shots separated by periods of darkness. In the same way, a chord of music is really a series of notes separated by silence. Atwater theorizes that \"The subconscious mind regularly absorbs more than a billion pieces of information per second,\" and that \"our brains are so bombarded that less than 1 percent of what comes in ever reaches the conscious mind.\" These insights encourage you to be more aware of the space in things and the space in ourselves.Future Memory is a tool to help you evolve to a higher level of consciousness. It allows you to be more receptive to new ideas and to become more comfortable with the cycles of life and death. You may not resonate with all of her theories; to do so will take time, requiring a complete shift of your paradigms and some first-hand experience. But the concepts are imbued with truth. For instance, \"There are only two religions on this earth, the religion of love and the religion of fear,\" and \"the only gospel we can ever know is the experience of God in our own heart ... Enlightenment is ongoing, not a plateau we achieve, as the term describes an evolutionary shift from one phase of brain function to another, opening the way for dimensions of experience without number and realm of spirit without end.\"",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I read this book quite awhile ago or was it just tomorrow? I am fascinated by all things that have to deal with time, the nature of reality, and God. I guess I could have worse hobbies. But things are not always what they seem to be. In truth, things are always much, much more than what they appear to be.I had an experience once where all of the sudden I was somewhere in my past. It wasn't like a memory...I was actually there and yet I was simultaneously conscious that I was also somewhere else in time and then I realized if I could be in the past as well as the present I wondered if I could also move into the \"future\" and lo and behold, I was there. And then before I knew it, I was back in what I knew to be my present reality.We cling to our beliefs of what we feel to be true of certain things and when those beliefs are threatened, we're threatened because we think we've been mislead or lied to when all that really took place is that we were given some incomplete information and that's okay, no need to get our knickers in a bunch, just go forth in this new now moment..the only time there REALLY is and accept, embrace, and embody the Truth that ALL things, including your \"little\" life is much bigger than you had previously realized.I remember that you already bought this book next week and you told me three weeks ago you really, really liked. All things are taking place in the now. All the possibilities of time and space converge upon a single point.This is a great book and a great find. Read it and blow your linear mind right out of the waters of pragmatism.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is really wierd. I bumped into it a wierd way because I was in Portland on a vacation, and this book caught my eye more than any other at a cafe, and I liked just what I read there so much that I begged the people in the cafe to let me buy it. They sold it to me for $10.Ive allmost died seriously a couple times, once when I was 1, I drowned, another time I got my windpipe kicked closed. There have been dozens of other times where I would have died if I wasnt so lucky, stuff like getting hit by cars or having a gun on me.Ive allways been able to predict with pretty good accuracy whats going to happen in my life. What I allways thought it was was that I simply had good forseight, and a good idea of how everything should turn out, but I guess it isnt a normal \"skill\".This book really rang a chord in me though, I suggest that if you have found out about it, you really should read it. The resources in the back on wierd subjects with addresses and phone numbers is pretty amazing.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This was a slow book for me to trudge through, and I'm normally a fast reader. Trying to make sense of the author's concepts and assertions definitely slowed me down; it was often hard to tell if she was describing dream sequences or some manner of organic brain damage, or true genuine insights into the nature of reality. (Not that they're mutually exclusive, necessarily.) It should be recalled that everyone views reality through their own set of filters, and that's very much true here. There were certainly some concepts that rang true for me, and others that I found highly doubtful. Maybe that's the true value of this book - it will definitely push your boundaries, whether you agree with it or not. It's worth the read, and perhaps will be worth another read in a few years, but I can't imagine working my way through it again any time soon.Just for the sake of accuracy I'll mention that there's precious little about the \"future memory\" phenomenon in this book, despite the title. The first few chapters go into it, and then it's forgotten in favor of a much more complex \"big picture.\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I found this book both informative and inspiring. Some people might not enjoy the scientific discussions that tend to get a little dry, but if you can get through that section it will be worth it.At the beginning of the book the author describes her early years and the problems she had in school which mirrored my life. I was the same type of child who saw different things than others saw, I knew the future because I had future memory events and didn't know it until I read this book. I was call by my teachers the \" child of the devel\" because I was left handed, not to mention the episods of future memory I sometimes talked about because I forgot to keep it to myself. I grade 2 I got the strap allmost every week because I would not stop using my left hand. And my parents supported it. These things leave their mark on you.I know the long road of recovery. P.M.H Atwater travelled that road. Either you become very bitter to life or you forgive everyone and move on. Phylis chose the second option and the book showes you what a good option it was.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the limits of thought discussions between j krishnamurti and david bohm",
        "description": "\"The Limits of Thought\" captures the dialogue between a leading religious teacher and a prominent physicist. Bohm and Krishnamurti explore the nature of humanity and a person's relationship to society, and provide new insights on human thought, death, awakening insight, cosmic order, and the problems of the fragmented mind.",
        "authors": "['Jiddu Krishnamurti', 'David Bohm']",
        "infoLink": "http://books.google.com/books?id=owfgbIW1DOMC&dq=The+Limits+of+Thought:+Discussions+between+J.+Krishnamurti+and+David+Bohm&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "An excellent investigation of thought by Krishnamurti and Bohm. The style is one of question and answer, first the illuminating insights of Krishnamurti followed by the in depth questioning of Bohm. At times one gets lost in the concepts Krishnamurti uses to expand on his views but in the nick of time Bohm clarifies the issue with his well known brand of questioning. It is indeed rare to find such a book which so deeply investigates the subtlety of thought, its construction of the `self' and its uses and abuses so to speak. As typical of Krishnamurti and Bohm this book is important and lacks any kind of fantasy component or unecessary terms. Perfect for psychologists, scienists and laymen.",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "According to Troxell and Snyder Krishnamurti is leading philosophers away from reliance on abstract thought to greater concern for a direct awareness of ourselves in the world....and together with David Bohm in these further dialogs, the result is of extraordinary importance, which is affecting all thinking areas.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Like \"This Light in Oneself\", superbly edited by Ray McCoy. It makes a big difference, if you've read a lot of K.'s books , to have editing this good. Would that all K.'s writings were edited anywhere near this well.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Having gone through K and Bohm ideas before, I found this conversations as the perfect summary to work, confront, feel and develop a profound understanding of the root source of our lives: the thinking-feeling- perceptual process.And it is not a description based on science or religion or other human disciplines, although the two authors have enough background to cover these areas. It is based in the answer we all can reach if we have the interest, the time, the intuition to look for.I thank these two notable men for sharing their passion for truth with everybody",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "geography for dummies for dummies careereducation",
        "description": "Geography is more than just trivia, it can help you understand why we import or export certain products, predict climate change, and even show you where to place fire and police stations when planning a city. If you're curious about the world and want to know more about this fascinating place, Geography For Dummies is a great place to start. Whether you're sixteen or sixty, this fun and easy guide will help you make more sense of the world you live in. Geography For Dummies gives you the tools to interpret the Earth's grid, read and interpret maps, and to appreciate the importance and implications of geographical features such as volcanoes and fault lines. Plus, you'll see how erosion and weathering have and will change the earth's surface and how it impacts people. You'll get a firm hold of everything from the physical features of the world to political divisions, population, culture, and economics. You'll also discover: How you can have a rainforest on one side of a mountain range and a desert on the other How ocean currents help to determine the geography of climates How to choose a good location for a shopping mall How you can properly put the plant to good use in everything you do How climate affects humans and how humans have affected the climate How human population has spread and the impact it has had on our world If you're mixed up by map symbols or mystified by Mercator projections Geography For Dummies can help you find your bearings. Filled with key insights, easy-to-read maps, and cool facts, this book will expand your understanding of geography and today's world.",
        "authors": "['Charles A. Heatwole']",
        "infoLink": "http://books.google.com/books?id=eBTADmfaoqwC&dq=Geography+For+Dummies+(For+Dummies+(Career/Education))&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you are wanting a book to tell you WHERE things are, then buy an atlas or just use Google Earth. If you are wanting a text to explain WHY things are, then this may be your book.I teach a Geography course at a Christian private school, and last year, selected this as our textbook. Unlike \"normal\" texts employed at most schools (both Christian and secular), which tend to be loaded with some sort of agenda - this one simply brings the facts forward in plain, understandable language. I have not regretted my choice. Not only does it cut through the useless crud, it also addresses almost every topic required for the TEKS (Texas Essential Knowledge and Skills) requirements. (I did a line-by-line comparison to justify my choice of text)It is well organized into 4 main sections and a 5th which is filled with helpful lists. It clearly explains the six essential elements of Geography: 1) The world in spatial terms, 2) Places and regions, 3) Physical systems, 4) Human systems, 5) Environment and society, and 6) Uses of geography.I have been very pleased with this book... it is even reasonably entertaining to read. I highly recommend it IF you want to learn about the science of Geography. If you just want to know where things are located... you should choose a more appropriate tool.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I bought this book as a reference guide for 7th graders. It is well versed in the technical aspects of physical geography and yet has very little on cultural or human elements. I was a little disappointed that there was not more on individual places and people. A good techy reference but not a star in our classroom!'The Idiots Guide to Geography' (I hate the name, because it just gets the students into the name calling attitude.) is more what I needed with more on the culture and history and people. Thanks!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This was an interesting book about a subject I had not thought about in a long time. It did a good job of covering the different subfields of Geography, and explaining the different regions of the world. It was easy to understand the whole way through.A couple minor irritants came up for me as a Canadian reader. The distances were only ever stated in miles. Most non-fiction books will include the metric in brackets afterward, but this book didn't. I had to mentally convert the measurements from feet to meters and miles to kilometers every time, which was a little annoying.I enjoyed the ten geographic myths at the end. It was nice to see the Bermuda Triangle get debunked, along with other widespread silly ideas.Overall, I found Geography for Dummies to be an inspiring book, and it made me want to read more about Geography in the future.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mariners compass quiltssetting a new c new process new patterns new projects",
        "description": "Find your way to perfect Mariner's Compass designs.",
        "authors": "['Judy Mathieson']",
        "infoLink": "http://books.google.nl/books?id=2kyFmAEACAAJ&dq=Mariner%27s+Compass+Quilts-Setting+a+New+C:+New+Process,+New+Patterns,+New+Projects&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Judy Mathieson has designed a new way of paper piecing the Mariner's Compass pattern; no paper to tear away! It's a great project-oriented book, one that most intermediate quilters that are ready for a new challenge will enjoy.This book contains all the patterns you will need for making many Mariners Compass blocks. I really liked this book because it has clear directions and lots of photos.",
                "review/helpfulness": "35/39",
                "num_reviews": 39
            },
            {
                "review/text": "Personally I love these patterns. The layout of the directions make it simple to make all types of different variations. If Mariner's compasses are your favorite, then buy this!",
                "review/helpfulness": "27/31",
                "num_reviews": 31
            },
            {
                "review/text": "I just took a class at the 2007 Houston Quilt Festival w/Judy Mathieson learning the paper piecing technique taught in this book. While tricky and a bit more involved than traditional PP, the results are just as good and you don't have to pick tiny pieces of paper out of your blocks/quilts when you're finished. Judy is a wonderful teacher (take a class when you have the opportunity) and this is truly an advance in paper piecing.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "I love mariner's compass quilts and this book has a new way to piece the blocks that is different from Judy's first book. I haven't made the projects, but find myself just looking at all the wonderful photos. The instructions seem very clear and there are a lot of illustrations to show the steps of the process.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book tells you all the information you need to make a beautiful Mariner's Compass quilt with patterns included. Very good instructions.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Long have I admired the Mariner's Compass from afar! Years ago at the home of a relative who is a master quilter, I saw the Mariner's Compass block she was in the process of creating using the foundation paper piecing method. It was so striking in appearance that I immediately made a mental note that someday I was going to learn to make that pattern. The more experienced I became as a quilter the more I realized what that would involve and the less I thought I could really do it.When the local quilt shop starting advertising a class based on this book, Mariner's Compass Quilts: Setting a New Course, I vacillated for a couple of weeks as to whether or not I thought I could actually make such a thing. I'm here to tell you that it is very doable for an intermediate quilter. I think it still would be a daunting task for the average beginner, but I was pleasantly surprised at how easily the compass went together with sharp points and no tearing away of paper foundations and thus no tiny stitch length making unpicking difficult. Author Judy Mathieson has developed a new way to use freezer paper as your foundation without actual sewing to the paper. It is very effective and faster than I ever dreamed. After a two hour class this morning and another 2-3 hours on my machine at home I have completed the compass and started work on surrounding it with a circle of flying geese units using the same method. I am thrilled with the result! I keep looking at my Mariner's Compass in awe thinking, \"I really made that.\"I actually went into the class thinking this may be the only Mariner's Compass I ever make in my life. Honestly, it was so much easier than I imagined that I am eager to make more. The reason I am giving the book 4 stars rather than 5 is that I had a very capable instructor who taught the method in a clear and concise manner. Though the book is filled with thorough, step-by-step photos, I am a very visual learner and I'm not sure how well I would have done without actually seeing the process in action. I've looked at the photos and read the instructions and it all makes sense to me because I have seen it happen--I don't know if the book alone, for me, would have made the process come alive. I'm sure that many quilters would not have trouble following the book's instructions. Maybe that is unfair to the book if the flaw lies with me, but that is my reasoning for my rating.For the more adventurous, there is a chapter on drafting your own patterns, which looked easier than I expected with the help of some basic tools (ruler, compass, etc.). Other chapters cover quilt planning, fabric selection, construction method, patterns, and projects. There is no \"How to\" section on basic quilting because, as the author states, \"most people who are attracted to the Mariner's Compass pattern have more than beginner-level skills.\" She also points out that this leaves more room for patterns. One reviewer has complained that there are no yardage requirements included with the patterns. That is true, however I feel that the nature of the patterns leaves so much to the quilter in the form of which pattern pieces to make in which color that it would be difficult to dictate how much of which fabrics are required. Once you have determined what color you want to make each piece you can gauge, based on the size of the pattern pieces, how much of each fabric you need.This book is filled with visually stunning examples of what the author and others have created using her method. It is amazing what they have accomplished and after completing my first project I feel empowered to venture on to more challenging designs. If you have wanted to try a Mariner's Compass I highly recommend this method.ETA: I have since made a second Mariner's Compass and it seemed even easier than the first. I had a woman ask me the advantages of this method over foundation paper piecing. The only one she could see was the lack of the need to tear off papers from the finished block--a process she said she doesn't mind (more power to her). In my review I also mentioned that you don't have to adjust your stitch length as in FPP, so unpicking an error is easier. The last advantage I see is that once you have made your perforated \"foundation\" you can reuse it several times in making more blocks. You don't tear it to pieces when you are done with the block. To me, all of these advantages are time-savers and I'm all for having more time for my projects!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Easy to understand, clear & concise. A very useful tool to be able to draft your own compass or use one of the included pattern pages. Loads of ideas for setting quilts and colour choices.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was an eye opener for a paper piecing and showing one a new and easier way of doing this method, I highly recommend this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Once again Judy Mathieson excels. Her books and patterns are beautifully written and easy to understand. The photographs are perfect additions to her directions. I would highly recommend this book to anyone who wants to try Mariner's Compass'. Her patterns and directions range from relatively simple for those new to the process all the way to complex designs and anywhere in between.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I have wanted to make Mariner's Compass and New York Beauty blocks but, although an experienced quilter, I felt that these would be far too difficult. Judy Mathieson's book changed my mindset! With the aid of this wonderful detailed book I now have the confidence to tackle both these blocks and be assured of success.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "fodors colorado 6th edition fodors gold guides",
        "description": "Readers can embrace the local scene as they hit the slopes in Vail, take a dip in Steamboat's hot springs, or puzzle over ancient cliff dwellings at Mesa Verde. Find choices for every traveler, from hiking and mountain biking to music festivals and fine dining.",
        "authors": "[\"Inc. Fodor's Travel Publications\"]",
        "infoLink": "http://books.google.com/books?id=rgqAbIBkkiUC&dq=Fodor%27s+Colorado,+6th+Edition+(Fodor%27s+Gold+Guides)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really liked this guide. It was pretty much on the mark and crammed a lot into a small book. Much easier handling than other books on Colorado and gives a sense of the personality of each town and resort, if not always enough in-depth info on recreation.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book was essential to our wonderful trip. I was able to focus on the things that really interested me, and I actually suprised my relatives who live in the area with some little-known places thanks to the book. It is full of useful info and great travel tidbits.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I live in Colorado, but purchased this book after using other Fodor Guides on travels. It's a great way for me to explore my own state, and I've planned some great weekend getaways after receiving this book.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Excellent guide, whatever your interests. Gives \"off the beaten path\" and historic notes as well as nice lodgings and restaurants. I look for a Fodor's guide every time I travel.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "counterclock world",
        "description": "In a world where time has begun moving backward, powerful prophet Anarch Peak is among those who have risen from the dead, but that may not last long, as a number of groups seek to send him back to the grave.",
        "authors": "['Philip K. Dick']",
        "infoLink": "http://books.google.com/books?id=KwmZ0ukEWwwC&dq=Counter-Clock+World&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Dick attempts the impossible task of making time seem to flow backwards as the reader moves forward through the book. An eerie and unforgettable premise has the dead being &quot;born&quot; in their graves, crying out to be exhumed so they can begin their reverse trek through life. In other scenes food is excreted onto plates and then boxed and returned to the shelf, while bodily wastes are ingested through a &quot;sogum pipe,&quot; a process alluded to several times but mercifully never depicted. Eventually the book reaches an action-packed climax (shouldn't it have occurred at the beginning?), in which bullets are sucked back into firearms and so forth, but by that time the paradoxes have come so fast and furious that the reader's brain has imploded. As in so many of his novels, Dick throws too many balls in the air to keep the juggling act going, and as scientifically plausible fiction, it's a mess, but only a genius would have attempted an idea as weird as this one, and taken it as far Dick does.",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "Do you love PKD? Have you read a lot of his books?If you answered yes then you'll love this. If not I would try one of his more approachable titles first (Do Androids Dream of Electric Sheep, or one of his short-story collections). I would not recommend this to a first time Dick reader; if you don't know what you're getting yourself into you probably will not like it.With that said, I love PKD, and have read quite a few of his works. I, having been aclimated to his style, found it very enjoyable. The only concerns I have are that some of the ideas, with reguards to the backwards flow of time, are somewhat garbled. A good example is how cigeretts are smoked by inhaling the fumes and blowing into the filter- yet the people still manage to communicate while inhaling. Try it yourself, see it's not so easy. I know it's nit-picky, I can't help it.All in all a great book for anyone who already enjoys PKD.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "PKD faced the old problem of commercialism vs. integrity. I consider this book to be a testament to Dick's integrity. Exploring often mentioned, but never developed, ideas.For example, the Wizard Merlin supposedly lived backwards in time. Yet this idea has only been presented, not developed in the stories I have read. Several religions suggest a rapture or ressurection of the dead, without filling us in on the details.Dick must have really felt the avenue of backwards time was worth exploring or he never would have finished it. It was brave for Dick to see these ideas through to their conclusion. While facing the realities of rent and editors, etc.This book is not as morbid as earlier reviews might suggest. The characters are sincere and even light-hearted at times.I found this to be one of Dick's easier and smoother reads.I break it down this way. If you go to a movie and willingly submit to a fantasy experience, read this book. If you go to movies to test your analytical and deductive skills don't bother.If you suspect that time is really just one big cosmic \"Wow!\" that has already ensued, I highly recommend it.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Started of with too many characters and too many conversations, this book almost forced me to give it up straight away. But perseverance to read until the middle will be rewarded.The concept itself is interesting. A world when times move backwards. When the deads are 'revived' from the grave, being sold as a property to anyone who would bid the highest.And when the one who's coming back to life is a religious figure, interesting things can happen.There are two kinds of sci-fi books: one that is written by a scientist and one written by a non-scientist. This book is the latter. Sci-fi Books written by scientist contains the actual correct science or science of what would be possible in the future. While non-scientist writers tends to use science as basis and props for futuristic situation, emphasizing more on (perhaps) psychological and philosophical issues.This book puts forward some interesting religion and philosophical issues such as how a person who live in the period where times move backwards reacts to the mind that move forwards. However, a reader with a scientific background might be put off by the some of the logic and science in this book, that are rather inconsistent and incorrect at times.Take the example of this: [A person in a coffin in a grave just woke up]&quot; 'Get air down to me!' he tried to yell, but since there is no longer air he could not breathe; he was suffocating. `Hurry!' he called, but his call became soundless in the absence of air; he lay compressed, crushed, by an enormous vacuum; the pressure grew until, silently, his ribs broke. He felt that, too, his bones one by one snapping.&quot;Overall it's an enjoyable book if you somehow can disregard the incorrectness of the science behind it.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Originally posted at FanlitIt's 1998 and time has started running backward. Aging has reversed so that people are gradually getting younger, and dead people are awakening in their graves and begging to be let out. The excavating companies have the rights to sell the people they unbury to the highest bidder. When Sebastian Hermes's small excavating company realizes that Thomas Peak, a famous religious prophet, is about to come back to life, they know that getting to him first could be a huge boon to their business. The problem is that there are other organizations that prefer for Thomas Peak to stay dead, especially when they realize he may have information about the afterlife.Philip K. Dick is in a class of his own and it's hard to compare his novels to anyone's but his own. Maybe it's not fair, but there are certain expectations we have for other novelists that don't apply when we read PKD. Most importantly, we can't expect the plot to always make sense. This is most true, I think, when Dick shows us a future United States of America which we know could never happen. For example, in Counter-Clock World, we can't let it bother us that an excavating company has the rights to sell people it digs up and that nobody, including the resurrected people and their relatives, question this. Or that the public library system has the authority to eradicate important works of arts and literature. Or that some things work backwards (people disgorge their food instead of eating it, they say \"goodbye\" when they answer the phone and \"hello\" when they hang up, and cigarettes get longer when they're smoked) -- but most things (like walking, driving, and talking) don't. None of it makes sense, but you just have to go with it and, if you can't, you shouldn't be reading Philip K. Dick.So, compared to some of his other novels, Counter-Clock World, published in 1967, does pretty well. It's got the usual wacky premise, annoying abbreviations ('pape\" for newspaper, \"pilg\" for pilgrimage, etc), bad marriages, robots, drug trips (only one short one this time), and plenty of paranoia, but the plot holds together well (once you agree to the premise), it's fast-paced, amusing, and, most importantly, not confusing.There's usually a religious theme in PKD's work, but it's a particular focus in Counter-Clock World. He has some interesting thoughts about death, resurrection, pride, and humility. As usual, I find it disappointing, and somewhat sad, that Dick imagined all sorts of sophisticated technology for 1998 but assumed that we would not have progressed in the areas of civil rights for blacks and women. We have further to go in these areas, but it's disturbing that Dick did not foresee our social progress. In fact, most of his work, like much science fiction from the 1960s, assumes a degradation of American culture that, fortunately, we have not seen.Patrick Lawlor did an absolutely perfect job with the narration of Brilliance Audio's production which has just been released. His clear strong voice is attractive, his male and female voices were spot-on, and he managed to get the paranoia and frenzy across without annoying me. I can't wait to listen to more of Patrick Lawlor.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Maybe it's not such a great idea, reissuing PKD's back catalog. To be sure, many of PKD's novels are sheer brilliance, even if flawed. But as more and more of them come back into print it becomes equally evident that many of his novels were more flawed than brilliant. Sadly, this is the case with \"Counter-Clock World.\"According to this novel's fascinating premise, time is running backwards: the dead return to life and begin getting younger; people smoke butts which become full-length cigarettes they put back into the package; one is greeted with \"goodbye.\" It's a fascinating idea, but not altogether clear.In Martin Amis'sTime's Arrowa similar thing takes place: the dead are resurrected and forced to relive every moment in reverse. Forced, because their lives unwind like a film. Amis's book is brilliant in that the reader must make sense of events that become all too clear, but only upon reflection. Specifically: Amis's character is a former Nazi doctor, and he --like the reader-- must try to make sense of his acts. The gimmick --time running backwards-- isn't really a gimmick at all; it's a successful endeavor to force the reader to consider an old story in a new way.By comparison, PKD's book seems juvenile, and I say this as a fan of PKD. Not only are the metaphysics of this world unexplained (time goes backwards on Earth but not on Mars; people must smoke in reverse but still have free choice); more damaging still are PKD's own metaphysics. One constantly has the feeling that PKD is really just trying to work though some ideas himself --and failing at it. \"Just a rehash of Plotinus and Plato and Kant and Leibnitz and Spinoza\" (216). That's about right, but without the developed arguments. If you're familiar with the philosophical arguments, PKD's handling of them will not impress you.Worse still, the characters (none of whom you particularly like) change so radically with regards to their core values --who they love, who they hate, who they want to kill-- that the effect is, oddly enough, not unrealistic but too realistic. That is, too painfully close to the author's own confused life and relationships. That doesn't make the characters any more developed or credible, but it does perhaps explain why.I think this is honest writing and a sincere attempt to represent the world PKD thought he was living in. For this same reason, it is actually quite pathetic.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Anyone who has seen the Red Dwarf episode \"Backwards\" will know the basic premise of Counter-Clock World. Based on Dick's short story \"Your Appointment Will Be Yesterday\", Counter-Clock World has time running backwards, curiously only on Earth, due to the naturally occuring 'Hobart Phase' (in the short story the Hobart Phase was artificially created).Logic would dictate that everything would have to run backwards but in Counter-Clock World people have a forward-pointing 'arrow of time' while the world they are living in has a reverse arrow of time. Dick selctively has his characters doing certain things in backwards (such as 'imbibing' Sogum and later on uneating a plate of food) and other things forwards like driving a car or carrying on a conversation.Even though the environment of Counter-Clock World is a bit hard to buy it nonetheless a good story and is as worth reading as any of his other novels.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Though the premise is corny, the intrigue Dick generates is extraordinary, as usual. As fiction it's engrossing, if a bit dark and without a particularly good ending.Even moreso than usual, you can correlate the character's thoughts to Dick's life here. He definitely was one to analyze himself in his books. He seems to prefigure here not only much of what he wrote about for the next 15 years, but much of what he lived. It's not glorious or noble, and makes me a bit uncomfortable.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "[NO SPOILERS]If there's one thing that I love about PKD stories it's this:He almost always has a plot or concept that will blow your mind.This time around, the plot deals with the idea that \"The dead grow young\", meaning that those already dead eventually come alive in their coffins and after being exhumed begin living life as usual, but getting younger as the years go by.As you can imagine, this is a difficult concept to grasp and even PKD seemed to have a bit of a hard time with it. For example, there isn't a whole lot of consistency or reason as to how things work.Why are their food and other natural processes done backwards?Why do the characters say \"Goodbye\" for \"Hello\" and vice versa? If they're going to go to that extreme, then shouldn't they be talking backwards as well?What happens if you were cremated instead of buried? (I think the book lightly touches on this, but still didn't do a very good job of explaining how this situation would play out.)As usual, the main character is plagued with marital problems, something PKD was well familiar with, unfortunately. It does make for some very interesting reading by shifting the spotlight so it's not on the \"dead grow young\" concept 100% of the time.There are some neat bits of technology mentioned here, including a CEPHALIC-WAVE DETECTOR which is used to track people and their movements, as well as a LOCK-ANALYZER which can open doors. Later on in the novel there is even a MATRIX-style action scene.There is also a bit of prophecy with the mention of the one-way trips to Mars. Once you get to Mars, never expect to return to Earth.Plot-wise, I found the original premise rather intriguing, but despite that I spent the first half of the book struggling to figure out how this crazy world worked and what exactly was going on (something to do with a resurrected religious leader who knows the secrets of the Afterlife). Fortunately the last half of the book starts to make more sense and even has a little action, however, the last sentence of the book lacks any punch.Although I rate this book 3 stars, it is actually closer to a 3.5, the fun premise is one of the better ones put out by PKD, but the execution of it is a little inconsistent and confusing.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you finish the book you will vicariously experience death and rebirth more than once. The quotes from Erigena placed at the head of many chapters guide the reader into a Neo-Platonic world that is explicitly described as fundamental reality later in the book. Quite an experience.I personally found the play on the library, which is in the reversed-time world of the novel destroying books and knowledge, an interesting comment on Ray Bradbury's basically simple Fahrenheit 451. Bradbury's book was the book of the month here in Los Angeles a few years ago. I would be interested in living in any city that would make Dick's Counter-Clock World as its book of the month. Very.Read the book.\"-\"",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "fodors australia 2004 fodors gold guides",
        "description": "Presents rated reviews of the best properties, sights, restaurants, activities, and communities to visit in Australia, with tips on when to go, suggested itineraries, maps, background information, and travel advice.",
        "authors": "[\"Fodor's\"]",
        "infoLink": "http://books.google.com/books?id=A28rkZhzHUUC&dq=Fodor%27s+Australia+2004+(Fodor%27s+Gold+Guides)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When researching my honeymoon to Australia, I first borrowed this book from the library. It had a good deal of information and also great website addresses for me to search for more information. Since it became useful, I did purchase a copy which we took with us on our honeymoon.We went to Sydney and the Great Barrier Reef areas and this book helped us with ideas of things to see and do and more options on lodging. On the planes in between our destinations, we would read what places there were to see and activities to do and then we discussed where we had to go and what we read about that didn't seem interesting to us.Also, I would refer anyone to fodors.com before they travel anywhere because on their message boards you can ask Australians and past travelers about anything you can think of and not have to search any book. That was truly the most useful planning tool.All-in-all, not a bad choice as a guide for all of Australia and it gave a good deal of information about where we were going, but for specific city information...get online!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I bought this book to use as we campervan our way around the East coast of Australia. I usually go with Lonely Planet, but based on some of the review I read, Fodor's seemed a better choice. However, I soon realized this book would be useless to us. It doesn't include any campsites or other budget accommodation, and doesn't have any information on hiking trails etc. I was also very disappointed at the lack of pictures - I wish I'd noticed this before I ordered. This book is on its way back to Amazon and I've ordered the Lonely Planet books - I should have stuck with them in the first place. Fodors would be great for anyone wanting to stay on the beaten path, staying at expensive hotels. For budget travel/back packing/camping, I think LP is the way to go!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "walden two",
        "description": "A reprint of the 1976 Macmillan edition. This fictional outline of a modern utopia has been a center of controversy ever since its publication in 1948. Set in the United States, it pictures a society in which human problems are solved by a scientific technology of human conduct.",
        "authors": "['B. F. Skinner']",
        "infoLink": "https://play.google.com/store/books/details?id=lMpgDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "In this book Skinner presents his blueprint for a utopia based on behavioral sciences. While someone who is just looking for a entertaining story may be disappointed or even call this book boring, I'm pretty sure that you'll like it if you have some serious interest in Behaviorism or behavioral engineering. Even if I have a master in cognitive sciences, I didn't find Skinner's ideas *really* \"incompatible\" with what I know, even if much of it probably remains to be proven, but the only way to prove it would be to set up such a community. Some other reviews call it a communist model, but the book actually includes chapters pointing out the differences between fascist and communist models, and Skinner's analysis shows, some 40 years before the Berlin wall collapses why the Soviet Union wouldn't survive.I wouldn't call this book \"unscientific\" or \"outdated\" as some other reviewers did. True, I would enjoy some footnotes to connect Skinner's ideas from this book to the rest of his writing and I'm wondering what would happen if we \"upgraded\" this book to take place in the modern internet society and taking into account all new things cognitive sciences and emotional intelligence have brought us over the 50+ years since this book has been written. This book will give you enough \"food for thought\"....",
                "review/helpfulness": "37/38",
                "num_reviews": 38
            },
            {
                "review/text": "This influential book created quite a stir when it was first published in 1948, so much so, that many people actually started forming intentional, egalitarian communes and existing ones embraced many of the ideas of social structure presented in \"Walden Two\". Further, Aldus Huxley, author of \"Brave New World\", was so impressed with the ideas presented in \"Walden Two\", that he incorporated and expanded on them in his last novel, \"Island\". And many people feel this was his best work. I concur.The book is not a monument to fine novel writing and was not intended to be, yet it is fascinating and eye-opening as a fictional dissertation on utopian social structure can be. Huxley's \"Island\", on the other hand was beautifully written and requires no awareness of the psychology of social construction going on at the same time- neither book does, really. They are both interesting and thought provoking.Skinner's basic premise was that with gentle behavioral modifications using positive re-enforcement and academics, coupled with leveling the social playing field with no class structure our hyper-competitive, private enterprise, we could then concentrate all of our energies on education and entertainment, thereby removing most all of the ills and stress that conventional society suffers from- sounds enticing, on paper anyway.B.F. Skinner was a famous research psychologist who had a life-time of noted insights into the human psyche and his constant experimentation with behavioral studies led him to map-out, in a fictional utopian setting, a demonstration of what the supposed benefits of behavioral modification would do for a large group of people. He was not trying to be a novelist, rather he was submitting to a broader audience than his peers, a theoretic utopian society that the general public could assess on their own and no doubt, Skinner was probably keen to see how the public would respond- further studies of human response to mechanisms- his favorite occupation.His very clinical approach to human behavioral studies was often criticized, but he was always quick to point out that he had no interest in debate on his methods. The following two paragraphs are borrowed from Skinner's bio seen at the Muskingum College, New Concord, Ohio website Skinner pages. Material was compiled by Christa Swenson, 1999.\"Skinner was never highly influenced by critical reactions, he is not interested in the right or wrong because they are either effective or ineffective, and arguments of no avail. For that reason he is not interested in psychological theories, rational equations, or other verbal systems that are required to be proven right.\"- whoa. And:[Following the principles of Bacon, Skinner rejects verbal authority, stating, \"I have studied nature not books asking questions of the organism rather than those who have studied the organism.\"... \"Observation overemphasizes stimuli; experimentation includes the rest of the contingencies which generate repertoires\" (Dews, 1970, p18).]It is interesting to note about his life that he is mainly remembered for such famous/infamous experiments as his \"Skinner Box\"- a replica of the famous Russian psychologist, Ivan Pavlov and his \"Pavlov's Dog\" positive response contraption. To say the least, he was highly impressed with Pavlov's work, but instead of dogs, he preferred rats and humans for study subjects and behavior reaction, not dog saliva studies (however interesting that might be).So I would imagine that if Skinner were alive today, he would get a kick out of the reviews here that are somewhat unflattering and he would have no problem brushing them off as he would also see fit to do with the flattering ones.His Walden Two book was influenced by the writing of Henry David Thoreau's \"Walden\" (Note the borrowed title) and many other similar writers. No wonder then, that he was keen to let that influence mellow his somewhat starchy, clinical outlook when he wrote it. And we are thankful for that- it made for a much more human and pleasing read.Understandably, it does not please many that his story characters had embraced such social quirks as seeing no benefit in saying \"thank you\" and many other social graces- this is Skinner's personality coming through: social graces are a waste time. Level-headed, nothing-to-hide, and non-competitive people supposedly don`t need that nonsense.Did Skinner miss something in the demonstrated efficacy of social courtesy? No matter, he lets many of his characters have their conventional, \"good\" social habits- he has to, to show contrast.The communal setting the book describes is egalitarian, fair and desires no material gain other than normal sustenance. Labor needs are divvied-up at the start of each day and earn the communards \"work credits\" to ensure that they work a minimal amount for their keep. Over-work is discouraged and considered counter-productive, education and entertainment are much more important and with a large labor pool, daily chores can be completed quickly.New incoming members must agree to the communities social dictates: \"The Walden Code\" , a set of easy rules of conduct for harmony in the communal setting. Administrative members called \"Planners\" have a bit more leeway and can over-ride the rules when dealing with the outside world. All social positions are on a rotating basis including work, to facilitate an even distribution of duties so everyone can gain experience of the total spectrum of communal life.So what became of the communities that formed on Skinner's ideas? Many of them are still going and the most renown one modeled completely around Walden Two, \"Twin Oaks Community\", is still at it. Kathleen \"Kat\" Kinkade, one of the founding members, wrote a book about the \"real\" experimental commune, \"A Walden Two Experiment\"- Foreword by Skinner himself.This assessment of the project was written about two years into the project and then followed by another report, \"Is It Utopia Yet?: An Insider's View of Twin Oaks Community In Its 26th Year\". Kat Kinkade is now the longest standing member and although she left the community for some time and then returned, she has a substantial history and intimate view of the project. Her assessments are an open, frank and honest look at intentional, communal living with all of it's inherrant ups and downs and is a fascinating follow-up to Skinner's Walden Two.",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "Imagine a world where you got to choose what you did every day (as long as your four daily labor-credits are completed), where, as everyone is equal to everyone else, the words 'thank-you' are never used and where education, which is never forced, is something your kids just WANT to do. Is this better living through operant conditioning?This fictional community is the brain-child of the famous (and imfamous) behavioral psychologist B.F. Skinner. Skinner believed that all behavior can be controlled by modification and 'positive reinforcement.' Well, here it is. A Skinnerian utopia.The book itself has no real plot to speak of. The central characters,a group of 2 university professors, 2 twenty-somethings fresh from army service, and their two girlfriends that have been invited to take a tour of the Walden Two community. The book (narrated by one of the professors) is the fictional account of the tour which gets extraordinarily specific. The communes education, commerce, child-rearing, and governing practices are well-examined and this book, whether you agree with good ol' B.F. or not, will have you constantly thinking from new angles. If you're anything like me (frightening thought!) you might find yourself actually talking back to the book. What a rare experience!The four stars are for both the writing- Skinner does much better than most psychologists crossing over to fiction- and for the wealth of ideas which are sharp, challenging and scary. Although in the end, I disagree with just about every idea Skinner remonstrates, this is a book that I'm sure I will reread and ponder over quite often.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "Walden Two is a work of fiction that gives us an outline for a modern utopia. In the book, six people - two college professors, a former student and his friend from the army, and the girlfriends of the two young men - visited a commune out in the country. The commune had been created by an old school mate of one of the two professors. When Professor Burris received a visit from his former student, Rogers, and Rogers' friend Jamnik, about T. E. Frazier, who had set out to create a modern utopia, Burris discovered that his old friend Frazier had indeed succeeded at creating his utopia. But even more interesting was that when Burris sent a letter to Frazier, a return letter invited Burris and some friends to visit and see Frazier's utopia, Walden Two. Rogers and Jamnik were delighted to accompany him and brought their girlfriends along. Burris also brought along another professor, Castle, who was intrigued by the creation of a utopia, a feat he had believed impossible. Together, the six traveled into the countryside to find the utopia of which Frazier had boasted.The visitors found that the members of the utopia worked short days, on average four-hour work days, had a great appreciation for art and science, used a hybrid economic system combining Marxism and capitalism that worked for the benefit of all members, and enjoyed happiness all the time. Frazier had thought the entire utopia through, and did many things very differently than the rest of the United States of America, from the communal raising of children, to new systems of education, and even to new ways of raising farm animals. He even used new ways of carrying food from the food lines of the communal mess halls to nooks in the \"Ladder,\" a long stairway that doubled as a communal gathering place. Frazier had created an efficient utopia in a corrupt world. Though they see it before their eyes, some of them don't believe it, and they try to look for problems in the system. Professor Castle is always on Frazier's heels, trying to find contradictions in the system and failures to achieve true fairness and equality; he even accuses Frazier of being the despotic dictator of Walden Two. But Frazier is always ready for any attack with a defense, and even an attack of his own at times. From the \"Ladder\" to the \"Walk\", Frazier's Walden Two Utopia was truly something to be admired.And how had he managed it? He had used a science called \"Behavioral Engineering\". In this system, adults signed contracts to abide by the rules of Walden Two and reinforced one another's behavior through their common acceptance of these rules. Children were raised to absorb and live by the values of this modern utopia, including the values of sharing, working their fair share for the benefit of the whole community, and maintaining impartiality. The adults used positive reinforcement to encourage appropriate behavior by the children. It seemed like a viable system, but I think an all too well known cynical writer, George Orwell, would have a field day with how this might go wrong if even one person failed to absorb the communal values and found a way to use the system for his own personal gain.Despite how good this community sounds, we must remember that this is a work of fiction. Though creating a \"Walden Two\" type of community could be a good start towards forming a fair society, I am not convinced that this model could work in a large society. In the small community, where everyone knows each other and trusts each other, there is a sense of loyalty that keeps the members subscribing to the ideals of the fair society. In a large society, nobody knows everyone and therefore cannot trust everyone, and this undermines trust in the system itself.Walden Two is worth reading if you're trying to find a way to create a modern utopia. But, if you are going to read this book, I also suggest reading \"The Case Against B. F. Skinner\", by Noam Chomsky. The essay discusses why Skinner is wrong about the malleability of human nature, and why this society would fail to attract enough members to be viable. Walden Two and \"The Case Against B.F. Skinner\" are very \"hard reads,\" and take a lot of time to fully understand the points that are being made. Take a month or two so you can read it slowly and understand the concepts that are being presented. If you do not understand anything, that is okay. The ideas are pretty hard to understand. I recommend talking it over with a political science teacher. Still, despite the difficulty, this book is a great read for an intellectual mind, and the essay is as well.",
                "review/helpfulness": "16/20",
                "num_reviews": 20
            },
            {
                "review/text": "I decided to reread this book not too long ago because I could remember little from my initial reading. I discovered many new nuances in the text that I picked up on immediately and had much fun with myself debating its many philosophical points. I would recommend this book to anyone, from the intellectual to the beginning reader, to the communist, to the libertarian.For a book with no discernable plot, it comes across very well as a fun read. The book is merely the story of the narrator (Burris) writing a book about Walden Two. Unlike 1984 with its dramatic, albeit melodramatic, story line, Walden Two is simply a first-person narrative of a party's foray into Walden Two. However, Skinner rarely allows one to see this by assailing the reader with a barrage of his thoughts, opinions and findings.There are, however, some shortcomings of this work, which warrant a one-star deduction. Skinner paints a wonderful Utopia and accounts for more of the minor details than most Utopia-oriented authors, but he makes a few glaring assumptions. Three come to mind as being the most detrimental to his argument. One) He assumes that Walden Two will magically produce enough goods to sustain itself with ample to spare for trade. Two) He assumes that a science of Behavioral Engineering is possible and implementable. And three) He assumes that this Behavioral Engineering will magically keep the Planners and Managers, the government of the community, from lusting after power, and that in this non-competitive-by-admission environment, people will still manage to excell past the norm. He attempts to support them, but he failed to convince me, no matter how I looked at the problem. Also, he is blatantly sympathetic to Russian Communism, although it was 1948 when he published the book, and Burris is so obviously a straw man concocted for Frazier to fight and convert that the last few chapters are almost laughable, if very poetic and well-written.All in all, I give the book and Skinner's tactics of argument four stars, but Walden Two as a community, one. Although it seems tempting with four hour work days and no competition, Walden Two seems, at least on paper, as believable as Lilliput or Fantasia, or any other fanciful land.Maybe Skinner should have made Walden Two a floating island and Frazier a green skinned dwarf, or something.......",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "Experiment. Vary conditions. Collect and share results. Raise concerns. Avoid arguments over how many angels can dance on the head of a pin.These are the ways of a scientist and ways that Skinner suggested we all consider using.Somehow this guy who worked with rats had other interests and other ways of sharing his concerns. \"Walden Two\" is one of them.It's not \"The Sheltering Sky\" but, compared to what I could do, it's awfully well written. It's not the final answer on how folks should live together or even that much of a start - but it is a start and an invitation to all of us to consider how we can improve our conditions.Even in \"Beyond Freedomn And Dignity\", Skinner didn't have many answers as to how culture could be designed for the better. But he did have the realization that we ought have to start somewhere. He also had worked on a technology that he expected others would improve on that might help us live more sensibly.\"Walden Two\" provides an intimate glimpse into Skinner's world. I may not want to live there, at least for long, but I respect Skinner's efforts to make me think about what I can do to improve my living conditions.Behaviorism may be limited but it can be effective, more than arguing over angels on pins. Small visible steps may be the best steps; small acquisitions of tested knowledge may lead farther than pompous rants or deep meditations.Reading \"Walden Two\" is a good small step. A good step after that would be to learn about Los Horcones, a remarkable community in Mexico that, like Walden Two, applies behavioral science to design its culture. Los Horcones calls itself a Walden Two community, not because it imitates what's in the novel but because it also applies Radical Behaviorism. Skinner never intended that Walden Two remain just a book.",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "I will not dupe you into thinking that B.F. Skinner is a master novelist, and that is the only reason I docked B.F. one star. However there are so many interesting ideas in here that you really need to read it if you would like a book that is enjoyable, but also leaves you with something to think about for months after you've read it. Whether you agree or not, you should read it!",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "There is a lot of confusion about this book.Walden Two is one big dialogue on the possibilities of society design. Like Orwell's 1984 or Plato's Republic, it is about ideas. All that happens in it is a lot of gab about how we might or might not want to design a society, so it makes poor light reading. The book has little stylistic or rhetorical appeal, so if it became your favorite book it would probably be because you liked thinking about the things Skinner was thinking about.The concept at the heart of Walden Two is that of making our social institutions scientifically self-improving - matching up our needs and problems with any relevant solutions, and designing the institutions so that they will readily develop and take up scientific knowledge. The reader is invited to evaluate the feasibility and desirability of this via Skinner's sketch of one implementation and its consequences.That sketch dominates the book with little details, leading many readers (pro and con alike) to conclude that the details presented were Skinner's literal suggestions. I suggest sidestepping the issue by evaluating ideas rather than people, as Skinner provided us with no firm evidence of what he believed (in my opinion a definite, but not unrecoverable, flaw of the work). Walden Two was devised by the character Frazier, who has some rhetorical similarities to Skinner in his more rhetorical moods. On the other hand, the narrator shares a wealth of detail with Skinner, and particular is very distinct from Frazier. Heis named Burris (to Skinner's Burrhus), teaches unhappily at University, finds Frazier to be personally irritating and arrogant, and is interested in the possibilities of improving society and applying behavior, though often giving Frazier mild challenges. Of particular note, Burris admits quite explicitly that he does not understand the basis of the techniques that Frazier is using. They are wild future technology. All we see of them - via Burris - are a handful of brief sketches and a lot of results. Like the flying car or Newspeak, the implementation is not the point, but the consequences are. Once again, the book will be more interesting if you can separate out the overarching ideas.Walden Two is (by assumption, obviously not empirically) leaderless, policeless, and virtually free of any punishment, restraint, surveillance or coercion. The techniques do not involve any surgery or drugging. Anyone but Skinner, the steadfast determinist, would characterize them as minimal-impact, minimal-control, giving people as much choice as possible and using the same kind of incentives that now 'control' us, but in the pursuit of more leisurely, healthy, diverse, etc. lives. If Skinner had not been such a slave to his words, he could have conveyed this important nuance by simply using ordinary words. His utopia is really intended to be a utopia, explicitly different from the nasty controls that governments now use: surveillance and reporting to central authorities, beatings, war, etc.And this is really the point. After a couple of careful readings, the one thing I can noticeably identify Skinner embracing and defending is perhaps the one essentially utopian notion: that things now are being done in very wrong and ineffective ways (which they are), and that some mixture of technical knowhow and good-heartedness might under some conditions correct the problems and make things better for everyone. There is something deeply naive in this, in the age and perpetual lack of delivery of such things, that always arouses my cynicism. But in some ways it does get delivered - without anyone to act on this impulse, you and I would be working the dirt in fear, unhealthy and about as far from free as possible.Bottom line:Skinner's defense of essential utopian ideas is refreshing, and he presents a slightly different angle that bears useful comparison with other political utopian and dystopian novels like 1984, Brave New World, etc. However, the execution is poor on several counts, so Walden Two is a pass for anyone who really wants to get to the point or who is essentially uninterested in the topics described above.If you do read it, be patient and engage the topic on YOUR terms - not Chomsky's and not Skinner's, either!",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "I am amazed that people are criticizing this book because of behaviorism's obsolescence. Maybe Walden Two was presented differently to other people, but I initially read this book as class assignment for Psych 101 at Harvard. Professor Fernald described Skinner's WT as an interesting attempt to apply the principles of behaviorism to a society/community. I doubt even Skinner thought his novel accurately outlined the exact methods by which civilization should operate.It's not an instruction manual for humanity; it's an exploration of certain models present in most communities. Many of these models still exist in our 21st-century culture. For example, children are still raised to compete with everyone else, through sports and the ubiquitous honor societies. We laud the winners and humiliate the losers. This undoubtedly enhances the inherent duality of the human mind; it exacerbates the (harmful IMO) mode of looking at the world with the &quot;us - them&quot; or &quot;me - everyone else&quot; perspective.In WT, Skinner presents another way of raising children to allay this competitive, often merciless instinct. Is Skinner's answer the correct solution? One can only assume it isn't, but his solution does make the reader think about these societal patterns that are so often just accepted with no forethought or even conscious choice.I know people who have/make time in their lives to question the very foundations of our civilization. I let my own life be too hectic; I often just fall into patterns of behavior. However, I do often spend nights reading, and when I randomly pick up Walden Two once every few years, Skinner reminds me that all of the flaws in our society are not absolute rules of human behavior. There other ways to live, and Skinner presents some of his opinions on what those other ways might be.My own opinion is the Frazier's community in WT is not scalable, not even slightly, but I still greatly enjoy Skinner's exploration of civilization.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Walden Two is now published by Hackett Publishing Company. The ISBN number for the paperback is 0-87220-778-1.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "pvc projects for the outdoorsman building shelters camping gear weapons and more out of plastic pipe",
        "description": "Learn how to make inexpensive and practical gear such as snowshoes, an equipment raft, shelters--including a teepee and a portable ground blind--a boot dryer and even a blowgun in your home workshop out of durable PVC pipe. Photos and easy-to-follow instructions show you how to construct more than 30 projects.",
        "authors": "['Tom Forbes']",
        "infoLink": "http://books.google.com/books?id=C1Zr5vpxdEYC&dq=PVC+Projects+for+the+Outdoorsman+:+Building+Shelters,+Camping+Gear,+Weapons+and+More+Out+of+Plastic+Pipe&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Aside from being EXTREMELY short, the ideas in this book are so simplistic anyone who could not come up with them on thier own should check their brain to see if it's still working! It is a total waste of money and should in NO way be lumped together with the REAL survivalist and handyman books written by Ragnar Benson...his books actually teach you something more than how to waste your money!",
                "review/helpfulness": "25/29",
                "num_reviews": 29
            },
            {
                "review/text": "This book was unoriginal junk. Almost everything in the book was projects that could have been thought up by a two year old with an idea of what pvc was and some crayons. The only remotely interesting project was for the sled. Why isn't the spudgun included in this book??? Definitly NOT worth the $17 I paid to buy it and have it shipped.",
                "review/helpfulness": "23/27",
                "num_reviews": 27
            },
            {
                "review/text": "Okay, so you read the title. What a rip off. Most of these ideas are just plain stupid. Use a section of 6\" pipe with a cap on the end as a bucket. But, my all time favorite is to use two small pipes with caps. You are to place two roofing nails through the caps and cover the nails with cork. Then thread para-cord throught he ends and wear them around your neck. These are to be used while ice fishing. If you fall through the ice you just grab one in each hand and jab them into the ice. The cork will fall away and those cheap roofing nails will dig into the ice. Most of the ideas are not even worth mentioning. Like placing two pieces of pvc pipe together in an 'x' to make a bi-pod for a rifle. It is just endless usless, stupid ideas that follow one after another as you turn the pages. Just place 'pvc projecs' into any seach engine and get real ideas that work. I hate this book so much, the only reason I keep it is to remind me not to by stupid publications like this again in the future. What a waste of time and money. And to think the author actually got paid to write a second book!!",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book has a couple of novel ideas for things that could be made with PVC but they are so basic that anyone who is the least bit handy around the house/shop could make them without the book. The only plus is that, if you did want to build one of these projects, the book gives a materials list and the measurement so you dont have to figure that stuff out yourself.Had it been from a local store I would have returned it, but it isnt worth the shipping to send it back to Amazon.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "They actually have plans for a PVC walking stick. Weapons? String two footlong pieces together to make nunchucks, etc. I guarantee anyone out there could write this book in 15 minutes. A terrible waste of money, I'm sorry I bought it.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This really is an upset. Their is nothing in this (very short) book that you can't come up with yourself.One project included is for a cup... You take a piece of pipe, put an end cap on, and there is your cup. That IS an actual project from the book. I'm not kidding or exaggerating.I wouldn't recommend this book even to a child looking to just have fun. A kid could come up with more interesting projects on his own.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lonely planet germany",
        "description": "Lonely Planet's Best of Germany is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. See storybook castles rise from the Bavarian forest, raise a stein to an oompah band in a Munich beer garden and take in the vibrant Berlin arts scene - all with your trusted travel companion.",
        "authors": "['Lonely Planet']",
        "infoLink": "http://books.google.com/books?id=p0QMvgEACAAJ&dq=Lonely+Planet+Germany&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Normally, I am a faithful LP travel guide user, the books have always been helpul for trips I have taken in the past. On a 3 week trip through Germany in May-June 2006, I used the Germany LP and was unpleasantly suprised time after time at the outdated or just plain incorrect information in the book. Not little things like prices, which always go up, but major problems like listings for buses to the airport in Berlin, that I discovered after much searching, had been discontinued two years ago. This type of thing happened repeatedly. At the end of the trip I actually felt cheated and as if I had wasted my money, and worse, valuable time depending on information provided in this purchase. The only thing it ended up being good for was finding hotel listigs to make reservations with during the planning stages. I don't have another guide to suggest instead, but leaving basic transportation info outdated for so long is just negligent. I'm going to to try Rough Guide next time.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "For my one-week-only trip (I circulated around Frankfurt and Wiesbaden) the book did it's job. The maps are great; the articles refresh your memory and help you look knowledgeable enough when talking to locals. Overall I think it makes the visit through this very hospitable country easier and even more entertaining.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lonely planet travel journal",
        "description": "Never forget an adventure with this bright and bold journal. Packed with tons of fill-in fun, from lists and logs to doodles and collages. Draw the view from your hotel window, create the ultimate holiday playlist, make a city skyline from your ticket stubs and lots more. Backpack sized, with an elastic closer to keep souvenirs safe. It's a must-pack item for any trip.",
        "authors": "['Lonely Planet Kids', 'Nicola Baxter']",
        "infoLink": "http://books.google.com/books?id=BNe9vwEACAAJ&dq=Lonely+Planet+Travel+Journal&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This handy travel journal is by far the best I have used. It is small enough to take along almost anywhere, and big enough to provide plenty of writing space. The backs of the lined pages are plain, solving the problem of ink bleed through and giving an on-the-spot location for the many items that document your trip; ticket stubs, cards collected from fellow travelers, receipts, and your own sketches.The maps show enough, but not too much, there are calendars through 2002, a clothing sizing chart, conversions from metric to imperial, a few pages for addresses, and an oh-so-helpful time zone conversion wheel.All of this is in the spiral bound, lay-flat-when-you-need-it, just-the-right-size journal for your trip.",
                "review/helpfulness": "59/59",
                "num_reviews": 59
            },
            {
                "review/text": "Looking for the perfect travel journal is difficult. Non-spiral journals make it difficult to write on when in buses or trains. Large journals just take up too much room. I found a lot of journals have inspirational quotes, which seems redundant- the places I travel to are usually inspiration enough. After looking at many journals I decided I wanted one with tough exterior, and it had to be spiral. Well, Lonely Planet's travel journal went way beyond that. There are sections for itineraries, addresses, travel related web-sites. It has continent maps, airline phone numbers, and other important numbers. There is a pocket in the front to keep loose items until they find their place. A wheel in the back that helps for time changes. Best of all, it has enough space for writing, sketching or anything else. The book is a great addition to my travels.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            }
        ]
    },
    {
        "Title": "lonely planet alaska 5th ed",
        "description": "Lonely Planet Italy is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Wander through chariot-grooved streets in Pompeii, sample the abundant varieties of wine and olives as you tour Tuscany, or toss a coin into the Trevi Fountain in Rome; all with your trusted travel companion.",
        "authors": "['Lonely Planet', 'Cristian Bonetto', 'Kerry Christiani', 'Marc Di Duca', 'Peter Dragicevich', 'Duncan Garwood', 'Paula Hardy', 'Virginia Maxwell', 'Kevin Raub', 'Brendan Sainsbury', 'Regis St Louis', 'Donna Wheeler', 'Nicola Williams', 'Hugh McNaughtan', 'Gregor Clark']",
        "infoLink": "http://books.google.com/books?id=781RDwAAQBAJ&dq=Lonely+Planet+Alaska+(5th+ed)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Simply worded - an excellent book. If you have never read a lonely planet book, now is the time to start; using the fifth Alaska edition on our tour up north last year was the best decision my family ever made. Because of Jim Dufresne, we saw whales at Beluga Point outside of Anchorage, in addition to finding great deals on touring. If you are cruising up to Alaska (we did the same), definitely pick up a copy of this book, and use it well. It will offer you all sorts of money-saving tips and ways to escape the trap of being a cruise-ship tourist as opposed to being able to identify more with the bearded, rugged mountaineers who frequent most of the state :-)Lonely planet guides as such have tons of valuable information -- city tours, scenic driving instructions, and restaurant recommendations. Have faith in whoever has written your guide; he or she will serve you well.",
                "review/helpfulness": "41/43",
                "num_reviews": 43
            },
            {
                "review/text": "Lonely Planet guides are the best, and this is no exception. If you are planning a trip to Alaska that has nothing to do with the typical watered down, spoonfed stuff that the tour guides serve up to the geriatric set as &quot;the Real Alaska&quot;, then you must get this book. I have used it for two trips up north; I was working in salmon canning plants and on fishing boats to pay my way around, and with this book, I had the most wonderful adventures I've ever had. Bottom Line: If you are going, get this book.",
                "review/helpfulness": "27/29",
                "num_reviews": 29
            },
            {
                "review/text": "Used Lonely Planet books in England and found them to be just as 'frank' and accurate about what to see and how to avoid the costly tourist traps. It places you at the same level of the 'locals', both financially and it living the experience of 'being there'.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "He and his wife went to Alaska in May. They said this and the other Lonely Planet book (Backpacking in Alaska) were the most useful of several Alaska books and were the ones they took with them. They were hiking and kayaking - it might be different on cruise. When they went into a bar mentioned on page 139 they showed the owner the book. She didn't know her bar was in it and was very pleased and gave them their drinks for free. I can't guarantee that will work every time. Five bars are mentioned so you might have to shop around.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            }
        ]
    }
]