[
    {
        "Title": "childs story bible",
        "description": "Color pictures, maps, and a glossary clarify these simplified biblical stories from both the Old and New Testaments.",
        "authors": "['Catherine F. Vos']",
        "infoLink": "http://books.google.com/books?id=QKVsM1wxFJoC&dq=Child%27s+story+Bible,&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My husband was given this story Bible back in 1961 when he was baptised as an infant. We are still reading it to our 4 children today. It has been glued and reglued, taped, etc. to hold together this beautiful text. I was ecstatic to discover it's been recently republished. I have encouraged many parents to purchase it as it is an excellent, easy to read Bible for the whole family! Parents themselves don't often model personal devotions because so much of the Bible is difficult to understand. Read this every night and I guarantee you'll understand your own Bible much better, and have the best basic biblical overview possible! Vos doesn't water down the Bible stories - even some of the gory details - but in a respectful, careful manner she presents nearly every bible story. We LOVE this book!",
                "review/helpfulness": "104/105",
                "num_reviews": 105
            },
            {
                "review/text": "This book is wonderfully written in a manner as if a grandmother were telling these Bible stories to her children (that is actually how the book came to be written). It is not watered down Bible stories but they are portrayed as the exciting, dramatic events they were. Customs and doctrines (reformed) are explained right in the story line. Although it is not the complete Bible, it contains all the narrative and historical passages of the Bible. It is divided into chapters which may cover several Bible chapters (it may mix books of the Bible as it tries to tell the story of the nation of Israel chronilogically). The Child's Story Bible contains 110 chapters of old testament stories and 92 of new testament stories. It is a wonderful devotional guide for the family as it is easy for young children to understand yet not too simplistic for older children. Our family loves it and has learned a lot from it!!",
                "review/helpfulness": "79/79",
                "num_reviews": 79
            },
            {
                "review/text": "My children love this Bible. The stories come alive and they are easily understandable. The stories are biblically accurate and center around Christ, even in the Old Testament stories. I highly recommend this Bible for giving your kids a well-rounded knowledge of the Bible.",
                "review/helpfulness": "45/46",
                "num_reviews": 46
            },
            {
                "review/text": "Mrs. Vos's daughter gives her mother a most beautiful compliment in writing of her mother's passion: creating a Biblically accurate children's story Bible. She observes, that, as a child, she took almost no notice of her mother's personally-committed habit of ascending the steps of their home to an upstairs area where she could research and write... what has become one of the best Bible story books written.Our family used it as a three year Bible course. We learned so much from her added notes which weaves the stories to the time line of Israelite history. Catherine F. Vos' chronologically written stories gave a point of reference from which our son could create a timeline of pictures and Bible references.",
                "review/helpfulness": "37/38",
                "num_reviews": 38
            },
            {
                "review/text": "I first heard stories of the Bible from this book and reread it multiple times through high school. I grew up on the King James Version of the Bible and this book closely parallels it as well as providing the actual Biblical references for each story. When I had my own daughter in 1978, I asked my mother for our old volume, but she had gotten rid of it. At that time, all I could find was the paperback version and so had to make do with it. I continued to search for The Child's Story Bible and purchased a 1932 and 1961 version from a major on-line auction site. Nevertheless, I was delighted to find Amazon had obtained the 1986 version - the last hardback I can find of this book. I purchased one for a future grandchild and one for my daughter to give to her niece. In reviewing the text, I was pleased to see that the editors had not succumbed to making this a politically correct version of the Bible, but chose to maintain the integrity of the original text. If you are looking for a great addition to your child's library or a text that will provide many hours of delightful reading and sharing of the Bible with a child, this is your choice!",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "My wife and I argue over who get's to read this to our kids. It is that good. I would recommend this Bible to anyone who wants a clear, plain language understanding of the Bible. It is great for new Christians or people who have questions about the Bible but are intimidated to read it. It will motivate your kids to ask questions and motivate you to read the Bible. You will not wrong with this one! Enjoy!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "We heard about this Bible from several homeschooling resources and weren't sure about purchasing it because we already had 3 children's Bibles. I am so happy that we did!!! This is a wonderful story Bible that is easy to read and also very engaging -- our children are 3 and 5. I highly recommend it!",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "I grew up on this book! Before I could read, my parents used to read me the stories. Once I had learned to fend for myself, it became \"my\" Bible until I reached my teens. When our daughter wanted to start hearing the Bible stories, we read to her from the Child's Story Bible; I was amazed at how well the old book had held up. Its simple style and gorgeous paintings were as enchanting as they used to be. Now, we are waiting until our granddaughter is old enough to embark on the wondrous stories. I am so glad that the book is still in print! Buy it and use it--you won't be disappointed.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "We have used this book as a part of our family worship time for several years. The more I see of what else is offered for children's \"bibles\" the more I appreciate this book.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I like the fact that it delves more into the stories than the typical children's bible- and we really get a feel for what the bible is saying. Also, I appreciate the chronological order which helps the readers- kids esp. to understand the connection all the stories have to one another.The one thing I don't like though is the lack of pictures. This would really help my kids stay focused as I read them the stories.I hand out the typical children's bibles, mentioned above, which are so chock full of pictures yet lacking in substance, and the kids look at those pictures while I read from this book.Overall, a good book. I would buy it again.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "the childs story bible",
        "description": "Color pictures, maps, and a glossary clarify these simplified biblical stories from both the Old and New Testaments.",
        "authors": "['Catherine F. Vos']",
        "infoLink": "http://books.google.com/books?id=QKVsM1wxFJoC&dq=The+child%27s+story+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My husband was given this story Bible back in 1961 when he was baptised as an infant. We are still reading it to our 4 children today. It has been glued and reglued, taped, etc. to hold together this beautiful text. I was ecstatic to discover it's been recently republished. I have encouraged many parents to purchase it as it is an excellent, easy to read Bible for the whole family! Parents themselves don't often model personal devotions because so much of the Bible is difficult to understand. Read this every night and I guarantee you'll understand your own Bible much better, and have the best basic biblical overview possible! Vos doesn't water down the Bible stories - even some of the gory details - but in a respectful, careful manner she presents nearly every bible story. We LOVE this book!",
                "review/helpfulness": "104/105",
                "num_reviews": 105
            },
            {
                "review/text": "This book is wonderfully written in a manner as if a grandmother were telling these Bible stories to her children (that is actually how the book came to be written). It is not watered down Bible stories but they are portrayed as the exciting, dramatic events they were. Customs and doctrines (reformed) are explained right in the story line. Although it is not the complete Bible, it contains all the narrative and historical passages of the Bible. It is divided into chapters which may cover several Bible chapters (it may mix books of the Bible as it tries to tell the story of the nation of Israel chronilogically). The Child's Story Bible contains 110 chapters of old testament stories and 92 of new testament stories. It is a wonderful devotional guide for the family as it is easy for young children to understand yet not too simplistic for older children. Our family loves it and has learned a lot from it!!",
                "review/helpfulness": "79/79",
                "num_reviews": 79
            },
            {
                "review/text": "My children love this Bible. The stories come alive and they are easily understandable. The stories are biblically accurate and center around Christ, even in the Old Testament stories. I highly recommend this Bible for giving your kids a well-rounded knowledge of the Bible.",
                "review/helpfulness": "45/46",
                "num_reviews": 46
            },
            {
                "review/text": "Mrs. Vos's daughter gives her mother a most beautiful compliment in writing of her mother's passion: creating a Biblically accurate children's story Bible. She observes, that, as a child, she took almost no notice of her mother's personally-committed habit of ascending the steps of their home to an upstairs area where she could research and write... what has become one of the best Bible story books written.Our family used it as a three year Bible course. We learned so much from her added notes which weaves the stories to the time line of Israelite history. Catherine F. Vos' chronologically written stories gave a point of reference from which our son could create a timeline of pictures and Bible references.",
                "review/helpfulness": "37/38",
                "num_reviews": 38
            },
            {
                "review/text": "I first heard stories of the Bible from this book and reread it multiple times through high school. I grew up on the King James Version of the Bible and this book closely parallels it as well as providing the actual Biblical references for each story. When I had my own daughter in 1978, I asked my mother for our old volume, but she had gotten rid of it. At that time, all I could find was the paperback version and so had to make do with it. I continued to search for The Child's Story Bible and purchased a 1932 and 1961 version from a major on-line auction site. Nevertheless, I was delighted to find Amazon had obtained the 1986 version - the last hardback I can find of this book. I purchased one for a future grandchild and one for my daughter to give to her niece. In reviewing the text, I was pleased to see that the editors had not succumbed to making this a politically correct version of the Bible, but chose to maintain the integrity of the original text. If you are looking for a great addition to your child's library or a text that will provide many hours of delightful reading and sharing of the Bible with a child, this is your choice!",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "My wife and I argue over who get's to read this to our kids. It is that good. I would recommend this Bible to anyone who wants a clear, plain language understanding of the Bible. It is great for new Christians or people who have questions about the Bible but are intimidated to read it. It will motivate your kids to ask questions and motivate you to read the Bible. You will not wrong with this one! Enjoy!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "We heard about this Bible from several homeschooling resources and weren't sure about purchasing it because we already had 3 children's Bibles. I am so happy that we did!!! This is a wonderful story Bible that is easy to read and also very engaging -- our children are 3 and 5. I highly recommend it!",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "I grew up on this book! Before I could read, my parents used to read me the stories. Once I had learned to fend for myself, it became \"my\" Bible until I reached my teens. When our daughter wanted to start hearing the Bible stories, we read to her from the Child's Story Bible; I was amazed at how well the old book had held up. Its simple style and gorgeous paintings were as enchanting as they used to be. Now, we are waiting until our granddaughter is old enough to embark on the wondrous stories. I am so glad that the book is still in print! Buy it and use it--you won't be disappointed.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "We have used this book as a part of our family worship time for several years. The more I see of what else is offered for children's \"bibles\" the more I appreciate this book.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I like the fact that it delves more into the stories than the typical children's bible- and we really get a feel for what the bible is saying. Also, I appreciate the chronological order which helps the readers- kids esp. to understand the connection all the stories have to one another.The one thing I don't like though is the lack of pictures. This would really help my kids stay focused as I read them the stories.I hand out the typical children's bibles, mentioned above, which are so chock full of pictures yet lacking in substance, and the kids look at those pictures while I read from this book.Overall, a good book. I would buy it again.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            }
        ]
    },
    {
        "Title": "is the bible true how modern debates and discoveries affirm the essence of the scriptures",
        "description": "In this lucid, insightful work, U.S. News & World Report religion writer Jeffrey L. Sheler draws upon years of investigation and in-depth interviews to tackle such controversial subjects as the recent Jesus Seminar, modern biblical archaeology, the Dead Sea Scrolls, and the mysterious Bible codes. This solid exploration into some of the thorniest aspects of current debates about the Bible and religion concludes with a message of reassurance about historical accuracy, validity, and integrity of the Scriptures. Sheler's bold but balanced investigation discloses a Bible still worthy of belief in a modern age. In this authoritative book, renowned U.S. News & World Report religion writer Jeffrey L. Sheler sifts through the claims and counterclaims of contemporary biblical studies. After carefully investigating the full spectrum of cutting-edge research and conflicting reports, he challenges the popular perception that the credibility of the Bible has been seriously undermined by critical scholarship. Rather, he concludes that the weight of the historical evidence upholds the essential truth of Exodus, the Gospel accounts of Jesus, and other vital elements of the Bible. The author draws extensively from his own interviews with leading Bible experts and on-site reports from Israel and Egypt in his examination of scholarship's hot-button issues, including: Dramatic archaeological discoveries that both affirm and challenge the history in the Bible. The controversial quest for the historical Jesus and its sometimes flawed arguments and skeptical assumptions regarding the reliability of the Gospels. The amazing revelations of the Dead Sea Scrolls and other ancient texts that profoundly influence our understanding of the Bible. The mysterious phenomenon of The Bible Code and why there may be far less to its doomsday prophesies than meets the eye. Sheler's considerable experience as a leading religion journalist enables him to get to the heart of the issues without the jargon. Written in clear, compelling prose, Is the Bible True? Presents a sophisticated analysis informed by important scholarly work in lucid, accessible terms.",
        "authors": "['Jeffery L. Sheler']",
        "infoLink": "https://play.google.com/store/books/details?id=zC-2gWuc_ykC&source=gbs_api",
        "review": [
            {
                "review/text": "Sheler's book is generally good and helpful. He discusses many ways in which archaeology support the Bible record--both by direct evidence, and by proving that the Bible accurately reflects the time in which it was written. The book will definitely give you a new appreciation for the accuracy of the Bible!Sheler also does us a favor when he shows how misguided the hardened critics are (on one hand), and mystical kooks (on the other). For example, hardened critics believed there was no David, no Sargon, and no Nebuchadnezzar--until archaeologists found evidence of all three. On the other hand, mystical kooks continually dish up silliness like the Dead Sea Scrolls conspiracy theories: suggesting that the scrolls are being held secret because they would completely disprove the New Testament, etc.. Other kooky ideas include ``Bible Code'' theories and the modern gnostic ideas, which suggest that the ``real message'' of the Bible is in the form of a secret message.Sheler's book has its weaknesses, though. He tries to be a little too glib. He dismisses the Bible a little lightly at times, suggesting that ``only serious fundamentalists'' take this or that portion of the Bible seriously. It makes him shoot low: he is content to prove that the Bible is ``generally accurate'' while at the same time leaving the impression that the Bible has often botched the details.Overall, the book is good and helpful. It leaves an off taste, and some loose ends, for the reason I mention above. But if you can take it with a pinch of salt, you'll be glad you gave it a read.",
                "review/helpfulness": "42/48",
                "num_reviews": 48
            },
            {
                "review/text": "This book takes the approach that the Bible can (and perhaps should) be considered in the same manner as any other ancient text. The author points out that this often is not what happens; rather that (often in the service of their own prejudices) scholars hold a double standard which demands more of Biblical text than other contemporaneous writings. The whole presentation of this book was refreshing in the respect that it paid to the three major monotheistic religions of the Middle East, and especially so the Christian tradition. Whereas many current writers seem intent on &quot;debunking&quot; religious belief, this book can, and does, strengthen one's faith. The archeological and historical support for Biblical scriptures is presented in a manner that can be understood easily, historiographical issues are raised and discussed, and when the evidence simply is not there (in either direction) the author says so. As a Christian, I appreciated Mr. Sheler's respect. As an educated man (doctorate and practicing psychologist) I appreciate the intelligence Mr. Sheler brought to the table. This was a very difficult task that was done well!",
                "review/helpfulness": "31/34",
                "num_reviews": 34
            },
            {
                "review/text": "I really enjoyed this book. I was prepared for it to be full of sloppy thinking and predjudiced conclusions. I commend the author for his evenhanded evaluation of the Bible. I was especially encouraged by the section on archeology. This book should cause anyone to want to read the Bible directly regardless of thier religious views.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "Recently I have read a number of books in the &quot;holy bloodline of Christ&quot; genre (The Templar Revelation, The Hiram Code, The Tomb of God, etc.) in which the authors engage in cavalier exegesis of the Bible while accepting, uncritically, virtually every skeptical perspective on the historicity of scripture. This book is a great book on its own terms, but it is a wonderful balance to these other popular and skeptical books attacking the normal understandings of Biblical history. The author has the intelligence and the courage to include the perspectives of scholars in the evangelical tradition, thereby avoiding the uncritical canonization of scholars in the traditions of orthodox &quot;higher criticism.&quot; I especially appreciated his chapter on the Dead Sea Scrolls. This is one of the best books that I have seen for laypeople seeking to understand issues of Biblical criticism.",
                "review/helpfulness": "27/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book is well written, and easy to read. The author takes a non-biased overview of some of the historical and archaeological studies pertaining to the Bible. Of particular interest were the sections on the Dead Sea Scrolls, and the search for historical evidence of Jesus Christ. The author does an excellent job at balancing out some of the &quot;conspiracy theories&quot; with factual evidence of the texts themselves. The comparisons of some of the religious cults, which existed at the time the Gospels, were fascinating. The Book of John, which has often been decried as not being an eyewitness account may actually have been the first Gospel written, according to the author, due to some new cross reference with other sects at the time which place some of the language and images used by John as existing during the historical time period of Jesus. While much of the evidence may be found in other places the book is an excellent overview. Overall, this book is well researched, and well written. It is rare to find a non-biased overview of the subject matter, definitely worth the time. I would recommend this book for anyone searching for evidence of Biblical truth. The more archeology progresses, the more Biblical truths are validated, and this book does a great job of reporting that evidence.",
                "review/helpfulness": "18/22",
                "num_reviews": 22
            },
            {
                "review/text": "REVIEW OF SHELER, IS THE BIBLE TRUE?It is unwise to base a world-view on science and scholarship because by their very nature science and scholarship constantly change (\"Stay tuned!\" is a very good motto), whereas philosophy begins by asking, What is it that does not change? Nonetheless, science and scholarship have their place and books like this are very helpful since few of us have the time to look into the research itself or the expertise required to evaluate it.Sheler shows unusual balance and fairness and obviously has great respect for his subject. Unlike many of the scholars themselves, he is willing to consider non-textual as well as textual evidence. Sheler does not however actually summarize the evidence for many contemporary mainstream scholarly views (e.g., the view that Mark's Gospel is the earliest), and does not in every case mention important minority views (e.g., the view that structural features of the text militate, in part, against widespread notions of multiple authorship). I might mention that only a few decades ago you could find Bible commentaries that took it as fact, rather than mere speculation, that Matthew's Gospel was not only the earliest, but was originally written in Aramaic.A few remarks:(a) The meaning of \"scholarly consensus.\" Consider p. 26, par. 2, line 2: \"If there is any consensus at all...\" It must be realized that \"consensus\" in the scientific and scholarly world does not necessarily mean, as one might suppose, that a group of researchers have independently arrived at the same conclusion. It may also mean that one or a few researchers have influenced many others, in a \"follow-the-leader\" fashion. Thus if, say, twenty scholars yield a \"consensus\" this does not necessarily mean there are twenty independent converging bodies of research.(b) Sheler does not compare biblical scholarship with scholarship on other ancient texts. Recall for example that in the 19th century multiple authorship for Homer's epics was widely taught by scholars; this is not mainstream thought today. It would be nice to know whether this evidence was similar to, or very different from, that for multiple authorship of the Pentateuch. Etc.(c) Sheler's Protestant background occasionally shows. In note 8 for Chapter 2, p. 258, speaking of the seven deutero-canonical Old Testament books, Sheler says \"they were added to the Roman Catholic canon in 1546 at the Council of Trent.\" This is factually true but misleading, because it sounds as if the Catholics \"added something\" to the Bible whereas in fact the Protestants \"took something out.\" The matter is explained in Sheler's text; it is only the footnote that is misleading.(d) We find in Sheler the common casual identification of the past (what actually happened) with written history (what we know). Thus \"As a missionary, he [Paul] was chiefly responsible for establishing Christianity in the Greco-Roman world.\" No doubt Paul was important; and his letters are foundational for doctrine. But according to the New Testament record, seventy-odd unknown apostles were sent out by Jesus himself; Jesus was on earth some 40 days _after_ his resurrection; there was Pentecost, which the text hints had far-reaching effects; we have that tantalizing note at the end of John's Gospel about the \"many other things which Jesus did...\" which would fill many books; and so on.Ken Miner",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "When dealing with questions about the Bible and about faith, we are often only able to find extremists--whether from the right or the left. Balance is a rare commodity. I think Jeffery Sheler brings us that balance in &quot;Is the Bible True?&quot; He attempts (and does a very good job) at listening to what people are saying on both (or all) sides of the issues, trying to understand who they are and where they are coming from, and then trying to make sense of it all. Although at times Sheler gives his evaluation of the merits of logic one side or the other, he never does it in a way that tries to force us to think his way.As when reading any treatment that seeks to be balanced and fair, if you take a strong position on the issues one way or another, you will probably feel that your position isn't being treated adequately. There were times when I wished he would have said some things that he didn't. There were some &quot;facts&quot; I felt he left out, which of course would have helped &quot;prove&quot; my own position. No doubt, both conservative and liberal Bible readers will find reasons to be unhappy or disappointed.But if you sincerely want to learn about what different people think regarding the Bible, you'll find some interesting and helpful input. What Sheler sets out to do, he does well. For a person who is trying for the first time to understand the questions surrounding the Bible, this book will give you a good framework to begin that search. You'll want to continue from there. I'd recommend N.T. Wright's &quot;The New Testament and the People of God&quot; as a next (although more scholarly) step in your search.Overall, I thought it was interesting, enjoyable, understandable, and helpful.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "Being a skeptic, I am always intrigued by writings from both sides of the debate regarding the historical accuracy and validity of the so called holy scriptures. I have come across so many writings from believers and non believers alike. I have read material from detractors who are obviously filled with hate and a naturalisic bias, as well as writings from ignorant and intellectually lazy Christians who refuse to investigate and deal with the genuine and honest questions that are raised when their beliefs are challenged. I was very curious as to the position that this particular writer would take. I found the writer to quite refreshing in his honesty and scholastic approach. His writings came across as neither reflecting any of the two aforementioned positions. He presented the material, both in the affirmitive and negation, in a non-ranting,unprejudicial manner, while giving the reader room to draw their own conclusions. Though proponents of both sides may not like this approach along with their subsequential conclusions, readers who are seeking truth (as they understand it to be)on these matters will be happy to see that honesty and integrity can still be found while dealing with such controversial topics. A must for any honest seeker who has no \"particular axe to grind\" in such matters.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "I found this book &quot;by accident,&quot; and was intrigued to see what a mainstream journalist would do with such a potentially volatile topic. His readable, clear and swift style were pleasant surprises. Even more surprising was his fair treatment of opposing viewpoints/worldviews of the nature of the biblical texts.Because already-submitted reviews detail the strengths and weaknesses of Sheler's book, I would like to emphasize what I consider its greatest strength: Sheler's consistent revealing of the underlying philosophies/assumptions of the scholars and academics active today in biblical criticism. It is critical for those seeking answers and clues to the nature of the Bible to not accept blindly someone's opinion simply because of a hefty-sounding degree from a prestigious university. Many contemporary scholars approach the Bible with the underlying theistic or even atheistic assumptions, and you better believe that those presuppositions heavily influence their findings.Sheler is also to be commended for his honesty and fairness in showing where there is an existing paucity in historical evidence to support the biblical narratives. Also, he does a good job of introducing the idea that ancient writers did not write their works with the same intentions and &quot;standards&quot; that we take for granted 20 centuries later. It is important that we are able to read them as they intended, and not to superimpose our own standards of journalistic writing on them.Additionally, Sheler does a fantastic job of explaining and debunking the Bible codes in language readable and accessible to laymen (like myself) who would easily be thrown by heavily technical discussions of the mathematics involved.To interested readers, I would strongly recommend &quot;Will the Real Jesus Please Stand Up?&quot; by Craig and Crossan. While more focused in topic, it deals with the same issue of underlying assumptions and evidences as does Sheler's book.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Mr. Sheler presented a wide look at the major arguments for and against the Bible as truth. His fair and balanced look at the issue can only lead the reader to reevaluate his or her own views on the subject.It was refreshing to read a positive and honest evaluation of the evidences, rather than the unfounded negativity that one usually finds in modern Biblical study. I would highly recommend this book to anyone looking for the evidence to present an honest apologetic defense of the Scripture as true and inspired.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "101 favorite stories from the bible",
        "description": "An illustrated retelling of stories from the Old and New Testaments includes Bible verses and discussion questions.",
        "authors": "['Ura Miller']",
        "infoLink": "http://books.google.nl/books?id=SYTbwAEACAAJ&dq=101+favorite+stories+from+the+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Parents normally introduce their kids at a much earlier age to fairy tales books than to the Bible. Why? Because the text is just too complicated to explain to the young minds.Thanks to this 101 Favorite Stories, it is now a lot easier to introduce our kids to the wonderful bible stories. Each page contains one summarized story of an important bible event (including corresponding verse) &amp; opposite its page is a colorful illustration that will captivate a young mind &amp; hold its short-spanned attention. What's even greater is that, this book holds stories both from the Old &amp; New Testament.Just be careful when you let your toddlers read/view this book as the pages are not cardboard material &amp; can be torn by small excited fingers.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Very good visual Bible -- better for 6 and up than for younger years. There are follow up questions. We use it for family devotions. The pictures are very clear, a little too busy if your children are under 3, but remember, children GROW. This is a great book to have on hand -- we toss it in the church bag and can look up the scripture readings each week. It's nice for the kids to have a visual reference.With 101 stories, we can do the whole thing, one page per day, for summer vacation (that's the plan).This is not a baby Bible -- it's much more rich than most.Good book.*** edited in August 2008 -- Try David R. Helm's Big Picture Story Bible, too -- it's a wonderful book. ***",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "We are a bit disappointed... there are many assumptions for words, labels, titles and terms which require explanation to our 5 year old. Our Egermeier is preferred.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Featuring beautiful color illustrations, 101 Favorite Stories from the Bible is an anthology of classic biblical tales. Written and presented to be shared between parents and children, 101 Favorite Stories from the Bible features a complete, plain-terms version of each biblical story on the left page of each two-page spread, and an illustration along with comments and questions directed to parents and children on the right page. Tales from both the Old and New Testaments abound in 101 Favorite Stories from the Bible, the ultimate read-aloud storybook for Christian households.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the bible as literature an introduction",
        "description": "This comprehensive and systematic text approaches the Bible from a literary/historical perspective and studies it as a body of writing produced by real people who intended to convey messages to real audiences.",
        "authors": "['John B. Gabel']",
        "infoLink": "http://books.google.com/books?id=MNkYAQAAMAAJ&dq=The+Bible+as+Literature:+An+Introduction&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "It is difficult to separate the literary and religious aspects of the Bible, but the authors' focus is on the book &quot;as literature&quot; and in the space of 357 pages (in my copy of the 4th edition - 432 according to Amazon.com), they cover literary forms and strategies, historical and geographic settings, the major components of the Old and New Testaments and the Apocrypha and Pseudoepigrapha, and issues concerning the text and its translation. A valuable final chapter considers the religious use and interpretation of the Bible. Although the book is concise, it manages in its 18 chapters and 3 appendices to be comprehensive and is consistently readable. I find the sensible, scientific approach credible and while it frequently causes me to reflect on my religious beliefs, they are not seriously undermined by this liberal approach. I do not know of a better introduction to the Bible.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "I think that this book is wonderful! I am a student of Dr. Anthony York's and we have utilized this book in our classes. The Bible As Literature discusses the Bible in a manner that helps the reader actually read what is/was written without all the religious jargon. I highly recommend this book to anyone who is curious about &quot;The Bible&quot; or to anyone who thinks they &quot;really&quot; know what the Bible states.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            }
        ]
    },
    {
        "Title": "adventure bible handbook a wild spectacular hightech trip through the bible",
        "description": "Bible stories told in an upbeat comic graphic style. 9-15 yrs.",
        "authors": "['Ed M. Van der Maas']",
        "infoLink": "http://books.google.com/books?id=KTf8NSe8gQcC&dq=Adventure+Bible+Handbook:+A+Wild+Spectacular+High-Tech+Trip+through+the+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Adventure Bible Handbook is a well- illustrated, well-wriiten action/adventure for children of all ages. The ABH is specifically targeted to reach children of ages 8-18 (approx) and makes God and His Word interesting &amp; fun for the reader. The characters in the story travel through time (back to Genesis and forward to Revelation) to gather a more complete under-standing of the Books of the Bible. I highly recommend this book for parents &amp; children alike.There aren't any books that are directly similar to the ABH, therefore, I feel that it is the best for the market it is intended to reach. Action &amp; Adventure are key to this book-which allows the reader to become totally consumed by the stories. Pick up your copy today, Enjoy!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I don't actually own this book but I borrowed it from my grandmother's church and I just loved it. I now am going to buy it. Anyone who is trying to learn about the bible should try to read this book, even though it's very long and might take you a while. It was cool because it was like a comic book where 5 kids and a frog named Froggo tries to run away from a merchant named Max and his henchman, Dr. Mo:-(. It's not really a bible, but it has little pieces from the bible teaching you about the bible, like it has Adam and Eve, some pieces from Esther, and it tells you what happened between the Old and New Testament. It has places where it says you should read from your bible, which I haven't done, but I might. Overall, this is a good story for people who love the bible or people who like tech stuff. This was written by a ten-year-old.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "who wrote the bible",
        "description": "A much anticipated reissue of Who Wrote the Bible?-the contemporary classic the New York Times Book Review called \"a thought-provoking [and] perceptive guide\" that identifies the individual writers of the Pentateuch and explains what they can teach us about the origins of the Bible. For thousands of years, the prophet Moses was regarded as the sole author of the first five books of the Bible, known as the Pentateuch. According to tradition, Moses was divinely directed to write down foundational events in the history of the world: the creation of humans, the worldwide flood, the laws as they were handed down at Mt. Sinai, and the cycle of Israel's enslavement and liberation from Egypt. However, these stories-and their frequent discrepancies-provoke questions: why does the first chapter in Genesis say that man and woman were made in God's image, while the second says that woman was made from man's rib? Why does one account of the flood say it lasted forty days, while another records no less than one hundred? And why do some stories reflect the history of southern Judah, while others seem sourced from northern Israel? Originally published in 1987, Richard Friedman's Who Wrote the Bible? joins a host of modern scholars who show that the Pentateuch was written by at least four distinct voices-separated by borders, political alliances, and particular moments in history-then connected by brilliant editors. Rather than cast doubt onto the legitimacy of the Bible, Friedman uses these divergent accounts to illuminate a text that was written by real people. Friedman's seminal and bestselling text is a comprehensive and authoritative answer to the question: just who exactly wrote the Bible?",
        "authors": "['Richard Friedman']",
        "infoLink": "http://books.google.com/books?id=GafkyQEACAAJ&dq=Who+Wrote+the+Bible%3F&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I had read several books that purported to explain the origins of the Old Testament, but they tended to make assertions without explanations. Perhaps they were too advanced for me. This book, however, explains in great detail how it arrives at its conclusions.It is great fun to read parts of the book and ask yourself: Whodunit? For example, there's one place where you are compelled to predict who wrote about the Golden Calf incident. I picked J, but the author picked E. After he explained his decision, I had to admit that he was probably right and I was probably wrong. Not so good for my ego, but an enjoyable puzzle nonetheless.The author is careful not to overstate his case. In situations where he lacks sufficient evidence, he points this out. This level of caution makes the whole work much more credible.I greatly enjoyed the way he explained how the political reality of the ancient Near East created pressures to write (or compile) a particular KIND of book. Prior to this, I knew that many Bible stories contained contradictions, but I didn't know why.What is interesting about this -- though this may be lost on literalists -- is that the analysis of the Bible in no way diminishes it. Indeed, by explaining the reasons for the contradictions (rather than simply explaining-away), this book greatly increases my respect for the Bible.I think everybody who claims to know the Bible should read this book. It's all very well to memorize chapter and verse, but if you don't know of the Bible's origins, you can hardly claim to understand all its implications.",
                "review/helpfulness": "343/365",
                "num_reviews": 365
            },
            {
                "review/text": "Friedman keeps to a very narrow, but clearly defined, path in assessing biblical origins. He goes to some effort to restrict his thesis to identifying authors and their likely locations. The validity of events nor theology never enter the picture. Contention over inconsistencies in what has come down to us as \"the\" bible have raged for centuries. Scholars in the Middle Ages, he reminds us, readily noted how styles varied, accounts were duplicated and traditions conflicted. With a keen analytical eye enhanced by long experience and good scholarship, he teases a coherent picture from this confusing collection of tales. Although not all the material here is original - and how could it be? - Friedman's assemblage is soundly researched, very ably organised and presented.The fundamental issue rests on the division of the Hebrew-speaking peoples into the \"dual kingdoms\" of Israel and Judah. The result was the compilation of two \"histories\" with different styles and priorities. Each had a different focus and approach to what was meaningful. The later confusion resulted when this pair of accounts was amalgamated into a single document and promulgated as \"the\" book. Friedman strongly points out that this didn't invalidate the histories, it simply meant readers of it need to understand they are reading a parallel set of accounts.From the outset, Friedman dismisses the traditional view of Moses' authorship. There are too many implausibilities for that to have occurred - not the least of which is the description of Moses' death. Friedman contends the books are historical accounts recorded by scribes, probably court priests, of their respective kingdoms. Their style differences allow him to pin letter designations for identification - the now well-known E, J, D and P. The first two refer to how the deity was identified. The \"D\" is for \"Deuteronomist\", identified by stylistic traits, while the \"P\" relates to priestly genealogies. Friedman uses various highlighting techniques to demonstrate variances in the text style or content. This rather hotch-potch arrangement was later organised into the single volume by the \"Redactor\" [the \"E\" for \"Editor\" having already been assigned.Setting his thesis within a well-defined chronology, Friedman shows how the various authors had previously material to draw on producing their own accounts. With no possibility of retrieving the sequence, we have only the results passed down to us. This situation explains many of the inconsistencies, since Judaic scribes had different sources than those in Israel. They also, apparently, had different agendas to follow. Almost from the beginning, for example, there are differences in the roles of Moses and Aaron. Friedman lists other variations with their probable origins.Friedman's book is the best current example of what has become known as the \"Documentary Hypothesis\". This phrase stands in contrast with the idea of \"divine origins\" of the collection. As examples of historical literature, the books of the Hebrew Bible merit serious investigation and analysis. Friedman, picking up from French and German studies of the past two centuries, has performed a significant task. He writes well, doesn't engage in idle speculation, and, perhaps most important, condemns none. The authors he discusses were products of their time. He recognises that, keeping the authors clearly within their contemporary context. An excellent book, worthy of anybody's attention. [stephen a. haines - Ottawa, Canada]",
                "review/helpfulness": "185/198",
                "num_reviews": 198
            },
            {
                "review/text": "Richard Elliott Friedman's Who Wrote the Bible has a lot going for it. It is probably the clearest guide for the lay reader to the &quot;Documentary Hypothesis&quot; -- the notion that the Torah, the Five Books of Moses, were not written all at one time but assembled from at least four major sources composed at different times and under different circumstances. This idea, which was first proposed in late eighteenth century France and developed by Julius Wellhausen in the nineteenth century, allows one to see the religious traditions of ancient Israel as historically evolving from a nature cult, through centralized worship and sacrifice, to a text-based ethical religion. Friedman tells the story of the composition of the Torah with great clarity and verve, in a way that a reader lacking Hebrew can understand. Occasionally I find Friedman's exposition to be marred by what might be called &quot;special pleading.&quot; Friedman will have a novel idea and will present it in a way that seems quite convincing, but since he doesn't really present the alternatives other scholars have considered, I sometimes feel he is pulling a fast one on the less learned reader. He has a theory, for example, that the E document (composed in the Northern Kingdom around the 9th century BC) was written by a priest at the old site of Shiloh, in the tribal area of Ephraim. He supports this by the Golden Calf episode in Exodus 32-34. This text attacks Aaron, and so, he argues, it couldn't have been written in the southern kingdom of Judah, where the priesthood was descended from Aaron. But it also presents idolatry in terms of a Golden Calf, and the Calf was the symbol Jeroboam used in place of the Cherub in the alternative temples he set up in the North at Dan and Bethel. Friedman argues that a priest of Shiloh would have no ties to Aaron, and would be jealous of the successful priesthood in Bethel, and so would have precisely the ideology required to write the story that way. That works, though, ONLY if the story is all of one piece written by a single narrator. But many scholars think (on the basis of linguistic evidence) that this part of Exodus was put together by an editor who was combining the narratives from the J (southern) and E (northern) traditions after the destruction of the northern kingdom by Assyria. If that is the case, you don't have to imagine an alienated priest from Shiloh at all. The connivance of Aaron in rebellion and idolatry could be from the E (northern) document, and the Golden Calf symbol could be from the J (southern) document, skillfully edited together by the JE editor. Hypotheses should be as simple and plausible as they can be. I'm from New York, and when I hear hoofbeats outside my window, I think &quot;horses&quot; (there's a riding stable down the block). I don't think &quot;buffalo.&quot; Sometimes I think Friedman hears too many buffalo.",
                "review/helpfulness": "88/96",
                "num_reviews": 96
            },
            {
                "review/text": "I was persuaded by Friedman until I read Before Abraham Was: The Unity of Genesis 1-11 by Issac M. Kikwada and Arthur Quinn (Ignatius Press, 1989), which I reviewed here by saying that &quot;Freidman's prize example of the documentary hypothesis, based on work by Julius Welhausen, shows that you can slice the Noah story into two separate accounts, written by two different authors, each with an allegedly separate vocabulary and concerns. Kikawada and Quinn look at the same passages, questioning the assumptions behind the documentary approach (showing, for example, other ancient writings that mix different names for diety in the same passages). They also show both large scale and local chiasms (inverted parallel structures) running through the Noah story, showing that the same repetition that documentary scholars see as evidence of multiple authorship, can be seen from another perspective, as evidence of concious artfulness. Reading Friedman and Kikawada and Quinn might also send you scrambling for another look at Thomas Kuhn's _The Structure of Scientific Revolutions_, so that you can consider how one goes about choosing between conflicting paradigms.&quot; It's a good book, but not the last word on the subject. Friedman's book contains not a word about Hebrew poetic forms, particularly chiasmus, despite chiastic structures having been proposed for the Noah story as early as 1930 in Lund's Chiasmus in the New Testament.",
                "review/helpfulness": "45/64",
                "num_reviews": 64
            },
            {
                "review/text": "Richard Elliot Friedman's \"Who Wrote the Bible?\" is a fascinating, page-turing account that offers a satisfying answer to the question of who wrote the The Five Books of Moses. For years, Friedman writes, it was believed that Moses had authored the first five books of the Bible. This theory had difficulty enduring due to several factors, including the fact that the books had many contradictions in language and story. Then there was the not insignificant fact that Moses had written of his own death (explained by theologians as a prophetic vision of the future).It is interesting to note that church leaders had no problem accepting that the Four Gospels had different authors, but yet were resistant to the alternative theory about the Pentatuch's authorship. Friedman answers this contradiction by the rather obvious explanation that the Church was reluctant to have any changes or alterations made to their existing theory. Since the Moses myth had endured for hundreds of years, they were reluctant to part with it.Friedman starts the book with a succinct, and fascinating, account of the history of Semitic people in the Middle East between the years 1200-722 BC. He then begins to offer proof about who actually wrote the Five Books of Moses. He takes the reader through a fascinating breakdown of the language contradictions in certain part of the Bible, and supplies support for these contradictions by pointing to four different source materials that were used to make up the OT. With this theory in place (helped by an excellent index identifier for which sources supplied which story, or part of a story) he ably makes the case for the Documentary Theory of authorship. The Five Books of Moses are made up of parts of four different manuscripts, written by different sources, and pieced together by a later editor.\"Who Wrote the Bible?\" is fasinating -- intelligent, well written, and, above all, well supported by logic and source materials.",
                "review/helpfulness": "37/45",
                "num_reviews": 45
            },
            {
                "review/text": "Considering the academic nature of the topic, Mr. Friedman does an incredible job at keeping the topic matter approachable and engaging.As a Christian raised with a conservative protestant background, I found the information Mr. Friedman presents to be both fascinating and very disturbing. Disturbing in the sense that he describes a `story' of the creation of the first 5 books of the old testament in a way that differs markedly from what I have been taught in church about the Bible.And yet, I am finding that there is freedom in this new (at least for me) way of seeing the Bible because, frankly, I don't think it held together very well the way it had been presented to me at church. That being said, it also has caused me to really question and search out what the Bible really has to offer. That has led me to reading The Bible Unearthed by Israel Finkelstein and Neil Asher Silberman (Whoa! Not to be read by the faint of heart!) and An Introduction to the Old Testament by Walter Brueggmann (I hope he will help me figure out how to put the pieces of my disintegrated Bible paradigm back together in a new picture that still functions in some spiritual fashion).A worthwhile read for those exploring the part of the Bible and its origins.",
                "review/helpfulness": "40/45",
                "num_reviews": 45
            },
            {
                "review/text": "This is the best introduction to the JEPD hypothesis available. So if that's what you're after, this is your book. If you're going to study it thoroughly and carefully, I recommend keeping a good Bible handy, especially the Oxford Bible, which is the best for scholarly (non-denominational, non-devotional, non-theological) study.If you are reading the Bible simply for scholarly or literary purposes, a book like this is great.I recommend following this one up with a book like \"The Bible Unearthed\" by Finkelstein and Silberman, which deals with archaeology rather than textual investigation; and I strongly recommend reading a couple books by Hershel Shanks. After just this short reading list, you'll be able to digest even the most scholarly work on the Hebrew Bible, by folks like Mark Smith.But if you are looking for help reading the Bible as an element of your religious devotion, this book is probably not what you're looking for. Basically, modern scholars try to discover what the texts meant when they were written, rather than what they might mean to us. That takes a lot of irreverent detective work, and believers are usually uncomfortable, often defensive, when they encounter critical scholarship.HOWEVER - this is a big one - I honestly believe that the Biblical texts get much richer when critical scholarship is coupled with traditional and modern interpretations. The first chapters of Genesis provide a great example. Modern scholarship offers a lot of insight into what those stories (might have) meant to their original writers and audiences, and what they meant to later editors as well. We discover the spirituality of the ancients that has been hidden beneath more recent interpretations.Now you don't have to throw out your tradition's more recent interpretations. Although you might choose to do that, most traditions have a lot of other theological options.So, this is a long way of saying that if you read the Bible devotionally, then sure, modern scholarship will probably be challenging to your faith. But I encourage you not to put your head in the sand: find out what the scholars are saying. If, ultimately, you simply have to disagree and take a defensive stance, at least you'll know what you're up against. But probably, despite some struggles, you'll come to a much greater appreciation for the human authors of your scriptures, and for the depths of meaning hidden in the scriptures themselves. Not only that, but when you learn to see the scriptures from different perspectives, you'll probably learn a lot about your own tradition.",
                "review/helpfulness": "36/42",
                "num_reviews": 42
            },
            {
                "review/text": "Have you ever noticed that the story of the Creation is told twice in Genesis, in different ways? Or that at one point in Genesis Noah releases a dove from the ark, but just a few verses away, it says he released a raven? Scholars have found dozens of such \"doublets,\" bits of the Pentateuch (the first five books of the Old Testament) that cover the same ground, often differing in the details or the words used.Richard Friedman, in Who Wrote the Bible?, unravels the major literary strands in the Pentateuch. By sorting out verses according to word usage and other markers in the original Hebrew, Friedman comes to the conclusion that today's Pentateuch was originally four different works. (Not all of this is original with Friedman, but he sums up previous research and advances the theory significantly.) One book originated in Israel before the Babylonian invasion, the other in Judah, the southern and longer surviving part of the Hebrew kingdom. Among the differences between them, God is always called Yahweh (Jehovah) in the book from Israel, and Elohim in the book from Judah.A third major strand that Friedman unravels is associated with the priestly class. Not surprisingly, it dwells mostly on various ritual requirements. Almost the entire book of Leviticus is from this source. The fourth source is the writer of Deuteronomy. Have you ever noticed how Deuteronomy repeats so much of Genesis and Exodus?Perhaps the most important insight of the book is how the God of the books from Israel and Judah is essentially forgiving and maintains a personal relationship with the central figures of the narrative - Adam and Eve, Noah, Joseph, and Moses, for example. The God of the priestly source is characterized by high standards for human behavior and the imposition of consequences for going astray. Both of these aspects of God's nature are found in the New Testament as well. With ample documentation and convincing logic, Friedman develops the theory that a single editor wove these books together after the Babylonian exile, producing what we now know as the Pentateuch. This was a grand synthesis, in which no one original strand emerged dominant, and in which the several aspects of God are revealed. The result was a sum greater than the component parts (the kind of synergy one would expect from divine inspiration), and which ever since has been a central source for our understanding of God.Friedman does identify who he thinks wrote and edited most of the Pentateuch - names you will recognize. But I won't ruin the detective-like suspense of the book by telling you. If the book has a shortcoming, it's that it does not deal with the entire Old Testament. Beyond the Pentateuch, Friedman reaches forward briefly as far as Chronicles. I had hoped to read a treatment of Isaiah, with its prophecies of the Messiah, but it's not here.Altogether, an outstanding, insightful book. Highly recommended.",
                "review/helpfulness": "34/40",
                "num_reviews": 40
            },
            {
                "review/text": "This book was so fascinating, I couldn't put it down. It was so gripping, I kept reading it, even though I was supposed to be attending a Bible class at that very moment. This book is easy to read, and provides a wonderfully coherent theory as to the authors of various parts of the bible.The only problem is that most biblical scholars don't believe in it any more.While the documentary hypothesis is still central to the scholarly debate, the understanding of the various authors and dating of specific texts has evolved considerably since the writing of this book. Unfortunately, the only other text on this subject for lay people that I am aware of is \"The Book of J,\" by Bloom. Bloom is not a biblical scholar, and his book, while more up to date, has some huge factual errors (and his theory that one of the primary authors, J, was a Davidic princess, tends to evoke emotions ranging from amusement to fury).\"Who wrote the Bible,\" is definitely worth reading; it needs a huge grain of salt to go with it, though, so be careful.",
                "review/helpfulness": "24/36",
                "num_reviews": 36
            },
            {
                "review/text": "If you have any interest in the history of the near east, or the content of Old Testament's Pentateuch you owe it to yourself to read Richard Friedman's \"Who Wrote the Bible\". This book is a bit of a miracle in that it 1) grounds the reader in the history and scope of biblical scholarship, 2) logically builds the arguments for the documentary hypothesis from source material in a logically transparent way, 3) achieves the first two while being incredibly brief and compulsively easy to read. I'd venture to say that this book is a page turner. I had trouble putting it down (and no troubles picking it back up again). Lovers of the Bible will literally gasp as revelations of the text's origins are revealed and troublesome passages explained historically.You'll want to take a Bible and a fist full of different colored highlighters and then code the text for the different narrative voices (a handy appendix shows you exactly which passages are in which narrative). Then you'll want read the Bible again in a whole new way, with the originally compound confusing Biblical texts deconstructed and made clear by reading each narrative voice separately. Not only does Friedman's text tell you how to decode the Bible, but it also explains the historical context for each narrative voice - the motivations for their approach - and ideas about how, why, and by whom, the different voices were so artfully assembled into the Bible we know today.Whether you end up buying Friedman's hypotheses or not - this book will stimulate you and transform your understanding of the world of the Old Testament and the nature of the Bible itself. This is on my short list of books I'd consider \"mandatory reading\" for any educated person. The import of the Bible is so pervasive (not only to followers of Judaism, Christianity and Islam) - but also - culturally to places that are affected by followers of those faiths (i.e. the entire planet, except for certain interior areas of Asia). This book shines a big old searchlight down into the murky depths of the Torah.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            }
        ]
    },
    {
        "Title": "holy writ as oral lit the bible as folklore",
        "description": "This book helps us resolve some of the mysteries and contradictions that evolved during the Bible's pre-written legacy and that persist in the Great Book today. Most biblical scholars acknowledge that both the Old and New Testaments were orally transmitted for decades before appearing in written form. With great reverence for the Bible, Dundes offers a new and exciting way to understand its variant texts. He uses the analytical framework of folklore to unearth and contrast the multiple versions of nearly every major biblical event, including the creation of woman, the flood, the ten commandments (there were once as many as eleven or twelve), the names of the twelve tribes, the naming of the disciples, the Sermon on the Mount, the Lord's Prayer, and the words inscribed on the Cross, among many others.",
        "authors": "['Alan Dundes']",
        "infoLink": "https://play.google.com/store/books/details?id=JftPCdyMs5wC&source=gbs_api",
        "review": [
            {
                "review/text": "Alan Dundes, one of the U.C.Berkeley's foremost professors, has written a fantastic book again! He proves that the bible's source is oral literature (folklore), thus explaining the different versions of events throughout the bible. Dundes' book is the voice of reason in a sea of confusion surrounding biblical history.",
                "review/helpfulness": "28/35",
                "num_reviews": 35
            },
            {
                "review/text": "\"Dundes observed that variations in the oral tradition were preserved in the Bible precisely because of its sacred nature. To a folklorist, it is utter folly to attempt to reconcile such diversity.\" Patricia McBroomFolklore in Oral Transmission:My dad never described the Old Testament narratives as mythical, but he convincingly argued that since it was written after centuries of oral tradition was tinted with variants of ideas and theologies.Most biblical scholars acknowledge that the Old Testament was orally transmitted for decades before appearing in written form. Dundes offers a new and exciting way to understand its variant texts, using the analytical framework of folklore to unearth and contrast the multiple versions of nearly every major biblical event, including the creation of woman, the flood, the ten commandments, among many others.Interpreting the Bible as folklore:Using his expert knowledge of folklore, Dundes unearths and contrasts multiple versions of most major biblical event, to helps us resolve some of the mysteries and contradictions that evolved during the Bible's prewritten legacy and that persist in the Great Book today. With great reverence for the Bible, Dundes offers a new and exciting way to resolve some of the mysteries and contradictions that evolved during the Bible's prewritten legacy and that still persist today. \"People say this is an oral tradition, but then they proceed to search for one true variant,\" said Dundes, \"In oral literature, there is no such thing. This is not meant to be disrespectful, but people should stop worrying about the discrepancies among the stories. They don't matter. This doesn't mean the Bible isn't true, or that it isn't a sacred text,\" He hastened to explain.Multiple Versions of same stories?Professor Dundes reports examples of what he describes as 'multiple versions of various stories' that appear in the Bible. He believes that these stories were circulated for decades and even centuries as an oral tradition. During that time, each version of the stories subtlety changed as it was circulated before it was recorded in written form. From the discrepancies among the various version of the same story, he concluded not only that the Bible contains folklore, but that the Bible is folklore. Dundes writes: \"It simply means that the Bible is oral literature that has been written down, and the nature of oral literature is that there must be two or more versions of any story...the Bible clearly manifests the basic distinctive criteria of folklore: namely multiple existence and variation.\"Dr. Alan Dundes:Known as a world class authority on folklore, Alan Dundes, is a professor of folklore and anthropology, University of California, Berkeley. He has written over 30 books based on his studies of the oral traditions of many cultures. In more than 30 books he has unveiled the meanings in the oral traditions of many cultures.",
                "review/helpfulness": "29/33",
                "num_reviews": 33
            },
            {
                "review/text": "This was a fantastic read. The author step-by-step takes the reader through the basics of oral literature (folklore, folk tales), and gives numerous examples of oral literature in the Bible. Among many other examples, he shows how the two creation stories, the two flood stories, all demonstrate that the Bible, Holy Writ, is an example of a collection of Oral Lit, oral folk tales that the ancient people used to tell each other.It was a delightful and insightful reading experience for me, and I finished it in a couple hours.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Those who hold on to the belief of a God-inspired bibilical text won't have their minds changed -- but those who seek rational answers to all the brouhaha over the old fairy tales of the Bible will find real food for clear thought and understanding.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the harlot by the side of the road forbidden tales of the bible",
        "description": "Sex. Violence. Scandal. These are words we rarely associate with the sacred text of the Bible. Yet in this brilliant new book, Jonathan Kirsch shows that the Old Testament is filled with some of the most startling and explicit stories in all of Western literature. These tales of seduction and rape, voyeurism and exhibitionism, intermarriage and illegitimacy, assassination and murder have been suppressed by religious authorities throughout history precisely because they are so shocking. \"You mean that's in the Bible?\" is the common reaction of the contemporary reader to the stories that Kirsch retells and explores. In The Harlot by the Side of the Road, Kirsch recounts these suppressed and mistranslated tales in the grand storytelling tradition. Here is the tale of Dinah, the young Israelite daughter raped by a princely suitor. The price for her hand in marriage? The circumcision of every man in his kingdom. Here, too, is the story of Lot's daughters, who, when faced with the possibility that they are the last survivors on earth, must copulate with their drunken father to continue their race. And the story of Tamar, the harlot by the side of the road, who must disguise herself as a prostitute and seduce her father-in-law in order to bear the child who has been promised her. Kirsch places each story within the political and social context of its time, and delves into the latest biblical scholarship to explain why each story was originally censored. He also brings to light when and where each story was first written down, and how it found its way into the Bible. And he shows how these stories have something important to say to contemporary readers who might never pick up a Bible. Kirsch reveals that the Bible's real power lies in its unflinching lessons in human nature. And he illuminates the surprising modernity of the Bible's characters: these were, like us, people delicately balanced between their destructive and generous natures. Certain to excite controversy and ignite intellectual debate, The Harlot by the Side of the Road will undoubtedly be one of the year's most talked-about books.",
        "authors": "['Jonathan Kirsch']",
        "infoLink": "https://play.google.com/store/books/details?id=focAQMezvSYC&source=gbs_api",
        "review": [
            {
                "review/text": "In a society obsessed with religion, it is hard to imagine that, for most people, the Bible is virtually an unknown book. True, many American households have one gathering dust on the bookshelf, yet if the spine is cracked at all, it's generally for the purpose of finding out great-grandma's maiden name. The fact that the Bible is seldom read in its entirety in our day makes Jonathan Kirsch's new book, THE HARLOT BY THE SIDE OF THE ROAD (Ballantine Books, 1997; 378 pages), that much more of value, for in pointing out some of its &quot;forbidden tales,&quot; the author might just send his reader back to the source.In HARLOT, Kirsch has picked out seven tales from the Hebrew Scriptures which set center-stage humankind in all its sinful glory. The accounts include rape, murder, genocide, and wholesale slaughter, all drawn from Holy Writ, and include such famous names as Lot, Moses, and even King David. Readers used to getting their Bible stories from Sunday services or Grolier adaptations will no doubt be shocked by what the Word of God includes.Yet Kirsch is not writing with the now popular Bible-bashing attitude of, say, a Lloyd Graham (DECEPTIONS AND MYTHS OF THE BIBLE). While he does accept modern-day theories as to the authorship of the biblical canon, his purpose is not to poke fun; rather, he extracts from each of the tales he recounts something of value, whether it be historical or practical. This makes the book good reading for both believers and unbelievers seeking to get a handle on some of the cultural mysteries of biblical times.Kirsch's format is instrumental in doing this. For each of the seven tales, he recounts the narrative in novelistic style, and provides detailed examinations of the various factors involved. This is particularly effective in his chapter entitled &quot;Tamar and Judah,&quot; where he explains the concept of brother-in-law marriage, the status of women in patriarchal times, and the true &quot;sin&quot; of Onan (it's not masturbation). Extensive documentation from ancient and modern times is considered, though Kirsch never strays far from the biblical source.It's an approach that should please both scholars and casual readers alike.",
                "review/helpfulness": "71/73",
                "num_reviews": 73
            },
            {
                "review/text": "I'm an atheist who also happens to have a strong interest in religious history and theology. I find the Old Testament captivating because both God and humanity are depicted with a variety of traits, both positive and negative. The complexity of its characters makes for stories far richer and true to life than a simple morality play.With \"The Harlot By The Side Of The Road\" Kirsch has plucked some of the most provocative biblical tales to demonstrate this point.I was already familiar with the seduction of Lot by his daughters. But other Bible stories, such as that of Tamar and Judah, were new and interesting to me. Thus I found Kirsch's book to be a very useful guide to discovering these hidden scriptures.I must admit, however, that I usually preferred the succinct text of the Bible to Kirsch's imagination fuelled re-tellings. I highly recommend that readers carefully read the scripture itself before jumping into Kirsch's version. For example, Kirsch often attributes thoughts and feelings to the characters not clearly indicated by the biblical text. This is perhaps Kirsch's attempt at the Jewish tradition of Midrashic writing. But certain readers may end up being confused about what the Bible actually says.Another significant portion of the book includes examination and interpretation of the stories presented. Kirsch presents his own point of view while also discussing the research of other religious scholars. This section of the book is interesting enough. But actually my favorite parts were towards the end. The final chapter - \"God's Novel Has Suspense\" - is where Kirsch espouses his ideas about why the Old Testament still holds purpose and power for us today. The appendix provides a fascinating look into who wrote the various sections of the Herbew Bible and how these writings were collected and translated. He even makes a fairly strong case that the writer \"J\", who wrote much of Genesis was, in fact, a woman and thus many of the most important stories of the Bible are actually told from a female prespective. Good stuff!",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Lot's daughters drug and rape their own father. Jacob's sons sacrilegiously slaughter Hamor's recently-circumcised clan. YHWH's night attack on Moses is thwarted by a perplexing smearing of blood. A Levite abandons his concubine to gang rape and uses her death to foment genocide. All of these tales are in the Bible. Yet their content is peculiar, distasteful and difficult to reconcile with modern preferences for a God who is undemanding and unthreatening.\"The Harlot by the Side of the Road\" is no mere unmasking of the sensational parts of the bible. Author Jonathan Kirsch retells each tale in a modern novelistic style, interspersed with the biblical accounts themselves, allowing us to read the original and its retelling side by side. Kirsch then uses these tales as springboards to explore ancient social mores as well as the development of the Bible itself. Kirsch helps the reader to recognize and set aside the strong moral and xenophobic tone of post-Exilic editors, allowing a peek into the looser social practices that held sway prior to Israel's return from captivity.The book's subtitle, \"Forbidden Tales of the Bible\" is a bit of an overstatement. While it's hard to find a home for these tales in a typical liturgical setting, the tales are hardly forbidden. What ought to be forbidden (at least taken with a grain of salt) are the head-spinning interpretations of some serious biblical scholars. Kirsch skims the conclusions of a number of scholarly schools--including Freudian, rabbinical, radical feminist and traditional--before finally settling on something more reasonable. Tamar's seduction of father-in-law (and patriarch) Judah, for instance, is difficult only if you insist that biblical morality never changed. But learning that the anti-prostitution Mosaic moral code postdated Judah's time by hundreds of years helps us to see Judah's behavior as less of an aberration.\"The Harlot by the Side of the Road\" provides no illicit thrills. But it may scandalize those who reject the idea that the Bible went through hundreds of years of telling and editing. Truth be told, Kirsch is on sound scholarly ground. The ideas in this book are old news in any middle-of-the-road biblical history course, including those taught in seminaries.For those who want a window into the violent and alien world of ancient Israel, and who are open to the idea that the Bible is a book with human fingerprints all over it, this book is strongly recommended.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a book I thoroughly enjoyed. I bought it because it seemed a little more \"entertaining\" than most books that take a hard look at the Bible, but I was caught off guard by the degree of insight contained within. Not only does Kirsch artfully present six of the \"forbidden\" stories in such a way that they come alive, but he also offers a good deal of background to help you understand the cultural significance of the stories, as well as some insight into what they say about the whole Bible.The stories are not going to be unfamiliar to anyone who has really read the Old Testament. It's not like these stories are hidden and can only be found \"between the lines.\" They are just stories that seem so preposterous, so dissonent with the message you hear in Sunday School or from the pulpit that rather than look at them, we ignore them. Kirsch makes the argument that not only is that denial not necessary, it's even harmful to our understanding! These stories underscore the humanity of the characters and the writers of the Bible, making it far more rich and interesting than the few sterile verses that constitute the average person's understanding of the bible.The stories he relates in literary form include the tale of Lot's daughters, the rape of Jacob's daughter Dinah, the story of Judah and his daughter-in-law Tamar, how Moses' wife Zipporah saved him from being killed by God, the gang-rape and murder of a Levite's concubine, and the rape of David's daughter Tamar. Coupled with these principal stories is a smattering of other tidbits, including the story of Jacob wrestling with God (and defeating Him!) and the lusty excesses of King David and his sons. You won't believe what you read, and you won't want to put it down!While I highly recommend this book, I only rate it four stars because there seems to be *some* unwillingness to admit the degree to which the stories he relates are radically sexist, and their interpretations as well as their implications stem from a horribily sexist, misguided culture, one which may contribute to the perpetuation of such nonsense to this day. Kirsch is a little too forgiving for my blood, and thus only 4 stars. Otherwise, I have no complaints and will recommend this book frequently.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Harlot by The Side of the Road was not only an interesting read that kept my attention throughout, it was a refreshing viewpoint which challeneged religious boundaries and censorship. The book focused on stories from the bible, well researched and explicated, which are not usually included in biblical texts. Kirsch has taken taboo subjects and explored them as part of human nature. I found that Kirsch retained a great sense of respect for ancient texts while trying to keep such sensitive subjects open to speculation and exploration. This was a great book and I highly recommend it.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a fun way to get into biblical scholarship. The author starts with Biblical stories that can be hard for us to understand because they seem very immoral and strange (Why did Lot offer his daughters to the men outside his door? Why did Tamar want to seduce her father-in-law? What was the night attack on Moses?). He then provides some history and understanding of the era and what may be behind the writing. I came away from this book thinking of how much richer the Bible is than I had ever imagined! For example, two stories may have been combined by an editor. Or the author may have had a personal axe to grind(attacking the Benjaminites in another story). Or the translator may have mistranslated some of the words. It helped me to see what a fascinating subject this is---combining history, language, customs and a lot of detective work!",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "First, let me say that I am an atheist who has never really sat down to read the bible at any great length, and yet I was familiar with several of the &quot;forbidden tales&quot;. I found the book to be an entertaining and somewhat thought provoking read. Reading Kirsch's book has actually made me want to explore further the field of biblical analysis and scholarship. So, I suppose that you could say in that respect, the book is good. What, after all, should a book do if not make you want to know more about its subject matter.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Harlot By The Side of the Road is billed (on the cover of the book, no less) as &quot;Forbidden Tales of the Bible&quot;, a theme that is further developed on the fly leaves. It is that, but so much more.Concentrating on those tales (that do involve sex, incest, rape) that many would rather forget are in the Bible, Kirsch analyzes them on two levels: He retells each of seven tales in narrative style, then follows with a detailed (scholarly even!) analysis of how that tale came to be and why it has meaning for us all, despite its' apparent purient nature. Two examples suffice to illustrate:1. Lot's drunken incestuous relationship with his daughters is that, but it is no worse than the necessarily incestuous relationship inherent in the Creation Myth (who did the children of Adam and Eve marry?). Kirsch reminds us that the devastation of Sodom and Gomorrah was so extensive that Lot's daughters truly believed that they were the only people left on earth,... and from this incestuous event arose the lineages of Moab, from whom came a woman (Ruth) whose lineage then went on to David and Jesus. Thus Kirsch concludes that &quot;... the mountain cave .... turns out tobe the womb of history, in both Jewish and Christian traditions&quot;2. The Rape of Dinah is indeed a tale of mindless genocide over an incident that may or may not have a historical basis, but it is also a mirror on humanity which has used two methods to solve problems -- armed conflict vs negotiated settlements. Sometimes one, sometimes the other. Both are evident in this story. Kirsch notes that the &quot;pious ghoswriters who fashioned myth and legend... into the book we know as the Bible&quot; wove commentaries on both methods into this tale.Highly recommended for thoughtful readers.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I expected this book to fuel my sketicism about Christianity and all the Book religions. To my pleasant surprise not only did I get an interesting and meaningful history lesson but I was also rewarded with a deeper understanding of the Book and its teachings. The Book's stories come to life and its lessons became more meaningful.Thank you Mr. Kirsch for your courage in expressing this wealth of knowledge on such an emotional subjet.A spiritual person has nothing to be afraid of by picking up and reading this book. The Harlot will not corrupt but enlighten.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "A true Bible scholar embraces the dark side as well as the good, and Kirsch dishes up the murkier details of the evil deeds people have done to one another throughout the ages. While fundamentalists often object to hearing anything less than squeaky clean coming from the Good Book, the Bible stories themselves are cautionary tales. The Bible is like an instruction manual for life, and all good manuals contain sections on troubleshooting. The Harlot By the Side of the Road has a few flaws, such as the author tends to hammer the same ideas over and over, but it is still an interesting read. I was particularly interested in the differences between the King James version and the New American Bible, and how we have lost the poetry in the new translations. It's as if we are &quot;dumbing down&quot; the Bible to make it more accesible, and at the same time glossing over some of the juicier tales. I feel that Kirsch's book should be placed on the shelf along side other Bible study books such as the History of God, and of course, the Holy Bible.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the second coming of babylon what bible prophecy says about",
        "description": "The Bible says that Babylon will be rebuilt and become the economic center of the world. Even now the ruins of the ancient city - just sixty miles south of Baghdad, Iraq - are quietly stirring. What does it mean for America? For Israel? For every person alive today? Are we living in the last days of earth as we know it? Find out, from Bible prophecy expert Mark Hitchcock. . . 1. How the focus of the world will shift back to Babylon 2. How Antichrist will make Babylon his capital 3. How the kingdoms of earth will fade as Babylon rises 4. How the false powers of Antichrist will grow 5. How prophecy will be fulfilled - and Babylon finally destroyed!",
        "authors": "['Mark Hitchcock']",
        "infoLink": "https://play.google.com/store/books/details?id=gZjV1kbrBEQC&source=gbs_api",
        "review": [
            {
                "review/text": "Mark tackles a serious but often overlooked imp. Bible topic very well here. Through solid scripture and outline Mark will show you the possibility of an E.U./Mid-east World headquater.",
                "review/helpfulness": "16/22",
                "num_reviews": 22
            },
            {
                "review/text": "o.k. I was not raised in Church but i have been a Christian for 5 years, reading the Bible but not really getting it. I bought this book and read it and understanding it all, i took my Bible and look ed up every verse it used to see if it was being used in context and it was.i use it for reference, and im in my 3 rd reading, and i just got 4 more of his books.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "Mark Hitchcock is an excellent writer for our day. He's concise and to the point. His books are always fast reading too. I'm not so sure if ancient Babylon in Iraq will be rebuilt or if the Bible is referring to another place called Babylon. Mark Hitchcock claims it will be literal Babylon but at least he backs up what he claims. This book is well worth the read but it's best to draw your own conclusions.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "It is truly unbelievable that someone who is supposed to be a Bible prophecy expert is teaching that Babylon will be rebuilt to become a global economic power. Mystery Babylon the Great is not literal Babylon, which is why it is called a mystery. NOT LITERAL. Wake up people! You are blind and following blind guides.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a good overview of a biblical/prophetic subject on end-time Babylon. A good resource to have, but not to be described as detailed. Easy to read and digest.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the oxford illustrated history of the bible oxford illustrated histories",
        "description": "A distinguished team of scholars assesses the importance of the Bible and retraces its history in words and images across two thousand years.",
        "authors": "['John William Rogerson']",
        "infoLink": "http://books.google.nl/books?id=AJGeQgAACAAJ&dq=The+Oxford+Illustrated+History+of+the+Bible+(Oxford+Illustrated+Histories)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Like The Bible itself, this volume is a library of `books'. It includes works of varying styles and topics, written by various authors, and collected under a single cover. This collection of 16 essays, by an assortment of writers, (in my opinion) makes for a patchwork approach. The articles vary wildly in quality and approach.The photographs, color plates, woodcuts, and engravings are absolutely spectacular, and complement the adjacent text. It's a pity they are not numbered, but they ARE indexed (by page number and T,B,L,C,R locations) in an addendum curiously titled `Acknowledgement of Sources'.The Oxford Illustrated History of the Bible is divided into four sections: (1) The Historical Background of the Making of the Bible; (2) Text and Translation of the Making of the Bible; (3) The Study and Use of the Bible; and (4) Contemporary Interpretation. My ratings of each subsection are: 5-star, 5-star, 4-star, and 1-star.Starting with the first two sections dealing with the Making of the Bible, don't miss the contributions of Philip Davies, `The Apocrypha,' David Parker's `The New Testament'; and Stanley E. Porter's `Modern Translations'. Be aware however that Porter is solely concerned with translation of the Bible into English... those expecting coverage of any other focus will be sadly disappointed. One `chapter' I had looked forward to reading was `The Bible in the Eastern Churches'. Bebawi's essay on this topic was a total disappointment. It was especially sad, since the next article (by Philip Alexander, see below) was so well done!Despite the fact that The Bible is 70 percent Old Testament and 30 percent New Testament, this book reflects a predictably disproportionate interest in Christianity. (Predictable because so many more people adhere to Christianity than to Judaism). Nonetheless, Philip Alexander's section, `The Bible in Judaism' is an excellent contribution. Geoffrey Khan's portion, `The Hebrew Bible' is also superb.I found the last section (Contemporary Interpretation) to be a waste of paper and ink. The four essays included are: Feminist Scholarship; Liberation Theology: Latin America; Liberation Theology: Africa and the Bible; and Liberation Theology: Europe. It boggled my mind to find (1) nothing about contemporary American fundamentalist interpretations of the Bible, (2) nothing about the technical problems of translation (like the problem of the shepherd/sheep analogy to island-dwelling fishermen who have never seen a sheep or any conception of why a shepherd would be involved with these creatures); (3) nothing about the relationship of the Hebrew Bible and the New Testament to religions and sects indebted to them but not based on them (such as The Church of Latter Day Saints and Islam just to mention two!); (4) nothing about the Pentecostal movement, especially important in Latin America; (5) nothing about Biblical interpretations by `sects' (ranging from the Branch Davidians to the Jehovah's Witnesses - I could go on and on... This work is obviously academic (in a very narrow cultural sense), and - despite the pretensions of Section four (Contemporary Interpretation) - parochial. I was tempted to use a razor blade, and cut this entire section out of an otherwise excellent book!Considering the amount of effort that went into this work, I wish that the editors had provided timelines. It is probably a better learning procedure to go through the text with an Excel spreadsheet or Word tables open, extracting data from the text into a chronologically coherent summary, but it is `a pain'. If a reader can do it, the editor could have done it.This is an excellent work, despite many lacunae. It filled an educational gap in my knowledge, and - given the partisan glosses that Bible study usually includes - should help others with a sincere desire to learn more about this library of religious readings.",
                "review/helpfulness": "68/73",
                "num_reviews": 73
            },
            {
                "review/text": "This book started out meeting my expectations of discussion concerning how the Bible as we know it today has evolved since its conception. There is adequate discussion of the various versions and how they were produced and the abundant trials along the way for many of the first translators trying to get the Bible into the common masses' hands.From there this book delves into textual criticism which is a logical course given that the Bible's various interpretations have much to do with the actions done in the name of God. This leads the authors to discuss how the Bible was/is used by its readership throughout history. I thought that there was not nearly enough discourse on the major threads of Christianity and Judaism, given the absolute importance of these denominations and Western civilization.Finally, and discouragingly, the book ends with liberation theology with a main focus on feminism and African-American advances and here is where this book reads like a political agenda or a subtle apology. I found these issues a poor choice for the last 50 pages of the book. Should they have been ignored, probably not, but overkill comes to mind.",
                "review/helpfulness": "15/22",
                "num_reviews": 22
            },
            {
                "review/text": "Let me begin by admitting that I was unable to read this book in full. From the onset, with John Rogerson's (the editor's) summary of the Old Testament, I found this work wholly lacking in thoroughness. It may be that I was expecting a different kind of work, especially when Oxford is the publisher. As other reviewers have noted, this book is pretty much the opposite of scholarly material. It should be surprising that I would feel that way, considering I am a lay student of biblical history.To better understand my dissatisfaction, I would like to present an excerpt from the aforementioned summary; I apologize in advance for the resulting length of this review:\"In the second half of the thirteenth century BCE there was a migration of peoples from northern Transjordan to the central hill country of Palestine, the area of the later northern kingdom, Israel. The reasons for the migration are unknown; they may have had political or environmental causes, or both. This could well have included the entity, or part of it, that is mentioned as Israel in the Merneptah stele of 1219 or 1207. This group may have then been joined by a group of shasu who brought with them faith in a God Yahweh who had helped them to escape from Egyptian overlordship. Faith in Yahweh as the God of Israel then became one of the distinguishing features of Israel as it struggled for survival with the Canaanites and then with the Philistines in Palestine itself, as well as with neighbouring peoples in Transjordan.\"This paragraph is presented by its author as fact, with no supporting references whatsoever. I have no idea how the author knows these things, even if they are true. This type of talking down occurs throughout the entire article. I am admittedly a Christian reader; but I am also incurably skeptical and a critical thinker. I have a hard time accepting anything as fact unless it is readily verifiable, if not by me, then by the author's peers. Here, nothing is given to verify. No sources for the conclusions, and no references for the derivation. I've written a similar complaint/review about Cambridge's \"Companion to the Bible.\"Again, it may be that my expectations were wrong for this book, but I do not like being spoon-fed information. I expect superior scholarship from works with Oxford's name on them. That may well be my mistake. In my opinion, scholars who are truly confident in their assertions should be willing to present alternative arguments, as well as their own. If their opinions are strong enough to withstand criticism, only then do I consider them palatable.If you would like to read a treatment of the Old Testament by a true scholar, then I would recommend reading \"On the Reliability of the Old Testament,\" by K.A. Kitchen. While his work may be too exhaustive for some, it can never be mistaken as being \"written for children,\" as another reviewer put it.Lastly, this book is not, as I had hoped, a history of the development of the Biblical text. I believe its title is misleading in that respect. It appears to be more of a history of the development of Judaism and Christianity into their current theological forms. That is fine, if that is what was intended. I just wish they had named it appropriately so I could have avoided it altogether.Oh, did I mention that Origen's name is spelled \"Origin\" on page 173? Come on, Oxford!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I purchased this book looking for a guide to the actual history of hos the Bible came to be. This book delivered, sort of. It covered what I was looking for, but not in the depth that I really wanted. The collection of writers seem to know their subject matter, but the editing of putting together is somewhat lacking. It seems to be an overview of everything it sets out to define. There is no cross referencing or anything else that would make this a single-volume research book. At times the book is down right boring. Very nlittle is offered to captivate the reader's attention.Yet the book is not without its merits. It gives the casual reader enough information to promote further study. It has very colorful artwork, though perhaps not enough (too many black and white copies of paintings). This book takes a dedicated reader to plow through it, but it may very well be rewarding for the right person.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought this because of the Oxford imprint. I have many Oxford histories and companions and they are all excellent: full of useful information, well-written, cross-indexed, etc.This book is written for children; the prose is on the level of the World Book Encyclopedia. It is an overview, a primer on the subject. The pictures are good, but I expected a more advanced book because of the \"Oxford\" in the title.If you have an young adolescent around the house who has an interest in the Bible or in religion of any sort, this would be a good purchase; a confirmation gift, for example. If you are an adult with any knowledge of the Bible and looking to increase your understanding of its history and influence, go elsewhere.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Similar books on the smae subject are written in a much more lively style. I've tried several times to read this book and just can't go on. So i've only read about one fourth of the book. The train of thought is hard to follow because the author goes of on some tangent, or clouds the main idea with insignificant and/or irrelevent details. It takes more concentration than I can muster to return to the main point of that section, if a main point can even be sorted out.The book seems to focus more on how the Bible has been used through the centuries, and not so much about authorship and dating of the individual books. The book is not really about the Bible itself, but about the people and societies/organizations that have used it or been impacted by it throughout history. I belongs in the category of western/European history and not in the category of Biblical Studies. It might also abe categorized as History of Literature, or something like that.My disclaimer: for the aforementioned reasons I've based this review on a quick parousal of the entire book and a more thourough reading of the first quarter of the text. I hope this helps.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "whose bible is it a short history of the scriptures",
        "description": "Jaroslav Pelikan, widely regarded as one of the most distinguished historians of our day, now provides a clear and engaging account of the Bible's journey from oral narrative to Hebrew and Greek text to today's countless editions. Pelikan explores the evolution of the Jewish, Protestant, and Catholic versions and the development of the printing press and its effect on the Reformation, the translation into modern languages, and varying schools of critical scholarship. Whose Bible Is It? is a triumph of scholarship that is also a pleasure to read.",
        "authors": "['Jaroslav Pelikan']",
        "infoLink": "http://books.google.com/books?id=ms_UHjwUEsoC&dq=Whose+Bible+Is+It%3F:+A+Short+History+of+the+Scriptures&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an introduction to the History of the Bible, but even readers who are already familiar with the outline of the subject will, I think, discover many details that are new to them in this very well told story.The first half of the book deals with the establishment of the Jewish and Christian Canons. The summary of what is in the books of the Old and the New Testament is perhaps a little pedestrian, but I found the discussion of the Septuagint and its importance interesting.In the second half of the book, Pelikan discusses how the Bible was used, revised and interpreted from the Middle Ages to the present time. It includes, for instance, a discussion how Christians squared the making of sacred images in illuminated manuscripts or icons with the prohibition against such a practice in the Old Testament; a section on the Qur'an's relationship to the two parts of the Bible; one on new translations of the Bible during the Renaissance following the revival of Hebrew, Greek and classical Latin; and one on the hugely important role the Bible played during the Reformation. He discusses `lower criticism' - the clearing up of linguistic problems presented by the texts - and `higher criticism' - the work done from the 17th century onwards which examined the Bible as one might examine a text attributed to, say, Homer: as a patchwork put together by human beings of human writings produced at different times, rather than, as in the case of the Five Books of Moses, being the text by one author working under divine inspiration. Other challenges to the literary truth of the Bible were to come from historical, archaeological, anthropological, and finally of course scientific disciplines, starting with a critique of the Pentateuch but eventually reaching the figure of Jesus himself. Pelikan suggests interestingly that the Roman Catholic understanding of the Bible was slightly less vulnerable to these developments, since the medieval Catholic Church had long taught that the Bible could be understood on four different levels: the literal, the allegorical, the moral and the eschatological, whereas the Protestant beliefs had based themselves firmly on the literal meaning of the Bible. Even so, it was Protestant scholars who were most active in Higher Criticism.None of this, Pelikan points out, affected the increased circulation of the Bible. In English the Authorized Version has been followed in recent times by a flood of revised versions in more modern English. In 1986 the American Bible Society distributed nearly 290 million bibles. There has been an explosion of bibles in Africa (Pelikan gives a charming extract from a Masai creed in which `Jesus was always on safari doing good').The last chapter and the Epilogue are Pelikan's own eloquent meditations on the eternal value of the Bible to him, to our culture, but first and foremost to the Jewish and Christian communities, `neither of whom would be anything without it'.I regret the absence of an index, and having the source notes at the end of the book rather than at the bottom of the relevant page is a minor inconvenience; but it does not detract from the value of this scholarly, sensitive and thoughtful book, a fitting memorial to a distinguished author who sadly died in May this year.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "INTRODUCTION:It is unfortunate that most Christians in the US are clueless of how the Bible (Old Testament + New Testament) came to be compiled or made into the canon that we have today. Pelikan's short history (that spans 256 pages) of Bible's origins, translations, transmission, re-discovery, preservation, and publication is one of the most readable and accurate book in this topic of the history of the Bible.Unlike the subtitle, the title question spurs the reader to search for the answer. In its introduction, it seems the answer is ... it belongs \"to all the people that believe\" (the Jews and Christians) ... but the real answer is revealed in no uncertain terms at the very end, in the Afterwards chapter.AUTHOR:Recently deceased Dr. Pelikan, former Yale professor, Lutheran believer progressing towards and adopting Orthodoxy, is one of the best historical theologian America has ever had. For a man who jokingly said recently that he would be \"dying without an unpublished thought\" and with over 30 scholarly books written, he is best known for his magnum opus 5 volumes \"The Christian Tradition - a History of the Development of Doctrine\", \"Jesus Through the Centuries\", \"Mary Through the Centuries\", and \"Creedo.\"CONTENT:As someone who loves history and for whom the Bible is not a strange topic, there was lots of things to underline and notes to write in \"Whose Bible Is It?\" Too much to even list here. What I will say is that the mystery behind such terms as Septuagint or TaNaKh have been demystified. Also, as a result of this read I know better how to discuss with Muslims about the Jewish and Christian Bible. The most insightful chapter, I have to say, has been \"The Strange New World within the Bible\" (the one beforethe Afterwords chapter.CONCLUSION:* Have you ever read a book and said, wow!?!* Do you wish you had an appetite for reading or studying the Bible?* Do you wonder how this complex book called the Bible (Jewish and Christian ones) came into being and how it was read throughout the centuries?\"Whose Bible is it?\" provides more than answers to these questions. This book provides a delectable account of the history of the book Jews and Christians revere so much and call the \"revealed word of God\" - a great short history geared for everybody: Jew, Christian, and Muslim; for believer and non-believer; for the curious, the timid, and also the devout ones; for the liberal, the fundamentalist, and the moderate ones; for the novice and scholars; for the young and old.Enjoy your re-discovery of the historical and literary beauty of the Bible !",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "Following the example of Aristotle, who in his Poetics summarizes the Odyssey in three sentences (`This is essential; the rest is episode'), one might offer a brief summary of the Bible thus: \"God creates the earth and makes a covenant with his people. They enter the promised land and build the temple, then survive its destruction and their dispersal. God sends his Son, who dies on the cross and is resurrected. Various letters follow.\"But of course, this would not do justice to the greatest book written by mankind under divine inspiration. Jaroslav Pelikan's Whose Bible Is It? pays its proper due to the Holy Book and to the scholarship that it has inspired, not by providing a summary of its content (although some paragraphs come close to paraphrasing the plot line) but by presenting a brief and personal survey of how the Bible was compiled, translated and interpreted throughout the ages.It is, if you wish, the Bible's making-of, the behind-the-scenes documentary that will make the reader eager to watch and rewatch the film all over again. It is replete with snippets and excerpts from the Old and from the New Testaments that make you grab your volume of the Scriptures to check the original context, with teasers sampling the most famous scenes from the church's history that you may or may not remember from school days, and with a cast of characters that makes church fathers and reformationists look like intellectual heroes. The soundtrack should be set to one of the classical masterpieces that the Bible has inspired: Bach's Saint Matthew Passion or Haendel's Messiah are the director's top recommendations. Bonus features include an introduction to the Jewish tradition that may be unfamiliar to some readers, but which illustrates the close ties between the \"peoples of the book\"--an expression which, interestingly, comes from the Qur'an, a reminder of the lacking third party when one speaks about the Judeo-Christian civilization.There were many notions or words that I was not familiar with, and I made notes to check their definition and remember their meaning. The Tanakh, the expression that the author uses to designate the Old Testament, is an acronym for the three parts of the Hebrew Bible: the Torah (\"Teaching\", also known as the Pentateuch), Nevi'im (\"Prophets\"), and Ketuvim (\"Writings,\" or Hagiographa). The Septuagint (the earliest Greek translation of the Hebrew Bible, from Alexandria in Egypt under the Ptolemies) was generally abandoned in favour of the Masoretic text as the basis for translations of the Old Testament into Western languages from St. Jerome's Bible (the Vulgate) to the present day. In Eastern Christianity, translations based on the Septuagint still prevail. A number of books which are part of the Greek Septuagint but are not found in the Hebrew Bible are often referred to as deuterocanonical books by Roman Catholics referring to a later secondary (i.e. deutero) canon. Most Protestants term these books as apocrypha. Evangelicals do not accept the deuterocanonical books as canonical, although Protestant Bibles included them in Apocrypha sections until around the 1820s. However, the Roman Catholic, Eastern Orthodox, and Oriental Orthodox churches include these books as part of their Old Testament.But these reading notes do little justice to Jaroslav Pelikan's beautiful prose and gentle humor, and they make little more sense than attempts to summarize the Bible. There are entire paragraphs or even chapters that I would like to quote extensively to convey the impression they make on the reader. Here are three excerpts that I find typical of the author's sense of humor:\"[Serbs and Croats] speak basically the same language--which means they can understand each other very well when they call each other some of those obscene and quite untranslatable names, and they are kept apart by a common language. Sometimes it almost seems as though the peoples of the Balkans might get along better if only they could not understand each other's language so well.\"\"An appalling ignorance of the Bible seems to have become epidemic in our time, as is evident from the nervous laughter when on a stage or at a dinner party someone mentions the subject of angels or prayer or the immortality of the soul. Nevertheless, one of its positive features (although it is hard to think of what the other positive features may be) is the thrill of discovery that comes to otherwise fairly educated people when they confront it for the first time.\"\"To invoke a Kierkegaardesque figure of speech, the beauty of the language of the Bible can be like a set of dentist's instruments neatly laid out on a table and hanging on a wall, intriguing in their technological complexity and with their stainless steel highly polished--until they set to work on the job for which they were originally designed. Then all of a sudden my reaction changes from 'How shiny and beautiful they all are!' to 'Get that damned thing out of my mouth!'\"",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I decided to read this volume after a friend mentioned an interesting history of the creation of the King James version of the bible and I thought it behoved me to make sure I had a good picture of the several thousand years of biblical history that preceded the KJV. I really didn't expect it to be particularly interesting or insightful. Much to my surprise Pelikan managed to be both of those things, and a number of others, without displaying any particular axe to grind.The bible is hardly the staid, stodgy collection of pages that many of us think it is. Whether you think of it as a collection of tales and philosophy, or direct revelation, any number of peoples have adopted it, and changed either its wording or its interpretation. Often with unexpected results. Pelikan captures much of this as the bible shifts from the Torah, to the Tanach, and then the Septaguint, etc., etc., etc. This isn't dry history but a tale of human development and many of the great intellectual movements of Western culture.Pelikan is most interested in how to religions can use the same book and draw contradictory meanings from it. In Judaism, the bible is the public side of Jewish law and thought, as well is the (admittedly sometimes distorted) history of a people. It is important in itself. Christianity often views the Old Testament as the the source of evidence of Jesus' divine nature. As such the two can read the same text and see different things. In addition, They are reading in different languages with that whole set of complications. As Pelikan traces the history of the bible we begin to see a vast tapestry of the conflict between tradition and change. We begin to realise that this diversity is important and that what is needed is understanding, not conversion.There's no lack of scholarship here, but Pelikan is very good at avoiding excesses if detail which shedding light on the important facts. If you are looking for a book that discusses the bible without any layers of bias this is it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Since others have already published excellent reviews, let me simply add this.As one who has studied Scripture, the history of Christianity, textual criticism, and exegesis, this book's greatest assistance for me was in tying all of these topics together. Pelikan ties things together in such a way that the reader is able to see how worldview has impacted how one understands the Scriptures and how one understands the Scriptures has impacted world view.This book will especially be helpful for the average reader who has little understanding of how we got the Bible that we have today, but is also good for the advanced student because Pelikan weaves things together in such a wonderful way.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "\"For those who believe that you don't need tradition because you have the Bible, the Christian Tradition has sought to say, ... if you put me alone in a room with the New Testament, I will come up with the doctrine of the Trinity, is naive.\" Jerosav PelikanPelikan's Bible Story:From oral narrative to Hebrew and Greek texts, Pelikan traces the evolution of the Jewish and Christian editions of a multitude of Bible versions and the revolution of the Gutenberg invention and its effect on its printing and translation into modern languages, and its wide ranging impact on the various traditions of Biblical schools of criticism.He tell us, that in fact, Christians and Jews thought very differently about it. To put it in plain English, for the Jews, it is the sacred Law; for Christians, it is a Love allegory. Pelikan, does not lose sight of some of the larger issues raised by his title, but his question of who owns the Bible, has always been there. So, today, when an overwhelming majority of Americans believe in a strict literalism of the Bible, how controversial to inform them of the number of people who lost their lives because they favored a certain interpretation, based on a particular translation, then the matter becomes tragic. Pelikan even goes so far as to acknowledge that a deeper study of the Bible may cause some of its students to lose their blind faith in it as a Textus Receptus. Pelikan informing and thoughtful book debates that the question of who owns the Bible is, basically, contemptuous; but to consider it in those terms, then the best way is for Jews and Christians to realize that it is the keystone of their faith. Here is how J. Pelikan exposes his reconciliatory scholarship, in a true ecumenical way.The Bible As It Was (Belknap)The Jewish Bible and the Christian Bible: An Introduction to the History of the Bible",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is not the type of book one would expect from a scholar such as Dr. Pelikan. As an avid fan of Dr. Pelikan, I my expectations were set too high, perhaps. Conclusions concerning many questions are avoided and what we are left with is a sentimental feeling about the Bible. That is all well and good if that is your intent for reading. There is little to offend (or challenge) Jew, Protestant, Catholic, Orthodox, or even Islam in this book. That could be a strength or a weakness depending on your expectations. As a history, such an approach forces the author to leave a great deal of detail out. As a popular historical work, there is nothing wrong with that approach and indeed it may be a wonderful introductory text on the topic.The discussion of problems in translation and the formation of the Septuagint are particularly interesting. Though we would like more detail, it is sufficient to make one hungry to seek out more in other works as a good introduction should do. However, Dr. Pelikan's writing style, mentioned by some other reviewers already, is often complex and could prove difficult for an introductory text.There are mixed feelings with this work. Perhaps it is good as a popular introductory text on the formation of the Bible and questions of the canon. Ecumenical factors seem to be the guiding principle rather than following the evidence where it might lead. The moment a path of exploration presents itself, Dr. Pelikan quickly changed direction to avoid polemic. The result is a book with a lot of content but without much point other than feeling good and self assured no matter your religious background. But, as a popular historical study, perhaps that is as good as it gets.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "holy bible nirv kids study bible",
        "description": "The NIrV Study Bible for Kids is designed specifically for early readers to help make Bible reading and study something children love, learn from, and keep as a lifelong habit. This Bible includes the complete New International Reader's Version (NIrV), which is based on the bestselling New International",
        "authors": "['Zonderkidz']",
        "infoLink": "http://books.google.com/books?id=E08IogEACAAJ&dq=Holy+Bible:+Nirv+Kids%27+Study+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My husband, a United Methodist pastor, and I were looking for a good bible for children. The church had been awarding the third graders with bibles that were way beyond their comprehension and we guessed that the bibles were never getting looked at. We came across the NIrV and agree that it is the best. It IS a bible, with chapter and verse--not a storybook. It also reads across instead of in columns. The text is easier to follow and the pictures are wonderful. Since I teach a Sunday School class, I use this as my own bible. When I take this Bible with me to Adult Bible Studies, I always come away with adults asking me where they can purchase one. Not only has this bible become the ONLY bible that is passed out to the children, but it is also the bible that many of our adults are using. A bible is only good if it is being read and the NIrV is definately being read! It is worth every penny!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This Bible is excellent for beginning readers. My 8 year old son loves to spend time in the Word now that he understands what he's reading. The memory verse helps and book introductions are great tools and he loves the part about growing up in Jesus' time. I am buying more for Christmas gifts!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "OK. I kept thinking to myself when I was little, \"why are there so many Bibles?\" Well, I got this, and I consumed it all in a week. I now know all of the stories from Jesus healing the leapers to Baalam's donkey talking. My favorite part, though, is the reviews to keep it in your head. There is \"Look at THIS\", which teaches you more about the selection, \"Remember THIS\", and the questions (making it a great classroom Bible) \"Think about THIS\". I reccommend this to any Catholic child. Fun and educational (takes occasional pictures with it.)",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "holy bible baptist study edition celebrate your heritage",
        "description": "Super Saver Ed. W.A. Criswell and Paige Patterson, editors Accurate, detailed scholarship in the Baptist tradition Formerly titled Believer's Study Bible Essays by prominent Baptist leaders and preachers examine contemporary issues, principles about the Christian life, and important doctrinal standards Extensive, clearly written annotations Key points of each passage Meanings of important words Background information about the history and culture of Bible times Cross-references Book introductions and outlines 121 in-text study charts More than 50 maps, 9 in color Theological glossary 195-page Concordance Presentation page Red letter 2,112 pp.",
        "authors": "['W. A. Criswell', 'Paige Patterson']",
        "infoLink": "http://books.google.com/books?id=DhkHAAAACAAJ&dq=Holy+Bible+-+Baptist+Study+Edition+Celebrate+Your+Heritage&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This Bible is the direct descendent of W. A. Criswell's original 1979 \"Criswell Study Bible\", revised by his chief proteg&eacute;, Dr. Paige Patterson, and a who's-who of Southern Baptist pastors and theologans. If you are interested in exploring the full depth of Southern Baptist theology, this is the Bible to have.Dr. Criswell was the long-time pastor of First Baptist Church of Dallas and one of the bulwarks against the influx of liberalism into the SBC, and one of its intellectual giants. Dr. Patterson, who is now the President of Southwestern Baptist Theological Seminary, was one of the principals of the conservative movement within the Convention. Together, they have produced a study Bible that represents the essence of classical Baptist theology, represented in the copious amount of study notes that appear throughout the text. I have read every page and was greatly enriched from the experience.Its content is much more in-depth than appears in the \"Life Application Bible\" and IMO is a little more in-depth that even the \"MacArthur Study Bible\". A thorough reading will be richly rewarded, but be prepared to spend a lot of time looking up cross-references (buying the thumb-indexed edition will help here!). In many places, particular words are explained with references to the original languages, or when symbolism is used, it is thoroughly explained.The main body of this Bible is the standard Nelson Reference Bible (taken pretty much verbatim, including the typeface). Commentary on various verses and passages appear at the bottom of each page. A introduction and outline precede each book, and there are charts and diagrams interspersed as well.The only strike against this Bible is it has typical (sub-par) Nelson construction. It is best used in your library than in your pew as it may not stand up to the rigors of use over time. This edition begs for the Nelson Signature Series treatment as that line of Bibles are superb.I highly recommend this Bible to any serious Bible student! It would be the perfect companion to the \"Reformation Study Bible\" as these represent the 2 remaining theologies that still hold true to the historicity, authority, and accuracy of the inspired Word of God.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I own it, and use it regularly. Very good quality and packed with great notes. Equal to the Macarthur study Bible. Sadly enough for me neither are published in the NAS translation which is my personal favorite.I own many study Bibles, but if this Bible or Macartur's is ever published in the NAS version I won't need to use another Bible again. (Thomas Nelson are you listening?) You can't go wrong with this Bible.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This study Bible is one of the best versions out there. It is very easy to follow and understand. It has outlines and footnotes that allow you to apply each verse to everyday life.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I am a Seminary student and have gone through many study bibles. However, this work by W.A. Criswell is by far the best in the business.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I love this Bible - I make sure this is the Bible our church gets for our graduation gifts for the seniors every year - it's also the Bible I bought my wife. The print is clear, and it's a durable Bible with lots of accurate notes.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "W.A. Criswell is by far one of the clearest teachers of the Bible. I use the commentary in this Study Bible as a resource to teach and preach. If you are looking for a clear study Bible, this is the one you should purchase. Criswell College is named after W.A. Criswell and home of the Pasche Institute of Jewish Studies. His teachings are clear and easy to understand.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "esv childrens bible english standard version",
        "description": "The ESV Children's Bible is designed to help children ages 5-10 see Bible stories come to life with 200 vibrant, full-color illustrations, a dictionary, Old and New Testament timelines, and child-friendly maps.",
        "authors": "['Crossway Bibles']",
        "infoLink": "http://books.google.com/books?id=eHzsoQEACAAJ&dq=ESV+Children%27s+Bible+(English+Standard+Version)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When my seven year old son decided that he wanted his own Bible, I knew it would be difficult to find the right one for him. He has been reading my bible for a while, and said he would like it if there were pictures. We looked around for a week or so and finally found this Bible. It is fabulous. It does have pictures and is definitely geared for kids, but it is a real Bible. All the books are there, and they are un-abridged. Even better, it comes in the ESV which is a solid conservative translation.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I have looked over many children's bibles in search of one I thought would be good for my kids. I'd almost given up but then I found the ESV Children's Bible! It more than surpasses my expectations for a children's bible. I bought one for my oldest and after looking it over, I ordered three more for my other kids who will receive them when they are old enough to read.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I purchased this Bible for my 4 year old son. I thought that it might be a little much for him at his age but he is receiving it very well. He begs me to \"read\" him his Bible, and so I will walk through the pictures and explain to him the scripture. Later, when he is by himself I catch him repeating to himself what I explained to him before. The pictures are his scripture at this time. This bible is well done! The layout is crisp and exciting. The text is in paragraph form but each verse number is marked in red (black in the gospels where the words of Christ are in red). This Bible carries the full ESV translation text with paragraph headers. The text type size is just right and in an easy to read type. There are a lot of pictures in between the text. Each picture contains two verses to explain the picture. Each book has a short introduction written about it, and the Bible contains some study helps in the back. Some of the helps are: \"Who Is God? What Is He Like?\" (gives attributes), \"God Makes Himself Known\" (explains how we can know God), \"The Ten Commandments\" (explains them and why they are important to us) \"From Old Testament To New Testament\" (shows how they flow together). There are many other helps that explain and talk about Salvation, Sanctification, Fighting the Fight of Faith, Scripture memorization, The Promises of God, Going into all the world, and much more. It also contains a short Dictionary of words used in the text and explains what they mean and where in the Bible they can be found. In the front there is several sections of explanation like, \"How to Use the Bible\". The only con is that the Bible doesn't have maps! Seems like that would be VERY helpful for children. The Bible is glued not sewn, but seems to be pretty durable. As A Pastor I am always looking for solid helpful things to recommend and I do highly recommend this Bible.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I absolutely love this Bible. We purchased two for our two boys. They are learning to have a \"quiet time\" and are memorizing scripture. We love the ESV translation as well. Only request -- make one in a soft cover!! (That fake leather stuff is great!)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Not only is it the ESV translation (a much more readable version than the KJV by far) It has some 245 photos throughout that illustrate the text for kids. It has nearly 30 pages of material that clearly and effectively explain to CHILDREN what is the Bible, how to read it and get the most out of it, and it under no uncertian terms explains God's plan of salvation!EVERY church serious about children's ministry should seriously consider switching to using the new ESV Children's Bible!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have been looking for a children's bible that isn't just a story book and this is it. It's the complete bible with a hard cover and some pictures. The type is a little bigger so it's easier for our son to read. There are also some great study material included. I would HIGHLY recommend this bible!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought 3 Children's Bibles in the English Standard Version by Crossway Bibles for my Grandchildren ages 6-9. I love them and so do the kids. They are real bibles with all the text. This is important to me as most children's bibles I've seen are either just a few bible stories or regular adult bibles with a childish looking cover. Also these bibles are beautifully illustrated. The kids and I get together a couple of times a week for bible study and they really are learning to use their bibles. My ONLY complaint is that I would have liked to have them in a leatherette cover instead of hard cover however this is a small point. I have one more grandaughter too young to read yet and I will be buying another one for her very soon.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This Bible is great--the illustrations, the translation, all the extras. The only thing lacking is a good concordance.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the new oxford annotated bible with the apocrypha new revised standard version",
        "description": "People who enjoy reading the time-honored Revised Standard Version will appreciate the background materials accompanying its text in this highly regarded edition.",
        "authors": "['Oxford']",
        "infoLink": "http://books.google.com/books?id=oiwMAAAACAAJ&dq=The+New+Oxford+Annotated+Bible+with+the+Apocrypha,+New+Revised+Standard+Version&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really like it. I think it's about the best study Bible there is. It doesn't go into specialty, really, but that's kind of the beauty of it. It isn't offensive to any denomination at all (unless you're a legalist, I guess). The notes are great, the articles are great, and it's just an all-around wonderful endeavor from Oxford, like its RSV predecessor. (Speaking of that, I think the reason Oxford did this new Bible is because of the NRSV translation that came out fairly recently. It's great, and definitely warranted an update of the Oxford Annotated. Glad to have both! :-)BTW--buy this.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I purchased this Bible for an intro New Testament class. This is an excellent scholarly bible. There are explanations about each book's orgins, compostion, orgins, and purpose. The marginal work cited notes shows not only scriptural links, but different verses that are found in other New Testament ancient copies. Overall an excellent bible for a scholar or in-depth scriptual reviews. The only minor defect is that this Bible may be overwhelming for beginning Biblical studies. My opinion is that the Quest, NIV bible is an excellent companion to the Oxford Annoated NRSV bible.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "The workmanship is wonderful. The scholarship tends to be in the classic liberal vein. But over all it's an impressive work for daily reading and devotions.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "The NRSV is my favorite translation, and the New Oxford Annotated Bible is one of the best study bibles on the market. It is a classic in its own way. This is durable leather edition, with gold edged-pages and two ribbon markers.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This study Bible incorporates modern gifts of biblical interpretation to include historical criticism and many literary techniques. It has an appendix that helps the lay person learn about the origins of the Bible and explains the different inspired forms of literature that are used. Each book is introduced with the latest in biblical scholarship. As you read, you can explore text-referenced annotations at the bottom of each page. These contain explanations as well as references to other texts. There is a good concordance and excellent series of maps.This is the Bible we introduce with our 6th through 8th grade students and that I recommend to any adult. They all learn to handle it, just fine. You will, too. May your reading lead you to a greater understanding and faith in our Lord and Savior.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "breakthrough reformation bible",
        "description": "In this powerful book, Walter Brueggemann moves the discussion of Old Testament theology beyond the dominant models of previous generations. Brueggemann focuses on the metaphor and imagery of the courtroom trial in order to regard the theological substance of the Old Testament as a series of claims asserted for Yahweh, the God of Israel. This provides a context that attends to pluralism in every dimension of the interpretive process and suggests links to the plurality of voices of our time.",
        "authors": "['Walter Brueggemann']",
        "infoLink": "http://books.google.com/books?id=eGVSy6OfFJ0C&dq=Breakthrough+Reformation+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the best choice for a study Bible on the market. It not only has Pastor Parsley's notes, but also lists historical info and points of interest. A must have!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a Bible produced by Rod Parsley's ministry and as such has highlighted verses that he has chosen as well as some notes authored by him. If you are a fan of the original KJV then this bible might appeal to you. This KJV uses a modern computerized typeface and layout that is attractive and easy on the eye for personal reading. The extra large Chapter numbers are helpful if you are rapidly trying to locate a scripture while listening to a sermon or in a bible study.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "new international encyclopedia of bible characters",
        "description": "The New International Encyclopedia of Bible Characters is a complete index of every person named in the Bible, from Aaron to Zurishadai. Discover the roles that men and women-from the obscure to the famous to the infamous-have played in the unfolding story of Scripture. Entries range from one-line biblical references for minor characters to full-length articles that address the theological significance of over forty major figures. With entries based on the New International Version?today's most read, most trusted Bible translation?this easy-to-use volume will help pastors, teachers, students, and church workers quickly and easily identify and understand the importance of every person in the Bible. The New International Encyclopedia of Bible Characters features contributions from top biblical scholars of the United States, the United Kingdom, and Australia. In addition to the alphabetic name-entries, twenty supporting articles shed light on topics of particular interest and relevance, such as: Kings of Judah and Israel Women in the Bible Children in the Bible The Apostles Pharisees The Elderly in the Bible Angels in the Bible Jewish Genealogies -ZONDERVAN'S UNDERSTAND THE BIBLE REFERENCE SERIES- This four-volume series supplies users of today's most popular modern Bible translation, and New International Version, with scholarly, economical, and uncompromisingly evangelical study tools. It includes: New International Bible Commentary New International Encyclopedia of Bible Words New International Encyclopedia of Bible Difficulties New International Encyclopedia of Bible Characters",
        "authors": "['Zondervan,']",
        "infoLink": "https://play.google.com/store/books/details?id=vxNRCgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Since I bought this book, I have not been able to put it down! This easy to use reference lists every person (including all those listed in Chronicles!) named in the Bible and gives a description of the character based on the Scriptures. All entries are cross-referenced to their location(s) in the verses.While nothing can replace the original Bible for discovering the men and women of God, this books pulls together all the information under each character into one crisp, flowing summary. There are over 40 major characters that receive extended articles from Abraham to the Woman at the Well. Under Paul's article, there are entries for specific events in his life, his missionary journeys, and the themes that run through his writings and teachings. Additional articles also give an overview of certain groups, such as the Judges, Kings, and Prophets.The only drawback to this book is the lack of a pronunciation guide (you'll have to look that up in the Bible Dictionary of the same series) but the meanings of names are given when known. This minor oversight is negligible for such a great reference work. Whenever I am studying the Bible or preparing a lesson, this book will always be in reach.This book is part of Zondervan's six-volume &quot;Understand the Bible&quot; Reference Series. The other titles are New International Bible Commentary, N.I.B. Dictionary, N.I.B. Concordance, New International Encyclopedia of Bible Words, and the N.I.E. of B. Difficulties. Be sure to check those out also.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I have often referred to Encyclopedia of Bible Characters when preparing Bible study lessons or for my own personal study.The book contains valuable information (Bible verse reference, contribution, significance, etc.) of each person mentioned in the Bible. Knowing more about a particular will enhance your Bible study as you realize that the people of the Bible were much like we are today, strengths and weaknesses!A highly recommended buy, the title will be a valuable aid for the reader in learning more about the many colorful characters in the Holy Bible!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I was very pleased to find that this book far exceeded my expectations for providing background information on the major characters in the bible. It really helps in the study of the Bible because it adds background information about major events and links them to the characters and their roles in the events.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "my first catholic bible for catholic children who want a devotional bible of their very own",
        "description": ", including stories from the Deuterocanonicals, in canonical order People You'll Meet: short biographical sketches of well-known Bible characters Interactive devotional prayer starters for each day Bible memory verses to help children remember important lessons each week A Word to Parents: guide for helping children use this Bible effectively Full-color art by Natalie Carabetta 432 pp.",
        "authors": "['Natalie Carabetta']",
        "infoLink": "http://books.google.com/books?id=MJkOAAAACAAJ&dq=My+First+Catholic+Bible+For+Catholic+Children+Who+Want+A+Devotional+Bible+Of+Their+Very+Own!&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this for my 9 yr old daughter. She enjoys using it because the weekly format makes it so simple. Each week has a Bible verse to memorize. Each day a fragment of the verse is given so as no to overwhelm. After each chapter/story there is a Prayer starter. It has received an Imprimatur from the Nat'l Conference of Bishops as well as Canadian Conference of Bishops. There is also a page containing the basic prayers (Our Father, Hail Mary and Glory Be) and mentions the use of the Rosary. This Bible is for anyone who finds a traditional Bible overwhelming. You have to start somewhere!",
                "review/helpfulness": "87/87",
                "num_reviews": 87
            },
            {
                "review/text": "My 7 and 9 year old really enjoy this Bible. The illustrations are wonderful and the text is simple enough for them to understand.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "Very well done. Uses actual bible excerpts from NRSV in a very effective way. Nice, colorful pictures. Very durable pages. High quality materials. Covers a lot of the bible material.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is very well done. The story selection is very good and there is a picture on every page. Most kids age 3 and up will remain engaged. The illustrations are very realistic, reverent and not \"stylized\" which is very important to me as a Catholic who is utterly sick of the cartoonish pictures of Our Lord, the Saints and other Biblical personages.There's also a Bible-verse memorization program on the bottom of each page. A little bit of each verse is introduced at a time for easier memorization.The only criticism I offer is for the binding. The book has basically fallen apart, and that's a shame. Of course, that could be due to my kids being extra rough on books, but I doubt it.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "These Bibles were purchased by our Altar Society as a gift for the first and second graders receiving First Reconciliation and First Communion this year. As a Religious Education teacher, I wanted a Bible the children could easily turn to to find the day's Gospel message, so we could discuss it before Mass. I found the Bibles to be easy to read (but not simplistic) and phrased is a way the childred could understand. I have since purchased another for a parishoner who wanted one for her granddaughter.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I was on a search for a bible that my boys could read. I looked for ones that I had when I was a child. The ones I had were very expensive and read more like a story. This one is so much better. Its so affordable and not indimitating by its size. It even has a glossary of all the names mentioned and who they are. Its beautiful to read and look at. I hope my boys hang on to these to pass down to thier children.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Excellent children's Bible. You read a page a night for 5 nights and in 1 year you have cover all the important Bible stories. Includes teaching aid for parents.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "classic reference bible updated nasb",
        "description": "Filled with the features that increase understanding with every use. - Complete text of the updated New American Standard Bible, today's most literal word-for-word translation. - Center-column references that unlock the depths of Scripture. - Maps and in-text charts for added insight while you read. - Introductions and outlines for every book of the Bible - Exclusive NASB Concordance for locating passages easily. - Easy-to-read typeface and verse-by-verse format with paragraph markers. - Presentation and Family Record pages for a lasting remembrance of significant events. - 8-page, full-color map section that accurately locates hundreds of important places in the Bible. - Red Letter text indicating the words of Christ. - Promises and Perspectives From the Bible.",
        "authors": "['Zondervan']",
        "infoLink": "http://books.google.nl/books?id=D3euGwAACAAJ&dq=Classic+Reference+Bible,+Updated+NASB&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've had this bible for about 6 months now, and it is a great bible for it's price. This bible is the updated New American Standard Bible. This bible is pretty easy to read (though not as easy as the NIV or NLT) but it is also considered to be the most literal English translation today.This is a nice personal sized bible, and it is perfect for a daily reader and a bible to take to bible studies and church. Every book has a summary at the beginning, and there are a couple of maps and other types of study aids that are scattered throughout the bible. Otherwise, it is a plain, center column reference bible and it is a red letter edition (which I personally like).But the one major problem I have had with this bible is the binding. The pages are simply glued into the spine, and because of that, after a few months, whole sections of my bible began to fall out. I had to use Elmer's glue to re-glue the sections back in, and thankfully, that seems to have done the trick for now.Still, the font size is nice, the center column references are nice, and the bible is a nice size and the price is fantastic. The only really complaint I have is the binding, and had the binding not been an issue, I would have given this bible 5 stars. But since losing whole sections from the binding isn't a small problem, I am forced to give this bible 3 stars.This bible is great for a daily reader, but if you're looking for a bible that is going to last a lifetime, or at least a really long time, I would suggest spending a little extra to make sure you get a bible that is bound better.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This is a great Bible in my opinion... The most literal translation, red letters, and a center column reference so you know where that OT quote is coming from. It's also a handy size - not as bulky as a study Bible yet large enough to stay open when you set it down, unlike those tiny ones. The concordance is 59 pages, but sometimes I still have to pull out another one to find what I'm looking for. But still my Bible of choice right now.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "niv gift award bible revised",
        "description": "Give a gift that lasts with the NIV Premium Gift Bible. This Bible includes the full text of the accurate, readable, and clear New International Version (NIV) along with beautiful, readable print and a durable Leathersoft(TM) cover.",
        "authors": "['Zondervan']",
        "infoLink": "http://books.google.com/books?id=DIJ1uAEACAAJ&dq=NIV+Gift&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This Bible is great for the price. The only thing that you should be aware of is that the Bible cover is purple. The general picture shows black, but the detailed \"front cover\" picture shows the purple color. I was surprised when I got the Bible since I thought it would be black. I was able to give it to a girl that was very happy though.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "The only problem we had with the purchase is the type being so much smaller than we expected; it is smaller than most standard gift Bibles we've recently purchased. Otherwise the product is what we expected.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I purchased a leather bound NIV Gift & Award Bible, but was quite disappointed when the Bible I recieved was of poor quality plastic, and had no \"study helps.\" Over all, I recieved a low quality Bible and was extremely disappointed!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "A good Bible for Church or Bible Studies. Words of Christ printed in red, small easy to carry and the print is not so small that most people can't read it. We use this as a pew Bible and several of our members requested one for their personal use. Priced right!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the complete idiots guide to biblical mysteries",
        "description": "Provides insight into biblical stories, miracles, and figures through historical context and scholarship, and explores the present controversies over lost texts, creationism, and archaeological findings.",
        "authors": "['Donald P. Ryan']",
        "infoLink": "http://books.google.com/books?id=qCiHzHR2pAYC&dq=The+Complete+Idiot%27s+Guide+to+Biblical+Mysteries&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Anyone with an interest in the Bible will probably enjoy this book. I certainly did! The book presents the Bible as a vitally important and influential library of texts loaded with mystery and controversy. Some of the topics I personally found of interest were the search for Noah's Ark and the Ark of the Covenant, the story of the Dead Sea Scrolls and other controversial documents, and the interesting expos&eacute; of the Bible code phenomenon. The author takes on the more touchy subjects without being condescending or judgmental and I thoroughly appreciated the range of views presented including scientific and religious perspectives. Ryan's background as an archaeologist is clear through much of the book as he regularly incorporates archaeological evidence in the chapters.Before I read this book, my Bible knowledge was sketchy at best and now afterwards, I can say that my knowledge and interest in the Bible, archaeology and ancient documents has increased dramatically. I very highly recommend this very well written and often provocative book!",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Dr. Donald P. Ryan does it again with this, his second book in &quot;The Complete Idiot's Guide&quot; series (see &quot;The Complete Idiot's Guide to Lost Civilizations&quot;). Laid out in the typical format for this series, Dr. Ryan examines the most well-known biblical mysteries in a manner that is neither judgmental nor opinionated, leaving the reader to form his or her own opinion about the facts presented. Personally, I've always been challenged with understanding the meaning of the various stories in the Bible and was quite pleased to find that Dr. Ryan presents his information in a thorough, clear and concise manner. Covering the Bible from Genesis through Revelation, from lost books to sacred artifacts, Dr. Ryan educates and informs the reader in an entertaining manner with the most fascinating tidbits of information. I most highly recommend this book for both the casually interested reader as well as one who is quite familiar with biblical history. Reading this latest book of Dr. Ryan's has left me with a desire to learn yet more about this, the most published book on Earth, the Bible.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Donald P. Ryan's primer on biblical mysteries provides a broad starting point for those wanting to further investigate the &quot;mysteries&quot; as well as those who just find themselves attracted by the Bible's fascinating stories. In keeping with the &quot;Complete Idiot's&quot; tradition, Ryan's book ensures that even the biggest idiot among us will have no problem tracing the history of the world's most influential book. It appeals to the archeologist in all of us and addresses some of the biggest questions still lingering after thousands of years, including Noah's Ark and the Great Flood, the Dead Sea Scrolls, the Shroud of Turin, the Ark of the Covenant, and of course, the Bible itself!The material unfolds in a general chronological order, beginning with the Bible's origins. Part I deals with the actual writing and structure of the book. The Old Testament or Torah's stories follow in Part II, which covers the Creation (and its controversy), Genesis, and Noah and the whereabouts of his famous ark. Part III relates the Jewish enslavement and the Exodus, and Part IV is a history of Jerusalem, including insight into the current Israel-Palestine conflict. Jesus is the subject of Part V. In Part VI, Ryan examines &quot;Lost Books and Sacred Artifacts,&quot; and the last section is devoted to the supernatural, i.e. angels, demons, and the Apocalypse.You can see that there is much to cover, and of all the Bible's mysteries, Ryan manages to hit most of the hot topics. As this guide is an introduction, you won't get the finer details, but Ryan does a fair job of presenting a variety of viewpoints and theories, from the common to the absurd. He tries to legitimize differing opinions insomuch that each is respected, and such unbiased approach is much appreciated. Overall, this is a handy starting point that is as fun to read as it is informative.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Keeping it brief, this is a great book with tons of interesting facts about mysteries that are in the Bible. Explanations of miracles, detailed history surrounding them. I learned an intense amount of information in this book. You don't have to be a scholar, as it was written simply. The authors did an excellent job.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the beginners bible",
        "description": "The best-selling Bible storybook of our time, with over 25 million products sold! Introduce children to the stories of the Bible through vibrant art and compelling text with The Beginner s Bible--- full of life and fun, and featuring brand new vibrant, three-dimensional art. The Beginner's Bible is the 2006 Retailers Choice Award winner in Children's Nonfiction.\"",
        "authors": "['Zondervan']",
        "infoLink": "http://books.google.com/books?id=m-m4jwEACAAJ&dq=The+Beginner%27s+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Karen Henley's \"The Beginner's Bible\" is a classic popular children's bible for pre-schooler's and primary grades. Beware that the publisher has come out with a new book by the same title, but with all new text by a different author and all new illustrations. The new book IS NOT the same as nor of the same quality as Karen Henley's original. This is a disappointment, that a publisher such as Zondervan would market an entirely new work by the name of a best selling title. Far too confusing for someone unaware of the differences in the two books. Amazon furthers the confusion by featuring the original Karen Henley version in their Look Inside feature for the new book. This is inaccurate information. This is not a new edition of the same work, but an entirely new book with nothing in common but a title.",
                "review/helpfulness": "331/338",
                "num_reviews": 338
            },
            {
                "review/text": "&quot;The Beginners Bible&quot; makes a wonderful first Christmas, Easter or religious gift to any child hearing God's Word for the first time.Seperated into short, easy-to-grasp chapters, it features gorgeous, colorful but simple illustrations of the Bible's most vivid, even humorous stories. (the talking donkey, Elijah's besting of Baal, Jesus and Zaccheus, etc.) It tells the book's most spectacular stories (the parting of the Red Sea, Jesus' walking on water) with simply expressed awe that should impress children hearing it the first time. God's love and power is always written into the final line of each story, things as reassuring to children as a parent's goodnight kiss. (&quot;God had saved his people again!&quot; &quot;Mary loved Him, Joseph loved Him, and God loved Him.&quot;)The New Testament portion emphasizes Jesus' parables and miracles, and tells Christianity's most moving stories (Judas' betrayal, the Revelation) with tact few religious writers would attempt. You'll find no better, more contextual explanation to a child of why Christ died than the &quot;Sadness&quot; chapter in this book.Overall, &quot;The Beginners' Bible&quot; is the best attempt yet to bring Jesus' love to His most youngest, most treasured ones, and is a book to read or be read to. HIGHLY recommended for families with young children.",
                "review/helpfulness": "67/70",
                "num_reviews": 70
            },
            {
                "review/text": "I highly highly recommend this book. I have been using it for close to 2 years now. I have no children of my own, but the children in the neighborhood all think they live here ! LOL -- how cute. They range in ages from 6 to 17. The older kids like to have the chance to interact with the younger ones. Reading these stories does just that. Its easy, so easy to understand. The beginning of each story sites the place in the Bible where the scripture can be found. This is excellent for people who want to make the transition with older children to their own Bibles. They can see where in the Bible their favorite stories are found. The kids in this neighborhood love it. They have me read it to them every time they are over. Its easy to understand, and is very colorful. I highly recommend this book. Its a must have !",
                "review/helpfulness": "62/66",
                "num_reviews": 66
            },
            {
                "review/text": "I bought this book after several attempts to get my children interested in the Bible. I always look for metaphysical interpretations for children, but am not sure they exist. And I have bought a handful of children's Bible literature so when I read a review for this book I thought, great! When the book arrived my heart fell. I told myself, &quot;another flop!&quot; and was ready to send it back. But my little boy (8) saw it and asked me to read it. And he just loves it!! He asks for more, always more... even though he has tons of other books on his shelves. And I am thrilled. The stories are very simply put and illustrated, exactly like a child needs. Sometimes I shudder at the interpretations (at times a bit too classical for me), but an adult can always explain the stories. This book has an amazing calming effect on kids, and it seems to fill a need they have. Amazing! I think it is a perfect first approach to the Bible.",
                "review/helpfulness": "28/33",
                "num_reviews": 33
            },
            {
                "review/text": "This has 'cute' illustrations that children love to look at and toddler-level wording that they can really understand. This has been the favorite children's book for my 2 year old for quite some time. Every bedtime it's 'I want Bible dory!!!' Worth every penny!",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "I have been reading this to my six year old for about two years now, one easy-to-read chapter each night. We've been through it now about 7 times and he still really enjoys the stories and pictures. I think Karyn and Dennas have done a great job in simplifying the Bible and making it kid-friendly. I like the simple interpretations,too!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is a great way to introduce your children to the Bible. The Chapter and verse is listed with each story so you can look up stories that you wish to share with your children. The subjects are presented in a short enough length so as not to lose the attention span of your child. They also make great bedtime stories because you can choose how much to read each night.I especially liked the way that this book handled diffucult topics like the crucifixion of Jesus. It does not shy away from these topics, but presents them in an understandable format.I give this book to friends for infant Baptisms or baby shower gifts.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I got this Bible when I was 2 years old. I loved looking at the pictures- and they are very bright and colorful. This Bible first gave me the idea that there was a book about God. When I was a little bit older, It told me that Bible stories were interesting, and not boring and glum like I thought it would be after I looked at my dad's Bible with a black cover. After all, you can't judge a book by it's cover! Now I am 10 years old, and although I have a full text NIV Bible, I still love to look at this bible. I actually have 2 copies of it, because when I was 4 I begged my Mom to get me another copy of this Bible. I am extremely fond of reading, and I still remember the day I read it all by myself, When I was 5. Wasn't I proud! It's very understandable and in clear, big, print. I still treasure it very much, and I absolutely recommend this Bible to you.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I have been using this book every other day since 1995 during the 20 minutes worship sessions with my group of preschoolers. They understand the stories, and remember them too! From time to time, I would show them the pictures and they are able to tell me the title of the stories.It's one of their favorites at reading time when they select books and &quot;read&quot; for themselves. Because I realize the impact of the stories, I usually give children who are leaving their very own copy. For some, it's their first introduction to Jesus.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Introducing young children to God is simple. All you have to do is to read them this, then, when they're old enough, they can read it by themselves, and alone they will learn God's precious Word. \"The Beginner's Bible\" is a summary of the Bible stories told especially for children and toddlers. With this book, they can learn all they can about the morals taught by the Bible.As you may have though, this book is a nice, little collection of classic Bible stories, accompanied by cute, little illustrations. With beautiful pictures and a text in told from a child's language, this Bible is one that your child will enjoy - forever!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the nkjv slimline bible",
        "description": "You don't have to choose. With the NKJV Thinline Large Print Bible, you can have the convenience and portability of a Thinline Bible and the comfort of large print.",
        "authors": "['Thomas Thomas Nelson']",
        "infoLink": "http://books.google.nl/books?id=zgDBAQAACAAJ&dq=The+Nkjv+Slimline+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Most of the reviews and descriptions given for this bible were accurate except for the dimensions. It is NOT THE SAME as the whats given under product details. I bought this bible expecting a 9.2 inch large bible but it ended up being only 8ish inches. Yes that matters because it means font size gets sacrificed! The font is around 8 point and readable but see through because the pages are crazily thin and fragile. Every time I turn a page I'm scared I'm going to rip it. Highlighting will be impossible. But all in all it is ultraslim and leather bonded and generally an ok bible. If you want something hardy and to last lots of highlighting and underlining than this is not the bible for you.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Not too small nor too large. The print is just the right size as to not give eye strain to the average person This is the one I like to take to church because of compact yet very readable size. Has a ribbon marker, christ words in red, gold page edges. Its a must have for anyones bible collection.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Slimness comes at a cost of very small type, though still readable.The added subtitles on every paragraph are very annoying. This borders on modifying the text! If those were left out maybe the font size could be increased some. Quality of cover, binding and paper is high.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is exactly the size I was looking for, which is important. I want to specify the size as I measured this Bible: Height 8.81, Width 5.75, Thickness 0.625 (all values in inches). This Bible is thin; font size is large enough to read easily, but not overly big. There are no cross references, but has notes at the bottom of the pages that deal with the source manuscripts. Large Concordance in the back and six pages of maps.If you intend to highlight various verses, I would recommend a dry highlighter so there wouldn't be any bleeding through the pages.It makes a great travel Bible, and I prefer the NKJV.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Gods word is perfect in every way. I cannot add to perfect so read it for yourself. It will be the best decision of your life.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I love my new Bible! The print is the perfect size and the pages, though thin, are strong and durable. I enjoy the compact size as well as the beautiful leather cover. The maps in the back are wonderful as well. All around a great Bible!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "A compact and easily portable Bible...leather is supple, and expectedly the pages are extremly thin, so handle with care, but nice for travel as it fits inside the outside pockets of most luggage. A very aesthetically pleasing Bible in a great translation...",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "reluctant prophets and clueless disciples introducing the bible by telling its stories",
        "description": "A retelling of fascinating Bible stories--including Beginnings, Moses, Solomon, Parables of Jesus, Peter, and Paul--offers a unique way for individuals to get to the know the Bible, bringing out the original humor, inspiration, and pathos within each story. Original.",
        "authors": "['Robert Darden', 'Bob Darden']",
        "infoLink": "http://books.google.com/books?id=aUWgc88QX-oC&dq=Reluctant+Prophets+and+Clueless+Disciples:+Introducing+the+Bible+by+Telling+Its+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Bob Darden's \"Reluctant Prophets & Clueless Disciples\" offers a fruitful method for teaching adults how to read the Bible. Combining his talents as a creative writer, humorist, and Sunday school teacher, Darden helps a novice (and perhaps even \"experienced\") reader of the Bible begin to understand the Bible not as chapters & verses (or worse, fodder for 'proof text poker') but rather as a variety of different narratives that require attentive reading.Darden sprinkles his book with illustrations drawn from his colleagues at \"The Door\" magazine (aka The Wittenberg Door, typo intended). A visual and narrative treat!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book was very helpful in taking me through the Bible stories. It explained everything clearly and it was very easy to follow. I highly recommened for beginners as well as for those who need a refresher course.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the comic book bible",
        "description": "Retells the stories of the Bible in comic strip format, including the stories of Noah, Abraham, Jacob, Joseph, Moses, David, Esther, Jonah, and Jesus.",
        "authors": "['Rob Suggs']",
        "infoLink": "http://books.google.com/books?id=UfuiAC_hSewC&dq=The+Comic+Book+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Comic Book Bible is actually a, not the, comic book Bible. There are two other word ballon type comic book Bibles on Amazon.com. I have bought all three and had many children compare them. The Picture Bible by Iva Hoth is overwhelming the most popular artistic style with children, also the cheapest per page, and per word. The artistic style of The Comic Book Bible is preferred with some teenage girls and is cheaper if The Picture Bible is out of your range. You can get a good idea of the artistic style of this and the other comic Bibles by looking at the picture of the cover on Amazon.com. The Comic Book Bible is done in the style of humorous cartoons and is less realistic than others. While I suggest Hoth's you might also consider Heros of the Bible by Carolyn Larsen for teen and adult males. Tip, search for Heros of the Bible by author not title. Catholics may also like The Big Book of Martyrs, by John Wagner. One last point, comics have a powerful ability to grab an audience, children, teens, and adults. This makes them a great evangelical tool. If your children have reached the stage where they think picture bibles are to immature for them, but the real thing is to advanced a comic book Bible can be a very good buy.",
                "review/helpfulness": "87/91",
                "num_reviews": 91
            },
            {
                "review/text": "THe only thing I didn't like about it is that the quoted verses are in King James. Kids wouldn't read KJ text. Each page has about 4 dialogs and the top of each page has a KJ verse base on the dialogs on that page. Each story ends happily which I like. I like comics, and so I like this one. I didn't find any errors with this one doctrinaly.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Nice, basic book. Good for parents to read to their non-readers, and also good for early readers to read to themselves. Good starter Bible. If your kids are a tad older and can read well, I recommend the Picture Bible. It is an awesome, comprehensive product. It manages to show and tell all of the stories truthfully without being gruesome. We decided on the Picture Bible for our 6-9-yr-olds. It offers a whole lot more for not much more money on Amazon. If we had a 3-5-yr-old, though, this Comic Book Bible would be fun to read to them.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "new catholic picture bible",
        "description": "Glorious full-color illustrations by great masters of religious art enhance these well-known Bible stories. More than 100 stories are represented and are written in a simple style that will delight younger readers.",
        "authors": "['Lawrence G. Lovasik']",
        "infoLink": "http://books.google.com/books?id=wtBSA19IldQC&dq=New+Catholic+Picture+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was given to my sons, aged 3 and 5 for their recent baptism. I think it is wonderful. It boils down the major biblical stories, both old and new testament, into one page overviews that are around third to fouth grade comprehension. Also the pictures are lovely. I believe the reading level listed of baby-preschool is incorrect - more like around age 10. Several adults I know (including myself) have also enjoyed it as a way to review the fundamental stories. I teach third grade PSR, and plan to give this as a present to each of my students at the end of the school year.",
                "review/helpfulness": "64/64",
                "num_reviews": 64
            },
            {
                "review/text": "I purchased this bible for my 7year old son as a Christmas present. We read this frequently as a bedtime story. Each story is only one page and there is a picture to go along with each one. I like the simplicity of the wording and my son enjoys hearing the stories as he learns about our faith. I'm even learning more as I read to him!One of the main reasons I purchased this particular Bible was that another reviewer had mentioned that it was like the one she owned as a child in the 70s. This really hit home for me as I wanted my son to receive the same type of religious experience as I did as a child.The clincher for me is that my son requests me to read to him from this Bible. He frequently looks through at the pictures and stories in the book himself. He even asks questions about the people in the story. This tells me that this Bible is really catching his attention. That we can have a talk about people and events from the Bible is awesome.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I recieved the New Catholic Picture Bible for my first communion in 1970. I wanted to purchase something similar for my daughter's first communion. Imagine my surprise when I found the exact same Bible on Amazon! I ordered the book and it arrived in just a few days. Amazon made it possible for me to carry on a family tradition. The Bible is easy to read for an eight year old and each Bible story is contained on one page making it perfect for bedtime reading.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Reason for Reading: Every Mon-Fri (mostly) we read a Bible story.We converted to Catholicism two Easter Vigils ago and were already in the middle of another Bible Story book at that time. When we finished it we moved onto this one, our first Catholic Bible story book. I'll review this book in particular and then compare how I found it to the usual Protestant or ecumenical Bible story books we had previously read.This is a nice gift Bible with puffy boards and a Presentation page to fill out. Each story is a two-page spread with the left-hand side usually being an illustration and the text on the right-hand side. There is some variety to this though as there are some longer stories where the picture is shrunk to half or a third of the page to make more room for the text and there are scattered throughout some short stories that take up one page with illustration and text sharing the same page. The illustrations are beautiful old-school paintings, very realistic and religious. Mary, Joseph and Jesus are always shown with a halo. Unfortunately no one is credited with the illustrations. The text is a delight to read, presented chronologically and has a suitable reading level for a wide range of ages.I've read many, many Bible story books through the 21 years I've been a mother. How did we find this specifically Catholic Bible story book different from all the others? The beginning and the end to start. This Bible starts with the fall of Lucifer and his \"bad angels\" and ends with the descent of the Holy Spirit upon Earth and the conversion of the first Christians. This Bible also has a definite emphasis on Christ and the Gospels. During the Old Testament, whenever an event or prophesy was made there would be an explanation of how this referred to or was fulfilled in the New Testament. I really appreciated this as it kept us focusing on Christ even during the Old Testament, just like during Mass. The other difference is of course, the Catholic element found in the New Testament where all the Biblical references to the Church are explained and events that are Holy Days are mentioned as such. Also the Eucharist, the Transubstantiation, the Stations of the Cross, the establishment of the Church and the Peter's Primacy are all told from within the Bible stories from whence they came.Thus, I have no problems with reading any Bible story book, Protestant or ecumenical, even as a Catholic, but I do see the advantages of a faith specific Bible story book. Given a choice, though, I would now chose a Catholic Bible story book over another.A lovely Catholic Bible story book, recommended for gift giving.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have a 6 and 3 year old boy and we have read it twice through already A big hit. Nice colorful pictures that are well done and the stories are god authentic Catholic teaching of Sacred Scripture.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I recently bought this bible for my 2nd grade son. He has been reading several stories a day, and has really enjoyed it.There are 43 short stories from the Old Testament and 74 from the New Testament. Here is a sample of stories:Old Testament: 1. The Story of Creation, 2. Adam and Even in Paradise, 3. Cain and Abel, 4. Noah's Ark, 5. The Promise to Abram, 6. Abraham's Sacrifice, 7. Jacob and Esau, 8. Josehph and His BrothersNew Testament: 1. The Annunciation, 2. The Visitation, 3. The Birth of Jesus, 4. The Shepherds, 5. The Presentation of Jesus in Temple, 6. Wise Men from the East, 7. The Flight into Egypt, 8. Jesus is Found in the Temple, 9. The Hidden Life of Jesus. 10. The Baptism of JesusEach two-page story spread has a full-color illustration to go with it. I would guess this bible is written at about a 3rd grade reading level. An advanced 2nd grade reader should have no problem with it. However, I think it would be great for any elementary age child with its colorful pictures and easily comprehensible stories. I also like the fact that the illustrations are realistic, not cartoon style as some other children's pictures bibles are.I am very glad I purchased this Bible, and I believe it will be one that my son will read again and again over the next few years, thus, helping to inculcate a love of scripture and lay a foundation for future study.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "No matter what your religion is, religious history lives for children in the form of these true events.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Rev. LG Lovasik knows his stuff and will never steer you wrong. This is a great picture Bible and one that should be read by children of all ages. Easy to bring to church and fun to read for kids.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "eerdmans handbook to the bible",
        "description": "This international bestselling (over 1.75 million copies in print) full-color guide to the books of the Bible features numerous revisions of the text, illustrations, maps, and charts to provide greater clarity and visual appeal. Features include 437 pictures, 363 in full color; 68 maps showing important geographic locations; 28 charts providing historical background in visual form; and much more.",
        "authors": "['David Alexander', 'Pat Alexander']",
        "infoLink": "http://books.google.com/books?id=YdUHAAAACAAJ&dq=Eerdmans%27+handbook+to+the+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This volume is a fine resource for the reader who wishes to delve a bit deeper into Biblical study, but feels intimidated by the commentaries published specifically for use by pastors and theologians. It's an easy read--two words one seldom associates with a reference book--beautifully illustrated, with plenty of background information to give the biblically challenged a flavor for the times in which the Bible was written. I have recommended this volume and its companion, Eerdmans Handbook to the History of Christianity, since their initial release. I continue to do so, especially with this more affordable paperback edition.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "this is a worthy addition to any Bible scholars library",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "...\"the first few chapters of the Bible and many parts of the Old Testament are historically unreliable\" (pg. 24).This is the premise from which the author is working.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "pew bible",
        "description": "The CSB Pew Bible is perfect for any style of church or worship center, and includes a durable hard cover to withstand years of congregational use. The CSB Pew Biblefeatures the highly readable, highly reliable text of the Christian Standard Bible (CSB). The CSB stays as literal as possible to the Bible's original meaning without sacrificing clarity, making it easier to engage with Scripture's life-transforming message and to share it with others.",
        "authors": "['C. S. B. Bibles CSB Bibles by Holman']",
        "infoLink": "http://books.google.com/books?id=gRm6DAEACAAJ&dq=Pew+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a typical NKJV bible in a red hardcover edition. It is black letter, verse format, and includes all the normal translation notes including those saying where the Greek text the NKJV is based on differs from the critical text or majority text. The footnotes symbols in the text are very small and do not distract the reader. This edition does not have annoying \"self pronouncing\" text. This bible does not have cross references except where scripture directly quotes other scripture.One special feature I find somewhat annoying is that the name of the book (eg. Psalms) is printed in a black box on the outside of each page. The concept is that it works somewhat like thumb indexes so that the reader can find a book quickly by flipping through.The only helps included in this bible are a harmony of the gospels at the end.The paper is somewhere between onion skin and normal book paper. The bible stays open by itself when opened on a desk. Inner margins are excellent, wider than normal so that the inner words can be easily read.The biggest problem with this edition is the bleed through, which unfortunately is typical of bibles. This edition is not worse than the average bible. I can see not only the current page, but the page on the other side. The paper is thick enough that the underlying page cannot be read easily through blank pages though. This bible is readable, especially when a page is picked up while being read, something that cuts bleed through.If someone wants a verse format, black letter, text only NKJV then this bible will do the job for them.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I have pretty good eye sight and I found the font on this to be challenging.I bought it originally to use in child training my children using the Bible Training set sold at:[...] but I don't think it will work well. It's supposed to be a bible that I can share with my young, beginner reader (and older) children. I think I will have just as much problem reading it as they will.I'm not anexpert, but I would guess the font size to be around a 6 point.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the postmodern bible",
        "description": "The burgeoning use of modern literary theory and cultural criticism in recent biblical studies has led to stimulating--but often bewildering--new readings of the Bible. This book, argued from a perspective shaped by postmodernism, is at once an accessible guide to and an engagement with various methods, theories, and critical practices transforming biblical scholarship today. Written by a collective of cutting-edge scholars--with each page the work of multiple hands--The Postmodern Bible deliberately breaks with the individualist model of authorship that has traditionally dominated scholarship in the humanities and is itself an illustration of the postmodern transformation of biblical studies for which it argues. The book introduces, illustrates, and critiques seven prominent strategies of reading. Several of these interpretive strategies--rhetorical criticism, structuralism and narratology, reader-response criticism, and feminist criticism--have been instrumental in the transformation of biblical studies up to now. Many--feminist and womanist criticism, ideological criticism, poststructuralism, and psychoanalytic criticism--hold promise for the continued transformation of these studies in the future. Focusing on readings from both the Hebrew Bible and the New Testament, this volume illuminates the current multidisciplinary debates emerging from postmodernism by exposing the still highly contested epistemological, political, and ethical positions in the field of biblical studies.",
        "authors": "['George Aichele', 'Fred W. Burnett', 'Robert M. Fowler', 'David Job ling', 'Tina Pippin', 'Wilhelm Wuellner', 'Bible and Culture Collective']",
        "infoLink": "http://books.google.nl/books?id=dG1b7ACZwRsC&dq=The+Postmodern+Bible&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Postmodern Bible provides what is as close as anyone will ever get to a contemporary handbook on &quot;postmodern&quot; methods of approaching, reading, using and interpreting the Bible. One might ask why such a book is needed. I would reply that this book is needed because it implicates the readers of the Bible in the matters it wishes to bring to bear in biblical study. This book attempts to show (in my estimation) that reading the Bible is a social act, a personal act, a political act and a cultural act. And this book preaches what it practices for it is written by a self-styled &quot;Bible and Culture Collective&quot;, a group of scholarly &quot;young turks&quot; no less, who amply demonstrate that projects worked on together need not end up being mish-mashes of the wants and desires of those composing them.This book has both direction and drive. In seven compact yet thorough discussions we are introduced, in theory and practice, to seven contemporary approaches to the practice of biblical reading. Many, if not all, of these (reader-response criticism, poststructuralism, feminist and womanist criticism) are hardly novel outside of the biblical field but then that seems the point of this book; that is, to attempt (or continue to attempt) to intergrate biblical studies ever more closely with, or into, literary studies and cultural studies. This seems the pervasive agenda of this book.I must admit that I have an interest in reviewing this book, however. I was taught for three years as an undergraduate by one of the &quot;Bible and Culture Collective&quot;, Stephen D. Moore. I can confirm that the Collective, if Moore be an example, do indeed practice what they preach in this book. I have to say it sets the Bible on fire in new and exciting ways. If you want to engage the Bible from some new angles or just want to get up date and clear in your mind on contemporary methods of biblical interpretation then get this book. It has no serious challengers in its field to date.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "If you've ever been puzzled by the formula of 'post-modern' and 'biblical studies,' then you'd be wise to pick up this exhaustive and personable piece of academic fervor. Among others, The Postmodern Bible fuses epistemological, religious, and cultural frameworks into a textual craft that will keep you poised with more questions. I recommend this book to anyone who takes the Bible seriously - whether you're a theologian, academic, or a heady poser, you'll want to have this book on the shelves of your mind.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            }
        ]
    }
]