[
    {
        "Title": "dirk bogarde the authorised biography",
        "description": "'Biographies only tend to be definitive until the next one comes along, but there's no danger of Coldstream's erudite, moving analysis ever being superseded' INDEPENDENT ON SUNDAY. As an actor Dirk Bogarde was a Rank contract artist and matinee idol who became a giant of the intellectual cinema, working on films such as Death in Venice, The Servant and Providence. Fiercely protective of his privacy, and that of his partner of 40 years, he left England in the 1960s to live abroad, where he carved a second career for himself as a bestselling author. Although Bogarde destroyed many of his papers, John Coldstream has had unique access to his personal archives and to friends and family who knew him well. The result is a fascinating biography of a complex and intriguing personality.",
        "authors": "['John Coldstream']",
        "infoLink": "https://play.google.com/store/books/details?id=hf74ERD2MQgC&source=gbs_api",
        "review": [
            {
                "review/text": "I am delighted that John Coldstream's biography of Dirk Bogarde is now out in paperback, which means that more readers will have access to this compelling story of one of the finest actors of the 20th century. And, to my own pleasure, the paperback makes it easy to read in bed or carry in a pack, removing all worry about damaging my cherished hardcover version.Without reserve, I can say that this is one of the best biographies I have read in years and certainly the finest that will ever be written on Dirk Bogarde. From the minute one picks up this book, as beautiful in paperback as in hardcover, one knows that it is not the usual star biography filled with gossip, written merely to pump up a star's image or to make a quick profit. Coldstream's engrossing look at the public and private lives of this icon of British film is impossible to put down. The first page quickly turns into 200 pages.Coldstream has the rare perspective of friend and one who worked with Bogarde, which brings a special understanding and appreciation of the private Bogarde to this biography. Yet, unlike writers who set out to prove theories, Coldstream's balanced, extensively researched approach is the ultimate tribute to Bogarde. The reward for readers is a compelling view, written with candor, insight, and affection.Given unlimited access by Bogarde's family to private papers, photos, and rare home movies, Coldstream unfolds a life that holds us spellbound. He illuminates the early influences on Bogarde, his military years, journey from matinee idol to serious actor, second career as a writer, and knighthood in 1992, giving us behind-the-scenes looks at some of the biggest names and players in British film and Hollywood.We are privy to Bogarde's thoughts on the Rank and Hollywood Studio systems, on acting, the rigors of filming, and his unaccredited revisions of inadequate scripts. We hear his usual candid, often affectionate comments on the famous people who graced his beautiful homes on any given weekend: Ingrid Bergman, Ava Gardner, Judy Garland, Charlotte Rampling; directors Cukor, Losey, and Visconti, to name a few. Bogarde knew them all. Equally fascinating are their thoughts on him, the private man and actor, in the countless interviews Coldstream conducted across the globe and the extensive papers and firsthand sources he examined in the course of his research.But Coldstream gives us more than the glitter of Bogarde's career in film. There is Bogarde at his beloved farm in Provence, the stray pets he sheltered, his natural talent for writing and the evolution of his 15 best sellers and later years writing for the Daily Telegraph, to the dark days when illness overcame his partner Forwood and then stalked Bogarde. Coldstream does not shy away from addressing questions readers have had about the elusive Bogarde, no easy image to capture. A continuing question has been whether his 40-year relationship with agent and companion Tony Forward was a homosexual one, something Bogarde denied to his death in 1999. To Coldstream's great credit, he does not speculate but lays out what he finds and leaves it to the reader to make up his mind on this and other aspects that continue to swirl around this fascinating man.The paperback version has retained the elegance of the hardcover edition and its extensive chapter-by-chapter sources, appendices, and comprehensive index, including the wonderful endpaper drawing of Bogarde by Richard Cole, all of which reveal the taste and intelligence behind this effort. There are some 130 photos many never published, including Bogarde's own drawings. An added perk is a new cover photo of a younger, ever handsome Bogarde in his late 30s at the top of his game as reigning matinee idol, a throne he eagerly abdicated for more complex roles. A perfect choice, the photo reveals Bogarde's discerning intellect and inner discontent, which drove him to make such daring, independent career choices.Coldstream has truly captured the spirit of Bogarde, the actor, writer and man, as well as the caustic wit yet kind and loyal friend. Few books leave one with the satisfaction of having spent time and money well. This is one of them.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "This is one of the best biographies I've read in years and certainly the finest written on Dirk Bogarde. From the minute you pick up this beautiful book, you know that it is not the usual star biography filled with gossip, written merely to pump up a star's image or to make a quick profit. Coldstream's engrossing look at the public and private lives of this icon of British film is impossible to put down. The first page quickly turns into 200 pages.Coldstream has the rare perspective of friend and one who worked with Bogarde, which brings a special understanding and appreciation of the private Bogarde to this biography. Yet, unlike writers who set out to prove theories, Coldstream's balanced, extensively researched approach is the ultimate tribute to Bogarde. The reward for readers is a compelling view, written with candor, insight, and affection.Given unlimited access by Bogarde's family to private papers, photos, and rare home movies, Coldstream unfolds a life that holds us spellbound. He illuminates the early influences on Bogarde, his military years, acting days, career as a writer, and knighthood in 1992, giving us behind-the-scenes looks at some of the biggest names and players in British film and Hollywood.We are privy to Bogarde's thoughts on the Rank and Hollywood Studio systems, on acting, the rigours of filming, and his unaccredited revisions of awful scripts. We hear his candid comments on the famous people who graced his beautiful homes on any given weekend: Ingrid Bergman, Ava Gardner, Judy Garland, Charlotte Rampling; directors Cukor, Losey, and Visconti, to name a few. Bogarde knew them all. Equally fascinating are their unvarnished thoughts on him, good and bad.But Coldstream gives us more than glitter. There is Bogarde at his beloved farm in Provence, the stray pets he sheltered, his natural talent for writing and the evolution of his 15 best sellers, to the dark days when illness overcame Forwood and then stalked Bogarde. Coldstream does not shy away from addressing questions readers have had about the elusive Bogarde, no easy image to capture. A continuing question has been whether his 40-year relationship with agent and companion Tony Forward was a homosexual one, something Bogarde denied to his death in 1999. To Coldstream's great credit, he does not speculate but lays out what he finds and leaves it to the reader to make up his mind on this and other aspects that continue to swirl around this fascinating man.This is also an elegantly done book of rich colours, fine paper, extensive appendices and index, which reveal the taste and intelligence behind this effort. There are some 130 photos many never published, including Bogarde's illustrations for his books, with a stunning front cover photo of the handsome Bogarde and one taken by Charlotte Rampling on the back cover.Coldstream has truly captured the spirit of Bogarde, the actor, writer and man, as well as the caustic wit yet kind and loyal friend. Few books leave one with the satisfaction of having spent time and money well. This is one of them. And when it ends, we wish for more.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "John Coldstream's biography of Bogarde is sumptuously written and rich in detail. It gently and fairly lifts the mask from this gifted but obsessively private actor so that we see him--freckles and all--in a carefully balanced portrait. I found myself wishing that the book were a hundred pages shorter, but I read every page and relished the good writing almost as much as the story itself. As movie biographies go, this one is many cuts above the usual.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "roscoe fatty arbuckle a biography of the silent film comedian 18871933",
        "description": "Fatty Arbuckle's career came to a sudden halt amidst allegations that he raped and caused the death of a young starlet named Virginia Rappe. Though he was acquitted, the comedian, who was at one time second in popularity only to Charlie Chaplin, was ruined. Interviews with many of Arbuckle's contemporaries (including Minta Durfee, his first wife) and extensive research inform this serious study of the once-fabled comedian. His early days in the Keystone comedies and his relationship with Chaplin are recounted. The details of the Rappe trial and his life afterwards are also provided.",
        "authors": "['Stuart Oderman']",
        "infoLink": "http://books.google.nl/books?id=cOK4rXwv80EC&dq=Roscoe+%22Fatty%22+Arbuckle:+A+Biography+Of+The+Silent+Film+Comedian,+1887-1933&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "You will have a hard time putting down this engrossing biography of silent film comedian Roscoe Arbuckle. Author Oderman has interviewed Arbuckle's first wife Minta Durfee extensively for this book. While other Arbuckle biographies may delve into his scandal and trial deeper, this one focuses on his personal life. The book illuminates Arbuckle's heart-breaking childhood, his personal failings and the reasons for the breakup of his marriage.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "It is of great satisfaction to every fan of silent comedy that Roscoe Arbuckle is finally gaining some recognition as something more than an unfortunate victim of false accusations. His work was recently celebrated in a loving DVD-set released by Laughsmith, and this book, ROSCOE \"FATTY\" ARBUCKLE A BIOGRAPHY OF THE SILENT FILM COMEDIAN by Stuart Oderman, which was first published in 1994 and reprinted last year, is another triumph. While it examines the infamous scandal thoroughly, it also includes aspects of his life far beyond that, beginning with his sad, friendless childhood which was largely shaped by his mother's death and his father's alcoholism, going on to cover his early stage career. Oderman has done his research not only on Arbuckle but also, obviously, on his era. Oderman spent years interviewing people involved in Arbuckle's life, most significantly his first wife Minta Durfee; some have questioned the accuracy of Durfee's statements, but it does in any case remain of value to be provided with her insights and way of thinking. Of particular interest to me was reading about Arbuckle's working relationship with Chaplin and Keaton.The book does suffer from some inaccuracies; whereas Oderman claims that Arbuckle starred in three sound shorts for Warner Brothers towards the end of his life, he did in fact appear in no less than six. However, all in all these flaws are quite minor, and ROSCOE \"FATTY\" ARBUCKLE: A BIOGRAPHY OF THE SILENT FILM COMEDIAN is highly recommended from me to anyone who appreciate the comedies of the charming comedian, and to you who simply want a belivable study of his life.--UPDATE: FEBRUARY 2010 - I've recently re-read this book and must admit to have slightly changed my opinion on it. I have done more research on Arbuckle in the time that has passed and have come to realize that Oderman's study disappoints on some levels. First of all, some of his sources, and hence the conclusions he draws, regarding the scandal are worthy of skepticism. Further, it fails to give a satisfying exploration of Arbuckle as a comedian and film-maker. It is still the best full-fledged biography devoted to Arbuckle to date, to my knowledge, but a \"definite\" biography has yet to be written.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I had high hopes for this book- particularly given the $30 price tag. Don't get me wrong, I am more than willing to pay more for a good product. Unfortunately, there are several \"little\" problems that add up to a less than stellar experience. The first thing that struck me when I received the book was how thin it was. Now at 255 pages, it's not exactly a pamphlet but most of the other biographies that I own for silent film stars are more substantial. My real issues started within the first few pages. The text states that Arbuckle made 3 sound shorts in 1933 as part of an attempt at a comeback. Not true. Arbuckle made a total of 6 shorts in 1932-1933. The short that the text says was the first short made was in fact the LAST one made. Elsewhere, the text states that Buster Keaton gave up $250/wk on a show in exchange for $40/wk to work with Arbuckle and he considered the pay cut a small price to pay for his apprenticeship with Arbuckle. Keaton, if fact never bothered to ask initially how much he would make working with Arbuckle. There are other minor examples I could site. This may seem nitpicky of me but if these basic facts are incorrect and/or misleading, I am left to wonder what else in incorrect or misleading. There are also several typos throughout the book- not a big deal but one more minor thing that detracts from the work. I also noticed that on several occasions an incident that is sited in one chapter is sited again in the following chapter without adding anything to the retelling; it gives the impression of a school child told to write a 1000 word essay and repeats himself to reach the word requirement.On the bright side, I have this to say about the book: It is certainly better that the Stahl book out there that, though a self proclaimed fictional work, many take to be more biographical than they should. Oderman's book is a balanced, non-sensationalized account of Arbuckle's life. Also I was pleased to see excerpts of interviews with Minta Durfee(Arbuckle's first wife). It was informative to read her take of events in her own words. Much of this material I have not seen elsewhere. In the end I enjoyed reading the book very much but I am left wondering how much of the material is accurate.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "vincent price a daughters biography",
        "description": "The inside story of the legendary actor's 65-year career - from radio to classic movies and horror films to Broadway - and his family life. \"Entertaining and touching.\" - The New York Times.",
        "authors": "['Victoria Price']",
        "infoLink": "http://books.google.nl/books?id=6tNmDwAAQBAJ&dq=Vincent+Price:+A+Daughter%27s+Biography&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Victoria Price has written a book that i feel is a double edged sword toward her father. i've read it many times and prior to buying the Lucy Chase Williams book on Vincent, i'd pull out Victoria's book as a reference for something obscure or whatever. well, those times are over. it is no secret that Vincent was a liberal politically. his interest in art, conservation, and theatre among other things are stereotypically liberal that we didn't need his daughter to hammer the point home because there's some fans out there, like me, who could care less about their favorite actor or singer's political views and i get offended when it comes across that Republicans like myself shouldn't be a fan of Vincent's because \"we're bad and want to destroy public TV and arts programs\", which is how i took it from reading this book. politics you might ask? it's true! Victoria at times brings up the liberalism that she and her parents lived and practiced but she intentionally or accidentally makes people who don't live that way or think as her friends do as being strange or abnormal...in addition, Victoria goes into detail about his successful career on the stage in playhouses all over the United States and abroad and to me this was informative because most people focus on his horror career only. but, here comes another problem, the lack of information on his horror career and his movies in general. what we're treated to are her accounts of what critics or her father had to say about the movies...she offers no first-hand knowledge and SHE IS HIS DAUGHTER so she should know things we don't already...and by the time this book arrived she had PLENTY of time to watch his horror films and get an opinion of them. but, Vincent's dramatic films are also given very little discussion. if we're to believe her, none of her father's films are worth watching unless they recieved high praise from a nationally known critic or were box office successes. she paints a picture that her father's films can't be open to anyone's viewpoint once a critic has stamped it a bomb or whatever. i've seen quite a few of his so-called flops and they were GREAT! near the end of the book we're told about his career on TV and in commercials. his 1981-1989 run as the host of the PBS classic show \"Mystery!\" is also touched upon but once again, Victoria showers the chapters with second and third-hand information that family should already know first-hand. the pictures in the book are great!! i love the one where he's with his peers: Karloff, Lorre, and Rathbone during a photo shoot in the early '60s. there is a segment in the book that details Vincent's artistic flamboyance, and she brings up the silly rumors that Vincent was bi-sexual. first off, Vincent's sexual behavior isn't interesting to me! when i'm watching him stare at someone with that menacing look or if he's laughing at some devious scheme he's cooked up, i'm certainly not thinking about who he's sleeping with or who he finds attractive off-screen and so i find this section of the book silly and uncalled for and a MAJOR distraction to what the book was suppose to be, a biography of her father through HER eyes and NOT through the eyes and opinions of critics and industry insiders, which is basically what it turns out to be as a whole!! the only time i see that she gets personal and really says how she feels is when she talks about Vincent and his life with Coral Browne {near the end of the book since the marriage came in 1974}. now, i don't expect Victoria to drop to her knees and kiss the ground her step-mother walked on because after all Coral wasn't Victoria's mother, but at the same time, Corale couldn't have been that awful or else Victoria would've said something DECADES ago to a tabloid paper!! i give this book 3 stars because Victoria doesn't seem to realize that her father's fans aren't interested in rumor, gossip, and alleged communist involvement that were never proven because the accusations were flimsy and had no weight, so it's baffling as to why she'd plant those kind of thoughts about her father to potential new fans who ONLY know of Vincent through Batman re-runs {Vincent played \"Egghead\" on a few episodes}.",
                "review/helpfulness": "20/32",
                "num_reviews": 32
            },
            {
                "review/text": "Many people know Vincent Price simply as &quot;that horror film actor&quot;. He was, however, a man of many varied interests and talents, far beyond those even most fans might be aware of. The life of Vincent Price could be summed up in one word: full. Price did so much with his life that the author's job of bringing it to one book must have been daunting. But Victoria accomplishes this task quite well. From traveling to and receiving his education in Europe, to his first major stage role (and huge hit) in Victoria Regina, his stage, television and film work, marriages, children, interests in travel, public-speaking, cooking, writing and well-known and life-long love of art are all here. For those who must have something a little more lurid, heretofore-unknown facts about his involvement with the Fifties McCarthy witch-hunts and the rather shocking deal he made, and his sexuality are touched on. The greatest achievement of this book, however, owes as much to Vincent Price himself as it does to the author. Throughout his life Vincent wrote (and kept) an enormous amount of correspondence. With this wealth of personal documents at her disposal, Victoria sprinkles quotes from Vincent throughout the book. Thus, we are fortunate to have Vincent's life unfold before us as if Vincent himself were relating his own story. His triumphs, failures, joys, fears, pain. Vincent talks to us about each. Never before has a person's life, documented by another, been brought so close to the reader, or made so personal. Many thanks are due, both to Victoria and Vincent for this wonderful accomplishment. There are a few downsides to the book, however. The book is lacking when the author discusses her father's films. She has over the years admitted that she never really watched her father's horror pictures. As such, we regretfully do not gain many insights into the making of those films that we didn't already know from other books. This is a huge opportunity lost. And sadly, the slant that comes across when the author discusses her (deceased) stepmother, actress Coral Browne, is decidedly negative. While entitled to include or discard facts as one wishes (for this book is as much a memoir of Victoria's life as it is a bio of Vincent's), one wishes the author hadn't been quite so needful (and used a bio of her father as the vehicle) to paint Browne in such a bad light. The uplifting, joyful and celebratory narrative of Vincent's life comes to an abrupt halt when the author turns her attention to detailing her stepmother's perceived faults.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "This is probably the most rounded, most intimate portrait we will ever get of a horror film star. Due to her unparallelled access to her father, his unpublished memoirs, and his letters, Victoria Price gives us a remarkably intimate and detailed view of her father's public and private life. The strongest parts of the book are her portraits of her father's theatrical career (covered in great detail), and his rich private and social life. His marriages to Mary Grant Price and Coral Browne are portrayed in all their complexity,and Price's final years are revealed with both love and sadness. The book has literally dozens of fresh details about Price's private life which were unknown to even this veteran fan. The book has its weaknesses, though: Victoria Price has no great interest or love for horror movies, and her usually rigorous command of detail breaks down when she covers these topics. And her coverage of Price's film career is heavily dependent on an earlier book by Lucy Chase Williams, THE COMPLETE FILMS OF VINCENT PRICE--to the point where I thought she had Williams book in one hand while typing in the other. Additionally, Ms. Price's book lacks footnotes, a somewhat maddening omission, as the many anecdotes from her father are all unsourced. But all in all, this is a must-buy and must-read for any Vincent Price fan.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "What a life! There is one word I can think of to describe Vincent Price--Integrity. This book was a disappointment, however. The author's (Price's daughter) constant rant about evil conservatives detracted from the reason I bought the book in the first place--love of the films. Although I enjoyed reading of his personal political thoughts, I couldn't be sure where his' thoughts left off and her's began.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "This was a wonderful book, from beginning to end. I've been a Vincent Price fan since I was a little kid, but I never had a clue that he did anything other than horror movies until I became an adult. While reading this book I became fascinated with him all over again, watching old movies that were new to me, like Oscar-winning LAURA, where he played a young playboy from Kentucky. Not only do you learn about him personally, but about the extreme era in which he grew up. He witnessed the Nazi regime first-hand while living overseas, and even attended one of Adolph Hitler's many rallies. This book really gets to the heart of his true loves in life; Art, Europe, Family, Music, and the stage. Read it and dicover what a wonderful, multi-faceted person he was all over again.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This biography is no &quot;Mommy, Dearest&quot;-posthumous attack. It is, instead, a balanced look at a multi-faceted man, and the biographer has been, overall, quite responsible. There are very few negative &quot;revelations,&quot; and even those are correctly placed in context of stressful times or unfounded innuendo. Victoria Price did NOT savage her father, but as a responsible biographer she had an obligation to address some aspects that may not be regarded as flattering. Vincent Price was a human being of enormous talent, perspicacity, and personal charisma -- this book reinforces that, although admitting that he was, after all, a human being and subject to human failings. My understanding for the man was increased, not diminished, by this book. My only complaint about the book is that it is &quot;light&quot; on info about VP's film career. Ms Price's acknowledged disinterest in his &quot;horror&quot; movies is evident -- and I was saddened by her lack of appreciation. This book must be viewed as an adjunct to Lucy Chase Williams' magnificent &quot;Complete Films of VP,&quot; not a replacement for.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "First I have to wonder whether I read the same book as the reviewer on January 17. I found it to be well written, well researched, and terrific reading. This intimate look at Vincent Price was much more than I expected since Victoria had the kind of access to her subject that a lot of biographers do not: she was his child, lived with him for some years, and she also had the good fortune to have scores of family members, wives, close friends, co-workers, etc. to glean information from. And she painted a balanced portrait of the man complete with his flaws.I also disagree that the book's focus is on Victoria. She is in it no more and no less than any child of a biographical subject would be. The reviewer seems to be implying that Victoria is whining and complaining about her life and the times her father was away from home working, etc. etc. She does mention that at times the relationship suffered because of his absences, but she also makes clear a number of times just how much she loved and admired her father and vice versa and how she treasured their relationship and the times they shared together. My impression is that they had a pretty good overall relationship and it does not seem to me that Victoria is &quot;licking her emotional wounds in public.&quot;She is upfront about the tense and awkward relationship she had with Coral Browne, Vincent's last wife, but she also takes great care to understand how much of an imposing presence Coral was in her father's life (apparently in anyone's life!) and also recounts the great times she had with Coral once Coral began to let her guard down. Victoria understands that Coral was threatened by the undying love and devotion Vincent had for his daughter and Coral hated the fact that she was not the only person in Vincent's life. Most of Coral's friends and acquaintances that were interviewed admit that Coral was unable to accept that Vincent refused to completely shut his kids out of his life because that was what Coral wanted and this was what led to some tensions in the relationships.However, as I said, Victoria states that she came to like and admire Coral and recounts a number of times that they shared good times together. As for the hints of bisexuality, Victoria points out clearly that for years there were rumors of both Vincent and Coral being bisexual and that they were well aware of the rumors and laughed about it all. The focus on Vincent's career is pretty interesting and while there are many anecdotes about his films, plays, costars and the like, the book is hardly gossipy. I do agree that she seemed to gloss over his work in horror films which kind of disappointed me since, as a kid, that was how I first became aware of Vincent Price, but she admits herself that she has no great love for horror films, but she doesn't ignore them altogether; she understands how important they were in her father's career and how they opened Vincent to a wider audience than ever. She just doesn't cover them in great detail as I would have liked. Then there are the other sides of Vincent: the art lover and supporter, the gourmet, the loyal and devoted friend and father which help with the balanced portrait. Does Victoria cover every single facet of her father's life. No, probably not, but what biography is 100% complete? Some things are bound to get short shrift in the grand scheme of things. (She does acknowledge her debt to Lucy Chase Williams and her book on Vincent's films) All in all, I'm thankful to Victoria for this well balanced, fascinating and entertaining look at one of the best there was. She should be as proud of her book as she was of her father and this terrific book will be part of Vincent's legacy. I say read it for yourself and judge. My guess is that if you're a fan of Vincent's you won't be disappointed. Thanks again Victoria!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "The one thing you could always count on from Vincent Price was a good performance. Price always gave his all to whatever character he played, be it Brigham Young or Dr. Phibes, Mr. Manningham of Angel Street or Egghead of Batman. He was a professional, through and through.This biography of Price by his lovely daughter Victoria would certainly have made Vincent proud, for it is also thoroughly professional. The author's prose is about as polished as it gets, which makes reading the book a joy. And the editing is nothing if not top notch.The book starts with interesting information on Vincent Price's early life in St. Louis, then moves on to his college years (Price graduated from Yale), to his overseas travels, his work in London theatre, his eventual return to the United States and work on Broadway, his marriages to actress Edith Barrett (who bore him a son, Vincent Barrett Price), to designer Mary Grant (who bore him Victoria), to Vincent's work in Hollywood, to his eventual final marriage to actress Coral Browne, and much more.We learn much about Price's great love for art and of his desire to make art affordable for everyone (which led to Price's work for Sears); of his contributions to various art galleries and his efforts to have a permanent gallery of his own (he had one, for a time, but had to close it); of his travels to exotic places around the world; of his gourmet cooking; of his love for animals; of his extensive work in film (Price made a number of horror films, but most of his work in film was not horror related), of his extensive television and stage work; of his incredible solo show as Oscar Wilde and of his many speeches; and of his relationships with many of the biggest stars of his day, many of whom became his close personal friends.Some of the most interesting parts of the book were those in which the author wrote of Vincent's relationships with people in general. Although Price was a big star, he apparently treated everyone with the same genial kindness, be they celebrities like himself or mere street sweepers.So as not to make him into too much of an angel, Victoria also tells of her father's occasional angry outbursts, of his affairs, and of his two divorces. She tells of his insecurities, and of his all-consuming desire to be liked.Vincent Price has been gone for a few years now - gone but not forgotten. His work remains, as does his spirit in the hearts of his family, friends and fans.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "As a long time admirer of Vincent Price I found this book quite interesting and entertaining. On the plus side ,it provides a comprehensive overview of the subject's movie career with enough \"Behind the Scenes\" trivia to satisfy the fans. It certainly opens the door on the various Price households (plural !) and there are a few revelations. The author has a smooth writing style and the book is easy to read.However,far too much space was devoted to \"Vinnie's\" involvement in the world of art . I found myself skipping over ALOT of pages . Worth buying at a budget \"Price\" if you're a fan of this uniquely talented actor.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This biography is surprisingly good, considering the subject's own daughter wrote it. Victoria Price manages to remain objective in discussing her father's life, though - as is only to be expected - she accentuates the positive and quickly glances by the negative. Not that this is a bad thing (I wouldn't expect, or necessarily be attracted to, some kind of expose on the man), but it does leave unanswered questions.Victoria brings up Vincent's \"grey listing\" during the House Un-American Activities Committee hearings, and his getting around it by making some general pro-American/anti-Communist statements to the FBI denoting basic agreement with them (citing organizations and non-named individuals as being un-American) for instance, and even that his affirmations to the contrary were later discovered (by her) to be false, but this is quickly glossed over - as is her father's \"occasional drinking problem,\" which she tantalizingly hints was an ongoing familial difficulty but refuses to detail. Vincent was involved in the 1959 rigged quiz-show hearings for his part in The $64,000 Question, about which Victoria hastens to inform us he was found innocent, or at least ignorant, of - though oddly she virtually proves the actor's at least semi-knowing involvement in his behind-the-scenes pre-briefings before airtime.Victoria is best at presenting the human side of the man, which is after all what a good biography does. Her greatest strength is in detailing his psychological development and early career, pre-horror star status. She falters considerably from Vincent's American International Pictures years on, admitting herself that she still hasn't seen his many famous horror films. Anyone looking for information on those projects and those years would do best to look elsewhere.Still, that this is a less thorough biography than it could be is a matter of little import. It does genuinely paint a warm portrait of what Vincent Price was, by one of the people who would know best: an accomplished art critic and collector, a gourmand, a generous benefactor to those in need, a concerned and active political man, a devoted father, and (of course) a celebrated actor. Victoria does at least mention her father's flaws, in such fashion as one can only sympathize with them, and does a wonderful job of presenting the famous actor as the remarkably vigorous and witty Renaissance man he was.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "diary of a genius",
        "description": "Diary Of A Genius stands as one of the seminal texts of Surrealism, revealing the most astonishing and intimate workings of the mind of Salvador Dali, the eccentric polymath genius who became the living embodiment of the 20th century's most intensely subversive, disturbing and influential art movement.Includes a revelatory essay on Dali by the author JG Ballard.This new de-luxe edition of the widely-acclaimed autobiography comes in a larger format and with additional illustrations. Copyright Libri GmbH. All rights reserved.",
        "authors": "['Salvador Dalí']",
        "infoLink": "http://books.google.com/books?id=Cu5IAQAAIAAJ&dq=Diary+of+a+genius&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "the great dali offers a glimpse of the workings of his twisted mind with chapters dedicated to subjects such as: the universe as a four-buttock continum, over 100 uses for a whale bone and how he turned into a fish. a must read for pure laughter and looney inspiration.",
                "review/helpfulness": "20/25",
                "num_reviews": 25
            },
            {
                "review/text": "Supposedly, some small corner of the mind tosses its dice continuously, trying every combination of fact against every other. Next some filter removes the nonsense - most of it - and lets through a few drops of insight. In some few minds, a droplet or two more forms steady trickle of meaningful creativity.In Dal&iacute;, the floodgates had opened. Every experience, even seeing a hotel bellboy, spilling some coffee, or flatulence, had mystic and mythic meaning for him. Read just a few of his words, and you know that you can't just read his words. Ideas swirled around him in chaotic orbits, like his beloved flies. His writing makes me think of a show of fireworks, which an author tries to describe by tracing a few dozen especially brilliant sparks.Three things stand out as invariant across Dal&iacute;'s life, as he tells it. The second is Gala, his wife, muse, agent, and tour-guide to planet earth. The third is enthusiasm for everything, a degree of involvement with his world that permeates his vision and hearing, but also his senses of smell, touch, and all things of the body. That level of everyday intensity would stun most people in just minutes, and probably kill some.The first point in Dal&iacute;'s world is, of course, Dal&iacute;. I can not describe Dal&iacute; on Dal&iacute;, you must experience that first-hand.//wiredweird",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "Dali is an insane being. However, if you like to be stimulated then this is the best book to do the job.I found Diary of a genius to be an &quot;out-there&quot; kinda book. I absoultely adored it. Between Dali's interrestings ideas he kept you laughing. A must read for the half insane.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "Egocentric, insightful, humorous, scatalogical, artistic, poetic, profound, intense,surreal, beautiful, philosophical insanity!",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "From 1952 to 1963, Salvador Dali kept a journal, a diary of his thoughts, creative reasoning's, and mindful tangents. In a matter of several hours and 186 pages, I feel as if I have delved far into the mind of a man whose entire life is either nonsense blathering of the brain or philosophical wonders reaching far beyond my own capacities of comprehension. While Diary of a Genius did not keep me in suspense, give me nightmares or have me in tears, the book did touch a part of my brain that doesn't get triggered very often, let alone four hours straight.Dali writes daily entries into his diary discussing off-the-wall realizations, urges, drives, and adorations. One of the most interesting aspects of the book was to read the very intimate words of one of the most renowned surrealist painters in the world. Dali talks of his process in working on many pieces in a day-by-day account of his struggles and conquests in painting. He is fueled mainly by his love for his wife Gala, but also by the incisive apprehension and dissection of oddities accumulating in his head. He talks of his bowel movements, his intrigue in Hitler, his subconscious representation of rhinoceros horns, and his love of elephant skulls in the summer.Diary of a Genius was, in short, an interesting read that kept me entertained for a short period of time. I am much more knowledgeable of Dali himself and will look at his work now with a new understanding of the peculiar man behind the brush. I would definitely recommend this book to any psychology student looking to analyze the intricate workings of a madman's ways and fantasies of the mind. I would also recommend this book to any fan of Salvador Dali, surrealism, or art in general. I would suggest, and I believe that Dali would agree with me, that this book be read while sitting on the toilet.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "Diary of a Genius is a peak into the life of Salvador Dali. Mind you that this peak is VERY interesting, as the life of Salvador Dali was what a normal person would refer to as crazy. The introduction by JG Ballard is understandable and describes Dali's style as well as his psychopathology and the different phases of his art.Most people who have hear the name, know of the man, or seen his art could probably make a well-informed assumption that the man is strange, but reading Diary of a Genius is the easiest way to confirm any suspicions that you might have. He surprises the reader on several occasions with the things that he says, most often discussing his own genius in an arrogant fashion or describing some of his twisted visions. Some entries into this diary, which covers Dali's life from 1952-1963, even discuss and describe his bathroom \"activities\" and their byproducts.Dali reveals answers to some questions about himself, including thoughts behind the sky-bound mustache. The book also makes it known that he loved his wife, Gala. The book, in fact, makes this known a lot of times. His writing makes me think that many of the things he did to seem an outcast were simply to keep people talking about him. Dali was a master of hype, and this book either displays it, or truly shows that Dali was insane.I am really not much of a reader, so it is rare that I read a book without falling asleep after ten minutes. Dali's diary was so interesting in its oddities that I found myself truly interested in what was being said. The associations that Dali creates are fascinating if you don't suspect him of trying to hard to live up to his self-title of a genius. I recommend the book to anyone who is interested in Dali, surrealism, Gala, feces, or psychology.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "If you have the patience and time to focus on all the wacky details that Salvador Dali has written, then this book will be an interesting and entertaining. For me, half of the overdramatic description is annoying and I really don't have an interest in reading. The best part of the book is what was left out as Dali's \"Secret Life.\" With all the respect and love for Gala that Dali shows it makes me wonder if the secret life of his betrays Gala. There are anecdotes of wisdom, philosophy, and examples of pointless behavior, and somewhere in the words it's possible for anyone to relate to or share in a similar experience. Dali on the other hand you might think is just more warped than most. For example he writes about the intensity of kissing a loved one (Gala) in this way: \"On awakening I kiss Gala's ear to feel with the tip of my tongue the thickness of the minuscule moulding on the lobe. At that moment I feel, all mixed in with my saliva, Picasso. Picasso, who is the most vital man I have ever known and who posses a birth mark on the lobe of his left ear.\" He tries to explain so many associations connecting his past to his family to the present to his feelings and his own thought. His mind must have always been racing to find meaning in absolutely everything encountered. That is what makes the Diary of a Genius a piece of work. It was fairly easy to read but exhausting at the same time because I felt exhausted for him. I guess there is no rest for the wicked ONE.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "`Diary of a Genius' is an honest and real study of the world's most acclaimed surrealist painter. Rich in imagery, Dali reveals the canvas of his life with candour, colour and masterful composition. Shadows of self-doubt are subtly juxtaposed beside his brilliant self-awareness, and his reflections are a fusion of form and feeling. Many of the entries are poignant, highlighting the painter's melancholic marriage to mortality towards the end of his life. In his final days, he sought neither separation nor divorce from it, accepting the inevitability that the brush strokes of his being would flourish for only a brief period more. Perhaps the most significant entry revealing Dali's resignation is that appearing on page 136:`Cordoba - June19 1986Had lunch today in a fish caf&eacute; on the Plaza del Potro. Table for one. Told the waiter that I had a young man's vision clouded by an old man's eyes. He told me to get glasses. I told him to get stuffed olives. The fish tasted like horse. I was disappointed because it usually tasted like camel. When the bill arrived, I realised I had no money so in lieu of cash I presented a napkin sketch entitled `Apparition of Ungarnished Paella Being Mocked by Pablo Casals on Beach'. The waiter gave me an inferior Picasso self-portrait on drink coaster in lieu of the change.I no longer feel at home with human beings so I think I'll move to New York.'This remarkable book is a work of genius about a genius' work",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Hilarious and captivating!A rollercoaster ride that twists and turns through the mind of Dali offering cohesive dialogue and thoughts blended with undecipherable rants and hallucinations. This book gives the reader an intimate view of an artistic genius through the eyes and actions of Dali. He walks a thin line between genius and madman, mostly the latter. If it were not for his beloved wife Gala there would be no doubt in my mind that he ever would have become anything close to a genius. Gala gave Dali order, anchored him in the real world and created the force behind his paintings.Dali was definitely the master of creating hype. No matter what he was doing, there would be scandal, controversy and snobbery, as he refers to it. Dali created spectacle from his home in Port Lligat, Spain to his frequent travels to New York and Paris. He was loved by those he reviled and despised by those people he loved primarily Picasso and his own father. Obsessed with bowl movements, buttocks and rhinoceros horns Dali often relied on these images to create the meaning behind his works.By far one of the best speakers, Dali manipulated his audiences into accepting his approach and ideology on Surrealist art and artists. The media even listened and published numerous articles in newspapers and magazines on the happenings of his life's art. Often playing both sides of a situation, disagreement or battle, he always comes out on top still remaining allies with all parties involved.I would recommend taking the two or three nights it would take to read this book and jump into the mind of this Surrealist genius/madman, Dali. If you hold on to the end you will experience the revered irrational mindset of this artisan and forever hold a new understanding of Dali's revolutionary ideas and works.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is a far cry from the inspired, megalomaniacal lyricism of 'The Secret Life' (flip through the passages on America, which rival Apollinaire in their infectiously effusive enthusiasm). Instead, what we have here is an 'anecdotic' (Dalian neologism), haphazard pasti...che of pseudo-Jarryian slapstick, right-wing posturing and pointless self-aggrandizement. The sole redeeming section of the book, which speaks about Dali's relationship with Rene Crevel, is, as one might expect, refracted through Dali's emotional evasiveness and dissimulation. The rest of this book, it has to be said, is flimsy and insubstantial.Also of marginal interest are his rather fragmentary notes on his rupture with the Surrealists- again, as with his intimations on Lorca and Crevel, one discerns between the lines a muted admiration for Breton that persisted throughout Dali's life, suggesting the ambivalence and guilt that Dali felt toward the Surrealist movement following his expulsion. I believe this gives the lie to Dali's repeated insistence that Surrealism was an asphyxiating straitjacket that he outgrew over time. It is perhaps tragic that we learn very little about other people in Dali's scribblings, so inexorable is his need to reduce others to being mere signposts punctuating his interminable pilgrimage toward genius. What results is a solipsistic slew of hackneyed jokes, an endless gag reel with canned laughter.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "brancusi great modern masters",
        "description": "Traces the life of the Romanian-born sculptor, discusses the influences on his work, and shows examples of his sculpture",
        "authors": "['Eric Shanes']",
        "infoLink": "http://books.google.com/books?id=q-YGRCIRe3IC&dq=Brancusi+(Great+Modern+Masters)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I was looking forward to receiving this book but was disappointed. It did not provide any more than a few visual cues on the artist's best known pieces. I had hoped for notes on his start, inspirations, and other less known pieces of artwork.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "this a very modest summary on brancusi's works. it's rather superficial and at times it's wasted on tangents of little value--such as the reference to brancusi's sexuality.i gave it 2 stars mostly for the photo reproductions.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "paul gauguin a complete life",
        "description": "Explores the often contradictory history of artist Paul Gauguin, considering the scandalous rumors that surrounded him, the inspirations for his work, the influences of his contemporaries, and his painful death. 12,500 first printing.",
        "authors": "['David Sweetman']",
        "infoLink": "http://books.google.com/books?id=o4PqAAAAMAAJ&dq=Paul+Gauguin:+A+Complete+Life&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am disappointed to see that this book is out of print but if you have any interest in Gauguin whatsoever, you should try to get your hands on a copy. This is such an excellent book! Mr. Sweetman has clearly done his homework and he writes beautifully. By the time you finish this book you will feel as though you knew Gauguin for, as much as such a thing is possible, Mr. Sweetman gets you inside the artist's head so that you know what he was thinking and what he was feeling at all the important points of his life. The author gives a very balanced view of Gauguin and of the important people in his life, including his wife Mette. Gauguin is not portrayed as a saint. Mr. Sweetman does not let him off the hook for the shabby way he sometimes treated his friends and family. In other words, this behavior is not excused just because Gauguin was a brilliant artist. On the other hand, Gauguin is not demonized for his irresponsible behavior either, as he sometimes could be a caring person and a good friend. Gauguin left notebooks and correspondence, so when Mr. Sweetman gives you his interpretations of the meanings of some of Gauguin's greatest paintings he is not whistling in the dark. Gauguin himself is oftimes present to tell you what he was trying to do. One of the nice things about the book is that it does not focus exclusively on Gauguin. You learn what what was going on in the Paris art world. There is interesting information given about other artists, such as Camille Pissarro and Emile Bernard and you also learn about some of the art dealers, such as Durand-Ruel and Vollard. You are given in depth information of what was going on in the French communities on Tahiti and in the Marquesas. Mr. Sweetman also provides a sympathetic and reasonable explanation for Gauguin's behavior following the death of Vincent Van Gogh. As Mr. Sweetman says in the book, the picture most people have of Gauguin is based almost completely on the portrayal by Anthony Quinn in the 1950's movie &quot;Lust For Life&quot;. If you read this wonderful book you will get a much more well-rounded picture of what this very complicated man was truly like.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is a disturbing story. My previous knowledge of Paul Gauguin basically came from a subway ad for the New York School of Visual Arts, which stated that at age 35 he was working as a bank teller. Being a late-bloomer myself, I wanted to know more. Although this is a long book (565 pages of text plus notes and index), it never got tiring for me. I remained fascinated all the way through. Gauguin created some wonderful works, but I really would not want to have known him. He comes across as very childish and irresponsible (which is perhaps a characteristic that all artists share to some degree). His journeys to Brittany and the South Seas are rendered in detail as Sweetman unflinchingly documents Gauguin's descent into drug addiction, madness and destitution. Sweetman also deftly analyzes Gauguin's work and the impact of those influences, creating a vivid portrait of the artist and his world. Parts of the book are horrifying, especially the descriptions of Gauguin's syphillis-ravaged body. Gauguin was a strange man and his story is an unsettling one. I strongly recommend this book to anyone with an interest in Impressionist and Post-Impressionist art. The book has many black-and-white photographs of Gauguin and his milieu as well as color reproductions of several of the works discussed. This book will guarantee a deeper appreciation of Gauguin's work.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "In terms of scholarship, this is an excellent biography; it's very thoroughly researched about Gauguin's extended family and his upbringing; his marriage and other relationships. However, there were times that I found the author's voice too intrusive. For instance, when describing Van Gogh's and Gauguin's nine weeks' residence together at Arles, I felt the author needed to stop referring to Van Gogh as a \"madman\".Then again, there was some unnecessary speculation regarding Gauguin's allegedly erotic feelings for his little daughter, Aline. I sincerely dislike when quick-fix psychology is used by an author who's 'analyzing' an artist's paintings, and 'meanings' are assigned thereto. One man's: he's-got-a-little-girl-fixation-because-she's-painted-sleeping-in-her-bed-with-her-back-turned-toward-the-viewer, is another's: It's a portrait of a sleeping child. Mary Cassatt once portrayed a little girl who's flopped into an armchair with her legs slightly open; does that portrayal make her a potential pervert, too?The author seemed to veer from admiration for Gauguin's artistic accomplishments to an almost mocking tone regarding the (again) 'meanings' of the Tahitian paintings (and/or injecting a tone of derision when describing Gauguin's life in Tahiti). My point is, a better biographer would take an objective view of his subject; this one, about 70% of the time, doesn't.I also wish more, and/or clearer, larger reproductions of Gauguin's work had been included with this volume. Other than these provisos, I found this a well researched and readable biography.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "7 reece mews francis bacons studio",
        "description": "This is a photographic portrait of painter Francis Bacon's south London studio in the days following his death. A visual statement of Bacon's frenetic life and work. 60 photos.",
        "authors": "['Perry Ogden']",
        "infoLink": "http://books.google.nl/books?id=gNFyQgAACAAJ&dq=7+Reece+Mews:+Francis+Bacon%27s+Studio&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Views of the studio at 7 Reece Mews in South Kensington, London, where Francis Bacon spent the last thirty years of his life from 1961 - 1992, inform us of many aspects of Bacon's life and art. The studio is notorious among artists' studios in that it is nearly non-navigable, so strew are the walls and floors and easels with the memorabilia and photos, drawings and articles that ultimately resulted in some of the most exciting art created in the 20th Century.This very fine book represents a catalogue of the project to move Bacon's studio intact to Hugh Lane Gallery in Dublin where the curators have seized on documenting every tube, brush, tossed away sketch, collaged photos, small reproductions of famous artists' works (such as the Velasquez popes), bits of cloth and canvas, and photos of his models, his lovers, and his associates - a daunting task but one so important that it takes this book to define.Richly photographed by Perry Ogden who manages to capture the atmosphere of claustrophobia that pervades the studio, this book is indispensable to the scholars who find Bacon's visual influences as important as his paintings. The writing that accompanies this photographic essay is highly informative and immensely readable: Gallery Director Barbara Dawson offers a probing insightful examination of Bacon's personal and artistic history in 'Francis Bacon's Studio: A Stimulating Solitude' and the Curator of the Francis Bacon Collection essays 'Finding order in chaos: Francis Bacon's Studio contents'.Though the book is small (61 pages) it is of utmost importance to those fascinated with the expressionist art of Bacon. An added bonus is a brief but thorough Timeline of Bacon's life. Highly Recommended. Grady Harp, January 06",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "An unusual, beautiful little book for the shelves of Francis Bacon fans. The photographs are beautiful, exhaustively document this legendary, but little known space, and have a haunting quality that complements other Bacon monographs. One senses the vibrancy of the artist's life, and only then the realization that, but for the fact he is deceased, the reader would not be holding this book and having this &quot;privileged&quot; view. Very strange!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the sculpture reference contemporary techniques terms tools materials and sculpture",
        "description": "With 1,187 color images representing 288 contemporary sculptors, this is the most comprehensive and up-to-date single volume sculpture reference available. All aspects of sculpture are alphabetically arranged, visually demonstrated, and easily readable. The design and multitude of color images make this book easily understood and enjoyed by all levels of readers. Measurements are in English and metric terms.",
        "authors": "['Arthur Williams']",
        "infoLink": "http://books.google.com/books?id=X3QYAAAAIAAJ&dq=The+Sculpture+Reference:+Contemporary+Techniques,+Terms,+Tools,+Materials+And+Sculpture&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Sculpture Reference by Arthur Williams is a phenomenal achievement. An enjoyable and educational book that I find quite inspiring. Living, contemporary, working - sculptors; what an excellent set of criteria for the inclusion of the over 280 artist whose work is displayed in the over 1,100 color images within this hefty 512 page book.The quality of the photography is excellent in every case. The alphabetical structure of the work lends a nice rhythm between materials, techniques and the results that can be achieved with them, in another words it is a good read for the serious sculptor.The most impressive aspect is his selection of unique sculpts; the diversity of which is almost unbelievable. This handsome book already has a few scares from knocking around my studio. Almost every person that has opened it has ended up going from page one to the back cover one page at a time. Most of these people not sculptors mind you, just everyday Jane and Joes that are drawn in. I have many instructional videos and books on sculpting and sculpture, but this one book could replace half of them as an effective educational tool.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "This hefty volume is an indispensable addition to any sculptor's reference shelf. With what seems like over a hundred fascinating color photos of sculptors at work, work in progress in all sculpting media, excellent finished pieces, this book is a joy to have. As a sculptor and art educator, I have accumulated an extensive library of books in this area. This is one that I had to squeeze into its rightful place on my most used shelf. Whether you are starting out or are a professional sculptor, you'll want to own this volume. And don't loan it out to just anyone, if you want to see it again!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a increadable book as a referance for sculpture. It is truly a dictionary of the terms for the profession. Beautiful photographs are through out the book. I would recommend it as standard reading for anyone who is looking at doing sculpture a full time profession.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "origins a short etymological dictionary of modern english",
        "description": "This Etymological Dictionary gives the origins of some 20,000 items from the modern English vocabulary, discussing them in groups that make clear the connections between words derived by a variety of routes from originally common stock. As well as giving the answers to questions about the derivation of individual words, it is a fascinating book to browse through, and includes extensive lists of prefixes, suffixes, and elements used in the creation of new vocabulary.",
        "authors": "['Eric Partridge']",
        "infoLink": "http://books.google.com/books?id=TGYkAQAAMAAJ&dq=Origins:+A+short+etymological+dictionary+of+modern+English&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you have any interest at all in English etymology, you MUST HAVE THIS BOOK. Beg, borrow, bid, phone every used bookstore you can find -- do anything to get a copy of this book. This book is so good that when I came across a copy of it and skimmed it, all I could do was look back with new regret at the years I'd spent using other works I could now recognize as inferior.This is simply the best book on English etymology I've ever seen -- beats the earlier etymological dictionaries by Skeats and Weekley hands down, and of course is superior to any normal dictionary's treatment of etymologies (OED, Merriam-Webster, etc.).",
                "review/helpfulness": "44/44",
                "num_reviews": 44
            },
            {
                "review/text": "Over thirty years ago I begun developing the habit of consulting etymological dictionaries whenever I wanted to deepen my understanding of words. I equipped myself with several etymological dictionaries in each of the three languages I use: spanish, french and english (which share many words). Over the years and independently of the language that triggered a given search, I found myself increasingly going FIRST to Partridge's ORIGINS (acquired in 1977) and often feeling no need of consulting another dictionary.Quite a number of years comparing etymological dictionaries! Hence I agree, it should at least be reprinted or, hopefully, edited anew after improvement by a team of experts knowledgeable of more recent research in the field.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "If you love the English language and are truly very curious about the meanings of its words as reflected in the evolution of its origins and meanings, this is a &quot;must have&quot; book. I have used the 1966 issue of it for years now, and rate it more useful, although a companion book, to the seminal work of Walter Skeat. No library can realistically be said to be complete,nor can any lover of the English language, without both of these works.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "Please bring it back and put one under the pillow of every lover and liker of the language of Shakespeare and Milton. (Or, check your local used bookstore when you're feeling lucky.) My favorite book on English etymology.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "First of all, the text itself is great, and I have little doubt that the paper edition is unproblamtic. My comments here apply only to the Kindle edition. The people who edited this fine text for the Kindle must not be Kindle users themselves. I recently needed the etymology of the word 'much.' However, the only way to get there is to do a search for the word 'much,' and of course, this produces 30 pages of hits, each with six results, or 180 all together. For each, the Kindle displays limited context, so you can rule out some of them, but others looked like the possible entry. After a few false hits, I finally arrived at the actual entry (from the 15th page of results), only for it to refer me to the entry for 'master.' This dictionary is full of such cross-references, which is fine except that they are not hyper-linked, so you will have to do another search or try to find the correct hit amongst the current search results. Thus we have a dictionary with no proper way to look up words. It's an extremely small minority of dictionary-users who read the tome cover-to-cover, and it's unfortunate that the Kindle edition was prepared in such an effortless manner that only such people are inconvenienced.I implore the publisher to take this into consideration. Kindle editions can be revised and re-downloaded at no cost to the user, and I request such a revision. Kindle dictionaries actually have a look-up function which was not used for this product.Weigh this complaint against the fact that this is a US$60 purchase and not the $9.99 that most non-academic Kindle books are priced at. I don't mind paying more for scholarly work (and fortunately my purchase came out of grant money, which is the only reason I'm not returning it), but given that the author has been dead for over 30 years, this is an awful lot of money to be going to editors who didn't do enough work on the Kindle edition to justify their job titles.If the dictionary is revised in such a way that looking up words is a task easily accomplished, I will happily remove this review and replace it with the glowing review that the text itself deserves. I certainly don't think that the ability to look up words in a dictionary directly is an unreasonable request nor do I think implementing such a method would be difficult for the publisher as it involves a function the Kindle already provides but which the publisher didn't use.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I found this difficult to read, at first, because of the abbreviations used (literally 100's of different ones throughout the book) in each definition, but caught onto them over time. You get used to flipping to check the key when an uncommon abbreviation comes up. Once I became accustomed to that....it really opened up a wealth of knowledge.This is a great resource, and highly recommended for anyone deeply interested in Etymology. It contrasts nicely with the online Etymology dictionaries, since the information offered in the book is a bit more in depth. The book also does a better job of cross-referencing related words than any website could.It's an older book (the author died in 1979), but the information in here never gets old. The new print is pricey, but you can pick up used copies for a fair price. It's a great addition to any reference shelf.Highly recommended, if you are an Etymology geek.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "For the price, this book should have sewn signatures. In a few years, it is going to start losing pages. I worked in libraries for years and this is not just \"opinion\". It is a shabby way to present an otherwise wonderful reference work.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Webster's cites for 'filibuster': ...freebooter, a member of a deliberative body who obstructs action by use of dilatory tactics such as speaking merely to consume time...\". Eric Partridge's 'Origins' digs deeper to find that 'freebooter' derives from 'booty' meaning to take as plunder and thence through a Spanish re-spelling to 'flibustero' thereby to the English 'filibuster'. A roundabout but fascinating look at how our politicians plunder our valuable time. Now aren't you glad your time has been so plundered?Eric Partridge's book 'Origins' will take you on such a journey through our language and across time again and again. Enjoy it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "selfportrait",
        "description": "A rich, penetrating memoir about the author's relationship with a flawed but influential figure-the painter Lucian Freud-and the satisfactions and struggles of a life lived through art. One of Britain's most important contemporary painters, Celia Paul has written a reflective, intimate memoir of her life as an artist. Self-Portrait tells the artist's story in her own words, drawn from early journal entries as well as memory, of her childhood in India and her days as a art student at London's Slade School of Fine Art; of her intense decades-long relationship with the older esteemed painter Lucian Freud and the birth of their son; of the challenges of motherhood, the unresolvable conflict between caring for a child and remaining commited to art; of the \"invisible skeins between people,\" the profound familial connections Paul communicates through her paintings of her mother and sisters; and finally, of the mystical presence in her own solitary vision of the world around her. Self-Portrait is a powerful, liberating evocation of a life and of a life-long dedication to art.",
        "authors": "['Celia Paul']",
        "infoLink": "https://play.google.com/store/books/details?id=wFnEDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I love this book. Gene Tierney tells her story and comes acrossas a brave and intelligent woman. She speaks candidly about hermental illness, her marriages, her family. Poor Gene...her first daughter was born retarded and had to be institutionalized. Her first marriage fell apart and she lost her grip on her sanity, but she bounced back. She married Howard Lee and her second child (by first husband Oleg Cassini) was born healthy. Today Gene might not be a household name, but she should be...if you read this book you will see why. Great book beginning to end!",
                "review/helpfulness": "50/50",
                "num_reviews": 50
            },
            {
                "review/text": "When I asked Amazon to locate this book for me it was as a result of watching Biography on A &amp; E. After presenting their program on Gene Tierney, they told viewers about the book. I was extremely pleased that Amazon located a copy for me even though it was out of print. Not only was I pleased to obtain the book but I was extremely pleased with its content. I have been a fan of Miss Tierney since first seeing her in movies. I especially liked &quot;Laura&quot; and &quot;Leave Her to Heaven&quot; and have videos of both. But nothing can compare with the intimate details she revealed in her life story and I shall treasure the book always. Unfortunately she was swept up in the dark side of the motion picture industry where she was taken advantage of in so many ways. Although we, her fans, were cheated when she retired from motion pictures so soon, I cannot help but feel she did the right thing by turning her back on the sad memories brought about during those years and seeking a happier life. The book ranks high on the list of treasures in my personal library.",
                "review/helpfulness": "39/39",
                "num_reviews": 39
            },
            {
                "review/text": "Called the most beautiful woman in movie history by Darryl Zanuck (founder of 20th Century Fox), actress Gene Tierney also proves herself a good and insightful writer with this accomplished &quot;self-portrait&quot;. I purchased this on a whim in an antique store, and have read it several times. I appreciate her honesty regarded her psychological problems and the fun tidbits about Hollywood life in the 1940s. It's unfortunate that the name Gene Tierney is so unfamiliar these days. She was a talented actress and writer, and I enjoy her work very much.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book is told by Gene Tierney herself. She tells about her childhood through her later years living in Houston, Texas. She lived an exciting life but paid the price for it with many terrible tragedies. She shares her deep, dark secrets of her life. It is an extremely wonderful book. I am a huge fan of Gene Tierney. You must read this book. You will not be able to put it down!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "It's a shame that this book is out of print, as it is a very brave autobiography by a remarkable woman. Gene Tierney, one of the most stunning-looking actresses to come out of the Hollywood studio system, had a bright and privileged start in life, and made many high-quality--and a handful of true classic--motion pictures, but her middle life was beset by tragedy, divorce and mental illness. She holds little back in this book, and includes details of her 30-some-odd electroshock treatments, her daughter's mental retardation, her many affairs (with some surprisingly well-known names, including Howard Hughes and John Kennedy), and her hard-found happiness in her later years. Tierney writes simply but effectively, and the net effect is a picture of a courageous woman fighting against the odds and winning. Highly recommended for all fans of the actress and old-timey movies in general.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I had seen some old movies with Gere Tierney and even purchased some from Amazon. While brousing the TV channels I came across a biography of Gene. This left some unanswered questions so I ordered the book. It was a great read and very informative. I did not know that the Agatha Christy novel \"The Mirrow Cracked\" was based on Gene Tierneys life.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I got this book because I am very interested in manic depression (or bipolar disorder) and I knew Gene Tierney had gone through the illness. My purchasing this book also had to do with my admiring Miss Tierney as an actress, for giving astounding performances in films like \"Leave Her to Heaven\". What I found was not only a fascinating read written by an honest and courageous lady, but also a very well written account of a victim of MD. I learned many things from this book and I must say, Miss Tierney was extremely honest, chose her words well, and most of all, wrote about famous celebrities like her former husband Oleg Cassini as well as former boyfriend John Kennedy without showing any negative feelings towards them. She writes with such class and frankness, making this a must for every fan of her work.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is a lovely autobiography by a beautiful woman and one of my Daddy's favorite actresses. Dealing with depression myself, I can certainly relate to her trials of trying to continue with a \"normal\" life by all outside appearances, but constantly struggling on the inside. Lovely and touching story. Highly recommended.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "warhol the biography",
        "description": "The definitive biography of a fascinating and paradoxical figure, one of the most influential artists of his-or any-age To this day, mention the name \"Andy Warhol\" to almost anyone and you'll hear about his famous images of soup cans and Marilyn Monroe. But though Pop Art became synonymous with Warhol's name and dominated the public's image of him, his life and work are infinitely more complex and multi-faceted than that. In Warhol, esteemed art critic Blake Gopnik takes on Andy Warhol in all his depth and dimensions. \"The meanings of his art depend on the way he lived and who he was,\" as Gopnik writes. \"That's why the details of his biography matter more than for almost any cultural figure,\" from his working-class Pittsburgh upbringing as the child of immigrants to his early career in commercial art to his total immersion in the \"performance\" of being an artist, accompanied by global fame and stardom-and his attempted assassination. The extent and range of Warhol's success, and his deliberate attempts to thwart his biographers, means that it hasn't been easy to put together an accurate or complete image of him. But in this biography, unprecedented in its scope and detail as well as in its access to Warhol's archives, Gopnik brings to life a figure who continues to fascinate because of his contradictions-he was known as sweet and caring to his loved ones but also a coldhearted manipulator; a deep-thinking avant-gardist but also a true lover of schlock and kitsch; a faithful churchgoer but also an eager sinner, skeptic, and cynic. Wide-ranging and immersive, Warhol gives us the most robust and intricate picture to date of a man and an artist who consistently defied easy categorization and whose life and work continue to profoundly affect our culture and society today.",
        "authors": "['Blake Gopnik']",
        "infoLink": "https://play.google.com/store/books/details?id=W12kDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Victor Bockris' biography is sympathetic to Warhol's supposed contrived personality. The reader gets the impression that the author, who had a personal association with Warhol, really understood the facination his subject maintained for his adopted country (the U.S.) throughout most of his working life. While others tend to dismiss Warhol as a simple poseur Bockris relates his wide-eyed enthusiasm for the consumer society. While some have suggested he was manipulative, this biography suggests that he was slightly naive. Most of his life is covered here and, although there is documented proof of some interesting associations that are not touched upon, in general the work is broad in its scope and the reader will discover that the most notorious pop artist of all had far greater depth than his blank features and fickle comments suggested. It is also a feast for those interested in good gossip and the social history of the 60s and 70s.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "As a huge fan of this fascinating man who blured the line between art and commerce, I was looking for a well written bookthicker than a brick that would reveal once and for all the mystery that is Andy Warhol. Im still looking, the definitive Warhol bio is yet to be written it seems, but in the meantime I'll settle for this Bockris book which is a sound overall portrait of the artist and his life. Starting from his poverty and illness stricken childhood in an industrial town in Pennsylvania the author breezily tours the reader through hiscollege life, and his subsequent move to New York to become a highly successful (and paid) graphic artist, before establishing himself as one of the founding pioneers of pop art. From there we take rollercoaster ride through his film making years at the Factory, his subsequent shooting, and the time he spent as a socialite and portait artist in the last two decades of his life. Some light is shed on the issues concerning Andy's sexuality, Catholicism, monophobia, work ethic, short livedintimate relationships, shopoholism, and his seemingly aloof public persona.Though Bockris rightly bestows more pages to Warhols peak years as an artist in the sixties, he skims the later decades of his life. As with his Lou Reed biography, Bockris has a tendency to demonize his subjects towards the final chapters of his works. Try as his he might here, his weakly supported insinuations of Warhol as a cold and manipulative character are more a reflection on the authors ownfeelings of insecurity, rather than their being any intrinsic truth in the matter. There is a middle way between sycophantism and character debasement, and Bockris obviously hasn't found it. It's adequately written, albeit unimaginatively, and it takes real effort on part of the reader to stop turning the pages. As it stands, a fine Warhol primer, but for those with an inquiring mind, this book will probably raise more questions than it answers.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Bockris was a friend of Warhol, at least for several years. He shares a lot of detail but what seems to stand out in this biography in particular is that:* Warhol had a lot of boyfriends, none for long, and he was ridiculously jealous.* Warhol used people no end and generally didn't pay those who worked for him.So I was left at the end with a decidedly negative impression of Warhol.I'm suspicious. It didn't seem that Bockris explained how someone so creepy was able to get some many talented people to work with and hang out for him. All to be a part of the Warhol scene? For expectations of fame, money, connections? I don't know. I do know companies with a little liked leader. Still, it left me wondering if Bockris had something in for Warhol. I don't doubt there's some truth in Bockris' account of Warhol with boyfriends and assistants but I can't tell how much. Instead of resolving who Warhol was, this book makes me also wonder who Bockris is and leaves me seeking other books to learn more about Warhol.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Now out in a new edition, Victor Bockris' WARHOL is a very solidly written and researched biography. In particular, the first half creates an extremely detailed portrait of Warhol's Pittsburgh youth; this adds a tremendous amount of context and depth to Warhol's own work, and the meanings and symbolisms of that work will gain new clarity after reading through some of Bockris' book.Unfortunately, the book gets less detailed and more gossipy later on - Warhol's many flaws are underlined again and again, but Warhol surrounded himself with other highly creative people who launched interesting careers of their own - Paul Morrissey and Lou Reed both spring to mind - and Bockris does little or no investigation of Warhol's influence upon them, and any actual ideas just seem to get lost here amid the varied bits of gossip.-David Alston",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The first half of this book is invaluable for the intimate infomation that it gives on Andy Warhol's early years. It is very sensitively written and thoroughly engaging, though the latter years are sort of run through at the speed of sound. That would be the only criticsm I have of this book but you can flesh out the facts (from Andy's view) by getting a copy of the Andy Warhol Diaries. Otherwise it's a really great book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "curly an illustrated biography of the superstooge",
        "description": "While the Three Stooges were the longest active and most productive comedy team in Hollywood, their artistic height coincided with the years Curly was with them, from 1932 to 1946. Famous for his high-pitched voice, his \"nyuk-nyuk-nyuk\" and \"why, soitenly,\" and his astonishing athleticism, Curly was a true natural, an untrained actor with a knack for improvisation. Yet for decades, little information about him was available. Then, in 1985, Joan Howard Maurer, the daughter of Moe Howard and the niece of Curly and Shemp, published this definitive biography. In addition to speaking at length with his relatives, friends, and colleagues, she amassed a wealth of Curly memorabilia, a mixture of written material and rare photographs of Curly's family, films, and personal life. In Curly, she put it all together to come up with the first and only in-depth look at this crazy comedic genius. She included plenty of intimate details about his astonishing relationship with his mother, his three marriages, and his interactions with his daughters and friends. The result was a well-rounded portrait of the most unpredictable-and most popular-Stooge. Joan Howard Maurer is the daughter of Moe Howard, the leader of the Three Stooges. Her books include The Three Stooges Scrapbook (with Jeff and Greg Lenburg) and The Three Stooges Book of Scripts. Michael Jackson, now recognized as the most successful entertainer of all time, often spoke of his love for the Three Stooges.",
        "authors": "['Joan Howard Maurer']",
        "infoLink": "https://play.google.com/store/books/details?id=iZ9uAAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Joan Howard Maurer gives the reader a very in-depth look into the life of her famous uncle. Curly's brilliance as a comedian is evident in her well-written biography. She also does quite well at showing that Curly was a shy, private person when &quot;off-camera&quot;. A great book for anyone who loves the Stooges!",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "I just read this book, and while it does give alot of good information about Curly, it is very sad about his life. Some of the people say some kind things about him, while others, including his ex wife and a couple of others, just bash him. He was a very shy, very to himself person and to some people that meant he was a mean person. I do recommend it to anyone who loves Curly as much as I do, but be warned, there are some pretty mean things said about him and some things you would of had no idea about his life. But all in all he was a brilliant genius in what he did no matter what anyone says about him.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I could not put this book down after opening the first page and read it through from 6AM until 9:30 PM (EST) What I find amazing is that the author was able to re-connect with everyone involved with Curly in real life (x-wives, daughters, etc.) and that no one, not even his wife knew who he was. The point, I truly believe, is because he was Curly a character and he never was anything else! He lived the character Curly! He is basically put down and ridiculed by everyone who is contacted by Ms. Maurer and we find he never had a real friend except his dogs. That fact in itself shows what kind of person he was. The world scared him, people probably tried stealing his soul because of his genius and fame and he hid inside this persona of Curly. My advice is buy this book before it disappears because you will never find a better investigation into the life of the most amazing of all comedic talents the world ever knew - Jerome \"Curly\" Howard. Oh, he was special alright and I think this is the only sore point in the book, Ms. Maurer tries desperately to find some meaning about his adult life that would make him a \"regular\" guy and there isn't, so the book comes off like a let down of Jerome/Curly the man. For example, numerous times I hear the author ask her interviewees, \"Did you ever see Curly read a book?\" As if that would make him a smarter person (which I would think so too) but that stuff doesn't matter. He was a living legend who played by his own rules. In the final analysis, what does it matter and yeah, we want to know these facts and see behind the \"star\" but it is always disappointing to find out the truth about who \"Legends\" really are. Let us just celebrate their talents and love them for what they gave us, in this case, laughter! In a world as sick and cruel as ours, Curly should be given the highest award for taking us out of the mundane and bringing us into a world of fun and laughter! That my friends takes enormous talent. Curly did it at every second on film. EVERY SECOND!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Curly Bio : Factual, Wonderful Rare photos not seen elsewhere.Despite Heinous, ill placed, \"Illustrations\" within, we are forced to buy this bookonly because we love Curly.Now I remember why i did not buy this volume new, at Kroch and Brentano in 1980...Buy it because you love Jerome Horowitz, Moe and Shemp's baby brother.The photos, again, are precious.Buy it despite the less than amateur book design and illustrations.... which areas distracting as Muddy Combat Boots on a new bride.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "One of my favorite \"Show Busines\" books! I found that it did not have alot more information than I could gather elsewhere but the layout and concept are quite engaging.To me, the real selling point was in the chapter reminiscing about Curly's last few years in retirement (or semi-retirement) - considering he did two cameos, one used the other, not used. Relatives sensitively recall Curly's struggle, the ups and downs, the \"new\", shall we say, \"domesticated\" comedian - it surely seems he was *typecast*!Another guaranteed \"hook\" is the many rare photos taken in that 1946 to approx. 1950 period (hard to determine the probable date for some of the shots). It's a bittersweet experience for the deep fan (like me) who wonders why the actor could not be part of more of the films, in cameos, or in limited spots as the \"Fourth Stooge\".The book does not go into detail about that reported idea, \"The Four Stooges\", a presumptive plan to expand the act during a time in the late '40s, when Curly was doing okay. There's nothing about Columbia Pictures insistence that he continue despite ill health (1945-46). And finally, there is zero about that mysterious second cameo from which all we have is a lobby card with Curly in costume in \"Malice In The Palace\" and a totally fascinating script extract from The Stooges Journal, Number 6, which reveals a few lines right up his alley.Introduction by Michael Jackson. Another guy with *original* Body English.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the revenge of thomas eakins",
        "description": "Thomas Eakins was misunderstood in life, his brilliant work earned little acclaim, and hidden demons tortured and drove him. Yet the portraits he painted more than a century ago captivate us today, and he is now widely acclaimed as the finest portrait painter our nation has ever produced. This book recounts the artist's life in fascinating detail, drawing on a treasure trove of Eakins family correspondence and papers that have only recently been discovered. Never before has Thomas Eakins's story been told with such drama, clarity, and accuracy. Sidney Kirkpatrick sets the painter's life and art in the wider context of the changing world he devoted himself to portraying, and he also addresses the artist's private life-the contradictory impulses, obsessions, and possible psychological illness that fired his work. Kirkpatrick underscores Eakins's unflinching integrity as an artist and discloses how his profound appreciation of the beauty of the human form was both the source of his greatness and ultimately of his undoing. Nevertheless, the author observes, Eakins has had his \"revenge,\" inspiring a new generation of realist painters and gaining the recognition that eluded him in life.",
        "authors": "['Sidney Kirkpatrick']",
        "infoLink": "https://play.google.com/store/books/details?id=0ZM7O5neeZgC&source=gbs_api",
        "review": [
            {
                "review/text": "I'm a fan of Sidney Kirkpatrick's writing.In previous efforts that I've read he has revealed (usually having in fact discovered) amazing true drama from the lives of little known individual heroes in the middle of well-known enormous events; the story of an archeologist who happened upon the largest Pre-Columbian Peruvian art discovery, the story of a disenfranchised marine biologist who took on one of the largest drug dealers in the 1980's cocaine traffic trade, the story of a 75 year old film director who tried to resurrect his career by solving Hollywood's most famous unsolved murder, as well as an amazing biography of the Michael Jordan of psychics- Edgar Cayce. Kirkpatrick has a knack for identifying and tackling great drama and he writes it beautifully to boot.I knew of Thomas Eakins from his paintings of rowers on the Schuykill. From Kirkpatrick I was more properly introduced to Eakins and learned that he was a fiercely independent genius who was castigated, disgraced and impoverished.The Revenge of Thomas Eakins is an apt title. Eakins was just far too ahead of his time.Kirkpatrick's effortless style and attention to detail really drops you right into the mid to late 1800's, comfortably sharing the historical context along with development of Eakins.I recommend you read this one right away.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "I highly recommend this well-written, balanced biography of Thomas Eakins. It would be a perfect choice for readers with any level of familiarity with Eakins' paintings. I agree with the other reviewers that the book does an excellent job of placing Eakins' work in its historical context. Eakins emerges as a fascinating personality, and a guy who would have been great to know. In my opinion, Kirkpatrick deals honestly with the controversial aspects of Eakins' character, but without dwelling on them ad nauseum.I thought that the descriptions of the paintings themselves were especially effective. The book communicated exactly the information I wanted to read about for paintings like The Gross Clinic and Max Schmitt in a Single Scull: the main points of the design, the background and tecnhical details, the dramatic impact, and the pyschological levels. I have read very few biographies of artists that were this helpful.The book is generously and beautifully illustrated. There are 42 color plates, and each of those paintings is described in detail in the text. There are also a number of drawings, sketches, maps, and photographs (some taken by Eakins, and others of Eakins and his family and friends). The photos in particular (such as the one of Eakins, himself nude, carrying a nude female toward the camera) underscore the independent and controversial aspects of Eakins' character.This was a very enjoyable read, and a tribute to a great artist.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "When I picked up this very well done bio the little I knew about Eakins was the wonderful scull portraits, the shad fishing pictures and that a vague scandal surrounded his name. Now having read almost 500 pages, I want to know even more and there is a lot more to know.Kirkpatrick covers the whole life, giving balance to each stage. It is a full book. There is no \"filler\". The research and background knowledge of the author shine forth on every page. The author shows great restraint in sticking to the known facts, otherwise this would be a 1000+ page book!For instance, Eakins' fixation with the body, down to using mechanical contraptions on dead animals to demonstrate movement to students is factually presented. It is not sensationalized or psychoanalyzed. Similarly, whether Eakins was oblivious to or had discounted the consequences of asking so many females (again and again) to pose nude in this Victorian age is not discussed. The known instances of these invitations and the resulting alienation of those who said no, and the alienation of the friends and families of those that said yes are covered. With this background we learn the known facts of the tragedy of his niece Ella, and student Lillian, and about accusations regarding his sister Margaret. There are some documented opinions of family members, but the author stays with the known record.No wonder, the self portrait that adorns the cover shows a tortured man with barely restrained sadness and anger.It's ironic that the lack of appreciation for Eakin's works served to maintain the integrity of the collection for future generations. It's interesting that due to the nondescript Charles Bregler's collecting and acquiring memorabilia of his beloved teacher, today's researchers have a large collection of personal letters, photos and sketches to work with.This is a very readable book. It is rich in plates and photographs that illuminate the text. I am ready for another biography to take on the \"whys\" of this remarkable life.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is really the first book written that tells the full Thomas Eakins biography in context and gives all the details without the kind of filter that sometimes says more about the writer than it does about the subject. Kirkpatrick takes us back to turn-of-the-century America and allows us to see Eakins' life and work in the context of his times--and lets us make up our own minds. It is a wonderful read and an excellent biography for everybody-even those who don't know of Eakins or his work. I loved it!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I find all of Kirkpatrick's books to be great reads. They combine impeccable scholarship with elegant style and profound insight. As I am interested in art, I found this one to be especially powerful -- the first major biography of Eakins that brings this enigmatic man into focus for me. Kirkpatrick has filled in the puzzling gaps in Eakins's life and brought new and unexpected meaning to Eakins's artistic and personal struggles against the conservative art establishment in Philadelphia that denied him recognition in his lifetime.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have read and enjoyed several of Kirkpatrick's other books (on very different subjects), and was eager to see how he would handle a subject as complicated and controversial as Thomas Eakins. Through his telling of the Eakins story, the reader becomes privy to moments of nearly cosmic dimension as well as deep emotion. It's utterly convincing, lucid and intelligent, highly informative and extremely compelling. His most moving book to date.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "A common myth of all poor starving artists is that they will be discovered after they're dead and be venerated forever. In an age when you can get rich and famous by glueing broken crockery to canvas or stuffing a dead fish into a tank of formaldehyde, it is usually a case of a poor choice of publicists than undiscovered talent and the real loser is the poor fool who buys contemporary art for a high price only to watch the value crash when the artist moves on and his work starts to fall apart or rot.But there was a time when truly great artists did suffer. We all know about Van Gogh, but Thomas Eakins was also a classic example. Everyone loves his sports pictures and his two group portraits of heroic doctors lecturing their students (the Gross Clinic and the Agnew Clinic) even make a Christian Scientist envy those who have chosen the medical profession.But for my money, his portraits stake the primary claim to Eakins' greatness. His sitters usually refused to accept their portraits, some destroyed them, others refused to sit at all (Mr. Kirkpatrick quotes one lifelong friend of Eakins who always refused to sit for him because he was afraid that Eakins would uncover what he had spent his lifetime trying to conceal).And I'd imagine that viewing your Eakins-painted portrait for the first time must have been an eerie, almost supernatural event. Looking at his splendid portraits today, you KNOW the subjects, their hardships and triumphs, their hopes and fears. These are not prettified and bowdlerized pictures to hang on a wall, these are the real thing. It is as if Eakins stripped away the skin of his sitters to reveal the pure psyche underneath. They are beautiful and informative and moving. Fifteen minutes with an Eakins is more enlightening than a month in a room of Sargeants.Mr. Kirkpatrick's fine biography is one of the best on any subject. He manages to capture the man and his times and the man IN his times, in a way that few biographers can accomplish. He manages to make the story exciting, even as he takes the reader through an almost brushstroke by brushstroke description of Eakins' painting process.At first, my only reservation was the title. The point of it is to show how Eakins fame after death was his revenge for the tragedy of his career (a close and valued student conspiring to replace him, loss of reputation for insisting on painting things as they are, base and highly publicized accusations [about which Mr. Kirkpatrick carefully assembles the evidence for and against, describing the scandals as fairly and dispassionately as he can], rejection of his works, etc.), but the author discusses Eakins death only two pages before the end of the book, hardly enough time to develop the world's slow acceptance of Eakins' genius.But then I realized that the book itself is Eakins' revenge. Very few people of even the first rank ever have a biography written about them as fine as this one. This book will be read as the classic text for the next one hundred years and it should be read, merely for its quality, by everyone no matter how slim their interest in American painting.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Refreshingly pleasant writing style. I couldn't put it down. Was glad that several color plates included--amazingly, so many art biographies don't include the actual art work.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "errol flynn the life and career",
        "description": "Errol Flynn set the standard for the modern action hero in films like The Adventures of Robin Hood, Dodge City, and The Sea Hawk. This biography follows Flynn from his birth in Tasmania, Australia, in 1909, to his death in Vancouver, Canada, in 1959. Included is analysis of his films, discussion of the 1943 rape trial that changed his life, a survey of the FBI's infamous surveillance, and the first detailed account of his television appearances in the 1950s. First-hand interviews with Flynn's friends and colleagues are complemented by research from FBI files, correspondence, Flynn's diary, and other sources. Illustrated with rare and previously unpublished photographs, the study also gives attention to the historical backgrounds and cultural influences that contributed to Flynn's fame; the work takes an objective and analytical look at the actor's adventurous life. The study includes two appendices: the first is a collection of quotations from various celebrities, from memories of his talent and style to anecdotes about his wild pool parties. The second appendix is a filmography including all Flynn's work for film, stage, and television, with cast and crew information.",
        "authors": "['Thomas McNulty']",
        "infoLink": "https://play.google.com/store/books/details?id=WW5TBQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book rocks! I was given it as a gift for Christmas, and when I first unwrapped it and saw the cover, I was very wary - I said, \"Uh-oh, yet another biography of Flynn?\" I had seen some of the miserable ones written in the past, like Higham's and Bret's, and had feared for the worst. Boy, was I pleasantly surprised! This book took me on a wonderful flight from page one, and I didn't land until the last page, when I was left panting with excitement. Never boring or written with an eye to the pedestrian market, this book challenges and leaves the reader wanting more. It is written with great sympathy to Flynn, and at times some readers might think that it borders on sentimentality , but it never crosses the line. I, like many other readers, are sick and tired of all those quick-buck trash tell-all bios, from Higham to Kitty Kelly, that cater to people's morbid curiosity, but which employ no footnotes or documentation telling the reader where the author has gotten his or her information. Not so here! Mr. McNutly, a scholar in layman's clothing, carefully documents everything he claims, and for this I, and many other readers, will be deeply and lastingly grateful. And by the way, what's with these prattling blowhards who keep complaining - in English (or is that English?) and other languages about the price? I thought that it was against amazon's rules for reviewers! Look, sport, if you can't afford the book, then don't buy it; and if you can afford it, then shut up! I wish I could talk more about all there is in this book to admire, but I don't want to be boring - something that doesn't seem to trouble some of the other \"reviewers\" during their long-winded screeds - so I will simply say, in short, that this book will certainly be of use LONG after the dollars shelled out for it have been totally forgotten. And I am sure that the Flynn family will be very grateful - at long last - for a balanced work about Errol that satisfies both the average reader and the seasoned film scholar/critic. May I join them in expressing profound thanks to Mr. McNulty for his book, and for the great effort he has put into it? Bravo, Sir! May you and your kind increase!",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "The Life and Career of Errol Flynn by Thomas McNulty343 pages including an afterword, 2 appendices, and notes. With 85 photos.Here, at last, is the long awaited biography from Thomas McNulty. Rumored for years and much anticipated. And, IT IS GOOD!For those of you who don't know who Errol Flynn was, you are in for a UNIQUE reading experience. Apart from a film career playing the DEFINITIVE screen hero, there was an EQUALLY exciting, though often enigmatic, off-screen life as well. Here is a very well written, extensively researched, and lovingly created book.Right off the bat, one is greeted with a picture cover (sans dust jacket). And the picture is familiar, but not exactly. It is from the same photo session as the one used for the cover of David Bret's Satan's Angel, BUT THAT is where the similarity ends- THIS BOOK'S cover photo is of a Flynn almost bemused and whimsical, and looking slightly up- found out, so to speak ... as if to hint at what's inside.In the acknowledgements we see many familar names: Olivia de Havilland, Douglas Fairbanks Jr., and Sheldon Leonard (of TV fame), just to name a few. Also, various Flynn collectors, OF ALL KINDS, who contributed mightily to this book. There is also someone named Wallace Berry who gets a nod and if it sounds familiar, you are right in remembering, but also wrong in what you remember- and McNulty gives the final word.The book, itself, is divided into what McNulty identifies as the 5 periods of Flynn's life: &quot;From Tasmania to Hollywood, 1909-1935&quot;, &quot;Hollywood, 1935-1940&quot;, &quot;The War Years, 1941-1945&quot;, &quot;Don Juan, 1946-1949, and &quot;The Wanderer, 1950-1959&quot;. There is also an afterward and 2 appendices. And finally a notes section, followed by an extensive bibliography, and, not to mention, an index.The afterword, entitled \"Of Scrapbooks and Ghosts\", goes into a post death discussion. This section chronicles the biographical efforts, both good and bad, the aftereffects of the bad, his own experiences as a \"known\" Flynn writer, the relatively new introduction of the internet and web sites devoted to Flynn, Flynn's children, and an extended homage to Paul M. James.And who is Paul M. James, you say? A collector, and THEN SOME. Back in 1936, he saw Charge of the Light Brigade, and just started collecting anything having to do with Flynn. According to McNulty: \"... ten huge scrapbooks, each containing thousands of clippings, words and images ... with care given to documenting the published work.\" McNulty further adds: \"Flynn would have appreciated the fact that Paul's magnificent collection fit snugly into several tightly packed vodka cases.\" In crediting James, McNulty says: \"Although I began the research that culminated in this book in 1992, Paul's scrapbooks provided the source material I needed to proceed and often served as the impetus for my own investigations.\"The first appendix is entitled \"Remembrances\", which includes excerpts from some of the familiar published sources: David Niven, Patric Knowles, John Huston, and Kirk Douglas, as well as the less than familiar. There are also excerpts of personal correspondence and interviews with both the famous, and not so, including one of the premier Flynn collectors, Rick Dodd.Appendix 2 takes on the task of a complete filmography, including the minor films, as well as his dramatic television appearances. You may remember that Mr. McNulty is the author of the excellent Filmfax article \"The Forgotten Television Films of Errol Flynn\".And now for the review.I do think this book is absolutely BRILLIANT! Move over A. Scott Berg (Goldwyn: A Biography and Kate Remembered)- you have a true brother in the field.There is both an intimacy and feeling for Flynn and, at the same time, a professionalism with respect to the subject- and yet that's not quite right either ... it's a well-honed tapestry of richness done OVER TIME ... from a journey which began, in McNulty's own boyhood, through an appreciation and enjoyment of Errol Flynn films, to a more serious scholarly effort culminating in the publication of this book.A unique and special touch, was the inclusion of the non-famous, and their witnessing of events. No small feat in hunting some of these people up.I learned so many new things- for one, who was Koets, and who was Swartz? These were early, pivotal figures in Flynn's life mentioned in his autobiography, My Wicked, Wicked, Ways. Are they one and the same, or ...?One particularly maddening thing to me, was the contribution of the late Peter Stackpole (the photographer on the shoot with Peggy Satterlee, Buster Wiles, and, of course, Flynn). Satterlee, you may recall, was one of 2 women who accused Flynn of statutory rape back in the early 40's. Wiles, in his autobiography, My Days With Errol Flynn, was absolute in his denial. As you will see, Stackpole tells a slightly different story, and does he?The film and later television career was also a part of the Flynn story. And this will be particularly satisfying to the reader. McNulty is most adept. He discusses each film and television appearance in some depth plus much behind the scenes detail.I have not spoken yet of the photographs. Let me tell you- they are VERY SPECIAL! Not only do we see behind the scenes shots, as well as some standard CLASSIC movie stills, but there are also many UNUSUAL candids from private collections. These are, of course, best viewed rather than described. But there is one particularly worth noting, and it's with his leading lady in many films, Olivia de Havilland. It is of a very intimate moment between them, but not in the sense you might think- they are holding hands, and talking, and the photo somehow captures the GENUINE friendship and caring between them- it's priceless.Thomas McNulty has carried the effort of a competent Flynn biography further- he has raised the bar of EXCELLENCE. It is a very REAL portrait.I STRONGLY RECOMMEND IT.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "At least 28 books have been written about swashbuckler Errol Flynn. Perhaps the most famous is Charles Higham's 1980 biography. It wasn't the best. This is. Thomas Mcnulty's \"Errol Flynn: The Life and Career\" discards myths and explodes the legends. Using legal documents, court records, newspaper clippings, eyewitness reports, and Errol Flynn's own diary, it concludes with the most accurate(and revisionist) history yet. Errol Flynn was born in Tasmania in 1909. A rebel, he left school at an early age, flaunting his mother's wishes. Literally a South Seas beach-bum at age 24, Flynn was signed as Fletcher Christian in the low budget \"Wake of the Bounty\". Viewed by an agent, Flynn was contracted by Warner Bros. studios. 2 years later he starred in 1935's \"Captain Blood\". By 1938, \"The Adventures of Robin Hood\" had made him a superstar. Handsome and athletic at 6'2\", Flynn charmed pretty actresses and teenage fans alike. He enjoyed Hollywood night-life. But alcoholism and drug-use dulled his senses and tarnished his looks. By the late 1940's, a spectacular film career was spiralling downward. 3 failed marriages produced added stress and financial burden. Errol Flynn died of a heart attack in Vancouver on Oct. 14, 1959. He was 50 years old. For the first time here, author McNulty reviews Flynn's movies and TV appearances in lavish detail. McNulty acknowledges his fine acting in Edmund Goulding's \"Dawn Patrol(1938)\". Using his own money, Flynn bankrolled a lavish Cinemascope version of \"William Tell\" in 1954. But 8 weeks into shooting, the film shut down. Finances had run out. Today, a small Tyrolean movie set exists near Lake Como, Italy. This tourist attraction is all that remains of \"\"William Tell\". 2 dozen reels of the aborted movie are locked away in Boston University's Special Collections Dept..And to this day, \"William Tell\" has never been seen by the public. In 1957, Flynn co-starred in Ernest Hemmingway's \"The Sun Also Rises\". Flynn plays middle-aged playboy Mike Campbell; his performance a haunting, resonant self-parody. In one scene, Flynn sits alone in a darkened European hotel room. Nursing a cocktail, he muses on his life, and drinks-in how it all might have been. The critics went wild. McNulty reviews the 1942 rape trial, and includes almost 100 photos; many rare and unseen before. One of the most intriguing pictures is of Flynn with his idol, John Barrymore, at a Hollywood party. Flynn and Barrymore were both one-time matinee idols. But they shared something else. Errol Flynn and John Barrymore had failed relationships with their mothers. Barrymore's mother died young, and he was raised by his grandmother, Mrs. John Drew(Louisa Lane). On his deathbed in 1942, Barrymore kept mumbling her name: Mummum. In Flynn's autobiography, he wrote \"All my life I have tried to find my mother and I have never found her. My father has not been Theodore Flynn, exactly, but a will-o-the-wisp just beyond, whom I have chased and hunted to see him smile upon me, and I shall never find my true father, for the father I wanted to find was what I might become, but this shall never be...\"This new biography explores the complex, sensitive Flynn as well. His fictional book, \"Beams End\", is a robust, tender tale of sailor/world travellers; searching, searching for the mysteries just around the next lagoon. McNulty's book may almost go to far in defending Flynn's self-destructive life-style, but it doesn't. In the end, it finds compassion, not sentimentality. Sadly, film director Irving Rapper said it best: \"He was a very lucky boy. He had the whole world in the palm of his hand and threw it all away\".",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Errol Flynn, Hollywood's perennial bad boy, is back in yet another book dedicated to uncovering the truth, lies and scandal surrounding Flynn's career. At times eloquent but loaded to the top with trivia and enough background information to drive some readers over the edge. Thomas McNulty's Errol Flynn: The Life and Career often slips into romanticism, particularly when he dashes off lines like \"So it was that Errol Flynn began his life in a seaport, and as he grew he would explore the winds and tides of the seven seas on the sails of his imagination.\" Intelligent and ultimately a tribute in disguise, this is not the usual biography. The price-tag will hold most readers at bay, at least until the publisher finds a way to release it as a mass-market paperback (To my knowledge, McFarland had never released any of their titles as a mass market option). Illustrated with over eighty photographs, including a few rarities, the deluxe hardcover makes it beautiful to look at and for once the text is on par with the essence of Flynn's appeal. The author has left nothing out. He covers the myths and the truths about Flynn's life with an eye for detail. He tackles the controversial allegations perpetuated by Charles Higham that Flynn was both a homosexual and fascist sympathizer dismissively, and perhaps too quickly. But he has other items on his agenda that clearly preoccupied him. It is something of an accomplishment to create a biography so riddled with facts that it remains readable. We witness Flynn's fractured childhood and his teenage years drifting about the South Pacific; all crucial experiences that had a lasting effect. Here is his meteoric rise to stardom, his glory years as the undisputed King of adventure films, the 1943 rape trial that held the public's attention, and his descent into alcoholism and drug abuse. The films are given a good deal of attention, some with excessive detail. Those familiar with the films will be tempted to skim the plot synopsis' but there are rewards for those willing to plow ahead. For example, it was interesting to learn that Flynn felt his role in Four's a Crowd was the closest to his own personality. The velocity and depth of Errol Flynn's experiences make for fascinating reading, a fact that is not lost upon the author. So McNulty, who is obviously infatuated with Flynn's screen performances, ends up plotting his life along historical-sociological-cultural analysis. His book is full of extensive cultural and historical sidebars. This was mildly distracting but the context is appropriate, and it all fits into what the author at one point refers to as \"the tapestry of Errol Flynn's life.\" The poignancy is perhaps a little too obviously intentional, but it works. The world may not have needed another book about Errol Flynn, but this one is worth reading.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is a superior book about Errol Flynn. The range is encyclopedic and the writing meticulous, at points even poetic. Packing an extraordinary amount of information between two covers, McNulty somehow manages to bring to life the much-abused Swashbuckler in the most engaging way. I have to believe that the enormous amount of research that went into this book is a testament to both the author's industry and his status as a budding writer of first-rate biographies. I had no problem at all with the price, which is typical of McFarland; their marvelous bindings and acid-free paper will last for centuries. (By the way, ignore the ranting and raving of the character who keeps leaving the silly \"one star\" reviews - he's well known as an obsessive crank who bears a grudge against the author which is as irrational as it is persistent . This individual, sadly, doesn't read any better than he writes, and, judging from his grammar and spelling, he doesn't do either very often; his speed is comic books.) I found one of the best things about this book to be the photos, which are outstanding, and the bibliography knocks the ball out of the park. Here is a volume that must be given its due: it provides a richly textured, fascinating treatment of an extremely difficult topic, and it should be treasured accordingly. Kudos to Mr. McNulty!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "For both long-time fans and those new to the subject, readers will find Thomas McNulty's &quot;Errol Flynn: The Life and Career&quot; a truly wonderful experience.The author has accomplished an impressive and astounding effort in piecing together a fascinating portrait of Mr Flynn as an adventurer, actor and writer. Mr McNulty's prose style is carefully constructed, poetic at times, captivating and objective. He covers the major points of Mr Flynn's life, and brings focus upon aspects of Flynn that had yet to be thoroughly researched and recorded for publication.Knowledgable enthusiasts of Flynn will appreciate the passages on Flynn's early Hollywood years, particularly the filming of &quot;The Adventures of Robin Hood&quot;. As Flynn's life story progresses, McNulty brings forth much detailed information on various movie productions in which Flynn was cast, and places these in context with developments in Flynn's personal activities. Exactly what a biography should do, indeed.However, to date, no such biography on Flynn has so carefully weaved his Hollywood personna with his private life. The reader will appreciate this process of chronology, and gain a fuller understanding of Flynn's rise and subsequent fall as one of Warner Brothers leading stars.McNulty carefully covers Flynn's trip to war-time Spain; the infamous rape trial; Flynn's FBI dossier; and, curiously one of the more enjoyable portions of the book, Flynn's efforts in authoring his story of &quot;Charlie Bow-Tie&quot;.These episodes, along with McNulty's scrutiny of Flynn's final decade, in which television became a source of both income and exposure for the declining star, bring forth a new viewing of Flynn as a man who lived his life to the fullest, both under the public spotlight as well as away from it.As a fan of Flynn for many years, I greatly appreciate Mr McNulty's work. His meticulous research (well-documented with copious endnotes for each chapter) and first-hand sources are cited for reference. As an added bonus, the reader will much enjoy an appendix of &quot;Remembrances&quot;, which contains impressions of Flynn by such notables as Kirk Douglas, Gene Autry, Tony Curtis and Veronica Lake.The book has been carefully produced as a casebound publication, measuring approximately 7-1/4 x 10-1/4. With a laminated cover, pasted endleaves, a Smyth-sewn binding and head- and foot-bands, the quality of craftsmanship speaks for itself. The layout and typography are exquisite, coupled with acid-free, softwhite paper, it provides easy readership for the viewer. The photographs, many of which are obviously from vintage prints, are legibly scanned at a fine resolution and are thoughtfully interspersed within the text.If one were to have an opportunity to introduce Errol Flynn to a newcomer, I would highly recommend this book, accompanied by Flynn's autobiography &quot;My Wicked, Wicked Ways&quot;, &quot;The Films of Errol Flynn&quot; by Tony Thomas, and &quot;Errol Flynn: A Memoir&quot; by Earl Conrad.This is a very fine publication. Mr McNulty should be most proud of the results that will be enjoyed by many, enlightening to most and greatly appreciated by true fans of Errol Flynn.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "Thomas Mcnulty has written a good solid book on Flynn.The first in many a year. It has a few faults like any book of this nature.It is well written and a page turner it is, after the first couple of chapters which are a little slow to warm to.After that the the pages start to fly away and you get drawn into the depth of Errol Flynn and his exciting fun and surprisingly often sad adventures.I could agree with the other reviwers with the price being a little on the steep side,which is a shame for the younger or those new to Flynn, who may be put off by the price as they loose out here.Yes the pictures are the one item I am disapointed about as a few others are!However I think the book is well worth reading even if it has to be at a later date, when the price comes down, and if it does I think the book will sell even more due to it style and presenation which is a more complete bio of Flynn that has never been available before now.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "Vincent Sherman, the director of ADVENTURES OF DON JUAN, is quoted on page 217 of Thomas McNulty's excellent biography as saying of Flynn, \"He was a very complex man and complicated in many ways.\" This book enlarges on that description but never glosses over the blemishes, and yet somehow the author keeps his affection for Flynn.This is a nearly impossible task for most writers but McNulty made a book that is enriched with detail. This book never disappointed me although it is long and filled with many historical sidebars.This is a portrait of Errol Flynn that is a refreshing tribute.This book brought out many emotions in me with its retelling of Flynn's legend. He had a funny side, a serious side, wanted to be a writer, made some great films, but came to a tragic end. If you are at all interested in Errol Flynn then this book is for you.The price is unfortunate, but most people understand that the publisher sets the book price, not the author. The publisher is McFarland and all of their books are expensive. That's because they are all limited print runs and not available in mass market editions. I would love to see a lower priced mass market edition of this book. It's also unfortunate that a smear campaign is being waged against Tom McNulty and his friends in the Errol Flynn fan community. It's a good book and Tom McNulty should be treated with respect and this book deserves a bigger audience. Too bad that one or two deranged fans are making it difficult for everybody. McNulty and Flynn deserve better than that!!",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "Many writers have written about Errol Flynn, some good and some bad. He is popular and every couple years a new book comes out. This one is really good. It is rare to read a book dedicated to good writing like this one is. And the book tells the whole truth about Errol Flynn, my favorite actor.Nobody can say Errol Flynn is your typical actor. He was a genuine and original thinker. Thank goodness this book reaches into history and tells us the true story as it really happened!The book has all of the famous stories about Errol Flynn and a few stories I never heard before. The author studies the man and his great films and turns it into a history lesson. I got this book for Christmas and was told only the price sucks. I'm glad I got it. this is a good book that all Errol Flynn fans should read!!!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Who among film fans cannot remember with fondness the many great scenes from The Adventures of Robin Hood? Are there those who have forgotten that Errol Flynn's films were treasured by millions and offered inspiration during some dark eras in history? This new biography comes along right when you think you have read everything possible about Flynn and his career. But you haven't read everything until you have read this amazing book. The author's examination of Flynn's film career, his personal life (which turned into a very public fiasco very quickly) and the cultural impact of his career is very well done. By comparison, the last three books on Flynn (by Charles Higham, David Bret and Jeffrey Meyers) offered salacious gossip, falsified documents, and disinformation, this book reads more like solid investigative journalism. This book allows for reflection on the historical era of Flynn's life which often reads like trivia, but with a higher purpose. And there are moments of inspiration unlike anything I have seen in any biography on Flynn. And I have read them all-- My favorite quote makes for one of the photo captions: \"His picaresque life as a sailor on the seas of fate; his ability to find adventure amidst the mediocrity of daily life; his courage in facing his adversaries, both on and off the screen, all make for an intriguing portrait of a man who lived life to the fullest.\" Flynn is established as a rebellious and electrifying presence, on and off the screen. The author gives attention to the historical events of Flynn's lifetime. There is something here for everyone and although I know the basic chronology of Flynn's life and career, I was astonished to find a wealth of detail unseen in any Flynn book so far. This book is filled with quotes and the footnotes number in the hundreds. The photos vary between the common and the rare. I really loved this book. I really enjoyed the photo of Flynn with John Barrymore. A great photo of Flynn relaxing and reading an Evelyn Waugh book. Some great scene stills and some rare shots that are previously never published. My favorite is the photo of Flynn with Olivia de Havilland at the press junket holding hands and talking in a corner together. What could she be saying to him? Intriguing---!! A beautiful volume for those who cherish Errol Flynn's films as I do. Enjoy!",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "maria callas sacred monster",
        "description": "An inquiry into the life and career of one of this century's most celebrated opera singers reveals her personal thoughts and provides a view of each of her roles",
        "authors": "['Stelios Galatopoulos']",
        "infoLink": "http://books.google.com/books?id=5xU6AQAAIAAJ&dq=MARIA+CALLAS:+Sacred+Monster&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There's not much to recommend this book. Some of the photographs look as if they've been smeared across the pages. Others are clearly NOT Callas at all, and one has been so badly cropped as to make Callas appear to be juggling balls whilst singing Iphigenie. The text reads as if it was written for Woman's Weekly in Athens and would have benefitted from a very strong editorial hand. The author claims to have been a friend of Callas. Really - One's friends!Throw a stick at the Met or Covent Garden [when it re-opens] or the Paris Opera and you will hit six people who could put together a better biography than this, and without the many somewhat spurious 'Callas told me's' with which this book is littered.To date this is the author's fourth attempt at Callas biography, [and should get some sort of an award for so gallantly persisting in a task for which he so clearly unsuited] and whilst the information has changed from one edition to another, and the grammar and prose has improved [and, believe me, that's not saying much at all] I do hope this is his last book on his 'friend' until he does a little more research and just some plain old fashioned observation of photographs. I had the feeling that the author feels he 'owns' Callas, with all the obsessiveness and lack of insight of a stalking fan.Search out the magical Thames &amp; Hudson Callas by Fitzgerald and Ardoin, or Ardoin's Callas Legacy, and Michael Scott's Maria Meneghini Callas is a must.",
                "review/helpfulness": "32/40",
                "num_reviews": 40
            },
            {
                "review/text": "I picked up this handsome new book on my favorite singer with great anticipation. Just leafing through it whetted the appetite - wonderful pictures, lots of them, many of which I had never seen before. And the size of the book promised much - here would be a major reading wallow in Callasiana. And, of course, it had been some years since a major book on Callas had appeared. All the omens looked good, and I plunged in. Ultimately, the book proved a major disappointment, for reasons discussed below. But first, the positives. As noted above, the photographs are a real treat, primarily because many of them have never appeared before now. Particularly in her early roles, we see new pictures of Callas, some of them quite beautiful. And there are photographs from the famous productions that have so far not achieved circulation. Galatopoulos also manages to present a coherent and reasonably detailed narrative of Callas' life and art, albeit with a great deal of recyling of (by now) very familiar incidents and quotes that have been retold so often that most readers of the Callas literature can recite them in their sleep. The author has some interesting, if not exactly original, comments on Callas' art and on her place in, and impact on, the operatic scene. There also is a new spin on Callas' relationship with Onassis, which the author contends was not the principal reason why the diva's career began to contract beginning in 1959. Most writers on Callas have taken the view that her relationship with Onassis distracted her from her artistic mission, portraying him as an abusive, philistine, domineering male chauvinist pig and casting him as Principal Villain in the Callas saga. Galatopoulos maintains that Callas' and Onassis' relationship was much more complex than has been portrayed and that Onassis was not nearly so bad as he has been made out to be. Among other things, the author scoffs at the report that Onassis forced Callas to have an abortion, an allegation that first surfaced in Arianna Stassinopoulos' 1982 biography of Callas. Galatopoulos also maintains that Callas was not nearly as forlorned, abandoned and depressed in her last years as some have maintained, and he decries the &quot;soap opera&quot; portrait of Callas that has become the received view of this time in her life. The author's new take on &quot;L'affaire Onassis&quot; and Callas' last years is based on conversations the author had with Callas in the 1970's. And herein lies the problem. Much of this book is taken up with what purport to be quotes of conversations the author had with Callas on a wide variety of subjects, from her approach to her art to her relationships with Onassis and her mother. Galatopoulos will state, &quot;Callas told me,&quot; and then there will follow a lengthy indented paragraph that clearly is intended as a verbatim quotation from Callas. The problem is, one doubts that it is. In the first place, one presumes that Galatopoulos was not taping Callas while she discussed intimate details of her life. This being the case, we are asked to believe that the author recalls, virtually word for word, conversations he had as long as twenty years ago. It simply strains credulity. Moreover, on a number of occasions, Galatopoulos says that Callas &quot;told me&quot; and then goes on to quote her making statements that the alert Callas reader will instantly recognize as being from other, previously published interviews Callas gave to other people, such as Lord Harewood in his BBC interview with Callas in the late 1960's. For example, Galatopoulos claims that Callas &quot;told him&quot; about some insights about operatic acting that she received early in her career from one Roberto Mordo. This &quot;quote,&quot; which the author claims Callas &quot;told him,&quot; is lifted almost verbatim from an interview Callas gave to Edward Downes during a Metropolitan Opera matinee broadcast. Theoretically, I suppose it is possible that Callas, by coincidence, said almost the exact same things to the author, word for word, as she said to Harewood and Downes. But again, it strains credulity past the breaking point. There are two reasons this matters and why it seriously compromises this book as a reliable biography of Callas. First, in any serious biography, quotes mean something: the author is representing to the reader that what he is reading is what the person quoted actually said. One simply cannot believe that Callas (and Serafin, and others) actually said to Galatopoulos what he claims they said. Second, because these quotes from Callas are the basis for much of Galatoloulos most interesting &quot;takes&quot; on her life, and because the quotes themselves are so suspect, one is left questioning the credibility of the author and, consequently, of these new accounts of Callas' life. If a biographer's credibility is compromised, then so is the value of his biography. This unfortunate situation is not helped by the virtual absence of any footnotes or attributions throughout the book. There are many quotes, but often one does not know where they come from. Are they quotes from published sources? Statements made to the author? Did the author simply make them up? One simply does not know what to think. The tragedy is, this book could have been truly valuable for shedding new light on Callas' life - no mean accomplishment, considering all that has been written about her. Unfortunately, one ends up wondering, &quot;Did Callas really say that?&quot; Not a very good thing for a book that purports to be based largely on Callas' own words. One wonders if there was an editor anywhere in sight when this book was being readied for publication. Nevertheless, Callas fans will snatch this book up, and indeed there is much to enjoy. Just when frustration with the author is building to a crescendo, there are always those pretty pictures to distract. And, of course, there is the endlessly fascinating Callas herself and her treasurable legacy of recordings.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "I found this book deplorable. Badly written, it could have used a strong editorial hand both in the prose and the picture captions. Especially disapointing is the re-hashing of incidents that have long since been disproved or properly researched, i.e. Callas's first audition at the Metroplitan Opera, which resulted in no offer of work from that house. Likewise, the famous incident in Rome when Callas abandoned a performance of Norma. Galatopoulos claims there was uproar in the audience whilst she was singing, but a tape exists of this performance and there is no disturbance at all at that point. These are just two of a number of incidents in the book where the author does not seem to be able to relate information long and freely available to his own conception of what happened. It is a long established fact that Callas made her Italian debut on the 2nd August 1947, but Galatopoulos sticks to the innacurate date of 3rd August which was current well into the 1970's. [The Arena di Verona celebrated the 50th anniversary of Callas's debut on 2nd August 1997] This gave me the distinct impression the author felt that he and he alone was/is THE authority on Callas and there isn't any need for him to read anyone else's scholarship on the subject. Fortunately he isn't and I had the feeling, shored up by all those verbatim conversations, this tome was simply an attempt to present the author's version of &quot;My own private Callas.&quot; Another area of the book I found disturbing is the photographic content. I found it impossible to identify Callas in her first stage role, the picture is simply not clear enough. Whereas Callas is easily identified as Brunnhilde are those pictures of Isolde really Callas? There is one photograph supposedly of Callas in I Puritani but there is a small child in the picture with her, and the lady in the picture, wearing an off the shoulder dress, does not look like Callas. I leave readers to form their own opinions.Maria Callas is an on-going phenomena, her voice is as inspiring and awesomely thought provoking now as it ever was. There are now generations of people who never heard or saw her live, there are only recordings and old films. A few authors; John Ardoin, Gerald Fitzgerald, Henry Wisneski and Michael Scott have shed new light on Callas the singer and Callas the woman with serious scholarship for future generations. Stelios Galatopoulos's work is not in this league.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "Much as I admire the subject, I simply can't read through the book. The prose is lousy, sometimes resembling the breathless (and brainless) outpourings of those photo-romances so popular in postwar Italy, and the illustrations are of very low quality, almost as if done on a cheap photocopier. Callas would have hated this book.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "jeff chandler",
        "description": "Let us shatter any Jeff Chandler myths. This book is your ultimate resource for Jeff Chandler. Here you will find the most up-to-date 143 Success Facts, Information, and much more. In easy to read chapters, with extensive references and links to get you to know all there is to know about Jeff Chandler's Early life, Career and Personal life right away. A quick look inside: Return to Peyton Place (film) - Cast, Ten Seconds to Hell, Thunder in the Sun, 1950 in film - Notable films released in 1950, Jack Carson - Partial filmography, Eve Arden - Radio and television, Sammy Davis, Jr. - Car accident and conversion to Judaism, Two Flags West - Synopsis, Because of You (film) - Plot, Pete Best - Popularity, Raw Wind in Eden, 1961 in film - Deaths, 1956 in film - Notable films released in 1956, Female on the Beach - Cast, Jeff Chandler (actor) - Further reading, War Arrow, Sign of the Pagan, Pillars of the Sky - Cast, A Stranger in My Arms - Cast, East of Sumatra, War Arrow - Cast, 1918 in film - Births, Florida Gators football - University of Florida Gator 100th Anniversary Team, Johnny O'Clock - Cast, Jane Russell - 1950s, Foxfire (1955 film) - Reception, Jeanne Eagels (film), Orson Welles - Return to Hollywood (1956-1959), Abandoned (1949 film) - Cast, Man in the Shadow, Ten Seconds to Hell - Cast, Universal-International, 1959 in film - Notable films released in 1959, Two Flags West - Cast, Red Ball Express (film), Broken Arrow (1950 film), Foxfire (1955 film) - Main cast, Marcian - Depiction in fiction, Drango, Man in the Shadow - Cast, Because of You (film) - Cast, The Robe (film) - Background and production, Istanbul (film) - Production notes, George Nader - Stage, film and television work, and much more...",
        "authors": "['Crystal Travis']",
        "infoLink": "http://books.google.com/books?id=WSvLoAEACAAJ&dq=Jeff+Chandler&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Rarely has a book inspired such intensely mixed feelings in me. For years I wanted to know more about the life and career of Jeff Chandler, who was intriguing in so many ways--a handsome, prematurely grey, Jewish leading man who played almost everything but Jews, a good-looking man in an offbeat way, scarred from a motor accident, a man revered for his friendship and loyalty, who offered his own eye when his friend Sammy Davis was in danger of losing both his own, and a tough guy who died far too young from medical misadventure. So despite grave misgivings when I saw that this new book was a vanity publication (i.e., published by financial arrangement by the author rather than being chosen for publication based on its merits), I leapt at the chance to read it. And indeed it answered, and elaborated on the answers to, many questions and curiosities I'd had about Chandler. There is much herein that is interesting to read about his early life, his accidents, his friendships, and in particular his demise. But there is a HUGE caveat: Marilyn Kirk is a fan and, despite her bio blurb, apparently not a professional writer. Now neither of these factors prevent anyone from producing a fine book. But this is not a fine book. As books go, it is not even a good one. The author's style is nonexistent, beyond a fulsome adoration of her subject. Chronology is so utterly dispensed with that it becomes nigh impossible to keep facts straight, as the author jumps willy-nilly through Chandler's life, almost giving the surreal impression that the events of that life occurred all at the same time. A chapter about Chandler's boyhood will have long passages about his funeral, or some other event from much later, not because the jump in time improves our understanding of the boyhood event, but apparently because the author simply flew off on a tangent. Similarly, the author bounces from calling Chandler \"Jeff\" to using his birth name \"Ira\" and back again, to the point of disorienting even the well-informed reader. The book suffers also from the worshipful, non-critical fan's point of view. The barest lip service is paid to the idea that Chandler might not have been a saint, and controversial aspects of his nature and rumors that might to some seem shameful are studiously avoided. Worst offense of all, though, for anyone expecting to read the truth about a subject is not the absence of critical analysis of the man and his work, nor the jumbled syntax and timelines, but the overwhelming reliance on fan magazines as a primary source of information. Fan magazine stories, as every serious student of film history knows, were concocted extensively by studio publicity people or by their lackeys at the magazine and can never be relied upon as source of factual information. Yet author Kirk cites 55 publications in her bibliography, 75% of which are fan magazines. And her notes indicate that the other, comparatively reliable, publications used as sources (the L.A. Times, Chicago Tribune, etc.) were cited almost exclusively as regards Chandler's illness, death, and the subsequent investigation. The conclusion is unavoidable that virtually everything preceding that portion of her book is based most extensively on the completely unreliable material in fan magazines. Indeed, Kirk herself lists nearly seven pages of fan magazine articles, calling them \"a very useful source of information on the life of Jeff Chandler.\"In the end, it is not my intent to denigrate the effort Kirk has put into this book, nor the devotion she obviously holds for her subject. I've written biographies and I know how difficult the task is to complete one at all, let alone well. And truth be told, even knowing what I know about this book, if I had it to do over again, I would buy and read the book, such is my interest in the subject. But though this is the only biography of Jeff Chandler in print (and very likely the only one that will ever be), it is not the definitive biography, nor is it a reliable or well-written one. It serves to whet the appetite for a real book by someone who knows how to research and organize, who has stylistic skills and a critically subjective point of view, and who isn't afraid someone might not like the guy she's writing about. And if ever there were a warning about the mixed-blessings of print-on-demand vanity pressings, this is it. A good-sized book on an interesting but probably not very commercial subject got published. But it misleads those uninformed enough to believe anything published must be good, and it disappoints those who hoped for something of note. And even if you know your film history, the knot of truth and flack-generated fancy presented here is impossible to untangle. It's a pity.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "\"Jeff Chandler\" by Marilyn Kirk is not a good book. Poorly written, badly edited and grossly redundant writing are among the first problems. Ms. Kirk has no understanding about film writing and cannot analyze or offer insight into Chandler's films. Chandler's portrayal of Cochise in \"Broken Arrow\" did not break ground as Ms. Kirk claims, it was the intelligent script and the brilliant direction. Chandler's supporting actor nomination was well deserved but stop to consider he never came near that kind of work again. Also, Kirk relies heavily on quoting old Movie magazines that were routinely written by PR people at the studios. Also, Esther Williams left a huge elephant in Jeff Chandler's life and the author doesn't acknowledge it or even try to dispute it or attempt create reasonable doubt of the cross dressing allegations.Ms. Kirk has not done Jeff Chandler memory any justice if anything Kirk has clouded it up with sappy writting. Worse yet, the book doesn't examine the era that Chandler worked, the end of the Hollywood Golden Era - he saw & witnessed,and even took part as the emergence of television broke down the studio system. There is no examination of Hollywood as it was in the Fifties - still a glamorous town with fabulous night clubs and restaurants - it is for certain that Chandler took part in that scene.In the final analysis, Ms. Kirk was too involved with her subject. The best biographies are written objectively, with great acceptance/awareness of the flaws/warts of the subject. Marilyn Kirk has written Jeff Chandler colorless, cold and uninteresting.As a Chandler fan I was disappointed, it would have been wonderful to have had a book about a hard working actor in the last vestiges of Hollywood glamour and style.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "I had a very close friendship with Jeff's youngest daughter Dana Chandler Grossel and years back we had planned to collaborate on a work about her father, something that wouldn't sensationalize, but rather humanize the Jeff Chandler people thought they knew, but really didn't. Sadly Dana and I could never write the book because she became ill and I am glad we didn't because the public really doesn't have a right to know about the \"real\" personal life of this man and his family.Honestly, the best source of info about Jeff Chandler was from his daughters Dana and Jamie who sadly, both died of cancer within a year of one another. Dana and I talked for hours about her father, I know things about him that no one on this earth except his late daughters and wife knew, and I will never divulge them.What I will say is this, he was a good man and a loving father and that means more than anything else anyone could ever say about him. Some \"fans\" go to the extreme, either making him out to be a saint, or making him out to be a freak. He was neither. None of those worshipping fans out there could EVER write a book that would do Jeff or his family justice.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book is written by a big fan of his.That is fine. I had wished for a more seasoned writer to tackle this complex man.But this book will register with any true Chandler fan. I remember as a young kid viewing Chocise and then his movie Away All Boats.I have seen all of his movies and they mostly hold up today as few stars do.He was at universal during the early fifties - gaining fame with Hudson, and Curtis.He was one of the few actors that helped his actresses look so good. Ladies such as : Crawford and Novack and Turner.This man was a good man - with a sad ending. His last film was Merrills Mauraders and he was very good as the war wearing and sick general.I wish the author concentrated more on this. It would have been a better book if she interviewed some of his friends and children more extensively- which she did not.By the way the utter baloney of what Esther Williams wrote is liable, wrong and sick. She was NOT a close friend of his, is suffering from alzheimers and his close friend Sheila Mccrae confirms this.I know where I speak.Jeff Chandler was my Uncle!!!!!",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Rarely has a book inspired such intensely mixed feelings in me. For years I wanted to know more about the life and career of Jeff Chandler, who was intriguing in so many ways--a handsome, prematurely grey, Jewish leading man who played almost everything but Jews, a good-looking man in an offbeat way, scarred from a motor accident, a man revered for his friendship and loyalty, who offered his own eye when his friend Sammy Davis was in danger of losing both his own, and a tough guy who died far too young from medical misadventure. So despite grave misgivings when I saw that this new book was a vanity publication (i.e., published by financial arrangement by the author rather than being chosen for publication based on its merits), I leapt at the chance to read it. And indeed it answered, and elaborated on the answers to, many questions and curiosities I'd had about Chandler. There is much herein that is interesting to read about his early life, his accidents, his friendships, and in particular his demise. But there is a HUGE caveat: Marilyn Kirk is a fan and, despite her bio blurb, apparently not a professional writer. Now neither of these factors prevent anyone from producing a fine book. But this is not a fine book. As books go, it is not even a good one. The author's style is nonexistent, beyond a fulsome adoration of her subject. Chronology is so utterly dispensed with that it becomes nigh impossible to keep facts straight, as the author jumps willy-nilly through Chandler's life, almost giving the surreal impression that the events of that life occurred all at the same time. A chapter about Chandler's boyhood will have long passages about his funeral, or some other event from much later, not because the jump in time improves our understanding of the boyhood event, but apparently because the author simply flew off on a tangent. Similarly, the author bounces from calling Chandler \"Jeff\" to using his birth name \"Ira\" and back again, to the point of disorienting even the well-informed reader. The book suffers also from the worshipful, non-critical fan's point of view. The barest lip service is paid to the idea that Chandler might not have been a saint, and controversial aspects of his nature and rumors that might to some seem shameful are studiously avoided. Worst offense of all, though, for anyone expecting to read the truth about a subject is not the absence of critical analysis of the man and his work, nor the jumbled syntax and timelines, but the overwhelming reliance on fan magazines as a primary source of information. Fan magazine stories, as every serious student of film history knows, were concocted extensively by studio publicity people or by their lackeys at the magazine and can never be relied upon as source of factual information. Yet author Kirk cites 55 publications in her bibliography, 75% of which are fan magazines. And her notes indicate that the other, comparatively reliable, publications used as sources (the L.A. Times, Chicago Tribune, etc.) were cited almost exclusively as regards Chandler's illness, death, and the subsequent investigation. The conclusion is unavoidable that virtually everything preceding that portion of her book is based most extensively on the completely unreliable material in fan magazines. Indeed, Kirk herself lists nearly seven pages of fan magazine articles, calling them \"a very useful source of information on the life of Jeff Chandler.\"In the end, it is not my intent to denigrate the effort Kirk has put into this book, nor the devotion she obviously holds for her subject. I've written biographies and I know how difficult the task is to complete one at all, let alone well. And truth be told, even knowing what I know about this book, if I had it to do over again, I would buy and read the book, such is my interest in the subject. But though this is the only biography of Jeff Chandler in print (and very likely the only one that will ever be), it is not the definitive biography, nor is it a reliable or well-written one. It serves to whet the appetite for a real book by someone who knows how to research and organize, who has stylistic skills and a critically subjective point of view, and who isn't afraid someone might not like the guy she's writing about. And if ever there were a warning about the mixed-blessings of print-on-demand vanity pressings, this is it. A good-sized book on an interesting but probably not very commercial subject got published. But it misleads those uninformed enough to believe anything published must be good, and it disappoints those who hoped for something of note. And even if you know your film history, the knot of truth and flack-generated fancy presented here is impossible to untangle. It's a pity.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "rodin world of art",
        "description": "\"Auguste Rodin -- the greatest sculptor of the nineteenth century -- was also probably the greatest since Michelangelo, whose genius was a lifelong inspiration to him. Though the astonishing lifelike quality of his sculpture (first apparent in Bronze Age, 1877) was in total defiance of current academic conventions, Rodin did not have to face the prolonged and bitter hostility meted out to the Impressionist painters who were his contemporaries, and in later life he became a famous and widely respected figure... In this important new monograph, Bernard Champigneulle analyses Rodin's great significance as an innovator in sculpture. For Rodin created an entirely new form -- the detail considered as a finished work -- and in doing so exercised a lasting influence on his successors, who were affected equally profoundly by his emotional expressiveness, his power of characterization and the subtlety of his modelling. M. Champigneulle combines a searching reappraisal of Rodin's achievement with a revealing account of his personality and of his troubled personal life\"--",
        "authors": "['Bernard Champigneulle']",
        "infoLink": "http://books.google.nl/books?id=Etc2AQAAIAAJ&dq=Rodin+(World+of+Art)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Champigneulle's RODIN is a very informative, chronological account of Rodin's life as an artist, packed with an excellent selection of plates illustrating his work. The text is clearly presented, well-organized and very well supported by well-placed illustrations.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was definitely informative and complete. But what I found most compelling about it was the author's poetic tone. It was refreshing to be so enchanted by a biography; sometimes they can be awfully dry. The subject of Rodin and his work is, of course, irresistable. But, I really felt this book was a page turner because of the eloquent writing.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "A beautifully prepared work. Well written, with stunning black and white pohotos of Rodin's major works. The writing is very elegant, yet simple and elegant. A must for any collector or any one interested in Rodin.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "frida kahlo and diego rivera pegasus library",
        "description": "The stormy relationship, artistic differences, and ideological common ground shared by Mexico's two greatest contemporary artists are portrayed here in a celebration of their contributions to art.",
        "authors": "['Isabel Alcántara', 'Sandra Egnolff']",
        "infoLink": "http://books.google.nl/books?id=5DCOmXJe0MoC&dq=Frida+Kahlo+and+Diego+Rivera+(Pegasus+Library)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book gave me a glimpse into Frida's life, the turmoil she must have constantly felt to love a man whose weakness was all women. I could almost feel her thoughts through the author's words.The ending brought me to tears. I wish I knew her. Once I started reading, I couldn't put this book down! thank you for a glimpse into Frida and Diego's lives.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "The photographs include some not seen in the many other books on Kahlo, which is the primary strength of this book. However, it seems that some of the facts are drawn from the March biography of Rivera - which is at best questionable - and at worst Rivera's mythical reinterpretation of his own life. The unusual grammar and typographical errors are somewhat distracting at times. Overall, however, it provides a nice overview of the important points in the Kahlo-Rivera relationship.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book provides better than average insight into lives of Frida Kahlo and Diego Rivera. While people are now eagerly awaiting the Fall 2002 Selma Hayek movie on Frida, this book does provide some background into the world of Frida Kahlo and Diego Rivera. If you are unfamilar with these artists this book would be a good place to start.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm baffled that a book can be published with so many typos and gross errors. Frida's name is even misspelled \"Kahalo\" in one place. It states her tragic accident happened on \"17 December 1925\" which it did not (it was September) and it says this twice. On the very next page it shows her diary entries discussing her pain from the injuries, the entries are dated October 1925 and on. I mean it's really distracting and totally unacceptable. Sentences were incomplete and you are left rereading and looking for the rest of the statement. Some of the sentences just didn't make any sense. I ended up reading with a pencil in hand to make corrections. As for the actual bio info, I agree it's interesting, but Frida and Diego were unquestionably fascinating people even in poorly written text. Thankfully I checked this out from our public library. I would NOT recommend this book to anyone. Get another bio from a different publisher. One that is reputable, responsible and does good work. I give it two stars for photo selection.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "joseph cornell",
        "description": "Deborah Solomon's definitive biography of Joseph Cornell, one of America's most moving and unusual twentieth-century artists, now reissued twenty years later with updated and extensively revised text Few artists ever led a stranger life than Joseph Cornell, the self-taught American genius prized for his enigmatic shadow boxes, who stands at the intersection of Surrealism, Abstract Expressionism, and Pop Art. Legends about Cornell abound-the shy hermit, the devoted family caretaker, the artistic innocent-but never before has he been presented for what he was: a brilliant, relentlessly serious artist whose stature has now reached monumental proportions.",
        "authors": "['Deborah Solomon']",
        "infoLink": "http://books.google.com/books?id=tGrZCwAAQBAJ&dq=Joseph+Cornell&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you seen the work of Joseph Cornell before and loved it then you will find much to learn from in this book. But, I'm not sure readers encountering Cornell for the first time through this book will be won over. The detailed text by McShine is thorough, covering his life, his surrealist box constructions, collages and cinema. A huge amount of his work is reproduced, and an extensive bibliography are included. However, most of the plates are in black and white, with only a handful of colour photographs of his work. Moreover, the photographs of his work lack depth, so the three-dimensional tactile qualities of his enigmatic box constructions are lost. Perhaps these qualities would be difficult to convey in any photographs. So, it is not the perfect Joseph Cornell book. But the writing is interesting and I still loved looking at the less-than-ideal reproductions of his work.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "I've been a fan of Joseph Cornell ever since I discovered him at the Chicago Art Institute. But, like many of you, I thought all he did was shadowboxes. But, oh no. The rich illustrations showed me treatments, themes, and directions I had no idea the artist had ever worked in. The surprises were rather pleasant.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Contents include the editor's introduction and four significant essays: \"the Trancendental Surrealism of JC\" by Dawn Ades; \"JC: Mechanic of the Ineffable\" by a frenziedly allusive Carter Ratcliffe, which among other things places JC in an American context, amongst Thoreau, Dickinson and the Puritans (!); \"The Cinematic Gaze of JC\" by P. Adams Sitney, a perceptive and authoritative survey of Cornell's films; and \"JC: A Biography\" by Lynda Roscoe Hartigan. These texts are heavily illustrated with unique supporting visual material. The plates of Cornell's work are unremarkable but there is the usual impeccable and thorough MOMA bibliography and checklist.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sometimes madness is wisdom zelda and scott fitzgerald a marriage",
        "description": "Drawn from previously undisclosed information, a fascinating new perspective into the tumultuous marriage of Scott and Zelda Fitzgerald, prominent figures of the literary and theatrical worlds, details their complex relationship, which eventually resulted in his becoming an incurable alcoholic and her descent into madness. Reader's Guide included. Reprint.",
        "authors": "['Kendall Taylor']",
        "infoLink": "http://books.google.com/books?id=4LEmAQAAMAAJ&dq=Sometimes+Madness+Is+Wisdom:+Zelda+and+Scott+Fitzgerald:+A+Marriage&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As an English major in college, I was required to reach much of F. Scott Fitzgerald, most particularly \"The Great Gatsby\" and \"Tender Is the Night.\" And like many others of my ilk, I fell madly in love with the legend that was the Fitzgeralds. I went on to read everything I could get my hands on, from Scott's collected short stories to \"The Beautiful and the Damned\" to \"This Side of Paradise\" to the tragically unfinished \"The Last Tycoon.\"Through all of my Fitzgerald worship, I viewed Zelda as an \"also-ran\"--the madcap flapper, the passionate spouse and lover, the quintessential \"roaring 20s girl,\" the great beauty who was her husband's muse-until she went crazy. I never took her seriously as an artist in her own right, and why should I have done so? Certainly until recent years, no biography of Fitzgerald painted her that way, and I found the few biographies of Zelda opinionated and suspect.Now, with a fascinating work that took author Kendall Taylor 30 years (!!) to write, the tragedy that was Scott and Zelda Fitzgerald finally comes to light as never before. And for the first time, I realize that the incredibly brilliant prose that made up Scott's novels was often lifted VERBATIM from Zelda's most intimate and personal diaries, which Scott viewed as his own property, to be purloined at will. I find that some of his most cunning and original turn of phrase was taken VERBATIM from Zelda's unique, brilliant, colorful, and wholly her own way of speaking (probably, in fact, a precurser of the schizophrenia that was to overtake her). I find that Scott was so possessive of Zelda as his SOURCE that he actively forbade her to write on her own, although she showed great talent. He went so far as to write long letters to her various doctors forbidding them to allow her to write, and they agreed to do so! A highly creative, completely unique human being, Zelda was thwarted at every turn, whether her painting (which Scott ridiculed) her sad attempts to become a prima ballerina (equally ridiculed and the final step to her first breakdown) to anything else she attempted to do.Scott, a difficult, vain, selfish and jealous human being, viewed Zelda as more than his lover and wife, as more than his helpmate and muse. He felt he owned the very words that fell from her mouth, and strongly resisted any attempt on her part to express herself apart from him, feeling that their mutual story belonged to him and him alone, as the novelist and breadwinner.We all know the end of the story. Scott died much too young of heart disease and TB brought on by acute alcoholism. Zelda, in and out of mental hospitals from her late twenties on, died in a horrible fire at the institution where she was housed. These two bright flames, these two icons of The Jazz Age, these two physically gorgeous people, the flapper and her swain, were doomed from the start. But until the recent death of their only daughter, Scottie Lanahan, many of their papers, letters, diaries, and so forth, remained unavailable to the public. Taylor was given unprecedented access to these, and tells her tale in as objective a way as she can, given her subject matter. One must commend Ms. Taylor for her Herculean efforts and her fascinating story. Unfortunately, like many authors of today, she has fallen victim to the same bad editing that plagues most paperbacks in today's marketplace. Therefore, the paperback version of this book (which is the version I read) is plagued by silly grammatical mistakes and typos that Scott OR Zelda would have noticed. It isn't fair to Taylor, but so be it. Suffice to say that, upon reading the very last sentence of the very last page, I broke into sobs. I now wish to go on and read Zelda's collected works (available from Amazon!), view all her artwork (ditto) and reread Scott's works-from the viewpoint of all I know now. I commend Ms. Taylor on a simply brilliant job.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "Although the author, Kendall Taylor, begins her biography with a disdainful look at how all biographies of Zelda are about F. Scott Fitzgerald, she proceeds to do the same thing, badly.Not only does she discuss the friendship between the Fitzgerald's and the Hemingways. she also discuss all of their friends, enemies and the possible lovers of these same friends and enemies.There is nothing new. The biography is not well written, which I generally expect from a English professor (too self-involved.} Beside the mediocre writing, the proofing is terrible, as is the editing--if there was any--leaving mistakes and errors galore.If the reader is interested in Zelda and her descent into madness and what happened after Scott died, chose another book. I'm sorry I wasted the time and money on this one.",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "If you are at all interested in the Fitzgeralds, this book is a precious gem. It shows far more of Zelda's creativity and outrageousness and less of her madness than Nancy Milford's book (which Scottie Fitzgerald was very upset by). It captures the Jazz Age and shows how Scott really assisted in Zelda's madness by insisting her life was his material and that she couldn't develop a professional reputation of her own as a writer. Nearly every schizophrenic episode Zelda had was preceded by Scott's blocking her attempts at self-expression. It still presents a sympathetic portrait of Scott, however. It's the best book on the two of them that I've ever read, and really brings the period to life. It makes you want to cry afterward for the potential that was wasted with both of them.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "The Fitzgeralds have been the subjects of numerous biographies; Zelda by Nancy Milford focused on Mrs. Fitzgerald specifically. Kendall Taylor has written a detailed treatment, based on extensive research, of the Fitzgeralds and their tragic relationship. Ms. Taylor's research was based on interviews with family and acquaintances and examination of their letters and records. She recounts their years as a golden couple in the 1920s where they lived in the U.S. and as expatriates in Paris, with the Hemingways and other writers and artists. The central tragedy was Zelda's descent into madness at the end of the 1920s; for the rest of her life she would be in and out of institutions. Zelda's medical condition and prescribed treatments (including hydrotherapy and shock therapy) are described. Today, perhaps, new medications on the market would have saved Zelda much agony. Zelda Fitzgerald's tragedy was compounded by the fact that it was a genetic condition; her brother and grandson were also afflicted by schizophrenia. Scott Fitzgerald's alcoholism also was highly destructive and undoubedtly caused his premature death. Much is said here about Zelda Fitzgerald's creative nature--she painted and wrote novels and short stories. Her obsession for the ballet helped to bring on her illness. Ms. Taylor emphasizes Mrs. Fitzgerald's creativity in art and literature and describes the ways her husband would stifle it. The author discusses that Zelda was used as an inspiration for her husband and some of her letters and diaries were published verbatim in his novels. Kendall Taylor's book is recommended to those interested in the Fitzgeralds; several new revelations are provided about Zelda Fitzgerald. More is also learned about their often put upon daughter, Scottie Fitzgerald.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I found this book to be very entertaining and readable though not as many new facts and insights are delivered as it initially seems to promise. (Ms. Taylor's credibility comes into question when she first describes Scott's eyes as being lavender, then green, then blue -- all within the first chapter.) The title is a misnomer, as Ms. Taylor seems mostly interested in Zelda. Certainly the author has a great sense of sympathy and admiration for Zelda, and the vivacity and unquestionable brilliance of the Last of the Belles has never been captured or celebrated so vividly.Ms. Taylor's disdain for Scott, however, is occassionally off putting, and to reduce Zelda to his victim is unfair to them both. The facts (and their writings) just don't support this thesis -- that Zelda was the great artist and that Scott stole her genius and stifled her talent in service of his own literary ego and ambition. (All artists -- especially writers -- &quot;use&quot; the people in their lives for material, don't they?) The author views Scott's elaborate declarations of love for his wife with suspicion and hidden motives. The postscript on their daughter Scottie is very interesting and a much needed updating of this sad and still fascinating story of romantic disillusionment.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "I am impressed with Kendall Taylor's supreme effort in writing this book. She has invested a great deal of her life, some thirty years, in researching all the material. It is a very interesting biography, but it seems she tries to do too much. There are so many details of the Fitzgeralds' friends and contemporaries that one gets bogged down in details. There are many repetitions of facts, and areas where one sees poor editing and sentence structure errors. It would appear that the author spent too much time on the book, and therefore its presentation is somewhat disjointed and disorganized. I would have preferred to see more emphasis on Zelda herself, instead of anecdotes regarding her frivolous lifestyle.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "The subject matter here is no doubt fascinating, but this effort leaves us guessing why. We're left with the troubling impression that Zelda was raised to rely on every gift except substance, and that she ultimately suffered from the realization that life is best -- or only -- lived substantively. Not exactly a piece of original thinking, and one searches in vain for more lasting lessons, or even ideas. What makes this search so ultimately fruitless is the author's decided lack of skill, both as researcher and chronicler, and the disturbing suspicion that this &quot;biography&quot; is nothing more than a personal attempt by the author to don Zelda's party clothes, to be the belle of the ball, or to be -- even temporarily -- interesting. Sad, and profoundly unfair to the subjects of this needlessly lengthy piece of &quot;Page 6&quot; journalism. Scott and Zelda deserve much more.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book, if one wants to believe, provides new information that is interesting, but a lot seems to be sensationalist conjecture. The author writes about the treaments of Zelda's disease used at the time, which one can believe she went through, but her interpretations of Zelda's thoughts and actions cannot be backed up with any proof. The author's analysis is sophmoric, and full of factual mistakes: &quot;Noonie&quot; was Zelda's neice, not her cousin, for example. If this author can write a biography, anyone can. Mitford's book still remains the best source on Zelda, and if that book disturbed Scottie Fitzgerald, this one would have made her hair stand on end. If you like yellow jounalism, you'll like this.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Although quite academic and not an 'easy read', I enjoyed reading 'Sometimes Madness is Wisdom'. It has generated in me an interest to discover more about Zelda Fitzgerald which appeals to me personally, however, I do understand that some readers would find this biography frustrating in the way it leaves some questions unanswered. I think perhaps the author has set herself one goal and gotten caught up in another - ie. her introduction promises to reveal more of Zelda herself than her husband. What results is more an analysis of the marriage, as the subtitle indicates, but as a result neither Zelda nor the marriage are completely exposed. I certainly would not discourage anyone from reading 'Sometimes Madness Is Wisdom' because of this dichotomy. I would make two recommendations: 1)That this title will appeal to readers with an interest in history and/or literature as an academic pursuit more than readers of pop-bios 2) Wait for the paperback!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I've read everything I could get my hands on about the Fitzgeralds and did my Master's Thesis on Zelda over twenty years ago. This new biography told me things I didn't know and gave me an even better understanding of Scott and Zelda's lives and talents. Thanks!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the complete woodcuts of albrecht durer",
        "description": "Three hundred forty-six reproductions of woodcuts, arranged chronologically, by the German artist with supplementary information on his life",
        "authors": "['Albrecht D\\x81rer', 'Willy Kurth']",
        "infoLink": "http://books.google.com/books?id=OG03EAAAQBAJ&dq=The+Complete+Woodcuts+of+Albrecht+Durer&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The woodcuts in this book leap out at you with a ferocious and violent intent. I've seen the originals and the reproduction job here is nothing short of superb. It's hard to believe that such visions of the apocolypse come from Germany in the early part of the millenium. You can't miss this book! The engraving book is also way kool.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is the best compilation of Duerer prints I have ever seen. Duerer's talent is really downplayed in the avant-guarde scene today, but if you just look, you'll have instant appreciation. My only dissapointment was that the book does not include all of Duerer's Revelation woodcuts, which are my favorites. Anyway, I suggest you look into this book--it is amazing.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "Albrecht Durer was one of the most talented artists the world has ever seen, and his woodcuts, especially those of apocolyptic visions are spectacular. This book reproduces these woodcuts faithfully, and the images are not diminished by the format of the book as is often the case.These images are the stuff of nightmares - hell, torment, torture and death, and yet the images are so startlingly realistic as to be almost poignant in their representations. Enjoyt the images for what they are - works of genius. In addition the commentary is worthwhile, with interesting observations of Durer's life and techniques.A valuable addition to an art lover's library, but also a fascinating book for anyone who is interested in genius.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "The visuals contained in this book by Durer are very very good. It gives you a great idea of what type of talent this man had. There is a very nice transition from his earlier work to the later noticeable due to the intricate detail woodcut by woodcut. If you are a fan of Durer, or wanted to know what he was capable of creating, I highly suggest checking this one out.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is 346 pages, not 44 as listed. Dover has a newer edition. Durer masterworks.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "i was newly interested in Durer's work and i bought this book based on the positive reviews. i can only add to the praise already given. not having seen any other prints of the works contained within, i can't comment on their relative quality or fidelity, but overall the quality is excellent and an amazing value for the money. i wouldn't expect any better from a paperback printing of fine art. the book is just the right size to convey the essential visual information in the many full page prints, and the very large woodcuts are thankfully accompanied by numerous detail images. many images in this book are startlingly detailed, and almost all of them have well-defined lines and excellent contrast. the only downside visually is that the artist often composes extremely deep images, and some details in the far background can be muddy and/or undefined. but my gut tells me this has mostly to do with the limitations of the medium rather than the printing in the book.this is strictly a catalog of art, so don't expect much biographical information, context or criticism. there is a somewhat barebones catalog of each image in the beginning of the book that conveys some basic but useful information about each image. a minor complaint is that a very few images apparently have no data and no explanation as to why they're excluded. i assume these are simple typos, but no reason not to buy the book.buyers should know that a decent fraction (maybe 1/4) of the images in the book, especially the earlier works, lack Durer's monogram and may or may not have been executed by Durer. but i actually see this as a big plus for this book. i would much rather see a full catalog of images thought by scholars to be cut by the artist than to only see those that have been scientifically confirmed. even if all these disputed prints were made by Durer imposters or peers, they still have value to enthusiasts and historians, and every image here is worthy of study. however, many of them have unexplained, large black blocks intruding on them with no explanation, that, frankly, ruin the composition. this needs to be addressed in future publications.i'm fascinated by renaissance art, european history, religious symbolism, and historical paintings, so when i first flipped through this book it was such a treasure trove i almost had a freakin' heart attack. almost every image oozes historical significance and i feel like i can spend days poring over each one, studying its composition and influence on later artists and writers. looking at Durer's body of work, it seems a shame that his career is often summed up with just 3 of his engravings, while these magnificent woodcuts are ignored. i'll probably buy a duplicate copy in the near future because i can tell i'm going to be flipping through this book so frequently as to wear it down to the nubbins.i was so impressed with this book that i instantly bought 3 more of Dover's fine art books, the first of which of course being Durer's complete engravings and etchings. i've since browsed Dover's entire art series, and i'm sure i will eventually buy every single one of them. they make me feel like a sugar-starved kid in a candy store. to Dover Publications, i say, bravo, you've earned a lifelong customer.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a dictionary of symbols",
        "description": "A valuable reference, this informative and entertaining volume presents a key to elucidating the symbolic worlds encountered in both the arts and the history of ideas. 32 black-and-white illustrations.",
        "authors": "['J. E. Cirlot']",
        "infoLink": "https://play.google.com/store/books/details?id=_p7DAgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I can not comprehend how this book got published without a single symbol illustration. I was tempted to give it zero or only 1 star, but the text is good - very thorough. It is therefore useful if you know the glyph or symbol you're interested in, but is not a book of discovery and imagination.The layout and presentation is horrible - a small, very fat book with tiny print.Not as intellectually deep, but still very comprehensive and a lot more useful and usable, is Carl G. Liungman's Dictionary of Symbols. It has illustrations, groupings, big print and everything! Get it first, and if you then want to get way deep into the esoteric, maybe Chevalier is for you.Also, try symbols.com for a quick online reference. I find it pretty helpful, too.",
                "review/helpfulness": "76/93",
                "num_reviews": 93
            },
            {
                "review/text": "This is a thinker's dictionary, not a guide to road signs and icons. The editors took the trouble to recruit symbol experts from many different professions, ranging from the paranormal to the skeptical academic. The result is a dictionary with entries that have more depth than the usual &quot;quick hits&quot; that other symbolism dictionaries give you. Chevalier is not afraid to give contradictory or contrasting meanings of icons. (He is not a universalist, but a relativist.) He is usually careful to identify the culture in which a particular meaning is given. I keep this in easy reach on my bookshelf, reminding myself, however, that no dictionary on this subject can possibly cover all the meanings a symbol may have. It is worth having around.",
                "review/helpfulness": "76/79",
                "num_reviews": 79
            },
            {
                "review/text": "i have known this dictionary in the french original for about 20 years now and recommend it again and again to students. i have always hoped that it could become available for non french readers. finally! as a jungian analyst, i find the dictionary extremely helpful: it does an extraordinary job of displaying the breadth of symbolic meanings involved in so many symbols that are still very much alive in people today. the refence to various cultures is especially important in our multi-cultural world.. i am very thankful for this translation into english and hope the german translation will follow soon.",
                "review/helpfulness": "48/49",
                "num_reviews": 49
            },
            {
                "review/text": "I have about a dozen symbol books... most of the classics. This one is the best for interpreting those strange symbols in your dreams, daydreams, etc. It is not the shallow stupid interpretations &quot;you are going on a journey...\" stuff, but true archetypical and esoteric interpretations.",
                "review/helpfulness": "41/47",
                "num_reviews": 47
            },
            {
                "review/text": "I saw this book in the Spanish translation, a real encyclopedia full of graphics, alkaline paper, and hardback. Amazon sells this one ....This version in English is austere, printed on newspaper bad quality paper- the ink stains fingers, the pages rip as you turn them.This ... quality does a disservice to the authors, who have spent their lives compending this fabulous work.",
                "review/helpfulness": "25/35",
                "num_reviews": 35
            },
            {
                "review/text": "While this is certainly an interesting reference tool, the book Amazon keeps in stock as 'The Penguin Dictionary of Symbols' is not the one pictured. The book that this page leads you to believe you are buying is quite a bit shorter, but actually gives illustrations of the symbols (I used to own a copy of it). The book that Amazon sells on this page is a fairly useful reference book, but lacks the imagery of the one pictured, which some buyers may be seeking.",
                "review/helpfulness": "26/30",
                "num_reviews": 30
            },
            {
                "review/text": "My teacher recommanded this dictionary to me (she got a copy of original French version). After I got this book I had a quick check of it. However, I couldn't stop when I started reading it! I found myself being \"absorbed\" in this book! I read it not as a dictionary but a book full of surprise. Although there ain't so many beautiful pictures in this book, I'd still like to recommand it. But if you want a book full of pictures, just choose the Norton one.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "Hands down, the best resource of its kind available in print.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "As a resource for referencing symbols (by name not glyph), this book is one of the best I have found. Although more Eesoteric than, say, Archetypal, it provides much good information.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I purchased my first copy 10 years ago and have been working with my dream symbols for nearly 20 years. I've been enticed to purchase newer ones since then with photos and graphics ( I now have nearly a dozen symbol dictionaries) -- thus I am clearly drawn to these things.However, I find there is always a trade off. Publishing costs and space taken up for these visuals means less text and less substance. So while I have an initial pleasure in perusing the ones with pictures I often find these don't really have anything to do with my dream images -- they are indeed usually intriguing works of art but not particularly helpful for serious symbol analysis.Thus the most consistently helpful symbol book, to which I always return when I seriously want to know a range of possibilities for my dream images or concepts is the Penguin Dictionary of Symbols by Chevalier, Cheerbrant and Buchanan-Brown. The authors have done a monumental work bringing so much substance to it, managed to remain relevant for decades even though it was first published in France in 1969 with the second edition in 1982, and by now reading it is like coming home.A another benefit of being all text (seriously the text is not that hard to read, the print is of excellent quality with crisp deliniations between entries, references, etc.) is that the act of researching my dream images does not itself start interfering with the memory of my own visual image, as pictures might.To each his own preference ... but for persons more experienced in working with dreams, I think the substance here will be recognized as highly valuable.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "gertrude stein in words and pictures",
        "description": "\"After an astonishing, playful essay, the book opens into a revelatory combination of quotes, quips and 360 photos of Stein and her wildly brilliant circle.\"--Elle",
        "authors": "['Renate Stendhal']",
        "infoLink": "http://books.google.com/books?id=GXQThK7zpMUC&dq=Gertrude+Stein:+In+Words+and+Pictures&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "At last this book is back in print! Using Stein's words and pictures of her, her contemporaries and the places that were the backdrops of their lives, Renate Stendhal has created one of the most vital picture-bios of Stein and her era. The introductory essays at the beginning of each chapter set the stage for what follows, giving the reader a clear chronology and context. The excerpts from Stein's works are helpful in determining which of Stein's works(many of which are still in print) you'll want to read next. Everyone who was anyone in their crowd is here. A great gift for anyone interested in the literary/artistic period between WWI and WWII.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Stendahl's photographic bio of Gertrude Stein includes a treasure trove of photos of Gertrude Stein and her partner Alice Toklas, as well as many of their friends and acquaintances. Most of the texts are from Gertrude Stein's writings, though there are a number from friends, enemies, and even news clippings. Stendahl has managed to merge them all into a seamless, flawless whole that functions as a biography leading us from Gertrude Stein's childhood to her death.After finishing \"Gertrude Stein: In Words and Pictures,\" for the first time I feel as though I actually knew her, and I'm very pleased to have made her acquaintance. She comes across as a whole human being, strengths and weaknesses together, with penetrating insight, a great sense of irony and humor, and a warmth I would have like to have known first-hand. As a bonus, I feel I now understand what she was trying to achieve with her unique and controversial writing style.To apply my ultimate test to any book, yes, I was sorry when it ended and look forward to reading it all over again. And again.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "jerome robbins that broadway man that ballet man",
        "description": "An illustrated book of Jerome Robbins' life & work including previously unpublished excerpts from Robbins' personal journals & private letters. In theatre, dance & film, Jerome Robbins had one of the most significant & sustained creative careers of the 20th century.",
        "authors": "['Christine Conrad']",
        "infoLink": "http://books.google.com/books?id=ESL0AAAAMAAJ&dq=Jerome+Robbins:+That+Broadway+Man,+That+Ballet+Man&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If a picture -- in that old clich&eacute; -- is worth a thousand words, this gorgeous book is worth any number of doorstop-sized biographies. Using hundreds of never-before-seen photographs of Jerome Robbins and his friends, family, and associates (Leonard Bernstein, Aaron Copland, George Balanchine, Mary Martin, Irving Berlin, etc. etc), Christine Conrad has put together a stunning visual record of a great life in the theater, the first about Robbins ever to appear. Here are backstage and rehearsal pictures, family snapshots, rare clippings, production photographs, even reproduced pages from Robbins's own illustrated journals, with captions drawn from Robbins's published quotations; all are given context and coherence by Conrad's spare and perceptive text, which takes the form of introductions to the chronologically-arranged sections of the book. Her privileged, inside view of Robbins (she was, she tells us, a close friend of more than thirty years' standing) is never mawkish, cloying, or self-important; but in the end it is moving the way Robbins's own art, from &quot;Dances at a Gathering&quot; to &quot;On the Town&quot; to &quot;West Side Story,&quot; is moving -- because it is funny, tender, and beautiful.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "A lot has been written about Broadway legend Jerome Robbins, and much of whatbiographer Christine Conrad says has already been written. However, this book towers above any others in one respect. It is literally a pictorial biography of the theatre's greatest choreographer. From his birth to his death in 1998 the man is revealed in every aspect. Rare photos of the shows he has worked on and photographs reflecting his private life are throughout the book. Conrad does not go into excruciating detail on the problems some of his productions face: his well known temper; upbraiding actors in front of the cast; or the tantrum he had while &quot;West Side Story&quot; was trying out in Washington DC and Robbins, in a fit of pique, backed up and fell into the orchestra pit much to the delight of the actors. However, she does include all the highlights of his career and his early childhood. The book blew me away with the bevy of photographs. It is beautifully laid out and edited. A bit spendy but worth every penny. Any musical theatre fan will want this book on their shelves. Put your order in now",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "Sure, Jerome Robbins was one of the few genius innovators in theatre and ballet. But, perhaps, a book written by someone interested in the man's flaws as well as his accomplishments, his failures as well as his triumphs, might have been better reading. Cristine Conrad says in her author's note that she was Robbins' friend for more than 30 years. To my way of thinking, her friendship gets in the way of good reporting. I'm not necessarily looking for a hatchet job on Robbins, but a writer less interested in (what we used to call) brown-nosing, would, most likely, have written a richer book.Why did I give it even four stars? The huge, varied collection of photographs in this book is fascinating and invaluable for anyone interested in Musical Theatre or 20th Century American Ballet.The real, full version of Robbins' life is yet to be written/published.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "What an amazing tribute this book is -- not only to the genius of one of the greatest choreographer's in the history of dance and theater, but to the process of creativity as well. In this brilliant biography of Jerome Robbins, Christine Conrad has given us a work that can speak to every artist, working in every medium, about the passion and commitment it takes to create. Robbins is so eloquently captured on these pages, both in images, and in his own words, that I came away from the book feeling as if I had known him. And, feeling nothing but admiration for his courage, and his determination to excel. He truly was THAT BROADWAY MAN. It was so refreshing to read a biography about a famous person that focused on his work, and his success, instead of just dishing the dirt. I was not particularly interested in his failures; we all have them. I was interested in how he pushed through them and kept going...to give us a body of work so entertaining, and innovative, it literally takes your breath away. The book is absolutely fascinating. Cheers to Ms. Conrad for her intimate, insightful, and intuitive presentation of this extraordinary man.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "wagner remembered",
        "description": "\"Here is a life of Wagner told by those who rubbed shoulders with him in the course of his turbulent and turpitudinous three score years and ten. Few composers have led such eventful lives or excited such violent views. No one could be indifferent to Wagner, and his contemporaries were not slow to record their impressions of a man they either idolized or demonized. This is the story of how they remembered Wagner and how they wanted posterity to remember him. But it is also the story of his life told with immediacy, wit, affection and awe, all qualities that have largely been lost from later accounts of Wagner.\"--BOOK JACKET.Title Summary field provided by Blackwell North America, Inc. All Rights Reserved",
        "authors": "['Stewart Spencer']",
        "infoLink": "http://books.google.com/books?id=qwJrQgAACAAJ&dq=Wagner+Remembered&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A delightful book. It really is a must for anyone who is interested in Wagner. What emerges from Mr Spencer's skillful co-ordinating of personal recollections of Wagner is a fully rounded portrait of the composer, seen, as it were, through a kaleidoscope of time and chance. There are some charming vignettes of Wagner being entirely spontaneous, when for instance, he greets an old friend who has travelled far distances to be with him for a special occasion, and later, when he is hiding from importunate sightseers. Sometimes, of course, Wagner is less than pleasant, but when he is a musician among other musicians he emerges as a rather likeable man. When he is a famous figure holding his own among other famous figures one gets the impression of his need to dominate everyone and everything. I won't say anymore, I don't want to spoil it for you.It's a well constructed book, and none of the recollections are overlong. There is also a marvellous chronology of events that puts the time and place of each of these encounters within their historical framework.As I have said: A must!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Here is a fascinating collections of memoirs, letters, diary extracts and articles by people who spent time with Wagner.They show an extraordinary force of nature, a man of astonishing energy, by turns charming and unbearable, astonishingly quick both to rage and to forgive, and childish beyond belief. A famous example, given here, is the soiree where the guests - not Wagner's guests, by the way - briefly paid attention to another person in the room. Wagner solved the problem by screaming, literally, with rage; when the astonished company turned back to Wagner he carried on his &quot;conversation&quot;, or monologue, as if nothing had happened. Other less well-known stories appear here, illustrating a similar outrageousness. The ugly and unpleasant antisemitism is also fully represented. Though the different excerpts all find this mercurial man in different moods, all accounts have one thing in common: the writers are all aware that they have just encountered something absolutely extraordinary.Not appearing is (I've forgotten the original source and the exact form of the quote, though it's cited in a well-known article on Wagner by Deems Taylor) Wagner's own observation on what people who put up with his demands, financial and emotional could expect: they were well recompensed because they would be able to tell stories about having known Wagner, for the rest of their lives. He was right, of course, as this book, among thousands of others, so richly proves.This is an excellent portrait and resource book, offering a more vivid and arguably truer picture of Wagner than any of the available biographies. (Wagner may be the historical figure of whom secondary sources are most unreliable. With Wagner it ALWAYS pays to read the original source and NEVER to trust the commentator, some of whom should be thoroughly ashamed of themselves.)A fault is that we should have heard more from the musicians who knew Wagner: not the fellow composers, whose anecdotes are mostly well-known and appear here once again, but the orchestral players and others who played under him or worked with him at London, Dresden and of course Bayreuth: more especially on his rehearsing of the _Ring_ would have been most welcome. Among musicians Wagner is not only at his best as a human being, but also his most fascinating as a talker. His obiter dicta on his contemporaries, and even more on his great ancestors, are worth the price, but there could comfortably have been more.Still, a book which is both a fascinating read for the Wagner neophyte and a useful resource for the Wagner scholar: a great combination and an excellent book. Highly recommended.Cheers!Laon",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Wagner would be 'the man' for opera buffs, but for the non operatic, including this reviewer, Richard Wagner is a footnote in the historical consciousness from whom we hear an occasional note, vaguely associate with some powerful music out of the late 1800s, and ever that disturbing sense of an anti-Semetic presence. Wagner Remembered brings such vague recollections to life by anthology of sixty something third person accounts about the composer written by friends and acquaintences close in time to some encounter with Wagner. There are included written impressions by such as Queen Victoria, King Ludwig of Bavaria, Nieztsche, the son Siegried, a memorable erudite rendition by Judith Gautier, all ranging from the mundane such as the furniture in the house or the cut of the clothes to complex analysis of the bombastic personality. Rather than haphazard compilation, it seems that Stewart Spencer gives to us a laborious effort of intense scholarship honed in multiple libraries and academic back alleys, and the result of this unusual format in biographical form is a suprisingly complete picture of the total package. Spencer is unable to include everything and seems intentionally to omit anything written by Wagner or the wives, treats (as noted) only superficially with the deeper relationships with Berlioz, Nietszche and Liszt, and deals only thinly with the operas. Also receiving superficial treatment are Wagner's anti-Semetic views, and while from this volume it is clear that he has them, it is unclear whether those views reflect merely the nationalism and isolation of those times, or whether Wagner and this admitted and advertised prejudice from a position of influence contribute in part to the conflagration that was to come. What does transpire in Wagner Remembered is something we all recognize, namely that our perfect expectation of mental genius is too frequently disappointed as we are presented simultaneously with a kind and thoughtful gentleman, but also an intellectual bully, philanderer on both his wives, and unrepentant deadbeat, who viewed his mental qualities as placing him above the ordinary milieu. Perhaps Wagner was correct in this view of himself. Certainly the quintessential experience of listening to a Wagner prelude creates to some extent the illusion or reality, take your pick, that the enormous talent does overshadow everything else. Credit Stewart Spencer with giving us an splendidly successful volume about a fascinating life.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This interesting little book is a collection of rather brief eyewitness accounts of people who actually met Wagner. It is entertaining, and endlessly fascinating. However, the veracity of many of these memories is questionable, so the reader has to be careful about accepting the text at face value. I recommend it to anyone who is interested in Richard Wagner, keeping the previous caution in mind.Literature about Wagner is not in short supply, and neither are analysis, critiques, and essays about his personality and behavior. It is refreshing to read first hand reports about him from a variety of viewpoints. On the other hand, many of these brief letters and diary entries were written many years or even decades after the fact. Some are obviously colored or altered by the eyewitness for various reasons. The childhood reminisces by Avenarius (Wagner's half-nephew) is a laughable prevarication, yet most writing about Wagner's childhood is based on it. Likewise, the account of Wagner's death by someone who was not there is also manufactured from whole cloth.I do have a few objections to the book's format. Each chapter merely has a year span as its title (1813-42, 1842-49, 1849-58, 1858-64, 1864-72, and 1872-83). There is no listing in the table of contents or chapter heading of the names in that chapter. Also, the date the reminisce was actually written is usually not listed. Likewise for the specific date the encounter supposedly occurred, even then only in an elliptical footnote.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "If you want to know Wagner's personality, this is the book to read (and it might suprise you.) This is a chronological series of recollections from those who knew him. What will strike anyone who reads it is the disconnect between his current reputation, which is almost universally negative and one-dimensional (i.e. a liar, a cheat, a meglomanic, anti-semitic, facistic, ad nauseum) and his true multi-faceted personality. While all his human flaws are evident, so are his many wonderful characteristics: his extraordinary charisma and energy, amazing organizational abilities, sense of humor, acting and mimic ability and his general lust for life. The descriptions of his frenetic nature and tour de force monologues brought Robin Williams to my mind (and I think he should most definitely play him in a movie!) This book is one of the true gems in the Wagner literature.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "walker evans lyric documentary",
        "description": "Walker Evans's career spread over 46 fitful and prolific years, yet in a scant two, 1935-1936, he produced the singular body of work that came to define him. During that brief time, while working for the Farm Security Administration (previously the U.S. Resettlement Administration) photographing the consequences of the Great Depression, he refined a hybrid style that combined documentation with sly personal comment. He delighted in traveling incognito as an artless photojournalist, but with the independence to satisfy his own artistic designs. Walker Evans: Lyric Documentarypresents these seminal images for the first time as a comprehensive, cohesive body of work, in chronological order. These are prime examples of Evans's alchemy, his seemingly effortless transformation of mundane fact into sweeping lyricism. They not only define his mature style, but also offer a path for artists of future generations. Evans has been called the most important American artist of his century, and the impact of his vision reaches well beyond the province of photography. With texts by John T. Hill, Heinz Liesbrock and Allan Trachtenberg.",
        "authors": "['Walker Evans', 'John T. Hill']",
        "infoLink": "http://books.google.com/books?id=zlrKQgAACAAJ&dq=Walker+Evans+Lyric+Documentary&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "At once a splendid coffee table book and an impressive work of original scholarship, \"Walker Evans: Lyric Documentary,\" by John T. Hill, has much to please nearly everyone. The duotone black and white reproductions are sumptuous, among the finest I have seen. They illustrate Evans' seminal production during the years 1935-36, photographing for the US Government's Farm Security Administration during the Great Depression. Their selection, presented in chronological order, is a fine mix of the familiar - many of Evans' greatest images - with lesser known works and variants. Of particular interest to me is a plate comprised of two consecutive exposures that the author has joined together into a powerful panorama (pp. 158-59), a risky move that he manages in bravura fashion.John T. Hill has written, co-written, or edited, to my count, at least nine books and catalogs on Walker Evans, including \"Walker Evans First and Last,\" \"Walker Evans At Work,\" \"Walker Evans The Hungry Eye,\" \"Walker Evans Simple Secrets,\" and \"Walker Evans: Havana 1933.\" As Evans' friend and colleague for ten years at Yale University, and then as executor of Evans' estate for twenty years, John Hill is uniquely qualified to discuss the photographer and his work. And as a printer of Evans' photographs for nearly forty years, Mr. Hill possesses a thorough understanding of this photographer's oeuvre and intentions.John Hill's two essays - one on an unpublished lecture Evans gave at Yale, illustrating what the photographer called his \"aesthetic autobiography,\" and the other a short history of Evans' book publications within the context of their times - are important additions to Evans scholarship. Additionally, Alan Trachtenberg has provided an illustrated essay comparing the image selection and sequencing of the two major editions (1941 and 1960) of Evans' and James Agee's \"Let Us Now Praise Famous Men.\"Of the countless books and articles that have been written about Evans in the thirty-plus years since his death, \"Walker Evans: Lyric Documentary\" is among the best. It is one of a few that I would classify as an essential Walker Evans book.Rodger KingstonKingston is the author of \"Walker Evans In Print: An Illustrated Bibliography.\"",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is the only book I know of that contains Evans' own account of his aesthetic genesis with illustrations of his visual sources. Excellent essay by John T. Hill, who was a colleague of Evans at Yale University. Particularly noteworthy are the very finely reproduced plates of the seminal work of Evans during the years 1935-36. These are easily the best reproductions of Evans photographs that I've seen. A scholarly work and an important research tool.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Walker Evans' famous gift as a photographer is said to be his ability to erase himself as the creator of the images he captured, but he was there, of course, and made the necessary artistic judgments that distinguish his work. John T. Hill's masterful book, \"Walker Evans: Lyric Documentary\" is, in every way, an apt tribute to Evans' artistry.Giving us a comprehensive presentation of the best work from Evans' most creative period is valuable enough. Yet Hill has provided something equally wonderful and useful, by illustrating what Evans called his \"aesthetic autobiography.\" Using an unpublished lecture at Yale, in which Evans identified works of art, architecture and science he viewed as inspirations for his work, Hill furnishes compelling examples from these artists as visual annotations to Evans' work.The result is exactly what one would hope for--not a laborious reinterpretation or egotistical \"appreciation\" of these great photographs, but a vivid presentation of the images themselves in a fashion that invites interest in the background material as an additional reward for the viewer. \"Walker Evans: Lyric Documentary\" is John T. Hill's fifth book on Evans and provides new insights into the work of the legendary photographer, considered by many to be the greatest artist of our time. This book is a great achievement by Hill, although fittingly, the reader will scarcely notice the skilled editorial hand shaping and ordering these powerful photographs that need little adornment.Randall Roden",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "holy terror",
        "description": "In the 1960s, Andy Warhol's paintings redefined modern art. His films provoked heated controversy, and his Factory was a hangout for the avant-garde. In the 1970s, after Valerie Solanas's attempt on his life, Warhol become more entrepreneurial, aligning himself with the rich and famous. Bob Colacello, the editor of Warhol's Interview magazine, spent that decade by Andy's side as employee, collaborator, wingman, and confidante. In these pages, Colacello takes us there with Andy: into the Factory office, into Studio 54, into wild celebrity-studded parties, and into the early-morning phone calls where the mysterious artist was at his most honest and vulnerable. Colacello gives us, as no one else can, a riveting portrait of this extraordinary man: brilliant, controlling, shy, insecure, and immeasurably influential. When Holy Terror was first published in 1990, it was hailed as the best of the Warhol accounts. Now, some two decades later, this portrayal retains its hold on readers-as does Andy's timeless power to fascinate, galvanize, and move us.",
        "authors": "['Bob Colacello']",
        "infoLink": "https://play.google.com/store/books/details?id=C4UpAgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Terry Eagleton has written an excellent, albeit dense, history of terrorism. Eagleton's argument is that terrorism is actually a modern method that has its roots in the French Revolution.Eagleton's work is both well reasoned and researched. If you want a good, solid general survey about terrorism history, then this is the book for you.",
                "review/helpfulness": "15/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is very much a philosophical reflection on the idea of terror, as it is on concepts such as life, death, love, desire, good and evil. Eagleton asks us to think critically about what these words imply, instead of accepting interpretations which we may have inherited.It is extremely theorectical, very much academic and written in a style can feel like the author is deliberately trying to exclude readers. It is full of specific literary references - most of the time it doesn't make a huge difference if you don't know the work in question,but other times it does. Eagleton slows down for nobody, nor is he one to offer explanations for certain things where they might be needed.This book is not about international relations, foreign policy or the differences between civilizations. It is a reflection, and as such it works very well indeed. Overall a commendable piece of work.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            }
        ]
    },
    {
        "Title": "dictionary of gnosis western esotericism",
        "description": "This is the first comprehensive reference work to cover the entire domain of \"Gnosis and Western Esotericism\" from Late Antiquity to the present. It contains critical discussions of all its major authors, currents and manifestations, from Gnosticism to the New Age.This one volume edition is an unabridged version of the two volume edition published in 2005.",
        "authors": "['Wouter J. Hanegraaff']",
        "infoLink": "http://books.google.com/books?id=QKtzQgAACAAJ&dq=Dictionary+of+Gnosis&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book might be called 'Everything you wanted to know about religious subjects that lie outside the mainstream of Christian, Jewish, or Islamic religions.' In fact, although this is a book on Gnosis or Gnosistism, it admits (unusual for a dictionary) that Gnosis is a word that really can't be defined. At the very least, the concept of Gnosis has changed over time from a pejorative word to one with a presumption that it had to do with organized opposition to the early Christian church.The book is in dictionary format, more or less, with the understanding that it contains some 400 entries. 400 entries spread out over 100 pages comes out to three pages per entry. And in actual usage, the page count is not even. 'Neoplatonism' for instance runs 8 pages, 'Perennial Philosophy' has only one word: Tradition.There were approximately 180 contributors to the book, each an expert in a particular field, and coming from a world-wide range of countries. The main editor, Wouter J. Hanegraaff is a professor at the University of Amsterdam and the compilation of this work represents a task lasting six years, followed by two more years of work in producing the book. This book represents a momumental first effort. And it is likely to become a standard text in the field. I expect that over the years there will be later editions, but not frequently. It belongs in every religious library.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is absolutely a treasure of dictionary, very well edited by scholars of this important field of ancient studies. Beautiful edition in hard cover, with the latest information on gnosticism, manichaeism and everything esoteric, but, best of all, from the point of view of serious scholars, which make this book such a great tool for the biginning of any scholarly research in these hidden fields of religion. Absolutately worth buying!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Dictionary of Gnosis & Western Esotericism. Edited by Wouter J. Hanegraaff. Leiden and Boston: Brill, 2006. Hardback, xxix + 1228 pages. ISBN 9004152318Since other reviewers, in pointing out what a superb reference work this book is, have done a good job of describing its contents, I will confine myself here mainly to a few remarks about its physical format and layout.The book is beautifully printed in double columns and in a somewhat tiny font on quality paper. It is stitched (or Smyth-sewn) in signatures in the traditional way so that when opened flat the spine will not crack and the pages will not fall out. And it is bound in decorative blue paper-covered boards (although cloth would have been preferable as I get the feeling that the paper will rub and wear quickly).The front cover features an interesting copperplate illustration taken from a book by Jacob Bohme (1682). Sadly this is the only illustration present and I feel that the book, since it's really more of an 'Encyclopedia' than a 'Dictionary', would have been even more interesting than it already is if room could have been found for photographs of at least some of the more important persons, places, and items discussed.The articles I have so far read were, as is to be expected, scholarly, objective, and well-written, with all of them followed by quite full and up-to-date bibliographies in which some of the editors have conveniently placed the English titles in a separate section.Following the Introduction are two lists - a 'List of Contributors' and a 'List of Entries.' And at the end of the book we are given two indexes - an 'Index of Groups and Organizations' and an 'Index of Persons' but, surprisingly, no 'Index of Subjects.'What this means in practice is that if, for example, we want to read up on the Nag Hammadi finds we are going to have poke around until we discover GNOSTICISM II: GNOSTIC LITERATURE where we will find 'The Nag Hammadi Library' covered on pages 419-420. Clearly then, to make full use of this Dictionary, it might be wise to first familiarize oneself with its contents. But this really isn't the chore it may sound as the book is full of pleasant surprises and I'm constantly running into things I would never have expected to find.As for the price, considering the sheer amount of material in this book, an amount equivalent to at least five or six standard scholarly paperbacks, and considering also the ridiculously inflated prices being asked, for example, by an academic press such as Oxford University Press for books of vastly inferior quality such asThe Early Poems of John Clare, 1804-1822: Volume I (Oxford English Texts)(regarding which see my review) the price of this dictionary seems quite reasonable.All in all, then, I can recommend this book as an authoritative, well-produced, up-to-date and fascinating compendium of interesting and useful information. Dr. Hanegraaff and his team are to be congratulated on having provided us with such a superb reference work, while Brill is to be commended for having honored it with such a fitting and handsome format.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a dictionary of narratology",
        "description": "History, literature, religion, myth, film, psychology, theory, and daily conversation all rely heavily on narrative. Cutting across many disciplines, narratology describes and analyzes the language of narrative with its regularly recurring patterns, deeply established conventions for transmission, and interpretive codes, whether in novels, cartoons, or case studies. Indispensable to writers, critics, and scholars in many fields, A Dictionary of Narratology provides quick and reliable access to terms and concepts that are defined, illustrated, and cross-referenced. All entries are keyed to articles or books in which the terms originated or are exemplified. This revised edition contains additional entries and updates some existing ones.",
        "authors": "['Gerald Prince']",
        "infoLink": "https://play.google.com/store/books/details?id=MVwJEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This is a highly useful dictionary. Although its entries total to just over 100 pages, it is remarkably complete. Prince offers short, to the point explanations of terms that in other dictionaries are notoriously fuzzy explained. Moreover, he provides a very helpful set of crossreferences that goes with each entry, thus enabling the reader to find out more. Among the outstanding explanations is the description of point-of-view, in which Prince sets forth the proposals of Friedman, Genette and Stanzel complete in just two pages. Useful bibliographical references substitute for the fact that Prince could not adress every controversial discussion in full. Everyone interested in literary theory should own a copy, even if the work was not updated to take aboard recent developments.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Although I agree with others who claim that this book is essential to those studying narrative, I disagree with respect to its quality. This IS a necessary volume, in that there are many terms specific to narratology that cannot be found elsewhere in the format of a literary dicitionary. This is a very specific way of approaching literature, so naturally its vocabulary is unique. Owning this book can in many instances save hours of study within other tomes.HOWEVER, the quality of the definitions themselves vary greatly. Many definitions are fantastic, and very complete. They take into account the views of more than one theorist, and that's great. In fact some definitions take up to 3 pages, but other terms are so minimally defined that one is essentially referred to another term in the book, and that's it. And although the bibliography is very complete, it is not annotated.So the bad news is that if you're a student, you're still going to need to do a lot of reading (especially of those books mentioned in the bibliography) and cull through that info to get to a good working definition of some terms. You may want to consider the Penguin Dictionary of Literary Criticism in addition to this book; that one will certainly save time, but it is not geared toward narratology specifically, so you will need both books.All in all, if you're a professor or student of graduate level English, you do need this book. Just don't expect the heavens to part once you've bought it.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "in my own voice memoirs",
        "description": "One of the greatest mezzo-sopranos of postwar opera, Christa Ludwig recalls her long and lustrous career singing for two generations of adoring audiences, under the batons of such conductors as Klemperer, Karajan, Solti, and Bernstein, in the great opera houses of the world. Her memoirs make clear why Bernstein said of her, \"She is simply the best, and the best of all possible human beings.\"",
        "authors": "['Christa Ludwig']",
        "infoLink": "http://books.google.com/books?id=_FgwYOFUO_4C&dq=In+My+Own+Voice:+Memoirs&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Christa Ludwig's powerful performances of Carmen, Ortrud, the Dyer's Wife, and others are treasured memories of many opera lovers and record collectors (including me!). And so it's most welcome to have her memoirs and even more so because of her refreshing directness and candor. She tells about her career with honesty, humor, pride, and humility. A very nice selection of photos are especially welcome to those of us who enjoyed her onstage.Regina Domeraski's translation is an admirably smooth-flowing narrative that lets Miss Ludwig's personality come through clearly.Most highly recommended.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "Christa Ludwig is inarguably one of the greatest singers and musicians of this or any time. A mezzo-soprano who also made at least one classic recording of a great soprano role (Beethoven's Leonora in FIDELIO), Mme. Ludwig was, in addition, a probing and insightful recital and concert artist. Mme. Ludwig's memoir, expertly translated by Regina Domeraski, reveals a deeply committed artist who is also a human being who has lived a full life, and has no reservations when it comes to talking about either. If you have read any of Mme. Ludwigs's numerous interviews, you will know that she is a frank, uninhibited, witty and no-nonsense person. She is as comfortable talking about Harry Belafonte in Carmen Jones as she is talking about Schubert and Brahms lieder. Very few autobiographies by celebrated opera singers tell you as much about their subject as this one does. If you've read this far, you'll want to have it. Trust me....",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Christa Ludwig was, in my opinion, the greatest German mezzo of her time, in both opera and lieder, and, as someone else says in an opera review on Amazon, the greatest Elektra that never was and the greatest Brunnhilde that never was. And she is also, as you can see from her engaging book \"In My Own Voice,\" a person of wit, honesty, an exuberance for life, and and with an ability to talk about her gifts and her life that both recognizes what she has and puts it in perspective. As she quotes from the Schubert lied \"Geheimnis,\" in the close of her book:So geht es auch dem Sanger,Er singt, erstaunt in sich;Was still ein Gott bereitet,Befremdet ihn wie dich.So it is also with the singer,He sings, amazed at himself;What in silence a god made,Amazes as well as you.Ludwig talks about her early life, born into a singing family, in Nazi Germany. She takes us through her career, but she tells us much more than a recital of what she sang, when and where. The most fascinating part of this book for me was the description of each of her major operatic roles - which ones she especially enjoyed, the joys and the challenges (and the roles she would like to have sung). She doesn't indulge in gossip, and is generous about her colleagues. She talks about conductors, houses, preparation, and the often lonely and difficult life of a singer.And she shares with us her introspection about herself and her art. \"Was it worth it? What was the meaning?\" I am so greatful to be able to read about Christa Ludwig \"in her own words.\"",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    }
]