[
    {
        "Title": "the koehler method of dog training",
        "description": "When the complexities of modern living demanded that, for his own protection as well as his master's convenience, the dog be made controllable, the average owner sought advice from the most available source, which was, too often, some local dog-show exhibitor. Not realizing that, excepting a few praiseworthy individuals, these exhibitors were only superficially concerned with the qualities of use and companionship, an unfortunate dog owner would accept the sight of trophies or ribbons as the credits of an expert. Growing numbers of people and dogs continued to emphasize the advantages of proper dog-behavior and when, in 1935, The American Kennel Club instituted its obedience trials, the competition necessary to focus attention on results and improvement of methods was provided. And something else was observed. It was evident that thorough obedience training does more than assure a dog's response to his master's command; capacities for learning and emotional stability could be increased and integrated as permanent qualities of character. Recently, leading magazines of both general and specialized nature have made the public aware of the trained dog's potential, and of the recreational possibilities of dog training as a hobby. Interest in dog-training classes and other activities where dogs are dignified by usefulness, rather than merely looked at, is evidence that the dog-training public has outgrown the \"make a game\" and \"tid-bit tossing\" techniques that, by not being founded on positive and proper motivations, demonstrate the inadequacy of the master, thus promoting failure of response at those times when control is most needed, as well as contributing to the dog's feeling of insecurity. Dog owners of perspective have come to want the type of obedience upon which a blind person might stake his life, and the emotional stability that is vital to dogs in the presence of small, unpredictable children. This classic includes the following chapters: Introduction Lesson I. Fables and Foibles Lesson II. Correct Equipment Lesson III. The Foundation Lesson IV. Heeling Lesson V. Sitting Lesson VI. The Automatic Sit Lesson VII. The Sit-Stay Lesson VIII. The Down Lesson IX. Down-Stay Lesson X. Stand-For-Examination Lesson XI. Recall Lesson XII. Finish Lesson XIII. Polishing Lesson XIV. The Throw-Chain Lesson XV. The Light Line Lesson XVI. Don't Lose It-Use It Problems",
        "authors": "['William R. Koehler']",
        "infoLink": "https://play.google.com/store/books/details?id=DnMDDAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "No training method works for all dogs, but the Koehler method comes close. I read this book thoroughly before using it to train my dog, an American Pit Bull Terrier. I recommend it on the basis of the results I achieved with my own dog. My Pit Bull is a happy, calm, sweet animal who is well behaved and trustworthy even in crowded, distracting public places. Please note the notarized statement in this book attesting to the author's success in training thousands of dogs. A well-trained dog is a joyful companion and something to be proud of. As for the &quot;brutality&quot; ascribed to this training method by its detractors, I &quot;corrected&quot; my dog with the choke collar only three or four times - always for something potentially dangerous (with a big and strong dog like a pit bull) such as running wildly on the long training lead. Most of the time, during the routine exercises, the dog corrects himself. Essentially he is given a choice between discomfort and comfort. If he makes the right choice he avoids discomfort. This does not assume the dog is human - it respects the dog's intelligence and ability to make choices. This book helps you to train a dog to be obedient off leash under highly distracting conditions. I knew my pit bull had graduated the day I was allowing her to run around on a 30' lead and another, loose pit bull appeared out of nowhere. This animal ran up on my dog, she surged after it, and the worn lead parted company with her collar! I called my dog to me, and she came and stood in front of me. I told her to sit, and she did so, allowing me to tie the broken ends of the leash together - with this maniac nuisance dog running circles around us all the while.I tried using food to motivate my dog but she became intensely focussed on the food rewards in my pocket. In Koehler training, the dog is supposed to be attentive towards you, not your pocket! With the firm foundation of obedience training, I am now able to teach my dog all kinds of tricks. Trick training is FUN training so I have no problem using food rewards to teach tricks. My dog can jump through a hoop, etc. However, obedience training is serious business that can one day save your dog's life. I feel the Koehler method is particularly valuable with big, strong breeds such as pits and rottweilers that can cause so much trouble when they are NOT properly trained. I thank this book for the wonderful, reliable pit bull friend I have today.",
                "review/helpfulness": "116/131",
                "num_reviews": 131
            },
            {
                "review/text": "Let's be straight -- Bill Koehler loved dogs. In fact, he loved and respected dogs a whole lot more than some of today's \"big name\" trainers who refer to dogs as stupid creatures, incapable of thought or responsibility, only able and willing to work for a cookie, because they are nothing but selfish \"lemon brains.\"I am a professional dog trainer who came up through the ranks of the \"positive reinforcement\" school of training. I was taught to use cookies and praise to get dogs to behave. And most of all, NEVER correct a dog -- that's cruel and outdated. Well, the \"all positive\" method of training does work -- to a point. But I found, time and time again, that only using positive reinforcement did not create reliable, 100% consistent behaviours. Where this was most obvious was on the recall -- let's say your dog is off leash at the park, and he takes off after a squirrel. And you're going to try to call him back and give him a tidbit? Most dogs would just keep on running. And to my mind, as a professional trainer, that was unethical and immoral, to send my clients out into the world, knowing full-well that their dogs were not safe, because their behaviours were not reliable.The Koehler method makes commands reliable. And it does so without abuse, fear, or beating. Bill Koehler belived that it was far kinder to a dog to respect the dog's intelligence, to show the dog the clear contrast in consequences that occur when choosing between one course of action (say, heeling) over another (not heeling, and receiving a SINGLE forceful, well-timed correction). Correct the dog once, properly, the first time, and let the dog make his own choices after that. In fact, Koehler believed it was completely CRUEL to a dog to consistently nag it, over and over again. Witness the \"positive only\" crowd using gentle, nagging leash tugs, saying \"Heel heel heel heel heel\" in a chanting manner. Drive your dog crazy, it would.The Koehler Method is a complete method of dog training that works on three parts:1) show the dog what you want them to do, and praise him for making the right choice.2) practice with the dog until you are sure he knows what you want him to do, and praise him for making the right choice. If he doesn't make the right choice while he's learning, then show him again.3) once the dog knows what is expected of him (that is, after lots of practice), then \"proof\" the command by providing lots of distractions for the dog. If he chooses the right behaviour (and remember, this is only if he already KNOWS what is expected), then praise him. If he chooses the wrong behaviour, correct him firmly, correct him once, and give him the opportunity to make the right choice.You'll read reviews that go on and on about hanging, drowning, and beating dogs. Yes, Bill Koehler DID say those things. He said those were methods to be used if the next stop for the dog was a one-way trip to the pound. They were never intended for your average family dog.Buy the book, read it. Find a reputable trainer through the International Association of Canine Professionals, and get someone familiar with the Koehler method to help you out. But don't let the \"positive only\" crowd make up your mind with ranting and rhetoric. If you care about your dog - if you care that your dog will be able to respond to commands reliably, and therefore be safe -- you owe it to yourself to check out this book.Jill Skorochod, CPDTMember, APDT, CAPPDT and IACPTime and Patience Dog Training Ltd.",
                "review/helpfulness": "81/92",
                "num_reviews": 92
            },
            {
                "review/text": "This is a very easy to follow, effective book for training dogs. This is NOT a book for owners with dog problems (or dogs with owner problems). If you just want to train your dog by using proven, conditioning techniques, then this is the book for you.In a nutshell, this book teaches you how to ensure that your dog is paying attention to you at all times, and either obeys your commands, or suffers the consequences of his actions. This is NOT punishment. The dog decides. The dog learns. The dog obeys because he decides to obey. This not only gives him self-confidence, but also gives him a feeling of security because he knows he is doing the right thing. Dogs crave this. They WANT to please you.Basically, you start with a long leash and a choke collar. You start walking in one direction. Of course, your dog will bound off ahead of you. At that point, you reverse direction, and walk the other way. The dog learns pretty quickly that he better keep an eye on you if he wants to keep from getting jerked around.It goes on from there, and the lead gets shorter and shorter. The dog learns to HEAL, SIT, STAY etc., but basically you are conditioning the dog to think he is on lead all the time, and has NO choice but to obey or come when called, and, he is always paying attention to you. This is KEY!If your Jack Russell sees a rabbit running across the road in front of an oncoming car, do you think he will come if you have a treat in your hand? Is he going to look both ways before crossing? No way. But if he has been conditioned to think that if he doesn't come, you'll just jerk his chain, he won't hesitate. He'll stop in his tracks, turn, run back to you, run right around behind you, and sit down right beside you... No kidding.[Keep in mind that to get to this point takes months and months of training for at least 30 minutes a day. This is not a miracle training book]I have used it and it works, plain and simple. Also, you can stop at any time, and still gain some control of your dog on lead.There is no punishment involved as part of the training of the dog! The dog gets to decide what he wants to do.I trained my first dog this way, and it worked perfectly. I never hit, drowned, beat, etc., because that's not part of the training!All the negative comments on this book have to do with either the last chapter or just plain ignorance. The last chapter deals with a subject the author probably should have left out, that is, dealing with problem dogs that are on their last chance before being put to death. Don't bother reading it. If you have a dog that bad, you've got a problem you can't solve on Amazon.com!Others try to equate a dog's mentally with that of a human. Dogs do not perceive, process, or analyze information the way humans do. Comparing how you would feel if you were treated the way a dog is treated is incorrect.I just got a new dog, and I want it to be happy and love life. The Koehler method helps set expectations the dog understands and can achieve, which in-turn keeps him happy and safe at the same time.Good Luck!",
                "review/helpfulness": "47/53",
                "num_reviews": 53
            },
            {
                "review/text": "We have gone too far. If you were to smack the hand of your precocious 5 year old just before she stuck the metal hanger in the electrical outlet, she could, if she knew the law, call 911 and report a case of child abuse. I suspect that most municipalities would ignore the call after the parent demonstrated to the responding constable that there was, in fact, no abuse going on, but who knows. In a time when an establishment can be sued for serving hot coffee that's \"too hot\" you can never tell.Enter the Koehler Method.The book uses \"corrections\" and not rewards. Very non-PC. That's it in a nut shell. Food versus corrections. Honestly, they both work for \"most\" dogs and I use both in training. And I would even go so far as to say that if it's just tricks and games that you are interested in, than go with food and forget this book. BUT if your dog pulls you down the street, if you hear yourself saying, \"Fido, come... come... come... come... come... or Fido down... down... down...\" then please consider the Koehler method. It could save your dog's life. (I'm assuming you won't be saying \"Fido\" if that's not your dog's name, but you get the idea.)The mistake people make when they criticize any dog obedience program that uses corrections is confusing obedience with training. Obedience IS NOT training. I would never use nor would I advocate using any corrective measure on a dog that didn't know how to perform a given command. Imagine your 8 year old is learning the times table. You ask her what's 4 times 4. She says 12. You slap her in the face. Horrible. What kind of a parent are you? No, what you do is patiently go over them, using whatever works so that she learns the times table. Now change the game. She's 16 and just flunked her history test, because she didn't study. (Yes, she's smart, has had good grades and chose to play war games across the internet with her friends until 2 am instead of studying). What do you do, withhold a piece of cheese? No, you ground her. No TV, no malls, no weekend. (Assuming you are a good and caring parent.)That's what obedience is all about. Obedience is teaching the dog to perform an action (or to stop performing an action) on command, and NOT when the dog chooses to.First, you teach your dog an action. You do this patiently, in short lessons. You can use food, petting, favorite toys, whatever you want during the training phase. You want to make sure that the dog really knows what you are asking them to do (or not do).But after you are sure they understand the command that you are asking them to perform, they need to be corrected when they don't do what they are asked to do. In fact, they actually learn to perform the action on command by not doing what they are asked to do and receiving a correction. Praise is important. Studies show that dogs don't' do things for praise. But you are going to praise your dog after the correction and AFTER they have done what they are supposed to do to eliminate any feelings of fear. And make the praise loud and clear when they've done what you ask. If your dog's ears are flat against her head and her tail is down, she is not happy. When I am working with a dog, after a correction, my intent is to get that tail wagging and her ears up (which of course is impossible for beagles, but again, you get the idea)There is the mistaken belief that you're \"hurting\" the dog. Annoying the dog yes, but a properly performed correction doesn't hurt as much as it gets the dog's attention. Some dogs have problems with their esophagus, e.g. Pomeranians, so corrections with these dogs have to be done very carefully, but for the majority of dogs, their necks are quite muscular. In fact, it is the muscles of the neck that a dog uses to kill it's prey by forcefully whipping it back and forth and ultimately breaking it's prey's neck or spine.I mentioned \"properly performed\" corrections. Anything done poorly produces poor results. The Koehler Method is simply a collection of descriptions of technical actions that have been used on thousands of dogs. It is these descriptions that are the entire purpose for reading the book.Ask any K9 officer how his dog was trained. Food is not a reliable obedience technique. Period. Especially for recall (the official name for \"come.\").Why do I mention this to people who just have pets? The entire reason, the ONLY reason to buy this book is to protect your dog. If you live in the city or the suburbs and your dog can wander out into traffic, then you need the dog to be obedient.On the other hand, if you live on a hundred acre farm, your dogs are smarter then most (and won't run in front of your tractor as your tilling the fields or mowing the lawn and you really just want your dog to learn how to do back flips, play dead, or bring your slippers, this book won't be for you.One more thing. There are techniques Koehler suggests for \"misbehaving\" dogs that I won't use. I am sure they will work, but I choose not to do them. I can live with some mischief. (My dogs love moving my hand when I am typing - I pet them, tell them to stop and of course, they don't.)And while I am at it, let me be clear about \"most.\" Most methods work on most dogs and that goes for the Koehler method, as well. But there are certain dogs that it won't work on. You probably won't have one of those, but if your dog is people aggressive, even slightly, or your dog is fearful, you need a professional. For those dogs, you need an animal behaviorist. Check out http://www.animalbehavior.org/Applied/CAAB_directory.htmlThis is pretty much the only obedience book you'll ever need. And I unabashedly recommend it even in this current environment of political correctness. So read all about learning how to teach your dog how to walk peacefully on a lead, the \"automatic sit\" (which appears amazing to people), turns to the left and right, stay, down, and the long down. Skip the chapter on the throw chain and pick up on the \"light line\" which introduces recalls and commands from a distance.If your dog does all of these on command, she will be happy and you will be happy...and you can even get a diploma from the AKC when \"Fido\" passes the Good Canine Citizen test. http://www.akc.org/events/cgc/program.cfmSave the cheese for you.",
                "review/helpfulness": "42/48",
                "num_reviews": 48
            },
            {
                "review/text": "First let me start by saying that I have read many of these books offered as &quot;more modern&quot; or &quot;less Harsh&quot; or &quot;more humane&quot; by some of the well meaning persons in their reviews, suggesting that these more gentle, positive reinforcement books would provide a more effective and appropriate alternative than that evil, antiquated Koeler book. Well, thank you for your advice;next time I will know better than to listen to you! When I received the Koehler book, I was struck with what I thought was harsh treatment of the dog. Because of my ignorance, due in part to the &quot;well meaning&quot; reviews offered here, I followed these books until I had a very strong, very aggressive dog that Koehler calls a &quot;real hood&quot;. After only two weeks of following his methods by the book, I found that I did not have a bad dog; I had a great dog. I also had very bad information concerning how he should have been trained. He should have been trained exactly as Koehler suggest. He turned around amazingly fast. He and I are much happier,healthier, and everyone is much safer. He is now rapidly becoming a truely fantastic animal. His amazing drive is now used only for task which I assign him. He no longer attempts to attack me or my children for messing with his food or touching him the wrong way. I can not believe the rapid progress, and I feel horrible that I put him and my family through this when it was completely unnecessary. I watched my father use similar methods for 25 years as we raised Working GSD's, but I had thought that certainly people by now had to know more than my Dad and Koehler. They Don't! I will say it again. THEY DON'T! I know it looks tough, but it is tough love. If you have a real dog, this is an absolutely amazing tool. You must use it just as he says. It works. I did not believe it at first, but it was this or to a shelter. That is cruel! He would have been killed. For what? Because I listened to what sounded good rather than what worked good. It will not happen again! Thank you Mr. Koehler! You saved me from destroying my dog with &quot;kind&quot; training methods. He is now my best friend! Thank you for your book! Oh, Dad, you were right again!",
                "review/helpfulness": "33/43",
                "num_reviews": 43
            },
            {
                "review/text": "first off, if you take anything out of context you can twist it around to voice your opinion. the so-called \"abusive\" tactics previously pointed out were for extreme situations of aggressive and dangerous dogs. do you really think a snapping and biting animal is going to be adequately trained by cooing and puppycookies? get a grip.if you want to know what this method DOES achieve, try a very neurotic and hyperactive irish setter disoriented and half-doped on tranquilizers after being stationed on a plane in a cage next to a baby panther on an overseas flight - said irish setter gets loose on the flightlines of LAX, no one can catch her because she's scared witless by airplanes and people chasing her. the only thing that worked? her Koehler obedience training and commands that reminded her and brought her to safety.and, as a previous reviewer said, READ the BOOK. TWICE. Koehler was already armed with the credentials, logical explanations, and educational tools to discredit those who want to cry abuse.",
                "review/helpfulness": "32/42",
                "num_reviews": 42
            },
            {
                "review/text": "Koehler's methods are considered unusually harsh and counterproductive by some modern trainers. On the other hand, his methods do have a history of success with dogs that have &quot;hard&quot; temperaments. It's worth nothing that modern-day competitive obedience dogs are not trained with his methods anymore.In general, after my own experiences with training dogs in general, and helping others learn to train, I believe that Mr. Koehler had a gift for timing and for unemotional corrections. However, for many, trying to utilize his methods can lead to psychological abuse of some dogs (especially softer and more sensitive ones) when their trainers do not have a good sense of timing or allow their anger to take over when correcting.I consider this book of historical interest, and of interest to the serious and experienced dog trainer. I, however, would never recommend this book for a first time trainer or the novice dog owner.",
                "review/helpfulness": "31/38",
                "num_reviews": 38
            },
            {
                "review/text": "This is my second purchase of this book. My first copy was loaned out -- never to be seen by me again. This book is NOT &quot;old fashioned&quot; by any means. Since when is obedience &quot;old fashioned&quot;? What is wrong with good ideas from WWII? Nothing at all. The methods are just as relevent and effectual as they were the day the author wrote the book. Let me ask the prospective reader a question: Were children better behaved, and less spoiled, during Koehler's day, or today when they are given &quot;time-outs&quot; in school by pathetic liberal academics who would like us all to believe they have evolved to Nirvanna when they have actually regressed horribly? Dogs certainly have not become more intelligent since WWII. I've fully obedience trained about 10 dogs (mostly German Shepherds) using the Koehler methods and I have never harmed a single animal. I wouldn't even consider it! All dogs training with these technigques became remarkably reliable and obedient, as well as, happy and content, in a minimum amount of time. I never had to &quot;beg&quot; a dog for anything. If the training is given while the dog is a puppy, the harsher remedies used for problem dogs are not necessary. Koehler does not recommend &quot;drowning&quot; your dog -- this is taken completely out of context in the hopes by some other reviewers that you will not read this book. Some of these reviewers certainly have a tendency to exaggerate. Get the book and then you'll see.",
                "review/helpfulness": "21/34",
                "num_reviews": 34
            },
            {
                "review/text": "I have used the Koehler Method of Dog Training for over 20 yrs. I've used it on terriers, gsd's, dobies, beagles, hounds, &amp; misc. wild energetic dogs, shy and fearful dogs. My dogs are strays, shelter dogs, &amp; free-to-good home dogs. Each dog has a past that I can never really know about. They don't come to me puppies with clean slates. EVERY DOG learned to be good canine citizens under the Koehler Method. Not one of my dogs has EVER been surrendered back to a shelter because &quot;I couldn't train him to not to jump, bite, pull, growl, etc.&quot; I don't have to make excuses for any of my dogs like those who insist &quot;Fluffy will sit for me at home but not around distractions&quot; or claim, &quot;this breed can't be trained like other breeds because they are so independent.&quot; None of my dogs runs off, get hit by cars, chases or kills other animals. I credit Mr. Koehler for the success of my dog family. Today in America millions of dogs are killed each year in shelters because their owners &quot;tried&quot; all the P.C., lovely dovey, have a treat, I'm your best friend methods to train their dogs. In these methods the dogs are isolated for years in crates, the furniture and cats are doused in bitter apple to save them from being chewed on, and treats are dispensed like coins into a slot machine everytime Fluffy encounters another dog or heaven forbid--a uniform wearing delivery person. When these modern, humane methods don't fix the problem, Fluffy may be drugged into submission. Finally, when none of the modern P.C. expert advice works, Fluffy makes that weepy ride to the shelter and the owner is assured they did everything they could but &quot;some dogs just can't be saved.&quot; Mr. Koehler knew that for dogs to live in our world, they would have to conform to our rules or they would die. That is how it was in 1950 and it is even more so in 2004. Communities have grown even less tolerant of the family dog due to so many tragic or annoying situations caused by dogs. If you read the book and follow the steps as written for basic obedience, the dog LEARNS, it is not forced or beaten to comply. The training exercises are clear and concise. Easy to follow for anyone. If the method is followed as written, the corrections everyone rages about are never even necessary. They are there to deal with severe behavior problems. Some people need a way to deal with severe behavior problems. The average dog does not require these corrections. Folks, think about it. In 2004 our world has more professional dog trainers, training books, t.v. celebrity dog trainers, videos, and training gadgets and gizmoes than ever before to help people raise a dog and yet millions of dogs are killed each year due to SIMPLE behavior problems. Not for the big stuff like mauling children, but for house soiling, chewing furniture, pulling, jumping, barking, growling. If the modern ways are as effective as claimed, should the death toll continue to rise at this rate? In 2004, only spay &amp; neutering should be reducing the dog population. Again, Koehler is very clear, dogs that are not taught to conform to the ways of the human world will be destroyed. He created a method to address that and spare dog lives. A method to train the dog easily and quickly. Those of us that use it have dogs that live full, active, interesting lives. They go to parks, to beaches, to work, on vacations. Veterinarians give us discounts because they can actually examine our dogs, give them vaccinations and dear I say, pet them! I have had over 15 dogs in my adult life and all were trained using the Koehler Method. They have lived past the ages of 12 yrs and some up to 16 yrs. My dogs were strays, shelter dogs or unwanted, unruly family pets and not the ideal brand new, 8 week old, temperment tested, from the best breeder in the world puppies trainers recommend we start with. Many of those poor pups end up in shelters too when they don't respond to modern training methods. No, some of my dogs can be traced back to puppymills. Mr. Koehler WAS the best dog trainer in the world. His method is for all dogs born in to the real world. If you are having problems with your dog, don't give up, get The Koehler Method of Dog Training by William R. Koehler. Thank you Mr. Koehler for giving me a wonderful life with my dogs and for all the dogs you have saved with your method.",
                "review/helpfulness": "28/33",
                "num_reviews": 33
            },
            {
                "review/text": "\"The Koehler Method of Dog Training\" is both one of the foundation texts of modern dog training, and one of the disciplines most controversial books. Fans claim that the book is sensible, clear, and - above all - effective. Detractors claim that the book is cruel and outdated, as well as invariably detrimental to the relationship between handler and dog.The truth, in my opinion, lies somewhere between the two extremes. When Koehler's book was published, it was one of the best and most logical dog training manuals on the market. It was revolutionary in many ways, and in fact still contains suggestions often neglected by modern texts. For example, Koehler starts his obedience programme by teaching the dog the value of being attentive to his owner even under distraction. Most modern \"positive\" manuals gloss over this all-important foundation step, resulting in dogs that know the meaning of obedience commands but only comply when they feel like it.Koehler also pioneered the use of a longline in dog training, and the Koehler Method does not let the dog off the line - at all - until he has thoroughly mastered a bombproof recall. This step is also often missing from modern \"positive\" trainers, who advocate letting the dog make his own choice between freedom and a treat, and are surprised when the dog then becomes dangerously unreliable off leash.Koehler explains the importance of good obedience, and why it is not optional - again an area often neglected by modern texts. It is indeed far kinder to use a few corrections to ensure the reliability of a wayward dog's recall, than to either prophylactically keep him on leash his entire life, or let him run off only to be hit by a car.Koehler also explains the important distinction between punishing a dog, and allowing him to learn from the consequences of his own actions - a difference that all good trainers understand, but often fail to enunciate. It is the difference between yelling or jerking a pulling dog (upsetting and often relationship destroying), or calmly allowing the dog to decide that keeping his owner in sight will improve his own comfort. Despite what Koehler's detractors claim, the majority of \"punishments\" contained in this book follow this pattern of simply allowing the dog to learn from the natural consequences of his own actions. True \"punishment\" is only advocated for cases where the dog has already demonstrated his clear understanding of the exercise multiple times, and is refusing to comply.Where is this book lacking? As can be expected due to its vintage, it lacks all mention of operant conditioning, training in drive or food training. Many of the new methods introduced by operant conditioning - bridges/markers, free shaping, back chaining - that are extremely effective at teaching a dog complex behaviours cannot be found in this book. Many of the great modern contributions from ethology are also missing from this work. These include the modern way trainers mimick \"alpha wolf\" behaviour to painlessly enforce day-to-day obedience, and the use of training in prey drive to gain enthusiastic compliance from high-drive \"problem\" dogs.Most importantly, I would not recommend the final section of the book to a modern day reader. This section - ominously titled \"problems\" - was designed for dogs whose bad behaviour was not corrected by the 13 weeks of basic obedience outlined earlier in the book. Although the methods may seem quite harsh to a modern reader, it is important to bear in mind that people in the 1960s did not have access to professional dog trainers or behaviorists. Koehler himself states several times that the methods in this final section are only for use when the other option for the dog is euthanasia. However, the modern reader would be better advised to take his problem dog to a professional trainer than to try any of the methods in this section. You have been warned!In short, this book is a good simple primer on basic obedience, but is itself incomplete. To flesh it out I would recommend books by Patricia McConnell, Shelia Booth and Steven Budiansky; as well as the excellent free articles on the websites of Shirley Chong and Suzanne Clothier. And please note that \"The Koehler Method of Dog Training\" is not an effective guide for dealing with true behavioural problems - with a real problem dog, you will be much better off investing in a consultation with a professional dog behaviourist than resorting to this book.",
                "review/helpfulness": "28/32",
                "num_reviews": 32
            }
        ]
    },
    {
        "Title": "dog logic companion obedience rapportbased training howell reference books",
        "description": "To train your dog effectively, you must establish more than authority and obedience. You must train the dog to want to please you. You must establish rapport. It is upon this basis that the excellent training regimen given in Dog Logic: Companion Obedience is developed. Understanding your dog's natural behavior and responses to the world he lives in is the key to achieving the training results you want. That key is provided in this book and will result for you in a responsive, obedient dog that accepts your leadership and happily lives by your rules. This is mutual respect that works! The exercises in Dog Logic are for the companion dog and, if you like, the obedience trial dog. They guide you gradually and expertly through the whole series of training objectives, and your ultimate reward is a dog you can always be proud of. Week by week and level by level, you will see your dog gaining poise, polish and the admiration of all who meet him. You and your dog will become a living example of what it means to be a smoothly functioning dog/human partnership. These training methods are tested, proven and reliable and can make a world of important difference for you and your dog. A Howell Dog Book of Distinction",
        "authors": "['Joel M. McMains']",
        "infoLink": "http://books.google.com/books?id=OxYEAAAACAAJ&dq=Dog+Logic:+Companion+Obedience,+Rapport-Based+Training+(Howell+Reference+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The sub-title of this book, \"Rapport-Based Training,\" made me give it a try, even though I do not employ force-based training methods. I do, however, try to give everyone a fair shake.However, there were some things in this book -- which is full of hypocrisy, BTW -- that turned my blood cold. His inclusion in puppy testing of checking for pain sensitivity (he calls it touch sensitivity), because your training program will assume the dog will respond to pain, is chilling. And the statement \"Experience says that force is an inescapable training element\" shows that, no matter how open-minded he says he is in the preface, this trainer has not explored all options. He views \"tough\" dogs and \"submissive\" dogs as irredeemable, while other training programs not based in force have turned these dogs into wonderful companions.Although at no time does the author suggest that he is not a force-based trainer, he states repeatedly in the front matter that he gives a dog a chance to learn before applying force; yet from lesson one he recommends giving a new verbal command to a dog and applying pressure with a pinch collar to force a dog into various as-yet unlearned positions.I was hoping to find in this book something more based in relationship-building than the traditional correction-based methodology, something I could recommend to those who cling to force-based methods. Yet the only place where I could agree with this author is that a pinch collar is less damaging than a choke chain (which, frankly, has no place on any dog). It was a disappointment.Better reading materials for those who don't want to use strictly food-based training methods include \"Excel-erated Learning\" (Pamela Reid), \"So Your Dog's Not Lassie,\" and \"Never Say No\"(Dr. Mugford).",
                "review/helpfulness": "17/27",
                "num_reviews": 27
            },
            {
                "review/text": "McMains is a dog lover, first and foremost. He takes great pains to emphasize that dogs are friends and comrades, not employees or slaves, and should be treated with the respect and love they deserve. In the heat of training, many people (even many trainers) seem to forget that the reason they originally got a dog was not to do a straight sit or a snappy recall, but rather to fill out their world with a new friend. I don't know a friend in existence who would tolerate what some trainers advocate in the name of &quot;training.&quot;His method is not compulsion-free, but it is centered around the dog VOLUNTEERING behaviors, rather that being yanked/forced into them repeatedly. He discusses how to use the dog's natural compulsions/drives to encourage the behaviors the team is shooting for, as well as ways of solidifying those responses under REALISTIC distraction conditions.The most telling point about the book's organization is that it doesn't adhere slavishly to the standard AKC Novice routines, but rather focuses on skills and attitudes that the non-competitor will find most necessary/useful around the home, which is where all dogs, competitor or not, spend most of their time. Make no mistake, a McMains-trained dog will reach its full competitive potential, but McMains' focus is where it should be, on the 99.9% of the dog's life spent outside the ring.In a world where millions of dogs are put to sleep in shelters each year, primarily for &quot;temperament problems&quot; (which can be interpreted as the owner crying &quot;I don't know how to deal with this dog!&quot;), a book with this much compassion and intelligent information on how to understand and relate to your own dog is invaluable. The problem is not that there are too many dogs in this country, it's that there are too many OUT OF CONTROL dogs in this country.If McMains has his way, that won't be the case forever.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "***** Outstanding! Dog Logic provides readers with an excellent guide on obedience training for practical purposes. McMains' rapport-based methods are based on mutual respect between owner and dog, and his love for our best friend is evident throughout the book. Author McMains explains how to appeal to your dog's drives and instincts in order to become the animal's pack leader. He encourages readers to train &quot;at the dog's level of understanding,&quot; and reminds that &quot;rapport is critical.&quot; Anyone can force a dog to be obedient, but McMains shows you how to have your dog respond out of a desire to please you. This is where McMains' insights help you to think like your dog and understand canine logic.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Dog Logic: This is a book clearly created for easy to follow instructions in dog training! Your dog will come away trained and still want to keep company with you. It has all the instructions needed to train your home pet. I applaud, Joe M. McMains for his guildence and understanding of mans best friend.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "&quot;Dog Logic&quot; was a brilliant piece of work, penned by a master dog handler in hopes of bettering the lot of his canine buddies. Far too many people own dogs who shouldn't, either due to ignorance, laziness, or just plain nastiness. Mister McMains realizes this, and knows that the answer to the problem can be summed up in a single word: RAPPORT. If you objectify an animal, as (unfortunately) does the overwhelming majority of dog trainers, you may be able to get your dog to perform tricks and obey commands, but that deeper connection will not be present. If, like most owners, you simply think of your dog(s) as nothing more than a &quot;pet for the kids,&quot; &quot;something to bark at a doorknob rattler,&quot; or even &quot;a creature that lives to eat, shed, and mess,&quot; then your dog is far more likely to be ignored and otherwise neglected than if he were instead viewed as a member of your family entitled to your respect. Contrary to what pseudo-intellectuals like Desmond Morris would have us believe, dogs ARE capable of higher thought processes, and DO express actual emotions. Neglect is psychological abuse, and will have negative effects on your animal's personality. As the U.S.A.F. K-9 school says, &quot;Every handler will end up with the dog he deserves.&quot; The &quot;Ten Commandments&quot; after the Postscript is well worth the cost of this book in itself. Highly recommended.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "My only complaint about this book is that I couldn't put it down! Without a doubt the best single book (I still recommend buying several different training books for scope) on dog training ever. This is written for all of us average folks who just want a very stable and well behaved pet that responds to our leadership role in the family. Joel is one of the few authors I've read who seems to really UNDERSTAND dogs and the dog/human relationship as it should be--not as politics or fads would have them be...a must read for the first timer, as well as those of us with years of dog experience. I would also recommend &quot;Manstopper&quot; for a genuine insight into how dogs learn by association. Even if you have no desire or interest in protection training, it will prove invaluable for problem solving (and prevention) in your basic obedience training at home....it teaches you how to think associatively like a dog does. Dog Logic is not a book for the wishy-washy or those of us who don't have time to invest in a regular training routine...it's for people who are serious about having a well mannered dog and want to train in such a way as to INCREASE the trust and love between you and your pet. Happy Training!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I bought this book when I got my first dog of my own. My family have always had dogs but had always been content to get as far as \"sit\" and then let them do what they wanted. I wanted something more from my dog and suspected what was confirmed by the book: that a trained dog is a happier dog. I've recommended the book to countless others and am about to order it as a gift for someone who recently got their first dog. I hope that it will provide him with as much insight as it gave me and I can assure you that you'll gain plenty of tools, both practical and thoughtful, from this book. More than just giving you a series of instructions, this book will help you to have a little more of an idea of what's going on inside the canine head. And McMain manages, in spite of the obvious love that he feels for dogs, to strip away some of the sentimentality that often clouds our relationships with our dogs. I offer him my thanks, and if he could, I'm sure that my dog would too.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I train owners to train their dogs as a supplament to my income. I also do it as a way to improve the quality of life for both the canine and the owner. Dog Logic is like a required &quot;Text Book&quot; for my classes. Yes I am partial to Joel's style and techniques. I am also proof that they work. My experiece with Joe's training methods were personal and resulted in a dog that was a Champion in Two states for 4-H; Also one that was the envy of anyone that met him. Dog Logic is a realistic approach to training and understanding your K9 compainion. With this book and individual comes away with a new insight and understanding of their best friend. This book also helps the owner of a dog develop a better relationship with their pet as a result of love, understanding and training.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "In treality this books covers training for dogs and teaches the reader how to relate to their best friend in a positive re-inforcement based training. I found the book a little boring only because I had just finished reading Mr. McMains other book, MANSTOPPER. DOG LOGIC offers the reader a lot of good information on the subject of dog training. A need to read book for everyone with a dog.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Dog Logic is the book I'd recommend if you were going to get only one dog training book. McMains teaches the reader to see the world from a dog's eye view and learn to communicate and build a relationship based on mutual respect. It is practical, down to earth, and enjoyable reading.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "saved a guide to success with your shelter dog",
        "description": "Buying a shelter dog can save a fine animal from destruction, while bringing a good new friend and pet into the household. This three-part book describes the dog shelter scene, offers advice on choosing the right dog from a shelter, and gives detailed instructions on dog training, health care, and how to provide a good home environment for the new pet. Full-color photos and illus. throughout.",
        "authors": "['Myrna L. Papurt']",
        "infoLink": "http://books.google.com/books?id=d0hybi-bphsC&dq=Saved:+A+Guide+to+Success+With+Your+Shelter+Dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book and found it very helpful in dealing with specific issues raised by adopting older dogs as well as puppies. It was very realistic and offered down to earth solutions that work. I have several dozen dog training books and I found this one to be the most helpful in dealing with specific issues like housetraining and aggression problems. I lent my copy of the book to a friend and I'm need to order more copies for other friends looking for this type of book.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "I thought that I would be getting a book targeted to the specific problems that shelter dogs experience. Perhaps training advice on how to deal with issues that these special dogs may exhibit. Boy - was I wrong! Having recently saved a 4 month old puppy from a shelter I was really looking forward to learning how to make my puppy's adjustment smooth. I learned nothing from this book. Some ridiculous chapters include &quot;Sex - Who Needs It&quot; and &quot;Will It Bite?&quot; both addressing issues that really don't need an entire chapter. Of course your dog should be neutered and of course you should do your best to choose a happy playmate - not an agressive fiend. I am not a new dog owner but these chapters would make me never want a dog. I have had a much better experience with other books written on the subject. I would not recommend this for anyone looking for insight and training tips for shelter dogs who may have been abused, abandoned, be extremely submissive or agressive.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I recently borrowed this book from my library, and I must ownit! It offers honest, practical advice covering all aspects ofadopting these very special animals. I have wanted to get a dog butwas apprehensive about looking at shelter dogs until I read this book. It has inspired confidence in my ability to train and provide the proper atmosphere that my new pet will need!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "how to teach your old dog new tricks",
        "description": "Voted the #1 BEST BOOK (1999) by the Association of Pet Dog Trainers - the largest and most influential worldwide association of professional pet dog trainers. Fun training with toys, treats, lures, and rewards. Easy, fun-loving, dog-friendly methods for teaching basic manners off-leash, and for temperament modification and behavior problem troubleshooting. Written from the dog's point of view and emphasizing natural motivational methods to teach your dog to want to do what you want him to do! \"How To Teach A New Dog Old Tricks is the best book by dog training's leading genius. The most relevant, important piece ever written on the subject of dog behavior and training. Some fields are lucky enough to be granted a giant: a figure whose contributions inspire awe and are unsurpassable. Ian Dunbar is that in dog behavior. There is no single person on the face of the planet to whom dog trainers and owners (not to mention dogs) owe more.\" Jean Donaldson (author of The Culture Clash)",
        "authors": "['Ian Dunbar']",
        "infoLink": "http://books.google.com/books?id=JkOssaXKccwC&dq=How+to+Teach+Your+Old+Dog+New+Tricks&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I'm a veterinarian, very involved in behavior training, because that's what keeps my canine patients alive. I've found that if I can get clients involved in teaching a dog who has found out that learning is fun, that dog stands a much better chance of staying alive of becoming an indispensable member of their family. I've checked out numerous trick training books, and this is hands down the best. It's focused, breaks the tricks down into easy, understandable steps, and is written by someone who knows and loves dogs. Bravo!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I taught my field spaniel to shake, speak, rollover, beg, bow, crawl on her belly, climb ladders, open and close doors, etc. Also, using the techneques in the book, I made-up other tricks. Now she can slp-you-five and jump and twist in midair.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is a very clearly written book that shows step by step how to make your dog impress people with how &quot;smart&quot; it is. The best thing about training your dog to do some of these tricks is that the basics sit, stand and stay also get transmitted. If you have a dog with behavior problems, once you start them out with this book everything else will follow. The book itself shows this with it's cross-reference at the end of each trick letting you know which tricks will be easy to teach in the future based on the foundation of just one trick!This book would be great for puppies as well.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This wonderful book is lavishly illustrated, and takes astep-by-step approach that results in a over-all well-traineddog. Easy to follow and a fun read.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "My Scottish Terrier, Sgt. Pepper, is currently working on the balance the milk-bone on your nose, and rollover trick.At this point we're having so much fun gazing into one another's eyes over the milk bone, that we don't much care whether he learns it or not.This is great fun!",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "the labrador retriever",
        "description": "You have a picture in your head. A picture of yourself with your practically perfect dog. You've always preferred big dogs, and your ideal dog is sturdy, strong, and energetic. At the same time, you envision a dog who is gentle and completely in tune to your needs, your whims, and your every move. That perfect dog is likely a Labrador Retriever. After all, the Labrador Retriever is the most popular dog in the United States, according to American Kennel Club registrations. Labs are beautiful, friendly, adaptable, easygoing, brave, loyal, dependable, and intelligent. What could be better? Labrador Retrievers For Dummies is a useful guide to have if you're thinking of getting a Lab or even if you already own one. Perhaps you're just curious about this popular breed. This handy reference is for you if you want to Find out if a Lab suits your lifestyle Know what to look for in Lab pups Determine if a breeder meets high standards Understand health and nutrition needs Handle emergencies with a cool head Train your dog with the lure-and-reward technique Show off your Lab in competitions You can live a fulfilling life with your Lab by making sure she is socialized, healthy, and well trained. What better task for humans and dogs than to be great companions for each other? However, you may need some help in knowing how to get the most out of your relationship with your Lab. This friendly guide offers that help with the following topics and more: Exercising your pup and older Lab Choosing the right veterinarian Exploring spaying/neutering Keeping your Lab beautiful with good grooming Helping your dog deal with divorce, a new baby, moving Managing barking and whining Housetraining your new puppy Traveling to dog-friendly vacation destinations Choosing a pet sitter or boarding kennel Volunteering your lab as a therapy dog Labrador Retrievers are big, energetic, and sometimes boisterous (especially as puppies), and they don't take care of themselves. They need you. Don't let them need you unless you're ready to be needed.",
        "authors": "['Walton', 'Eve Adamson']",
        "infoLink": "http://books.google.com/books?id=ylvgMs4qct8C&dq=The+Labrador+Retriever&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Characteristics and Temperament The main characteristics of Labradors are their coat, tail, head and temperament. They have a double coat: a soft, downy undercoat that keeps them dry and warm in cold water and a hard outer coat that helps them repel water. Their tail, described best as an otter tail, is thick at the base and tapers to a narrower point. It should not be carried over the back nor should it have a curl to it. It should, however, be at exactly coffee table height and always be ready to swipe one clean. Their head is clean cut and somewhat broad, with hanging ears. Their expression is alert and intelligent and conveys a kind, friendly temperament.Their best feature is their temperament. Labs are loving, people oriented dogs. They are happiest when they are with you. Labs are retrievers and will bring you things they find laying about your house or yard. They tend to be quite patient with children and wonderful family dogs. They are not guard dogs. They may bark protectively, but will generally not act more aggressively. Labs are wonderful people dogs, more likely to lick someone to death than hurt them. They tend to be stable, not easily upset by strange things or occurrences. They will take many things in stride.In the U.S., there are two distinct &quot;lines&quot; of Labradors: field lines and show lines. Field line Labradors have been bred with an emphasis on field or hunting ability, and show line Labradors have been bred with an emphasis on conformation and temperament. There is some dissension between the two groups, with field people claiming that show lines have lost much of their hunting and retrieving abilities, and show people claiming that field lines do not much look like Labradors any more and lack correct temperament. The truth is likely somewhere in between. Dogs from field lines will generally have a lot of drive, and will often exhibit more energy. Dogs from show lines might not be as fast, but most are capable hunters, though not necessarily field trial material. Either type can make a pleasant companion for a day out of doors.Labrador Retrievers are people- and action- oriented dogs, and can become bored if left to their own devices. Untrained, they can be unmanageable due to their size and enthusiasm. Unexercised, they will often turn to destruction or escape to alleviate boredom and excess energy. They require attention and love as much as food and water. Labradors are easy to train which makes obedience work a fun way to interact with your dog. Labradors also require plenty of exercise -- this is especially true since most Labs love to eat! Ensuring they get proper exercise, training, and attention will give you a happy, healthy Labrador.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book contains general, basic information on laborador retrievers. It leans more toward show labs than the working/field dog and lacks specific details. There are other books published that cover the same information, and so much more. For those interested in field trials and working dogs as opposed to show-labs, I recommend &quot;The Working Retrievers&quot; by Tom Quinn.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "bonnie bergins guide to bringing out the best in your dog the bonnie bergin method",
        "description": "An experienced dog trainer and founder of the Assistance Dog Institute offers a training method for both pets and their owners that stresses the understanding of dog behavior as the key to successful communication. Reprint.",
        "authors": "['Bonnie Bergin', 'Robert Aquinas McNally']",
        "infoLink": "http://books.google.com/books?id=4RXBAQAACAAJ&dq=Bonnie+Bergin%27s+Guide+to+Bringing+Out+the+Best+in+Your+Dog:+The+Bonnie+Bergin+Method&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a welcome change from books that try to make a dog a good pet by training the AKC obedience exercises. Instead, this book helps you to understand yourself and your dog and then uses that understanding to train your dog to become the companion you always wanted.I find myself looking back into this book as I work with my own dogs and with my dog training students. It is a gold mine of information, tips and ideas. I have surprised myself by carrying it with me to read whenever I have a spare minute.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "speaking as long time dog owner and dog lover and avid reader of all literature/canine 'bergin's book is,absolutley,the best thing out there.'",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "Most dog training books tend to be written for a standardperson with a standard dog. If you and your pet areboth standard then fine. Bonnie Bergin has written a bookfor the rest of us.Bonnie trains service dogs and unlike a 'how to guide forassembling your Bar B Q', Bonnie assumes that dogs aredifferent and people are different. She has a structurefor identifying personality types (both people and dogs).She then goes on to describes how these types interact andhow to manage the relationship(still your responsibility) toget the most out of it.There is a lot of personality theory here but for someonetrying to understand themselves and their dog, this is thebest book I've found so far. It takes you beyond the factthat dogs are pack animals and gives you a richerrelationship model than the one that says you should be thethe pack leader and your dog should be a member of the pack.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "living with a german shepherd book with bonus dvd living with a pet",
        "description": "Owners who have just acquired a pedigreed pup, and dog lovers planning to purchase a pet, will value Living With a Pet books for their in-depth presentation of the special characteristics and needs of the breed being considered. These books give readers detailed understanding of the animal's daily needs, adaptability to training, physical and personality traits, specific strengths and weaknesses, ability to learn, susceptibility to health problems, and more. Books are filled with full-color photos and attractive sidebar features. . Now Comes with Bonus DVD at No Added Cost! The brand-new hour-long dog training instruction program is specially designed to help dog owners who have little or no experience in obedience training.",
        "authors": "['Angela Ibbotson']",
        "infoLink": "http://books.google.com/books?id=6MwAAAAACAAJ&dq=Living+with+a+German+Shepherd:+Book+with+Bonus+DVD+(Living+with+a+Pet)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "We are new owners of a German Shepherd dog and I have been shopping around for a good info book.I had three from the bookstore but picked this one.It covers everything from picking the right pup from the litter to euthanasia in old age.I thought it was excellent in discribing the temperment of the dog and why they do what they do (guard and herd).It also shows what shepherd's are capable of learning and how to get there.We haven't tried it yet....",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Good info in book. Provider delivered book as promised. Good condition, good service.aj",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "expert obedience training for dogs",
        "description": "The Latest Edition of a Classic Dog Training Book Learn how to communicate more effectively with your dog using the time-tested training method of the most successful Obedience competitor in history. Winifred Strickland s humane, commonsense approach to dog training applies to all breeds of dogs, large and small. And now it s updated to include training for the latest AKC Obedience exercises. Complete with helpful training tips, answers to frequently asked questions, and more than 170 photographs, this is an indispensable resource for everyone pet owners, Novice competitors, Open enthusiasts, Utility contenders, and Obedience instructors. A Howell Dog Book of Distinction",
        "authors": "['Winifred Gibson Strickland']",
        "infoLink": "http://books.google.com/books?id=2fUMrgEACAAJ&dq=Expert+obedience+training+for+dogs&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book outlines exactly how to train your dog, from picking a puppy, teaching her tricks that will be built upon in formal training, how to ride in a car, how to swim, and how to flawlessly train novice, open, utility, tracking, brace-work, finding lost objects and even how to train your dog to carry the groceries in.But, this book isn't a load of useless fluff - at its core is how to train your dog to perform with precision. There are no gimmiks like ear pinches or clickers. It is training boiled down to the core of what you need. This isn't to say that there aren't any details - it is the many *important* details that allows one to train with such perfection. Strickland suggests that you read each chapter over several times before you begin training that section.My dog and I converted from clicker training a few months ago and after a month researching and method-shopping, I stpped here, at this book. I have never looked back. My dog heels with precision, her head high and her tail waving, exited but controlled on the fast, trotting on the normal, and prancing with exitement on the slow(she can't wait for me to speed up and run around, but she never breaks). She drops on signal or command, and stays beautifully. Although we are working on fly-bys on the recall, her method of making a shute with your hands and guiding yor dog into a streight sit(no collar corrections needed, just a light tap on the rump to remind her to sit quickly)s allowing us to swiftly over come this problem. She is almost ready to compete in novice. There is an answer for everything in this book - we haven't run up against a problem that she hasn't had a solution for... I honestly suggest it to anyone getting a dog, pup or adult, pet or obedience prospect. You won't be sorry.",
                "review/helpfulness": "100/100",
                "num_reviews": 100
            },
            {
                "review/text": "I agree with all of the reviews I read on this book, however, non of them talked about the \"show\" aspect. If I would have known how much was dedicated to getting your dog and yourself ready for shows, I think I would have passed. The first 8 chapters are great, but after that I found the information did not apply to my dog and his needs (or mine). If you are looking to enter your dog in competitions this is it. Otherwise I would look for books that would help you with your specific breed of dog. Just for the record, not all dogs respond to that \"wack on the nose\" correction, she talks so fondly about.",
                "review/helpfulness": "27/37",
                "num_reviews": 37
            },
            {
                "review/text": "Wynn Strickland's method is dog training for the thinking person. It logically outlines a procedure for working from the ground up, WITH your dog's natural proclivities rather than against them. A wonderful companion book to the New Skete Monks' &quot;How to be Your Dog's Best Friend,&quot; it takes the next step toward precision training for the ring.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "I have used Strickland's method for obedience training several dogs. The methods and concepts have never failed. A must for the dog owner and trainer.",
                "review/helpfulness": "22/27",
                "num_reviews": 27
            },
            {
                "review/text": "[While not worthy of such, this book recieves one star simply because Amazon demanded that I rate it.]While her methods may have won her and her dogs multiple awards in the 1960's, Winifred's harsh training style is out-dated and inappropriate given the less \"hands-on\" methods that science has found to work best for all mammals, not just dogs...In this book, the author preaches physical punishment (slapping, hitting, jerking, pushing, pulling, \"scruffing\", etc), often coupled with in-your-dog's-face vocal reprimands, and she recommends doing it \"as often as necessary\", even to very young puppies.You'll find lots of useless information and even more bragging, and if you follow the \"steps\" as the author suggests, you're garenteed to damage whatever relationship you have with your dog beyond repair - this type of \"training\" will teach even the toughest, hardest dogs that you are dangerous. I highly doubt that any worthy dog owner, whether trying to better their housepet's manners or trying to earn a formal title, would be eager to intentionally frighten or physically harm their puppy or dog.I've been a professional trainer for over 15 years, and used to use the \"J&P;\" (jerk & praise) methods with limited success - I watched dogs pass with flying colors one moment, and crumble the next. Back then, it was frustrating and often infuriating, but I know now that they sometimes crumbled for the same reason they sometimes excelled: anxiety and fear of aversives.While there is no such thing as truely positive training (don't let those \"fluffy\" trainers fool you), clicker training and using rewards (which doesn't just mean treats, folks) has scientifically proven highly successful for a variety of mammalian species. IT WORKS, and it works 100% of the time for 100% of dogs. It takes far less time to train a dog using rewards than it does to train a dog using aversives and negative punishment, and for two simple reasons: NO ONE WORKS FOR FREE, and EMOTIONAL STRESS HINDERS LEARNING. Believing that your dog works \"just to please you\" or just \"because s/he should\" is the equivilent of your boss believing that you go to work every day just to make your boss happy - it's ignorant, arrogant, and egotistical, to say the least. Mental and emotional stress trigger the \"fight or flight\" reaction that ALL mammals possess, and once that button has been pushed, learning is impossible, causing you frustration and causing your dog to move into panic mode...While I could easily go on about this, I'll stop here. This book may be useful for historical purposes, but for your dog's sake, learn about the science behind canine behavior, learning methods, and training methods before you plunge into punishments and aversives. Or better yet, find a trainer that's well versed in ALL methods of training, and have them help you out. It may be easier for you to read just one book and jump into scolding your dog for everything he does wrong, but unless you tell him what he's doing RIGHT, in a language he can understand, he'll never learn anything other than to fear you.",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "I have trained a number of dogs by the Strickland method by using this book. It is easy to follow and uses a humane method. No spike collars and other gimmiks.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "Fads, gadgets and gimmicks in training come and go. They DO sell books, classes and fancy equipment... and also confuse a lot of dogs and their owners. But this is a masterpiece of SOUND advice and a method of training that is based on a life-time of outstanding success in obedience trials. HOW can anyone argue with her degree of success? Winifred G. Strickland's methods will be around forever because they work so beautifully. She has won endless titles and done it while loving and respecting her happy, enthusiastic, super dogs. Her gentle, intelligent training program will succeed with other breeds that are not as naturally keen to work as her German Shepherd dogs.I love this book. A classic that will probably never go out of print. What a joy to read and apply! It has an honored spot on my reference shelf and is one of the most valuable books I have ever purchased on the subject! It is easily worth ten times the price.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "If you happen upon this book or feel the need to purchase it, PLEASE read it with a grain of salt (or lots). I would pass on this book...for sure! No one should treat animals they have taken into their homes the way Strickland recommends at times.First off, the author seems to brag about her own dogs and her own work with them through the years a little too much to be objective or even necessary. For instance, she has four pages (mostly pictures of her dogs doing things most dogs will never have the opportunity to do with four large paragraphs of text) about the importance of teaching your dog to swim, but yet only has three small sentences (less than a third of a page with the subtitle) about teaching your dog to come when called. The section about TEACHING YOUR DOG TO RIDE IN A CAR is a full page long without any pictures, but sections on biting and jumping up are half that and really only for those who may have never owned a dog--not necessarily for those who have a dog or puppy who need work in those areas. I think she has her priorities WAY out of wack!Secondly, she actually goes so far as to tell readers not to use any other training methods but hers mentioned in the book, implying that her ways are the best. Well, I have been told by many experienced dog trainers and dog owners that you need to do what works FOR YOUR DOG while also being consistent. She mentions her great success has to do with her being so consistent; however, many of her methods have big red flags on them as far as I am concerned. There is so much in the first part of this book that I actually found offensive. For example, under TEACHING YOUR DOG TO STAY AT HOME OR IN THE CAR, she actually tells readers to \"slap him (your young puppy) with your hand, saying 'No, shame.' Repeat this as often as necessary.\" She also recommends that you have your dog in the front seat with you of your vehicle, but does not mention any proper safety restraining for the dog's safety. Strickland even contradicts herself by badmouthing handlers in dog training rings who yell at their dogs and such, then tells readers to \"scold\" and \"reprimand him (your dog) with your voice\" in the Preliminary Training Chapter. Lastly, the author also recommends squirting your dog in the face with a squirt gun if he/she misbehaves. Therefore, I think there must be WAY better training methods and books available out there.The only reason why this book got a star was because of all the information on AKC Obedience Regulations. However, I would think that such information could be found through the AKC on-line somewhere or at least in a better hardcopy book somewhere. I have not gotten through all of the formal training section because the beginning stuff was so useless, but the little I have tried to look up was not easy to follow and/or not very helpful. I am sure I will find something useful in this book if not just bad examples as to what not to do!Best wishes to you and your dog(s).",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "I have been training my doberman for a year using various books and videos with great success, but there were little problems here and there that I couldn't find information on solving. In this book Winifred dealt with every one of them. I was amazed that she mentioned every one of my issues with my training.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "For those of you interested in serious obedience training, this is your book. Strickland, seems to be the most successful of trainers, touches on everthing including troubleshooting (correcting the dog).",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "feisty fido help for the leash aggressive dog",
        "description": "A dog who barks and lunges at other dogs when out for a walk is embarrassing and potentially dangerous. Using these pet-friendly, positive reinforcement techniques you'll soon be able to relax and enjoy your walks.",
        "authors": "['Patricia B. McConnell', 'Karen B. London']",
        "infoLink": "http://books.google.com/books?id=NSdWAAAAYAAJ&dq=Feisty+Fido:+Help+for+the+leash+aggressive+dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This short book is a cheap and cheerful guide to dealing with leash aggression in dogs. The author suggests reasons that dogs may behave in an aggressive manner when on leash, and then goes on to describe three simple and positive exercises that owners can use to manage or change their dog's on-leash behaviour.The booklet is well written and easy to understand, and the exercises are easy to implement. I imagine the information would be very useful for the owners of fear aggressive dogs - which to be fair, make up the majority of leash aggressive dogs. However, it has several limitations that prevent it being universally relevant.Most importantly, this book only addresses dogs that attack due to fear or insecurity. Little mention is given to dogs that aggress for other reasons such as medical problems, misdirected prey drive, dominance issues or innate high fight drive. And although the suggestions in the book would probably work very well to desensitise a fear aggressive dog to the presence of other dogs, I know for a fact that they would be less useful to treat the less common dog who actually finds fighting self-reinforcing. No information is provided about how to recognise, or how to treat, a dog that isn't merely fearful of other dogs.Secondly, although I suppose this short booklet can't be expected to include all relevant information, I feel that leaving out all mention of how to deal with an aggressive dog on a daily basis is a fairly big omission. Information on how to manage an aggressive dog's lifestyle is very important, especially for dogs that display signs of aggression not just to strange dogs, but also towards their human or canine family. There are several \"hands off\" lifestyle approaches that can really help with aggression, such as the commonly quoted \"Nothing in Life is Free\" programme, that could easily have been included in this booklet.Thirdly, the authors are from the \"purely positive\" school of thought, and claim that any form of punishment (and especially any form of training collar) is of no use at all in dog-dog aggression. This is true as a general principle, and probably universally true for fear aggressive dogs - and for everyone's sake, positive based training is indeed the only type of training you would want to suggest a novice trainer attempt at home with an aggressive animal. However, when used under the guidance of an experienced and skilled trainer, aversive training collars and low-stim e-collar \"crittering\" can be very useful for SOME non-fearful aggressive dogs. Yet in this booklet no information is given about what to do, or where to go, if the suggested methods don't work for your dog.In short - if you have a leash aggressive dog you might as well buy this booklet; it is cheap, cheerful and has some useful practical suggestions. But please don't give up on your dog if these methods don't fix him. There's a lot more information out there!",
                "review/helpfulness": "87/117",
                "num_reviews": 117
            },
            {
                "review/text": "I heard Pat speak on the subject of dog agression last year at the Pet dog trainers assocaition. This book fills out the notes from that session. An incredible assest for trainers dealing with all levels of agression in dogs. I have used the methods with good sucesson three client cases. Reading this gives trainers more options for dealing with feisty fido's that show up with unhappy owners.",
                "review/helpfulness": "70/80",
                "num_reviews": 80
            },
            {
                "review/text": "This book is primarily for dogs aggressive on leash, same dogs off leash are fine with most, if not all, other dogs. It is only one of 28 catagories of aggression or combination thereof. The benefit to getting this booklet is that 1) you can determine if this is really the problem before you invest in a lot of more expensive books that deal with all manner of aggression. AND 2) You should be working with a trainer on ANY kind of aggression issue. This booklet will help you to know what type of methods are likely to be effective and you will have something to refer to as you are working with the trainer - I would not work with anyone who is not familiar and endorses at least some of McConnell's positive training recommendations.Her booklets in general cover more information with more pages than you will find in a single chapter of a lot of training or dog problem books. This gives you 59 pages dealing with just one very common, very specific issue! You would get far less for a lot higher price if you brought a book on a more general behavior topic.If you found the booklet useful, great! If you didn't, be glad you didn't spend more for it, quit yer bitchin and donate it to a rescue group who can use it - it's tax deductable",
                "review/helpfulness": "52/58",
                "num_reviews": 58
            },
            {
                "review/text": "I have a rescued dog that is nuts-aggressive on a leash. I have read sooooo many dog training/behavior books, and this one is one of the best. Why? 1) It gets right to the point. 2) There are only 3 main techniques to remember and practice (plus a few \"panic button\" tactics). 3) It's fewer than 60 pages.This book is easy to understand and doesn't muddy the issues with a lot of extra stuff. The techniques are non-violent but work. I've been through several dog trainers that told me that I wasn't correcting my dog hard enough so he wasn't getting the message. Things were only getting worse. The corrections were only making him more agitated, so that he began aggressing earlier and earlier when he saw another dog.This book helps you train your dog to have a different reaction to whatever sets him off so that his habit is to look at you when another dog (or person) comes around, instead of freaking out.McConnell anticipates that things always don't go as planned; one heading is titled, \"Oops! My Dog Looked Away Before I Said Okay.\" She also gives suggestions for troubleshooting.I highly recommend this booklet!",
                "review/helpfulness": "48/48",
                "num_reviews": 48
            },
            {
                "review/text": "This method requires constant food as a distraction to the dog. The book was better than Cautious Canine but still left me without a workable solution to the problem. Cost too much for the type of book this is (booklet)",
                "review/helpfulness": "21/32",
                "num_reviews": 32
            },
            {
                "review/text": "HIGHLY RECOMMENDED --ESPECIALLY if you have rescued a dog!McConnell addresses the specific actions you must take quickly as soon as you see unwanted aggression.I had a mixed-breed dog that I thought had a completely non-aggressive nature. With what I learned from reading her book, I was able to interrupt a potentially dangerous situation involving a 2 year old and his clueless parents.",
                "review/helpfulness": "14/23",
                "num_reviews": 23
            },
            {
                "review/text": "\"Feisty Fido\" presents a clear step-by-step method for changing the behavior of a dog who is aggressive toward strange dogs when he is being walked on leash. It was not as clear on changing the behavior of a dog who is intermittently agressive toward other dogs he lives with.",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "This brief, concise guide does not pretend to be a comprehensive tome for curing canine aggression; what it does address is one aspect of canine behavior that is troublesome to many owners--leash aggression. As a trainer, I see many people who understand that their dogs might not ever play off-leash at a dog park, but would like to be able to take them for a daily walk. The majority of the time that is a realistic goal, and this book explains how it can be achieved.McConnell explains the foundation skills owners should teach their dogs, such as giving attention and an emergency U-turn, as well as detailing when to use each one. She explains how to begin as well as how to progress through the behavior modification process. The overall approach is gentle, humane, and based on sound scientific principles. While McConnell is a recognized expert in the field, she has a gift for explaining theory and techniques in language that the average dog owner can easily understand. She and Karen London, a fellow Ph.D., have produced a guide that is well organized, easy to follow, and extremely helpful.- Nicole Wilde, author Help for Your Fearful Dog: A Step-by-Step Guide to Helping Your Dog Conquer His Fears and So You Want to be a Dog Trainer (2nd edition)",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book is short, and clearly written. It is often funny, and is very easy to understand. The author goes into enough detail and gives advice on enough side issues (car aggression, techniques for specific kinds of dogs or owners) that I get the sense that she has worked these principles for a very long time with pretty much every kind of dog out there. In other words, at no point did I think, \"but what about my dog, he's different because\" without the author addressing the issue a few paragraphs later.If you want volume for your book-spending money, you may be a little unhappy with how short the book was, but I was relieved by it -- I wanted to finish the book and start applying the training ASAP, so the shorter the better.The \"watch\" technique is working for my dog. He's not \"cured\", but we are having positive events -- I got him to watch me while we were in my truck instead of lunging and barking at a dog that was walking by. He also let a cow (we hike, and ranchers let their cows out in the high country to graze) walk within ten feet of us and did not even bark. He actually stayed calm and kept looking back to me for treats. Maybe he doesn't mind cows (!), but staying that calm near another strange animal is new behavior.I still expect it to take several months before he lets a dog go by us on the trail without trying to tear it apart, but I am seeing very small results just one week into using the watch command. Like the author suggests, we are working with easy to moderate situations, and just getting those down before we move on to high stress situations.I have worked with 2 different $80 an hour dog trainers on this problem with my dog, and while they did teach me helpful things, I think I've gotten more useful information out of this book. If you can't afford a trainer, and you feel like you can't go another day with your dog acting like a maniac, definitely give this book a try.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I just took a class with my two dogs, both rescue animals. One is leash reactive due to nerves/fear of other dogs. My other dog is leash reactive from barrier aggression toward the leash. Two problems. One answer. This book.I was very lucky to have a dog trainer in my town offering a special class for leash reactive dogs. This book was the first thing he handed out. He asked all of us to read the book as prep for the first class with dogs. Best homework anyone has ever given me!It is a quick and easy read. The tone is upbeat. No time is wasted getting to the good stuff.I'm very happy to have taken my dogs to a professional and to have this book to help me continue to practice out in the real world. I agree with other's reviews that it is very important to work with a professional, although it is expensive. Getting feedback on what you are doing right and wrong is very valuable. This is a big challenge to face alone.As a final note, on our last day of class I and my husband had a short personal chat with the instructor. He stated that there are only 4 professionals he knows of in my state that focus on this type of work. And he told us that if he had to choose just one area to continue to teach in dog training, this would be it. To him (and us) it is so important to arm dog owners with helpful and hopeful strategies for their feisty fidos. There is noting sadder than a dog confined to a life behind closed doors because the owner gave up or was too scared or uneducated to face the dog's bad behavior on leash.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "dog talk training your dog through a canine point of view",
        "description": "Explains canine behavior, offers practical advice on training a dog or puppy, and tells how to handle problem behaviors",
        "authors": "['John Ross', 'Barbara McKinney']",
        "infoLink": "http://books.google.com/books?id=hGjppYFd9qcC&dq=Dog+Talk:+Training+Your+Dog+Through+A+Canine+Point+Of+View&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "John Ross is vastly under-rated and under-cited; at least it seems that way with other trainers I've spoken with on the East Coast of the USA. This book provided the foundation for my training with my first dog that has led to my entry into professional dog training. While many people looking for house manners for their puppies seem to turn to the Monks of New Skete book, a fine work in its own rite, those who I encounter who chose *Dog Talk* typically seem to have better working relationships with their dogs.Perhaps it is his clear, concise, and straightforward method that makes the difference. Not only does he talk about his successes in dog training, he offers examples of his own failures in dog training to clearly demonstate to the reader better methods that he acquired as a result. Personally, I like to learn from someone who is likewise interested in learning, as well--I tend to be wary of those who seem to have never made mistakes.Not only does he get a dog owner through the basics of house manners, he includes solid instructions for expanding into a working relationship with a canine, and that includes a few fun tricks.This book is divided into two sections--the white section includes general stories, and anecdotally describes how to speak to your dog on a level he understands. In the central grey section he tells, step-by-step, how to train a particular behaviour (e.g., &quot;Sit,&quot; &quot;Stay,&quot; etc.), what to expect as your dog begins to learn, and how to address specific problems as they arise in the training process. He doesn't expect one to read his mind when he describes a process--he gives one all the necessary information, including photographs, so one will know if one is going about something the right way.The only potential drawback to this book is that he does incorporate a traditional dog training collar in some exercises. I contend, however, that if one has firmly followed his instructions on how to engage a dog--in language the dog understands--one will find that the dog performs such that corrections are not necessary. This is especially true if you begin work with a puppy (a dog under the age of two).If all humans engaged their new pups in *Dog Talk* from the day they brought them home, the dog shelters/dog pounds would no longer be over-flowing with discarded pets, and there would be virtually no such thing as a &quot;bad&quot; dog anymore.This book really is just that good.",
                "review/helpfulness": "63/63",
                "num_reviews": 63
            },
            {
                "review/text": "My wife and I had to interview for our labrador (twice), and were REQUIRED to purchase this book before we took ownership of our dog. I was kind of irked by this, and purchased this book to pacify both my wife and this kennel owner.With this as a background (I began reading this book with a bad attitude), I was amazed at what I read. Everything about the book made perfect sense. One reason this book is so different from all of the others is that it makes the reader stop and think in terms of a canine -- something that many people who just want a &quot;dog&quot; refuse to do. This book will not disappoint anyone whose dog is top priority in their life (which is hopefully the case).",
                "review/helpfulness": "45/45",
                "num_reviews": 45
            },
            {
                "review/text": "Dog training has recently gone through a metamorphosis, churning out a whole new slew of &quot;positive only&quot; training methods. Clickers and food are the new tools of the trade. Well, let me tell you - don't go for this &quot;ersatz&quot; training. You will only be in for frustration - both for you and your dog. Train your dog properly - in a way that is both easy and that your dog understands - without the use of gimmicks like treats and noisy toys. _Dog Talk_(and John Ross's book on puppy training)are the way to get there.He teaches you how to train a pet dog for real life. The &quot;down-stay&quot; is focused on immediately in his step-by-step training program, as he understands how this simple command can make or break your relationship with your dog. You teach all the commands in steps that introduce the dog to what you want without harsh corrections.You mold the dog into position, instead of correcting upwards sharply for a sit, gently place the dog in a down - no dragging with the collar. When your dog begins to understand, you up the criteria until your dog understands fully enough to &quot;test&quot; her. You place the leash and training collar on and give the command. Due to the work you have put into teaching the meaning of the word, you dog will almost certainly do as you ask. If not, a gentle correction is used to guide the dog into the proper position. If you had to use a correction, you go back and work on understanding with your dog. This is a completely comprehensive and fair way of training a dog.The author also teaches you how to solve all sorts of behavioral &quot;problems&quot; like food stealing, leash pulling, and jumping up in a fair and comprehensible manner that the dog understands very well. You correct using your dogs own natural corrections - a scruff shake, a harsh &quot;Naaah&quot; growl, a nip on the snout. This is what a dog understands. A dog doesn't understand that if it stops eating the cake on the table it will get a click and treat - it understands that if you don't stop her, she gets to eat cake, and that eating the cake is perfectly acceptable. If you growl &quot;naaaahhh&quot; as your dog is thinking about jumping up to eat the cake, you dog thinks &quot;uh oh, that behavior is not something that Pack Leader will allow&quot; and leaves the cake. Possibly she will try again, and you(pack leader) would follow up with a harsher &quot;naaaah&quot; and possibly a scruff shake. Again, and a nip on the muzzle.This is what a dog understands - the growl warns the dog that repercussions will ensue if she continues on that path. She understands that if she continues, she will be corrected. A dog learns this while with their mother. Its the natural way to train your dog - using your dog's own language. This is what you learn using Dog Talk.I have had many dogs. This book has helped me teach them each how to be exemplary companions in every way. We can go to baseball games - my dog will lie down and stay, her leash in her mouth. We can walk down busy streets - depending on local laws, she can wear her leash, or she can walk beside me carrying it in her mouth. She listens when I speak, and is continuing her education so that she can compete in obedience trials.When I first got her, she was overweight, aggressive, had separation anxiety, more energy than should be possible in a single dog, and the ability to pull me off my feet on walks. Now she is one of the best dogs I have ever had, because I learned to talk to her in her own language.",
                "review/helpfulness": "38/39",
                "num_reviews": 39
            },
            {
                "review/text": "People wonder why I have the perfect dog. It's because of this book. Not only does it deal with normal doggie situations, it gets into the heads of dogs AND their owners, so that you &quot;know&quot; and expect what will happen with the dog before it actually does. I totally recommend this book...I'm an expert &quot;growler&quot; now :-) If you've read this, you know what I mean.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I bought this book (amongst others) 8 years ago when I got my first dog. After reading all of the dog books I could lay my hands on, I decided to try this one. I followed it religiously and it worked like a dream. As a result, both my dogs are amazingly well trained and behaved. By the time they were six months old they both responded to spoken commands as well as hand signals. I can leave food out on the table without fear they will eat it when I'm not in the room, leave them in a down stay for as long as I need and take them for walks without being dragged. They even go pee on command! Neither one of them took or needed obedience training.Fair warning though, it does require time and effort. It isn't enough to try it once and give up if it doesn't work right away. If that is your approach then you should probably look for professional help.Also, while the book gives you excellent ideas and methods, it is not a cookbook. You can't simply follow the instructions exactly and expect it to work perfectly for every dog.Dogs all have their own personality and likes and dislikes. While one of my dogs will do rolls until the cows come home, the other hates doing even one. The book requires creativity and sensitivity on the part of the owner. If you don't have those qualities, it's probably best to find a pro who does.I've loaned this book to a dozen people since I got it. Just about every one of them loved it and used it to either train their dog or rid their dog of a bad habit. If you are the type of person who likes working with your dog and wants to teach him to do more than just 'sit', this is the book for you!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I'm a deeply committed appreciator of dog companionship. I've read a lot of dog training books, and this is the best I've come across. John Ross helps the owner understand what it means to be the the dog's pack leader. He respects a dog's basic nature and helps owners understand that nature better.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "John Ross is vastly under-rated and under-cited; at least it seems that way with other trainers I've spoken with on the East Coast of the USA. This book provided the foundation for my training with my first dog that has led to my entry into professional dog training. While many people looking for house manners for their puppies seem to turn to the Monks of New Skete book, a fine work in its own rite, those who I encounter who chose *Dog Talk* typically seem to have better working relationships with their dogs.Perhaps it is his clear, concise, and straightforward method that makes the difference. Not only does he talk about his successes in dog training, he offers examples of his own failures in dog training to clearly demonstate to the reader better methods that he acquired as a result. Personally, I like to learn from someone who is likewise interested in learning, as well--I tend to be wary of those who seem to have never made mistakes.Not only does he get a dog owner through the basics of house manners, he includes solid instructions for expanding into a working relationship with a canine, and that includes a few fun tricks.This book is divided into two sections--the white section includes general stories, and anecdotally describes how to speak to your dog on a level he understands. In the central grey section he tells, step-by-step, how to train a particular behaviour (e.g., &quot;Sit,&quot; &quot;Stay,&quot; etc.), what to expect as your dog begins to learn, and how to address specific problems as they arise in the training process. He doesn't expect one to read his mind when he describes a process--he gives one all the necessary information, including photographs, so one will know if one is going about something the right way.The only potential drawback to this book is that he does incorporate a traditional dog training collar in some exercises. I contend, however, that if one has firmly followed his instructions on how to engage a dog--in language the dog understands--one will find that the dog performs such that corrections are not necessary. This is especially true if you begin work with a puppy (a dog under the age of two).If all humans engaged their new pups in *Dog Talk* from the day they brought them home, the dog shelters/dog pounds would no longer be over-flowing with discarded pets, and there would be virtually no such thing as a &quot;bad&quot; dog anymore.This book really is just that good.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I've read a LOT of dog training books over the years, from the earliest Koehler (traditional trainer) to the latest &quot;fad&quot; titles like &quot;Positive Puppy Training Works&quot; by Joel Walton. John Ross's book really boils down the basics to brass tacks, and makes it easier for the layperson to understand. I don't use a text for my classes, but if I did, this would be it.The thing I like best about this book is John's balanced approach. It doesn't take a rocket scientist to learn that dogs, since they can't learn our language, need for us to communicate in ways that are meaningful to them. Balanced training is just better communication, period. Dogs understand it, so they learn faster. The &quot;positive only&quot; folks out there want you to think all corrections are going to ruin your relationship with your dog, but that is simply not so. Humane, effective corrections are a part of teaching dogs, and if you train the right way, you don't need them very often. Ross explains how to train the right way, with praise, rewards, and yes, corrections if needed. He's not afraid to tell it like it is. I find this refreshing, and I know--it works.I do agree that there is no substitute for a good training class, including this book. Use them together (you do have to do your homework) and you will end up with a really well-behaved dog. Since training never ends, the book will give you something to refer back to to keep Fido in excellent form long after the class is over.You owe it to your dog to communicate with him in a language he understands. &quot;Dog Talk&quot; will show you how.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I checked this book out of the library five years ago (along with about seven other dog training books) when I got my boxer puppy. This book was so helpful I returned all the others and bought this one. I still refer to it when people ask me how I got such a well-behaved dog. I have lent it to other dog-owners numerous times. Everyone I have lent it to has bought a copy for her/himself as well. My dog is such a joy to my family, friends and even the neighborhood, and I owe that, in part, to this book. It is logical, easy to understand, and thorough. I do recommend reading several dog-training books so that you get a difference of opinion on training techniques and care. But you will find that the information in this one book will encompass what it takes several books to do. This is a must have reference book to own throughout your dog's life.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I got an invaluable insight on how to train my dog. My dogs are well trained because I applied John's basic methods and concepts of how a dog understands and thinks and should be trained. I recommended this book to any dog owner.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "teach yourself visually dog training teach yourself visually",
        "description": "When you're training your dog, he won't sit still for long-winded explanations. You don't have to, either! With this visual guide, you'll quickly learn how to determine your dog's personality, customize a training plan, and speak Doglish. You'll get the scoop on training tools, everyday handling, puppy conditioning, and socialization. You'll learn how to teach basic commands and progress to fun tricks and games. Instead of poring over boring text, you'll get the picture and enjoy working with your soon-to-be well-trained dog! Concise two-page lessons show you all the steps to a skill and are ideal for quick review * Each tool, principle, or training technique is clearly described * Detailed color photos demonstrate each step * Step-by-step instructions accompany each photo * Helpful tips provide additional guidance",
        "authors": "['Sarah Hodgson']",
        "infoLink": "http://books.google.com/books?id=X651frfj8LIC&dq=Teach+Yourself+Visually+Dog+Training+(Teach+Yourself+Visually)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have two silky terrors (terriers), neither of whom I raised from puppyhood. And while I love them to pieces, they definitely have issues which make them hard to trust around other people.My prior knowledge of dog-raising and dog-training was nonexistent - these were the first canines to join our previously cats-only family. So my inclination was to raise them as I had my children, with lots of positive reinforcement and respect. I cuddled them when they were scared, delighted in their antics as they greeted me at the door, laughed when they barked at delivery men and basically turned a blind eye to those infractions I considered minor - jumping at the table, peeing on the kitchen floor, pulling me down the street by the leash, chewing the legs of the dining room chairs...Anyway, it was all a big mistake. Suddenly the dogs were running the household -- and, most alarmingly, deciding which of our visitors were friends and which were foes. You really had to be careful because, if they didn't take an immediate liking to you, your ankles would suffer! Our veterinarian recommended that I put them on Prozac, but I didn't want to do that...Then someone turned me on to Sarah and her teaching philosophy - lots of positive reinforcement, yes, but control, too. I got DogPerfect and, just recently, PuppyPerfect, and learned from her that I wasn't doing my dogs any favor by not being their \"leader\" - in fact, I was fueling their anxieties. So with guidance from Sarah's books, I set up safe stations around our home using her patented Training and Stationing Leads, boned up on my \"Doglish\" and made it known to all that I was, henceforth, \"Leader of the Pack.\"The changes in the dogs have been remarkable - both in how calm AND how trustworthy they are. Though as with children, raising them is a never-ending process, so I was pleased to get a copy of Sarah's newest book - Teach Yourself Visually Dog Training.While TYV is based on many of the same concepts as Sarah's earlier works, it's such a handy reference guide that I keep it out on my kitchen counter and turn to it all the time. It breaks each aspect of dog training into an easy-to-follow, step-by-step process, and gives me a place to turn for quick review or any time a new situation arises. It really is Dr. Spock's Baby and Child Care for dogs!Anyway, I can't recommend it - or her - highly enough. Thanks for all your help Sarah!",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I am fortunate enough to live in the same area as Sarah and have had the good luck to have my 2 labradoodles trained using her methods. Sometimes all the training in the world doesn't help when you get home and have to put it to use. This book is so basic that in less than 25 seconds you can read a few lines and work on a specific behavior. The blocks in the upper left hand corner are a life saver, you can quickly turn to what you need. Now, about her \"method\". You know how sometimes someone points something out to you and you slap your forehead and exclaim \"but that makes common sense, why didn't I think of that?\" Well, that is what this book does for you, it tells you what to do in simple, clear, instructional language. It tells you why you should do something, and how to do it. Sometimes a training issue is so simple to figure out that I forget the basic approach - we all tend to overthink, rationalize etc. The training guides are so positive and encourage a healthy relationship with your dog. My older dog is 3 and even though she is well trained, I still refer to this book when certain issues pop up. Everything you could possibly need is in this book, from puppyhood to adult dogs. Having this book is like having a built in expert in my home - I don't know what I would do without it.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is the best dog training book (out of 16) I own. I train dogs professionally. I train the pack leaders, not the dog. I recommend this book to my clients because it is comprehensive, covering virtually every situation they may encounter. It can be used as a quick visual refresher, but also as a comprehensive tutorial in providing situational analysis with cross reference guidance on dog psychology, behavior, motivation, and problems.Too many current \"best sellers\" are 1950's Dr. Spock child rearing oriented, geared to permissiveness and lacking in leadership skill development. Author Sarah Hodgson portrays a proper balance of understanding and firmness, similar to Cesar Millan's, The Dog Whisperer, teachings.Your Pal, Hal (Certified Dog Trainer) in Holland, Michigan",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "dog problems the gentle modern cure",
        "description": "Offers advice on training a well-behaved dog, discusses canine behavior, and tells how to handle problems such as jumping up, house training, car sickness, aggression, digging, barking, and chasing",
        "authors": "['David Weston', 'Ruth Ross']",
        "infoLink": "http://books.google.com/books?id=cgEEAAAACAAJ&dq=Dog+Problems:+The+Gentle+Modern+Cure&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you have a dog who is already set in his &quot;ways&quot; this book is a waste of time. The emphasis is on how to prevent your dog from developing bad behavior. Some of the tips are not practical at all and did not work on my dog. The beginning of the book WAS informative, however, and might be useful to a puppy owner or buyer.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have been a long-time dog owner. Despite what I thought was a fairly good grounding in dog behavior, I was recently confronted with a puppy who changed my attitudes about what I knew. In trying to train and work with my dog, Gizmo, I was looking for guidance and help from any source possible. I happened across this book at my local pet supply store. (In fact, I'm ordering another copy of the book because Gizmo ate the first one!) It turned out to be one of the most educational and helpful books I've ever chanced upon. I would highly recommend it to any dog lover who wants some greater insight into their dog's behavior and positively altering with gentleness and understanding.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book has a brisk, no nonsense attitude to encourage positive training. I like the easy references (and cross references), so that you can go directly to the behavior you're interested in right away, and also the insightful explanations. A very useful addition to the shelf. They do often proceed from the starting point and may not be able to solve deeply ingrained problems (and of course I disagree with their assertion that shelter dogs are a bad bet; quite the opposite!), but I find it helpful to consult a variety of books when sizing up a situation, and these writers present some original ideas and creative solutions (without clickers or &quot;training&quot; collars).",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a hell of a dog rachel alexander dash mysteries",
        "description": "Someone is killing off the great dog trainers of the world-and it's up to PI Rachel Alexander and her pit bull, Dash, to collar the murderer Rachel has just been hired as undercover security at a dog-training symposium at a posh Manhattan hotel. How can the Greenwich Village PI and her pit bull, Dashiell, turn down the hefty fee, plus free room and biscuits at the Ritz? All Rachel has to do is keep the peace among the competitive diva dog trainers who have come with their prize pooches from all corners of the globe. She and Dash have barely infiltrated the festivities when they find out that one of the trainers, the self-proclaimed guru of a controversial obedience technique, has been electrocuted in his bathtub. The cops are calling it an accident. Until another trainer dies . . . and then another. With suspects including a dog psychic and a behaviorist to the stars, Rachel discovers that it's the humans who need to be housebroken as she and Dash bring a serial killer to heel. A Hell of a Dogis the 3rd book in the Rachel Alexander and Dash Mysteries, but you may enjoy reading the series in any order.",
        "authors": "['Carol Lea Benjamin']",
        "infoLink": "https://play.google.com/store/books/details?id=I1S2BgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "It's a dog's life in the mystery genre. The cats get starring roles, author co-credits, even whole series named after them. The doggie detectives are thrown the scraps. Enter Rachel Alexander, the private eye, who, with her faithful pit bull sidekick, Dashiell, is asked to provide security during a week-long dog training symposium at a posh New York City hotel in &quot;A Hell of a Dog.&quot; A former dog trainer herself, Alexander knew the participants, each of whom believed that their philosophy, whether involving the use of prompt and frequent rewards, punishments or reading the pooch's psychic aura, will make them the next Barbara Wodehouse. Her job is complicated by the presence of a now ex-lover who decided to go back to his wife. &quot;A Hell of a Dog&quot; earns its best of show ribbon on several levels. The mystery is suitably mystifying, Alexander is an intelligent heroine with a heart, and the dog handlers are an entertaining pack of purebreeds and mutts. Watching them snapping and snarling at each other is only one of the book's pleasures. Benjamin writes knowledgeably about the dog world and the handlers' discussions and arguments about training are enlightening without being intrusive.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I loved this book & read it straight through. At a dog training symposium, the dog trainers are dropping like flies. Rachel & Dash work undercover in this whodunit. With lots of twists & turns, the story kept me guessing right up until the very end. Woven into the story is info about various training methods, plus entertaining grumblings from the various trainers. Having spent a good deal of time with people in the dog world, I enjoyed the personalities of the dog trainers and found that they shared many of the same aggravating traits of the dog-fanatics who I have met through the years.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "dogfriendly dog training howell reference books",
        "description": "\"I'm a dog fanatic, read everything I can find on dog behavior, and this book is terrific! It was a great reminder of all those other times I can be naturally shaping my two dogs' behavior without their even knowing they're behaving perfectly. The illustrations are fun and funny. And the methods are clearly spelled out - how to do them, why they work, how they make the doggie-human bond a more loving one.\" - Amy Tan, author of The Joy Luck Club, The Hundred Secret Senses and The Kitchen God's Wife \"Andrea Arden is to be congratulated on this wonderful book on dog training (and I'm sure that dogs everywhere would agree). Her approach is humane, user-friendly, dog-friendly and guaranteed to produce the desired results. A must-read for owners.\" - Dr. Nicholas Dodman, author of The Dog Who Loved Too Much and Dogs Behaving Badly \"Dog-Friendly Dog Training will make you your dog's best friend. Use Andrea's training methods and you'll soon find your dog wanting to work for you. It provides easily understood information on dog training with a strong emphasis on the positive. She makes training so simple that a child can easily train the family pet. If dogs carried cash, I guarantee you they'd be buying copies for the humans they live with.\" -Wayne Hunthausen, DVM, director of Animal Behavior Consultations. Co-author of The Handbook of Behavior Problems of the Dog and Cat.",
        "authors": "['Andrea Arden']",
        "infoLink": "http://books.google.com/books?id=Au5ne0snc9MC&dq=Dog-Friendly+Dog+Training+(Howell+Reference+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book saved me a lot of head aches and money. I've tried many dog behavior classes and was at the end of my rope. I now have better control over my dog's behavior and can manage him without screaming at him. I highly recommend this book to anyone who wants an easy to understand dog training manual.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book was fantasic! I had so much trouble with my dog and I didn't know what to do. Finally, I found a book that helped solve all of my problems. This book saved me so much money, it saved my hands and it saved my furniture. Thank god for this book!",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I can not begin to describe how helpful this book was to me. Being the owner of an extremely difficult and what I thought was an unmanageable dog, I had almost lost hope. It was quite a relief when I learned that I didn't have to be harsh when teaching my dog basic manners. Many thanks to the author!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Recently, I got my first ever dog! My whole life has been filled with cats and other creatures but I have always wanted a dog. Needless to say, I was at a loss when it came to dog life. Luckily, while filling (overfilling to be exact) my cart at the pet store, puppy in tow, I ran across Andrea Arden's book. Of course, I immediately read the section on toliet training. Puppy Max and I are following the crate method described which is going well.I don't think I could have survived the first night without Andrea's advice. My pillow was very useful in covering my ears to the wails of Max from the crate but sure enough, he stopped.Everything from socialization (Pumba, my Bengal cat, is just enthralled with Max and took off with his dog bone last night while my other cat is still adjusting) to teaching tools to feeding is covered throughly in the book using simple language. Loved the sections in purple on every page!The positive reward system for training has already taken hold and Max loves praise for peeing out on the grass!We have just started to work on the barking lately. Can't wait until 4 lb Max grows a little so we can start the leash!Like I said, this book has been so important in my house (chewed edges and all). Highly recommended for a novice mom like me!By the way, I would appreciate any other tips for great dog books!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book was recommended to me by an animal behavior specialist for training an old dog I rescued from the shelter. He wasn't housebroken and had a myriad of other behavior problems that needed work.This book teaches you how to train a dog using rewards instead of punishment. It works remarkably well. I was able to teach my dog all the basic commands ('sit', 'down', 'stay', etc.) in just a couple of weeks. I also taught him to fetch a ball which was fun for both of us. When I first got him and tried it he would not even look at the ball when I threw it so I thought it would never work. But it only took a few weeks before he was fetching like a pro - giving a great indoor workout for this senior dog.The book is comprehensive but brief and includes nice illustrations that make the training easier. It is also written in a simple style that should appeal to children, too.My only complaint about the book is the reward style of teaching is most effective using food treats and rewards. My dog has digestive problems and so this method is limited. Still, all in all, this is a great book and I can highly recommend it - especially to new dog owners or those who are still &quot;punishing&quot; their pets.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "My wife and I have a 2 year-old Golden Retriever and this book was a life saver. Andrea Arden really helped us to change our approach to training and we've noticed drastic behavioral changes in our dog. Many many thanks to Ms. Arden!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I feel truly fortunate that this is the book I chose to give me an introduction to dog training when I got my dog. I feel like it has really steered us in the right direction for getting my dog to be happy, healthy, and excited about behaving well. We aren't done with training by any means, and I will have to train myself to continue training him, but I feel like this book was really on the right track.The book teaches alternatives to the physical prompting that was so popular in the 70s and 80s. The two main alternatives are Reward training and Lure/Reward training. Basically, you are doing Reward Training if you just wait for the dog to do what you want him to do and then give him a treat and praise for doing it. Lure/Reward training goes a little bit faster and may be the best way to teach positions like sit, stand, and (lie) down. You hold a lure like a treat or piece of kibble in your hand, and depending on how you move it, the dog's position changes. The book also gives guidelines on physical prompting, though the guidelines are very gentle and tend to be combined with rewards and lure/reward training.The best news is that you can start any of this training no matter how old your dog is. While a lot of behaviors and habits are learned in the puppy stages, an old dog actually can learn new tricks when properly motivated with rewards like treats, praise, attention, and toys.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This was the second dog training book I bought and even today ( 1 year later) I still go back to it as a reference. I use this book and Dog Training for Dummies as resources, after all training is just as much for me as it is my dogs - hence I have to study and learn in order to teach them.I recently got a second dog and neither of these book delve into this domain so I needed more specialized books. But this book was an excellent beginning!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "My Boston Terrier puppy was a bit of a handful so a friend recommended this book because she said it was really helpful with her Rotweiller puppy. What I like about it is it is very simple, but also thorough. The writing is great and the illustrations are perfect for making the instructions perfectly clear.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "To the poster with the Dalmatian....you should read the book again because you are doing all the things that Andrea tells you not to do. A walk should not be time for potty. It should be a treat. Now back to the book, I have read a number of books on puppy training and Andrea's is very simple to read and entertaining. It is right on target. I take my puppy to her classes in NY and her techniques (based on guru Ian Dunbar's SIRIUS puppy training). Great for beginning trainers and experts alike.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the super simple guide to housetraining",
        "description": "Everything you need to know to make housetraining easy and effective at any stage of your dog's life",
        "authors": "['Teoti Anderson']",
        "infoLink": "http://books.google.com/books?id=SipWAAAAYAAJ&dq=The+Super+Simple+Guide+to+Housetraining&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Professional dog trainer Teoti Anderson presents The Super Simple Guide To Housetraining, a no-nonsense guide to teaching puppies and adult dogs exactly what one expects of them. Explicit instructions and full-color photographs combine in a plain-terms, easy-to-follow instructional. The Super Simple Guide To Housetraining includes straight answers to common housetraining problems and questions, such as how to housetrain a dog that tends to eliminate when one is asleep or not paying attention, how to recognize \"submissive urination\" and what to do about it, how to instill healthy eating habits in one's dog, and more. An absolute must-have for every dog owner - even those with well-trained dogs will want to consult The Super Simple Guide To Housetraining when various stressors (moving, getting a new kitten, etc.) induce unwanted accidents in a beloved canine companion.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am an apartment dweller and will litter box train my toy breed. This book DOES address this less common method, but the author makes \"no bones\" about it, the outdoor potty method is the way to go. That aside, this book provides a very comprehensive guide to the before/during/after stages of housebreaking your puppy or adult dog, including a good Q & A section with each chapter to deal with training difficulties. This book has a very precise layout and concise directions that is particularly helpful for the new puppy/dog owner who is inexperienced with crate training and training in general. It is equally helpful for owners of toy and large breeds.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book for my dog training daughter, but found it so interesting that I decided to read it first. This newer edition is similar to the earlier version, but is organized a little differently and more focused on housetraining.In her easily understandable book, the author stresses patience and persistence on the part of the dog's owner. As an owner of many dogs over my life, I know first hand of the challenges of housetraining and that some dogs pick up on your expectations more quickly than others.Crate training does work, and Anderson gives the reader step by step instructions for achieving success with crate training. She also addresses outdoor training, the plusses and minuses of paper training, and even includes an interesting segment on litter box training for small dogs.Anderson's book is a great source of housetraining information for a new pet owner, and even someone who's gone a few housetraining rounds previously can pick up a few pointers. The photographs, cartoons, and included sources are added bonuses.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "dog problems howell reference books",
        "description": "\"Ivan's training comes from the heart, for the dog. He has certainly enhanced my view of training and has taught me many valuable, yet simple techniques to achieve the most from my dogs and myself.\" --Mary A. Allen, World Championship Competitor, USA Apprentice Judge, USA New England Regional Director \"Ivan Balabanov is among the few top trainers in the country who truly understands dog behavior and drives. He is highly respected by the best Schutzhund competitors, trainers and coaches in the country.\" --Glenn Stephenson, United Schutzhund Clubs of America Judge, International competitor Training methods for the top competitor. Advanced Schutzhund takes a problem-solving approach to Level III work that will help competitors bring their dogs to the highest level. Tracking, obedience and protection are dealt with individually, analyzing specific problems that crop up in each skill and offering step-by-step solutions. The approach uses operant conditioning techniques that steer clear of compulsion methods and build a dog's confidence, courage and problem-solving ability. You'll also find tips on how to compete at the National and World levels, including traveling with your dog. A Howell Dog Book of Distinction",
        "authors": "['Ivan Balabanov', 'Karen Duet']",
        "infoLink": "http://books.google.com/books?id=OGUMAAAACAAJ&dq=Dog+Problems+(Howell+reference+books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is misnamed. Its supposed to be for professionals, yet it contains exactly the same overly-general advice in all of her pet-owner books. At one point, in the discussion on aggression, she states that if the dog is really out of hand the reader should seek the help of the professional! Duh!I've enjoyed and learned from Ms Benjamin's books over the years, but found nothing new in this one - its all recycled material. And way too vague to be truly useful to the advanced trainer, much less the professional.",
                "review/helpfulness": "57/59",
                "num_reviews": 59
            },
            {
                "review/text": "Punishment, punishment everywhere. I recommend that you skip Carol Lea's books -- she way overemphasizes the outdated dominance model.All of these behaviors are natural dog behaviors. We're asking them to live in a very unnatural environment with what are, to them, very unnatural rules. Skip this book and choose ones that treat dogs as dogs, not as furry humans trying to take over your world that must be dominated at all cost.I'd pick Jean Donaldson's books or Terry Ryan's Toolbox for the Problem Dog before this kind of book any day.",
                "review/helpfulness": "41/52",
                "num_reviews": 52
            },
            {
                "review/text": "If you have a aggressive dog who is over 10 pounds and need some seriouse help or advice, I would advise purchasing another book, this trainers advice for everything was grab the dog by the collar and shake it while saying NO NO NO. I have read better books..",
                "review/helpfulness": "33/44",
                "num_reviews": 44
            },
            {
                "review/text": "There are better ways to train dogs and other animals that do not advocate &quot;stringing the dog up&quot; by the neck when it misbehaves. When I read this in what is a widely acclaimed book, I removed it from my recommended reading list. This jerk and puke method of training is outdated and ineffective. Operant conditioning is the way to go for long-lasting results that does not cause your dog to fear you. For dogs with an aggression problem, do NOT use Benjamin's methods or you will likely get bit!",
                "review/helpfulness": "24/30",
                "num_reviews": 30
            },
            {
                "review/text": "This is an excellent book for people who have mild or moderate dog problems. It is well written with a sense of humor, and with insight into the behavior of dogs. It is a book by a professional trainer, not for professional trainers.Carol Lea Benjamin does not advocate punishment. In fact, she advises to NEVER hit your dog. Appropriately correcting a dog is not a punishment any more than appropriately correcting a child when they run into a street is a punishment. In addition to describing how to properly correct your dog, she points out human behaviors that inadvertantly encourage dog problems, when and how to use praise to encourage positive behavior, how to redirect behavior, and that sometimes, we can eliminate a bad behavior just by removing the trigger.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "I was intrigued by the title of this book, since I come into contact with all sorts of dogs regularly and am often asked advice about issues like possession guarding, dog-on-dog aggression, etc. However, the advice in this book is by no means anything I would ever pass on. Most issues are dealt with by correcting the dog harshly, shaking him, dragging him by the leash, and similar awful methods. The author's 'cure' for a dog that growls and snaps from under the bed is to daftly drag him out by the lead, and if he happens to bang his head on the way out, so much the better! She advises owners of dogs with fear aggression towards strangers to severly reprimand the dog with voice and leash corrections every time he becomes agitated around another person. This is a ridiculous way to 'help' your dog and will most likely only make the aversion worse. I noticed that Ms. Benjamin has also written a book that claims to use positive training methods, but unless her philosophy has changed from one book to the other, I would not recommend any of her material to anyone else. There are plenty of truly humane training guides out there, don't waste your money on this.",
                "review/helpfulness": "15/21",
                "num_reviews": 21
            },
            {
                "review/text": "This was a well-written book aimed more at the novice dog-owner or someone who's experiencing a problem they've not experienced before. The book is written with a good sense of humor; for example, her final comment about ticks. She also recognizes that there are some &quot;problems&quot; that can not be solved, they are just part of being a dog, while other problems that people say are just part of being a dog can be solved. I enjoyed the book and have started trying her method on my German Shepherd, who back-talks as bad as any teenager when told to do something.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "The writing style is great-- easy to read, fun, and shining with the author's love for dogs. In general, the advice is sound too, but in several places the recommended &quot;punishments&quot; are harsh, violent, or simply bad training. Read and use this book by all means, but have a look at Karen Pryor's _Don't Shoot the Dog!_ to get a better handle on effective training techniques.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is an excellent source for all first time dog owners and should be purchased and read, along with Benjamin's other book--Mother Knows Best--before the dog is purchased. Little problems remain small when dealt with quickly and efficently using methods that dogs understand. Training right from the beginning is the key. Benjamin also tells how to fix a problem before it becomes worse. I have had dogs for over 40 years--terriers--and can testify to the success of Benjamin's methods.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "dog training in 10 minutes howell reference books",
        "description": "This new and expanded edition of Dog Training for Kids gives youngsters the skills they need to make better citizens of their canine companions, while strengthening that all-important human/animal bond. This \"home study course\" is based on the ability of the child to teach a dog basic obedience as well as some captivating tricks, without having to depend on parental help or expensive equipment. There are beautifully detailed and humorously illustrated instructions on Heeling, Sit Stay, Stand Stay, Down Stay and Come When Called. Counseling is given on seven common but persistent problems; Jumping Up On People, Chewing, Biting, Excessive Barking, Stealing Food and Problem Housebreaking. On the recreational side, there are descriptions of some wonderful tricks which all youngsters can teach their dogs. For those who feel that a future career in dogs would be satisfying and rewarding, Ms. Benjamin presents an overview of eight occupations to jog the reader's interest. A Howell Dog Book of Distinction",
        "authors": "['Carol Lea Benjamin']",
        "infoLink": "http://books.google.com/books?id=FT0EAAAACAAJ&dq=Dog+Training+in+10+Minutes+(Howell+Reference+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My dog, Rascal, is, indeed, a rascal. First impressions can be deceiving, and Rascal deceived me. At the shelter, he calmly gazed at me with the biggest, brownest set of puppy eyes. He looked so sad, and I'm a sucker for the underdog, people or animals. No one wanted him. Week after week, the shelter brought him back again. No one was interested in this calm little white and brown terrier. So I brought him home to love him and live happily ever after.The first day I let him out alone into my fenced in back yard, he jumped the fence, and bounded down the street in a raging snow storm. I found him. I was also late for work. He also decided that carpeted basements were a good place to relieve himself. That is when I went out and got Ms. Benjamin's book. I don't want to train dogs. I want them to behave. I want to train the dog now and I want it to take.My Rascal no longer jumps fences. Ms. Benjamin taught me to give Rascal praise when he comes in the house when I call. He loves being praised for coming in so much that he doesn't think about going out and exploring any more. The author also taught me to hold his head in my hands for one minute and tell him what I think of his relieving himself on my carpet. Then I let him think about it for a half hour alone in my kitchen. He thinks twice now about misbehaving.We also learned some fun things. I cannot get him to howl as the author suggests (he rarely even barks). But he will sneeze on command, and I've only had the book for a couple of weeks. I am teaching him to scour the house for treats I have hidden so I can get busy doing other things. A busy dog is a happy dog.For anyone who wants to train a dog easily and fast, using a method that is practical and down to earth, I highly recommend this book.",
                "review/helpfulness": "129/132",
                "num_reviews": 132
            },
            {
                "review/text": "Carol Lea Benjamin's dog books are for the average person who wants a well behaved house pet. Nothing fancy, just straight and to the point. Her training methods are easy to apply and neither the dog or it's master are confused about the expected outcomes. I liked it enough, that I am buying another book by the same author. BT",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "I like Carol Lea Benjamin. Back in the 1980s, when I first became interested in dog training, and the alpha theory still held sway, she was the least brutal of the popular dominance mavens of the time. (i.e., \"How hard should you hit your dog? If she doesn't yelp in pain, you haven't hit her hard enough.\" -The Monks of New Skete.) Since those days Benjamin has become a mystery novelist, and I really liked her first foray into detective fiction. (See my review of THIS DOG FOR HIRE.) I also share some of her antipathy for the methods espoused by so-called positive trainers. As a result I'm hesitant to write a negative review of this book.So I'll start by saying there are good bits or advice sprinkled here and there, like not giving a pup more freedom than he can handle, or that more vigorous daily exercise means less nervous tension. Or the idea that aggression is usually the result of excess tension (which is partially true; it's based on fear). And I have to tell you that many of Benjamin's training exercises are very, very good ones. But unfortunately, readers are told repeatedly that it all comes down to showing the dog that you're alpha. How do you deal with an aggressive dog? \"You must become alpha.\" Over and over she says this kind of thing. But given the recent evidence showing that wild wolves don't really form dominance hierarchies, that the pack is actually more of a cooperative society than was previously believed, it's hard to know how and why Carol Lea Benjamin would still be hanging onto this ridiculous, bone-dead belief. As a result of her alpha mindset there's a streak of meanness throughout this and, come to think of it, throughout all her training books. Granted, she's not as brutal as the Monks or Bash Dibra or Cesar Millan, but one passage in DOG TRAINING IN 10 MINUTES really points out a major character flaw.Benjamin says that it's all right to really yell your head off at the dog for certain types of what she believes to be \"deliberate\" misbehavior (dogs don't do anything deliberately, Ms. Benjamin; they act on instinct and impulse, not careful planning). To deal with such behaviors she recommends grabbing the dog by the cheeks and collar and screaming in his face for a minimum of ten seconds. \"In those ten seconds,\" she writes, \"your justifiable anger is pointing right at your dog, and because you are holding his rotten face, he can't turn away.\"His rotten face? This is not dog training, it's venting. And, as I try to gently tell my clients, \"If you can't control your OWN emotions, how can you expect your dog to control HIS?\"As stated above, there are a couple of sections where Benjamin decries the \"modern\" approach of not saying \"No!\", which she views as coddling the dog due to some kind of political correctness. I agree that \"positive\" methods are misguided and not as scientific as most +R trainers constantly claim they are. On the other hand, I've been dissuading my clients from using the word \"No!\" for nearly fifteen years, long before it was politically correct to do so, simply because dogs can't learn a negative, and because it sets up an adversarial relationship between you and your best friend. And I TOTALLY disagree with Benjamin's method of using leash corrections, which she says should always be followed by a sharp \"No!\" The truth is, leash corrections work best if they're immediately followed by praise, or a command, given in a positive tone of voice. The way Benjamin applies them results in a double punishment, and one that actually punishes GOOD behavior!Here's what I mean: if a dog isn't focused on you, or he ignores a command, and you give him a leash correction (which should always be done with the absolute minimum of force necessary to get his attention, by the way), he'll usually stop what he was doing and focus on you, if only for a second. So he's just done a good thing, right? Okay, so then why in the world would you shout \"No!\" at him? It makes no sense.And finally, here's where Benjamin's mean streak lets her down; here's where her love of punishment and being alpha gets in the way of true control: \"When you want your dog to come to you from a distance, you want to project that you are friendly.\" Yes, that's absolutely true. That's excellent advice. But in Benjamin's world what that means is that you want your dog to suddenly forget that you're in the habit of saying \"No!\", punishing him for good behavior, and screaming in his \"rotten face\" when you can't control your own emotions.Ms. Benjamin, THIS is why you don't use \"No!\", this is why you don't punish a dog, this is why \"being alpha\" is a bad idea. Not because it's politically incorrect, but because it's just bad dog training.4 stars for some training techniques, 0 stars for meanness = 2 stars.",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "Although the book is well-written and entertaining to read I really didn't find that it taught me anything new. It *was* helpful in reminding me some of the fundamentals about dog training, and really kicked me in the [head] to *constantly* positively reinforce, no matter how unimpressive a command the dog is following, but overall, I don't think any major revelations were achieved. Some interesting thoughts, and probably worth the money if you're a brand new dog owner with no prior experience with them, but I doubt someone with past dog experience would get as much out of it.",
                "review/helpfulness": "12/16",
                "num_reviews": 16
            },
            {
                "review/text": "If you can only buy one book on dog training, buy this one. It's easy to read and fun to read. After you read this book perhaps you'll also want to read her other book \"Monther Knows Best,\" which is also fun and informative.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book was listed as a resource by PetCo. I was not satisfied with more recent books that were available in my local bookstore. They were too \"chatty\" with other things. I wanted a straight forward book that explained \"this is the command\" and how to train for it. This book is meeting my needs very well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how to teach a new dog old tricks",
        "description": "Voted the #1 BEST BOOK (1999) by the Association of Pet Dog Trainers - the largest and most influential worldwide association of professional pet dog trainers. Fun training with toys, treats, lures, and rewards. Easy, fun-loving, dog-friendly methods for teaching basic manners off-leash, and for temperament modification and behavior problem troubleshooting. Written from the dog's point of view and emphasizing natural motivational methods to teach your dog to want to do what you want him to do! \"How To Teach A New Dog Old Tricks is the best book by dog training's leading genius. The most relevant, important piece ever written on the subject of dog behavior and training. Some fields are lucky enough to be granted a giant: a figure whose contributions inspire awe and are unsurpassable. Ian Dunbar is that in dog behavior. There is no single person on the face of the planet to whom dog trainers and owners (not to mention dogs) owe more.\" Jean Donaldson (author of The Culture Clash)",
        "authors": "['Ian Dunbar']",
        "infoLink": "http://books.google.com/books?id=JkOssaXKccwC&dq=How+to+Teach+a+New+Dog+Old+Tricks&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have two rambunctious beagles who both came to me later in life with pleanty of bad habits, and a few new habits I taught them that weren't so good. In just a few short days of using the techniques in this book I can already see the changes in my dogs. The constant barking at everything outside is fading, they are reliably sitting to go outside and for walks.....just amazing.The best part is nothing in this book is hard, and the dogs seem to like it. The writing is entertaining. The author has a good grip on dogs. I also appreicate his &quot;It's never too late attitude&quot; So many books give up on older dogs.. or just refer you to the leash correction method of dog training for older more challenging pets.This is going to be the book I loan my friends when they get new dogs, replacing some of my old favorites.",
                "review/helpfulness": "61/63",
                "num_reviews": 63
            },
            {
                "review/text": "What a nice change. The last time I trained a dog was atleast 15 years ago using the leash/punishment/force the dog to do what you want it to method employeed by many training schools in my area. We failed the class twice. It was a painful procedure for both me and my dog who was a very loving, affectionate animal. I think he was often wondering &quot;why is she doing this to me?&quot; Dunbar's method has been a much more effective tool for me. I have used this method on a boxer puppy and a pug and found it very succesful. Both dogs enjoyed learning new things and it was easy to teach them using Dunbar's method. Sit, stay, come and the few tricks I taught, they learned very quickly. My only complaint is that when I had a serious discipline problem the book did not give me much guidence. We live across from a corn field that the pug found very alluring and unfortunatly a major roadway is between our yard and the corn field. When he went past his boundries and needed some sort of correction there was no guidence. They said when a dog fails to respond and it is an important matter to discipline right away but not with excess. Period as in Dunbar does not elaborate on effective techniques that can get the job done without harming the bond between dog and owner.",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "I have just started a career in dog training and the trainer I am apprenticing with requested that I read this book.I had heard of Dr. Dunbar a lot over the last year or so of investigating my future career,and I was certainly impressed with his credentials. But, after reading this book I am even more impressed.It is a really dense book, so much so that I am going to read it again so I don't miss anything, but written in such a nice voice that it really was a joy to read.It covers just about everything a dog owner could want to know about living with a dog. I am not surprised that the person I am apprenticing with makes this required reading for all of her students.",
                "review/helpfulness": "35/37",
                "num_reviews": 37
            },
            {
                "review/text": "I found Ian's book to be excellent. His advice was sound - no miracle methods, just common sense. The book was different to many in that the training section made only a small part of the book. He focussed more on dog psycology - how to understand and get the most out of your dog, and how your dog can understand and get the most out of you. Training your dog after these goals have been acheived is then a lot easier, he argues. This book is best read about a month before you expect to get a puppy.",
                "review/helpfulness": "33/35",
                "num_reviews": 35
            },
            {
                "review/text": "Traditional dog training was amazingly unawareof the developments of the behavioural sciences.Only with the appearance of problem dog therapeutistsa couple of decades ago did matters start to changein a revolutionary way as concepts from eg marinemammal training were applied in dog training (egby Karen Pryor).Unlike the traditional methods, the novel techniqueswere non-coercive, and much more humane for the dog.Dr Ian Dunbar is one of the best-known representativesof the new shcool of dog training authors.The present book is in my opinion easy and fun toread, and, even more importantly, the techniques suggestedare both fun - for dog and owner alike - and effective.On the negative side, it's rather limited in scope,which is of course to be expected. It focuses on theupbringing of the common companion pet.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "The three things I liked best about this book are Dr. Dunbar's sense of humor, the easy to read style and the amazing amount of info! I tried some of these techniques on my dog and they worked within minutes! And this after my dog and I 'failed' training school twice!",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is a very interesting and helpful book when trying to train a new puppy as well as a mature dog. It explains how bad behavior develops and the steps to prevent it from occurring in the first place and the method to change behavior that has already occurred. This book was highly recommended by a group of people who work with Greyhound adoption, as a means to altering behavior that occurs in an older adopted dog. I used it with a great dane puppy and even when I think it may not work, I have not been dissapointed in anything the author writes. This book is hard to get and you may have to wait as it is frequently back ordered, but that just attests to its value in training your furry friend!!!",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "First let me say that this book and the more recent \"Before and After Getting Your Puppy (Dunbar 2004) are virtually identical. There is a little additional material in the later volume, but in that book states that all important training MUST occur in the first 6 months of puppydom. One day later is too late. For those of us who aquired the dog when slightly past six months - well - let's just hope it's not true.That said, I think most of the training techniques in Dunbar's books are reasonably effective - but he cops out on some very important behaviors. Many older puppies and dogs have greeting behaviors that include frantic jumping, pawing and scratching and even excited nipping. If an owner and his dog are ever going to have a social life (or a uneventful walk,) it is essential that these behaviors be corrected. These behaviors are particularily challenging because they are cccurring when a dog is in a high state of agitation and far less likely to attend to, or even hear, commands.Dunbar's recommendation is to have a party (with at least twenty people) and have all those individuals repeatedly enter the house armed with treats. The dog is instructed in the proper behavior and rewarded when he/she complies. Treat and repeat until Rover gets the idea. Then have a party the following week to make sure it all stuck. Dunbar also wants you to have all these good natured dog lovers to walk around the block a number of times carrying treats so that Rover can \"run into them\" on his walk and be shown (again, and again, and again) how to behave. Now in theory, this is a great approach, but the truth is that most of us don't have twenty or more friends willing to spend a number of hours, two weeks in a row, assisting us in our dog training. As this is his only suggestion for correcting greeting behavior, it leaves the majority of us in the lurch with jumpy, hyperactive greeters who will no doubt drive away the friends we do have.",
                "review/helpfulness": "19/23",
                "num_reviews": 23
            },
            {
                "review/text": "My standard poodle pup is 15 weeks old now. A couple weeksago on our first night of obedience class, the trainer saidto jerk the leash when she pulls. I felt this kind of correctionwas harsh, and after one week it never seemed to help. In factit probably reinforeced her leash pulling behavior and made herneck sore.Then I read Dunbar's book and after just one walking sessionusing his techniques, our puppy showed great improvment. Ithappened right before our eyes! Needless to say, I wasthrilled. Now we're having a great time learning allsorts of new things.Dogs sure are smart. Are you? Get this book and read it(twice!).",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Dr. Ian Dunbar's How To Teach A New Dog Old Tricks is the most influential dog book I have ever read. It simply overflows with down-to-earth, useful information. Dr. Dunbar created and popularized most modern day dog-friendly dog training techniques. Your dog will love you if you buy this book.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            }
        ]
    },
    {
        "Title": "the culture clash a revolutionary new way to understanding the relationship between humans and domestic dogs",
        "description": "Describes ways to help rehabilitate aggressive behavior in dogs, using food and other reinforcers.",
        "authors": "['Jean Donaldson']",
        "infoLink": "http://books.google.com/books?id=bT-wIWut9S4C&dq=The+Culture+Clash:+A+Revolutionary+New+Way+to+Understanding+the+Relationship+Between+Humans+and+Domestic+Dogs&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Culture Clash is a good example of a classic that really needs to be recast, re-edited in some aggressive ways.This book gets an incredible number of word-of-mouth recommendations from within the dog world, and for good reason. It's also somewhat exasperating, also for good reason. An updated edition might turn into a sort of Dr. Spock guide for dogs; as it is, even for its few blemishes, if you're interested in training at all -- you have a dog, you should be interested -- you need to read this one.The book is basically an engagingly-written set of essays on positive-reinforcement, operant-conditioning dog training. (In a nutshell, that means concentrating on setting a dog up to succeed, and then on rewarding it when it does succeed, rather than on punishing the dog for mistakes.) Culture Clash does two things: it gives you a broad sense of why positive reinforcement techniques work, and it really, REALLY lays into old-style, aversive, leash-jerking training methods. The reason it gets recommended so much is that it's GREAT for people who have only a vague idea of how to train a dog based on what they see others doing, and who might end up with a miserable dog and a sore arm from tugging at a choke collar. Donaldson does a truly excellent job of showing you how and why positive reinforcement will help you communicate with your dog. She does a great job showing you how happy that can feel, and showing you the broad outline of how it works.What she DOESN'T do especially well in this book is give you a specific, basic training regimen for your dog. That's where my editing objection comes in.As I said, the chapters in this book are almost more like stand-alone essays. They don't really flow into one another as well as you might expect. Other, how-to training guides will structure themselves around common issues -- a chapter about housetraining, or sections based on a puppy's age or something. Culture Clash doesn't do that. It reads more like Jean Donaldson -- a lively, agile writer whose style and sense of humor is a delight to read -- sat down and decided to write a set of thematic articles, and like those got packaged together in the form of the book. Each essay is trying to do both the book's jobs at the same time, so we're talking about treats and clickers AND ripping into the &quot;Bad Dog&quot; school of thought simultaneously. That means the level of detail in the text varies pretty dramatically from page to page. So, for example, you'll be reading about how to train a &quot;down stay&quot; or something, and suddenly Ms. Donaldson is skewering leash-jerking in a long aside. She delivers her barbs with obvious relish and skill, she's a heck of a writer, but when you're reading to pick up practical tips, that's a somewhat frustrating style to work through.So, the chapters in Culture Clash are this sort of mishmash of different material, but it's well-written and you enjoyed reading it through. Now, you remember some clever idea about how to train that &quot;down stay&quot; that Rex just can't &quot;get.&quot; You turn to the index... and there isn't one. The single easiest thing the publisher of this book NEEDS to do is include a thorough index. Argh! Frustration!The other irony, of course, is that the book doesn't use positive reinforcement on the reader all that well. When Donaldson goes after the leash-jerkers, or talks about ear pinching at obedience schools, she's saying &quot;BAD DOG&quot; to the old school of dog obedience in about as loud a voice as anyone can write in. You can see why a few people take this book as a sort of personal affront. She sure isn't luring THEM along, she's just plain scolding...If you're already sold on the idea of a rewards-based training regimen for your dog, I still think you'll get a lot out of this book. You might want to avoid dealing with a lot of the hard-hitting criticism, though, and choose a simpler how-to guide. &quot;The Power of Positive Dog Training&quot; by Ms. Donaldson and Pat Miller, is a more practical guide than Culture Clash. It gives you a specific, six-week training regimen. Also, Karen Pryor would be a good author for you; she has a great puppy book, and a nice little book-with-two-clickers-and-some-treats kit that sells in pet stores. Pryor spends almost no time on dissing the &quot;bad trainers,&quot; she's all about the positives.(If you've got kids, you may want to go with something a little more accessible for them; there are guides specifically written for the whole family that way, but you should probably judge those by age by seeing them in a store.)",
                "review/helpfulness": "311/327",
                "num_reviews": 327
            },
            {
                "review/text": "I completely agree with Ms. Donaldson's central premise; that we create unnecessary frustration (both human and canine) when we act on the mistaken notion that dogs possess human-level understanding of abstract concepts, human motivations and human desires. She presents excellent techniques designed to short-circuit the escalating frustrations that result from our tendency to anthropomorphize our dogs.That said, I do not like this book.Culture Clash has a minimalist table of contents and NO INDEX, which makes it nearly impossible to find passages on a specific topic. This renders the book nearly useless as a training resource or reference work.One could still read it cover to cover and glean much useful information in the process, but this would require enduring the vitriol that seems to drip from every page. The story I made up about Ms. Donaldson while reading Culture Clash is that she has been nursing some long-standing personal grudges against specific people in her professional field and that she wrote this book as much to ridicule them and settle old scores as to impart useful information to dog-owners.Ms. Donaldson seems unsatisfied with simply pointing out the faulty notions about dog behavior that are the currency of contemporary \"common sense\" thinking about dogs. It seemed to me as I read the book that she considers no myth properly debunked until she has cast one of her \"rivals\" as the personification of that belief and then heaped ridicule on that person. The following passage seems typical:\"I once spoke to a traditional trainer who poured scorn on the use of food as a motivator. The line he trotted out, which still makes me wretch even to this day, was \"if you use food to train, the dog is doing it for the food and not for you. (...) If you opt to not use positive reinforcement, you end up, like they all do, using aversives and announcing that your dog is doing it for you. Pathetic.\"If you think you would enjoy wading through 224 pages of this sort of thing, then Culture Clash may be the dog-training book for you. I'd still like to finish the book, but Ms. Donaldson's tone starts to wear on my nerves very quickly, so I take it in very small chunks.",
                "review/helpfulness": "252/313",
                "num_reviews": 313
            },
            {
                "review/text": "I am a dog trainer who specializes in individual consultation for behavior problems. I first became aware of this book from clients who had followed Dondaldson's methods and couldn't understand why their dogs were so uncontrollable, didn't respect them, and in several cases were becoming aggressive. I've made a lot of money &quot;fixing&quot; these dogs and retraining their owners, but I'd just as soon not.Donaldson wants to be a behaviorist, but selectively -- dogs are dumb and learn via Skinnerian and Pavlovian conditioning, humans are smart and learn via insight and reason. Sorry, no cookie, Jean -- Skinner would be the first to tell you that. She sets up a straw man -- anthropomorphism/abusive training -- against her brand of operant conditioning, and ignores the work of ethologists and ethological trainers.When Donaldson doesn't like some insight into canine nature, or a training technique that has been proven to work, she simply dismisses it as &quot;stupid&quot; -- no argument or justification. She appears to have great contempt for the native intelligence of both dogs and their owners (her readers).The few good ideas that Donaldson includes are old saws of dog training, but she never acknowledges this fact.Donaldson's approach to training is a fad at the moment. Readers seeking to live with a civilized dog would be better served by writers such as Carol Benjamin, The Monks of New Skete, Brian Kilcommons and Job Evans. Readers who just want to know how a dog &quot;works&quot; (ethology) should look at works by Roger Abrantes, Konrad Lorenz, and Michael Fox.",
                "review/helpfulness": "181/247",
                "num_reviews": 247
            },
            {
                "review/text": "I have read many dog training books in the past 6 months, but this is the only one that really rang true for me. Jean Donaldson articulates what many dog owners have felt for some time: that yanking, yelling and regimentation do NOT constitute positive training methods. She rightly calls slip-collars and choke chains &quot;strangulation collars,&quot; and makes it clear that the &quot;leash correction&quot; is simply a punishment -- and not a very effective one at that. Her whole training ethos is based on the premise that dogs are dogs, not people. That may sound pretty obvious, but it doesn't seem to be, at least not to traditional dog trainers. If you have a dog that likes to be a dog (interacts with both humans and dogs in the same manner, and doesn't like to be restrained in any way) Donaldson's training methods will save your sanity -- and perhaps your dog's life. This book is more than a manual, however, as it fully explains the theory before detailing the methods. Along the way, it provides a good read and some great laughs. This is also the first book I've read that describes some fun and effective training games to play with your dog, rather than just saying &quot;play with your dog.&quot; It's not all fun and games though: I dare you to read the section called &quot;Empathy 101&quot; and remain unmoved toward the plight of the average family dog. My only (minor) complaint about &quot;Culture Clash&quot; is that it needs either a more detailed Table of Contents, an Index, or both. That said, however, I urge you to buy this book, and leave the traditional methods of dog training back in WWII, where they began, and where they belong!",
                "review/helpfulness": "130/139",
                "num_reviews": 139
            },
            {
                "review/text": "I was originally turned off by the beginning of this book. The author's ideas about dogs having no &quot;desire to please&quot; their owners was so contrary to everything that is considered basic about dog training and dog behavior that I didn't believe it to be true. However, she thoroughly backed up her ideas and completely clarified the difference between &quot;desire to please&quot; as we see it and &quot;desire to get treats or attention&quot; as the dog sees it.It's difficult to get beyond the &quot;Disney&quot; approach to dogs as she calls it, the way society and Hollywood have taught us dogs should behave, but the book opened my eyes to what sort of relationship dogs really have with people.The book takes dog training from a dog's point of view - and that is the best way to get results. The empathy for the dog's position that the author encourages was a completely new experience for me. I adopted an adult dog from a shelter four months ago who had never been indoors before. She had been abused and you could hardly say &quot;no&quot; to her without her cringing and running away. I needed a training method that was completely positive and non-abusive in every sense of the word. More importantly, I needed a training method that worked.My dog can sit, down, stay, come, wait, drop, and fetch; she doesn't jump up, she doesn't chase the cats, and she's housebroken - all thanks to this book.The author thoroughly takes you through the way dogs learn with specific examples and exercises. It's hard not to get excited about teaching your dog after learning so completely how to teach!I highly recommend this book to new dog owners and to people looking to improve their relationship with their pets. Getting rid of unrealistic expectations makes all the difference in understanding and relating to your dog.",
                "review/helpfulness": "124/127",
                "num_reviews": 127
            },
            {
                "review/text": "My husband and I have trained and raised Dobermans for 18 years. This book has some good points, most notably debunking the Lassie paradigm. But her training method for teaching a dog not to jump is crazy making. She induces the dog to try to jump and then gives it a cue that it has made a mistake. A better method is to teach a dog to come up and touch his nose to a hand target and then sit. If your hand is low the dog can not jump. There are better books out on dog psychology and training. The Coppinger's book Dogs, a new theory of dog evolution is excellent. While pricey, Steven Lindsay's books &quot;handbook of applied dog behavior and training&quot; Volumes 1 and 2 are about the best out there. These are college level texts but written in a readable style with information on how dogs learn, biochemistry, genetics, breed traits, and more. Works by Skinner, the Bailey's and real life dog trainers are used as sources. Another lower priced book is &quot;How Dogs Learn&quot; by John Bailey and Mary Burch. This is real dog psychology and learning, not pop stuff with emotional and biased writing.",
                "review/helpfulness": "77/99",
                "num_reviews": 99
            },
            {
                "review/text": "A new way of understanding dogs from the dog's point of view. The book is brimming with empathy, humor, and understanding. Jean Donaldson is above all a very PRACTICAL lady - and her approach is very functional - it works! I particularly liked the insight that biting is natural behavior for dogs, i.e. that even the &quot;nicest&quot; dog will bite and it is therefore extremely important to train bite inhibition with ALL dogs. Donaldson also reminds us that dogs have no sense of morals and that they see a large percentage of the world as &quot;chew-toys&quot; or &quot;food&quot; (even your italian shoes and gum on the sidewalk), unless they are TAUGHT otherwise. The last section on practical training is brief, but extremely well written - if you follow this program you will end up with a recall proofed against virtually everything (yes, I've tried it). I recommend &quot;The Culture Clash&quot; to everyone interested in dogs.",
                "review/helpfulness": "74/82",
                "num_reviews": 82
            },
            {
                "review/text": "While it is true that dogs, like most mammals, including humans, can be trained by operant conditioning, Donaldson's basic premises are simply incorrect. Her arguments that dogs can't learn except through conditioning should be obviously faulty to anyone who has spent any time with dogs. It is true that dogs don't think exactly the way humans think, but they are certainly capable of observational learning and simple reasoning, for example. She begins her discussion by contrasting Skinnerian behaviorist notions (which were also incorrect in their basic premises) with the strawman of the \"Disney\" view of animals. She's not willing to take on serious recent studies which give real insight into how animals think, feel, and behave. The interested reader might want to check out \"Animal Minds\" by Douglas Griffin. Or much older, long underrated books by Charles Darwin and George Romanes, for that matter. Skinnerian behaviorism is headed for the garbage bin of obsolete theories. And there are also far more enlightened dog training books, by people who are in touch with more modern ideas about how animals behave. The choice isn't Skinner or Disney.If you really were to believe, with Donaldson, that dogs are nothing more than mindless, always greedy automata, why would you ever want to live with one? Luckily, she's wrong.",
                "review/helpfulness": "44/67",
                "num_reviews": 67
            },
            {
                "review/text": "I am a professional dog trainer, and *Culture Clash* is the only book I recommend to all dog owners, regardless of experience with dogs, training knowledge and ability, etc. Donaldson covers what I feel is the most important aspect of dog ownership -- bite prevention -- with a thoroughness that no other book does. Rather than blaming the dog for doing what comes naturally, she teaches the reader how to change the dog's natural responses to ones that are acceptable to human beings. And this will save many dogs' lives.Donaldson has been criticized for her up-front language, particularly when it comes to her criticisms of traditional (largely competitive) obedience trainers. But this is one of the things I like BEST about the book. Rather than pussyfoot around the issue of punishment, she confronts it head-on and then offers alternatives.A wonderful book that is not only very informative, but so well-written that you read it like a novel.",
                "review/helpfulness": "56/62",
                "num_reviews": 62
            },
            {
                "review/text": "I have to admit that I could not get past the first 30 pages. I was so turned off by the arrogant tone of this book that I simply stopped. Perhaps there is useful information further on, but I just don't see the point in subjecting myself to such 'stuff'. I doubt if Donaldson has ever lived with a Siberian Husky, but if she had she would never have dismissed the native intelligence and problem-solving abilities of dogs. Perhaps I just hate being told that I'm stupid. Perhaps I simply don't believe that my dogs are stupid. I just can't buy this book. I got much more useful information from William Campbell's 'Behavior Problems in Dogs', Patricia Gail Burnham's 'Play Training your dog' and 'On Talking Terms With Dogs : Calming Signals'by Turid Rugaas. Ian Dunbar has some great information as well. I'd simply avoid Donaldson and Diane Bauman as well unless you have a passive, easily motivated, eager-to-please, dependant canine shadow-dog. I've never lived with one of those.",
                "review/helpfulness": "41/57",
                "num_reviews": 57
            }
        ]
    },
    {
        "Title": "aspca complete dog training manual",
        "description": "\"A comprehensive, practical, and kind approach to lifelong training for dogs of all ages, breeds, sizes, and temperaments-- based on a system of praise and food rewards\"--Jacket.",
        "authors": "['Bruce Fogle']",
        "infoLink": "http://books.google.com/books?id=TS9WAAAAYAAJ&dq=ASPCA+Complete+Dog+Training+Manual&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book successfully guided my husband and I, first time dog owners, through all stages of adding a dog to our family. It offers advice on how to solve every problem we faced, and solved them conclusively. We found it indispensable. Although we had up to 7 dog training books that we had bought or taken out from the library, this was the one we always found the most helpful.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book is the best book on dog training I've seen sofar. The directions are clear, with very good pictures. The method is very dog and owner friendly. The introduction is very good, the explanations and the tips are very helpful. This is a great book, and I have recommended it to a couple of friends.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book bills itself as \"The easy-to-follow kind approach to training dogs of all ages.\"There are more than 350 color photographs to illustrate how to get your dog to heel, crate training your pet, lie down, sit, retrieving objects, playing with others, and down and stay, to name a few. Each step of the training process is illustrated. Solutions to a wide range of canine problems, from puppy mouthing nervousness, and food guarding to changing an older dog's unwanted habits are illustrated as well.This book also includes a section on how to choose a professional trainer.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "dogspeak how to learn it speak it and use it to have a happy healthy wellbehaved dog",
        "description": "Offers insights into effective communication with a dog, showing how to interpret face and body language and barks.",
        "authors": "['Bash Dibra', 'Mary Ann Crenshaw']",
        "infoLink": "http://books.google.nl/books?id=qjLm5yW5Zv8C&dq=Dogspeak:+How+to+Learn+It,+Speak+it,+and+Use+It+to+Have+a+Happy,+Healthy,+Well-Behaved+Dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Dog Speak not only shows you how to train your dog, but clearly and quickly explains why it works. Instead of just giving you lessons to blindly follow - it explains the logic behind the dog's actions, so you can in effect think like the dog and relate together. The dog naturally wants to please its master. Dog Speak shows you how to clearly signal to the dog and communicate one to one - to make your dog eager to please his master - and of course making the master extremely pleased with the dog.",
                "review/helpfulness": "47/49",
                "num_reviews": 49
            },
            {
                "review/text": "I had heard of this book, and being on a neverending quest for better canine health, wellbeing, and communication (as evidenced by my other reviews!) I decided to add it to my &quot;stack&quot; of read-and-rates.There is nothing new, novel, or remotely remarkable about this book. But less than average writing, poor illustrations, and out-of-date techniques are among some of its numerous flaws. I approached this book initially because it was listed under &quot;Dogs -- Behavior&quot; AND &quot;Dogs -- Training.&quot; But really if anything, it falls under choosing and caring for a new puppy!There are 10 chapters in this book. The first is more of an &quot;extended intro,&quot; second is Dibra's 8 Fundamental Pack Behaviors (nothing any reading/thinking person wouldn't know *yawn*), and chapters 3-6 are all about choosing and caring for a new puppy! WHOA! Wasn't this listed under &quot;Dogs -- Behavior&quot;? Just wait, it gets better!Chapter 7 finally gets to the &quot;behavior&quot; portion I crave. But I was severly dissappointed. The illustrations are terrible, if not incomplete, and the description of basic doggy body language is less-than-adequate. He doesn't even BEGIN to go into the complexities of certain types of dogs, or &quot;dialects&quot; as we like to call them! But all in all, if you have never read any texts on behavior, it may possibly be a wee bit helpful to you.Unforgivable Sins in this book:Dibra's puppy-buying guide relies HEAVILY on AKC as a &quot;starting point,&quot; saying you can use them for breed research, breeder referral, and a reference point. Not so. AKC offers generalities like breed standards (useless when matching a dog to your lifestyle!) and a list of breeders who may or may not produce quality dogs. This generally wouldn't bother me so much, but he KEEPS referring to it!Dibra recommends that at 6 months a dog be fitted with a &quot;control collar&quot;... which is a lame way of saying &quot;choke chain.&quot; He says in chapter 8 (pg 143) &quot;It goes without saying that training can't begin without the proper equipment: training control collar and leash ... Otherwise you have no control of your dog.&quot; Oh really? hmmm... I've never used a correction collar and I compete in agility, which takes a high degree of focus and control.I was disgusted by his use of the choke collar in general, such as when teaching heal, continually pop the collar at intervals to remind your dog to stay with you. What, is it a reward now? He also mentions that it is not punishment, it is correction, and that punishment makes a dog &quot;shut down.&quot; I'm here to tell you, I have a dog that &quot;shuts down&quot; when you tug on his nylon martingale accidentally! I know several others who shut down when you correct them verbally! How do you deal with that?He is against any other training device and doesn't even cover them except to say they &quot;backfire.&quot; Please be open minded! Even I teach methods for equipment I don't agree with!A minor fault: he refers to the veterinarian as the ultimate reference for doggy health. I'm here to tell ya (as a vet tech student and natural raiser) vets don't know everything! And above all else, who knows your animal better than YOU!I was severely disappointed with this book to the point that I wrote down the things as I found them (hence the quote). There are way more &quot;red flag&quot; quotes in the book. I can't believe this man teaches celebrities how to handle their dogs for $300 an hour. I know I will do without his help...Want a better book which is REALLY about behavior?...read Stanley Coren's &quot;How to Speak Dog&quot;Want a better book which is REALLY about communication?...read Suzanne Clothier's &quot;Bones would Rain from the Sky&quot;",
                "review/helpfulness": "26/30",
                "num_reviews": 30
            },
            {
                "review/text": "As I read this book, I kept turning back to the copyright date because I found it hard to believe that the training philosophy Dibra espouses is still being promoted. These techniques are old-fashioned; most respected dog trainers have long since moved on to an approach that encourages the dog to think, not to be pushed into position and then &quot;corrected&quot; if he does not learn from the experience of being pushed around.There are so many better books out there--please keep reading to at least get a well-rounded view of dog training. Don't accept any one trainer's or author's view as gospel.",
                "review/helpfulness": "18/22",
                "num_reviews": 22
            },
            {
                "review/text": "I enjoyed reading this book. More than the half explains everything about dog language, how to understand what your dog is trying to tell you, how to understand aggression, playfulness, fear etc, and how to reply to those signs once you 've understood them. The last chapters of the book deal with training (sit, stay, down), general information about the health of your dog, how to groom them, how you can improve an old dog's life and make those last years as comfortable as possible. You can see in almost every line Mr Dibra's love for dogs. It is truly wonderful! I was also amazed when I read that the author got a puppy wolf, as a pattern, in order for him to understand better the ancestors of our dogs and their behaviour.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Despite the author's statement, there is nothing revolutionary about this book. In fact, many suggestions in it are falling by the wayside (paper training, &quot;corrective jerk&quot;) as we learn more positive, fun ways to work with our dogs. Although it contains great suggestions for selecting a dog, other books have better all-around advice; for example, &quot;A Simple Guide to Puppies.&quot; For true enlightenment on dog communication, read Patricia McConnell's delightful &quot;The Other End of the Leash.&quot; Leave this one, with its aggressive approach to training, on the shelf.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "I was very surprised after reading this book. I thought it was going to be great to learn the language of dogs. There was very little to learn in this book if you know any thing about dogs at all, and I'm NOT a professional. Just a guy with a couple of dogs. What this book says is both not new and mostly obvious (bared fangs is aggressive. Oooh, how revolutionary!). Same with the training methods. I wonder if he is a good trainer in person. Maybe so, but if so he didn't put it into words very well in his book. Anyway, after reading this book I don't know any more about my dog than I did before.BUT MY BIGGEST PROBLEM WITH THIS BOOK WAS THIS: he talks about the horror of all the millions of dogs that are killed every year due to over population and then encourages buying your dog from a breeder! Pet stores and breeders are part of the problem. If you absolutely need a particular pure breed you can try to get one from a rescue organization and failing that get one from a breeder. But MOST people just want a family dog and a dog from the animal shelter are just as good or better than one from a breeder. IF YOU WANT TO BE PART OF THE SOLUTION INSTEAD OF THE PROBLEM, THERE ARE TWO THINGS YOU CAN DO THAT WOULD HELP TREMENDOUSLY: 1. GET A DOG FROM A SHELTER AND SAVE A LIFE. DON'T GET ONE FROM A BREEDER OR PET STORE! 2. SPAY AND NEUTER YOUR DOGS!",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I approached DogSpeak with enthusiasm -- as a keen dog handler and trainer I am always on the lookout for books that will enhance my ability to understand and communicate more effectively with my dear canine. The first part of DogSpeak was a reasonable introduction to recognising dog behaviours that may be useful to people coming to grips with their first dog, and who don't have other sources such as more experienced owners or a local obedience club to turn to. For people looking for more advanced dog-person communication, there was very little that was new or particularly insightful. The second section of the book on training was more disappointing. The training methods were basic, old-fashioned, and importantly were short on detail on what to do when the method does not work (and no method works all the time!) It is simply not good enough to reassure readers that 'your dog will understand this', as the author regularly did. Also the use of the corrective methods shown in the book could be dangerous and counterproductive in the hands of inexperienced trainers. Unlike the blurb, DogSpeak is definintely NOT revolutionary. It makes very little connection between the communication and the training sections, the former being basic and the latter being a method that has been around for many years before this book was published. This book would only be of interest to new dog handlers, and for those there are many better resources available.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I have just finished reading &quot;Dog Speak&quot; by Bash Dibra and found it extremely helpful. As an animal artist who prefers to paint from life, I frequently need to advise my clients on basic obedience for their pets. Mr. Dibra has written his book for pet owners and not professional trainers so it is easy to read. I have painted dogs of every breed and description and when owners used the techniques I recommended from this book I noticed a considerable change in the pet's behavior on subsequent sittings. There are no frills or controversial new training methods here, just solid, proven advice. It is a must for every first time dog owner or anyone who just wants to review the basics.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is an all-around puppy manual for the beginner. There were few novel ideas and the majority of these ideas seemed &quot;gimmicky&quot; by Bash applying his own monikers to techniques. Graphic illustrations (drawings) were remarkably poor. An experienced dog owner may find more use in one of the other dozens of books on dog training.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Great book! It was very helpful in letting me know what I should &amp; can expect from my puppy and trying to understand his needs and body language. A definate for anyone with a new puppy or just trying to understand their dog better!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "doctor dunbars good little dog book",
        "description": "Welcome to the historically-proven, so-old-that-it?s-new-again, natural, common-sense, and enjoyable way to train your dog?off-leash, lure/reward, fun and games, dog-friendly dog training. This book outlines step-by-step, illustrated techniques for socialization, temperament training, and behavior modification as well as for teaching basic manners. Dr. Dunbar's training techniques are altogether quicker, easier, gentler, more effective, and certainly considerably more enjoyable for you and your dog. Veterinarian and animal behaviorist Dr. Ian Dunbar is the original creator of off-leash puppy classes, which sparked the revolution for positive, reward-based, dog-friendly dog training.",
        "authors": "['Ian Dunbar']",
        "infoLink": "http://books.google.com/books?id=-SpbSAAACAAJ&dq=Doctor+Dunbar%27s+Good+Little+Dog+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is written in a way that is down to earth and easy to understand, even for a first time dog owner. Dr. Dunbar's advice actually works! Just follow it and be consistent! It worked for my dog, it can work for yours too! Great pictures and even a training plan. You need this book!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book offers tons of practical advice. It has step by step photos with captions that describe exactly how to train your dog. It is entertaining and useful, cleverly written so it can be enjoyed by the whole family, adults and children alike. We followed the instruction outlined in the book and by the time our dog got to training school she was the star of the class.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "After reading through half of this book, I finally got to the part where it explains how to train your dog. Reading this book feels like you are in conversation with an extremely talkative 14-year-old. The author repeats himself over and over to the point where you feel like there are about 5 pages of useful information and the rest is just to fill the book. No economy of expression whatsoever. All that aside, there are diagrams illustrating how to train your dog which seem useful.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I second all the other 5 star reviews! \"Ian Dunbar's books are the best in positive dog training available.\" Simple, straighforward, easy to read and easy to follow instructions. No new dog owner should be without this and his Before and After You Get Your Puppy\" books! I've followed his methods and took some classes at Sirius Dog Training, which teach his methods, and couldn't be happier with my two happy dogs! They are a delight to live with.Don't hesitate for a second before buying this and his other books. If more dog owners tried his methods, which are so humane, the dog populations at shelters would plummet! So many dogs are sent to shelters because the owners don't understand that dogs don't understand from birth what we expect of them - they have to be taught!!! The best way to teach is to understand the animal's nature and why it behaves as it does, which leads to understanding how to teach it what you want. People who tell you their dog is just stubborn or who tell you that you have to dominate the dog and show it who's boss are showing their ignorance about dogs and training. Give them this book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "All I can say is that this book should go home with all new dog/puppy owners! It really is a must have, it's exactly what Dr. Dunbar say's \"Efficient, Effective, Easy, Efficacious, Enjoyable, and Expedient\". It's easy for kids to use too.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "My dog is a product of Dr. Dunbar's training techniques. He is a dream dog! Consequently, I give his books to all my friends and family who have puppies. These books are easy to read and follow and best of all, they work!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Ian Dunbar's books are the best in positive dog training available. Easy to read, easy to follow instructions. Practical no nonsense solutions. All new dog owners should read this book and Before and After You Get Your Puppy!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Good information for new puppy and for existing dogs. Positive training ideas. Step by step instructions. Good reference book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "natural dog training",
        "description": "Natural Dog Training is about how dogs see the world and what this means in regards to training. The first part of this book presents a new theory for the social behavior of canines, featuring the drive to hunt, not the pack instincts, as seminal to canine behavior. The second part reinterprets how dogs actually learn. The third section presents exercises and handling techniques to put this theory into practice with a puppy. The final section sets forth a training program with a special emphasis on coming when called.",
        "authors": "['Kevin Behan']",
        "infoLink": "http://books.google.com/books?id=ny9KAgAAQBAJ&dq=Natural+Dog+Training&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I first read this book ten years ago I disagreed with almost everything in it. But there was something about the things that Kevin Behan said that piqued my interest, so the next day I tried using one of the techniques from the book on a dog I was training at the tiome (I'm a professional dog trainer and author) and was amazed at the results. I tried other techniques in turn and found that they always worked. In almost no time I was re-training dogs that had been \"ruined\" by far more experienced trainers than I was--dogs that certain experts said couldn't be trained at all were almost instantly transformed into very obedient doggies. And they all loved it!It's so sad that most pet dog trainers don't understand or use these techniques, which are similar to the methods used to train search-and-rescue dogs, drug-enforcement dogs, and police dogs.I am currently training dogs in NYC using Kevin's methods, and I am also writing a series of mystery novels featuring a dog trainer/detective who also uses Natural Dog Training techniques. In fact, these techniques are artfully interwoven into the mystery stories. The first book, A Nose for Murder is available from Avon, and it's a testament, in part, to all of the incredible things I learned from Natural Dog Training, which I think is the best dog book ever written.",
                "review/helpfulness": "73/96",
                "num_reviews": 96
            },
            {
                "review/text": "When NATURAL DOG TRAINING first came out I was a novice dog trainer working in Manhattan. I was looking for a new training modality because I had this feeling that everything I had been taught about dogs was wrong. I was particularly dissatisfied with the alpha theory and the training techniques based on it.I read Kevin's book in one sitting and disagreed with almost everything he said except for two things: he teaches dogs to jump up on command, and he recommends playing hide-and-seek with a puppy when it starts its \"independence phase\" at about 5-6 months. I'd already found out on my own that these were both very helpful training techniques but had never encountered any other dog trainers who recommended them (this was before I'd read PLAYTRAINING YOUR DOG by Patricia Gail Burnham, who also uses jumping up in her training system).The next day I tried one of Kevin's techniques with a pit-bull mix named Mickey, who had a problem with leash aggression: the instant he saw another dog on the street, he would go ballistic--lunging and growling, teeth bared. The only thing that prevented an all out attack was the fact that I'm a fairly big guy and I had an iron grip on his leash.After doing an exercise from Kevin's book three or four times, Mickey's behavior changed so dramatically that as soon as he saw another dog coming toward us, instead of lunging the way he did before, he would move back into position next to me, right into the pocket, and actually look up at me while performing the most perfect heel I'd ever seen. The urge that had been so completely in control of his behavior before -- the desire to sink his teeth into the other dog -- had been transformed into an intense, almost magnetized focus on me.A week or so later I got a call from a woman who owned a Jack Russell terrier named Mack. The experts at the Upper West Side training school he'd attended told her that he was untrainable because he wouldn't learn the down. They said that there was probably something wrong with his breeding. Mack's owner was in tears when she told me this, thinking that she had a \"defective\" dog.I took Mack into Central Park and applied one of Kevin Behan's techniques. Basically I teased him with a tennis ball then got him to chase me around until he was crazy to bite it. Then I taught him that if he wanted the ball he had to lie down to get it. Within half an hour he was lying down on command and LOVING it! In fact, he'd do it while running at full speed! And just like with Mickey, it was almost as if Mack's focus had been magnetized to me. Mack's owner later told me that whenever she went out for pizza at a little place on Columbus, she would tie him to a parking meter and go inside to order her pie. From inside the restaurant all she had to do was look at him, put her index finger in the air and then point it toward the ground and Mack would instantly lie down on the sidewalk, happy and proud of himself. And this was a \"defective\" dog that couldn't learn to lie down on command!I cannot praise NATURAL DOG TRAINING highly enough. It's true that Kevin's prose style sometimes gets in the way. But when you apply the exercises he describes, and understand the underlying philosophy behind them (i.e., there's no such thing as an alpha dog, and that learning doesn't have to take place through association, trial and error, or countless repetitions), dog training becomes an amazingly enjoyable experience. But it's more than that. In my case it actually changed my life because it's specifically designed to put both the dog and owner back in touch with nature.I now write a series of mystery novels with Kevin's philosophy and techniques woven into the storylines. I get e-mails from readers who not only tell me they like my stories, but that they've tried Natural Dog Training and that their dogs are better-behaved as a result.Every dog lover, dog owner, and dog trainer should own this book!",
                "review/helpfulness": "72/81",
                "num_reviews": 81
            },
            {
                "review/text": "This method of training really works in a real life every day run of the mill home. It is presented in a clear, concise easy to understand way that explains the theory, gives examples and provides easy to follow step by step directions while addressing a variety of issues that may apply to you and your dog. I have a young shepherd, with which I began training following the traditional \"obedience training\" through the so called \"humane\" training that teaches you that you must be alpha or the big bully on the block to control and force your dog through dominance. After one book and two \"obedience\" classes, my shepherd was considered untrainable, overprotective and genetically flawed, with the recommendation to be put down at the age of 12 months. I purchased this book, in hopes of working with my dog versus dominating him, as my goal was to have a companion and protector. I found that Mr. Behan's methods are the not only the most humane and successful of any training, but the only method of training that should be used as I am now developing a strong dog through using the strengths that everyone admires in dogs instead of attempting to destroy them. My dog no longer demonstrates being afraid of me when I give a command, responding slow and challenging, my dog now obeys immediately and eagerly. Whether following a down stay command to not chase the cat, or quietly laying beside me while I read the paper, my dog now looks at me with respect and eagerness. We have developed mutual respect without brutality. These methods work and work well. It is based on accessing the very natural traits of dogs that humans admire and find usedful, and channeling their natural prinal responses to become lifelong reliaable companions; all the while really connecting with your dog on a base level and having fun while doing it. Who knew that successful training can be fun?! This method was so successful that while I train my shepherd, my husband's Llewellyn Setter responded to the training incidentally and had her best hunting season ever. As with any training, you must be consistent and dedicated to working with your dog. If you are looking to train and develop a strong, reliable companion without bullying, choking or bribing, (none of these methods will produce a consistently obedient dog)in a humane and successful lifelong way, this method is the only way to go. I am so thankful for this book and Mr. Behna's words of wisdom and encouragement to have fun with your dog. I find it difficult when reviews misrepresent or omit complete ideas of the author's works such as the use of pinch collars, choke collars and shock collars. After using the traditional choke collar and the training choke collar, I switched to the pinch collar. I found that with the traditional and training collars, I could have damaged my dog's throat and neck permanently or killed my dog, as these collars can and have blocked off the airways to animals. I believe in the pinch collar because you cannot choke your dog, it will only tighten just so far, and the pinchers are not localized to one spot on the neck, but around evenly so that the corrections can be done with less force and reduces the risk of damage that can be done to a dog's neck greatly. I believe that common sense, which apparently is lacking in some individuals, dictates that any collar or training device be the appropriate size for the individual dog. This misrepresentation of this and the allusion that the author implies that you put a heavy choke collar on any dog, regardless of its size is ludicrous and false. This is not the case; the author presents in a clear and easy to understand way the methods and discusses the variety of training materials for various dogs with varying issues. This is extremely helpful to be able to address those concerns that are relevant to me and my dog. If any one who would label these devices as torture actually researched and properly used or watched these tools properly used, he would have to admit that the very torture he wants to avoid are most applied and used regularly in traditional methods not in natural dog training. Mr. Behan stresses the proper training and use of these devices and the evaluation of necessary devices only when warranted. It is not helpful to provide a review without all the facts, whether you support the information or not. This book is the only book you need to raise the best companion you will ever have. While searching on the web I located the webpages and found these to be extremely helpful and I encourage anyone who is thinking of getting a dog or already has one, to purchase this book and check out more information on the author's website for natural dog training. You and your dog will be happy you did!",
                "review/helpfulness": "72/81",
                "num_reviews": 81
            },
            {
                "review/text": "While I have my quibbles about Kevin Behan's style of prose ('Natural Dog Training' is a little difficult to wade through at times), I simply can't praise this book highly enough. Behan's central point of 'Natural Dog Training' is that your dog, being descended from wolves, has an irresistible call of the wild - the need to hunt, to chase, bite and kill prey - and that you can train your dog naturally, without relying on treats or 'domination' methods, by satisfying this 'prey drive'. In a natural wolf pack, the need to hunt large prey requires harmony and cooperation between the pack members, not domination and submission, and it is this desire to reach harmony with the pack that you can tap into simply by allowing your dog to be a dog, to satisfy his need to hunt together as a pack. You do this by playing hunting games - fetch, tug, chase, hide 'n seek and others - and channeling your dogs resultant attention to you into obedience behaviors.The 'Natural Dog Training' method is very unique when compared to today's trend towards food-based 'positive reinforcement' methods. First, there is no emphasis on 'early' puppy obedience training. 8 week old puppies don't need to learn obedience - they need to learn how to live harmoniously with humans and how to be attentive to their human masters. With 'Natural Dog Training' you concentrate on patient housetraining, re-direction techniques and, most importantly, confidence and attention building through robust play with your pup. While mainstream dog training is essentially split between the dominance-based (think Cesar Millan) and 'positive reinforcement'-based (Karen Pryor, Ian Dunbar) camps, both of these approaches essentially focus on the same thing - the supression of natural, instinctive behaviors of dogs. With natural dog training, the natural and instinctive behaviors of all dogs (jumping up, chasing and biting things) are actually stimulated and channeled into pure, enthusiastic obedience. This method teaches your dog to be highly attentive and highly enthusiatic to obey a command because his ultimate desire, the need to chase and bite something, is fulfilled through attention and obedience to his master.When I abandoned the 'positive reinforcement' methods of treat-based early obedience training in favor of natural dog training, a funny thing happened with my puppy - she became attentive to me. I became the center of her universe simply by making myself her source of fun and play. We took long walks together, where we played numerous 'chase', 'hide and seek' and 'tug o' war' games. As illogical as this sounds at first, teaching her to jump on me and to 'dance' with me, strengthening that natural instinctive desire to make contact with me, became the key to teaching her to walk nicely on leash, to 'heel' and to 'come' when called. At 9 months, she took off after another dog that had wandered into our cul-de-sac, but instantly recalled back to me at top speed. She continues to recall like this. Her usual reward? Some hardy wrestling and a 'tug o' war' session.My puppy is now a year and a half old, and I can walk with her around the neighborhood off-leash, with all the distractions that that entails. I can leave her alone in the home while I'm away at work, and I don't have to worry that she will be destructive or bark incessantly for hours. I credit Kevin Behan's book for showing me the way to raise a puppy properly and to satisfy her instinctive doggy needs in a manner that channels her natural desire for harmony and obedience. Additionally, I would recommend reading any of Lee Charles Kelleys' novels (see his review of 'Natural Dog Training') and his insightful Amazon blog for dog training tips and to further refine your understanding of the natural dog training method.Be your dog's best friend and buy 'Natural Dog Training'!",
                "review/helpfulness": "75/80",
                "num_reviews": 80
            },
            {
                "review/text": "Behan's book is typical of many other dog training books -- he has observed dogs, seen what works for him, and assumes that it's a great method. He does make some good points. Often, I have seen some people focus on positive reinforcement as being only food rewards, and I think it's good to focus more on life rewards. For this reason, I'm giving the book 2 stars instead of just 1.However, the bottom line is that this book isn't the best way. It's clear to anyone who understands animal learning theory that Behan hasn't done the research on the science of learning. For example, he recommends physical corrections. While animals can learn from physical corrections, scientific studies overwhelmingly support positive reinforcement and non-physical punishment (such as timeouts or removing something the dog wants from his environment) as much better methods that efficiently get reliable results with few or no side effects. Some people will argue that those opposed to physical corrections are just being politically correct. I have used physical corrections. I have seen professional trainers use physical corrections properly, and I don't believe that they were abusing the dog. I don't believe that physical corrections are unethical, when used properly; I simply accept the evidence that they are less effective than positive reinforcement.As pet owners, I think we have a responsibility to them to stop choosing what people guess is best (which is what Behan does) and start choosing what has been studied and proven to be best. I'm sure these methods work for some people, but I'm just as sure that more people would benefit from the methods supported by science, and that even those who find that Behan's methods work will find that science-based methods work better (assuming the methods are used correctly). If you'd like to learn more about science-based methods, I'd recommend Karen Pryor's \"Don't Shoot the Dog\" -- the science behind these methods has been studied and tested since the 1940's, although it has been largely ignored by dog trainers. Another book, \"How Dogs Learn\" by Mary Burch and Jon Bailey, is also good for learning about the science of dog training, although I saw one inaccurate comment (the book claims that physical punishment should start off gently and be increased as necessary, but actually punishment should start off severe in order to be effective). If you're looking for detailed instructions on how to train your dog with these methods, look to Pat Miller's \"The Power of Positive Dog Training.\"",
                "review/helpfulness": "30/48",
                "num_reviews": 48
            },
            {
                "review/text": "When it is time, to discuss things regarding the training of dogs, in regards to this book written by one Kevin Behan, it is best to mimic the style of said author by using flowery, overzealous prose. In short, his phraseology has acquired characteristics that would rival that of even the brightest of lilies, sparking with dew, radiating light in the sunshine of a summer morning, shivering in the cool morning breeze. Upon reading, one is able to ascertain that is preferable for one who would like to discuss such matters to use, plenty, of, superfluous, commas, inappropriately, speeling things somewhat correctly when happenstance makes such an effort convenient in light of your current situation, and to cement social bonds with conspecifics through poor grammar. This book is truly a less-than-scintillating celebration of syllabification and overcomplication while serving the transmogrification of dubious training concepts into the ethereal essence of boredom.(Harmonic pathways? Orbiting patterns? Seriously?)Furthermore, once you begin, to read a new chapter in this book, the only thrill you will have is knowing that you are, one chapter, closer to the end. You will be able, eventually, through time, to be able to at some point in the future rely on some mystical attraction and invisible \"harmonic pathway\" fairies, which will free you, of course, and many readers who are also so equally overwhelmed by the poor quality of this written work, from the bonds of what science has proven is effective in modifying the behavior of animals.If you found the first two paragraphs of this review unintelligible, obnoxious, and not worth reading twelve times to get even a semblance of meaningful information, you'll hate Natural Dog Training. If you've ever hoped someone would commit suicide by bashing their head against the wall, you may want to lock them in a room with this book for a few weeks - a read through would leave you wanting revenge anyway, and this book would be a better tool of vengeance than it is a training manual. In fact, I think law enforcement should be aware of this book as it may provide a useful tool in coercing statements from witnesses.At the insistence of a friend, I waded through this book. I think wading through a football-field's length of five foot deep rubber cement would have been a) easier and b) more enjoyable an endeavor.",
                "review/helpfulness": "31/43",
                "num_reviews": 43
            },
            {
                "review/text": "I received this book two days ago and am returning it for a refund today. This is the first time I've ever returned anything to Amazon. The author's prose is almost unreadable. The book is full of typos and non sequiturs. There wasn't what I expected... a detailed step by step program for training your dog. Instead there were ramblings about dogs' wolf ancestry, it's prey instincts/behaviors and other filler verbiage to compose a book that could be in my opinion much briefer. And at a price of almost $25 this added insult to injury.",
                "review/helpfulness": "21/27",
                "num_reviews": 27
            },
            {
                "review/text": "It's kind of a \"use the dog's drive\" way of training. It's pretty cool but reminds me of hippie parenting--work with the dog's instincts without condemnation--and it didn't entirely work for my dog. The author doesn't believe that a dog might just be hyper. To explain, I have a blue heeler and his drive keeps going and going, and eventually I needed more advice on how to calm him down when in the presence of other dogs. Unfortunately this book isn't geared for a special needs dog like mine, but I think this book would work well for mellower breeds. I did learn about the impportance of play training, so it's a worthwhile book.",
                "review/helpfulness": "16/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book is very poorly written and relies heavily on the use of choke chains and pinch collars (& the author clearly tacitly supports shock collars). While the author may not use them for punishment, the bottom line is that he uses them - and all the fallout that is associated with their use may well come along for the ride.The idea itself has much to offer. It dismisses dominance/alpha theory (and well it should; those ideas are outdated and misguided) and offers an alternative to food training that focuses more on redirecting a dog's ENERGY (versus just behavior) and bonding through PLAY (rather than food). It is great for my high-drive Border Collie mix, and my brain-in-her-nose Beagle mix is also responding. It is also easy to incorporate into positive reinforcment methods for a blended, whole-dog approach.But the book itself is a disaster. More enlightened, humane, and - frankly - readable proponents of this theory/method are Neil Sattin and Lee Charles Kelley. Find their web sites instead.",
                "review/helpfulness": "18/23",
                "num_reviews": 23
            },
            {
                "review/text": "I must say that for those reviewers who complain about the use of corrections or prong collars etc, you've obviously missed the whole point of the book. This book is not based or focused on using correction techniques. If you use corrections simply to suppress a dog's behavior, then yes, you will cause behavior problems and possible aggression as well. But that is not what Kevin is recommending or teaching in his book. The entire premise and theory is based on building and controlling a dog's drive, not correcting a dog to suppress them in order to create a desired behavior. I've worked in the correction based methodology before, and believe me, it's an entirely different world than what is being taught in this book.I've used dominance based training, as well as positive reinforcement and clicker training. Neither of those methodologies got me the results I wanted. Sure, they both worked to a degree. Dominance training created dogs that were under control, but they sure weren't happy. And there was always that undertone of fear and tension between us. Positive reinforcement and clicker training worked great when we were working. But it would all fall apart in the real world when there were more interesting things to do. Not to say they didn't retain some of what they learned. But they just weren't reliable when using only positive reinforcement methods. I guess if I had continued doing it for the next 10 years, then maybe they would finally be reliable all the time. But once I began using Kevin's techniques, I started seeing an instant transformation in my dogs. They started going from confused and disinterested, to paying attention and being happy to work with me. And it really was almost immediate.I believe that all forms of training have something positive you can take away from them. Although I've learned that dominance training has little or nothing that I would want to continue using. But natural dog training has and continues to transform my relationship with my dogs. And I am convinced that it can do the same for most people.It is fair to say that every dog is different, and that there will be dogs that may require a different form of training, or creative elaborations on Kevin's techniques. But I would also say that I have yet to find any other philosophy that works as well for as many dogs as this one.Any training model will probably work if you dedicate yourself to it. But I think that Kevin's philosophy and techniques provide a way to get the results you want, while respecting and honoring the dog's true nature and spirit, instead of trying to suppress it. And that's why I recommend this book more so than anything else I've come across.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            }
        ]
    },
    {
        "Title": "raising rover breedbybreed training from afghans to yorkies",
        "description": "Provides general training tips for all dogs as well as information specific for each breed",
        "authors": "['Judith Halliburton']",
        "infoLink": "http://books.google.nl/books?id=gsRIGwAACAAJ&dq=Raising+Rover:+Breed-By-Breed+Training+from+Afghans+to+Yorkies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I like the idea of a book that addresses breed differences for training. I was very disapointed in that the author, though she discusses different breeds, only advocates one type of collar for training - a choke chain. She says other types of collars are &quot;useless or downright ridiculous&quot;. I don't agree with this. The training that she advocates is very traditional, and there are many books that explain it better and more thoroughly. Her descriptions of the breeds of dogs have several major flaws, which made me question all of her observations. She seems to have confused Bull Terriers with Pit Bulls (not!) and American Staffordshire Terriers with Staffordshire Bull Terriers. There is a lot of confusion amoung the general public about the &quot;Bull &amp; Terrier&quot; breeds, but a book claiming to give information about the different breeds should have the correct information. She refers to Australian Cattle Dogs as &quot;Blue &amp; Red Heelers&quot; which is the vernacular in many rural areas, but not the correct name of the breed. And they were not bred to herd sheep, but cattle. Nor were corgis bred to herd sheep. And Rottweilers do not weigh 200 pounds. Some of the breed temperament characteristics she talks about are correct, many more are not at all what I have observed over many years in dogs.I could go on but I will quit there. The book made me nuts. I'm glad I bought it on a half price sale. If I had paid the full price I would have been even more irritated.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "As I an owner of several Borzois (Russian Wolfhounds), I was shocked to see that Ms. Halliburton states &quot;Borzois come originally from Arabia, so even cool weather might keep them in the house.&quot; She also says the breed likes to be outside, especially in the warmer months.One theory of many about the development of the Borzoi is that they originated from a pair of Salukis, greatly valued by Arabian nobility, being given to a ruler of Russia. However, this theory goes on to say the Salukis could not withstand the Russian winters and so, were bred with a heavy coated native Russian canine to produce the Borzoi.Borzois come from Russia and were bred to not only survive, but enjoy the cold climate there. Not only do my Borzois dislike heat, they have a low tolerance for it and must be protected from heat stroke.While her description of their termperament and attitude toward training was accurate, this error about the best environment for this wonderful breed could prove deadly.I hardly know what's best for every breed, but I feel cause for concern that requirements for other breeds could be misrepresented and create serious problems for the dogs and their owners.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I found this book to be easy to use and simple to implement. Love of dogs permeates the book, while the author explains such tricky subjects as displacement (why he tears up the sofa when you're gone) and hierarchies (how people make their little dogs into terrors.) The biggest and best part of the book is the breed by breed breakdown where all that the author has taught you before gets highlighted according to the breed of dog. She tells the tale of a Great Dane who really didn't want to run the family, and how the family's futon furniture confused him into thinking he was the top dog. If a breed is hard to housebreak, she explains why and how to get around it, and goes into the mindset of many breeds as a training tool. I read dog training books all the time, and this one is full of great ideas and a real empathy for dogs that should let anyone get closer to their dog. Humane training, emphasizing psychological methods, is the best way to train your dog, and with this book there should be nothing you can't do with Rover!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "RAISING ROVER is definitely different from any other training book I've ever encountered, in that it concentrates on training tips and methods by breed of dog. In addition, I think it would be a marvelous book for would-be dog owners to peruse to help them decide which breed is right for them.The book starts with a 95 page general training section, the usual housetraining, obedience, dog pack &quot;pecking order,&quot; and problem solving. I always find it useful to read these sectiosn because each author/trainer (Halliburton is an animal behaviorist and trainer) has different methods and new viewpoints and tidbits to add. Halliburton includes a chapter called, &quot;It's Okay, It's Okay&quot; about the pitfalls of trying to comfort one's dog in times of stress such as visits to the vet, loud thunderstorms, strange people, and the like.Then comes 175 pages of breed profiles--profiles of 87 of the most popular breeds (sorry, no Clumber Spaniel, Ibizan Hound, or Dogue de Bordeaux). The basis of these profiles is, of course, that well-bred purebred dogs (i.e. not bred willy-nilly at puppy mills--DO NOT buy from them or from pet stores!) have certain predictable behaviors for each breed, and particular ways of reacting, learning, and getting along with others.Each profile includes:What the dog was originally bred for: Basenjis were bred in Africa to act as guides to hunters and warn their human if there was a lion or some other dangerous animal in the vacinity.Housetraining tips: you can't tell if a Bloodhoud pup needs to go out just because he's sniffing the floor, becauses he's *always* sniffing the floor and everything else; if your Bulldog pup starts sniffing the floor, whisk him outside immediately; Poodles are one of the easiest to housetrain.Personality: Dachshunds can be problem barkers because they all think they're Mastiffs; Cocker Spaniels get along great with children and will happily follow them anywhere; Pekingese &quot;have more guts than brains...wouldn't hesitate to protect you from a lion&quot; (a Peke is a toy breed weighing no more than 15 pounds); &quot;Vizslas are an odd mix of hardy hunter and nervous wreck.&quot;Training: Boxers, Chesapeake Bay Retrievers, Rottweilers and Samoyeds are some of the breeds that need strong leadership from their human; &quot;Borzois can be very bullheaded if you're asking them to do something they don't want to do or see no point in doing. On the other hand...these dogs are polite and well-mannered automatically;&quot; regarding Border Collies, &quot;There is very little you can't train this dog to do. And what you don't train Rover to do, he'll probably figure out for himself.&quot; (Then follows a great anecdote about a BC who learned out to get ice from the dispenser in the door of the refrigerator).Environment needed, including active (Irish Setters) or sedate (Great Pyrenees), how they get along with children of various age groups (Chihuahuas are great with teenagers but not good with small children) and the elderly (Minature Pinscher), whether they can be latchkey dogs, whether they get along with other dogs in the household, if they can live happily in an apartment (yes, Great Danes can do it), how much exercise is required/tolerated.Halliburton is also clear on the disadvantages of each breed: which tend to bark (Alaskan Eskimos, Pomeranians) dig (Alaskan Malamutes), drool (St. Bernards), and snore (Boston Terriers, Bulldogs, Pugs--of course when *my* Pug snores, it's a comforting lullaby to me, not a disadvantage at all!)What if you have a mixed breed dog? Well, if you know that it's a Chow/Siberian Husky cross, you just read the profiles of those two breeds and observe your dog to see how they combine in him. If you get a dog from a shelter (a very commendable act!) and it seems to have some Doberman, German Shephard, and Golden Retriever, read about those breeds.In the You Learn Something New Every Day department, here's something I've *never* heard of before: because Great Danes originated as a breed around 300-400 BC, the different colors (fawn, brindle, black, etc) have different temperaments. I wonder what the Great Dane people have to say about that.Halliburton doesn't talk about a dog's size, grooming requirements, and that sort of thing because she's assuming you already have your dog, so for this reason this book isn't a great stand-alone guide to choosing a breed, but it's got a lot of insightful information on the subject, and can be exceptionally helpful in training.Kimberly Borrowdale Under the Covers Book Reviews",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This was a useful little book and the author definitely got some breeds right on, but the training methods she uses are a little &quot;traditional&quot; (penny cans to startle dogs, leash corrections...) given the positive methods that are proving so effective. It is also the only place I have seen &quot;heel&quot; defined as &quot;start walking&quot; rather than a position. Still, I find myself pairing all sorts of phrases with actions and my dog is clearly beginning to understand some of them (she WAITs at curbs until I say it's OK to cross) so much of the information is quite useful...I would just tend to use more &quot;Playtraining&quot; like methods, but I have a sighthound.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "advanced schutzhund howell reference books",
        "description": "\"Ivan's training comes from the heart, for the dog. He has certainly enhanced my view of training and has taught me many valuable, yet simple techniques to achieve the most from my dogs and myself.\" --Mary A. Allen, World Championship Competitor, USA Apprentice Judge, USA New England Regional Director \"Ivan Balabanov is among the few top trainers in the country who truly understands dog behavior and drives. He is highly respected by the best Schutzhund competitors, trainers and coaches in the country.\" --Glenn Stephenson, United Schutzhund Clubs of America Judge, International competitor Training methods for the top competitor. Advanced Schutzhund takes a problem-solving approach to Level III work that will help competitors bring their dogs to the highest level. Tracking, obedience and protection are dealt with individually, analyzing specific problems that crop up in each skill and offering step-by-step solutions. The approach uses operant conditioning techniques that steer clear of compulsion methods and build a dog's confidence, courage and problem-solving ability. You'll also find tips on how to compete at the National and World levels, including traveling with your dog. A Howell Dog Book of Distinction",
        "authors": "['Ivan Balabanov', 'Karen Duet']",
        "infoLink": "http://books.google.nl/books?id=OGUMAAAACAAJ&dq=Advanced+Schutzhund+(Howell+Reference+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Too often in the dog sports we find ourselves looking for answers to training problems. There are many good books that give an overview of schutzhund, but not many that get down to the meat of things. I received my copy of this book just a few days before a trial and found myself thumbing through the book to find a solution to a pre-trial problem with my dogs Guard and Bark. Ivan and Karen's well thought out book, not only pointed out where my problem came from, but offered a solution. Not many fixes work that easy, but I walked away with a Sch II on my Malinois after the trial was over. Advanced Schutzhund will be in the equipment bag along with the sleeves and the dumbells from now on.",
                "review/helpfulness": "41/43",
                "num_reviews": 43
            },
            {
                "review/text": "Training for Schutzhund has been an art passed on by club members. Most of the successful trainers in this sport are not as effective as teachers for the adult human. This book has bridged the gap providing effective communication to the handler on how to communicate effectively with the Schuthund dog.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "In my opinion, this book will NOT take you from buying and raising your first puppy to the trial field. I believe, it assumes you have many basic training methods already in place, ie. how to train tracking. IT IS an Excellent ADVANCED Schutzhund book.",
                "review/helpfulness": "15/19",
                "num_reviews": 19
            },
            {
                "review/text": "The book was very informative, but I wouldn't suggest that a person without a strong working knowledge of training dogs reads this book untill they become more familar with dog training and the sport of Schutzhund.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "This book will take you from buying and raising your first puppy to the trial field. Ivan's training methods work by making the dog work to please you and how to REALLY be your dog's bet friend. Better then 10 seminars. Douglas Loving, Chantilly, Va",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book is well written and helps to explain a very complex subject. Ivan's methods are humane and help develope the dog's natural abilities based on the dog's drives. I found this book to be in the same catagory as Helmut Raiser's &quot;Der Schutzhund(translated by Armin Winkler), Gottfried Dildei and Sheila Booth's &quot;Schutzhund Obedience&quot; and Sheila Booth's &quot;Purely Positive Obedience&quot;. All three of these books are outstanding and should be a part of every Schutzhund trainer's library. &quot;Advanced Schutzhund&quot; adds the finishing touches to competition training.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "Ivan's and Karen's book was extremely helpful and is a must have. It gives you some problem solving techniques and advices you how to approach most common problems. I especially liked the suggestions on overcoming distraction issues. The different methods described really teach you how to think like the animal, and use it's innate abilities to your advantage. In the end you get a wonderful, obedient world competitor that is happy to do everything you ask.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Great book on working a dog using drives (mainly play, prey) and positive techniques. Much better than adversive schutzhund techniques. Lots here for the competative obedience person or anyone working a high-drive dog. Highly recommended.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Reading fluency: 6/10Content information: 10/10Entry level requirement: 7/10The book is not quite intended to take your green puppy up to the SCHH/IPO competition, but to fulfill your decently trained dog's potential. Ivan does cover some basic procedures, but only briefly, not enough to help you start from sratch. The main focus is on solving and avoiding problems and if you don't have the basis, you won't get the full scope of the book.About the author (Balabanov): 10 consecutive years as IPO3 champion in USA AWMA/AWDF, FMBB world vice champion in 2000, FMBB and FCI world champion in 2007.The book covers theoretical aspects of dog training: how dogs think, a small introduction to classical and operant conditioning and how to motivate the dog. These sections can greatly benefit everyone interested in getting along with their dog and they are very well written.The main chapters are devoted to SCHH/IPO: how to select the right puppy, the regulations for each of the 3 SCHH3 tests, how to deal with some problems that may occur in each of these, how to get ready for the trial day.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "adoptable dog teaching your adopted pet to obey trust and love you",
        "description": "A guide to the special needs of pre-owned dogs shares advice for dogs of all ages and with a range of training needs, discussing how to choose a dog that is compatible with a home, how to introduce a dog to family members and other pets, and overcoming a history of abuse. 35,000 first printing.",
        "authors": "['John Ross', 'Barbara McKinney']",
        "infoLink": "http://books.google.nl/books?id=lEjW6HDRA2oC&dq=Adoptable+Dog:+Teaching+Your+Adopted+Pet+to+Obey,+Trust,+and+Love+You&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was recommended to me by some fellow rescue workers. I'm an experienced rescue worker and dog breeder.I fully recommend this book to those who:1. Are new to rescue dogs.2. Need to know some of the typical behaviors a rescue dog may exhibit.3. Need a refresher course on foundational basics of rehabilitating rescue dogs.4. Need affirmation about good methods used in modifying negative dog behaviors.5. Want to rehabilitate any dog that exhibits negative or undesired behavior(s).To the experienced dog rescue workers like me, this book offers nothing new. It may be obvious to some readers that this author has spent many years in dog training but not indepth actual shelter work. However,I was happy to see that, although the author lacked a lot of personal shelter experience, he had invested and employed a good amount of homework and research worthy of a useful book. Through his writing, I could read the experienced views of shelter workers he'd interviewed prior to writing this book.This book is written fairly simply. The author wrote very much as if he were standing next to you talking with you. His verbiage is simple and easy to understand. He uses case-in-point examples that are helpful in clarifying his point and method.Occasionally, the author would title a paragraph where I expected to get much more out of the following text than what was present. On these instances, I felt like I was left hanging and looking for more.On the whole, I was delighted to find the author's approach to be factual, experienced, compassionate, common sense and fairly comprehensive.I really enjoyed reading the author's common sense views when he addressed some of the dog world's trendy idealisms. I'm certain that many idealists will disagree with his views because he is common sense yet not abusive. His 'middle-of-the-road views' don't pander to either of the extremes in dog training (harsh discipline versus no discipline). I felt the author's views to be well balanced and obviously experienced.Overall, this book is a good type of manual for foundational dog training with an emphasis on how that relates to an adopted rescue dog.I give this book 4 out of 5 stars. And I hope people who either have adopted or plan to adopt a dog will read this book and keep it on hand for reference. I plan to keep my copy, too.To someone preparing to adopt, two other books you may enjoy are:-The Other End Of The Leash-The Adoption Option: choosing &amp; raising the shelter dog for you",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "As a 4 year volunteer dog walker/trainer at my local humane society and also the owner of two adopted dogs, I found this book useful and straightforward. At the shelter we see many people with unrealistic ideas of what to expect from our shelter dogs (this applies to any dog whether it's a shelter dog or from a responsible breeder or from any of the myriad of other sources.) This book explains some of the issues that can come up and gives practical advice on addressing the issues. I also like the fact that the owners give information on training a pet dog, rather than \"obedience\" training. This book gives solid advice to people who just want to have a good relationship with their new dog. The writers stress the importance of structure and clarity when communicating with your new dog.As the owner of two adopted dogs, I will tell you that it takes effort and I will also tell you that I wouldn't have it any other way. What you get back from these dogs far outweighs the effort that goes in. If you are thinking of getting a dog, whether it be \"adopted\" or purchased, please do some homework first and understand the type of dog you are getting and examine your expectations and then decide if you want to go through with the decision which is a long commitment.All that being said, if you decide you want to share your life with a dog, please VISIT YOUR LOCAL ANIMAL SHELTER and check out what they have. You'll be surprised. You will find purebred dogs, adult dogs who have good manners, young adult dogs \"who need a little training\", puppies and some marvelous mixes of all shapes and sizes. Some of these dogs have \"baggage\" and \"issues\" which will need some work, but many of them just got dealt a bad hand and it just didn't work out at their first home.All of these dogs just need a second chance! If you have your heart set on a particular breed which isn't at your shelter, look into breed rescues (cruise the web--you'll find a rescue for just about any breed)who work on re-homeing specific breeds which didn't work out at their first home.Do some studying and if you decide to get a dog or add an additional dog to your pack, enjoy the journey--it's a very special adventure!! Not always easy, but always worth it!!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I found this book to be exptremely informative, easy to understand, and fun to read. There are a lot of unknowns when it comes to adopting a dog -- especially for us first-time dog owners. This book really tackled the big questions I had as well as had easy-to-follow step-by-step training exercises.The author is obviously very much in favor of his own training methods, but he at least explains why he thinks they are the best in order for the reader to research and make up their own mind.I would recommend reading this book to anyone thinking about adopting a dog!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "labrador retrievers for dummies for dummies computertech",
        "description": "You have a picture in your head. A picture of yourself with your practically perfect dog. You've always preferred big dogs, and your ideal dog is sturdy, strong, and energetic. At the same time, you envision a dog who is gentle and completely in tune to your needs, your whims, and your every move. That perfect dog is likely a Labrador Retriever. After all, the Labrador Retriever is the most popular dog in the United States, according to American Kennel Club registrations. Labs are beautiful, friendly, adaptable, easygoing, brave, loyal, dependable, and intelligent. What could be better? Labrador Retrievers For Dummies is a useful guide to have if you're thinking of getting a Lab or even if you already own one. Perhaps you're just curious about this popular breed. This handy reference is for you if you want to Find out if a Lab suits your lifestyle Know what to look for in Lab pups Determine if a breeder meets high standards Understand health and nutrition needs Handle emergencies with a cool head Train your dog with the lure-and-reward technique Show off your Lab in competitions You can live a fulfilling life with your Lab by making sure she is socialized, healthy, and well trained. What better task for humans and dogs than to be great companions for each other? However, you may need some help in knowing how to get the most out of your relationship with your Lab. This friendly guide offers that help with the following topics and more: Exercising your pup and older Lab Choosing the right veterinarian Exploring spaying/neutering Keeping your Lab beautiful with good grooming Helping your dog deal with divorce, a new baby, moving Managing barking and whining Housetraining your new puppy Traveling to dog-friendly vacation destinations Choosing a pet sitter or boarding kennel Volunteering your lab as a therapy dog Labrador Retrievers are big, energetic, and sometimes boisterous (especially as puppies), and they don't take care of themselves. They need you. Don't let them need you unless you're ready to be needed.",
        "authors": "['Walton', 'Eve Adamson']",
        "infoLink": "http://books.google.com/books?id=ylvgMs4qct8C&dq=Labrador+Retrievers+For+Dummies+(For+Dummies+(Computer/Tech))&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My wife and I read this book before deciding we wanted a lab. It is well organized, follows a nice progression, and is very well written. Above all, Joel and Eve's love of labs shine through. At first I wasn't sure if I could trust a &quot;Dummies&quot; book, but this one at least is excellent. Joel espouses lure and reward training and he sold me on it via this book. If you believe in punishment training you may not enjoy the book quite as much. If you are considering getting a lab or have a puppy we found this book to be a great foundation. After reading this book, we wanted one of Joel's labs.",
                "review/helpfulness": "63/69",
                "num_reviews": 69
            },
            {
                "review/text": "As a Certified Dog trainer, I have read and own many training manuals and reference books. Joel Walton's and Eve Adamson's book is one of my favorites. Labrador Retrievers for Dummies is not just for Lab owners. It is a most wonderfully written *soup to nuts* owning, training and management &quot;bible&quot; for any dog breed owner. I suggest many books to my cients, this being one of the top three.Written so the average dog owner can clearly understand what owning/caring for and training a dog is all about,not only makes Labrador Retrievers for Dummies an enjoyable read, but makes training your dog EASY, POSITIVE AND SO REWARDING. There is no &quot;behaviorese&quot; to decipher and this book thoroughly enables you to understand how to turn you relationship with your pet into &quot;only a good thing!&quot;",
                "review/helpfulness": "50/52",
                "num_reviews": 52
            },
            {
                "review/text": "This is a good book that discusses the breed, dog owning in general, first aid, training, etc. however, I kept feeling like most of the information was already in the general &quot;Dogs for Dummies&quot; books. Don't get me wrong, this is a good book, but I think if you need a primer on dogs, get the general one first and invest your &quot;Lab only book&quot; money on some of the more lush, colorful books on the breed.",
                "review/helpfulness": "26/32",
                "num_reviews": 32
            },
            {
                "review/text": "This is a well-written book that would be a good starting point for new labrador retriever owners who are getting their dogs as family pets and are not familiar with basic training techniques. I'd recommend it for anyone who has never trained a dog before, or for one who is not familiar with the more gentle training methods that have become popular over the last several years (because they work!). It serves that purpose very well, even though some readers might find that their &quot;warm and fuzzy&quot; approach goes a bit far. Suggesting that you give your dog a body massage, for example, may seem a bit much for some ... or a great idea for others.In fact, probably the biggest strength of this book is that it is a solid pet training resource for all breeds. It could easily remove any mention of labrador retrievers and still hold up well.Perhaps because one (both?) of the authors is a professional dog trainer, the authors are quick to advocate hiring a professional trainer for your dog. They also suggest that busy working people obtain the services of &quot;dog sitters&quot; to take care of the pup during the day. While this may end up being very good advice in some cases, perhaps a better approach is to not buy a labrador retriever in the first place--unless you have the time and open space to train and maintain that sort of dog. Unless you are in the financial position of being able to employ a nanny for your puppy, having to hire an obedience trainer and/or daytime dog sitter is usually the desperate outcome of making a bad decision in selecting your pet. These dogs need to spend time outdoors and time with people.This is not the best book to buy if you have any intention of hunting with your dog or training it for field trials. There are a couple of very good books on the market that focus particularly on that sort of training. Check around for those.Although it is a relatively small gripe, the biggest fault that I found with this book is that the resource lists are not very robust. They seem to have been tossed in by the authors (perhaps to fulfill the &quot;formula&quot; of the publisher) as an afterthought. It gives the impression that the authors imparted their own expertise freely, but only grudgingly tossed in a few scraps of information from other sources.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "As a person who has had the distinct pleasure of sharing my house and my life with as many as six Labrador retrievers at a time over the last 20 years (I now have four), I am acutely aware of the wonder and awe associated with getting such a wonderful companion can be. yet, sadly, I am also aware of the profound ignorance many would-be labrador-people are regarding how to select, introduce, and socialize this new member of the family. In that sense, this book , along with a number of others such as Richard Wolper's &quot;Family Dog&quot;, can provide the wary would-be initate with all of the essentails on how to successfully transform that cute little puppy into a happy, obdeient, and well-integrated member of the household.This book does offer one the expert advice one needs regarding the care and nurture of what has now become the single most popular breed in the United States, with information ranging from an impromptu history of Labrador Retrievers to such topics such as adoption options. The book also features a handsome 8-page color insert, and delivers to the prospective owner a wealth of facts and details regarding Labrador Retrievers. It provides essential and vital information regarding nutrition, socialization, and exercise, and offers some sage advice about how to find and select a reputable breeder. In addition, it also touches on aspects of ownerships such as common illnesses and chronic problems associated with the breed. This is a book I can heartily recommend!",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is a wonderful book, and my *only* criticism is that every time I recommend it to a non-labrador-owning, non-dummy it takes a little explaining! This book is a great primer for all puppy owners of all breeds. I also love Joel's book, &quot;Positive Puppy Training Works&quot;. As the director of a large dog training program, these are two of my favorite books to recommend to new owners. The management suggestions keep the dog out of trouble while you're busy installing the training. And the training instructions are very down-to-earth and easy-to-follow.Becky Schultz, Certified Pet Dog TrainerMinneapolis, MN",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "We bought this book just before we got our first lab and it has proved very useful, and is a good reference to go back to now we have our second lab. It gives you good information (that works!) on training labs, caring for labs, and making your lab part of the family.I wouldn't necessarily recommend it to owners of other breeds, but it's definitely worthwhile if you are getting your first lab, or want to learn about labs.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "My current Sam is the fifth family Labrador Retriever and I want him to be the best.This book has all the basic dog stuff in an easy to read and use format and enough about just Labs to be very helpful to me. I don't need a pretty color picture book, I take daily pictures of Sam, but the public library also has a wonderful book about Jake a Labrador puppy if someone needs color pictures to be happy. The unique and beautiful temperament of these dogs is a treasure when they are taught to be a companion. Don't just have a dog, train him to be one of the family.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "On December 11, 2006 I adopted a 7 week old lab puppy who needed a home. So, as a retired teacher, I needed a guide! Walton's book is practical and well written to help new, or experienced,pet owners. It has practical tips and humorous insights that make it easy to read and full of useful information. Lucky, my lab, is growing happy and healthy and I am not tearing my hair out trying to figure things out on my own.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "When I bought my little yellow lab puppy, I searched the internet and scoured reviews to buy the best book to prepare me for my new endeavor. I purchased this book, and I am sad to say, I was a little disappointed. It barely skims the surface of each topic, and did not prepare me to be a first-time puppy owner, or a first-time lab owner. I highly recommend Barron's \"Training Your Labrador Retriever\". I just bought it (my puppy is three months old) and I wish I had bought it first - it has much more information on how to handle your new puppy!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "surviving your dogs adolescence a positive training program howell reference books",
        "description": "In Praise of Surviving Your Dog's Adolescence \"Carol Benjamin has brought her usual wit and insight to bear on what is one of the most troubling phases for dog owners.... Whether you're having difficulties with a youngster or have a puppy who will soon be an adolescent, you can't help but benefit from reading this book.\" Robert G. Maxwell President, The American Kennel Club \"A concise and practical guide Zthat] confronts almost every potential problem...with solid advice and good humor. It is destined to become a dog owner's next best friend.\" Roger A. Caras President, ASPCA A Howell Dog Book of Distinction",
        "authors": "['Carol Lea Benjamin']",
        "infoLink": "http://books.google.com/books?id=dIUTPQAACAAJ&dq=Surviving+Your+Dog%27s+Adolescence:+A+Positive+Training+Program+(Howell+Reference+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I'm not sure why one reviewer said this book used negative methods for dog training such as alpha rolls and scruff shaking, because I saw neither mentioned in the book. The author does recommend &quot;a quick pop followed by an immediate release&quot; when using a leash to train, but this is a perfectly sensible and harmless way of getting the dog's attention.The author continually emphasizes the importance of praise, praise, and more praise in teaching your dog the proper way to behave, and her methods really live up to the &quot;positive&quot; claim in the title. This is a very reader-friendly book as well. The writer presents her information in an easy-to-read and often humorous format, all the while providing sound advice. I highly recommend this book as both human and dog friendly!",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "Ms. Benjamin leaves an indelible mark on the understanding of dogs with this work that recognizes that the time between puppyhood and adulthood is not limited to us humans. The excellent methodology outlined in this text denotes a person with an uncommon insight into the minds and behavior of dogs. The techniques described in the book are both helpful and thorough - follow them and you will get the job done. This is not a book for those who would build a relationship between a dog and the liver snaps in their pocket. It is a book for those who want to enjoy a warm relationship between themselves and their dogs. It DOES NOT recommend alpha rolls in shape or form.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "I picked up this book looking to learn more about the adolescent stage of dogs. What I found instead was bad information, some of it downright dangerous.The first chapter I turned to was on behavior problems, and here I read something that horrified me. Ms. Benjamin says that you should punish a dog if it growls at you to defend its food. This is, unfortunately, the perfect recipe to create a dog that bites without warning. If you do this, you don't punish the dog for being aggressive around its food -- you punish the dog for warning you that it is uncomfortable and will bite if pushed further. You stop the growling, but not the \"feeling of threat\" that the dog has. If you punish other warning signs, such as snapping, you will also cause those signs to disappear. Without the warnings, you will not know that your dog is not comfortable with what you are doing until it feels threatened enough that it has to bite -- and it will bite without warning.Ms. Benjamin also perpetuates the terribly outdated notion that you can end a bad behavior by punishing the dog after the behavior has happened as long as there is a \"reminder\" you can show the dog. Reminder or not, punishment never works unless it is timed correctly -- that means that you have to punish during the behavior itself. If the dog has already stopped, it's too late, and you're punishing something else entirely.Finally, Ms. Benjamin says that \"positive training,\" that is, training without physical punishment, does not work. That is absolutely false. Considering that this book was written over a decade ago, I don't find this attitude surprising at all, but it is wrong. \"Positive\" traditional training works when used properly. Modern \"positive\" training works when used properly. Both sides can point to examples of failures from the other group, but that doesn't mean the methods don't work.There is a little bit of good information, such as \"anger has no place in dog training\" and \"dogs don't act out of spite.\" But the average dog owner cannot distinguish between the good information and the bad, and the bad is bad enough that I have to strongly recommend than an owner or novice dog trainer avoid this book altogether.If you are looking for positive traditional training, find another author, one who understands the proper way to use punishment and understands how dogs learn. If you are looking for modern positive training, I recommend Dr. Ian Dunbar's books. He uses only non-physical punishment, and clearly explains how to be a benevolent leader for your dog. His methods debunk the false-but-popular myth that positive = permissive (as another reviewer mistakenly believes). His methods are strict but fair and without physical punishment. The results are amazing to watch and can be seen in his off-leash work with his malamute in one of his videos -- he has great control of his dog. (As an aside, his book \"Before and After Getting Your Puppy\" will prevent a lot of the problems dealt with in this book.)",
                "review/helpfulness": "14/21",
                "num_reviews": 21
            },
            {
                "review/text": "I found this book highly interesting and helpful. It gives practical training tips in ways the new dog owner can understand and easily put into practice... There is absolutely no negative training in this book. It all focuses on the positives of relationship, describing and teaching language a dog can understand. I found it extremely helpful. I would highly recommend it to any current or prospective dog owner.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book is important for two very strong reasons: 1) it alerts dog owners everywhere that their dogs have a teenage stage; and 2) it counters the newly-prevelant ideas that training is 100% positive and you can avoid corrections completely.I am an advocate of using the friendliest and most positive methods available. BUT, a whole generation of children was raised by parents who were permissive, and look how that turned out. Yes, you sometimes have to tell your dog (especially when they hit adolescence) no!That said, I can't give it an all-out endorsement because I don't totally agree with it. I don't think you should rely on collar corrections for non-leash work. &quot;Put on the collar and correct the dog for this, that, and the other.&quot; If the naughty behavior is occuring off-lead, you need to find an off-lead deterrent. Also, she is a bit limited in her options. By discarding everything reward trainers do, she overlooks some good advice. So, this book isn't the end-all be-all. BUT, the message that your bratty teen needs some structure and leadership is so important, and so lacking in most modern materials, that it's worth the read.P.S. Absolutely nowhere in this book does the author advocate alpha rolls or scruff shakes or any other physical reprimand. Don't know where that reviewer was coming from.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "An excellent analysis of problem dog behaviors and training methods for overcoming them, aimed toward younger dogs but appropriate for all ages. The author correlates breed type and original function with the particular sorts of mischief the dog may get into, and explains what to do to redirect the dog's energy and attention into positive activities. Especially helpful for first-time dog owners.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "12 years ago, I remember sitting on my bed in tears. My adorable Golden Retriever puppy had hit a point where she was really hard to handle, and I felt overwhelmed-- like a failure as a dog owner! I knew I needed some good advice, and I ended up finding this book at the library.It was incredibly helpful, reassuring, and positive. Needless to say, my Golden eventually grew into a lovely, kind, and affectionate dog. This book helped us get through a rocky point in our relationship, and I am really greatful to Carol Lea Benjamin for helping me to handle this stage of my best friend's development effectively/helping me to understand my dog better.A year after reading this book, I adopted an elderly Irish Setter. Benajamin's book \"Secondhand Dog\" was helpful to us.If you like the Monks of New Skete and Brian Kilcommons you will find Carol Lea Banjamin's approach to be slightly different (but similar) and very helpful. You may also want to check out Patricia McConnell's humane, wise dog books (The Other End of the Leash, Beginning Family Dog Training, etc.).",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I purchased this book when my first Golden Retriever, Bailey, reached adolescent in 1994 and found it invaluable. She went on to get her CD in obedience and NA in agility, became a therapy dog and lived a wonderful 15-1/2 years. Now my new Golden, Riley, just turned 7 months so I got the book down to re-read it. It's just as helpful now as it was then. I'd forgotten all the \"fun\" of adolescence, but now I'm prepared and can catch some of these before they become real problems. If there were more stars to give this book, I would easily give it 10.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is an excellent book that discourages treat training and encourages understanding and praise. It covers the differences between puppies and adolescents, winning your dog's respect, having an appropriate relationship with your dog, tools you do and don't need, understanding how breed and character affects behavior, trade secrets, how to train basic commands, rules for rehabbing a problem dog, dealing with problems, and how to 'build' the dog of your dreams. Behaviors covered range from aggression to grooming problems to wildness. Although it is geared for the adolescent dog, this book would also be suitable for someone adopting a dog or just needing to retrain his or her own difficult pet.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have read about a dozen books on training and caring for dogs, and while some were pretty good none of them alerted me to the fact that dogs go through an adolescence phase just like human teenagers. I read this book when my puppy was 7 months old and not displaying any \"bratty\" behaviour, but I implemented many of the author's suggestions anyway as a precautionary measure. A couple of months later he was showing just slight signs of adolescence (thinking things over for a couple of seconds before obeying commands) but none of the extreme stubbornness that miniature schnauzers are known for, and I'm sure it is thanks at least in part to the precautionary measures I took after reading this book. I re-read this book and applied the advice, and my puppy is back to making immediate responses to my commands.I highly recommend this book to any dog owner, preferably before your dog enters adolescence, but definitely as soon as he or she starts displaying problem behaviours.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "gun dog training",
        "description": "This time-proven guide by legendary trainer Richard A. Wolters offers a step-by-step method for completely training your dog. It is the first book for the upland bird hunter that teaches the hunting commands with the use of training tools, making training easier for you and your dog. Written with scientific information on the mental development of a dog, Gun Dog shows the complete training procedures step by step in picture sequences. It will show you how to achieve every hunter's ideal: an animal that will double as a disciplined hunting dog and beloved family pet.",
        "authors": "['Richard A. Wolters']",
        "infoLink": "http://books.google.com/books?id=EKxaxQEACAAJ&dq=Gun+Dog+Training&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is fine if you want to learn about today's top breeders (albeit a little un-interesting). However, if you are interested in actually training your gun-dog, go with something like &quot;The Delmar-Smith method&quot;",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book lacks editing and the title is a bit misleading. This is a series of philosophical critiques concerning a number of contemporary dog trainers. The book does not deal in depth with these trainers methods. Rooting out advice for your dog is rather difficult.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book lacks editing and the title is a bit misleading. This is a series of critiques concerning a number of contemporary dog trainers. The book does not deal in depth with these trainers methods. Rooting out advice for your dog is rather difficult.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "gun dog revolutionary rapid training method",
        "description": "GUN DOG is The first book written for the man with limited time and facilities who wants a gun dog fast and who wants to train it himself. The first book written in this field with scientific information on the mental development of a dog. From this study by one of the nation's outstanding animal behavior laboratories, Wolters has changed the procedures in training a gun dog. The first book for the upland bird hunter that teaches the hunting commands with the use of training tools, making training easier for you and your dog. The first book to show the complete training procedures step by step in picture sequences. It will show you not only what to expect of your dog, but what your dog expects of you. You will be able to see how to do it. GUN DOG is A REVOLUTIONARY RAPID TRAINING METHOD.",
        "authors": "['Richard A. Wolters']",
        "infoLink": "http://books.google.com/books?id=33JYAAAAYAAJ&dq=Gun+Dog:+Revolutionary+Rapid+Training+Method&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Richard Wolters work was recommended to me by a fellow bird hunter. I found the book to be well written and to the point, pardon my pun. I purchased this book in preperation for my first Bird Dog. I tested Mr. Wolters technique on our family dog, a Beagle, and I was able to have her stopping on a dime to &quot;WHOA&quot;. And after just ten minutes I was able to get her to Quarter back and forth across a baseball field. I can't wait for my hunting dog to arrive so that I can begin training him for the next hunting season. &quot;Gun Dog&quot; has definitley become my training bible.",
                "review/helpfulness": "50/53",
                "num_reviews": 53
            },
            {
                "review/text": "Richard Wolters is a lost man. If you want a dog that will do what you say because he is afraid or because he's associated you with pain... Get this book. If you want a dog that does things you say because he loves you and wants to please you... DON'T get this book. Richard Wolters can train dogs, and the dogs are attentive. THERE ARE MUCH BETTER WAYS. This book shows you how to train a dog from a narrow minded approach. It assumes a dog is stupid and can only learn through associating things with pain. Building a relationship with a dog and teaching him to hunt with a man can be one of the most satisfying things someone can do. I have seen dogs that are much smarter than I am. Hunting dogs are just waiting for you to give them the chance to please you. As Bill Tarrant said... They have all the qualities that God wants man to have. I bought two books... This one and Mike Goulds &quot;The Labrador Shooting Dog&quot;. In my humble opinion... Mike has figured it all out. He loves dogs more than I do... and from what I hear, they love him just as much. But this is all just coming from a guy who loves to train dogs and wants them to be the best and happiest they can be.",
                "review/helpfulness": "32/50",
                "num_reviews": 50
            },
            {
                "review/text": "I raise and train German Shorthaired Pointers. This book has been my &quot;bible&quot; in getting our puppies well-started. Very practical and easy-to-use advice. The wonderful photos with which this book is filled, make Wolters' book even more interesting and his lessons easier to follow. The first book a beginner looking to train a &quot;pointing gun dog&quot; should buy.",
                "review/helpfulness": "32/33",
                "num_reviews": 33
            },
            {
                "review/text": "Wolter's books always have, and most likely will always be, THE authority on hunting dog training. The book is easy to read and is no nonsense. It will help you to better understand your pup and bring more satisfaction with the training process.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "I highly recomend this book to anyone who wants to train their dog to hunt and retrieve. I took my dog (at 17 weeks and no training) and within the week, I had it sitting, staying, coming to me. Quickly thereafter my dog was fetching and pointing pheasant wings. I took my dog out and hunted at 9 months and she took to the field readily and pointed up a couple of birds for us. I also took these principles up to NY to visit a friend and had his new 3 month old pup from the pound sitting, staying and coming within the weekend. Enjoy this book and your dog. It may seem silly to actually do some of his techniques, but they really do work.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "Wolters offers the weekend hunter an easy and fun(for both you and your pup) way to bring out what naturally lurks inside every dog. The upfront, no nonsense style is fantastic and I have used this book for years with great results. From beginner to old pro, this book has it all.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book may appeal to the novice hunter/dog trainer lacking both experience and the facilities necessary to properly train a gun dog. Unfortunately, the prescribed training methods (like the old bird wing on the fishing pole trick) provide fun games to play with a puppy, but do NOT help to develop a working field dog. Buy a more modern book by Tarrant and/or others instead of this one.",
                "review/helpfulness": "11/17",
                "num_reviews": 17
            },
            {
                "review/text": "Wolters' tremendous guide has really been an inspiration to my spaniel Barry and me. The tips and recommendations are set out in an easy-to-digest manner and thanks to the book Barry handles his Ruger 44 Mag semi-automatic carbine rifle like a pro.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "Perfect book for 1 or 2 dog person who has a pet and hunter. Trained several dogs by this method and have had excellent results.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I have used this book to train several dogs with great success. In fact, my book is so old and passed around so much, it is falling apart. I love it. I do not hunt, but the puppy/dog training method section is so logical! It works everytime! I highly recommend this book.Thanks",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    }
]