[
    {
        "Title": "what a sista should do",
        "description": "A powerful and spiritually satisfying novel from a compelling new voice about three courageous women who must confront the harsh realities of their lives through faith and prayer. Pam Lyons has a husband who places more trust in money and marijuana than in God. Yvonne Hastings is a minister's wife whose husband's infidelity and physical abuse brings their marriage to a crossroads. Taylor Johnson is a single mother who is looking for a good Christian man to help raise her son, but is unable to rid herself of the guilt left over from her promiscuous past. The secret of Taylor's child's paternity is the catalyst for the tumultuous relationship between the three women. Together, they will learn unforgettable lessons about love, forgiveness, prayer, and sisterhood.",
        "authors": "['Tiffany L. Warren']",
        "infoLink": "http://books.google.nl/books?id=iUE1AQAAQBAJ&dq=What+a+Sista+Should+Do&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "What should a sista do when her husband's job is making music with local teens in a haze or weed smoke...or when her baby's father is a minister in the church and swears her to secrecy...or when she thinks she has the perfect marriage (and can share her wisdom with others) only to discover that her husband has a baby from one of the women you're trying to mentor?Well, a sista could do a lot of things, but in Tiffany Warren's engaging debut debut, what Pam, Yvonne and Taylor should do is pray. Though the three main characters that the story shifts between live very different lives, all of them are coming to learn something new about God and about themselves.Pam, a mother and employee in corporate America, starts the novel sitting in her car because she doesn't want to lose her peace amid the chaos behind her front door. Having long since laid down her own dreams to let her husband Troy explore his dream of becoming a record producer, Pam is too stressed to blessed more often than not. On top of everything, Troy accuses her of putting church before him. Will her husband ever understand what it means to turn his life over to Christ or will they always be at odds?Taylor is holding things together the best she can. Between the scornful looks of people at church and the probing questions of her two-year-old son about the father he's never met, she's having a hard time making it through. God has forgiven her for having an affair, but the pressure of raising a child alone and keeping silent about the father's identity are proving too much, especially with all the gossipy church women who seem to want to tell her what to do. What would they do if they really knew the truth?Yvonne knows how to get a man...and how to keep him. If more women in the church would be like her--stay home, cook, clean, not let themselves go--there would be less divorce and mayhem in God's house. Though her husband needs some time away here and there, it doesn't mean a thing. She knows her man and her God. Now if only she could teach some of these young hotties in the congregation how to get a man and settle down, things would be a lot better. For some of them though, it's already too late. They've snuck around and got a baby from some man in the church. What a shame. What kind of man would sit in church every Sunday with his own child without standing up to his responsibilities? Too bad that everyone can't have a man of God.When these three women come together and share their hearts and hurts, lives change and laughter flows. If you're looking for a story that gets real about some of the struggles of women in the church without leaving Christ out of the equation, this one is for you. Be careful though, don't start this one too late at night. You won't be able to put it down.Four and a half stars.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I have been very impressed with the books I have read from Walk Worthy Press this year! Many of the authors are first-timers. Meet three awesome sistas in What A Sista Should Do.Pam is a successful career woman, mother of two and often a reluctant wife. She married a musician whose big dreams have now become a big pain. Being the sole provider of her home, Pam no longer puts much trust in her unemployed husband desires to make it big in the music industry. Her disdain is evident every time she meets one of her husband latest hip-hop wannabees.Taylor is a single mom struggling to make ends meet for her and her young son. Regretful about her involvement with a married minister, she continues to hold her head up and refuses to leave her church home despite the stares and talk. Unfortunately, as her struggles increase, Taylor must break her safely kept secret, her son's father.Yvonne is a minister's wife and God-fearing woman. Her marriage seems perfect on the outside and even in some ways Yvonne herself is oblivious to the true state of her marriage. In a jolting matter, she will find out her husband is not the godly man he may seem.How do these three women from the same church connect? Unknowingly in her pursuit to reach out to Taylor, Pam gets stuck in the middle as Yvonne discovers her husband fathered Taylor's son. It seems unlikely that Taylor and Yvonne would want to even be in each other's space which at first they do not. Forgiveness and the overwhelmingly sense to pray for each other through some difficult events create an unusual bond.There are quite a few novels written about the bond between female friends, but I believe this is the most unusual set of friends I have read about. It's unusual because the friendship among these women is a true testament to the principles of Christianity. Each woman has her own problems and unique personality. In the beginning the common denominator between the three women was the church home they share. By the end of the novel, readers get a strong sense of the power of prayer and its effects over the most difficult circumstances.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "With only their faith in God as a common thread, three women become friends as they seek elusive answers to the unique struggles each one faces.Pam is a career woman whose star is rising in the business world. However, what she really wants to do is stay home and raise her children. But husband Tony puts his desire to be a music producer and make money ahead of his family's needs.Taylor is a young, never-married mother of a beautiful little boy named Joshua. Joshua's father is a minister in her church. And he just happens to be married. Taylor has never told anyone whom Joshua's father is, but when an unexpected job loss occurs, she may be forced to speak his name - if she wants to feed her son.Yvonne is a woman who seems to have everything: money, looks, and a long-term marriage that gives the appearance that it is secure. But the problem is that it's all show when Yvonne admits she's married to a man who is abusive, lies and is unfaithful. And she knows the woman with whom he's been unfaithful.What a Sista Should Dois Tiffany L. Warren's debut novel. It's a bold and honest look at the frailty of people struggling to do what's right and not always succeeding. It's also about God's grace and forgiveness. It will make you angry, you'll feel sadness and you will be uplifted and filled with hope. It's an intimate look into the lives of three African-American women whose primary strength comes from their faith in God.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Pam, Taylor, Yvonne, women of New Faith House of Worship. These 3 women have more in common than they think and belonging to the same church is just one of them. Pam is married with a family, and is a career woman, believes in GOD and has what most women want to acquire, but then again you don't know her story. Yvonne is a faithful, saved, model woman who is married to Luke a minister at New Faith House of Worship, she has been a diligent wife and is commendable in her service to the Lord. Most women dream of having what Yvonne has a beautiful home, a lifestyle that permits her not to have to work outside the home and a man of God for a husband, but then again you don't know her story, well honestly Yvonne doesn't know her own story. Taylor, uh oh now Taylor is the scorned jezebel, let the women in church tell you, she is single and a mother, who will not reveal who her baby's daddy is & does not get any support from him, hmmmmmm you may even hear that she doesn't even know who the daddy is, if you listen to some of the church gossippers, but then again you don't know her story. Luke, a man of GOD, who is also a successful CPA, and has a submissive wife, O my now what more could this man want? Yeah well, he is a man, so what is his story? Spencer, the fine, educated, GOD Fearing, women falling all over him brother... mmmmmmmmm single, saved, and successful, oh yeah single ladies are you ready for him? Well, lets read and see. Tiffany L. Warren has written a true to form story that features characters that real and there is someone in probably your congregation that fits one of these if not all the descriptions, but she has shown that being saved doesn't mean that you have all the answers, that you don't have any of the same problems that others have, what she shows is that life is real and so is GOD, and if you follow GODS way, you can handle all things through Christ Jesus who strengthens. Vengence is not yours!!! Forgiveness, understanding, and Salvation, you need. Very well written and the characters were real. I forgot to mention Troy, but through it all, Pam Troy heard you and God answered your prayers. READ THIS BOOK!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Men, drama, life. Life, men, drama, kids. Whatever the scenerio is, doesn't always seem to be one thing or another? From the first page TIFFANY WARREN captured my attention and I couldn't put it down. Lord, did she go through some things and make it to the other side with the Lord on her side. In WHAT A SISTA SHOULD DO, Yvonne Hastings is a minister's wife whose husband's unfaithfulness/extramarital relationship and physical abuse brings their marriage to a crossroads (how she managed to stay with her husband after the very first sign \"he was no good\" in the earlier part of their relationship/marriage is beyond me). Pam Lyons has a husband (a wanna be record producer basiclly taking up space in the house she is working to pay for) who places more trust in money, fame and marijuana than in God. Taylor Johnson is a single mother who is looking for a good Christian man to help raise her son, but is unable to rid herself of the guilt left over from her promiscuous past. The secret of Taylor's child's paternity is the catalyst for the tumultuous relationship between the three women (You have got to read the novel to discover who the father really is and why oh why she kept it a secret so long trying to protect a man so unworthy). IN WHAT A SISTA SHOULD DO, Taylor, Pat and Yvonne learn unforgettable lessons about life, love, forgiveness, unconditional love, prayer, sisterhood and most important of all-loving yourself, letting GOD fight your battles and free you from the chains of your past to prepare you for a glorious future. WHAT A SISTA SHOULD DO does not disappoint and Warren out did herself as a debut author. Check it out and tell a friend!!Marina Woods The GOOD GIRL Book Club www.goodgirlbookclubonline.com",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Prayer changes everything and that is exactly what Pam, Yvonne, and Taylor find out. Pam is a devoted wife and mother who loves the Lord. Yvonne is a preacher's wife who is on fire for the Lord and wants to be an example for the young ladies in the church. Taylor is a single mother struggling to make ends meet and who won't reveal the father of her child. Their lives have nothing in common except that they worship at the same church and attend the same sista prayer circle.Pam is the catalyst that brings them together. She dreads going home because her husband is living a dream that is going nowhere, until he gets a multimillion dollar contract. The fortune solves part of Pam's problem; she quits her job, spends quality time with the twins, tithes at church, and prays with her new girlfriends on an extended vacation. Taylor loses her job and is forced by the Welfare Office to reveal the father of her child. Yvonne is dethroned when the truth comes out about her husband and she believes Taylor is the enemy. Pam pays Yvonne and Taylor to join her for a getaway on the beach. The trip, prayer and Godly intervention help these ladies turn their lives around.Tiffany L. Warren makes her debut with this must-read girlfriend novel. She is a brilliant narrator, revealing wild things happen when you turn your life over to God. She researched topics such as domestic violence, drunk driving, single parenting, adultery and convalescing a long-term illness and developed characters in such a way that the story is believable. I've read several titles this year by Walk Worthy Press and the company certainly lives up to its name.Reviewed by M. Bruner for Loose Leaves Book Review",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "drama in the church but the ladies handled it respectfully and with class. i enjoyed it it was a nice read and something fresh and different from the gangsta scenes i had been reading",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "What A Sista Should DoBy Tiffany L. WarrenI have been very impressed with the books I have readfrom Walk Worthy Press this year! Many of the authorsare first-timers. Meet three awesome sistas in What ASista Should Do.Pam is a successful career woman, mother of two andoften a reluctant wife. She married a musician whosebig dreams have now become a big pain. Being the soleprovider of her home, Pam no longer puts much trust inher unemployed husband desires to make it big in themusic industry. Her disdain is evident every time shemeets one of her husband latest hip-hop wannabees.Taylor is a single mom struggling to make ends meetfor her and her young son. Regretful about herinvolvement with a married minister, she continues tohold her head up and refuses to leave her church homedespite the stares and talk. Unfortunately, as herstruggles increase, Taylor must break her safely keptsecret, her son's father.Yvonne is a minister's wife and God-fearing woman. Hermarriage seems perfect on the outside and even in someways Yvonne herself is oblivious to the true state ofher marriage. In a jolting matter, she will find outher husband is not the godly man he may seem.How do these three women from the same church connect?Unknowingly in her pursuit to reach out to Taylor, Pamgets stuck in the middle as Yvonne discovers herhusband fathered Taylor's son. It seems unlikely thatTaylor and Yvonne would want to even be in eachother's space which at first they do not. Forgivenessand the overwhelmingly sense to pray for each otherthrough some difficult events create an unusual bond.There are quite a few novels written about the bondbetween female friends, but I believe this is the mostunusual set of friends I have read about. It's unusualbecause the friendship among these women is a truetestament to the principles of Christianity. Eachwoman has her own problems and unique personality. Inthe beginning the common denominator between the threewomen was the church home they share. By the end ofthe novel, readers get a strong sense of the power ofprayer and its effects over the most difficultcircumstances.--Tyora Moody",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "WHAT A SISTA SHOULD DO by Tiffany L. Warren is the story of three very different women who have one thing in common; they all worship at the same church. They really don't know one another, however unforeseen circumstances bring them together. Each of them have their crosses to bear and realize the only thing that can get them through their tests, is the power of prayer, which will turn their tests into a testimony.Pam, a professional, is married to Troy and has two beautiful daughters. She works hard to provide for her family and to ensure her children are raised in a loving Christian home. God and family are the farthest things from Troy's mind. His main concern is making it big in the music industry as a producer. Spending most of his time with his artists and partying, Troy feels his breakthrough is so close he can taste it. Pam is finding it hard to remain in a marriage where they are unequally yoked. God is the only one who can get this marriage back on track, but is it too late?Taylor, a struggling single mother does the best she can to provide for her son. She is finding it difficult to be both mother and father to her child, but vowed never to reveal the identity of her son's father. When times get hard and push comes to shove, Taylor can no longer support her son so she seeks child support to assist with her financial obligations. Unfortunately, the only way she can get child support is to reveal who her son's father is. Torn between keeping her word or doing what's best for her son, Taylor has a major decision to make.Yvonne, a dutiful wife to Luke, a minister, has been married for over twenty years. She has never had to work because Luke has always provided for her and is happy with her being a homemaker. Yvonne is queen of her castle and has always thought her marriage was a good one. Secrets are revealed and she finds out her entire relationship is based on lies. She knows the only way she can survive is through prayer. But, in the end, she wonders if her husband is even worth it.WHAT A SISTA SHOULD DO is a poignant story about faith, friendship and forgiveness. It's about overcoming trials and tribulations and coming out on top. Three women become friends in the midst of their problems and realize that, with prayer and friendship, any negative situation can turn into a positive. The characters are very well developed, so much so that you can feel their pain and share in their sorrow. Warren's debut novel is an excellent read which will enlighten you and show you that in the midst of it all, with God all things are possible.Reviewed by Eraina B. Tinninof The RAWSISTAZ Reviewers",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I enjoyed this book very much, I was not able to put this book down, it was definitly a page turner. It was nice to see how the characters Pam, Yvonne and Taylor were all able to use their faith in God to get them through their indiviual situations and then being able to come together in the end through prayer and forgiveness. Hope to find more books by this author.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "family fortunes men and women of the english middle class 17801850 women in culture and society",
        "description": "Family Fortunes has become a seminal text in class and gender history. Published to wide critical acclaim in 1987, its influence in the field continues to be extensive. It has cast new light on the perception of middle-class society and gender relations between 1780 and 1850. This revised edition contains a substantial new introduction, placing the original survey in its historiographical context. Leonore Davidoff and Catherine Hall evaluate the readings their text has received and broaden their study by taking into account recent developments and shifts in the field. They apply current perceptions of history to their original project, and see new motives and meanings emerge that reinforce their argument.",
        "authors": "['Leonore Davidoff', 'Catherine Hall']",
        "infoLink": "http://books.google.com/books?id=n9czZs6PfLYC&dq=Family+Fortunes:+Men+and+Women+of+the+English+Middle+Class,+1780-1850+(Women+in+Culture+and+Society)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Family Fortunes focuses on the rise and influence of the middle class in late eighteenth and early ninteenth century England. The book is divided into three distinct parts. The first section centers on &quot;Religion and Ideology&quot;; here, authors look at fractions among Protestant sects during their time period, and the mututally reinforcing ideas of domesticity and religion. The second section is called &quot;Economic Structure and Opportunity.&quot; It begins with a discussion of middle class attitudes towards property, especially as it effects providing income for a family. The other discussion in this section looks at men and women's respective roles in the economy, focusing on men's action and women as the &quot;hidden investment.&quot; The final section, &quot;Everday Life: Gender in Action,&quot; looks at marriage, the respective roles of motherhood and fatherhood, defintion and importance of the home, how gender was registered and finally, middle class influcen in the reform-minded public sphere. Family Fortunes is a big, thick, informative book which is well worth reading for people interested in the rise of the middle class, and social or religious history. Though clearly scholarly in focus it is relatively accessible, and the use many different textual sources helps to illustrate some of the more dense parts of Davidoff and Hall's arguments.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "Family Fortunes is an account of the rise of the middle class, both as a class and as individuals, in England between 1780 and 1850. The book's focus is on \"the delineation of gender difference at a time of rapid economic, political and social change.\" It argues that class consciousness always takes a gendered form and that the sexual division of labor within families was central to the development of capitalist enterprise. This approach rehearses arguments that are commonplace in feminist historiography, but Davidoff and Hall add a significant dimension to the case and hold their reader's attention through a narrative built around religion and ideology, economic structure and opportunity, and an account of gender in action in everyday life. Their section on religion and ideology is particularly informative and the strengths and weaknesses of the book can be ascertained by examining this section's analysis and contentions. (p.13)Religion played an important role in shaping the culture of the emerging middle class. Even though attitudes towards masculinity, femininity, and the family varied among the different Christian denominations, all accepted that the home had to act as the basis of moral order in the immoral world of the market. The family therefore stood at the center of attempts to construct a moral order for capitalism. Indeed the concept of the Christian family was a metaphor for the organization of society. The Birmingham Independent minister, John Angell James, stated that the family: \"when directed as it should be, has a sacred character, inasmuch as the head of it acts the part of both the prophet and the priest of his household, by instructing them in the knowledge, and leading them in worship, of God; and, at the same time he discharges the duty of King by supporting a system of order, subordination and discipline.\" By extension, a congregation of believers gathered in a church was regarded as a family. The concept was also applied, through the language of paternalism, to social structures where the servants and laborers of the middle class man were seen \"as the dependants and children of their father, their master, their guardian.\" Similarly business partners \"were in some senses brothers who represented each other.\" (p.109, p.89, p.21, & W. Holdsworth, A History of English Law, cited ibid., p.200.)For middle class men the church also provided an opportunity to display their worthiness for public office by acting as church officials and engaging in public works. Davidoff and Hall note that by \"the early nineteenth century the traditional concept of stewardship associated with aristocratic patronage and the devolution of obligations from the lord to his agent was transposed into religious discourse.\" (pp.73-74)The position the church assigned to women was filled with tension. In an eulogy of a pious Christian woman, James wrote that \"the same blessed page which proclaims your dishonour in the sin of your first mother, displays the glorious part you are to bear in the instrumentality of saving a lost world.\" Because of Eve's transgression, women had to suffer. Through childbirth woman suffered and came to understand the nature of sin. At the same time, childbirth opened a road to personal salvation through the link between maternity and salvation established by Mary the mother of Jesus. The need for women to contain their sexuality, through service to the family, justified women's social subordination even if men and women were spiritually equal. Subordination did not imply inferiority but separate spheres of activity. The home and children were women's sphere. Because of the pressures of business men left the moral education of children to women. This situation led to a contradictory position for many women personified in the life and attitudes of Hannah More. In her writings, More confined women to the domestic sphere but argued for the central importance of woman's influence in nurturing morality in an immoral world. She played a leading part in public moral crusades arguing that the home was the only sure basis for a moral nation. More's terrain was the contested ground that Davidoff and Hall see \"between the recognition of influence [within the home and on children] and the marking out of the female sphere.\" Women often had to enter the male sphere to provide for themselves and/or their families. But this was an action open to condemnation unless presented in terms of maternal necessity or along religious lines as in the activities of More. (p.115, p.114, p.171, & p.117)Davidoff and Hall comment that religion was the key \"that could give meaning to women's experience and express some of their aspirations.\" While this was no doubt true, the authors here come up against the issue of oppressed/oppressor relations. Woman may well have used religion to give their life meaning, and to give voice to some of their aspirations, but the parameters of the discourse of religion ultimately were set by men for men. Women's experience within these parameters may have been rich and fruitful, but their experience was still within a male discourse. Hall and Davidoff are sensitive to this issue, but they offer nothing to move us beyond the impasse of a hegemonic oppressor discourse. For instance in discussing women's philanthropic work they argue: \"Women may not have been exerting real social power and engineering major social change through their associations, but nor were they simply taking as given the boundaries of female social action.\" (my emphasis.) What, we may ask, would it have taken for women to exercise real social power? Davidoff and Hall regard the period as one when there may well have been more cooperation between middle class men and women because they were involved in shaping the basis of their identity in middle class families. It was only when this identity was established that the isolated and trivialized nature of the domestic sphere became apparent. In other words women played a part in shaping a middle class identity that debased women's place in society. The authors show how the male discourse was able to override attempts by women to create a position for themselves that engendered respect but the reader is left to ponder whether the situation could have been, or ever could be, different. If the aim of Family Fortunes was only to recount the rise of the middle class this lack of analysis would not be such a serious shortcoming, but given that the authors specifically link themselves to \"the Women's Liberation Movement and the questions which feminist history has raised\" the reader is justified in expecting some discussion of the difficulties in moving beyond a hegemonic discourse. (p.148, p.430, p.454, & p.11.)In some ways this criticism is unfair because, in general, historians who deal with the social relations that stand behind an analytical term like hegemony have not confronted the issue of how to move beyond one set of relations to another. The greater the degree of dominance the more likely this statement is to be true. For instance E.P. Thompson's Making of the English Working Class displays some hope for alternative social relations in the nineteenth century whereas David Montgomery's The Fall of the House of Labor is ultimately a grim reminder of the ability of capitalism to gain compliance from American workers. Few historians are as successful as Davidoff and Hall in showing how a shared ideology, and its practice in everyday life, produces hegemonic relations. With the understanding they provide it is possible to ask how real power can be exercised by women and other groups whose interests are marginalized by hegemonic discourses.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the magdalen",
        "description": "Dublin, 1962. Within the gated grounds of the convent of The Sisters of the Holy Redemption lies one of the city's Magdalen Laundries. Once places of refuge, the laundries have evolved into grim workhouses. Some inmates are \"fallen\" women-unwed mothers, prostitutes, or petty criminals. Most are ordinary girls whose only sin lies in being too pretty, too independent, or tempting the wrong man. Among them is sixteen-year-old Teagan Tiernan, sent by her family when her beauty provokes a lustful revelation from a young priest. Teagan soon befriends Nora Craven, a new arrival who thought nothing could be worse than living in a squalid tenement flat. Stripped of their freedom and dignity, the girls are given new names and denied contact with the outside world. The Mother Superior, Sister Anne, who has secrets of her own, inflicts cruel, dehumanizing punishments-but always in the name of love. Finally, Nora and Teagan find an ally in the reclusive Lea, who helps them endure-and plot an escape. But as they will discover, the outside world has dangers too, especially for young women with soiled reputations. Told with candor, compassion, and vivid historical detail, The Magdalen Girls is a masterfully written novel of life within the era's notorious institutions-and an inspiring story of friendship, hope, and unyielding courage.",
        "authors": "['V.S. Alexander']",
        "infoLink": "https://play.google.com/store/books/details?id=MebwCwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "In 1952 Dublin in the birthing room of the Sisters of the Holy Saints Magdalen Home for Wayward Girls and Fallen Women, between contractions Esther Doyle thinks back on how she ended amongst the abandoned. Esther knows that in spite of her family rejection due to her unmarried pregnancy and her lover's betrayal she is a good person. From western Ireland, since arriving in the grim place, she wonders if she will ever see the ocean with her child.Esther has earned her room, board, and medical assistance doing laundry while waiting the birth. She knows her child will reside next door in the almost as grim orphanage, but at least the infant will have sustenance. However, she knows her unborn will receive little else as even the nuns reject the infant's innocence in spite their lofty calling. Still Esther has learned from her sister &quot;Maggies&quot; and dreams of a life for herself with her child outside this convent prison.With the acceptance of out of wedlock children in recent years, THE MAGDALEN may seem obsolete, but instead, the novel is a powerful historical tale that sheds a light on 1950s morality. The story line brilliantly written in a first person dialogue enables the audience to feel all that Esther feels as she garners empathy from modern day readers to the plights of her and her soon to be born child in a world that condemns even the blameless. Marita Conlon-Mckenna provides fans of mid twentieth century historical novels with a juggernaut of a morality tale that is one of the genre's best in recent years.Harriet Klausner",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "It is little wonder that this book was a number one bestseller in Ireland, as it deals with a shameful episode in its history, that of the Magdalen Laundries. Run by the Catholic Church, these were homes that were set up for \"fallen\" women. Originally set up for prostitutes, they devolved more into homes for unwed mothers. Young women, many of whom were teenagers, who found themselves unwed and pregnant, were often sent there by their families. They would then work in the adjacent laundry of the home until they gave birth, at which time the child would be removed to an orphanage and placed for adoption.Many of these young women, called penitents by the Catholic Church, were often deserted by their families. They would then find themselves living a lifetime of servitude in the Magdalen Laundries for their transgression. That these laundries existed until 1996 is, in and of itself, scandalous and almost incomprehensible. This book gives a fictional account of such a woman. It is through her eyes that the reader sees the travesty that was known as the Magdalen Laundries.Esther Doyle was one such woman. She lived an isolated life in rural Connemara, where she was forced by her father to leave school at an early age, in order to help her mother around the house, after her mother gave birth to mentally challenged child in 1944. An intelligent but naive young girl, Esther would spend her days helping her mother and taking care of her baby sister, Nora Pat. After her father disappeared one night, while fishing at sea, and was later washed ashore, having drowned, life became hard for the Doyle family. Yet, left penniless, they managed to survive.In 1951, Esther, now a pretty teenager, met a young, handsome ne'er-do-well named Conor O'Hagan at a dance. As he was not a local, having just moved to Connemara from West Cork, her family viewed him with some misgivings. Still, Esther found herself in the throes of first love with this young man, only to later find herself pregnant by him and then betrayed, when she discovered that he was also seeing someone else whom he intended to marry.Coupled with the fact that her younger sister, left momentarily unattended, died an unnecessary death, Esther's mother was less than sanguine about Esther's condition when it was discovered. Reviled by her mother and her brothers for the shame that her condition would bring upon the family, Esther was spirited away by her Aunt Patsy and sent to the Holy Saints Convent in Dublin. While there, she would work in its infamous Magdalen Laundry to earn her keep, while she awaited the birth of her baby.At the Holy Saints Convent and its Magdalen Laundry, Esther would discover what hell on earth was. Harshly treated, given only the minimum of food necessary to survive, Esther would spend her days toiling in the hot, steamy laundry, along with other such women with whom she bonded in a unique sisterhood. Some of them were women who had spent their entire lives there. Some were the victims of rape and incest, while others were simply young, unwed mothers such as Esther. All were subject to the reign of terror orchestrated by the nuns who ran the Magdalen Laundry.It is at the Magdalen Laundry, however, that Esther's world view is broadened. It is through her suffering at the hands of those whom she had supposed would have protected her that Esther truly comes of age. When her child is born, Esther comes to think of herself as a person independent of her family and finds the courage to realize for herself a vision of a new life. She envisions one outside the walls of the Magdalen Laundry and one beyond that of the family who had so cruelly renounced her in her hour of need.This book is written is crisp, clear, terse prose, with little sentimentality. It is a straightforward story that has overtones of the melancholia that often permeates Irish Catholicism. For this book, such is simply fitting. This is a wonderful book that places one of Catholic Ireland's most shameful secrets on public display in a fictionalized setting that perfectly showcases it.Those readers who are interested in this subject matter will also enjoy the film, \"The Magdalen Sisters\", which also fictionalizes life in the Magdalen Laundries. One should view it on dvd, because the dvd contains a heartbreaking British documentary, \"Sex in a Cold Climate\", which contains actual footage of the Magdalen Laundries and interviews of three survivors of the Magdalen Laundry experience.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "Esther Doyle is unmarried and pregnant, in the rustic, rural town of Connemara. Her lover has jilted her at the first words of the unwanted pregnancy. Esther is left alone to deal with the scandal. However, the only people Esther expected help from, her family, are ashamed and resentful. Her mother and brothers banish her from the home, sending her to Dublin.Esther's new home is The Magdalen Home for Wayward and Fallen Home. A laundry, run by nuns, is where she will earn her keep. When her nine months have passed, her baby will taken from her and given up for adoption. Esther and the other women work long, hard hours on their feet and are under the constant watch of the nuns. The women live the lives of prisoners. There is no recreation, no fun. The women are there to pay penance for their sins and ask God for forgiveness. However, these women, otherwise knows as &quot;The Maggies&quot; manage to form strong frienships. Their companionship allows Esther to fight her way out of a deep depression and struggle to reclaim her life. The Maggies help Esther to realize that her baby deserves a happy life and so does she.I have read quite a few books about the famous &quot;Magdalen Laundries&quot; that were once popular in Ireland. Many are dark and depressing. However, The Magdalen, is slightly more uplifting than most. Of course, this is not exactly a happy story, but these laundries did exist and it is something that many people have never heard of.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I recommended this book to many friends &amp; relatives - it was such a good story. The main character Esther is very likable. She's a strong character with human flaws &amp; your heart goes out to her. The book shows how unfair the double standard is for women vs men in many ways. I just loved it. Every part in the book keeps your interest - makes you want to keep reading until the end. For a woman to become pregnant before she's married in those times &amp; in such a Catholic country could lead a woman to be treated so unfairly by todays general standards in the US. Again, I highly recommend this book. I don't want to say anymore without ruining the story!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "that's what I look for in a book, people that get me involved. I get paid to proofread and copyedit books. Over the last 25 years and more than four thousand books, The Magdalen ranks in my top 100.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "The topic and the story line are really compelling--there's so much potential. The note on the cover that it's an Irish Bestseller sets readers up with very high expectations. For me, though, the storytelling was bland: not enough vivid description to really put me there (and there's SO much opportunity for this, what with the contrast between the open and wild western part of Ireland and stuffy, confined Dublin) and a lot of awkward dialogue (with a great many exclamation points!) makes the characters seem stilted. There are quite a few moments where things are repeated, or explained so similarly to other things that much of the story's potential momentum is lost. I'm glad I read it, for the topic, but I was hoping for a better experience.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This story as told by Esther tells us where we have been and how important it is to humanity to never return. The reality of the title could not be more in line to a previous story in Christian history that of Mary Magdalen, this the story of a group of young women that were out-cast in Ireland during this period. I feel the writer has delivered the message in sincerity to the facts and to the times and culture of 1950's Ireland and across much of the world with the exception of how these young women were placed in these institutions and stripped of their human dignity and basic human rights.Why in Ireland and other places were not the men held to task? Why was the moral obligation placed entirely upon the female of a relationship that obviously requires two? No where in the theology of Christianity is the male placed in superiority and the female a lesser being, except by the interpretation of man in the development of early Christianity and in the established church. Not to minimize the help the church apparently provided with food and shelter, but to question why the church took a moral high ground in placing itself in the position of judging these women and their families, thus releasing the males from their responibilities and their Christian duties toward these women? Why do societies worship class distinction above humanity? Why do we as a society hand over personal responibility to an established religion and expect just and fair treatment? These questions present in Ireland then and still today and elsewhere in the world should call everyone to reflection and revision.Throughout the book we read little to none regarding the father of this child of Esther, why? How could the church stand on a moral high ground in Ireland or elsewhere when its position was truly one-sided and at times inhumanly governed? How could religious orders support this position? The Magdalen presents these issues in their day and and we can read the effects the position of the church and culture had and continues to have today to some extent.These women are indeed followers of Magdalen, out-cast by the oppression of the times and culture of her day. This book is superb and offers us the experience of the past and a chance to create a brighter future.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "The book is very readable and the descriptions of small town family life in an Irish fishing/farming village are well rendered. The first half of the book describes Esther living with her family and the story unfolds in a compelling albeit tragic way. Esther is an attractive heroine with whom it is easy to identify and sympathize. Once she arrives at the laundry in Dublin though the book seems to lose momentum. The book is quite predictable and many of the secondary characters (especially those she meets in the laundry) are not as fully developed as they could be. The author makes the right choice in ending the book on a hopeful but not an unrealistic \"happily ever after\" note.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read this book after seeing the movie from Blockbuster.It's such an interesting, moving story. It takes you into a completely different culture - Very interesting and sad.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ftce educational media specialist a complete study guide for florida certification exams",
        "description": "***Includes Practice Test Questions*** FTCE Educational Media Specialist PK-12 Secrets helps you ace the Florida Teacher Certification Examinations, without weeks and months of endless studying. Our comprehensive FTCE Educational Media Specialist PK-12 Secrets study guide is written by our exam experts, who painstakingly researched every topic and concept that you need to know to ace your test. Our original research reveals specific weaknesses that you can exploit to increase your exam score more than you've ever imagined. FTCE Educational Media Specialist PK-12 Secrets includes: The 5 Secret Keys to FTCE Success: Time is Your Greatest Enemy, Guessing is Not Guesswork, Practice Smarter, Not Harder, Prepare, Don't Procrastinate, Test Yourself; A comprehensive General Strategy review including: Make Predictions, Answer the Question, Benchmark, Valid Information, Avoid Fact Traps, Milk the Question, The Trap of Familiarity, Eliminate Answers, Tough Questions, Brainstorm, Read Carefully, Face Value, Prefixes, Hedge Phrases, Switchback Words, New Information, Time Management, Contextual Clues, Don't Panic, Pace Yourself, Answer Selection, Check Your Work, Beware of Directly Quoted Answers, Slang, Extreme Statements, Answer Choice Families; Along with a complete, in-depth study guide for your specific FTCE exam, and much more...",
        "authors": "['Mometrix Media LLC.', 'Ftce Exam Secrets Test Prep Team']",
        "infoLink": "http://books.google.com/books?id=HIqncQAACAAJ&dq=FTCE+Educational+Media+Specialist:+A+Complete+Study+Guide+for+Florida+Certification+Exams&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "People looking for assistance preparing for the FTCE Educational Media Specialist's certification exam should be aware that this guide is somewhat out-of-date. Although the copyright of the edition I recieved was 2004, the book does not reflect the facts that &quot;Information Power&quot; was updated in 1998, there has been additional legislation since 1993, and the competencies and skills on the exam have changed.However, given the absence of alternatives, this guide is, perhaps, better than nothing. I just passed the exam yesterday and I think this book helped, but I don't know if I would have passed if I had relied on it as my only study guide. I suggest that future test-takers retrieve an updated list of competencies and skills from http://www.firn.edu/doe/sas/ftce/pdf/ftcomp10.pdf and use this book and other sources to create their own study guides. They will find that many of the competencies and skills are the same, but organized differently than in the book; other competencies and skills have been deleted and new ones have been added. Future media specialists should be aware of the information in the 1998 &quot;Information Power.&quot; They should know that guidelines for budget, collection size, physical space, and staffing are no longer prescriptive; therefore the formulas for these things in the book are out of date. In other words, use this guide as a study aide, but take it upon yourself to seek out updated information and fill in the holes it does not address.One thing it will not tell you, nor will anything on the test or the Florida Department of Education website, is how the test is scored. There is no indication of whether the test is criterion-references or norm-referenced, no indication of what a passing score is. This is more a criticism of the test itself than this book; but know before you buy that while the book has a fairly helpful and representative sample exam, it cannot give you an indication of whether or not you will get a passing score.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I prepared for the exam using only this book and Information Power '98, and I passed! However, I had worked in a school library as a para professional for a few years, which helped me immensely.This book does a great job of summarizing the basics, but be aware that the sample test does not resemble the real one very much. It covers the SAME THINGS but it will be worded/phrased quite differently at the exam.Actually performing on the job is one of the best preps for this test because there is NO way a person could realistically memorize all the things you need to know to pass.The test covers so much that I would recommend memorizing the basics from the XAM book and building a general understanding of the main policies. After that, there's not much you can do at the actual exam, except carefully think out each question and rely on your logic and deduction skills.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "microsoft office 2000 user specialist study guide",
        "description": "Go into the exams confident-and come out MOUS-certified! Earning your Microsoft Office User Specialist (MOUS) certification shows your current or future employer that you have the skills they need. This book helps you get those skills--by reinforcing what you know, teaching you what you don't, and preparing you for all the questions you'll face on the exam. Affordable and comprehensive, the Microsoft Office 2000 User Specialist Study Guide is the clear choice, and the only study resource you need to ready yourself to pass all the MOUS exams. Meet every exam's objectives: Word 2000 * Format characters and paragraphs * Use styles, templates, and macros * Publish documents on the Web * Create tables and forms * Generate a mail merge Excel 2000 * Create, modify, and print workbooks * Format worksheets * Create charts * Audit worksheets * Create and use templates Access 2000 * Create and modify a database * Integrate information from other applications * Publish Access data to the Web * Build forms for other users * Produce reports PowerPoint 2000 * Create and modify presentations * Add textual and visual information * Deliver and distribute presentations Outlook 2000 * Manage a contact list and calendar * Send, receive, and organize e-mail * Identify and filter spam and other unwanted e-mail * Make Outlook work with other Office applications FrontPage 2000 * Build and manage Web sites * Publish Web documents from Word, Excel, and Access * Create hyperlinks to link your site to others * Craft your site's navigational structure using Navigation bars PhotoDraw * Learn the PhotoDraw interface and expansive tool set * Import artwork or create your own graphics * Touch up and enhance photos with designer effects * Design your own professional images for the Web",
        "authors": "['Gini Courter', 'Annette Marquis']",
        "infoLink": "http://books.google.com/books?id=uEHNigr-Zb4C&dq=Microsoft+Office+2000+User+Specialist+Study+Guide&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is NOT the best self-study guide and claiming that it &quot;teaches all the essential skills needed to advance your career&quot; is a bunch of bunk.I'd rather spend a little extra money on a truly complete guide or for each application and learn it right the first time, instead of wasting my time with this book.Since the chapter on Access was so pathetic (coverage on Word and Excel was alright, but I'm sure someone has done better), I'm debating whether or not I even want to finish reading it.It may cover the exams, but don't rely on it if you've never used any Office products before. Print out the objectives from the MOUS website, buy yourself some decent study guides (even if it does cost more), then take the exam.If I could return it, I would.",
                "review/helpfulness": "50/56",
                "num_reviews": 56
            },
            {
                "review/text": "This book has everything I need to prepare for all the MOUS exams. It makes it really easy to study for all those features that cross over all of the applications. I think this book is a bargin. Although I may want to consult other references for more in depth coverage of some topics, I can use this book to identify what else I need. Definitely worth the price.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "I found this MOUS study guide to be quite helpful. To help you judge for yourself, a bit about me: I am a &quot;power user&quot; of Microsoft Office .. I've used it for many years, and I actually create and teach courses for MS Office products.I bought this book to help me get certified for a few main reasons:&gt; It was one of very few that covered all 5 exams required for Office 2000 Master certification&gt; it contained a certification map which describes the various topics covered on each exam, for each level (Expert vs. Core) and its topics are organized in that matter&gt; it is designed to be a REVIEW tool, with quick, step by step instructions AND brief explanations so that the reader will gain a basic understanding of the topic not just a memorization of steps (it is not a &quot;course&quot; book and will not replace a class if that is what you need).I rate this as a great study guide, as long as you have some prior knowledge of the products. DON'T RELY ON THIS (or any other study guide) IF YOU HAVE NO EXPERIENCE WITH MS OFFICE!!P.S. I passed all five exams, in one day. Thanks to this study guide (the only review guide I used) and experience/practice.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "The price of this book must've been determined by its weight because it's hefty in both respects...I tend to agree with some of what is mentioned in Burple's review--there are indeed better guides out there, but most of them are software-specific and don't do all of the Office package in one go. I'm currently using this book in conjunction with others to study for my MOUS exam, and where this book lacks, the other titles supplement. If you don't have a lot of experience with Access, for example, then this book isn't a good choice. Start small and buy a guide tailored to the Office application you specifically need strength in.The book is clear in its instructions and does include exercises to help you practice and test your skills; however, if you're a visaul learner, you'll be sorely dissapointed. The screen shots ARE NOT plentiful. In addition, they're sized so small, they're almost useless. You won't be able to read text in the shots of the dialog boxes, and that's a definite minus. So many of the skills you must master for the test involve knowing how to use these boxes...The CD that's included is a waste, which is the major reason I gave this only 3 stars. The CD is glorified advertising with a little bit of actual practice material as filler. The book even shamelessly states: &quot;And when you need some diversion and want to explore some exciting new software...&quot; The MOUS exam itself is about $100, and this book is no bargain--if I wanted to buy software, then I'd have done so. If the CD included only practice material, then I would bet that the cost of the book would be greatly decreased.I hope that subsequent study manuals by these authors spend more time on design and function in their writing and less time on selling ads (one of the endpapers is an ad for Earthlink internet service).",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book is the most comprehensive book I found on the Office 2000 MOUS exams. Covers the most important topics and is easy to read. The authors really seem to know their stuff. I hope to take the Word exams soon and think that this book will help me pass.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Items listed under the exams section isn't always on the listed page number.Why not put this together the way you take the tests instead of being all over the place. Doesn't make since.I don't see a MS Office Certification logo on the book.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I used this guide to prepare for all five exams required for the Office 2000 Master Level Certification and I passed all the exams on my first try. I used several books to learn the applications and prepare for the exams, but I liked this one the best because of the concise instructions and task based approach. The section on Access could have used a little more material, but the coverage is still good, and the coverage of the other applications is excellent. I would highly recommend this book to anyone preparing for the MOUS exams.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "The book (Overall) is a fair book to use as a study guide..BUT in several areas you are not given the correct subject matter to study. Word Expert for example is missing several KEY topics, or they are missed labeled.Main topics for other MOUS test study are good, I feel a better research job needs to be done, there are other books out there that cover the subject(s) much better.To me it is NOT worth the price (for what you get out of it).As the book &quot;states&quot; it is a study guide. Would be nice if indeed it was.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you are planning on being certified in Office 2000, then this book is for you. I used it to prepare and passed Word, Excel, Powerpoint and Access. I am currently using it to prepare for the other tests. This book covers every topic covered on all the exams thoroughly. Each application chapter recaps the topics to be covered on the exams. A seventh chapter covers the MS Office 2000 Integration test which is necessary to pass if you will become a full fledged Office 2000 certified associate.Even if you are not planning on becoming certified in all the MS Office 2000 applications, it is great for just improving yourself in each Office 2000 application of your choice.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "western society and the church in the middle ages",
        "description": "The concept of an ordered human society, both religious and secular, as an expression of a divinely ordered universe was central to medieval thought. In the West the political and religious community were inextricably bound together, and because the Church was so intimately involved with the world, any history of it must take into account the development of medieval society. Professor Southern's book covers the period from the eighth to the sixteenth century. After sketching the main features of each medieval age, he deals in greater detail with the Papacy, the relations between Rome and her rival Constantinople, the bishops and archbishops, and the various religious orders, providing in all a superb history of the period.",
        "authors": "['R. W. Southern']",
        "infoLink": "http://books.google.com/books?id=FIJPEAAAQBAJ&dq=Western+Society+and+the+Church+in+the+Middle+Ages&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "R.W. Southern's book is the second in a series of seven on the history of the Church. It begins with Pope Gregory II in the early eighth century and traces the development of the Church to the beginning of Henry VIII's reign in the early sixteenth century. Southern's emphasis is on the relationship between the Church as a religious institution and the political institutions of the Middle Ages, giving little attention to the Church's spiritual and theological components. The bulk of this volume covers the East-West schism of 1054, the papacy, the archbishops and bishops, and the various religious orders of this period. This book is scholarly in its approach, yet writtten in a very readable style. It gave me a much better understanding of the complex interactions between the Church and state during this period. I can recommend this volume to anyone interested in learning more about this era.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "This is a good book, although I would not recommend it as an introduction to the subject. If you're not already familiar with the characters and events to some degree, you'll just be lost, because he doesn't refer to specifics too often. It deals in generalizations and large sweeps. And it's no good for research for the same reason. What it's good for is in helping those of us who already have some familiarity with the subject to see it in a new way, and to draw connections that probably escaped us. The value of the book is in the perspective of an accomplished and perceptive expert that it provides.Sadly, the quality of the printing in this Penguin edition is absolutely deplorable. It is the worst I have ever seen. It looks like a bad photocopy. Apparently Penguin is too cheap to reset the type, and is using plates that should have been thrown out long ago. Buy a used copy. Don't patronize Penguin for producing such a shoddy product.",
                "review/helpfulness": "24/26",
                "num_reviews": 26
            },
            {
                "review/text": "What Southern attempts is daunting, to say the least: In 360 pages, he seeks to analyze how the church and society interacted during the entire 700-year period of the Middle Ages. And he has done a superb job of it. His book is comprehenisive without sounding platitudinous nor mired in detail, subtle without being rarefied. Another reviewer criticizes him for not giving enough attention to spiritual and theological aspects of the Middles Ages. The first part of this criticism is flatly false--the spiritual, insofar as they interact with society, abound in the book--and the second part is unwarranted, since Southern states in his first chapter that theological discussion lies outside the purview of the book. The reviewer, however, is correct in saying that it's a highly readable book. If you love church history--or want to learn how it should be written--this is a book you can't miss.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "As readers of my reviews may notice, I am fairly sparing in awarding \"5s\". These are usually reserved for books which have an unusual impact on me. \"Western Society and the Church in The Middle Ages\" has earned its \"5\".This book does an excellent job of explaining Western Society of the Middle Ages and the Church's role in it. It starts by explaining Western Society at the start of the Middle Ages and how that era developed out of the ruins of the Roman Empire. The Middle Ages is defined as the middle era between the fall of the Roman Empire in the West and the coming of the Modern Age. It describes a society in which everything is viewed as part of a divinely ordered plan, perhaps the only era in history to hold that view. It goes on to weave the story of the Church into the society of its era. On these pages, the reader comes to understand how the Ecclesiastical structures took on many of the duties of the state, either in the absence of, or with the encouragement of, the secular authority. The role of the Church in creating and administering wealth present a society much different from our own. I was surprised to read that, at the start of the Middle Ages, the Eastern Empire was a more prosperous and cultured realm than the, then barbaric, West. The explanation of the gradual drifting apart of the Eastern and Western Church, leading to the schism of 1054, is brought into much clearer focus than I had ever before experienced. The alien pressure brought upon the Eastern Church by rising Islam created one last surge for unity, but it was too little, too late.The Middle Ages, running from about 700-1300, are depicted as an era of evolving political and religious structures, each of which fulfilled a need of its time. This was an era during which the Papacy grew from a first among equals to a role of primacy, despite its struggle with secular leaders for control of ecclesiastical appointments and local bishops for supremacy within individual dioceses. The papacy emerged from this era as an institution which could hold its own against the nation states, the development of which defined the advent of the Modern Era. The development of the office of bishop is shown in its relationship to the rising papacy and the secular powers of each age and locality.A fascinating part of the book is the sections dealing with the religious orders which were born during the Middle Ages and which continue to serve the Church. The charisms of the Benedictions are contrasted with the later orders of Augustinians, Cistercians, Dominicans, Franciscans and others. The explanations of the differences between them and why each succeeded in turn opened my eyes, even though they generally conformed to other information which I had heard.I started out by saying that I reserve \"5s\" for books which have an unusual impact on me. This one impacted me by leaving me with questions to ponder, such as \"Was the Middle Ages, with its vision of a divinely ordered universe, the highpoint of civilization, or was the entrapment of the Church into the service of the secular order a fatal flaw in the life of the age?\" Before I read this book, the Middle Ages were too long ago and too alien to the modern world to be of much interest to me. Now I feel that I understand it much better and am left with a hunger to know more. I want to know about the saints, such as Francis and Clare of Assisi who shaped the era. I want to know more about Charlemagne and the society which he shaped. I want to know enough to enable me to understand how the Middle Ages shaped our world and how the institutions and attitudes which it engendered affect our lives, for better and for worse. A book that can do that deserves a \"5\".",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Don't let the title (or Southern's reputation for excellent scholarship for that matter) scare you. This book is a paperback of just over 350 pages, is easy to read, and is very well organized.Southern makes it easy to follow the big trends of the western medieval church. At the same time, he makes excellent selections of anecdotes and details of history to illustrate his points.Often, those details are downright entertaining. For example, Southern quotes a letter from Pope Innocent IV in 1244 to illustrate that the Franciscans had a reputation for *ahem* aggressive recruitment methods:. . . the schoolmaster's servants had been bribed to dope his drink. Whereupon certain friars induced him to join their Order by pronouncing (he was incapable of further speech) the simple word \"Yes\" . . . They were about to tonsure him when he came to his senses, seized the scissors, and chased his attackers from the house. . . .I can't praise Southern's book enough. If only all scholarly works were so well written, well organized and, yes, enjoyable even.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Richard Southern was knighted in 1975, President of the Royal Historical Society between 1968 and 1972, President of St. John's College between 1969 and 1981, and he won the Balzan Prize for Medieval History in 1987. Yet, he writes with humility and humor.In the preface to \"Western Socity and the Church in the Middle Ages\" Southern states that \"A bald statement of the problems discussed might seem to threaten the reader with a formal or doctrinaire treatise[...] There can be no doctrines in these matters, only perceptions; and I have tried to receive these only at first hand\" (11). Compare Owen Chadwick's attitude in the third book of the series, when he states that \"[Queen Elizabeth], like a woman, could not always fathom her own heart\" (130).Southern's style of writing has more in common with Kenneth C. Davis (of the \"Don't Know Much About\"(r) series)than he does with the other writers in the \"History of the Church Series.\" Both writers use cultural context and simple pithy language to engage their readers. Their tone is conversational and they use a chronological format with thematic divisions.An utterly enjoyable book worth reading as much for its unpretentious writing style as its content.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree with Mr. Schmidt's review in part - this is a fantastic overview to the subject and I learned a great deal in the way of nuance. I was fortunate enough to find this at a local thrift store and am so glad I did... I plan to invest in other books from this author and this series.I have no problem with the print quality or appearance of the text, although it may be a bit small for some.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Southern is a classic guide to cultural change in the Middle Ages. The book exposes a host of social turning points that would reshape Western society for centuries. For example, Southern explains the massive rise of religious idealism and diversified holy orders starting after 1000 AD. Such an upsurge of sentiment had at least some potential to inspire deeper love between men and women. And perhaps the popular cults of Mother Mary or of courtly love did indicate some deepening of human relations. But by its context and structure, the Western church made it seem that all real holiness required chastity. The effect was to channel religious aspiration away from family or secular community life, till both men and women commonly believed that Christianity stood for the separation, not the partnership of sexes.Southern shows the movement for holy chastity affecting women and men equally. And a church which generally discouraged any kind of religious initiative from females now faced a surge of women hoping to \"flee the world\". By the early 1100s, women were flocking to any religious order that might accept them. As word spread that the Premonstratensian Order was accepting nuns, a canon in Leon reported that \"10,000\" women flooded in between 1118 and 1125. (p. 313) The results involved both economic and moral problems for the male hierarchy. A convent of enclosed nuns near a monastery was commonly both an expense and a spiritual peril to male monastics. Many orders found their patience with both problems wearing thin. Shortly before 1200, the General Chapter of the Premonstratensians decided on budget cuts for nunneries. The cuts were so severe that many women took to the roads as wandering, begging nuns. Abbot Conrad of Marchtal insisted that no more females be admitted, explaining,\"We and our whole community of canons, recognizing that the wickedness of women is greater than all the other wickedness of the world, and that there is no anger like that of women, and that the poison of asps and dragons is more curable and less dangerous to men than the familiarity of women, have unanimously decreed for the safety of our souls, no less than that of our bodies and goods, that we will on no account receive any more sisters to the increase of our perdition, but will avoid them like poisonous animals.\" (p. 313-14)As the demand for religious vocation overflowed the male-managed church's institutional capacity, women in growing numbers turned to forming their own independent religious communities. So Southern cites Matthew Paris from 1243,\"At this time and especially in Germany, certain people -- men and women, but especially women -- have adopted a religious profession, though it is a light one. They call themselves \"religious\", and they take a private vow of continence and simplicity of life, though they do not follow the rule of any saint, nor are they as yet confined within a cloister. They have so multiplied within a short time that two thousand have been reported in Cologne and neighboring cities.\" (p. 319)In this and many other themes, Southern's account of clashing trends, ideals, and powers makes a fascinating study.-author of Correcting Jesus",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mcse readiness review exam 70098 implementing and supporting",
        "description": "Developed exclusively for Microsoft Press by Self Test Software, this electronic assessment tool delivers a set of randomly generated, 60-question practice exams covering real MCP objectives. You can test and retest with different question sets each time - and with automated scoring you get immediate Pass/Fail feedback. More importantly, you'll get answers to these four critical questions: What do MCP exam questions look like? In what topic and skill areas am I proficient/deficient? How should I focus my studies? Am I ready for the real exam?",
        "authors": "['Dave Perkovich']",
        "infoLink": "http://books.google.nl/books?id=ZMnKPQAACAAJ&dq=Mcse+Readiness+Review+--+Exam+70-098:+Implementing+And+Supporting&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a good additional book to have to study for the Windows 98 test. The questions are very similar in format and difficulty to the actual test. You will need additional study materials. I had the Resource Kit and The Top Riders Guide by Casad. I passed the test today.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I'm someone with no IT work experience who just passed 70-98 as my very first MCP exam.As I prepared for the test, I had serious doubts as to whether this product would give me an accurate preview of what the real test would be like.I was very pleasantly surprised to find that I was extremely well prepared! Unless you have TONS of experience networking Windows 98, you should really consider this package, particularly for the price! I found the questions to be as difficult, if not MORE difficult then most of the real exam questions. I'll put it this way - I didn't pass this Readiness Review test until the DAY BEFORE my real test!However, you should obviously not rely on just this. I also used the Sybex and Syngress/Osbourne study guides, with the MS Windows 98 training kit for reference, and then the Exam Cram to finish up.If you want more info, read the reviews for the &quot;Networking Essentials&quot; Readiness Review - I feel those comments apply here as well, and I just bought that one for test #2!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the founding fathers and the place of religion in america",
        "description": "How did the United States, founded as colonies with explicitly religious aspirations, come to be the first modern state whose commitment to the separation of church and state was reflected in its constitution? Frank Lambert explains why this happened, offering in the process a synthesis of American history from the first British arrivals through Thomas Jefferson's controversial presidency. Lambert recognizes that two sets of spiritual fathers defined the place of religion in early America: what Lambert calls the Planting Fathers, who brought Old World ideas and dreams of building a \"City upon a Hill,\" and the Founding Fathers, who determined the constitutional arrangement of religion in the new republic. While the former proselytized the \"one true faith,\" the latter emphasized religious freedom over religious purity. Lambert locates this shift in the mid-eighteenth century. In the wake of evangelical revival, immigration by new dissenters, and population expansion, there emerged a marketplace of religion characterized by sectarian competition, pluralism, and widened choice. During the American Revolution, dissenters found sympathetic lawmakers who favored separating church and state, and the free marketplace of religion gained legal status as the Founders began the daunting task of uniting thirteen disparate colonies. To avoid discord in an increasingly pluralistic and contentious society, the Founders left the religious arena free of government intervention save for the guarantee of free exercise for all. Religious people and groups were also free to seek political influence, ensuring that religion's place in America would always be a contested one, but never a state-regulated one. An engaging and highly readable account of early American history, this book shows how religious freedom came to be recognized not merely as toleration of dissent but as a natural right to be enjoyed by all Americans.",
        "authors": "['Frank Lambert']",
        "infoLink": "https://play.google.com/store/books/details?id=4CHIomb78VgC&source=gbs_api",
        "review": [
            {
                "review/text": "This book is the best on its subject which I have come across in a very long time -- after a fairly long course of reading books on US church-state relations over the years -- in history, law, policy...I came to Lambert now after wading through a score or so of recent books on this -- tracts, I'll call most of the others, because they were nearly all horribly-biased. This has been part of a personal project to explain, and defend, the extraordinary depth and richness of US religiosity to some overseas friends. Foreigners never do understand how we can have such strong religious activity and belief, here in the US, while at the same time we maintain a \"wall of separation\" between church and state.Lambert does an admirable job of explaining this -- and he does it fairly, with great balance, and with wonderful style in his writing. He has a point of view himself, but he does not let it become a bias -- anyone possessing any of the many opinions which exist, on these issues, can get much out of reading this book.Lambert is a master of the topical and well-timed historical anecdote: he weaves these together, gently, in an entertaining and informative account of the US Colonial record on the difficulties of accommodating \"varieties of religious experience\". But he also has a keen historian's eye for the value of generalizations. He confines his text very carefully to his chosen historical period, 1600-1800. But he is not at all afraid to draw out a universal theme, occasionally, from his account of what those little bands of English expatriates and descendants of same were doing, or thought they were doing, back then in their \"13 colonies\".So we get the intriguing suggestion that the world -- or at least the Western European and particularly the New World American British Colonies part of it, but not just that last -- was proceeding, during that period, from a religious politics dominated by the clergy to one governed by the individual -- and perhaps that, more than quarrels over belief, is what the fuss was all about... \"The central question for the Founders had not been religion's role,\" he asserts, \"Rather, they worried about religion's place, deciding in the end that it would fluorish more through persuasion... than through government coercion.\" (p. 206)And, along the same lines, Lambert gives us the suggestion -- this one heard in the French Revolution as well -- that more than a matter of doctrine the religious changes of the times were political, again, and more of a shift in power from Ministers to Lawyers -- \"Lawyers, not clergymen, took the lead in challenging Parliament's new imperial policies...\" (p. 210). So the US Revolution certainly changed US politics, but unlike the French the US Americans still were free, afterward, to believe whatever they wanted to believe in matters of religion.Lambert's \"Introduction\" ought to be mandatory reading for anyone interested in current issues in these areas. As already mentioned, the body of the book is devoted to careful, balanced, US Colonial history: interesting stories, intriguingly presented, but meticulously crafted so as not to become the sweeping over-generalizations and \"moral lessons\" so often presented in other literature on this subject. In his Introduction, however, Lambert is not afraid to take a shot at characterizing current controversies: and it is a very careful and balanced and complete one --\"This study looks at the cultural and political boundaries that circumscribed the Founders' decisions and actions,\" he warns in his Introduction (p. 8) -- his implication, at least, being that passionate controversies today have their \"contexts\" as well...\"During the last two decades of the twentieth century and continuing into the twenty-first, Americans have engaged in a culture war... On one side of the debate are those who insist that America has been since its conception a 'Christian Nation'... They blame 'liberals' for not only turning their backs on the country's religious heritage but openly attaching those who embrace 'traditional' Christian values... these conservatives often conflate the planters -- such as the New England Puritans and the Chesapeake Anglicans -- and the Founders into one set of forefathers...\", Lambert says.But in addition, \"Partisans on the other side of the culture war also consult the nation's Founders for a 'usable past' of their own. They, too, tend to conflate the two sets of progenitors by making both the Founding and the Planting Fathers impassioned champions of a religious freedom that extended liberty of conscience to all...\"The book presents a really interesting controversy, then: good history, and also invaluable ammunition for both sides in the current fight, hopefully for use in moderating their own extremist positions and coming to a better understanding -- an understanding of the necessities for change, if those exist, but also of the reasons for maintaining continuity, as those do too.In a time of White House \"faith-based initiatives\", and of Department of Justice \"Moslem\" roundups, and of Supreme Courts which grant certiorari to \"Under God\" cases, Lambert's book should be required reading -- not just for religion classes, but also for history classes and law classes and decision-makers, and for all members of the general public... who either do or do not love the US... There is a great deal of wisdom about what makes the US a strong and good place, in this book.Jack Kessler...",
                "review/helpfulness": "103/116",
                "num_reviews": 116
            },
            {
                "review/text": "I have to agree with the other reviewers here (like Jack Kessler below):This is a book that should be read by BOTH pro-separationists and anti-separationists. Of all the books that I have read on the subject, this book was *refreshingly* honest, accurate and scholarly, not to mention, a rather enjoyable reading.The author stays clear of attacking either pro-separationists or anti-separationists--I truly appreciated that. (Can I assume this man is a Christian, or at least a good man?) Its been awhile since I've read a book on this subject that was historically accurate and could be trusted because it does not come across as biased.Even if I agreed with him for the most part, the author forced me to think about my own stance. As another reviewer stated, this man also addresses the issues and policies that are being debated about around the first amendment, some of which I did not understand as clearly until I read this book.As the other reviewer here said, this book should be a *textbook* for everyone, because it shows some of the history that many of us Christians (on both ends of spectrum) don't know about.The book even gave me a greater respect for our nation's founders, after learning about the issues they grappled with.Of ALL the books on the subject, this is my favorite, and probably the only book that I would recommend as a MUST READ for people at both ends of the political spectrum! :)",
                "review/helpfulness": "32/40",
                "num_reviews": 40
            },
            {
                "review/text": "This very good book is a concise history of church-state relations in Colonial and Revolutionary America from the early British settlements to the election of 1800. Lambert describes the nature of early religous establishments, the increasing diversification of American religion, the impact of the Enlightenment and radical Whig ideology, and the emergence of church-state separation after the Revolution. There will be little new in this book for scholars of this period but this is definitely the best overview I have seen on this very contentious topic. Aimed at a broad audience, The Founding Fathers is written well, organized well, and is objective.Lambert comes to this subject from an interesting perspective. His prior major work has been on the history of 18th century evangelism and his is an expert on Colonial religous practice. He particularly stresses that most of the colonies were founded originally with established churches and that establishment crumbled under the pressures of religous diversification. By the mid-18th century, the colonies contained a remarkably diverse set of Protestant sects and even some Catholics. This religous diversity, some of which arose from immigration and some from separatist movements within established churches, placed great strains on established churches. The mid-century Great Awakening resulted in further diversification and undermined the authority of the parish system throughout the colonies. Around the same time, the Enlightenment, with its Deistic views, and radical Whig ideology, with its emphasis on individual liberty, were becoming increasingly influential in the Colonies. All these factors converged to form a widespread belief that individuals, not the state, should determine religous faith. Individual churches would have to compete for adherents in a marketplace of ideas without the support of the state. These ideas eventually culminated in the post-Revolutionary separation of Church and State in the Federal Constitution. Separationism was supported most strongly by a coalition of relatively secular political leaders, like most of the Founders, and Protestant dissenters whose churches had suffered discrimination under the established churches in several colonies. This coalition believed correctly that religion was best served by being separated from the state. This was truly a revolutionary development and the USA was the first polity to enact church-state separation. Indeed, a number of European states still have established churches and almost all of them preserve a constitutionally sanctioned special relationship with one church. Lambert concludes by discussing the Presidential election of 1800, which some Federalists and sectarians framed as a referendum on Jefferson's unfitness to be President because of his deist-unitarian beliefs. Lambert argues convincingly that the election of 1800 acted as a referendum of sorts not just on Jefferson but also on church-state separation. Perhaps the only significant defect of this book is that the conclusion leaves one with the impression that the Church-State separation was settled after the election of 1800. It was not, and some of the more unattractive subsequent aspects of our history are consequences of imperfect separation. The Federal separation of Church and State applied originally only to the actions of the Federal government, some states continued with established churches into the 19th century. More important, state and local political power became vehicles for religous bigotry, notably abuse of public school systems in ways that infringed the rights of minority religions. One of the reasons we have a large system of Catholic private education is that 19th century Protestants used public schools to harass Catholics. Lambert demonstrates nicely that separation was engendered by the religous diversity of 18th century America. We have even more religous diversity today and separation continues to be a guarantee of a vibrant religous culture.The issue of Church-State separation continues to be very contentious. Since many partisans in this debate appeal to the Revolutionary period to support their points of view, writing in this field can be emotionally charged. Lambert has clearly written this book in an effort to provide a fair and dispassionate presentation of what actually happened. Reflecting a broad consensus of knowledgeable historians, he has succeeded, though his conclusions will not be palatable for many on the religous right.",
                "review/helpfulness": "28/30",
                "num_reviews": 30
            },
            {
                "review/text": "Lambert offers a rare erudite examination of the issue of religion at the founding of our nation. Given the heated partisan rhetoric coming from all sides in this debate, it is refreshing to hear a voice of moderation.Although Lambert offers a compelling case for a secular government and pluralistic religious culture, such an argument, although cogent, may obscure an underlying problem among those who look to the past for direction on present-day policy: That which \"was\" is not necessarily \"as should be.\"Consider this: Our founders tolerated slavery; the subjugation of women in the spheres of education, occupation, and politics; legal disregard for the Native peoples, whose legal definition was left ambiguous, etc.Is it not safe to assume that we have become a different society and culture since the late eighteenth century? Therefore, even IF the \"Christian-nation\" pseudo-historians could convincingly make their case, it does not follow that America SHOULD be a Christian nation today any more than we would conclude that slavery or disenfranchisement of women and blacks are acceptable features of our culture.In the end, my response would be, \"So what?\" I have no antiquarian reactionary neuroses that compel me to embrace the ideas of past generations. Indeed, it is the lack of a compelling message that forces evangelicals to cherry-pick history to buttress their unpersuasive arguments.Having said that, Lambert's book should be applauded for successfully undermining the simplistic, quote-mining, de-contextualizing, de-historicizing pretensions of fundamentalist revisionists who ransack history in search of only \"useful\" evidence.",
                "review/helpfulness": "22/30",
                "num_reviews": 30
            },
            {
                "review/text": "Frank Lambert, professor of history at Purdue University, does an excellent job of surveying this complex topic over a 200-year period. He does so thoroughly, yet concisely, in only 296 pages. While making generalizations at times, he often illustrates his points with quotations from original sources of the time period.He begins by criticizing extremists on both sides of the issue, and proceeds to present a balanced approach. However, as I will explain at the end of this review, he shows his bias at the end.Lambert's thesis is this: America WAS first settled by people who wanted to make it a Christian nation, whether Puritans in New England, Anglicans in Virginia, or Quakers and others in Pennsylvania. These early founders had a vision of making America \"a city on a hill,\" a model Christian commonwealth. However, two major influences led the founding fathers to establish a government that separated church and state. These two influences were the Enlightenment and the Great Awakening. Men like Thomas Jefferson and Thomas Paine, who were influenced by the Enlightenment, felt that men should be free to use their own reason in matters of religion. The Baptists and others who benefitted from the rapid growth of \"free\" churches in the Great Awakening were persecuted by established churches and wished to have no established church, so they joined with men like Jefferson in calling for separation of church and state.Lambert shows that there was great division over these issues, and gives interesting anecdotes and quotations from both sides. He quotes frequently from religious leaders on both sides of the issue. However, near the end of the book he spends much more time quoting Republicans like Thomas Jefferson and James Madison, and gives little space to Federalists like George Washington and John Adams. At one point, on page 161, Lambert implies that John Adams was a deist, even though biographies of Adams have shown him to be a devout Christian with a Puritan heritage.Lambert shows his view in his conclusion, as he criticizes accomodationists such as Judge William Rehnquist and \"religious right\" preachers like Pat Robertson.While Lambert gives both sides of the argument, he clearly leads the reader to his own separationist interpretation. Because the book is so full of useful information, I highly recommend it as a textbook on the subject, but let the reader understand that Lambert has his own bias, too.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "praxiscst business education teaching area examination no 10",
        "description": "This is a timely and affordable study guide for the PRAXIS 5001 teacher certification test. Testing of new standards begins August 2015. This is the only product on the market that has EXPANDED, aligned content and a full sample test with answer explanations. Many states -- but not all -- that formerly required 5031 have adopted test 5001. Changes include almost doubling the coverage of content. The skills have expanded in ELA and math. The test formerly had 210 questions and now has 235 questions. The number of social science questions will be reduced by ten questions. This product provides a highway to success, quickly and efficiently gathering more content succinctly, including each of the four subtests, aligned expanded descriptive statements, with their corresponding numerous and authoritative examples. Since Praxis 5001 is an unusually long test, it is in the candidate s best interest to augment this study guide with our additional suite of digital products which include interactive bundled tests that are comprised of questions from three tests, that include time on question as well as time on test. By contrast, this product is not a broad review of subtests with generic videos or generic categories clustered under subtests, because it defeats the purpose of PRAXIS specificity. Our sample test questions are aligned to specific skills. In conclusion, this product is unique because of its specific content, unpacked deliberately, with standards-aligned sample test questions and explanations. Common Core standards have been added.\"",
        "authors": "['Sharon Wynne']",
        "infoLink": "http://books.google.com/books?id=Ph9-rgEACAAJ&dq=PRAXIS/CST+Business+Education+Teaching+Area+Examination+(No.+10)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I do not recommend this book as a study guide, as the content is totally unrelated to the PRAXIS exam",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Sorry, but I disagree 100% with the previous reviewer. I purchased this book in May 2007 for the New Jersey Praxis Exam in June 2007.The book provides a sample exam with complete explanation for the answers. The book also informs test takers how to prepare for the exam.As a career changer, who has been out of school for 15 years, I used this book to prepare for the exam. I scored in the 95th percentile. I would highly recommend this book.One word of caution, every state has it's own requirements, both in terms of the exam itself and what is a passing grade - thus your own results may vary. In NJ, the actual Praxis exam consists of 120 multiple choice questions which must be completed in 2 hours - very similar to the sample exam provided in this Praxis Study Guide.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the habit a history of the clothing of catholic nuns",
        "description": "Curiosity about nuns and their distinctive clothing is almost as old as Catholicism itself. The habit intrigues the religious and the nonreligious alike, from medieval maidens to contemporary schoolboys, to feminists and other social critics. The first book to explore the symbolism of this attire, The Habit presents a visual gallery of the diverse forms of religious clothing and explains the principles and traditions that inspired them. More than just an eye-opening study of the symbolic significance of starched wimples, dark dresses, and flowing veils, The Habit is an incisive, engaging portrait of the roles nuns have and do play in the Catholic Church and in ministering to the needs of society. From the clothing seen in an eleventh-century monastery to the garb worn by nuns on picket lines during the 1960s, habits have always been designed to convey a specific image or ideal. The habits of the Benedictines and the Dominicans, for example, were specifically created to distinguish women who consecrated their lives to God; other habits reflected the sisters' desire to blend in among the people they served. The brown Carmelite habit was rarely seen outside the monastery wall, while the Flying Nun turned the white winged cornette of the Daughters of Charity into a universally recognized icon. And when many religious abandoned habits in the 1960s and '70s, it stirred a debate that continues today. Drawing on archival research and personal interviews with nuns all over the United States, Elizabeth Kuhns examines some of the gender and identity issues behind the controversy and brings to light the paradoxes the habit represents. For some, it epitomizes oppression and obsolescence; for others, it embodies the ultimate beauty and dignity of the vocation. Complete with extraordinary photographs, including images of the nineteenth century nuns' silk bonnets to the simple gray dresses of the Sisters of Social Service, this evocative narrative explores the timeless symbolism of the habit and traces its evolution as a visual reflection of the changes in society.",
        "authors": "['Elizabeth Kuhns']",
        "infoLink": "https://play.google.com/store/books/details?id=VPqYwM99sOgC&source=gbs_api",
        "review": [
            {
                "review/text": "If you are interested in the historical clothing and traditions of Catholic religious women, this book is certainly worth having, and the author does a better job of getting things right than some reviewers are willing to admit. (One reviewer chides that the woman on the cover is not a nun but a 'sister', but if she had read the forward, she'd know that the author DID discuss the distinctions while explaining that she would, for the purposes of narrative, use the terms 'nun' and 'sister' interchangably...which is perfectly alright to do, btw.)I have two issues with the book which kept me from really enjoying it. The first is that while she discusses those modern and rapidly growing religious orders (such as the Sisters of Life, the Sisters of Mary, Mother of the Eucharist, the Kentucky Dominicans, the cloistered sisters at the Abbey of Regina Laudis, etc) which have retained or re-introduced a more traditional habit to their order, she does not enhance her narrative with visuals. One would appreciate seeing what these new young nuns LOOK like, as doubtless, they're not still in multi-pleated architectural headpieces and heavy woolen skirts. A few images would have made the whole exercise feel more 'up to date'. And it would be good to see a few modern religious in their more casual wear, too.The second quibble I have is that the author - good and devoted as she is - makes some statements that are much too broad and sweeping to be excused, as in \"all mail was censored, and the nuns would even have to ask permission to use a piece of thread\".Well, no. While some orders did censor mail - most of them did not, and it would be very interesting to find out which orders did and didn't. I would be willing to bet that those orders that did censor mail have also died out, while orders like Benedictines and Dominicans, which did not censor, did not listen in at private conversations and did not treat their members like idiot children, are still existant and flourishing. And while some very over-controlling or pinch-penny order might have quibbled about a length of thread, most nuns had their own sewing boxes and those personal items such as they needed in order to live life with some dignity! As to the REASON why a sisters and nuns so frequently needed to ask permission to do those things which we modern/civilian women would not think twice of, the system was not so iniquitious as it seems. This communication was what would keep supervisors apprised of the state of the community, of its holdings, its supplies, its mindset, etc. In a community of busy women, each with her own responsibilities, only in such a way could a supervisor such as an abbess, prioress or reverend mother keep good track of her 'flock', still interact with them on a daily and 'usual' basis, and still have a good sense of where they were at and what they each needed. It is, in fact, wiser than it first seems.These are minor quibbles, as I said, but they detracted from my enjoyment of the book. I am hopeful that the author will write a SECOND book of nuns, a compilation of those orders (like those mentioned above and so many more) who are growing rather than dying, who are celebrating their conspicuous consecration rather than shrinking from it and who seem to be vibrant and happy women. The world needs to hear about them, I think.",
                "review/helpfulness": "61/63",
                "num_reviews": 63
            },
            {
                "review/text": "After a long wait for this book and seeing the price shoot up to over $50 on eBay for advanced copies. I was not impressed when I finally purchased my copy. Its a very nice book for those who are just learning about the history of the Sisters. For someone who has other books on the nuns and are searching for something new and fresh they wont find it in this book, many of the pictures can be found in other books about nuns that I already have. I was sorry there were not more detailed pictures of the pendents and crosses the nuns wore that identified the order they belonged to, and the lack of attention to detail. I was eager to learn about details the clothing and customs, and did not find in this book. It would of been nice to have the Sisters who wore the habit share personal stories about the garb while they are still around to do so.",
                "review/helpfulness": "24/28",
                "num_reviews": 28
            },
            {
                "review/text": "And not only a history of the habit, but a history of women in religious communities through the centuries. There is a great deal of information in the book, even though it seems to be meant as only an introduction. Both sides of the issue regarding the wearing of the habit today are presented. It is interesting to me that those communities that wear some sort of habit are the communities that are most likely to draw interested women. And yet, those women who belong to communities that don't wear a habit of any kind seem so dead-set against the wearing of a habit. Also, the book's illustrations are quite nice. The photos are a history in and of themselves.",
                "review/helpfulness": "22/28",
                "num_reviews": 28
            },
            {
                "review/text": "+JXPMs. Kuhns--a convert--wrote this book as an act of love for the Church and our women religious. Her work answers questions that have long lingered in the minds of Catholics and non-Catholics alike: Where did the nun's habit come from? Why did the nuns throw their habits away? Both questions are respectfully answered. I was very happy to see a clothing list included, also.Ms. Kuhns is not a mystic trying to explain the heavenly side of the habit. I cannot understand what else the other reviewers were wanting. However, if she had included more mystical information, and photos with details of the habits, culled from fresh research, then I imagine I would have given the book a five star review. However, out of charity and encouragement, I give her three stars. The book definitely fills a gap, and the information needed in today's world.In this age of air conditioning, why should long habits be discarded? Even some austere Capuchin nuns in the American southwest have air conditioning in their dorm and chapel. I can understand lighter fabrics for the missions, but in this world of hard-molded plastic, some of the starched items could have been replaced with something requiring less maintenance. Many communities have summer and winter habits.As everyone is beginning to learn, religious orders who have retained a modest habit, are faithful to the Holy Father, have community prayer, and areas of cloister in their convents are blessed with the lion's share of the vocations. Traditionalist orders are bursting at the seams. Unfortunately, our &quot;undercover sisters&quot; do not want to wake up and smell the incense. They continue on their path of modern day fashions, which in our opinion, are not modest enough.&quot;The Habit&quot;--well worth the price in hardback--is a wonderful addition to the bookshelf, sitting alongside Elenor Tong Dehey's monumental &quot;Religious Orders of Women in the United States,&quot; and Fr. McCarthy's synoptic &quot;Guide to the Catholic Sisterhoods in the United States,&quot; both of which have been reprinted.Gemma, Lay Passionist",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "Sad to say, the definitive history of the clothing of religious women has yet to be published in the English language. Kuhns' book purports to tell the history of the nuns' habit - why they wore those odd uncomfortable looking clothes, and what those component parts meant. She has cobbled together a synopsis of costume history from the middle ages onward - which information is available elsewhere in more enlightening format. Unfortunately for the reader, Kuhns' prose is dry as toast, totally lacking in interesting anecdotes, and poorly edited. There are a number of typographical errors throughout the book (couldn't she afford an editor?), and in one case, one of the photos in the appendix is miscaptioned with the name of the wrong religious order. For those of us who have a strong interest in the material, you will not find anything new or compelling presented here. The book is &quot;padded&quot; with several chapters on the history of religious women's foundations, which material is best presented in Joann Kay McNamara's book &quot;Sisters in Arms.&quot; The informed reader may safely skip this section entirely. The book is illustrated with some vintage photographs, many of them courtesy of Fr. Eugene McCarthy, whose own series of books, &quot;Guide to the Catholic Sisterhoods in the United States,&quot; published between 1952 and 1964, are considered the &quot;fashion bibles&quot; of pre-Vatican II nuns' habits. (These photos were originally commissioned by Gonzaga University beginning in the 1940s and later appropriated by said Fr. McCarthy - apparently, the clergy have no compunction about not assigning credit when due.) Serious scholars should pass this work by completely, and opt instead for the hefty, expensive Italian-language tome &quot;La Sostanza dell' Effimero&quot;, published by the Daughters of St. Paul in Rome but obtainable through their bookstores throughout the United States on special order.",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "Save your money on this one. From an average introduction, things went steadily downhill. If there was any original research in this book, it could not be found. Pictures were dated and can be found elsewhere in several other sources. All were all full body shots with little or no detail. Perhaps strangest was the Glossary of Church Terms, few if any were used in the body of the text. What that had to do with the main topic is still a mystery. About the only redeeming feature is it is an example of &quot;pastiche.&quot;",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "Without reiterating the commentary from the five previous reviewers (all of whom I happen to agree with), I will only add that The Habit makes a decent primer for those who are new to the subject of women's clerical garb. It's a fast read and fairly interesting, but it really isn't worth the new hardcover price. Look for a used copy.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "Although the subject matter was interesting, the lack of pictures and overall layout of the book made it tedious to read. I saw so many opportunities for this book to be better. For example, there were many instances where an accompanying picture would have clarified a description or put it into a better context. A specific example of this is where she mentions a nail belt. It would have been illuminating to see a picture of one on that page. The writing style to me seemed dry, almost \"textbook\".",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "Religious communities in America (i.e., Catholic Religious communities) have struggled to find their identity for the last 2 decades; but of course, imitating modern culture in so many other ways, to arrive at such a point of confusion, they first threw out anything old, including wearing religious garb. I only wish that the religious sisters of today (the new, \"improved\" nuns) who threw out their habits would read this book. No, the habit itself does not make a sister a sister. No more than black clothes and a white collar make a priest a good priest. But when there's nearly 2,000 years of tradition involved... just maybe they should have \"looked before they leaped.\" I thought this was a good book. Well-researched, easy to read, full of interesting points, and a good argument for nuns to put their habits back on (though the author doesn't go out of her way to make this point or beat anybody over the head with it). Regardless of what side of the debate people are on, I think the average Catholic should find this a fascinating, good book.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "\"A Reader\" complains that the cover depicts a \"sister\" rather than a nun on the cover, adding: \"What a blunder!\" Clearly \"Reader\" him- or herself needs to read a little harder. The book's introduction says: \"I use the terms 'nun,' 'sister,' 'consecrated woman' and 'religious' interchangeably, although there are differences according to Church canonical law.\" (For the layperson, \"nuns,\" strictly speaking, are members of religious orders, usually monastic, whereas \"sisters\" are members of religious congregations, generally working among the people.) It would be nice if the authors of such comments would take the trouble to look at the text as well as the cover, before rushing onto the Web to show us all how clever they are.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            }
        ]
    },
    {
        "Title": "the amen sisters a novel",
        "description": "SPECIAL PURCHASE: Buy the paperback edition and get the e-book for $1.99. Limited time only! The Amen Sisters, the third book in Angela Benson's emotional and uplifting Genesis House series, offers a compassionate look at the lives that are forever changed when a pastor abuses his power with the women of his congregation. It is a story of love, faith and forgiveness that will stay with you long after you've turned the last page. Francine Amen burned a lot of bridges when she left her home town to join a traveling ministry. When she's forced to return broken and alone after a scandal involving her pastor, she finds that making amends is not easy. Her sister, Dawn Amen-Ray, is having her own set of problems. With her marriage to Francine's ex in trouble, she's not ready to deal with Francine's return. About the Author Angela Benson writes from the heart about matters that she has experienced and about which she feels strongly. She is the award winning and bestselling author of fourteen novels, two novellas and two non-fiction books. Her most recently published works are the relationship guide, Men Don't Like Ugly, Women Don't Like Broke, and the contemporary novel, The Summer of Me (William Morrow, 2016).",
        "authors": "['Angela Benson']",
        "infoLink": "http://books.google.com/books?id=O1qPDAEACAAJ&dq=The+Amen+Sisters:+A+Novel&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Angela Benson's third Christian Fiction novel, The Amen Sisters, ventures into the unsettling subject of ministers who commit adultery with women in their congregations. However, that is just one aspect of the storyline.Francine Amen finds herself in a mental treatment facility following a nervous breakdown precipitated by her best friend's suicide. She is despondent and feels guilty because she was responsible for Toni leaving her family and joining a traveling ministry led by a minister who was a wolf in sheep's clothing. Francine rejected Toni's claim that Brother Payne had impregnated her. Now Francine's sister, Dawn, has come to Ohio to bring her back home to Georgia, back to their family home-and back to the church home she left where she had rebuked the congregation and possibly burned her bridges.Francine was engaged to Sylvester Ray when she up and left town to join Bishop Payne's traveling ministry. Her fraternal twin Dawn and Sly then began seeing each other and soon married. Together they operate the Amen-Ray Funeral Home business that was started by both of their grandparents. There has always been a sense of competition and sibling rivalry between the sisters but Dawn is determined to be there for her sister in her darkest hour. However, Dawn must contend with the discord in her home and marriage. She is trying to deal with Sly's betrayal as he professes to love her and make things right. It does not take long for Francine to discover there is serious tension between her sister and Sly.Francine begins working at Mother Harris' bookstore, slowly trying to put her life back together as well as make peace with the way she left Faith Central; she had condemned them in a self-righteous manner. Additionally, she has to face Toni's family, the Roberts, who are angry with her, blaming Francine for Toni's suicide. George, Toni's brother is especially bitter and attempts to discredit her in every way he can.There are others in Francine's corner though; Mother Harris, Rev. Thomas of Faith Central and Stuart, Sly's best friend, who all try to encourage her faith and strength in the Lord. Francine also befriends Monika, a teenager who works at the bookstore and her mother, Delores. She is drawn into the mother and daughter's dilemma when Monika's desire to know her father's identity threatens the fabric of the lives of some prominent people.This reviewer found myself frustrated at times with the various storylines as well as the characters, particularly Francine. I needed to know what motivated her over-zealous, self-righteous attitude but to her credit her character did show quite a bit of growth. Additionally, I found the reaction to the infidelity and adultery of a trusted member of the congregation a little too laid back, not to mention the adulterer's reasoning of \"it just happened\" as an affront to everyone's intelligence. Then there is the matter of seemingly not an eyebrow was raised to the fact that the minute Francine left town, Dawn scooped up her man.That said, without the aforementioned scenarios, there would not have been the story that it was and true to Benson's style, she is a good storyteller. Known in the mid-90s for her intriguing romance stories with Arabesque, this author seems to have found her niche in Christian fiction. This reviewer also appreciates the fact that her characters are intelligent, upwardly mobile African Americans grounded in a sense of family, community, business and social awareness. The insular world of church folk, including Mother Harris, the voice of reason, like so many Mothers of the church with whom so many of us can identify is presented in a realistic manner. Minister adultery/sexual abuse is tackled as an ongoing issue that needs to be and is being recognized and addressed in churches. The strength of this book is in the writing and the hard lessons learned-God's grace notwithstanding. Fans of this author should be pleased.Dera R. WilliamsAPOOO BookClub",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "After being inspired by Bishop Payne, a traveling minister, Francine Amen decides to leave her old life behind and dedicate herself more fully to the Lord. Before she leaves to join Bishop Payne's ministry, she takes it upon herself to tell off everyone in her church and urge them to get right with God. When her childhood friend, who also joined Bishop Payne's congregation, confides that she is pregnant by the bishop, Francine shuns her. Feeling hopeless and isolated, her friend commits suicide. Plagued with guilt and haunted by memories of the event, Francine spends time in a mental hospital. When she is released, she has no place to go, so she is forced to return to her hometown with her tail between her legs and rebuild her life. It is here that THE AMEN SISTERS, Angela Benson's latest novel begins.As Francine gets settled in at the home shared by her sister Dawn and her husband Sly, it soon becomes apparent that things between the couple are not quite right. As Dawn and Sly try to cover up their problems, the stress between them continues to build and eventually, something will have to give. In addition, Dawn and Francine have always had a tenuous relationship; the sisters have to work through the issues from the past so they can become the sisters God would want them to be. Francine begins building new relationships and mending old ones and along the way, she and everyone around her must learn not only to forgive one another, but also themselves.I thoroughly enjoyed this book. Angela Benson has written a rich, multifaceted work of Christian Fiction that is both timely and realistic. The characters create the pulse of the story, and they are well balanced...not the \"perfect people\" often seen in this genre. As a result, I was able to relate to and understand the characters, and I found the plot engrossing. THE AMEN SISTERS touches on things that are often pushed under the rug in the church, such as unscrupulous ministers and church members, and \"holier than thou\" Christians who are fiercely judgmental and look down on others. In addition, the book addresses social issues such as teen pregnancy and parenthood, marriage and fidelity, and even the current challenges many small business owners face. Most importantly, the book highlights God's power to transform lives and the importance of forgiveness.Reviewed by Stacey Seayof The RAWSISTAZ Reviewers",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "THE AMEN SISTERS by Angela Benson is a story about an abuse that apparently has been kept secret for too long -- pastors who misuse their power and sexually abuse women in their congregation. Benson's novel offers insight into this hush-hush world and the lengths that women and pastors go through to keep these secrets. By offering several points of view on this issue from the betrayed women, THE AMEN SISTERS brings to life the fact that pastors are men, fallible and vulnerable, and not the gods that worshippers sometimes mistake them to be. The only points of view missing are those of the pastors, which would have made this a more in-depth read. However, the relationship between the two sisters, Francine and Dawn, and their relationships with the two men in their lives, Stuart and Sylvester, takes the story to a slightly higher level. THE AMEN SISTERS is an engaging, refreshing story of reaffirming love and faith packed with the drama that comes with church-life and the mortals who sometimes confuse the difference between God and man. Like the sexual abuse of children by priests, the sexual abuse of women by pastors must be confronted. So let the church say AMEN and more!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Angela Benson, one of the brightest voices in Christian fiction brings us her third and most daring novel to date.The Amen Sisters opens with Francine Amen who finds herself confined to a mental institution after suffering a nervous breakdown brought on by the suicide of her best friend, Toni. Francine Amen was a ministry leader with an up-and-coming church who believed she had found her true calling. She publicly renounced her family, friends and church because she felt they didn't believe \"enough\" and left her hometown leaving behind a lot of hurt and spiritually wounded friends and family members. Guilt ridden and ashamed, Francine turns to the one person who should always be there - her sister.Dawn Amen-Ray sticks by her sister, Francine, because she feels it is the right thing to do. Still, Dawn has problems of her own. She recently found out that her husband (Francine's ex-boyfriend) Sly cheated on her. Although Dawn still loves her husband, she is not sure if she can forgive and continue in her marriage.With Biblical insight and compassion, Angela Benson brings us more than just another novel about a minister going astray. This is a novel with real people who confront real issues. It's about forgiving others and ourselves.Happy reading![...]",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Angela Benson, author of The Amen Sisters, tackles a seldom-acknowledged problem in the church -- that of the clergy taking sexual advantage of parishioners. And she does it with care and concern but also with a no-nonsense attitude. It's wrong and she says it's wrong. I like that about this author.Toni confesses to her friend Francine Amen that she's had an affair with Bishop Payne for several months and is pregnant with his child. Francine doesn't believe Toni and responds in a harsh and judgmental manner. It seems exceptionally harsh when Francine tells her that the Bishop, who is married and has children, has accused Toni of chasing him. Following Francine's strong statements, Toni commits suicide.Francine is devastated by the death of her friend. When Toni's brother accuses Francine of murdering Toni, Francine experiences an emotional breakdown. After several months of hospitalization, Francine decides to 'get her life in order' by returning home to Georgia. Francine left her home five years earlier and hasn't spoken to her sister Dawn Amen-Ray since then.Dawn has invited Francine home but is uncomfortable since Sly, her husband of four years, used to date Francine. She's not sure how things will be with the two of them together again. And Dawn is especially concerned since her husband has committed his own sins.Francine returns home to learn some interesting things about Toni's brother George, the sins of other members of the clergy and herself. Perhaps if Francine is able to let go of her desire for vengeance and will listen to God, things just might work out.Armchair Interviews says: Benson writes a powerful and compelling novel with characters you will either care deeply about or want to see fall fast and hard.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "When Francine Amen does not respond to a friend's cry for help, the effects are devastating for the two of them. Months later after a hospital stay, with a heart still heavy with guilt, Francine moves in with fraternal twin sister Dawn and her husband Sylvester. The sisters' efforts to forge a closer sibling relationship is made more complicated by Francine's past relationship with Dawn's husband; especially since Dawn is already wrestling with resentment toward Sylvester because of his recent affair. It is amid this backdrop that sexual abuse inside the church is revealed in Angela Benson's newest release, The Amen Sisters. Benson effectively peels back the layers of secrecy surrounding this issue, ultimately disclosing its pervasiveness within the church structure. This story should be a requisite read for Christians, as it serves as a powerful wake-up call regarding transgression and the ministry. In The Amen Sisters, Benson reminds that church personnel are not immune from committing sins plaguing the secular world, prompting Christians to find refuge in God and His word, and not man.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book covered several different areas that one can relate to in everyday life. I like the fact that the author kept each situation real. I enjoyed reading about the marriages that were able to mend back together despite the break of trust. I think the lesson throughout the whole book was forgiveness, trusting and believing that God will work it out. I think some many people in the story relied on what they thought was right but in the end they all had to rely on God to heal, forgive, and mend back together. This was my first read by this author and the author did a great job with this book. I look forward to reading other books by this author.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Francine Amen thought she found her true calling when she became a ministry leader with an up-and-coming church. She publicly denounced everyone who she thought didn't believe in God enough, including her former church, family and friends. Francine even left her hometown and boyfriend to join this traveling ministry. When Francine's close friend Toni told her that the pastor is sexually abusing her, she turns her back on her. When Toni commits suicide, Francine feels responsible. Francine comes back home to live with her sister Dawn Amen-Ray. She now has to face the same people she shunned before, including Toni's family. Dawn is glad her sister is returning home but the timing couldn't be more wrong. Dawn just found out her husband Sly had an affair. Will she be able to forgive him? Sly is dealing with his past mistake and trying to keep the family funeral home business from being bought out.The Amen Sisters is a remarkable novel by Angela Benson. Benson masterfully tackles an often taboo subject: Pastors preying upon women parishioners. This novel not only shows what happens when these women try to come forward with their stories, but also shows the lack of support the church gives these women. The pastors are forgiven and the women are not. Francine and Dawn are the central characters of this story but there are also excellent supporting characters. Angela Benson showed great creativity when including the funeral home business into the novel. The Amen Sisters is an engaging, powerful Christian novel that will leave you saying amen.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The Amen Sisters a novel by Angela Benson is a wonderful story of faith, betrayal, and trust. Benson leads you through the lives of two sisters set in the south among a heartwarming collection of Christian family and friends. Francine Amen is apprehensive about going home again after her best friends' suicide. She feels responsible for it, and can't shake the guilt as she faces the grieving family. Dawn Amen-Ray brings her sister into her home after the ordeal, but she has a secret she doesn't want her sister - or anyone else - to find out! This book also boldly confronts the abuse of power by some who are in leadership roles in the Church. It challenges us all to open our eyes as Christians, and confront such issues, both in church and our homes, in the steps laid out for us in the Bible.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "catholic high school entrance examinations catholic high school entrance examinations 10th ed",
        "description": "Catholic High School Entrance Exams is a comprehensive guide that provides expert advice, practical tips, and a lot of practice, giving eighth graders the study tools and reassurance they need to achieve a high score on their Catholic high school entrance exam. Included in Catholic High School Entrance Exams: * 6 full-length practice tests-2 for each exam commonly administered-the Cooperative Entrance Examination (COOP), the High School Placement Test (HSPT), and Test for Admission into Catholic High Schools (TACHS) * Plus 3 diagnostic quizzes: 1 for each exam, with targeted feedback * Targeted review of key concepts and material found on tests with practice quizzes * Up-to-date test information * For Parents: tips to help your child maintain realistic expectations while studying for the exam Catholic High School Entrance Exams provides students the essentials they need to improve their scores-guaranteed. Kaplan's Higher Score guarantee provides security that no other test prep guide on the market can match.",
        "authors": "['Kaplan']",
        "infoLink": "https://play.google.com/store/books/details?id=MDwTCwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "If you're getting ready to take the COOP or HSTP exams this is a great book to study. It has detailed information and strategys for all the parts of the exams which will help you alot. It has two sample exams for the COOP and HSTP with detailed explanations for each answer (but after I took the HSTP I found that the sample exams were much harder than the real thing). Another good thing about this book is that it doesn't have too many mistakes, like some other of these books, making it very easy to understand.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Although this book is very educational in some areas, it lacks difficulty in others. This book has helped my cousins, sisters, and mom. Overall, I'd say that thi sbook is well-written and has helped many people.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "separation of church and state",
        "description": "In a powerful challenge to conventional wisdom, Philip Hamburger argues that the separation of church and state has no historical foundation in the First Amendment. The detailed evidence assembled here shows that eighteenth-century Americans almost never invoked this principle. Although Thomas Jefferson and others retrospectively claimed that the First Amendment separated church and state, separation became part of American constitutional law only much later. Hamburger shows that separation became a constitutional freedom largely through fear and prejudice. Jefferson supported separation out of hostility to the Federalist clergy of New England. Nativist Protestants (ranging from nineteenth-century Know Nothings to twentieth-century members of the K.K.K.) adopted the principle of separation to restrict the role of Catholics in public life. Gradually, these Protestants were joined by theologically liberal, anti-Christian secularists, who hoped that separation would limit Christianity and all other distinct religions. Eventually, a wide range of men and women called for separation. Almost all of these Americans feared ecclesiastical authority, particularly that of the Catholic Church, and, in response to their fears, they increasingly perceived religious liberty to require a separation of church from state. American religious liberty was thus redefined and even transformed. In the process, the First Amendment was often used as an instrument of intolerance and discrimination.",
        "authors": "['Philip HAMBURGER']",
        "infoLink": "https://play.google.com/store/books/details?id=q6Axd76IE1UC&source=gbs_api",
        "review": [
            {
                "review/text": "Philip Hamburger, John P. Wilson Professor of Law at the University of Chicago, has written a meticulously researched account of how the American concept of religious freedom was transformed into the concept of separation of church and state. His central thesis is that this development had very little to do with the constitution itself or even with the late 18th century concept of religious liberty, but was very much a result of fear of ecclesiastical authority and anti-Catholic, or at times anti-Christian prejudice. Hamburger claims, &quot;the federal and state constitutional provisions designed to protect religious liberty have, ironically, come to be understood in terms of an idea that substantially reduces this freedom.&quot;Hamburger begins by tracing the origins of religious freedom in America to the European Continental Anabaptists of the 16th century and the English Baptists of the 17th century who &quot;made arguments about the freedom of conscience.&quot; He also discusses the importance of 17th century religious dissenters and Enlightenment philosophers - such as Locke and Milton - and how they &quot;generalized these ideas into conceptions of religious freedom eventually employed by most American dissenters.&quot; Hamburger presents the reader with a firm basis in what exactly was meant by religious freedom in colonial and revolutionary America, its relation to the various amendments to state constitutions, and the ideological context for the introduction of the First Amendment to our federal Constitution. He is quite explicit that separation of church and state was not a part of any of these developments and that, on the contrary, separation was rather more of a stigma applied to antiestablishment advocates in order to discredit them. These critics of religious establishment were quick to refute the allegation that they were proponents of separation.Hamburger makes the argument that the separation of church and state first became an idea during the election of 1800's when the Federalist clergy were using their influence to oppose the election of Jefferson and the Republicans. But separation was used in this context only to oppose the perceived, or real union between ecclesiastical and political authority to undermine the Republicans. A fair amount of detail is given to Jefferson's now famous letter to the Danbury Baptist Association. Hamburger is quite explicit in his claim that the Baptists wanted no part of Jefferson's view concerning a &quot;wall of separation between church and state.&quot;Hamburger then deals with the rise of 'nativist' sentiments among Protestant Americans and the development of a new concept of religious freedom that would eventually become the modern concept of separation of church and state. He claims that the nativist Protestants, fearful of the Catholicism of ever increasing immigrants from Southern Europe, adopted separation as an 'American' ideal. These Protestants believed that the exclusive nature of Catholicism, along with its clear endorsement of the union between church and state, posed a clear danger to American liberty. Hamburger asserts that the nativists united into powerful political organizations in order to further the cause of separation and to undermine the political power of Catholics. Later, during the late 19th century and up until the present, secularists likewise created organizations in order to further a purely secular interpretation of separation, one that was anti-Christian in focus. Hamburger demonstrates that each of these movements was ultimately driven by forces opposed to the free exercise of religion by minority (or majority in the case of the secularists) religious groups. Both the Protestants and the secularists, realizing that separation was not guaranteed by the Constitution, lobbied for an amendment guaranteeing separation. After failing to secure passage of such an amendment they endeavored successfully to have their aims realized by judicial interpretation. He carries through with this theme for the remainder of the book, culminating in the famous Everson case where the Supreme Court fully incorporated the Establishment Clause of the First Amendment, as interpreted by the concept of separation between church and state.",
                "review/helpfulness": "87/92",
                "num_reviews": 92
            },
            {
                "review/text": "Constitutional legal scholar Philip Hamburger, formerly a professor of law at the University of Chicago and currently professor of law at Columbia Law School, argues in \"Separation of Church and State\" that America's modern conception of the First Amendment's Establishment Clause has failed to make an adequate distinction between the establishment of religion, which the founders intended to prohibit, and the \"separation of church and state,\" a later development that was almost never cited by eighteenth century Americans. Hamburger offers both academic and non-academic readers alike a thoroughly researched and engaging presentation of the history of the Establishment Clause and how it came to be misapplied to the detriment of religion in the American public square.How did the nation depart from a Constitution that guaranteed religious liberty to erect a \"wall of separation between church and state\"? Hamburger traces the problem to Thomas Jefferson, who in 1802 in his Letter to the Danbury Baptist Association reflected on \"that act of the whole American people which declared that their legislature should `make no law respecting an establishment of religion, or prohibiting the free exercise thereof,' thus building a wall of separation between Church & State.'\" Jefferson's phrase would later be adopted by the Supreme Court. Justice Black, writing for the majority of the Supreme Court in Everson v. Board of Education of Ewing (1947), adopted Jefferson's separation of church and state and made it \"the foundation of subsequent establishment clause jurisprudence.\" Five years later, Justice Douglas in Zorach v. Clauson (1952), affirmed Black's basic principle but expressed concern over the extent to which its implications could be taken. Although the separation of church and state must be complete, the First Amendment did \"not say that in every and all respects there shall be a separation of Church and State,\" for if this were the case, municipalities would even be prohibited from providing police services to churches or other religious groups.Yet things would soon change. Within the context of private, religious schools, Chief Justice Burger writing for the majority in Lemon v. Kurtzman (1971), held that statutes could only provide funding for religious schools when the following elements were met: \"First, the statute must have a secular legislative purpose; second, its principal or primary effect must be one that neither advances nor inhibits religion ... finally, the statute must not foster `an excessive government entanglement with religion.'\" Applying these elements, the Court struck down a Pennsylvania and Rhode Island statutes that provided aid to non-public schools, including church-related schools. The Court would go further, excluding religion in public schools in Wallace v. Jaffree (1985) (Stevens, J.), nativity scenes in Allegheny County v. Greater Pittsburgh ACLU (1989) (Blackmun, J.), and prayer at a graduation ceremony in Lee v. Weisman (1992) (Kennedy, J.). Throughout this chaos, the dissents of Justices Rehnquist and Scalia often fell on deaf ears. As Rehnquist articulated in Wallace, the separation standard lacked historical support and \"proved all but useless as a guide to sound constitutional adjudication.\"Hamburger concludes by highlighting the fact that the original opponents of the government establishment of religion did not demand a complete separation between church and state; although they opposed governmental financial benefits to established churches, they typically did not reject the conventional view that \"there was a necessary and valuable moral connection between religion and government.\" Today, however, the opponents of establishment have taken us to a different place, where the mere hint of government endorsement of religion is viewed as contrary to the constitution. The nation thus finds itself in a place where the very religious liberty that the U.S. Constitution was designed to protect has instead become undermined.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "Separation of Church and StateThe author, Philip Hamburger, offers a well balanced presentation of how sixteen words of the First Amendment of the Constitution of the United States can be deliberately misconstrued for purposes that its writers never intended and how ten words written by Thomas Jefferson in a letter could become a substitute for those sixteen. Take the words themselves \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof...\". Now, put them next to \"...thus building a wall of separation between Church and State\". It is no less than amazing how this transformation could have happened. As the saying goes, \"Throw enough mud against a wall, some will stick\". Of course if there never was a wall, if one throws enough mud, it will make its own wall!We are all children of our own culture. When we hear things repeated again and again by people we love and respect, we will seldom question their veracity. Ideas get passed on from generaton to generation. They may change, but they do so slowly and the change is seldom noticed until the idea is totally transformed. That is what happened to our understanding as Americans of this part of the First Amendment. Going back to the beginning, as Hamburger does, makes a huge difference in our understanding.The book is great reading. Maybe it should be compulsory reading by all of our judges, especially those on the Supreme Court.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "brides in the desert",
        "description": "The Beguine movement arose in Europe during the thirteenth century and consisted of women living together in chastity and poverty, doing works of Christian charity. Although many of their number were wealthy, this urban phenomenon had no founder, no single rule, and no agreed way of life. The Beguine movement was part of a yearning to democratize religion, and it produced four great writers.Saskia Murk-Jansen, a specialist in medieval women's mysticism, looks at the lives and works of Beatrijs of Nazareth, Mechtild of Magdeburg, Hadewijch, and Marguerite Porete. These mystics used images, metaphor, and paradox to express the numinous aspect of God. They pioneered vernacular literature and forged theological visions out of their own experience. Their writings provide an invaluable supplement to the work of their male contemporaries.Saskia Murk-Jansen probes the key images in Beguine spirituality including the soul as the bride of God, suffering as an integral part of a relationship with the Holy One, and the desert as a place to focus on the transcendent. In this excellent, balanced treatment, Murk-Jansen clearly outlines the development of the movement, pointing to its influence as well as its repression by church authorities.",
        "authors": "['Saskia Murk-Jansen', 'Philip Sheldrake']",
        "infoLink": "http://books.google.nl/books?id=FtvOygAACAAJ&dq=Brides+in+the+Desert&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Great details of this 12th century womens movement and its significance, to the Catholic Church and to all people called by spirituality today. Beguines led a religious life that was flexible with one foot in both worlds. The mystics that arose out of the movement were unparalleled (Hadewijch of the Brabant, Mechtild of Magdeburg, Beatriz of Nazareth et al.). Their lives still speak volumes in the beguinages (cities of peace) that are kept alive throughout Belgium and Amsterdam. Their main contributions to the Catholic church were devotion to the Sacred Heart, devotion to the Eucharist and frequent recpetion via institution of the feast of Corpus Christi, the pieta which was a statue originating among the beautiful Flemish artwork found in their awesomely beautiful (church) chapels. The women worked for the poor and lived simple lives (w/o the vow of poverty) and were free to leave at any time. In their spirituality they developed negative theology (finding God where he is \"not\"), emphasis on the divine origin of the soul and other gnostic aspects that do not cross the fine line from an interactive God into a manipulated God. Marguerite Porete excepted. The vernacular books they wrote were influential among more famous male mystics (Eckhart & Ruysbeck) & are as relevant today as they were then. Great women, great achievements with a tradition that is still alive (...).\"Church suppression\" was temporary and limited; did not take effect in countries who valued their holy women.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "As a scholar of the beguines, I have become very familiar with the historiography on them. This book is not well researched and it lacks the sophistication necessary to give a satisfactory account of this group of women.If you want something more informative, try Walter Simons' City of Ladies or Amy Hollywood's books.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "when women were priests womens leadership in the early church and the scandal of their subordination in the rise of christianity",
        "description": "Vital to the current debate about women and the church, this landmark book discloses clearly for the first time that women played prominent leadership roles in Jesus' own ministry and in the early church--as prophets, heads of churches, and teachers. Torjensen shows that the real reasons for women's subordination in Christianity have been social and secular and represent a betrayal of Jesus' teaching. Illustrations.",
        "authors": "['Karen Jo Torjesen']",
        "infoLink": "http://books.google.com/books?id=X7TYAAAAMAAJ&dq=When+Women+Were+Priests:+Women%27s+Leadership+in+the+Early+Church+and+the+Scandal+of+Their+Subordination+in+the+Rise+of+Christianity&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Karen Jo Torjesen's book, 'When Women Were Priests' examines the subject of women in the early Christian movement, and particularly the role of women in the leadership positions in the church. Torjesen, a leading expert on women in ancient Christianity, is on faculty at Claremont Graduate School.As women have attained rights to ordination in various denominations (Anglican, Methodist, Lutheran, Presbyterian, Baptist) and even other religions (the first woman to be ordained a rabbi in the United States took place in 1972), increasingly scholars have come to re-examine the role of women in the early church, and have been arguing with mounting evidence and persuasiveness that this is not a new phenomenon, but rather a recapturing of women's roles that have periodically existed in both Jewish and Christian communities.The question of the gender of a priest (the requirement by Roman Catholics, as in the Vatican's 1976 Declaration on the Question of Admitting Women to the Priesthood that priests be in the bodily image of Christ, for example) brings into question sexuality and the common perception of women by society. When Barbara Harris was consecrated at the first female bishop in the Episcopal Church (USA) in 1989, Time magazine made a reference to her red nail polish--as if this has anything to do with her qualifications; but of course, it has everything to do with the way people perceive the issue.Torjesen examines multiple sources of ancient data to show evidence that women were preachers, prophets, pastors and patrons in the early Christian movement. Some of these can be found in the Bible itself. The tradition of women as prophets actually dates back to Jewish times: Deborah was a judge, and Miriam, the sister of Moses, is described as a prophet in one of the oldest parts of the Torah, the song of Miriam (in Exodus). Various art works depict women in liturgical stances or settings, behind a table (presumably presiding) or with arms outstretched in liturgical praise fashion. Of course, one gospel account speaks of Mary Magdalene being the first person to see the risen Christ, and being charged to tell the others of the miracle, hence becoming 'Apostle to the Apostles'. Indeed, the non-canonical Gospel of Thomas and Gospel of Mary each show a rivalry between Mary and Peter for pre-eminence among the apostles, with Jesus coming down on Mary's side.Various Pauline letters another other extra-testamentary writings show a strong female presence among the leaders of communities and house-churches--Junia is hailed by Paul as 'foremost of the apostles' (Romans 16:7); synagogue and grave archaeology have turned up inscriptions such as Sophia of Gortyn, elder and head of the synagogue of Kisamos lies here. Where Christians emulated the synagogue style of worship and organisation, naturally women's leadership would have been carried over too. Of course, in house-church traditions the role of women's leadership is understood, as women's dominance of household affairs is well-known and documented throughout the Roman Empire at the time of Christianity's first expansions. Indeed, one second-century critic of Christianity, Celsus, dismissed it as 'a woman's movement'.Torjesen's better chapters are the early ones which talk about history and evidence; her later chapters on theology, biology (?) and society are interesting, but less valuable from a critical-scholarship standpoint. Each section, however, is generously documented with notes and sources, and the book would be valuable if only for the extensive notations. Happily, this book is much more than that--clear and energetic in writing, controversial but well-explained and well-defended, Torjesen makes her case well and adds valuable material for the defensive of women's leadership in churches today, and much for those who maintain more traditional mores to think about. In essence, if one can't refute the arguments here (and I am not saying they cannot be refuted--merely that they must be engaged, not dismissed), one must examine the basis for holding the exclusive-male-leadership belief.",
                "review/helpfulness": "84/90",
                "num_reviews": 90
            },
            {
                "review/text": "When reading a book about a controversial topic, one expects to find an assortment of outcomes: excitement for the intellect, challenges against tradition, and/or offensive ideas. The anticipation for effects such as these inspires one to take the time to read a book about said controversy. An accomplished book presents a good argument for a side, or perhaps several sides, of an issue through quality organization, respect for the reader's intelligence, and thorough explanations of conclusions made. Accord with the contention presented bears no importance upon the caliber of the treatise itself. Such an exceptional work promotes further intellectual contemplation and discussion about the issue at hand. In her book, Torjesen seduces the reader into believing her publication is such a text. The introduction leads one to believe the work will qualify as an accomplished book; the actual discourse, however, ultimately fails to live up to the expectations formed through the introduction.Threaded within the introduction to historical findings and theories such as recent evidence of women's prominent roles in Christian churches from the first to thirteenth centuries, the history and current condition of women's ordination marks this text as one with possible insight into this controversy. The book itself attempts to help the reader understand why and how women were pushed out of leadership roles they once held. Torjesen has four major sections, as reflected in the introduction, to her argument that the \"...patriarchal norms of the Greco-Roman gender system...\" influenced the eventual elimination of prominent roles for women in the church. (269) Her first section introduces the reader to the evidence and the logistics of women in roles such as deacons, patrons, priests, prophets, and even bishops. She provides evidence from art, inscriptions, and literature to counter those who previously claimed no evidence existed showing women exercising leadership roles in the church community. Torjesen also explains how the authority of women in the household, the place where early Christians first met, prepared them for leadership in the church.The next segment of her position places the precedent of women in leadership roles into context: the culture and ideology of the Greco-Roman world. She elaborates on the public versus private concept previously touched upon (man associated with public world,woman with private) and the virtues associated with women.In the third section of her argument, Torjesen shows how the Greco-Roman world, consisting of two separate domains, influenced the lack of female leadership in Christianity when the church became \"increasingly institutionalized during the third and fourth centuries.\" (7) The fourth, and final section of Torjesen's argument illustrates precisely how the Greco-Roman ideology affects Christian thought. The last chapter of Torjesen's book does not provide explanations or examples of how the Greco-Roman world's influence on the early Christian church marginalized women. Instead, it offers a look at examples of a dubious culture before ancient Greece and a tradition that is part of the Christian heritage that did not marginalize the female gender. While these five sections posses quality structure, Torjesen's book lacks respect for the reader's intelligence. One problem which appears throughout the book is Torjesen's tendency to jump to a conclusion without acknowledging other options or giving complete detail on how she reached that conclusion. For example, Torjesen uses a passage from the second-century Gospel of Mary to indicate tensions between the reality of woman's leadership in the early church and the Greco-Roman ideology about gender roles. In the passage, Mary teaches the disciples lessons taught to her by Jesus. Peter challenges Mary's teachings, saying, among other things,\"`Did he prefer her to us.'\" (36) When interpreting this line, Torjesen reads `her' as `a woman.' Peter's having difficulty with a woman preaching, she concludes, indicates the tension between women's leadership and the culture in which it existed. While this interpretation is a valid one, it is not the only one. Only the twelve disciples received the \"secret of the kingdom\" (Mark 4:11), so why should Mary have a special insight they do not? Torjesen does not provide any reason as to why that interpretation could not be a correct one and so she appears to have come to a hasty conclusion. Had Torjesen respected her reader's intelligence, she would have included the refutation.Along with a lack of a rebuttal to opposing interpretations, the lack of primary sources in certain parts of the book create more doubt in Torjesen's arguments. In the last chapter of her book, she discusses female images of God. One such image is Sophia, divine wisdom. According to Torjesen, Jesus is an incarnation of Sophia. Sometimes he is portrayed as divine wisdom herself speaking and doing her works. The only primary sources Torjesen provides for reference are the Gospel of Matthew and the Gospel of John. She mentions that to Matthew, Jesus is \"Sophia incarnate,\" though offers no actual reference to support this claim. She also asserts that the first chapter of the Gospel of John is adapted from a hymn of Sophia, offering John 1:1 for reference, but not the actual hymn. This lack of primary sources makes the reader rely on Torjesen's interpretations of the texts from which her claims are based.While Torjesen's book exhibits a well-organized argument, the way in which she reasons her argument lessens the impact of her thesis. Her thought-provoking contention - the Greco-Roman gender system, being found extrinsic to Christianity, must be rejected, leading to the restoration of what it destroyed: women in leadership roles within the church - lacks the necessary supporting arguments to withstand critical attacks. Torjesen presents the reader with a thesis that could easily shake up traditional understanding of women's roles. Because of her lack of respect for her reader's intelligence and her lack of thorough explanations and references in certain critical points in her argument, When Women Were Priests falls short of being the great book on the subject of the historical basis for women's ordination in the modern church it hints at in the introduction.",
                "review/helpfulness": "67/87",
                "num_reviews": 87
            },
            {
                "review/text": "Contrary to what another reviewer has said, women were leaders in the early church. Stating this fact is not a revision to be in line with social norms, in fact, it flies in the face of what most mainline Christians seem to want to believe. The reason he has never read about some \"movement\" in the early church to have women leaders is that no movement was necessary, since women were leaders from the beginning of Christianity until the religion was changed to fit Roman norms. This book only suggests that we change it back to the way it was in the first few centuries. This is not revisionist, it is reconstructionist. If people do not think women should have any voice, power, or leadership under Christianity, then they are practicing the Roman version, not the true egalitarian religion that Christianity started out as. Before Rome institutionalized Christianity, the Christians stood in opposition to the Roman social norms. Then Constantine co-opted the religion and the Romans gradually adapted Christianity to fit their society. The mainline Christianity of today reflects this Hellenization of the original religion. Our society is comfortable with this less-than-healthy corruption of Jesus' teachings because our society suffers some of the same social ills as ancient Rome. This book suggests a restoration of Christianity that is healthier and more true than the Constantinian version. Another, better known book that also deals with this subject matter is In Memory of Her by Elisabeth Schussler Fiorenza. If you find When Women Were Preists to be too unclear or unacademic, Schussler Fiorenza's book should be more satisfying as it is very academic.",
                "review/helpfulness": "47/58",
                "num_reviews": 58
            },
            {
                "review/text": "I must admit that I expected this to be an exhaustive work providing evidence for when women were priests, as the title suggests. However, while the subject is certainly touched upon, the book focuses much more on the socio-political environment of the developing Christian movement, including the Jesus movement, in relation to women, and how this environment shaped Christianity's general beliefs about women's roles. While I would have liked to see the title developed more throughout the book, it is still certainly a work worth the read. Torjensen's skill of examining the greco-roman cultural (and philosophy) and how it influenced Christianity is quite insightful. While this observation is certainly nothing new, Torjesen conducts a thorough investigation. Her scholarship is quite good and this work is sure to be a classic in feminist theological resources. Her writing style flows well and, rather than facing doom and gloom in the end, one feels a certain inspiration to move forward and reclaim the message of Jesus that was so highly regarded in the early Jesus movement, which is anything but what Christianity has become in (generally) the present-day organized form of the church. If you are interested in understanding more of &quot;why&quot; women have been so oppressed in Christianity, this is an excellent historical source. I highly recommend this work!",
                "review/helpfulness": "40/46",
                "num_reviews": 46
            },
            {
                "review/text": "Karen Jo Torjesen is a Professor of Women's Studies at the Claremont Graduate School. She has also written 'Hermeneutical Procedure and Theological Structure in Origen's Exegesis.'She states in the Introduction to this 1993 book, \"Understanding why and how women, once leaders in the Jesus movement and in the early church, were marginalized and scapegoated as Christianity became the state religion is crucial if women are to regain their rightful, equal place in the church today. Jesus' message and practice were radically egalitarian in their day and constituted a social revolution that likely provoked his crucifixion. It is high time that the church, which claims to embody his good news to the world, stop betraying its own essential heritage of absolute equality.\"Here are some representative quotations from the book:\"The church at Philippi was not only founded by a woman, but its leadership continued in the hands of women.\" (Pg. 16)\"This is not to say that the early Christian house churches are to be equated with households; the membership of a house church included persons not in residence in the household, nor were the relationships within the Christian community initially modeled after the hierarchical relationships of the patriarchal household.\" (Pg. 126)\"By remaining in the private sphere and maintaining relative secrecy about membership and meeting places, it was possible to keep the persecutions of the first two centuries from sweeping them away entirely. In this way they also managed to maintain the acceptability of women leaders in the churches.\" (Pg. 128)Tertullian \"made the Christian woman responsible for male sexuality: A Christian woman was not chaste unless she had no impact on male sexuality. Tertullian pressed this strange point so far as to say that a beautiful woman ought to obscure her beauty.\" (Pg. 171)\"In 1139 Pope Innocent III laid the legal groundwork for persecuting wives of priests in a decree that declared all marriages after ordination invalid. Overnight, women who had been legal wives were now labeled concubines, whores, or adulteresses.\" (Pg. 226)She concludes on the note, \"It is crucial to acknowledge at long last that women were and can be Christian leaders, that there is nothing debased about being female or sexual... Christian churches need to return to their own authentic heritage, reject the patriarchal norms of the Greco-Roman gender system, and restore women to equal partnership in the leadership of the church and participation in Christian life.\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "While I think that the reviews that are more critical of this book make a lot of good points, I'm going to give the book 5 stars because:-It's a terribly interesting, easy read for a book about history and theology-It's scholarly, with lots of interesting insights and TONS of citations, which are great if you want to read more on this topicAs far as the strength of the author's argument goes, I think that she does indeed stretch the boundaries of what would be considered a valid authoritative source in Christianity, but part of the author's entire argument is that a deep misogyny underlies our understanding of women in Christianity, from manipulation of the Bible to Augustine's writings, etc.I'm not an expert on these topics, but I feel like I learned a lot while reading this book and I enjoyed it all the while. I don't think that you have to consider a book perfect or agree with every single one of its points to consider it a great read, and I definitely thought this book was a great read and I'd read it again.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a world of our own",
        "description": "Tracing the history of intercultural struggle and cooperation in the citrus belt of Greater Los Angeles, Matt Garcia explores the social and cultural forces that helped make the city the expansive and diverse metropolis that it is today. As the citrus-growing regions of the San Gabriel and Pomona Valleys in eastern Los Angeles County expanded during the early twentieth century, the agricultural industry there developed along segregated lines, primarily between white landowners and Mexican and Asian laborers. Initially, these communities were sharply divided. But Los Angeles, unlike other agricultural regions, saw important opportunities for intercultural exchange develop around the arts and within multiethnic community groups. Whether fostered in such informal settings as dance halls and theaters or in such formal organizations as the Intercultural Council of Claremont or the Southern California Unity Leagues, these interethnic encounters formed the basis for political cooperation to address labor discrimination and solve problems of residential and educational segregation. Though intercultural collaborations were not always successful, Garcia argues that they constitute an important chapter not only in Southern California's social and cultural development but also in the larger history of American race relations.",
        "authors": "['Matt Garcia']",
        "infoLink": "https://play.google.com/store/books/details?id=NELcVmnIiEQC&source=gbs_api",
        "review": [
            {
                "review/text": "The surprise about this book is the number of quotes from women artists themselves, not just from the l9th and 20th century, but from earlier centuries too. In the l6th century Sophonisba Anguissola's father thanks Michaelangelo for helping improve his daughter's drawing. In the l7th century, Artemisia Gentileschi says &quot;I will show my lord, what a woman artist can do.&quot; In the l8th century, Elisabeth Vigee-Lebrun recalls her technique for making the most of the looks of the women she painted. The author shows how for 500 years women have made up a sigificant minority of the community of working artists. The book is lavishly illustrated with rarely seen images of women artists at work and of the paintings and sculptures they produced. This book would make a wonderful present!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "The New York reviewer makes a good point but it's not ALL quotes.The book is also pretty informative about the career options open to women in the past and how they made use of them. The author takes a level-headed view and makes you feel admiring of the way women have been getting on with the job of being artists for hundreds of years. There's some stimulating pages at the end about the role of feminism as well.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "audel questions and answers for electricians examinations audel technical trades series",
        "description": "An essential resource for passing electrician's examinations To pass your state and local licensing exams, you need knowledge and confidence. This comprehensive review guide gives you plenty of both. It's packed with sample questions to help you focus your efforts, review material on all aspects of the 2011 National Electrical Code (NEC), the lowdown on business competency requirements, and tips for studying and test-taking that will help you conquer anxiety ahead. Learn the definitions, specifications, and regulations of the 2011 NEC Acquire test-taking skills with examples of questions and answers that are similar to the ones on the license tests Brush up on taxes, unemployment, workers compensation, OSHA, lien laws, and other aspects of the business competency exam Boost your confidence with studying and test-taking tips A reliable and trusted resource for many decades, this newest edition delivers all of the vital content electricians need to made the grade and advance their careers.",
        "authors": "['Paul Rosenberg']",
        "infoLink": "http://books.google.com/books?id=cD3ENAEACAAJ&dq=Audel+Questions+and+Answers+for+Electrician%27s+Examinations+(Audel+Technical+Trades+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is very informative on a wide variety of subjects in the Electrical Trade.It has helped me in the preparation of numerous exams and interviews.The drawings are well detailed.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "Perfect for journeyman test prep, and excellent for multi-craft exams. A companion to the NEC and Tom Henry books.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am currently in school to advance my knowledge in the electrical field and this book has been an asset.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "emtb national standard review selftest 2nd edition",
        "description": "This text is designed to assist the EMT-Basic in preparing for any written exam.",
        "authors": "['Charly D. Miller', 'David White', 'United States. National Highway Traffic Safety Administration']",
        "infoLink": "http://books.google.com/books?id=nR4NAQAAMAAJ&dq=EMT-B+National+Standard+Review+Self-Test+(2nd+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I recently used this book to prepare for the EMT-B National Board exam. Although the book is a very good review, especially of the Brady book, the typical questions of the book were not at all similar to those found in the current exam. I found the average exam's questions much harder, and they usually had only one obvious &quot;wrong&quot; answer. The book presents questions with 5 possible answers (vs. the exam's 4) and 3 are usually obviously wrong. Again, a good review, but not necessarily a good preparation for the EMT-B exam.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book was a great deal of help for me and a few of my classmates during our EMT-B class. We would get together and go over the case studies that were in the book, as well as going over the test questions. We all scored well on out state boards and are now all practicing EMT-B's on a volunteer rescue squad.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I bought this study guide after one of my instructors recommended it and used it as my main study guide. I took my NR yesterday. Ouch. The NR is NOTHING like the questions in this review self-test guide. The NR contains a LOT of scenarios, and many of the questions do not represent an &quot;obvious&quot; answer.In addition to not helping much with the actual test, this study guide has multiple INCORRECT answers. Frustrating.Save your money and just get behind your main EMT book instead!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "After going over this Review before taking my EMT-B final exam, the testing was a breeze including the practical. It made everything fall into place in doing an overall patient assessment regardless of the conditions.For the written test this is an absolute must. The study guides provided state by state are overall fairly good but leave much to be desired unless you have excellent memorization skills.Sample tests are provided in the back of the book and allow you to find out before testing what areas you may be weak or need to study on further.I strongly disagree with the other reviews that say it does not prepare you well for the National Test. For the EMT-B level it's perfect, if your going for NREMT-P it is not up to that level so for the Paramedic level you'll need to get the Paramedic book instead. For NREMT-B this is a must have for your tools list!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "from age to age how christians have celebrated the eucharist",
        "description": "Describes the development of the Christian Eucharist, from the first century to the present day, along with information on the theology of each time period and liturgical expressions, including architecture, music, books, and vessels.",
        "authors": "['Edward Foley']",
        "infoLink": "http://books.google.nl/books?id=sB7WwAEACAAJ&dq=From+Age+to+Age:+How+Christians+Have+Celebrated+the+Eucharist&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "First, this is an interesting book on an interesting subject--how the Eucharist was celebrated throughout history. It's easy to read and with tons of illustrations. The pictures alone make this book worthwhile to anyone interested in history.That said, I was surprised by the lack of discussion on the Eucharist itself and how it was regarded in the church. Apparently the author was more interested in a discussion of the vessels, the music, and the architecture.In the chapter on the first century, the author can only say, \"In this time, it is not the things--not even the bread and wine--that are important, but the community. The believers more than any single food are the body of Christ\" (p 21).Yet Paul said that those who ate the Eucharist unworthily brought death upon themselves. And here is 1 Cor \"the bread which we break, is it not the communion of the body of Christ?\"",
                "review/helpfulness": "24/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book covers the history of the liturgy and Christianity from the first century to the present day. Although this is a large time span, Foley breaks down each chapter into several concentrations. Some examples include architecture, music, vessels, and books used in worship. Each catergory is then broken down into sub-catergories that focus on specific objects, clothing, structures, and other aspects specific to the liturgies. Through the format of this book, it is easy for one (especially one who is not at all familiar with the history of the liturgy or Catholic Church) to follow it through the centruries. This is a good starting point for those that want to learn about the geographical setting, the major religious figures, and the evolution of the liturgy. For others, this book will allow one to look more deeply at the role and evolution of specific liturgical practices through the descriptive details and numerous pictures--including maps, architectural layouts, and music from each century. This is a great book for all!",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "Foley walks you through the history of Christian liturgy in several different ages, from the beginnings of Christian worship, to the height of Gothic Christianity, to the practices of today. Beginning each era with a dramatization/story from the perspective of the worshiper, Foley makes clear the point of Christian liturgy - to personally engage the worshiper in the liturgy. Each era also includes a discussion or art, architecture and music. While the book is scholarly in nature, it is certainly not only for academics and can be approached by all.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book surveys the rich history of the Western Christian worship for the last two thousand years, concentrating on the Eucharist. Here, I suggest two additions/changes.I think there is a missing area in this book that needs to be covered, that is the Eastern Christians' celebration of Eucharist. If Christian Eucharist in the East needs a separate volume, I suggest changing the title of the book to: \"From Age to Age: How Western Christians have Celebrated the Eucharist.\" It is true that the first chapter traces early Christian worship in Palestine and other parts of the East; however, immediately after that period of time, the concentration of the book is on Western Christianity.While the author is a professor at a Catholic seminary, he covered the \"Reform and Counter-Reform\" (Chapter six) in an excellent way. I was hoping for the author to also include how the Eastern Church, both Orthodox and Protestant, developed this area in all the aspects that was handled in the book, i.e., architecture, music, books, vessels and Eucharistic theology. For example, on the one hand, the architecture of the Coptic churches seems to be different from those of the churches in the West. On the other, there are some similarities among them. In addition, the architecture, music and books of the protestant churches in the East took a completely different route from those in the West in their development. (Gawdat Gabra and Gertrud J.M. van Loon, \"The Churches of Egypt,\" is an excellent book in this area, which shows the architecture of both the Orthodox and Protestant churches in Egypt). However, in these Eastern protestant churches, vessels and Eucharistic theology continued to be the same as their Western sister churches.One more area that needs some revision: It is worth noticing that the author indicates under the architecture of \"Home\" (see p. 8) that during the first century there were some multistory apartment buildings (Illustration 8). It seems that this may be the case in Europe during that period of time or a couple of centuries after. However, in the Middle East, especially in Palestine, during the first two centuries (C.E.) the multistory buildings were not known. In addition, the floor plan of the homes of the wealthy was completely different, yet still a single floor home (e.g., see Kenneth E. Bailey, Jesus Through Middle Eastern Eyes, p. 29, 33). I personally saw similar village homes when I used to live in the Middle East. Some of these homes include an additional room on the roof mainly for guests. So, this upstairs room (sometimes called the roof room) was only a single room, not a whole second story apartment. That room was a little larger than the downstairs rooms and had nicer furniture. This may explain the idea of having the Upper Room, where Jesus ate his last meal with his disciples (Matt. 26:26-29 and parallels).In brief, this is a wonderful book that really serves its purpose. I wish to make it available to a wider audience, especially in low churches, to help them see the wonderful heritage of Christianity and the rich rituals we had.Adel Malek",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Foley did this new edition following the original by 16 years to \"enhance the scope and content of the book so that it might be more useful as a textbook [in religious studies], even at the graduate level.\" Thus, this revision has more technical terms and words in languages other than English. This tilt of the content is modest, however, and does not stray much from the author's \"original intent...to write an accessible book for lay people that would introduce them to something of the richness of our eucharistic history.\" The non-English words, for example, are explained and translated upon their first appearance in the text.This major study of eucharistic history may now be even of more interest to lay persons as well as students with the considerable expansion of the illustrations and quotations. Many of the quotes, often fairly lengthy, are run in the wide outer margins; they alone offer a sketch of eucharistic history. And the varied illustrations are so plentiful that the work could be described as an \"illustrated history.\"The sacrament of the Eucharist, also known as Holy Communion, has been a fundamental part of Christianity since its inception. The Last Supper where the twelve apostles shared bread and wine with Jesus before his crucifixion is seen as the origins of the Eucharist. As one of the holiest, meaningful, and venerated parts of Catholicism and some Christian sects, the Eucharist hasn't changed that much since its origin. Devout participants believe, as they always have, they are engaging in communion with Christ by having tokens of bread and wine consecrated by a priest in a mass. For the most, the history of the Eucharist is not a history of ideas or theories or controversies about it, but rather a history of material culture surrounding it. Foley thus follows the architecture of the dwellings (beginning with homes followed by churches and cathedrals), vessels and other objects such as platters, liturgy as recorded in books, music, and artistic representations and imagery regarding the Eucharist.As the sacrament is performed at an altar in a church, the location of the altar is significant. Floor plans and architectural drawings of churches through the ages locate the altar in the changed architecture of different eras. As the design of altars and areas for them changed from era to era, so too did religious music change to mirror the secular music of different eras. Changes in vessels and liturgy were not so pronounced as with church architecture and music; though Foley gives due attention to these.The new, revised edition is only an improvement on what was already a basic text striking just the right tone of informative breadth and depth, scholarship, visual content, and thoroughness to appeal to all readers with an interest in its central religious topic.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "mcse microsoft sql server 2000 administration readiness review exam 70228 mcse readiness review",
        "description": "Test your readiness for the MCP exam. If you took Microsoft Certified Professional (MCP) Exam 70-228 today, would you pass? With the READINESS REWIEW MCP exam simulation on CD-ROM, you get a low-risk, low-cost way to find out! This next-generation test engine delivers a set of randomly generated, 50-question practice exams covering real MCP objectives. You can test and retest with different question sets each time-and with automated scoring, you get immediate Pass/Fail feedback. More importantly, you get answers to these four critical questions: What do MCP exam questions look like? In what topic and skill areas am I proficient/deficient? How should the focus my studies? Am I ready for the real exam? The intelligent way to practice for the real exam. Use this READINESS REVIEW to evaluate your proficiency with the skills and knowledge tested on Exam 70-228, including: Installing and upgrading, Creating databases, Extracting and transforming data, Optimizing performance, Managing security, Troubleshooting system activity. After completing your practice sessions, use the companion book to review helpful explanations for all responses - right and wrong - and to identify areas for further study. Sharpen your test-taking skills, save valuable time and money, and build your confidence for the real exam with READINESS REVIEW. It's the smart way to prep!",
        "authors": "['Irfan Chaudhry', 'Dean Bartholomew']",
        "infoLink": "http://books.google.nl/books?id=j0eRQAAACAAJ&dq=MCSE+Microsoft+SQL+Server+2000+Administration+Readiness+Review%3B+Exam+70-228+(MCSE+Readiness+Review)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "After reading this book and playing with the included practice test you will be in great shape to pass the 70-228 exam. That's assuming you already have a working knowledge of either SQL Server 7.0 or 2000. If you are not a DBA this review will not do the trick.One other note, while the practice test does not include many questions they will prepare you well for the exam. I found them as helpful as any of the more costly test prep products.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "If you are currently a Database Administrator or Analyst, this book is good at helping you prepare for the exam. However, if you are expecting an indepth resource on the subject you will be disappointed. The only downfall to these types of books is the fact that they give you enough examples to pass the test but not enough real world experience. This book gives you the question, you try to answer and then it gives you Microsoft's correct answer (not necessarily real world). Overall a good book and cd to prepare for the test (rated 3 1/2 stars but not available as a rating). Most likely you will need additional resources to help you prepare.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am a SQL Server DBA with two years of hands on experience with the product. I chose this exam as my first Microsoft certification. I passed the exam yesterday with the help of this book and the exam simulations included on the CD. Do not expect to pass the exam using only this book, however, the practice questions were invaluable for teaching me what type of questions to expect as well as how Microsoft expects you to answer them. In addition, the short narratives at the beginning of each section contain quite a bit of concise, useful information. Other than the narratives, the book only contains practice questions and is designed to help you determine your readiness to sit the exam. The CD practice test is very close in format to what you can expect when you take the test. If used in conjunction with other study materials, it will serve you well.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "phr exam prep professional in human resources exam cram",
        "description": "Each exam objective is thoroughly detailed, providing you with precisely the information you need to know to score higher on the exam. Also featured is the Exam Prep proven method of study, which includes Exam Alerts, tips, notes, sidebars, hundreds of PHR practice questions, relevant exercises, review breaks, a glossary, objective reference sheet, a practice exam CD-ROM, and a full practice exam in the book. You will be able to assess your exam readiness with the practice exam questions and you will develop effective study habits that will be tailored to your PHR exam preparation.",
        "authors": "['Cathy Lee Gibson']",
        "infoLink": "http://books.google.com/books?id=z3tkAQAACAAJ&dq=PHR+Exam+Prep+:+Professional+in+Human+Resources+(Exam+Cram)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This was my main study source for the PHR, being that I didn't have $600 to drop on the \"Learning System\". I passed with a 651 (got about 92% of the questions right).I don't believe there is any one study source that will give you everything you need--but if you spend time with this book, make yourself some flashcards and spend a good couple of months with them before the exam, you'll be 85% of the way there. It's really pretty inclusive.I'd say get through this book, then take the HRCI practice exam to see what you need to research further. Using ONLY this book, I passed the practice exam with 86% of the questions right. Also, take every practice test you can get your hands on--search SHRM's HRCI message board for a bunch of good links. The tests may include terms/concepts with which you're not familiar and you can research those further.Speaking of practice tests, I found the ones included in the book and CD-rom helpful--however, the other reviewers are right in that there are quite a few mistakes. One star off for that-might have given it 5 otherwise. However, for the most part they're obvious enough that you'll pick up on them and they're more annoying than likely to confuse you(e.g., question will ask you to identify \"the one incorrect choice\"; answer guide will say \"the one CORRECT choice is...\") Too bad more time wasn't spent on proofing instead of including last-minute tacky references to Hurricane Katrina (book was published towards the end of last year).Good luck to all taking the exam in Dec-Jan--give yourself a good 3 1/2 -4 months to study and YOU CAN DO IT!!!",
                "review/helpfulness": "36/38",
                "num_reviews": 38
            },
            {
                "review/text": "I just took the PHR exam (and passed) last week and wanted to review the books I used. I found this Pearson guide to be the least helpful of all the books. It was not organized well, went into too much detail on some things and left out other points and was just way too cumbersome for test prep. It's a big book with a lot of text and has much too much in it to make anyone feel confident in their preparation. While I absolutely believe you should use more than one source (3-4 is optimal), I would say this one didn't add anything for me. Skip it!General PHR Prep Advice: Use the Ann Bogardus PHR/SPHR book as your primary PHR test prep book. The Kaplan test prep book is light on the content but drills down to the big things very simply. I recommend reading the sections in Kaplan along with Bogardus. Kaplan has a few practice tests that are helpful. I also recommend getting a straight forward HR text book-- something that explains HR terms/concepts/legislation, etc with out the slant of the exam itself. Finally, take practice tests to familiarize yourself with questioning and to drill down to things you need to keep learning. It's a ton of content and I think there is little chance of knowing it all, but by using a variety of sources, you can cover your bases better.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "This is an excellent, \"must-have\" resource for anyone preparing to sit for the PHR certification exam. In addition to being well written and logically organized, it is authored by none other than Cornell University's School of Industrial and Labor Relations' Director of Human Resources Management Programs, Ms. Cathy Lee Gibson, SPHR. Ms. Gibson's down-to-earth and practical preparation approach will assist PHR test candidates in not only building a comprehensive knowledge base but in acquiring the confidence they will need to achieve a successful outcome.Whether a seasoned human resources professional or someone fairly new to the field, why not enhance your potential for success by enlisting Ms. Gibson to serve as your personal PHR testing coach? As an attorney who has successfully passed bar examinations in multiple state jurisdictions, I can attest to the subject-matter mastery and confidence derived from appropriate study-preparation and test-taking strategies. Ms. Gibson's comprehensive book serves both of these objectives equally well. Blending both her practical human resources executive experience of more than 20 years in both the private- and public-sectors with the highest academic standards of her Ivy League University employment background, Ms. Gibson is uniquely qualified to assist PHR test candidates prepare for certification.Some of the \"features\" offered by Ms. Gibson in her book include \"exam alerts.\" These are particularly helpful in assisting PHR test candidates to focus on those concepts, terms and activities that will most likely appear on the PHR exam.Additionally, Ms. Gibson's book is filled with the following useful and practical tools:chapter summarieskey termschapter summariesreview questionsexercises designed to reinforce instructional conceptssuggested readings and resourcesreview-exam answers and explanationsstudy and exam tips\"fast facts\" covering key pointsextensive glossarypractice examquick-reference objectives for easily and quickly finding subjects you want to see immediatelySimply stated, don't pass up this opportunity to partner with Ms. Gibson as you prepare for your PHR certification. Her knowledge and expertise will help you to advance your professional career to the next level of excellence!",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "I used this book as my only tool for taking the PHR exam. That was a BIG mistake. This book is horrible. It maybe helped me MISTAKES in the practice test in the book and MANY MISTAKES in the CD_rom with practice test on it. The book also differs from their own CD_rom. There test question are very situational and specific where the actually PHR Exam is more generic and has very few situational questions. The sample test questions in this book and CD_rom are very precise with lots of information so it is easier to decide what the best answer is. The PHR exam is not. I just took the test and I don't' want anyone else to waste their time using this book as a study tool like I did. Look elsewhere for help. Go straight to HRCI and SHRM for your help. This book isn't worth the money. Spend the extra money and go thru HRCI or SHRM.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is excellent, it hits all key points for the PHR Exam. It would be very useful for someone that does not have a HR degree or it has been a while since you graduated from college. Also, if you do have a HR degree and recently graduated from college, it is a great review tool. Even though I have a Bachelors in Business Administration, and recently graduated, I learned new information about HR! Plus, you cannot beat the price!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "The sample test was different than the true prep test, but it prepared you well. The PHR exam was easier than I expected. It was not as theoretical as the book. I would definitely read this book, do all the exercises. Bottom line - you have to study for the exam, at least 40 or 50 hours. My collegues that did not put in the hours did not pass the test... regardless of the study aids.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book was very well-organized and is a much more convenient ready-reference than the six SHRM Learning System module books.Unfortunately, this book and CD set were very poorly edited. The text and included CD contain numerous typos and erroneous answers (obviously from sloppy copying and pasting), which impeded learning and studying many of the concepts necessary to pass the PHR exam. Also, the exam alerts were not at all representative of actual PHR exam material (based on my exam experience as of 15JUN06). Though I did pass the PHR, this book was more of a hindrance than a help.This book and CD set should have been an excellent resource, but the weaknesses created by the lack of attention to detail in editing greatly outweigh its strengths, rendering it an overall disappointment. I would not recommend this book to anyone preparing for the PHR exam. At best, it might serve as a supplement HR reference, as long as you can overlook the numerous errors.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I bought this book and the SHRM Learning System to help me prepare for the test, which I passed. The Learning System came with six individual books for each module, and I was surprised how well this one book compared to the whole SHRM set. I was a little disappointed, however, with the practice test in the back and the CD software. I suppose it might be a nit-picky complaint, but some of the given answers did not match up with the question. For example, there is a question that asks for you to compute the average of a set of numbers. There is one answer given in the answer key that is wrong, and then the written explanation has yet a different answer. Then, when reading through the explanation they are explaining why a certain answer is the mode, not the mean that the question asked for. This also happened with the questions on the software. I couldn't understand why \"two\" was an incorrect answer to the question of how many full time or equivalent employees an executive exemption was responsible for when I realized that the question referred to \"executive\" but the answer referred to \"administrative\" exemptions. It could be awfully confusing to someone who isn't all that familiar with some of the topics. I know I was devistated for a few minutes that I apparently couldn't calculate a simple average until I caught the problem.Long story short, it's a good investment for what, less than $40? It makes a great complement to other resources (as mentioned earlier, no one resource has it all) but just check and double-check yourself when taking the tests to make sure you're not learning something incorrectly.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "The practice of Human Resources has changed dramatically over the past few years. New laws and court cases have dramatically changed not only how you act in an HR position, but even how you think. In part the Professional in Human Resources is a direct result of these changes. Instead of simply appointing someone to be in charge of HR, companies are now looking for professionals to starff the department.The PHR test is one result. Having passed the test is a clear indication to an employer that the job candidate has treated this as a profession, not just a job.The PHR test is, when it comes right down to it, a test, a written test. There are 225 multiple choice questions with four choices each. The test is designed to measure your underlying knowledge and your ability to apply that knowledge to practical situations. But above all else, it is a test, and in part is measuring your ability to pass a test without freezing up and to understand how tests are written.This book is, in turn, designed to help you pass the test. It contains sample tests to show you the format and style you will be seeing. It contains questions of the same type as on the real test to show you the kind and depth of material you need to know. It has a CD-ROM with a sample test that gives detailed explanations of correct and incorrect answers.This book, diligently applied, will enable you to pass the test.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "\"Cram\" is the key word here. Buy the book if you have no time to prepare for the PHR and are making a last ditch effort to pass. This book is not very effective for learning the 6 key study sections needed to pass the PHR in and by itself. For those people who cannot afford SHRM preparation materials ($500+), perhaps this book can be better than no preparation at all. I seriously doubt I would have passed the PHR if I had relied on this material alone.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "founding mothers fathers gendered power and the forming of american society",
        "description": "Fans of number one New York Times bestselling author and celebrated journalist Cokie Roberts will love this stunning nonfiction picture book based on her acclaimed work for adults, Founding Mothers, which highlights the female patriots of the American Revolution. Beautifully illustrated by Caldecott Honor-winning artist Diane Goode, Founding Mothers: Remembering the Ladies reveals the incredible accomplishments of the women who orchestrated the American Revolution behind the scenes. Roberts traces the stories of heroic, patriotic women such as Abigail Adams, Martha Washington, Phillis Wheatley, Mercy Otis Warren, Sarah Livingston Jay, and others. Details are gleaned from their letters, private journals, lists, and ledgers. The bravery of these women's courageous acts contributed to the founding of America and spurred the founding fathers to make this a country that \"remembered the ladies.\" This compelling book supports the Common Core State Standards with a rich time line, biographies, an author's note, and additional web resources in the back matter.",
        "authors": "['Cokie Roberts']",
        "infoLink": "http://books.google.nl/books?id=BZqDnQEACAAJ&dq=Founding+Mothers&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Norton argues that during the mid to late 17th century, colonial American political authority was based on biblical interpretations which encouraged a unified, gender-power based authoritarian system centered on the role of the father as undisputed ruler of his household. The founders were operating in a &quot;Filmerian system&quot; in which the sources of authority in the state and family were identical.However, this Filmerian system did create opportunities for women to wield some power. High-ranking widows were the rulers of their households and were deferred to by both males and females of lower ranks. Problems arose when these high-ranking widows failed to fall in with the male consensus, such as Anne Hutchinson.In the Chesapeake region, the Filmerian system was much less successful than in New England because the Chesapeake settlers were predominantly single men. The family-based power system failed in this region because it had very few traditional family households. Although power remained gender-based in the Chesapeake region, it became more like a &quot;Lockian system&quot; in which power in the family was differentiated from political power.",
                "review/helpfulness": "13/19",
                "num_reviews": 19
            },
            {
                "review/text": "Cornell University professor Mary Beth Norton has once again turned the world of colonial American history scholarship on its head with her incisive review of gendered power structures in the 17th century mainland English colonies. For the first time she exposes the world to Filmerian thought and its implications for women (and men!) in society, both in New England and the Chesapeake. The book is dense, and at times boring and repetitive, but freshly informative too. Multiple stories about sex, sexual deviancy and scandal lighten up otherwise dry scholarly analysis. This is a valuable addition to the literature of colonial American history which has ignored feminist analysis for so long. She's a tough grader, but also a great scholar and a fabulous teacher. Even a dead white male worshipper like me can enjoy and learn from her brilliance! Good luck on your next project Mary Beth, I eagerly await it.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "By Mary Beth Norton. Founding Mothers and Fathers: Gendered Power and the Forming of American Society. (New York: Alfred A. Knopf, 1996, hardcover 1996. Pp. ix, 496, appendix, abbreviations, notes, index....hardcover.)From the time of the Pilgrims to present day, women have played more of a substantial role than they are commonly accredited for. In Founding Mothers and Fathers: Gendered Power and the forming of American Society, Mary Beth Norton parlays her idea that although woman did not have an independent role in the political arena of early American society there were many woman and groups of woman who knew the undisclosed sins of the community. This they used in the assumption of leadership roles among the communities.Norton goes on to explain power inside the household as well as in the community. She connected Sir Robert Filmers' (The Filmerian view) and John Lockes' philosophies (the Lockean view) to both domestic life and the political structure and formation of early American society.As you probably know, the practice of bearing children was most likely the primary focus of 17th century colonial woman. Lacking in birth control, a woman would go through a constant cycle of becoming pregnant and giving birth. Norton points out that these regular childbearing sessions excluded men from attending. It is very important to understand the role of the midwife. She could be the necessary one in keeping the woman and child alive during birth. She could, as well, expose any form of bastardization, premarital sex, adultery, and infanticide. The power of the midwives and the ignorance of men on the subject of childbearing gave way to many cases in which women could bend around the \"man-made\" laws.It is probably demeaning these days to say that woman \"gossip.\" Well, according to Norton, this did indeed go on during colonial times. The reader will discover the \"gossip networks.\" Due to the fact that woman were separated from men in many social aspects led to these networks. Rumors of criminal activities would travel this way to the Colonial Magistrate and would very often result in punishment for the crime.I found the two different philosophies on gender power to be very interesting. Should the most power come from the parent most represented, whichever that may be? This idea would bring more power to widows and present them with a greater role in the community. However, the people of this enlightened area would demand that the power of a woman's authority was inexistent outside the home.Mary Beth Norton is a very accredited historian. This book gives remarkable incite to the power of woman in colonial times. Anyone interested in the social history of our country would enjoy this book and feel enriched after reading it. Many of the woman's roles discussed were unknown to me. Norton puts them across in a very intelligent and unquestionable way using many actual cases of the times to back up her theories.This book, although written by a scholarly author, is not a difficult reading. Since it deals with many aspects of colonial life unknown to many people the readers interest should withstand through its entirety. Indeed, woman played an immense, although not formal or independent, role in the formation of our country as it is today.-Charles Michael Farley-",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "understanding the sacraments today",
        "description": "The sacraments are at the heart of our life as Catholics, the way we celebrate together our continuing conversion and encounter with God. Baptism, Confirmation, Eucharist, Penance, Anointing, Marriage, and Holy Orders 'al are activities that require preparation to bring us to the fullness of our life in community and in Christ. Chapter by chapter, Father Lawrence Mick puts these core experiences into their historical and theological context, and illuminates the ways the sacraments bring us together as God's people. Ever conscious of the complex history of the church and its dynamic relationship to ritual, as well as the varied histories of human communities, Understanding the Sacraments Today is a book to be visited and revisited, a companion to the ongoing and repeated practices that nourish us. Lawrence E. Mick, a priest in the Archdiocese of Cincinnati, is a liturgical consultant and writer whose numerous books include Living Baptism Daly, published by Liturgical Press. He has also been active in parish, retreat, and campus ministries.",
        "authors": "['Lawrence E. Mick']",
        "infoLink": "http://books.google.com/books?id=BRLODAAAQBAJ&dq=Understanding+the+Sacraments+Today&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Father Mick wrote this book to help people better understand the sacraments individually and in terms of eight common characteristics. Fundamentally, he explains, all sacraments are (1) human activities, (2) ritual actions composed of symbols, (3) clarified by the word of God, (4) communal actions, (5) actions of Christ, (6) expressions of faith, (7) part of a larger process, and (8) formation for mission. Each sacrament is addressed individually with information on its history, current practices, and possibilities for the future. All chapters end with 10 to 13 questions for review and discussion.Some of the history falls into the \"What?\" category: An early example of early initiation rituals had baptismal candidates facing west and spitting toward Satan then facing east and committing themselves to Christ. The chapter on confirmation stresses that this sacrament \"has had a difficult life.\" To focus the discussion, Mick borrows from a study by Paul Turner (\"Confirmation, the Baby in Solomon's Court\") that presents three basic models in antiquity: the completion of the rite of baptism, the reconciliation of heretics, and the post-baptismal anointing deferred until some time after baptism. Today, those entering the church through RCIA celebrate baptism, confirmation, and Eucharist at one ceremony, and some parishes have adopted that pattern for children baptized as infants: their confirmation and first Eucharist are celebrated together.This sort of broad information against a backdrop of church doctrine is a hallmark of Understanding the Sacraments Today, a work suitable for individuals, catechists, pastors, and faith formation groups.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This well-written book gives excellent, readable coverage of the seven sacraments. It is accessible to new Catholics and those learning about the faith, while providing insight and context for those who have long experience with the sacraments. The writing is warm and personable. The presentation includes sufficient history of each sacrament to give a sense of origin and development, while the emphasis is on the sacraments as experienced today and their meaning for us. A theme through the book is that sacraments are not just between the individual and God, but involve the church community as the Body of Christ.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I used this book as a study guide for the sacraments in my parish for adult faith formation. It is a readable, generally balanced presentation of sacramental theology along with a very brief, but very informative history of each of the sacraments.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was easy to read and flowed very well. Just about the right amount of information on the subject, then moved on to another subject. It opened, for me, the real reason that sacraments are a part of the community of the congragation. Community is to be grown and that does not mean just eating dounuts and suppers together, but studying, educating your children and celebrating the sacraments on a continuous basis. The thrill of First Communion should occur each Sunday as the community celebrates the Mass and Eucharist.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "take back the truth confronting papal power and the religious right",
        "description": "From the author of \"Is the Pope Catholic?\" comes this disturbing expos of the Catholic Church's \"new feminism.\" Manning shows how John Paul II has joined forces with Protestant fundamentalists to rein in the feminist movement and perpetuate male-only leadership through coercive and authoritarian uses of power.",
        "authors": "['Joanna Manning']",
        "infoLink": "http://books.google.com/books?id=Q34lAQAAIAAJ&dq=Take+Back+the+Truth:+Confronting+Papal+Power+and+the+Religious+Right&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Manning writes in anger, but she writes well. Where Cardinal Ratzinger's office in the Vatican claimed (in Dec. 2000) that Christians cannot use practices of the early church to critique the actions of current church authorities, Manning feels it is her Christian duty to do so. Where Cardinal Camillo Ruini rejected the EU Charter of Fundamental Human Rights as contrary to Christian heritage, Manning feels that equality of human rights is at the heart of the Gospel.Manning's version of Christianity may strike some as hopelessly idealistic, and some as refreshingly non-hypocritical. She defends a socialistic version of the faith, as in the ideal of monastic communities, noting that in Acts (5:1-11) a couple in the first church is struck dead for the sin of holding back part of their property from the common pool.With Noam Chomsky-like documentation of recent church policies, Manning holds the present religious powers to a most unflattering comparison with Jesus. She warns of a growing coalition of reactionary Catholics, right-wing Protestants, and patriarchal Muslims, as seen in the cooperation of all these groups to oppose policies for women's equality at the 1994 Cairo U.N. Conference on Women, Population and Development. There's more -- on sexual abuse for example, and it's well documented.--author of Correcting Jesus",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Joanna Manning provides a powerful and insightful look into the Vatican and the religious right. She makes a provocative and compelling case for reform in the Catholic Church. Conservative Catholics will hate this book,and her.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a certification study guide box set",
        "description": "Test your knowledge and know what to expect on A+ exam day CompTIA A+ Complete Practice Tests, Second Edition enables you to hone your test-taking skills, focus on challenging areas, and be thoroughly prepared to ace the exam and earn your A+ certification. This essential component of your overall study plan presents nine unique practice tests-and two 90-question bonus tests-covering 100% of the objective domains for both the 220-1001 and 220-1002 exams. Comprehensive coverage of every essential exam topic ensures that you will know what to expect on exam day and maximize your chances for success. Over 1200 practice questions on topics including hardware, networking, mobile devices, operating systems and procedures, troubleshooting, and more, lets you assess your performance and gain the confidence you need to pass the exam with flying colors. This second edition has been fully updated to reflect the latest best practices and updated exam objectives you will see on the big day. A+ certification is a crucial step in your IT career. Many businesses require this accreditation when hiring computer technicians or validating the skills of current employees. This collection of practice tests allows you to: Access the test bank in the Sybex interactive learning environment Understand the subject matter through clear and accurate answers and explanations of exam objectives Evaluate your exam knowledge and concentrate on problem areas Integrate practice tests with other Sybex review and study guides, including the CompTIA A+ Complete Study Guide and the CompTIA A+ Complete Deluxe Study Guide Practice tests are an effective way to increase comprehension, strengthen retention, and measure overall knowledge. The CompTIA A+ Complete Practice Tests, Second Edition is an indispensable part of any study plan for A+ certification.",
        "authors": "['Jeff T. Parker', 'Quentin Docter']",
        "infoLink": "https://play.google.com/store/books/details?id=Ry2eDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "i just recently took the A+ exam and passed with no thanks to this book --its not detailed to fit the exam, i wouldnt recommend this as a study guide. i studied from the examnotes.com which was really helpfull i just purchase A+ for dummies to study for the dos/win half. Its seems helpful so far",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "In the 1st chapter of this book we are told that single-sided disks are the 320/360K disks and the double sided are the 1.2 meg disks. This is incorrect. The single-sided disks, of ancient history, are the 160/180K disks, the double-sided are 320/360K and the double-density disks introduced the 1.2 meg disks. Also, on the Interactive Study portion of the CD-ROM it is not possible to choose an incorrect answer and go to the text. The only active links are to the correct answers which makes this feature quite useless for the user wanting to truly test him/her self.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "six sigma study guide",
        "description": "Updated for 2021, Trivium Test Prep's unofficial, NEW Six Sigma Green Belt Study Guide: Exam Prep Handbook with Practice Test Questions for the ASQ Examination isn't your typical exam prep! Because we know your time is limited, we've created a product that goes beyond what most study guides offer. With Six Sigma Green Belt Study Guide, you'll benefit from a quick but total review of everything tested on the exam with current, real examples, graphics, and information. These easy to use materials give you that extra edge you need to pass the first time. American Society for Quality was not involved in the creation or production of this product, is not in any way affiliated with Trivium Test Prep, and does not sponsor or endorse this product. Trivium Test Prep's Six Sigma Green Belt Study Guide offers: A full review of what you need to know for the Six Sigma Green Belt exam Practice questions for you to practice and improve Test tips to help you score higher Trivium Test Prep's Six Sigma Green Belt Study Guide covers: SIX SIGMA AND ORGANIZATIONAL GOALS LEARN PRINCIPLES IN THE ORGANIZATION SIX SIGMA - DEFINE SIX SIGMA - MEASURE SIX SIGMA - ANALYZE SIX SIGMA - IMPROVE & CONTROL ...and includes practice test questions! About Trivium Test Prep Trivium Test Prep is an independent test prep study guide company that produces and prints all of our books right here in the USA. Our dedicated professionals know how people think and learn, and have created our test prep products based on what research has shown to be the fastest, easiest, and most effective way to prepare for the exam. Unlike other study guides that are stamped out in a generic fashion, our study materials are specifically tailored for your exact needs. We offer a comprehensive set of guides guaranteed to raise your score for exams from every step of your education; from high school, to college or the military, to graduate school. Let our study guides guide you along the path to the professional career of your dreams!",
        "authors": "['Trivium']",
        "infoLink": "http://books.google.nl/books?id=OT_KzQEACAAJ&dq=Six+Sigma+Study+Guide&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Just took the black belt exam and felt like the book did a good job helping me prepare. The questions cover all areas fairly thoroughly. Problems with the book - a few of the answers are wrong, although the explanations are correct - must have been poor proofing. Also, there is a good deal of repetition. Sometimes entire pages are repeated a few pages later. Third, there is no index, which would be helpful. Overall its a useful book, with lots of good information, but sloppily put together. There's plenty of opportunity here for \"continuous improvement\" by the publisher...",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "Very disappointing from the tile alone you would think you'd be guided through the materials in a Six Sigma Certification program or at the very least some narrative text \"guiding\" you through. I bought the guide because Pyzdek (Six Sigma Handbook --very comprehesive) was associated with it. However, the guidue turned out to be pages of lists at worse or statisitical problems with no explaination at best. If this is a study guide I think Pyzdek & Company are out of control",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mcse readiness review exam 70059 internetworking with tcpip on microsoft windows nt 40",
        "description": "Measures abilities to plan for, implement, administer, and troubleshoot information systems that incorporate Microsoft TCP/IP to identify strengths and weaknesses prior to taking the MCSE Exam 70-059 and includes hundreds of practice questions on CD. Original. (Intermediate).",
        "authors": "['Robert Sheldon']",
        "infoLink": "http://books.google.nl/books?id=OGu41hzdQUUC&dq=McSe+Readiness+Review+Exam+70-059:+Internetworking+With+Tcp/Ip+on+Microsoft+Windows+Nt+4.0&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you want to prep for the TCP/IP test then you should add this to your arensal. The CD that accompanies the book is worth more than the book itself. The CD allows you to take 60 question tests and lets you review the answers. The CD also mixes up the tests so you get different questions all the time. The subnetting questions are just like the ones on the exam. If you can do well with this you can pass the test. This along with the official M/S Press TCP/IP study kit can get you through one of Microsoft's most difficult tests. I know it helped me and I am fairly new at this computer game. Well worth the investment.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book is the kicker. All the major topics I encountered on the test were thoroughly covered in this exam book. The CD alone is probably worth the price itself, so you can't go wrong. Subnet masking is quizzed fully, along with those troublesome IPCONFIG problems Microsoft likes to throw at you. BUY IT. READ IT. PASS IT.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I bought a copy of this book based on the reviews here, and I must say everyone was right! This should be considered a &quot;must have&quot; if you're taking the TCP/IP exam. The book asks some pretty tough questions (the real exam questions are a bit tougher) and will give you an excellent flavor on EXACTLY what to expect from the exam. The book asks you a question, then explains both the right AND WRONG answers to the question. I also read the TCP/IP guide from Prentice Hall and found the two of these books to be very complimentary. I scored a 966 on the exam.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I just passed the TCP/IP certification exam with 966/1000. Readiness Review showed me what areas to concentrate on--esp. RAS and browsing which were not emphasized in other texts. The questions were similar in type to those I saw on the Microsoft Exam, especially the scenarios. The tests on the CD are excellent. They pull 60 questions at random which gives an infinite number of exams to take.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "An interactive cd that lets you take unlimited random exams and then compare the answers / questions with the explainations in the book. Yes, the book actually explains the answers and how they derived them. Very helpful, but I wonder why they didn't put the same on the cd? The tests are by Self Test Software which is a far cry from Transcenders. However, the price difference is HUGE. $30 vs about $150, go figure. You will still need the book &quot;Internetworking with TCP/IP on Windows NT 4.0&quot; ISBN 1-57231-623-3 for a training guide unless you are VERY familiar with TCP/IP. This MCSE readiness review for TCP/IP tests your knowledge while still letting you learn -- not bad!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book strictly based on the reviews from amazon. The book is all questions and most of the test is word for word. You may want to buy a supplement book such as exam cram. That is pretty much all you need.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I took and passed TCP/IP this morning. This is the forth test that I have used a Readiness Review book to prepare. However, it is not enough to study using ONLY this book. Pick up Exam Cram or any of the others. This book is all questions and answers. It tells you why an answer is right, but even more importantly why an answer is wrong. It helps with the nuances of the exam, what they are really looking for based on how the question is worded. Also, all four times I have used these books I have found that they helped me nail a particular concept that I was struggling with. For example, by going over the subnetting-related questions last night and seeing the REASONS of why the right answer was the right answer it all finally just clicked.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is probably the best book/resource you can use to test yourself before the test. Keep in mind that this is not a sole resource to prepare for this test (nor is ANY other one resource), use it when you think your ready to take the test. The questions are very accurate and provide good explanations to the correct AND wrong anwsers. About 8 of the questions in this book where on the actual test.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Just to buck the trend...I agree totally with the comments regarding balance and content - but I just didn't think the questions presented here were hard/comprehensive enough! - relative to those I received on the actual exams! I initially used this book to finish off after a MOC course on TCP/IP and failed the exam - just. I used additional material to flesh out the concepts, and passed easily today. (On a more positive note - I did find it's sister publication on Networking Essentials an excellent/comprehensive prep tool).",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mercy me",
        "description": "The best-selling Motown artist of all time, Marvin Gaye defined the hopes and shattered dreams of an entire generation. Twenty years after his tragic death-he was shot by his father-his relevance persists because of the indelible mark his outsized talent left on American culture. A transcendent performer whose career spanned the history of rhythm and blues, from doo-wop to the sultriest of soul music, Gaye's artistic scope and emotional range set the soundtrack for America's tumultuous coming of age in the 1970s. Michael Eric Dyson's searching narrative illuminates Marvin Gaye's stellar ascendance-from a black church in Washington, D.C., to the artistic peak of What's Going On?-and charts his sobering personal decline. Dyson draws from interviews with those closest to Gaye to paint an intimate portrait of the tensions and themes that shaped contemporary urban America: racism, drug abuse, economic adversity, and the long legacy of hardship. Gaye's stormy relationships with women, including duet partner Tammi Terrell and wives Anna Gordy and Janis Hunter, are examined in light of the sexual revolution of the 1960s and 1970s. Dyson also considers family violence in the larger context of the African-American life and how that heartbreaking legacy resulted in Gaye's murder. Mercy, Mercy, Me is an unforgettable portrait of a beloved black genius whose art is reflected in the dynamism of contemporary urban America.",
        "authors": "['Michael Eric Dyson']",
        "infoLink": "https://play.google.com/store/books/details?id=83s6mwmjXBcC&source=gbs_api",
        "review": [
            {
                "review/text": "In this delightful romp through the daily life of a small-town Southern woman, Margaret A. Graham gets a chance to have some fun with her characters while poking a bit of fun at the church --- something I happen to adore. Esmeralda is an immediately likable character, an older woman who does not abide nonsense and takes utter pleasure in dispensing her always practical advice to others, even those \"others\" she knows will never heed her counsel. Mainly, of course, church folk.But, as Graham wisely knows, it's those very same church folk who will be the ones to rally to support people in need and distress, as the church's Willing Workers do throughout --- helping those who grieve, those who are saddled with overwhelming responsibilities, those who need a warm casserole as much as a warm hug. Esmeralda finds herself on the receiving end of their generous gifts of time and food when she assumes responsibility for a woman dying of AIDS.Throughout the book, Esmeralda writes letters to her lifelong friend Beatrice, a literary device Graham uses skillfully. Through the letters back and forth, we gain greater insight into what makes Esmeralda tick, and through her friend we eventually see a flawed aspect of her nature.Anyone who has lived in the South, the real South, is bound to be amused by Graham's ear for the \"language\" --- the way real Southerners express their thoughts, their choice of words, and their charming way of simply making up words. Thus Esmeralda advises Beatrice that the \"onliest doctor\" she needs is Dr. Scholl, seeks out a \"notary republic\", and quotes Charles \"Splurgeon\" throughout. The book also has some hilarious moments, as when Esmeralda must make up a name for the dying Hispanic woman and can only think of \"Carmen Miranda\" (which admittedly may not be funny to those too young to remember her), or when she tries to resolve an immigration problem, gets shuffled from one office to another in the courthouse, and finally takes it upon herself to enter a door marked Problem Resolution Office, only to discover 45 minutes later that it's an IRS office.And Graham's use of imagery shines throughout the book: \"Her pauses are like when the washing machine stops then starts up again,\" Esmeralda says about Beatrice. Graham has most assuredly done her share of laundry, because only someone who has listened out for the end of the cycle countless times can relate to the way those pauses sound like a person holding her breath. \"If Clara can't climb down your family tree to the bare roots, you don't get no clean bill of health,\" she says of another church member.But there are some missteps. Esmeralda uncharacteristically comments on the number of Christians killed and tortured around the world, something that doesn't sound like her but instead sounds like the author trying to educate her audience. Then there's the mandatory salvation scene, in which one character practically grills another to find out if she led a woman to the Lord in precisely the \"right\" way. That one really grated on me.Finally, toward the end of the book, Esmeralda convinces a godly man named Carl that he should cut what she calls his \"pigtail\" (a ponytail, maybe?) because no woman would want a man with hair like that, and, as she tells him, \"it don't look right for a Christian man to go around looking like a leftover hippie.\" Here's a kind, godly man, but he isn't quite up to snuff as a Christian example because he wears his hair wrong? I hope not. And I suspect there are plenty of women out there, even Esmeralda's age, who would gladly accept a ponytail on a thoughtful, caring man.Despite those and other minor flaws, what it all comes down to is this: MERCY ME is an enchanting, fun read, and Graham is an author to watch. Let's hope she has more in mind for Esmeralda.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Esmerelda is a spunky lady in a small North Carolina town. She's not nosy, but she is willing to advise anyone and everyone who comes along. Most of her advice is directed through phone and letter to her dear friend Beatrice who is having late in life romantic problems.Her skills are put into the test when the AIDS crisis impacts this unlikely town. Her mercy and wisdom will be severely challenged as she is called upon to extend the hand of Christian love in what would be called above and beyond duty. She proves that love is love by what it produces, especially extended to strangers.***** Esmerelda is an unlikely, folksy heroine that will remind you of Aunt Bea. She is a lady from another time in the modern world who exemplifies Christianity. *****",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I &quot;enjoyed meeting&quot; all the characters, they were very real, interesting and most of them were quite likable! I don't believe Esmeralda will ever allow her life to become boring. She may be a widow living alone but she does not allow herself to become &quot;self-absorbed.&quot; I am hoping for a sequel or maybe even a series. I didn't really want to put the book down until I finished it. The author gives you a sense that &quot;something is going to happen&quot; but I was still surprised at what transpired in this quaint little southern town. A great book!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Esmeralda, the heroine, is an outspoken and feisty church member, never afraid of giving advice - especially to her timid friend, Beatrice and other not-so-Christian acting church members!Once you start to read &quot;Mercy Me&quot; you won't be able to put it down! Not only is it hilarious but also contains many truths about church members' behavior! Many of the characters will seem very familiar to any Evangelical church goer. Highly recommended!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was such a fun book to read. Esmeralda was an elderly character with a lot of spunk, who also went through some rough times with her husband when he came back from the war. It was so easy to love her. There was a lot of humor in this book--the church ladies following Horace to make sure the mule got a proper burial, Esmeralda giving dating advice to her friend, Beatrice, the church ladies all picking out a casket together, Maria's fake name. But with the humor, I saw a lot of &quot;what would Jesus do&quot; stuff spread throughout the book in a very subtle manner--Esmeralda taking in Maria when she was so sick, Esmeralda telling Beatrice to go out of her way to be friendly to her obnoxious neighbors, Esmeralda telling Beatrice to make sure that Carl is a godly man, Esmeralda being so kind to Horace when he was so spiteful towards her in the beginning of the book.You will love this book and the characters.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "advanced cissp prep guide exam qa",
        "description": "Get ready to pass the CISSP exam and earn your certification with this advanced test guide Used alone or as an in-depth supplement to the bestselling The CISSP Prep Guide, this book provides you with an even more intensive preparation for the CISSP exam. With the help of more than 300 advanced questions and detailed answers, you'll gain a better understanding of the key concepts associated with the ten domains of the common body of knowledge (CBK). Each question is designed to test you on the information you'll need to know in order to pass the exam. Along with explanations of the answers to these advanced questions, you'll find discussions on some common incorrect responses as well. In addition to serving as an excellent tutorial, this book presents you with the latest developments in information security. It includes new information on: Carnivore, Echelon, and the U.S. Patriot Act The Digital Millennium Copyright Act (DMCA) and recent rulings The European Union Electronic Signature Directive The Advanced Encryption Standard, biometrics, and the Software Capability Maturity Model Genetic algorithms and wireless security models New threats and countermeasures The CD-ROM includes all the questions and answers from the book with the Boson-powered test engine.",
        "authors": "['Ronald L. Krutz', 'Russell Dean Vines']",
        "infoLink": "http://books.google.nl/books?id=l-S-UvLaZ7cC&dq=Advanced+CISSP+Prep+Guide:+Exam+Q&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Advanced Q&amp;A is exactly what was needed as a companion to the CISSP Prep Guide. The questions in the original Prep Guide seemed too easy, and these are definitely not easy! It has been suggested to read the Prep Guide and answer the All-in-One questions, but now with the CD included, that's not necessary; Advanced Q&amp;A is a complete study solution.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Russell Dean Vines and Ronald Krutz have yet another first rate manual; for the CISSP exam. The authors have gone the extra mile to produced a book that an additional studsy guide companion to their already successful CISSP Study Guide.This is not an addendum to the first book but rather a cut to bone manual that focuses on the exam objectives. While it may appear that the small manual is nothing more than questions and answers, after reading the text I found it provided more than just bullet points.There is over 200 questions with detailed explanations to work with as well as a cd-rom, using the highly successful, Boson testing engine with an additional set of practice questions. Used as a final preparation tool or as a supplement to The CISSP Prep Guide, either way you have a great study tool.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "It's good to get study questions from an authority. Since this review is pre-CISSP test I can't speak to the value of those questions. I'm certain they'll be right on target though.I liked the book very much. I liked that newer information is included like wireless networking HIPAA and other topics.I think the book is about 100 pages too thick. One can literally rip out the first 99 pages and not loose any content. The first 99 pages are all the questions. The rest of the book are the questions repeated again along with the answers. I couldn't help but think someone went out of their way to create a bigger book knowing that all the information could've been covered in fewer pages.Since the original CISSP Study Guide is also formatted this way I guess it's okay, but it still wastes a lot of paper IMHO and more than likely adds to the cost of the book.Call it a pet peave I guess. Other than that, a great book and highly recommended.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "mcse certification test yourself practice exams syngress",
        "description": "The perfect supplement to Global Knowledge Network Certification Press MCSE Study Guides, this book provides more than 1,200 new questions to practice for the exam--or for those folks looking to increase their skills. All questions are written from scratch--no rehashing of other study guide material. This makes it a great add-on to existing study guides.",
        "authors": "['Syngress Media, Inc']",
        "infoLink": "http://books.google.com/books?id=pEgOAAAACAAJ&dq=MCSE+Certification+Test+Yourself+Practice+Exams+(Syngress)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I found the book very helpful in passing the NT Workstation exam. As another reviewer mentioned, the test questions are more difficult than the real thing, so if you can take answer all 400+ test questions for an exam you shouldn't have any problem passing the real test. It's unfortunate that both the study books by this publisher and this test book have a few incorrect questions and answers, but I've found this in MCSE study materials from other publishers as well. I find it intolerable that these errors make it to print in a guide for extremely technical material.While I found the test questions very valuable, I won't be buying more study guides from them and will be looking for study guides with fewer technical errors.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "i'm self studying for my mcse, and i just aced my first exam, nt workstation. this was one of the products i used. on the positive side, it's very thourough, and the questions provided are generally more difficult than those on the actual exam (don't worry if you don't do well at first--i was scoring 45% and 50% on the practice live tests a few days before the exam, but still managed to pass the real exam with flying colors). the fact that the questions are difficult makes this product extremely useful as a review tool. i recommend going through all the questions several times and memorizing the answers. some of the questions on the real exam are similar, and several draw on knowledge you'll pick up by memorizing the answers to questions in this product.on the negative side, there are a fair amount of errors in the program (answers that don't match questions), and a few instances of seemingly erroneous answers. there are enough instances of typos, bad grammar, and vague and poorly worded questions to make things annoying at times, but this is the case with most of the mcse study material i've seen so far. also, there are a few annoying limitations in the interface--you can't choose the number of questions on a test, and you can't review your answers after a live test.were it not for the problems listed above, it would be an outstanding product. still, it's a useful, and worth the price since it covers all the core exams.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I have utilized this book as the last step before taking (and passing on the first try) all 4 core exams. There are some flaws and poorly worded questions, however, the majority of the questions are useful in evaluating your readiness to take the exam. In addition to the questions, there are various tips and extra info thrown in that can be useful. I would definitely recommend this book!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]