[
    {
        "Title": "easy true stories a picturebased beginning reader",
        "description": "A couple feels something moving inside their mattress. Is it alive? What is it? A man's winning lottery ticket -- worth half a million dollars -- is somewhere in the town dump. Can he find it in the mountains of garbage? A woman searches 20 years for the daughter she gave up for adoption. Where does she discover her daughter? Easy True Stories, by Sandra Heyer, presents 20 new stories in the True Stories tradition: human interest stories adapted from newspapers and magazines. The stories -- some humorous, some poignant, some astounding -- are told as simply as possible. Most stories are less than half-page long, and they are written almost exclusively in the present tense. Nine pre-reading drawings introduce each unit visually and ease students into reading. Easy True Stories can be used as a first reader for students who have some experience with English. The True Stories series also includes: Very Easy True Stories All New Very Easy True Stories All New Easy True Stories True Stories in the News, Third Edition More True Stories, Second Edition Even More True Stories Beyond True Stories",
        "authors": "['Sandra Heyer']",
        "infoLink": "http://books.google.com/books?id=7B_dngEACAAJ&dq=Easy+True+Stories:+A+Picture-Based+Beginning+Reader&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The school-age ESL student I worked with found the stories to be challenging and intriguing. Topics such as a woman with hundreds of tattoos and a flying car kept interest high while working on reading comprehension skills. Each story is set up to be an independent lesson that can be effectively taught without any prior preparation.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is one more of a remarkably effective and well-thought out series. I have almost every level so far and each book has added enormously to my English classes. Even so, I was hesitant to get this level because I didn't see how the layout was going work. I needn't have worried.The previous level book (Very Easy True Stories) is set up so that there are illustrations with captions. This level has the the same clear illustrations, but the story is written in paragraph form on the the facing page. What I do is use the book as a speaking tool. I have my students read the story and then tell it to one of their classmates, or to me, pointing to the illustrations to help them continue. Having the story on the opposite page means that I can cover up the words and so they have to search their minds for the appropriate vocabulary instead of continually looking for the word on the page.I have used this method with students from every leel and because the stories are so captivating, it works very well for all. The students are barely conscious that they are learning new vocabulary; they are excited to be speaking and telling an interesting story.Each story is followed by exercises which reenforce the vocabulary and act as indicators as to whether the student has understood both the specifics and the general idea of the text.I hope that the author comes out with a second part of this level as she's done with the first level.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "An earlier review talks about how well this book works for school-age students. I teach ESL to adults, and my students love this book. Some of them have copied the stories out of the book, even though I never give them an assignment to do that. The progression from Very Easy True Stories to this book (Easy True Stories) to True Stories is really well done. The English is closely attached to drawings in the easiest book, but as the series gets more advanced the drawings - the \"training wheels\" - gradually lose their importance.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "In an effort to teach my neighbors English, I went to the library and reviewed many of the TESL books in my local branch. I borrowed several and found this one to be the best for starting reading. The stories are extracted from newspaper articles that are gossipy and that have vocabulary words related to current life. For example, there are stories about true love, tatoos, how to find a spouse, etc.The articles are charming and they are good humoured. My neighbors got a good laugh out of the first story about a couple with mattress problems. This was a great beginning for their work with me. The other stories have helped the students open up and talk about their lives in English.I do think the exercises after the stories could be more relevant and more conducive to drilling. I can't move through the book very quickly because it doesn't pick out grammar and idioms for my students to study. However, it has some very good conversation topics in the teacher section. It also has some writing exercises.In the past, I have taught foreign languages to high school students but never English as a Second Language to adults. This is a new experience for me. I do think that this is the best material I have found so far to keep the students engaged and get them thinking about the words they need in daily life.It will take a long time to finish all the articles and then I will be able to update this review.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "true stories in the news a beginning reader",
        "description": "A couple feels something moving inside their mattress. Is it alive? What is it? A man's winning lottery ticket -- worth half a million dollars -- is somewhere in the town dump. Can he find it in the mountains of garbage? A woman searches 20 years for the daughter she gave up for adoption. Where does she discover her daughter? Easy True Stories, by Sandra Heyer, presents 20 new stories in the True Stories tradition: human interest stories adapted from newspapers and magazines. The stories -- some humorous, some poignant, some astounding -- are told as simply as possible. Most stories are less than half-page long, and they are written almost exclusively in the present tense. Nine pre-reading drawings introduce each unit visually and ease students into reading. Easy True Stories can be used as a first reader for students who have some experience with English. The True Stories series also includes: Very Easy True Stories All New Very Easy True Stories All New Easy True Stories True Stories in the News, Third Edition More True Stories, Second Edition Even More True Stories Beyond True Stories",
        "authors": "['Sandra Heyer']",
        "infoLink": "http://books.google.com/books?id=7B_dngEACAAJ&dq=True+Stories+in+the+News:+A+Beginning+Reader&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I used this book and _More True Stories_ with conversation classes for Japanese adults and found they worked very well to spark conversation. Once in awhile I used the exercises which follow the story, but usually I made up my own speech themes related to each chapter. We read one story every two weeks. The first week, we read the story aloud, and talked about it. The second week we read the story aloud again, and then students gave short speeches about the theme. The stories them selves are intriguing, but it was my students' own related stories which made them like the book. I prefer these two texts to _Easy True Stories in the News_ because that one is written entirely in the present tense. My students had a lot of difficulty using past tenses, so I wanted to use texts which featured those forms.",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "I can't say enough about this reader. I found it by chance at the bookstore of my nephew's college two years ago, which has a big ESL department, and have been amazed with its effectiveness every since. It works for readers of all ages and I have students from elementary school to adults. It has high interest stories written with high frequency verbs in past simple, it introduces one or two new vocabulary words in each story and then repeats them so that the students learns them easily while reading the story. There are questions and activities which I don't use but are well thought out. The stories really capture the attention of all of my students and don't condescend at all.I have my students read the stories in English, translate them to Spanish (I teach in Spain and have found that their comfort level goes way up when they fully understand the story and can process it in their minds in Spanish), and then ask them to relate the story back to me in their own words in English. It's been an absolute revelation. The fact that the stories are true means that the students relate to the stories more easily and appreciate them. I bought the intermediate level book which was too big a jump and introduces too many new vocabulary words for my students, but I'm going to try the high beginner book.I can't recommend this book highly enough.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "ridin high livin free hellraising motorcycle stories",
        "description": "An angel spreads his wings. . . . Sonny Barger is the number-one spokesman for the motorcycle experience. His New York Times bestseller, Hell's Angel, was an exhilarating history of his adventures with the world's most notorious motorcycle club. Now he brings us rousing, moving, and wildly entertaining true stories of his renegade brothers and sisters in the relentless pursuit of liberty, individuality, and the \"ultimate ride.\" And what stories he has to tell -- freewheeling, bare-knuckle tales of brawls and battles, brotherhood, breathtaking adventures, crazy quests, and the inevitable classic scrapes with \"John Law.\" The most colorful legends and unforgettable characters of biker lore come alive in this book. In addition, celebrities like Steve McQueen, Johnny Paycheck, and David Crosby thunder through these pages in a sensational collection of rebel tales that runs the gamut from poignant and inspiring to thrilling and utterly outrageous. Whether you ride, have never ridden, or dream of riding, Ridin' High, Livin' Free is a reading experience you won't soon forget -- a fascinating glimpse into a unique culture of freedom that recognizes only one commandment: the code of the road.",
        "authors": "['Sonny Barger']",
        "infoLink": "http://books.google.nl/books?id=vKlnlwEACAAJ&dq=Ridin%27+High,+Livin%27+Free:+Hell-Raising+Motorcycle+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This collection of stories from the most famous 1%'er is a must read!!! Everyone who rides for the sense of freedom and escape it provides, will enjoy each and every chapter in this book. Simple stories speak columes of what riding free is all about. For those who are dreaming of riding, make sure this is your first stop in researching the idea. From the hilarious to the humbling, this book is meaningful and well written. Thanks Sonny for another great contribution!",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Jeez, aside from about 30 pages of goodness about Steve Mcqueen and a few old-time H/A stories-which are told using lame-o aliases and seem to be recalled through a certain haze...this is just a steamin' pile of crap. Crap I could hear if I went to the gaywad leather bar in my town. What can I say, I have all the respect in the world for Barger, the H/A's, whatever, but I didn't pay money to read about a yuppie's BMW road trip. Seriously.I just expected better from somebody who has better stories than this (really, he's gotta have better stories...Son-come on, you don't have better than this??). I just kept thinking that Barger just really didn't want to be doing this, and it came down to these two nutsucker ghost-writers grasping at straws.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I was excited when this came out, as I was going through a bit of hero worship regarding bikers. Of course, now years later and a motorcyclist myself, my awe of this life-style has paled.Barger has to be given credit for where it is due. He's managed to make money of the Hell's Angels for fifty years now. That's pretty impressive. And to be willing to openly discuss portions of his life in that society takes guts. However, this book falls short in many areas.One, the few stories that relate to the Hell's Angels are over-the-top. It's just too hard to believe these exploits.Two, the non-Hell's Angels stories aren't any better. The picture painted of bikers throughout this book is that they are greasy, dirty, smelly and disgusting. Even the women profiled here are portrayed as little more than tramps.Three, we're subjected to Barger's attempt at fiction. Atleast it's only boring, unlike his actual fiction book (DEAD IN FIVE HEARTBEATS), which is a fictionalization of his autobiography with some preposterous action sequences thrown in.So, if you're really into juvenille biker stories, this is up your alley. If not, but you want to explore this genre, there are plenty of better books available.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Throughout the book, Sonny talks about one of the Oakland Chapters members, who he referrs to as Cincinatti. Now, whether this person is himself or not, I think that this person has imbibed in way too many foreign substances. There's multiple stories of running around and talking to ghosts, taking ghosts for rides on their motorcycles, then hooking the ghost up with ol' ladies in the ghost world, etc. There were other typical Sonny Barger hidden slams about other clubs selling their old ladies in houses of ill repute, when in reality, it's much more believable were it to have been a confession. Either way, I really like the quote from Freewheelin Frank in his own book (a 60's paperback, now out of print) where he Quotes Sonny as saying: &quot;When I make money from the patches on my back, I will no longer be a Hell's Angel&quot;. Bravo. And to think, ghosts riding on your motorcycle, eh?",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Let's face it.... Most of us ride a motorcycle for a variety of reasons. One of them being to live out the fantasy of the outlaw biker. Sonny is the real deal and so are these stories. After you read each of them, you can close your eyes and just for a moment be transported in time to another place. This book is about all of us who seek the freedom of the road. It will give you a sense of just how special our little fraternity of &quot;The Biker Life&quot; is. You will come to know and identify with all of these characters and their lives.I bought this at a book signing out here in Westwood Village, CA. What a thrill to meet Sonny and have him sign my book. The big surprise to me was that he actually talked with me for some time. We talked about his books, his life and his regrets.When you hear him talk, it creates a mixture of fear and fascination with in your own mind. Although most of us will probably never become an official HA, this book brings the experience right into your own living room.&quot;Ridin' High and Livin' Free&quot; It's a beautiful thing.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree 100% with the review questioning whether Sonny ran out of material; sure looks that way. The major problem with the book is that, except for a few very good passages (which is why I gave it 2 stars instead of one) it is just not interesting (then again, I almost dropped it back to 1 after reading one completely disgusting story about a biker's first success with the girl of his dreams; did they really have to include this?).In his ongoing attempt to clean up the biker 1%er image, portraying them as basically good guys who raise a little hell once in a while rather than real outlaws, Barger is forced to abandon what I'm sure would be infinitely more interesting stories. Overall really not worth the time or money.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Was expecting to read something interesting about the self-proclaimed \"legend,\" but it was a collection of stories whose truth was always questioned, EVEN BY THE BOOK ITSELF. The foreword warned that not all the stories were true. Then, after a more-interesting story, the next story sharted with \"Now this story is true, I swear it...\" Lame.There are much more interesting motorcycle stories (and better writing) on the 'Net. This book was filled with swear words thrown in the oddest places, there was no flow between the stories, the characters were confusing, maybe they needed the money and hurried the book to market, I dunno.The Zimmermans' first book on Sonny was much better, in spite of Sonny coming across as narcissistic as he did.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Although this book was entertaining, it is hardly the best book out there for tales of 'cyclers. I did enjoy the tale of the poor girl who got [...] on a Panhead that was trash. And the story about the guy who picked up a ghost was entertaining, even if it was hardly believable. Many of the stories were just too short and seemed to have no point. I point here in example the story about the kid who saw a bunch of 'cyclers going to a funeral. Big whoop. Keeping to stories of adventure would have been better, but many of these stories do't even fit the subtitle \"Hell-Raising\". Blaah.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "What a blast! Some of the stories are a little long in the tooth, but, like the preface says, who cares??? As long as they're entertaining, which most of them are. A few are outright boring, but the gems more than make up for them. Nice short stories, so you can leave it and pick it up as you wish. Well recommended!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Zimmerman's easy read of Barger's memories is a bit of history. One begins quite quickly to realize this history lacks credibility. Barger has reinvented the story of the gang-beating of Hunter Thompson. Skip Workman himself admitted in a 1967 television interview that women once in a while needed to be beaten like a rug. A woman's beating is the reason Thompson expressed his disapproval and was subsequently beaten (Workman's comments were specific to the Thompson beating). Barger softens the story in the book, as part of his overall attempt to change the reputation of the club and make them appear to be heroes. Barger further hopes to canonize himself through this self-fashioning. Once this credibility is broken, one cannot help but question the account of Barger's wife's accidental death while attempting to self abort. Barger freely admits he did not want children. As long as you are ready to indulge the over 60 Barger's attempt to use this quick read to convince you he is an American hero (he supported the Vietnam war), take a peek, it won't take much of your time.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the moths and other stories",
        "description": "Fiction. THE MOTHS AND OTHER STORIES, Helena Maria Viramontes' stories exploring women's struggles to overcome the dictates of family, culture, and church, is in a new edition. Prejudice and the social and economic status of Chicanos often form the backdrop for these haunting stories, but their central, unifying theme deals with the social and cultural values which shape women's lives and which they struggle against with varying degrees of success.",
        "authors": "['Helena María Viramontes']",
        "infoLink": "https://play.google.com/store/books/details?id=mP_VMvKLQ_QC&source=gbs_api",
        "review": [
            {
                "review/text": "In Philadelphia, over the past summer, I happened to be in a used book store perusing the shelves for a good read. Being a student of writing, I thought after a short time, that I should look for some works by my professors at school. The first author I looked for was Helena Maria Viramontes, because the way she talks about writing is better than a lot of the stuff authors publish. She always talks in class about her novel, Under the Feet of Jesus, or her new work. All they had was a collection of short stories that I didn't remember ever having heard her talk about, called The Moths and Other Stories. I picked it up, bought it, and by the end of the day had finished reading it. What a great collection of stories it is. It's so enjoyable to read that you finish it before you would like to. I have told professor Viramontes about my finding it, and she said that she rarely thought of the collection anymore, but that she was very happy with some of the stories it contained. I was very happy with the whole book. I think you will be too.",
                "review/helpfulness": "19/22",
                "num_reviews": 22
            },
            {
                "review/text": "I read this for a Literature and Culture class. We were presumably to read excerpts, but I finished the book, shut in that I am. I found these stories at turns fascinating, poignant, and annoying. The Moths is a touching and true-feeling story of devotion between a dying grandmother and her granddaughter. As one reads of the narrator tenderly bathing her disoriented, cancer-gnawed grandmother, the question occurs: Is the author commenting on the selfishness of our attempts at helping others, our efforts offshoots of a feeling of \"obligation\" to our benefactors? Or is it a comment on the Hispanic family structure, or merely an illustration of one moment?Growing is a bittersweet story of sisterly devotion, from the hispanic perspective. Naomi evolves from a perception of her younger sister Lucia as an onus (an escort) to a realization of her as a worthy, budding human being, all of which has for a catalyst a game of baseball played by some barrio children.Birthday involves a young girls abortion, and is the sometimes lamentable introduction of stream of consciousness into the author's stories. Other stories become more disturbing, both in topic (The Cariboo Cafe masterfully treats the brutality of the border patrol while neighbors studies the disintegration of urban hispanic neighborhoods), while Snapshots, the story of an old woman deemed crazy for her attachment to the past, is infused with a doleful brilliance.I have boundless respect for the technique of stream of consciousness, from Faulkner's babbling yokels to Woolf's introspective, ethereal characterizations. But it has to be done sparingly (especially these days, when the technique is old hat) and adroitly. These two stipulations are the only two for which Miss Viramontes does not answer in full on this work. Still worth your time, though.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "I have to admit it. I bought this book in a rushed in-and-out at a feminist bookstore because of its gorgeous cover. To my delight, the stories within it are as complex and deviant as the painting.Viramontes' writing is not breezy; it requires attention, especially as the book progresses.Her subjects are not for the weak at heart. They are raw and offer no excuses or apologies for it.The sexual ambiguity, the inminent violence, the imposing masculine presence, and the abundance of religion in the culture of Chicano women are all explored to the bone in these stories.I highly recommend this book.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "small caucasian woman stories",
        "description": "Short stories from the lives of the residents of Blue Valley, a small town in eastern Kentucky.",
        "authors": "['Elaine Fowler Palencia']",
        "infoLink": "http://books.google.nl/books?id=k6Ui6gwbza8C&dq=Small+Caucasian+Woman:+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I scoffed at the title when I first saw it, but when my friend lent it to me, I couldn't separate myself from it. The stories and characters are better than fiction. The human dramas and strength evidenced by the women in this Appalachian town are beautifully and powerfully written about by Palencia. The stories are from women of all age groups which should offer wide appeal. I'm ordering this book today for my library and I can't wait to booktalk it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The eighteen stories in here (and I assume the prologue by the librarian is as fictional as any of the other stories) were completely engaging. I loved the way characters appear as stars in their own stories and then reappear in the background of others. This is so much like earlier stories in US lit -- Zona Gale, Helen Reimensnyder Martin, Margaret Deland, Elsie Singmaster, Olive Dargon, etc. The synechdotal rendering of entire communities is a genre that has always given me great pleasure. It reinforces the reality of our inter-connedtedness without minimizing our uniqueness. And the writing is absolutely wonderful. I'd like to hear what others think about the book and I'd love to read comments from the writer herself.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "tokyo cancelled",
        "description": "Thirteen passengers are stranded at an airport. Tokyo, their destination, is covered in snow and all flights are cancelled. To pass the night they form a huddle by the silent baggage carousels and tell one another stories. Thus begins Rana Dasgupta's Canterbury Tales for our times. In the spirit of Borges and Calvino, Dasgupta's writing combines an energetically modern landscape with a timeless, beguiling fairy-tale ethos, while bringing to life a cast of extraordinary individuals-some lost, some confused, some happy-in a world that remains ineffable, inexplicable, and wonderful. A Ukrainian merchant is led by a wingless bird back to a lost lover; Robert De Niro's son masters the transubstantiation of matter and turns it against his enemies; a man who manipulates other people's memories has to confront his own past; a Japanese entrepreneur risks losing everything in his obsession with a doll; a mute Turkish girl is left alone in the house of a German man who is mapping the world. Told by people on a journey, these are stories about lives in transit, stories that grow into an epic cycle about the hopes and dreams and disappointments that connect people everywhere.",
        "authors": "['Rana Dasgupta']",
        "infoLink": "https://play.google.com/store/books/details?id=ifyEAAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I rcvd my copy of Tokyo Cancelled, and started to read it the very same day. Frankly, I thought it may be a bit too high brow for me. The reviews were very \"literary\".To my pleasant surprise, it is more accessible than I expected. There are 13 short stories of varying styles. The stories are told by travelers stranded in the Tokyo airport (hence the title). They are told in various forms: fables, modern tales, a sectioned/outline format, and set in modern and fanciful times. Be prepared to suspend reality. This is one of those books that can be read on many levels. I enjoyed the stories in and of themselves, but also enjoyed thinking about them afterward. I plan to read the book again. I suspect I will get more out of it on the second reading.Dasgupta has an interesting writing style. I was often amused, occassionally embarrassed or surprised, sometimes sad or even bemused... overall a very interesting book. I still don't \"get\" the Frankfurt Mapmaker story, but I enjoyed it. Hmmm...I'll surely read it again. The Billionaire's Sheep was powerful - it made me think. I don't want to give anything away here - please forgive my generalizations.This book is not of the IWE (Indians Writing in English) genre, though the writer has a good command of India. This is not Lahiri, Mistry or any other Indian writer - so don't expect that kind of novel. (Though I have enjoyed Lahiri and Mistry.)Dasgupta has his own voice. I plan on recommending this to a few friends who I think would appreciate this unique book.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is one of the most well written, captivating and creative collection of short stories that I have read in a long time. There are so many different plots and twists and turns to each story that one wonders how Dasgupta was able to imagine it all. I very much enjoyed the fact that each story is set in a different city across five continents. For the places that I knew, I really got the feeling that Dasgupta had a good grasp of the cultures he was writing about.I would definitely recommend reading this book, especially if one enjoys foreign settings and a certain magical atmosphere.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Like another reader, I picked this up thinking the idea was an interesting slant on a theme of short stories. I was expecting something connecting the stranded passengers but I really did fall into the magical realism we're used to finding from writers like Isabel Allende et al. Actually none of the stories relate to each other (excepting some references in the last story to earlier incidents) though they all demonstrate the writer's knowledge of capital cities and some astude references to current global affairs (eg, the economic crisis in Argentina). I loved the unrealistic side of the tales, the exploration of the depth of the human mind and the concept of dreams as reality. Its refreshing to read such an International book (meaning, you really couldn't tell where the author is from by just reading the stories). I believe this is Rana Dasgupta's first book and I really have to give him credit for his incredible style and the enormous amound of research that went into the work. If I was to find one fault (and this is the only one) and while I really enjoy the style of writing and the great idea of using stranded/bored passengers to share their stories...........they all had the same style and they all used the same bizarre magical reality throughout. Some more individualism (ie, a different storytelling style) might have added to the authenticity of the situation.........The odds of finding 13 excellent storytellers on a stranded flight seems a little too incredulous! All in all, however, this was an excellent Summer read and I thoroughly recommend picking it up soon.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book was not what I expected, and after finishing it, I still do not know what to think. The premise is what made me initially interested: a group of 13 strangers are stranded in the airport in Tokyo for the night and decide to pass the time by telling stories. Sounds interesting, right? I thought that the stories would be global and realistic stories about people and life. I was wrong. The stories are certainly global, and the author describes beautifully each city in the book with intimate knowledge, but the collection of stories are more like fairy tales and fantasies. I did not fully understand many of the stories, but the book kept me reading nonetheless. Overall, it was not a bad book, just different. The author writes well, and for the imaginative, this may be a great book. I just think that I would have liked similar stories about life told without the fantasy better.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I found the first story interesting....absurdist fantasy but then the next story was the same genre as was the next etc. etc. The two stars are for the use of language but the stories (do not equate it with the Canterbury Tales even though the dust jacket does) seem to pick something absurd, do something absurd with it and leave with an incomprehensible ending. That's fine in small doses but it doesn't add much to understanding characters or life in general. The \"plot\" device of 13 people stranded in an airport could have been something interesting but there is only one of the passengers who is given any identity at all so, an interesting situation is wasted and we know nothing of the people who are telling these stories. That would have added an interesting dimension.. Read one story from it and then go on to something else.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "A modern-day \"Arabian Nights\" for the next generation. Some of the stories in here are downright odd, but they're all enjoyable and perfect for late-night reading.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book could have been great, in my opinion, but it wasn't.The book is meant to echo The Canterbury Tales, but doesn't. In fact, it would be blasphemous to mention the two in the same breath. The book's concept is great-- 13 strangers are stranded at an airport and each has a story to tell, but it wasn't handled adequately. Each story is creative, no doubt, and imaginitive, but at the same time many are familiar. Others are grotesque. The voice doesn't change at all throughout the book. The only somewhat interesting thing the reader can notice is the different locations in which Dasgupta sets the stories, other than that, the book becomes remarkably dull. It's almost impossible to read in one sitting as the style becomes repetitive.The actual writing is good at times, the descriptions in particular are a treat, however Dasgupta at times inserts a \"twist\" into a story that seems completely ineffective and juvenile. Such as the image of the grim reaper in the middle of the short story: The Memory Editor (the image is meant to symbolize the main character's paranoia, I suppose, but is useless and sudden, and the \"twist\" ends abruptly with the main character realizing it's Halloween.)The last thing about this book is the background story. I mentioned before that it should not be compared to The Canterbury Tales, and I'll state it again. The stories are meant to have been told by some unnamed member of the 13, however, several stories are not formatted to be told verbally, which is why I thought the background story should've been eliminated completely. For example, in The Billionare's Sleep, there is a string of dialogue involving the billionaire, his wife, a customer, and a telecom operator. Without any breaks between quotes, the dialogue becomes jumbled to the reader, and most be even more difficult to understand if heard out loud.Overall the stories seemed rushed, with no specific thought put into how they would come together, and although descriptive and at times creative, the book leaves much to be desired. Overall quite a big disappointment.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "of women outcastes peasants and rebels a selection of bengali short stories voices from asia",
        "description": "\"A powerful portrait of the oppressed and the forms of oppression that occur in India.\"-Theodore Riccardi, Jr., Columbia University",
        "authors": "['Kalpana Bardhan']",
        "infoLink": "http://books.google.com/books?id=1gJog_PRLlIC&dq=Of+Women,+Outcastes,+Peasants,+and+Rebels:+A+Selection+of+Bengali+Short+Stories+(Voices+from+Asia)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an absolutely wonderful anthology of short stories; one of the best I've ever read. All are quite well written. Most of the stories are about the poorest of the poor in this area of India. While many of the stories are heart-breaking, it is not a depressing read. The title gives an accurate description of the book's focus. Some of the stories were written at the turn of the century &amp; some more recently. Anyone who is interested in India, peasants, poor people or feminism will love this book.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Bardhan has put together an amazing collection of short stories. The writers belong to different generations and different periods in modern South Asian history, but the selection has so clear an aim that each story belongs as much in the book as the others. The translations are excellent, too. There is none of the awkwardness that one often encounters when a culture is interpreted to the world. As for the stories themselves, they describe the terrible, often chilling, near-helplessness of women and outcastes in Bengal. And yet, even in the most wretched lives, they portray hope and grim triumph. They are remarkably devoid of maudlin compassion.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "growing up latino memoirs and stories",
        "description": "Features the writing of Sandra Cisneros, Oscar Hijuelos, Rudolfo Anaya, Julia Alvarez, and others",
        "authors": "['Harold Augenbraum', 'Ilan Stavans']",
        "infoLink": "http://books.google.com/books?id=quPX3vBkk58C&dq=Growing+Up+Latino:+Memoirs+and+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a marvelous anthology. I've given it to friends and want students to read. It is cleverly thought out and has a wonderful preface by Stavans and a solid introduction. The contributors are all first-rate.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is an anthology of works of various hispanic writers and their experiences in the united states. It provides each reader with a sence of being because in a strange way you are able to relate to each story. Its a great book!",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "I thought that Growing Up Latino really showed different views of Latino life. They do not come in all the same way. I was glad that to see some of my favorite authors were in this book. I also found new authors that I never knew I was interested in until I read this book. The book showed us through the victories and struggles that follow with the Latino culture. I really enjoyed this book and even recommended it to my friends.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I really don't know what to make of *Growing Up Latino*. I mean, I did enjoy the book. I laughed, nodded and groaned with memories of my Hispanic background as I read the stories. However, I was surprised at excerpted stories in this book by other well known Hispanic authors.Oscar \"Zeta\" Acosta's \"The Autobiography of a Brown Buffalo\" and Jose Antonio Villarreal's \"Pocho\" are a couple of examples where an excerpt of their stories are in this book. So, it made me wonder just how many other works in this book were also excerpts.To me, there were lots of other wonderful stories by well known authors, such as Sandra Cisneros, Richard Rodriguez, Gloria Anzaldua, Rudolfo A. Anaya and many more. Each of them were unique with the topics they've chosen as well as their writing styles.There were many topics covered in the stories. However, just about almost everyone had a similar experience. Topics covered death, education, religion, Spanish, English, gringos, food, social norms and many more. Experiences were similar when it came to social norms, teachers, Catholic schools, pronunciation of names and the like. I could relate to some of them, which made some stories more cherished than others. There were a couple of stories that I just could not \"get it\".Nonetheless, it was a good read. I just wished that there were no excerpted stories. Excerpted stories feel abrupted and it's mainly because you're only read a sample. Regardless, I will recommend my friends to read this book, along with an explanation.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "more true stories a beginning reader",
        "description": "A couple feels something moving inside their mattress. Is it alive? What is it? A man's winning lottery ticket -- worth half a million dollars -- is somewhere in the town dump. Can he find it in the mountains of garbage? A woman searches 20 years for the daughter she gave up for adoption. Where does she discover her daughter? Easy True Stories, by Sandra Heyer, presents 20 new stories in the True Stories tradition: human interest stories adapted from newspapers and magazines. The stories -- some humorous, some poignant, some astounding -- are told as simply as possible. Most stories are less than half-page long, and they are written almost exclusively in the present tense. Nine pre-reading drawings introduce each unit visually and ease students into reading. Easy True Stories can be used as a first reader for students who have some experience with English. The True Stories series also includes: Very Easy True Stories All New Very Easy True Stories All New Easy True Stories True Stories in the News, Third Edition More True Stories, Second Edition Even More True Stories Beyond True Stories",
        "authors": "['Sandra Heyer']",
        "infoLink": "http://books.google.com/books?id=7B_dngEACAAJ&dq=More+True+Stories:+A+Beginning+Reader&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I use Heyer's True Stories series with my high school ELD classes. The stories are varied levels (this one is suitable for early intermediate students), and very high interest. I don't use them as primary texts, but to supplement our curriculum. They can be used for reading comprehension, class discussion, and writing topics.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is one more of an excellent series of true stories written for ESL learners.The stories are presented in separate chapters with a photograph of the subjects of the story and then exercises following the story which test specific and general comprehension. I use this for students who have a good grasp of past tense and who have begun learning the present and past perfect tenses, although those are used lightly and that knowledge isn't essential.The stories are of high interest and after each one my students look at me amazed and ask me the same question - \"Is it true?\" (They are!) At the end of the book is some more information the author provides that fleshes out the story a bit more.Even my most reluctant learners always brighten up when I pull the book out and they are even willing to do the exercises. This book and the entire series has added enormously to my classes.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I use this for my adult ESL students as they go beyond the need for lots of accompanying pictures to help them understand the stories. The version is well-placed and, as usual, most of the stories are quite fun. The amount of student work is appropriate for the level.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "spider womans web traditional native american tales about womens power",
        "description": "In the Americas, the oral tradition has created one of the oldest surviving bodies of literature on earth. Native American storytelling, in particular, stands out for its distinctive honoring of womanly power and the female forces of the universe. Gathered here are traditional versions of stories and songs that best portray this strength and vitality. Illuminating the scope of human behavior-from treacherous mates and medicine men to magical sages and murderous mothers-these tales offer universal truths. And for readers who wish to explore the transformative healing gifts of these stories in a more personal way, each is accompanied by thought-provoking exercises and meditations. Also included are brief introductions to provide historical and cultural context. Entertaining, educational, and inspirational, this collection of timeless wisdom will shed light on the lives of readers for generations to come.",
        "authors": "['Susan Hazen-Hammond']",
        "infoLink": "http://books.google.com/books?id=wk52ojWvMrkC&dq=Spider+Woman%27s+Web:+Traditional+Native+American+Tales+About+Women%27s+Power&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I had been looking for a book like this for some time and was so pleased to finally find a compilation of native stories about women's power. Unfortunately, this book does not identify the origin or source of the stories (other than naming a tribe). With so many questionable nu-age &quot;native&quot; books out there, it is important to know the authenticity of these stories. It would help to know where the author gathered the various stories -- whether she interviewed elders, researched older documents, or some other method.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "I picked this book up because it shares a similar title with a book of womens stories called 'Spider Womans Granddaughters', and upon first glance it appeared to be either a continuation or a related book of stories. Unfortunately this was the farthest thing from reality.Most of the stories in this book are watered down versions of the stories that they are aiming to tell, and were one to tell these stories in the company of others who knew other versions, it could prove very embarrassing.The authenticity of the rest of the stories became suspect for me, when the stories which are fairly common knowledge were twisted in such a way as to use them to forward the Noble Savage myth/ ideal, and to perpetuate a set of beliefs that are not necessarily true, accurate or useful.The questions are leading, overly touchy feely and over explain the stories in an attempt to guide the reader to the authors already pre-determined conclusions about the intentions of the story. A prime example being The Woman Who Fell From the Sky, significant portions that don't contribute to the readers perception of the heroines persona are excluded and other aspects completely altered. Significant details are missing, which create the balance of the story, leaving it polarized and creating a cut and dry Mother Goose and Grimm good and bad guy, rather than illustrating the depth and interplay of the forces within the story. To see such an awesome and colorful story flattened to yet another supergirl story was just sad. Bits and blurbs, and dirty ditties season the book in an effort to keep the reader believing the picture the author is trying to paint.These stories are not being used to teach tradition, standards of behavior or anything else - unless one is seeking to reaffirm what a special little snowflake floating through a sea of fire they are.I was incredibly disappointed.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "pissing in the snow and other ozark folktales",
        "description": "The well-known Ozark folklorist gathers together bawdy tales, previously considered unprintable, that provide insight into the region's rich exotic narrative tradition",
        "authors": "['VANCE RANDOLPH']",
        "infoLink": "http://books.google.com/books?id=CGP0_AhD0J0C&dq=Pissing+in+the+Snow+and+Other+Ozark+Folktales&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I took a strange but ultimately interesting course in American Folklore back at good old MWC. Our Professor made us read this book, and I can never thank him enough. I am still not sure what the purpose of us reading this book was, but the stories were hilarious. I laughed so much reading these stories. Many of which were simply extended dirty jokes. This was by far the best book I read at college. I don't know much about Folklore, but at the very least if you want to read a funny book, get pissing in the snow.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I have a copy of this book that has been with me for a number of years now and every now and again, I find myself leafing through it. It never ever fails to bring a chuckle or a down right laugh. This is a collection, for lack of a better word, of Dirty Jokes, dating back to the 1800's. The jokes and stories range from the cute to the absolute raunchy. They, for the most part are presented in the dialect of the teller. The author has gone to great pains to research their origins and has given credit to the individual teller when ever possible. Being well in to my dotage now, these jokes are the ones I grew up with here in the Ozarks (in fact, I personally know some of the individuals mentioned in the book), and they never fail to bring back fond memories. Most of the jokes, like most of the people in this area at that era, are very earthy and to the point. I suppose there may be those who might be offended, but they are, the jokes and stories, apart of our heritage and I am grateful to the author for having preserved them. For those that are offended, and I rather pity them, well they certainly need not read past the first page. Many of these stories would be lost now for not for his research and his recordings. Recommend this one highly and recommend this one be one you buy and keep as you will no doubt want to give it a reread and it is certainly something that future generations should have.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "After the kids were snug in their sleeping bags and tents, their parents would pop the corks on their favorite brews and this collection of dirty, one-pager, country stories was passed from person to person around the campfire and read aloud. People would literally fall over, roaring with laughter, gasping for breadth. And often,the reader was paralized with laughter and couldnt continue. The stories are red neck filthy and funny beyond words. I didnt get the cultural relevance, I was too busy laughing. Not for the politically correct.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "When I fetched this book from a friend I knew it was a-going to be a good'un. Filled to the brim with rural anecdotes, for womenfolk and fellas alike, \"Pissing in the Snow\" is sure to get any reader plumb excited.All regionalisms aside, I truly did enjoy this book. It starts a bit slow, but once the old-fashioned nature is understood and appreciated, the country boy jokes about bodily functions and not-so-veiled references to intercourse keep the laughs coming. Replete with colloquialisms such as \"twitchet\" for female sexual anatomy and \"tallywhacker\" for the male organ, the stories should elicit a sense of nostalgia from anyone who's heard a good campfire joke told by someone from The Great Generation.Most of the time the stories revolve around a preacher, a traveling salesman, clever country folks tricking dumb city folks, or the ubiquitous farmer with a young nave daughter about to be deflowered. The language used throughout is interesting to say the least, with improper verb conjugation and pronoun usage sentences like, \"That's just what Bobby Ray done, too!\" are not uncommon.My favorite part of each story was the ending. Each ending is supposed to confirm the veracity of the story, but only adds doubt. It's like hearing someone end every story with, \"For real!\" They come across like a story from your Grandpa, creating a positive, enjoyable vibe that amplifies the innocence past. Without what would be considered vulgarity by today's standards, \"Pissing in the Snow\" proves there is more than one way to skin a cat when it comes to humor. There may be times when readers from the big city will dismiss this as boring or unintelligent, but I reckon if you-uns read this here collection of stories you'll think differently, because Amazon readers is smarter than that, anyhow.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The book is an easy enjoyable read. It certainly has some truths to it, that although humorous, really make one wonder if some of the stories are true to the letter. Aside from that, &quot;Pissing in the Snow&quot; gave me a few hours of giggle time. Great for layovers at the airport.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is a great collection of Ozark Folktales and stories. I wouldn't recomend reading this book to a 10 year old because of the content of some of the stories, but I would recomend this book to the older reader who would appreciate the wit and humor.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Excellent old American humor! Taken from supposedly real stories from the Ozarks, and thesurrounding areas. Keep a Kleenex close by, because you will laugh till tears come to youreyes.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "When I first read this book 20 years ago, I had no idea that this type of material (dirty jokes, to be precise) constituted folklore or any other basis for serious study. I merely thought that it was a guilty entertainment. You might imagine my delight to find that in addition to some very funny, albeit very crude and crass, stories, there was a thoughtful, intellectual critical introduction and a series of short annotations after each nasty excerpt, including thematic code numbers under the Stith Thompson indexing system. I simply can't recommend this book to highly for anyone with earthy tastes, but an aspiration toward the higher and more thoughtful aspects of the vulgar. Also, it's very reasonably priced, compared to the other works in the genre.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book was a supplemental text for an anthropology class I took at Arkansas College, Batesville, AR. in the late '70's. My grandfather grew up in the Oklahoma territory in the early days of this century and traveled quite a bit. He'd heard variants on many of the bawdy stories in the book, and relayed the stories as he knew them to me. I still have copies of this book in paperback,and I try to buy them as I find them since I have friends who always enjoy having a copy for themselves. I went to college with people who lived in the areas where these stories are told to this day, and the places and some family names are familiar to them.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I like to read this book whenever I'm stressed out and realize I shouldn't take life so seriously. The fact that the tales are short but witty allows me to read them whenever I want, instead of having to read the whole book at once.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "to cut a long story short",
        "description": "Offers fourteen stories of intrigue and surprising twists, many of which are based on incidents recounted to the author in his travels throughout the world.",
        "authors": "['Jeffrey Archer']",
        "infoLink": "http://books.google.com/books?id=I191HiS5l-MC&dq=To+Cut+a+Long+Story+Short&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Jeffrey Archer is by far the most versatile and fluid author of contemporary fiction. He has written novels ranging from politics (First Among Equals) to revenge (Not A Penny More, Not A Penney Less) to corporate rivalry (The Fourth Estate), all of which have elements of his trademark 'twist' at some point.I awaited To Cut A Long Story Short with much anticipation, as I strongly believe that writing short stories is what he does best.I found this book highly enjoyable though certain stories were a little disappointing.'The Endgame', 'The Grass Is Always Greener' and 'Chalk And Cheese', were especially entertaining. 'The Grass Is Always Greener', in particular, I thought was a really superb read, both in terms of content and language. One aspect of Archer that makes his books so zestful and fun to read is his balanced usage of simple and complex language.Then again, I found 'A Weekend To Remember' rather dull and mundane. Perhaps the plot was rather limited as it was based on a true incident.Archer has written two very short stories, 'The Letter' and 'Love At First Sight'. These were not exceptionally good, but then, how many of us can produce really good short stories?Contrary to the five stars displayed, I award this book 4.5 stars. It loses the 0.5 star as I still think A Quiver Full Of Arrows outperforms it in terms of plot twists. Certain stories, however, such as 'The Grass Is Always Greener' show Archer to be capable of outperforming himself. All in all, this is one terrific book.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "These stories would remain unpublished without Archer's name attached to them. Older writers need to know when to call it quits before dragging out every lame bit of narrative they have laying around the house. To Cut a Long Story short is perfect evidence of the fact that big publishers sell safe, well-know names not stories of true quality. Pity. Most of these are &quot;based on actual events&quot; so they are not even original creations of Archer's -- just junk pulled from newspaper headlines and turned into snooze fiction.",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book was not as good as I expected having thoroughly enjoyed his previous short story collections. Seeing as more than half of the stories are based on real life events, the creativeness and originality I have come to expect from a Jeffrey Archer short story were just not there. The stories came across basic and predictable, except for the few stories that were original. Actually quite a disappointing read overall.",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "I've only read Archer's novels, not his short stories, so I was pleasantly surprised by the cleverness of these stories. The reviewer who called them &quot;O Henry-esque&quot; is on target. All these stories contain stunning reversals or trick endings that will keep you guessing. I loved The Endgame especially. Most of the stories are short, well-conceived and well-executed. The tale of two pub friends who trade off roles in their lawyer/expert witness routine is hilarious. In fact, Archer's droll wit is apparent on just about every page. I thought 3-4 of the stories were terrific, but even the &quot;sub-par&quot; ones I found enjoyable. I read the whole book in one sitting. Most readers of this kind of surprise short story should find these diabolically clever and suspenseful. Sure, you may guess one or two of the endings, but overall Archer will remain a step ahead.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Tony Hadley's autobiography is a excellent read for any Spandau Ballet fan. During the new romantic era of the 80's, Tony reached stardom as frontman for Spandau Ballet with his distinctive voice and adoring fans. But as the 80's were coming to a close so were Spandau Ballet. I was quite interested to see how Tony and guitar player Gary Kemp's friendship tunred sour and eventually landed in court over royalties. This book tells the story of how Tony had it all then lost it all.I was almost disillusioned to read how relentless Gary Kemp was in not only to stop paying royalites on Spandau Ballet's material, but to keep his former bandmates, Tony, John Keeble, and Steve Norman at bay not even allowing them to use the words &quot;ex-Spandau Ballet&quot; members during their tours. It was this conflict with Gary Kemp that caused Tony's downward spiral.But the book goes through the many highs and lows of Tony's life both in Spandau Ballet and in personal life, which kind of serves as a lesson for all of us. After reading this book, you will see that no matter what gets in your way of succees, or people that want to bring you down, or even if you make mistakes, don't ever give up on your dreams. Life is an adventure, take it day by day; that's Tony's philosopohy. I'm sure for all you diehard Spandau Ballet fans hoping to see a reunion sometime in the future, after reading this book, you will see that it will likely never happen.&quot;I know this much is True&quot;",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am always on the lookout for a good short story so I bought this book with much anticipation.Most of the stories are based on fact and while this adds an element of intrigue it seems to me that they were rather predictable. The stories kept me interested but do not result in any feelings of suspense/excitement/surprise.Perhaps I am unfairly measuring this book on the short stories of Roald Dahl which are virtually impossible to beat for their twists, shocks and surprises. Archer's book is enjoyable but if you are looking for exceptional stories you'll be a little disappointed.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have been a fan of short stories for a while. Mainly because they are digestible and accomplishable in a short sitting. These stories are very well written. Just when you adapt to a storyline, something changes and you stumble down another path. You do physically smirk to yourself at the outcome of a story and I find this work by Jeffrey Archer very enjoyable, though I have yet to read more of his books. There's one slight glitch, If I sometimes settle in for a short story at night, it ends up a long night. It's just hard to ignore the next chapter heading winking at me, saying \"read more\". I do recommend this book, especially for busy people who don't have time to get through a novel.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "The cliche \"master storyteller\" is appropo for Jeffrey Archer in this incredible collection of short stories, but perhaps not sufficient. After I had read a couple of the stories and been entranced and stunned by them, I couldn't help but try to figure out where the remaining stories were going as I read them. There's always a twist, a surprise, an \"Ooohh, alright.\"I'm not a short-story fan but I am definitely a Jeffrey Archer short-story fanatic.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "As a child of the 80's i had wondered what happened to Tony. He has the most amazing voice! This is a great book. It shows their struggles, fame and then greed of certain band members that almost got Tony but looks like he is prevailing....by the way Gary who? Looks like Tony is rising above it all.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "A collection of short stories of mixed length, quality, and subject matter. Most readers will like at least some of the stories, most of which have an English setting. The stories range from a roughly one-page Arabian nights account (&quot;Death Speaks&quot;) to a 78-page account of a man determining his true friends (&quot;The Endgame&quot;). The majority are based on true incidents, and some, e.g., &quot;Crime Pays&quot; and &quot;Too Many Coincidences,&quot; involve people using their knowledge of the law for their own benefit. I personally liked the last story, &quot;The Grass is Always Greener,&quot; which points out that success and happiness are a matter of perception.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "hot chocolate for the mystical teenage soul",
        "description": "Latest in the popular \"Hot Chocolate\" series for teens, this inspiring anthology of miracle stories sheds light on the phenomena of angels, miracles, near-death experiences, and other miraculous events as they have happened to teenagers from all over the world. Original.",
        "authors": "['Arielle Ford']",
        "infoLink": "http://books.google.com/books?id=jP0d1cgEHgQC&dq=Hot+Chocolate+for+the+Mystical+Teenage+Soul&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My mother got me this book as a gift...and it is a truly interesting idea for a book. This book lacks the charm of the &quot;soup&quot; books...most of the stories are drawn out from the one sentence in which they could be summarized. It seems as though Ford, in trying to solicit stories, accepted the first 101 and did not edit or improve any submissions at all. Some of the stories, granted, are interesting, engaging, and even a bit spooky. Unfortunately, the majority seem contrived and more the fare of late-night campfire chats or urban legends than genuinely inspiring stories of the &quot;other side&quot;. In future editions of this book (which I am sure there will be), Ford could, should, and for her own integrity as a writer, must be more selective in choosing her stories. And.. just *perhaps* she could make the parody title a tiny, tiny bit less obvious.",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "I'm 16 years old and I was looking for something to entertain me in my down time this summer. I happened upon this book and I couldn't put it down! All of the stories were absolutely fascinating and I would recommend this book to any teen!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I am priviledged to have 10 grandchildren 8 of whom are teenagers. Being a lover of books, I always read what I send to my family. These 101 stories are so interesting and diverse that I keep a copy in my home for young visitors. I think every grandparent and school should have a copy for all to read.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "For anyone who likes reading true stories about miracles and the unexplainable, this book is for you. The stories you read leave you with a tingley feeling and the thought that this could happen to you. If your looking for a good book to read at night, this is it.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "My 70 plus neighbor and I are reading it and we find it one of the most turn page books we have read in a long time.My bath water turned cold as I read story after story...I origonally thought I would have time to read only three.The stories are written with such sincerity and genuine feelings and the endings are MADE FOR TV.Some of the endings to the stories are so amazing it is hard to guess how they turn out.Arielle's books are all wonderful family/airplane and summer reads.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is a book for all ages... even though it is written about teens. It is full of stories that make you believe that there is something exciting going on in the world! You can read it a little at a time, and each story is more amazing than the next.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "storytellers startup book",
        "description": "Offers tips for beginning storytellers on getting started, collecting stories, networking with other storytellers, and deciding on a performance style",
        "authors": "['Margaret Read MacDonald']",
        "infoLink": "http://books.google.com/books?id=w3WJ2tQTEu8C&dq=Storyteller%27s+Start-Up+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Margaret Read MacDonald has another winner in this book that is guaranteed to help the novice get up in front of a group--without book or script--and share the gift known as story. She takes the reader through the process of finding, learning and practicing a story. She shares a little background on the importance of story in history and world cultures. Best of all, she includes stories with telling instructions. Unlike many other books of this type, the stories she includes are not the well-known &quot;beginner's stories,&quot; like &quot;The Turnip,&quot; but interesting and fun to tell, ones you may never have heard before.Turn off your television and open up whole new worlds by telling a story to your friends, family, students, co-workers. You will enjoy the power of a story shared with your listeners, and &quot;The Storyteller's Start-Up&quot; will be an excellent guide for the journey.(Gwyn is a professional storyteller who has coached many middle school students in the telling of their first story).",
                "review/helpfulness": "46/46",
                "num_reviews": 46
            },
            {
                "review/text": "Going into the teaching field, I was looking for some tips on telling stories. I found it in MacDonald's book. She gives techniques for learning and performing stories. She also gives ideas for incorporating storytelling into the classroom.Each chapter is followed with a valuable list of books and authors for you to expand on the art of storytelling.MacDonald's book is a great introduction into the world and tradition of storytelling. She even includes twelve tales to get you going. If you want to become a storyteller, this is a good place to start your quest.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "I loved the sample stories at the end...very useful for us beginners. The reason it only gets 3 stars is because 25% of the book is bibliography/footnote, and because most of the good ideas in this book are available in more useful detail in \"Creative Storytelling...\" by Jack McGuire. McGuire's book is geared toward telling to children, but it contains a great deal of info on the processes behind storytelling. It gives you some great steps and ideas for creating, remembering, and telling your own stories.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "MacDonald is a firm believer in the value of stories, not only on the performance level but also on the personal level -- in the home and in the workplace. Her book imparts confidence to the most timorous of beginners, and the tales she includes are likely to be new even to veterans.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is an essential book on storytelling. It helps the novice with useful tips. The more experienced storyteller will still find interesting material in the selection of rich tales from different cultures. It is also a great book to read aloud for the children.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "My kids and I have enjoyed this book for 8 years. My copy is dog eared and tatty, and has been the seed of many a night of story telling which has been a fantastic bonding experience for us. During hurricane Ike with no power, what do you think we did? We told each other stories, and non of it would have happened without this book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the storytellers startup book finding learning performing and using folktales",
        "description": "Offers tips for beginning storytellers on getting started, collecting stories, networking with other storytellers, and deciding on a performance style",
        "authors": "['Margaret Read MacDonald']",
        "infoLink": "http://books.google.com/books?id=w3WJ2tQTEu8C&dq=The+Storyteller%27s+Start-Up+Book:+Finding,+Learning,+Performing+and+Using+Folktales&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Margaret Read MacDonald has another winner in this book that is guaranteed to help the novice get up in front of a group--without book or script--and share the gift known as story. She takes the reader through the process of finding, learning and practicing a story. She shares a little background on the importance of story in history and world cultures. Best of all, she includes stories with telling instructions. Unlike many other books of this type, the stories she includes are not the well-known &quot;beginner's stories,&quot; like &quot;The Turnip,&quot; but interesting and fun to tell, ones you may never have heard before.Turn off your television and open up whole new worlds by telling a story to your friends, family, students, co-workers. You will enjoy the power of a story shared with your listeners, and &quot;The Storyteller's Start-Up&quot; will be an excellent guide for the journey.(Gwyn is a professional storyteller who has coached many middle school students in the telling of their first story).",
                "review/helpfulness": "46/46",
                "num_reviews": 46
            },
            {
                "review/text": "Going into the teaching field, I was looking for some tips on telling stories. I found it in MacDonald's book. She gives techniques for learning and performing stories. She also gives ideas for incorporating storytelling into the classroom.Each chapter is followed with a valuable list of books and authors for you to expand on the art of storytelling.MacDonald's book is a great introduction into the world and tradition of storytelling. She even includes twelve tales to get you going. If you want to become a storyteller, this is a good place to start your quest.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "I loved the sample stories at the end...very useful for us beginners. The reason it only gets 3 stars is because 25% of the book is bibliography/footnote, and because most of the good ideas in this book are available in more useful detail in \"Creative Storytelling...\" by Jack McGuire. McGuire's book is geared toward telling to children, but it contains a great deal of info on the processes behind storytelling. It gives you some great steps and ideas for creating, remembering, and telling your own stories.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "MacDonald is a firm believer in the value of stories, not only on the performance level but also on the personal level -- in the home and in the workplace. Her book imparts confidence to the most timorous of beginners, and the tales she includes are likely to be new even to veterans.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is an essential book on storytelling. It helps the novice with useful tips. The more experienced storyteller will still find interesting material in the selection of rich tales from different cultures. It is also a great book to read aloud for the children.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "My kids and I have enjoyed this book for 8 years. My copy is dog eared and tatty, and has been the seed of many a night of story telling which has been a fantastic bonding experience for us. During hurricane Ike with no power, what do you think we did? We told each other stories, and non of it would have happened without this book.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "hers 30 erotic tales written just for her",
        "description": "When Melanie, a hard-working law student, meets Vanessa, a glamorous executive, she is drawn to the enigmatic woman and the escape Vanessa offers. Soon, Melanie is caught up in Vanessa's sensual games of submission. When ghosts from the past reappear, both women must face their deepest fears.",
        "authors": "['Anna Stone']",
        "infoLink": "http://books.google.com/books?id=3KepvgEACAAJ&dq=Hers:+30+Erotic+Tales+Written+Just+for+Her&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "These 30 sexy stories are each written directly to the female reader from different male perspectives. (One of the reviewers of this book did not seem to understand that concept. She says that she couldn't put herself in the narrator's shoes. Well, that's not the point of this book. The stories were written to the reader. She'd be better off reading the companion book, His, which is written from the perspective of 30 different women to a male reader if she wants to read a book written from a woman's view point.) This book is absolutely unique. I haven't read another collection like it. The stories are exciting and erotic and very well written. Fantasies include having sex at a party, sex in a car, sex with an ex, outdoor escapades, sex with a coworker, and many more. The style of the stories is such that you can fall right into them. I bought \"His,\" for my husband, and he adores it -- but we've actually shared the stories in both books with each other. A very satisfying collection.",
                "review/helpfulness": "66/66",
                "num_reviews": 66
            },
            {
                "review/text": "A previous reviewer was horribly offended that there were no female narrators in this book. That's a little strange, because these are clearly (from the introduction) intended to be stories narrated by men and written &quot;to&quot; women. There are no female narrators because you need to look to the accompanying book, &quot;Hers,&quot; for that. So there.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            },
            {
                "review/text": "Excellent book!!!! The stories will really get you going and you will be dying for more!!!! I could barely put it down!!!",
                "review/helpfulness": "14/19",
                "num_reviews": 19
            },
            {
                "review/text": "Both this and its companion volume \"His\" are really fun collections. Both me and my girlfriend have very much enjoyed reading them (and had more than a few fun moments sharing them together as fantasies). This one includes such sexy tales as the man who seduces his girl in the back of a cab while a sexy cab driver takes them around the city, a wife who pretends to be a high-class call girl while seducing her husband, and a light-hearted tequilla booty call from an old college girlfriend. All in all very sexy, easy to read and fun!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "This collection of totally erotic short and mid-length stories is aimed directly at the reader. The narrators in the stories write to a nameless \"you\" -- which forces the reader (very nicely, I might add) right into each story. It's easy to pretend that the actions in the pieces are happening, unfolding as you read through the book. Lots of different fantasies are covered in this collection, my favorite being \"The Rules of the Game,\" which is a story about a girl pretending to be \"Simone,\" a high-end call girl. She plays the game much better than her boyfriend does. The fantasies are on par with those found in Forum or Variations -- and they're really very sexy. The book could be read aloud to a lover and would really be a perfect little Valentine's day gift...",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "Together, the books contain 60 stories. Half are written from a male perspective and the other half from a female point of view. Buy them together and share them with your mate. The stories will definitely spark some sexy nights for you -- they did for me!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "More raunchy than the other book I bought for my fiance (Enchanted: Erotic Bedtime Stories for Women). I believed that she enjoyed the stories here very much. This book gets right down to the sex that the audience is looking for, and might help women understand just what is going through the heads of the men they adore.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "curses inc and other stories",
        "description": "The title story about a boy who tries to get even with a girl who humiliated him at school by using the mysterious online store \"Curses, Inc.\" is followed by nine short stories about magic, witches, and ghosts.",
        "authors": "['Vivian Vande Velde']",
        "infoLink": "http://books.google.com/books?id=p-ZhngEACAAJ&dq=Curses,+Inc.+and+Other+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "At first I couldn't stand how these stories end, but then I realized that if they ended the way I wished they would, they wouldn't be half as interesting or as thought-provoking. It would just be a well told, cliched archetype we've all heard a million times.Fives points to Vivian Vande Velde for another awesome book!",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "These wonderful short stories are twisted, enjoyable fast reads that no Harry Potter fan should miss while waiting for book five to arrive. It has all kinds of witty witch stories, from the truly scary \"Lost Soul\" and \"Past Sunset\" to the laugh-out-loud funny \"To Converse With the Dumb Beasts\" and \"Boy Witch.\" The off-the-wall fantasies engross readers from the beginning and don't let go even after the last page is turned. The forward and afterword from the author explaining her insperation and the collection's title are interesting, but don't add anything to the book and are at times bland, the reason this book only gets four stars. Still, they're not bad and you shouldn't skip them, especially if you become a fan of the book. All in all, a collection of short stories you won't want to pass up. Great, and highly reccomended!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am a 13 year old, and Im pretty new to short stories, but after I found this great book at my bookstore, I knew I was hooked. The title story is hilarious, and has a great ending. Vande Velde has a great sense for making funny, spooky, kooky and intelligent short stories, yet doesnt bore you or overdose on gore. I loved this book, and Ill be sure to get other books from Vivian Vabde Velde!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "first crossing stories about teen immigrants",
        "description": "Stories of recent Mexican, Venezuelan, Kazakh, Chinese, Romanian, Palestinian, Swedish, Korean, Haitian, and Cambodian immigrants reveal what it is like to face prejudice, language barriers, and homesickness along with common teenage feelings and needs.",
        "authors": "['Donald R. Gallo']",
        "infoLink": "http://books.google.com/books?id=wZE8AAAAYAAJ&dq=First+Crossing:+Stories+About+Teen+Immigrants&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "First CrossingHave you ever felt out of place? Have you ever tired to fit in, tried to figure out how the world works? The book \"First Crossing\" edited by Donald R. Gallo, are stories about teen immigrants. It is a book filled with ten short stories of kids trying to fit in. One of my favorite stories is \" First Crossing\" by Pam Mun Ryan.\"First Crossing\" shows that it is not easy to cross the border to America. A boy named Marco and Papa try to cross the border to America to work. It might be Papas tenth time crossing the border, but for Marco it is his first crossing. One important phrase said by Papa was \"My future and the children's future are marked in stone here\". This is important because he is saying, in America there is a better life for him and his family.I did not like all of the stories in this book, but I would still recommend this book to anyone that wants to read stories about people trying to fit in. Some of the stories I liked were \" First Crossing\", \"They don't mean it\", \"Pulling up stakes\", \"Making Maddie mad\", and \"The Swede\". Do the people fit in? Do they solve there problems find out by reading \" First Crossing\".By Joshua Micallef",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "First Crossing: Stories About Teen Immigrants gives a glimpse of our world through the eyes of strangers. The short stories are of teens from all parts of the globe who have immigrated to the United States and find themselves in a myriad of different circumstances. Although the characters are so different, they all share the common challenge of dealing with change and accepting differences. The reader will appreciate the insight given and hopefully come away with a new sense of understanding and a resolve to be more tolerant. Bonnie, Meridian, ID.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "First Crossing, a collection of ten first-person narratives, tells the stories of teen-age immigrants to the United States. While the stories in this collection cover diverse immigration experiences, each story deals with the challenges that are unique to adolescents arriving in a new country. The stories, though fiction, deal with the difficult realities many immigrant teenagers face, realities such as self-doubt, social and linguistic isolation, racism, and family conflict. The reading level and subject matter of this book make it suitable for middle school and high school students. The collection lends itself well to opportunities for discussion and writing extensions.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "For a summer reading assignment in my high school, I had chosen to read First Crossings: Stories of Teen Immigrants by David Gallo. Although initially, I had expected true stories of immigrants in a longer format, the stories in First Crossings are fictional and short.I enjoy reading multicultural fiction, and I throughly enjoyed reading some stories in the book, although after reading three to four stories, the stories began to become transparent and rather canned.I guess this is to be expected with a collection of stories all about the same subject, but I expected more from such prolific writers of the topic such as Lesley Namioka (whose books I have read before).Also missing from First Crossings is something that I think would be very relevant to current events in the United States, a story about illegal Mexican or Central American immigrants living in America, rather then just the immigration process.. Reading through the book, I found that it covered all manners and variety of immigration to America, with the glaring omission of this topic.To be more complete, I would recommend such a story be included. Otherwise, I have enjoyed reading from this book.A wide variety of topics related to immigration are presented in a sometimes humorous format, including the immigrant handling of cultural differences and misunderstandings, the customs and cuisine of a new country, and, especially valuable, the search for an identity as an immigrant in a new country, coming from a country with a distinct culture to another country with another distinct culture.The characters in the \"identity-related\"stories often struggle to find a balance between their birth and adopted cultures, and satisfyingly, appear to make adjustments and blend the two in unique ways.Although not what I expected, I enjoyed reading First Crossings.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "dance in the distancetheres always tomorrowfree to loveloves silken melody inspirational romance reader contemporary collection 3",
        "description": "A collection of four complete, Unabridged Inspirational Romances in one volume.",
        "authors": "['Kjersti Hoff Baez', 'Brenda Bancroft', 'Doris English', 'Norma Jean Lutz']",
        "infoLink": "http://books.google.com/books?id=kWebYeXbIFEC&dq=Dance+in+the+Distance/There%27s+Alway%27s+Tomorrow/Free+to+Love/Love%27s+Silken+Melody+(Inspirational+Romance+Reader+Contemporary+Collection&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I loved this book. All four stories take 4 women, strong and independent, and create a beautfuil romance for each. It's perfect for that Christan romantic, and just makes your heart jump. Doris English's story was so very touching, and Brenda Bancroft creats a very deep charecter. All 4 stories are worth reading again and again. They never lose that sparkle that makes you want to cry everytime the girl gets her guy.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "These wonderful short stories are great. My favorite was by Brenda Bancroft. The charactor had real flaws that endeared her to the readers. The plot was fanatatic, kept me so engrossed I could not put it down. This is just the book for those stressed out because it can be read in short intervals. I have enjoyed this collection of stories as much as the first two. If you really like this there are also a collection of historical short stories by the same publisher.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "off the chain",
        "description": "Applies the lessons of African-American history to contemporary America, arguing that most Americans are living in a kind of servitude to corporate America, allowing themselves to be enslaved to a wide array of addictions, including television, sports, sex, and celebrity obsession.",
        "authors": "['Walter Mosley']",
        "infoLink": "http://books.google.com/books?id=_P51AAAAMAAJ&dq=Off+the+Chain&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This collection of short stories are nothing short of flammable...well-written, funny, and hothothot, fans of erotica will love them all. The constant throughout is Euftis himself, leaving the reader no doubts as to his willingness to explore all things physical....women will love this peek into the mind of a man, in stories told with such wild sexual abandon.....Fans of the sexy pen, watch out....Euftis Emery is threatening to take the heavy breathing to a whole other level. Read with a lover close by........DYB",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Euftis Emery is the male answer to the females Zane. Histales of sexual gratification in and out of the bedroom areoff the chain.............awesomely sexy read!!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I've seen some of the author's previous work and knew the book would be hot! This book is a combination of several (some not so short) stories with such detail, you can almost imagine you're sitting in a corner watching it happen. Without giving away details on any one story, I will say that Euftis Emery broached situations that people often fantasize about, but never vocalize. What I really like about it is that some of the stories are just wild enough that you wonder if they were conceived in Euftis' mind or if they are real experiences. This book definitely caters to your inner (or outer) freak. Very much looking forward to his next book!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Euftis gives notice of intent with the first line of his Introduction: \"Freaks have no boundaries\", but just in case you skip the Introduction he warns you in his Preface: \"You will be offended\" if you are a prude or sexually inhibited. My tastes in erotica are varied and slightly on the freaky side, so this book was right up my alley. Men will enjoy these stories more because they are generally more open to freakiness, but ladies if you want the 411 on exactly what your man requires of you in bed you have to read Euftis.These eighteen stories will tease and please you. Euftis keeps it real, and by putting himself in the frame he gives the stories a nice personal touch. If you want to get to know him a bit more personally click on the link to his website and prepare to be shocked!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Let me just start by saying, it was better than I expected. I think it was the knowledge of these stories being true that made it more erotic for me. With every story I felt myself getting aroused more and more. I do have a favorite of this book though, and that was \"The Room.\" I had a fantasy, but it in no way compared to this added fantasy inspired by this particular story. I was taken a back by his sexual creativity with women, and his ability to make women do what ever he desired no matter how nasty. He also made me chuckle with his experiences and his reactions to certain encounters. I am definitely ready to start reading Off da Chain Part II. I know this will be just as good if not better than the first, because something tells me your sexual peak will NEVER be reached. Keep up the good work Euftis.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Euftis Emery's \"Off the Chain\", is just that OFF THE CHAIN. This book should come with a warning label, be prepared to go on a wild ride with this one.Depending on your preferences, you will either be turned on, turned off or turned out.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book consists of a number of short stories written by author and self-confessed freak, Euftis Emery. The main character in most of the stories is Mr. Emery himself who writes with a sense of humor which for me was a welcome change. Some of the situations he writes about are funny and some were damn right off the chain!!My favorite was the one about the \"Bad D**k Report\". Some of the characters are featured in more than one story and Mr. Emery leaves NOTHING to the imagination...straight up front, bold and sexy! How refreshing!\"Off the Chain Volume 2\" is already on my \"to read shelf\" I hope Mr. Emery has done a better job with the editing in volume 2.I'm looking forward to see what sexy mind titillating plots Mr. Emery has for the lovers of erotica.LocksieARC Book Club Inc.Star Rating ****4.0",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "werewolves",
        "description": "A collection of short fiction includes the story of a boy's attempt to help a troubled classmate, a couple's bizarre visit to a real estate broker, and a young archaeologist's research in an American town",
        "authors": "['Michael Chabon']",
        "infoLink": "http://books.google.com/books?id=v_jBBt2CcgcC&dq=Werewolves&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I got this book for Christmas. I must say it is interesting. I agree with the other reviews, as it was a bit cumbersome to read at times. I guess that comes from the writing style, as the book was first published in the early 1900's. If your interested in the legend and myth of werewolves this book is priceless. It hasn't been watered down by tons of hollywood or mainstream info. The chapter that actually tells you how to become a werewolf was great. If I can find some raw opium and a wolf skin belt I'm in business!!",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book, originally published in 1912, was written by a British genealogist and historian Elliot O'Donnell. The information gathered within this book comes from old legends and folk stories that have circulated in Europe. There is a brief mention of other shapechangers, like were-leopards, -tigers and -bears, but the book clearly centers around \"werwolves\".Most of the information is given in the form of stories and legends, they are a very interesting read. As you read the stories, you can notice how most of the stories have a moral to them, in the same way as fairytales tend to have. You can almost imagine how these stories have been told in the dark to scare children and to teach them things like not to be too vain and proud.The book also contains some information on specific topics, like on how to become a werewolf, what is the spiritual side of them and if exorcism would work on a werewolf. The book has different chapters for some countries, including places such as Germany, Spain, British Isles, France and Finland.I highly recommend this book for those interested in the old were-legends. The stories prevent it from being a dry read, even if the style of writing might sound a bit old. Highly recommended for those truly interested in werewolves!",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "This volume is of incredible value from both an historical perspective and from a study of lycanthropy world-view as well. Comprehensive. I would highly recommend it to anyone delving into this fascinating behavioral syndrome and the history attached to it. Originally published in 1912 (I believe), you will find it heavy to read now and then but the insights gained are worth the effort. Not a &quot;neo-werewolf&quot; volume! Don't bother if you think Oz on Buffy the Vampire Slayer defines werewolves.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is actually a really great book, going into the matters of \"Werewolves\" though as noted before, it does touch upon the matter of other \"Werecreatures\" a little bit.First i must add, i didnt find this book cumbersome at all, to be honest I found it as as sort of \"light read\" that I could relax with.Mr. O'Donnel does an exellent job in taking us on a tour of the lore and legend concering the Werewolf in this book, going from the weretiger of Africa to the more known werewolf in europe.He mixes it up with stories from all over the world, some of which are quite sad and disturbing.I was really suprised about finding a book where the author has not let his own \"faith\" dictate his research, such is the case with M. Summers book about werewolves, but O'Donnel gives it to us in a fresh and informative way that may change your way of thinking concering the subject of werewolves.It comes out as a good read for any History, werewolf or mythology/lore fan, and you owe it to yourself to read this book, even just if its for the chapter on how to become a werewolf!(couldnt resist)Only thing I didnt like was that I felt it to be too short-once you read some you wanted more",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I purchased this book hoping for a well-written history of legends about werewolves - annotated and with source material quoted.That is not what this is.This is a collection of stories about werewolves - and the source for these stories is Elliott O'Donnell. Mr O'Donnell, by the way, is not an historian. He is a writer and spiritist. He states unequivocally that he believes in werewolves, and that he thinks they are formed by the evil spirits or elements that (in his opinion) also helped to create the world. His blend of shamanistic spiritism is big on imagination and short on facts. There's NOTHING about source material here. Not so much as one example. All the stories (very nicely written - there's no doubt about O'Donnell's ability to spin a good tale) are without attribution.The quotations Mr O'Donnell includes are notable for their lack of accuracy or the complete lack of existence of the works mentioned.This isn't what I expected. The information is incorrect, incomplete and based on Mr O'Donnell's personal beliefs. He doesn't provide any of the terrific sources available on this subject from the classics - it's just story after story after story after story...If I'd wanted a book called Tales of the Werewolf: A Collection of Chilling Stories by Elliott O'Donnell, I would have looked for that. I didn't want such a book - I wanted something that covered the primary sources of werewolves in documented history.Don't waste your time with this book unless a book of well-written fiction and a fair bit of blather about spiritism is what you're after.Definitely not recommended. I give this two stars for the effective writing style, but that's all.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Werewolves is the ultimate collection of fiction stories, diversly portraying werewolves as more than the typical murderer. Highly recommended for those who enjoy werewolves in more ways than the horror aspect.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "There are twenty-two talented authors included in this outstanding collection of werewolf stories. But the real prize is finding a Cheri Scotch story related to her very hard to find werewolf triology. My favorite story, though, is &quot;Dumpster Diving&quot; about finding an abandoned puppy in the dumpster and in the morning being faced with the task of caring for a baby... These are not, for the most part, slash and gore werewolf horror stories. Instead, these are a fine collection of thought provoking stories that are a real treat to those of us who wonder &quot;what if...&quot;",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the nimrod flipout stories",
        "description": "A bestseller in Israel, this volume of short stories--from a case of impotence cured by a pet terrier to a pessimistic Middle Eastern talking fish--is an extraordinary collection from the preeminent Israeli writer of his generation.",
        "authors": "['Etgar Keret', 'Miriam Shlesinger', 'Sondra Silverston']",
        "infoLink": "http://books.google.com/books?id=9g9FAwAAQBAJ&dq=The+Nimrod+Flipout:+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There are many fantastic short stories in this collection, _The Nimrod Flipout_, by Israeli author Etgar Keret. There are also many that are reminiscent of first drafts from a night-school creative writing class. When he's good, Keret is a fantastic new talent, full of humor and existential angst, but when he's not - he's trite, cliche, and boring - one more young guy writing about getting stoned and laid.The titular story \"The Nimrod Flipout\", is one of the best in the entire collection. Three young men are possessed, in turn, by the spirit of their friend, Nimrod, who killed himself after his girlfriend broke up with him. [Variety is also not Keret's strong suit. There are at least two other stories where someone kills themselves because they've been dumped.] After the narrator, the last to succumb to the spirit of his deceased friend, the possession repeats itself starting over again with Miron, the first to be possessed. It's a touching story about the frivolity of youth, and deeply tragic, as well; its also one of the funniest stories in the collection.\"Fatso\", the opening story, I also loved. It is about a guy whose girlfriend turns into a fat, drunk, soccer-loving man after the sun goes down, and how, after spending many nights going out and watching soccer at the bar with this character, he begins to love his girlfriend, too.This collection has its shining moments, and is highly recommended to fans of short fiction. However, don't be surprised if some of the stories dissapoint.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Some of these stories are brilliant, first round knockouts. Others are shtick-yawns. The best are like the wondrous short-short stories of Spencer Holst. The worst are whines from the slacker you'd never listen to for five minutes if you bumped into them at a bar. Buy the book for the wonderful, but expect a very mixed bag.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "Who knew the Magical Realist mantle would end up in Tel Aviv? (There's no better place for it!) This is a somewhat uneven collection of short stories, thus the missing star. However, it's extremely rare to find a short story collection where that isn't the case.Maybe he gets half a star back, and rounded up to the nearest star, because most of these tiny fables are incredibly good. Several are snort-wine-out-your-nose funny, some are perfectly sly, and others are sweet or poignant without sentimentality. A few lumber along unfulfilled, but just a few. (And they're really short.)He's very a fine writer even in translation, with clear eyes and no fear.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is a bit of a grab bag. It's a jumble of great and not-so-great stories, and you take what you get.Some of the stories are absolutely fantastic, creative, evocative, and perfectly told. Often, these excellent stories elicited strong reactions from me, or made me smile at their strange, wonderful, and twisted genius. The first story of the book, \"Fatso,\" is such a gem of a story (in structure, in its strangeness, in style, in images, in character, in a surprising dose of magical realism) that, in addition to reading it four or five times, I'm also going to photocopy it, and send it to two friends. I think they'll find it excellent as well.Other stories are not nearly as good.But, after reading several of the other Amazon reviews of this book, I wonder: perhaps all of the stories are incredible, and some just appeal to different kinds of people from others. Several reviewers and readers seem to agree that this book has some excellent and some not-so-excellent stories, but do they all agree about which are which? I saw that at least one reviewer really appreciated the book's title story \"The Nimrod Flipout.\" But this was one of the stories with which I was thoroughly UN-impressed. It didn't move or excite me, and the writing didn't seem all that compelling. On the other hand, I absolutely loved \"Halibut\" - it is one of my favorite stories of all time. Each of the occurrences it describes is brilliantly timed, and the whole thing fits together in a brilliantly peculiar way. But, I wonder, did everyone else think that this story was excellent? I don't know.So maybe all of the stories are excellent, and some appeal to people like me, and others appeal to different people. It seems possible. I'd be curious to know what other people think.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "bonechillers 13 twisted tales of terror",
        "description": "Thirteen stories of ghosts, vampires, witches, werewolves and more.",
        "authors": "['D. W. Cropper']",
        "infoLink": "http://books.google.com/books?id=uIvkgWLbPacC&dq=Bonechillers:+13+Twisted+Tales+of+Terror&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Though I have never read any of the more recent ghost story for young adult books (Goosebumps, et al), I did grow up as a huge fan of the Scary Stories series by Alvin Schwartz. And I must say, BONECHILLERS hits the coffin nail on the head! The author has done a fantastic job of crafting orignal spook stories with classic appeal. I highly recommend this great read for fans of the genre, young and old alike.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "These stories are all top notch. My favorite \"Vengeance and Wrath\" is haunting and original. A children's book, that is fascinating for both adults and children. GREAT!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I've always loved scary staries, even the ones that are directed to a much younger audience. I love reading these stories to my daughter or having her read them to me. She's only 7, so some of the stories in this book are a little too scary for her. I read them first in order to determine which were more suitable for her. The stories in this book are creepier than the stories in other books, like the Alvin Schwartz or R.L. Stine books. These are definitely true to their age recommendation, but I also believe that older kids and even adults will enjoy them.Mr. D.W. Cropper, let go of the accounting job and get going with this! We need more stories like these!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is really well written, the stories are interesting and can be a little spooky especially on a stormy night. He is very good at describing enviorments so i had really good visuals of what i was reading. And there is a cute little comic on the bottom of each page so as you flip the pages you see that little story unfold and its neat and cute!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I loved this book! It reminded me of the old school scary stories, like the ones in The Scariest Stories You've Ever Heard, or Chilling Ghost Stories. They're definitely catered to older children, but a few of them are mild enough for younger kids,(ages 6-8.) My daughter wanted this book, so I purchased it for her and made the mistake of reading the first story to her without reading it first myself. She couldn't sleep all night, so then I decided to look through the stories first and found a few that were better suited for her. They were all entertaining for me, and I would recommend them to any adult that likes reading creepy stories. Children will also love them, but they are creepy, so just make sure your kids aren't too sensitive, or else you're better off looking somewhere else!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "campfire stories vol 1 things that go bump in the night campfire books",
        "description": "Original and classic stories of adventure and ghosts. Each story has been chosen to be especially easy to tell from memory. A large-print outline follows each story to assist in storytelling.",
        "authors": "['William W. Forgey']",
        "infoLink": "http://books.google.com/books?id=nEmaAAAACAAJ&dq=Campfire+Stories,+Vol.+1:+Things+That+Go+Bump+in+the+Night+(Campfire+Books)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an easy book to tell stories from. There is a good section at the begining of the book, giving tips on how to tell stories At the end of each story, there is a review of the story in point form so you don't have to read them to your audience. You can actually &quot;tell&quot; them the story. The stories are adaptable to many settings and I have used many of them around different campfires for youth aged 5 to 18. The stories also have endings that will not have younger youth having nightmares and having &quot;accidents&quot; in their sleeping bags. I highly recommend it for any story teller, scouter, guide leader etc.",
                "review/helpfulness": "88/90",
                "num_reviews": 90
            },
            {
                "review/text": "I dont think the author of this book every sat at a campfire, let alone told a scary story. The 7 and 10 year olds at our campfire got up and walked away and the adults just moaned. Nothing but goody two shoes morals for endings and no suspence. Make up your own stories instead of purchasing this book.",
                "review/helpfulness": "16/22",
                "num_reviews": 22
            },
            {
                "review/text": "Should you need to pick between the available Scout campfire story books instead of buying them all, don't leave Dr. William Forgey's \"CAMPFIRE STORIES: Things that Go Bump in the Night\" off of your list.\"Stories to be good have to be credible\" is the advice Forgey gives, and it's the credibility factor that sets this collection apart. These tales sound so real your audience may not see them as fiction. Youths 11 to 15 years old, (the suggested age group) will believe them up to a point, and they will like them. Properly told, even an adult audience should find some meat this anthology. Although the book is marketed to Scout leaders in particular, these are not \"Scout\" stories for the most part. Your non-Scout youth group will like them.Besides the original stories created by the author, CAMPFIRE STORIES includes Forgey's masterful adaptations of uncommon vintage ghost stories penned by others, and even offers a true tale, \"Death of an Old Lion\" as told by Ernest Thompson Seton. Even a story by Mark Twain comes included. All of these stories are highly memorable, with entertaining, suspenseful plots. In \"The Valley of the Blue Mist,\" Forgey shares his version of this old story, which is found elsewhere under other names, but his is the best version I've yet seen.Only two of the stories out of the twenty were a disappointment: \"La Cucaracha Mine,\" a pointless, plotless hole, and \"The Indian Chief's Wait,\" which you will soon figure out is that familiar joke story, \"Falling Rocks\" in a poorly disguised form. The 5 stars are for the other eighteen \"must-have\" stories.At least the storytelling advice given in this book is practical and useful. Forgey includes a sequentially-numbered plot outline at the conclusion of each story, which I don't find necessary, but I'm certain many will find these most helpful. This book is a bargain!-Byron C. Justice, author ofHaunted CampsandViolent Night",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "men without women",
        "description": "NATIONAL BESTSELLER -> Including the story \"Drive My Car\"-now an Academy Award-nominated film-this collection from the internationally acclaimed author \"examines what happens to characters without important women in their lives; it'll move you and confuse you and sometimes leave you with more questions than answers\" (Barack Obama). Across seven tales, Haruki Murakami brings his powers of observation to bear on the lives of men who, in their own ways, find themselves alone. Here are lovesick doctors, students, ex-boyfriends, actors, bartenders, and even Kafka's Gregor Samsa, brought together to tell stories that speak to us all. In Men Without Women Murakami has crafted another contemporary classic, marked by the same wry humor and pathos that have defined his entire body of work.",
        "authors": "['Haruki Murakami']",
        "infoLink": "https://play.google.com/store/books/details?id=mSrWDAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "These are some the best stories I have ever read. When I was in high school, my class was asked to read In Another Country for discussion. It was my first Hemingway short story, and an introduction to the novels we would be reading. I almost cried. His writing is just so gut-wrenchingly honest and raw. No overwrought explanations of emotion. You know how these characters are feeling simply because of how the speak and act. Hemingway is the master of context. The Killers is almost like a mystery story that never gets solved. Why doesn't he run out of town? What's going to happen to the big guy? I love this stuff and can't get enough of it.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "&quot;Men Without Women&quot; by Ernest Hemingway features a glimpse into the genius that is Hemingway. I found it to be a great read during a summer weekend. I especially enjoyed the Nick Adams stories and the story about the matador fighting one last glorious bullfight (one of Hemingway's favoright subjects). &quot;Men Without Women&quot; deals with subjects both everyday and serious such as love and abortion. This short read by Hemingway makes a great introduction for anyone wanting to begin reading Hemingway. I highly recomend it.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Hemingway's short stories have always been hit &amp; miss with me. Some of them don't really do anything for me, none are among my very favorite short stories, but most of them are well-written and thought provoking. Such is the case with this set.Hemingway offers us an assortment of masculine characters, mostly picked from his favorite types of male personas: soldiers, bullfighters, mobsters and prizefighters. Despite the title of the book, there are a smattering of female characters in some of the tales. They rank with the standard fare of impetuous women that Hemingway likes to write about.The scope of the stories is quite broad, featuring painful topics such as abortion, breakup, heartbreak and being past ones prime. The latter theme is taken up in THE UNDEFEATED, THE KILLERS and FIFTY GRAND and later on re-appears in Hemingway's THE OLD MAN AND THE SEA. FIFTY GRAND, which details the demise of a washed-up boxer, is my favorite short story in this collection.Stories such as IN ANOTHER COUNTRY, and NOW I LAY ME introduce motifs that are echoed in A FAREWELL TO ARMS, which was published just a few years after MWW.Tho I've never been enamoured with the short story genre, Hemingway does rank as one of the best in the business - particularly in the American literary canon. Hence, followers of Hemingway as well as people who greatly enjoy short stories would likely appreciate this book.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "Not all short story anthologies are created equal. I have found a number of the short stories by Hemingway here in other anthologies. The premise here seems to be to highlight some of Hemingway's central writing themes- man and sport and manliness in general. No question that Hemingway is a man's writer. The subject matter of interest-bullfighting, gangsters, bicycle racing, boxing and the effects of the ravages of war on the male psyche bear this out.In some of the short stories like A Canary For One where he introduces a forlorn woman and thus strays from the theme he is on less firm ground. And that kind of sums up the problem of the whole conception behind this compilation. Unlike Scott Fitzgerald, his contemporary and friend, who was very comfortable writing about women Hemingway does not show that same talent. The sparse, to the point dialogue we have come to expect from Hemingway gets its ususal full workout here but not a nuanced view of a two-gendered world. Still The Undefeated and The Killers ( a very, very short story that formed the basis of a movie by that same name starring Ava Gardner and Burt Lancaster) are worth reading in any anthology.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Reading this reminded me why, though I admire Hemingway greatly as a writer, I am not really a fan. Men Without Women is a collection of 14 (often quite short) short stories. His stories are often powerful, occasionally very moving, but the subject matter simply does not speak to me strongly.The two longest stories here are variation on a theme: a matador's last fight (\"The Undefeated\") and a boxer's last fight (\"Fifty Grand\"). Though both stories have a brutal honesty that I admire, neither the world of bullfighting (which comes up again in \"Banal Story\") nor the world of boxing is particularly interesting to me. Others, of course, who find these subjects more appealing than I would find more enjoyment here.Hemingway is often considered a writer for men (as even the title of this collection implies), and there is some truth to that. Not only is the subject matter more likely to appeal to men, but the characters about which he write are predominantly men. Sometimes, even so, this leads to some universally appealing results, like his hitmen story \"The Killers\" and his brush with homosexuality in war, \"A Simple Enquiry\". Ironically, however, the best of his stories are those that feature women: the abortion conversation in \"Hills Like White Elephants\", the veteran who loses his wife in \"In Another Country\", and the young man betrayed by his girlfriend in \"Ten Indians\". These are the stories I will remember from this collection.There is so much about Hemingway to like. His spare writing style and his ability to end a story quietly is wonderful. His willingness to tackle subjects like abortion, drug abuse, homosexuality, and the horrors of war is admirable. Without a doubt, some of the stories in this collection rise to the truly magnificent. To some, I'm sure, Hemingway is a perfect writer and I can see the appeal. I just wish the topic he chose to write about were more interesting to me.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "creative storytelling choosing inventing sharing tales for children",
        "description": "Describes the storytelling process with tips on tone, pacing and atmosphere and includes ideas for related creative activities.",
        "authors": "['Jack Maguire']",
        "infoLink": "http://books.google.com/books?id=DqzXAAAAMAAJ&dq=Creative+Storytelling:+Choosing,+Inventing,&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Children NEED to hear stories, and not just from books. They especially need their parents to spend time with them, and storytelling is a wonderful way to do this.This book is full of good information, including some of the history of storytelling. Among others, there is a chapter on learning stories to tell, and another to help with creating your own stories. There is also an &#65533;afterward&#65533; that addresses storytelling in relation to environmentalism.Creative Storytelling is a book intended for parents, teachers, day care providers and librarians. It would also be a worthy read for camp counselors. I would recommend it to people in any of these positions.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "As a resource for families, teachers, and librarians, this book is readable and reliable. The stories and suggestions about how to tell stories are especially useful. I have used the book for over 8 years in my work as a storyteller in the classroom.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "If you aren't already completely enamored with stories and storytelling, this book will totally ensnare your heart! I am a teacher and bought it for some tips on telling stories and also to give my students ideas on writing them. As if I didn't already love stories enough this book made me want to read every single legend, folktale, and myth in print! I learned a lot about storytelling, writing your own stories and collecting the best stories. It is perfect for anyone that wants to spin a yarn with finesse and please an audience! Storytelling is a dying art and needs to be preserved. This book does it's part in training new storytellers to enter the magic world of storytelling. Highly recommend it!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is absolutely the best book I've found on storytelling for parents. The content makes logical sense, and is more of a \"How-to\" guide than any other book I've seen on the subject. If you are an aspiring storyteller with a small child (or children), this book will help you tell and/or create stories. Engaging your children in stories is also a great way to avoid the zombie tube.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Storytelling is almost a lost art, but many fond childhood memories involve a captivating story told at bedtime, or around a campfire, or perhaps during a designated storytelling hour. This is a how-to-manual which teaches the basics in a clear concise manner. The book contains well grounded concepts for use in imaginative flights of fancy.The chapters divide the subject matter into manageable parts so the skill can be easily learned. Chapters include -- Stories and Storytelling, Types of Stories, Finding Stories for Different Listeners, Remembering and Adapting Stories, Creating Your Own Stories, Telling Stories and Beyond Storytelling. Within these chapters is a wealth of detail to assist the adult in entering the world of the child. The author provides the basic storytelling formula and ways to adapt the story to the listener while maintaining the individual style of the teller and incorporating observation, experience and imagination.To continue the tradition of storytelling seems a sacred trust, something we must not permit to fade away, and this book will enable anyone interested in the pursuit to excel. The book is a gem.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "lesbian nuns breaking silence",
        "description": "Out of print for two decades, Lesbian Nuns: Breaking Silence, the explosive international best-seller, is back with a new foreword analyzing the unprecedented impact it had on the lesbian community and mainstream culture. In new afterwords, the co-editors reveal how the book came to be and what happened to their lives when, for the first time in history, a lesbian book from a small publisher went mainstream. Each nun in these stories describes her individual and searing path in, or out of, the convent to discover and face the truth of herself. Still myth-shattering, the stories remind us of the courage required to live-and love-in congruence with our authentic selves. \"Oblivious to the controversies that surrounded the initial publication of Lesbian Nuns: Breaking Silence, whether they originated within the Catholic Church or the lesbian feminist movement, thousands of readers across the decades have embraced the book and found their lives changed by its message of empowerment.\" - Joanne E. Passet, Ph.D., Professor of History, Indiana University East",
        "authors": "['Nancy Manahan', 'Rosemary Keefer Curb']",
        "infoLink": "http://books.google.nl/books?id=6fNYnQEACAAJ&dq=Lesbian+Nuns:+Breaking+Silence&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have seen this book on countless discount tables. I finally bought it and read it. This is not a tell all for lesbian nuns who reveal their sexual escapades while cloistered in a convent. This is a collection of stories told by ex nuns about their short stay in convents all across America. It is their story. Their life. Each of these women left for various reasons and all are now fullfilled in their life on the outside as out lesbians. There is nothing cheekie about this book. It is well written and well told. I am glad I finally picked it up and actually read it.",
                "review/helpfulness": "48/55",
                "num_reviews": 55
            },
            {
                "review/text": "In this book we encounter the biographies and personal photos of numerous nuns or ex-nuns who have \"come out\" as lesbians. they talk about how they came into convent life, how they discovered their sexuality, and how that altered their religious life. Very fascinating study.David Rehakauthor of \"A Young Girl's Crimes\"",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            },
            {
                "review/text": "I felt compelled to write a review, especially after reading the review by [...]. I was shocked and horrified that she wrote the these women entered religious life for romantic reasons. If you read this book, you will realize the love and commitment these women carried in their hearts for God as they entered their vocations. I think it is sad that just because [...] didn't experience her religious experience like they did, she can't believe their stories. There are too many stories in this book to just write these women off. If anything I think it is a sad but accurate portrayal of how often institionalized religion hurts and controls the people it is called to love. I never aspired to be a nun, but I have experienced both goodness and harm done in the name of religion. This is a must read for critics of the Church who have issue with the religious right as well as the Catholic church. This is also a must read for women everywhere in regards to the effects of patriarchy in society.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book is a stunning collection of beautifully written stories, of how women came to be themselves. Each of these women's journeys was at times painful, always heart wrenching, and always written in her individual voice. This anthology is not to be taken lightly. It is not filled with the lascivious sex that a teenage boy might think, but it is dozens of true stories of evolving women who come to learn who they are, and how they fit with their definition of God. An amazing collection of stories.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "no comebacks",
        "description": "Ten Stories from Frederick Forsyth with the Master's touch. Deception, blackmail, murder, revenge - these are the themes of stories that move from London to the coast of Spain, from Mauritius to Dublin to Dordogne. Whether his subject is assassination by stealth, the cruel confidence trick or the cold shock of coincidence, Frederick Forsyth is never less than compulsive, the detail always authentic. Ten stories with the master's touch - a brilliantly readable first collection by an incomparable craftsman of suspense.",
        "authors": "['Frederick Forsyth']",
        "infoLink": "https://play.google.com/store/books/details?id=Ca4M3dYkoc0C&source=gbs_api",
        "review": [
            {
                "review/text": "Forsyth is best known for his taut thrillers, especially The Day of Jackal, but this collection of short stories reveals him a very competent crafter of clever short stories. Originally written in the early to late '70s (and three of which appeared in Playboy), each of the ten tales is a mini-morality tale, with a lighthearted tone and a twist of some sort. Their unifying theme is revenge/comeuppance&oacute;each story is about someone getting their just desserts one way or another. The exception to this is \"Duty\", which is not light at all and quite different in theme and perspective, and for those reasons, feels wholly out of place.Two of the stories feature wealthy protagonists, including the title story, which tells of a handsome, successful English businessman who can have anything he wants from life and yet is still bored. It's the old \"money can't buy you happiness\" story, until one day he falls for a married woman. She admits the mutual attraction but won't leave her husband, and so the tycoon decides to send a hitman to solve the problem. The mechanics of the hitman's assignment are very compelling, and it all leads to an obvious twist that reaffirms the moral. \"A Careful Man\" is another rich man tale, but in this case, the wealthy coin dealer is dying of cancer and has no one he wants to leave his fortune to&oacute;least of all his detestable sister and her family. His solution is fairly clever and the fun is in watching the odious family catch up with what the reader already knows.Another set of stories feature unassuming hard-working middle-aged men who have yet to reap many fruits from their labors, and are generally married to unpleasant frigid nags. In \"The Emperor\", a bank manager vacations with his wife on a tropical island for the first (and probably last) time. It's basically the best experience of his life, and on the last day he quite daringly sneaks out for some sport fishing. This is transformative in a fairly predictable way, but satisfying nonetheless. In \"Money With Menaces\", an unassuming man comes across a \"swingers\" magazine on the train, and is intrigued by the idea of meeting a woman for sex. He falls right into an obvious blackmail scheme, but for once Forsyth hides the twist until the end, providing perhaps the best resolution of all the stories. \"Privilege\" starts with a small businessman who has been libeled in the newspaper and seeks redress. His lawyer dissuades him from suing, pointing out that winners of such suits usually incur huge financial costs that aren't worth the satisfaction of winning. Studying the libel statutes for a few days, he spots a possible form of redress. This story seems a little strange, as Britain has some of the harshest libel penalties in the Western world. \"Used in Evidence\" is about an old man who may or may not have killed his wife thirty years previously.Three of the stories are set in Ireland, a place Forsyth had a great personal interest in. \"There Are No Snakes In Ireland\" is a straight-out revenge tale, pitting a hard-working Indian student against his persecutor, a racist UVF thug. \"There Are Some Days&Ouml;\" is a comedy of errors about the heist of a truck of French brandy which goes completely pear-shaped. As in other stories, the reader knows more than the characters, and the pleasure comes in watching it all unfold. \"Sharp Practice\" takes place on a train, where a judge, priest, and humble worker pass the time with a friendly game of poker. Anyone who's knows a bit about con artistry will see the setup and likely result a mile away, but it's still good fun.All in all this is a very solid, if not spectacular set of stories. No doubt due to his journalistic background, Forsyth is great with the details of the stories, especially how people go about their work. His characters tend to be types rather than individuals, but for the kind of stories he tells, that's all you really need. As morality tales they are all set up and executed quite cleverly. And yet for all that, there's a kind of disposable element to them; none will make you sit up and say \"wow\".",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "Frederick Forsyth is an excellent author, and No Comebacks will serve as a fine introduction for readers new to his work. If you're already familiar with Forsyth, this is a collection of short stories similar to The Veteran. The stories in No Comebacks are shorter, usually about 20-30 pages each, ten in all. They are a little more lighthearted than the tone of Forsyth's novels, which are predominantly serious, and most involve an unexpected twist or turn along the way (sometimes saved for the very end). There's a story in here for everyone: a playboy in pursuit of a married woman, a victim of prejudice out for revenge, an answer to a mid-life crisis, a way to handle extortion, a response to a soiled reputation, and a unique way to settle an estate, to name a few. Timeless little episodes that are well-written and delightful to read.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "The short story demands a special talent and a special market. The diminishing market has, not surprisingly, just about dried up the development of talent. Back when the Saturday Evening Post, Sports Afield, the Farm Quarterly, Colliers and so many other periodicals kept a roaring fire under the genre we took swell short stories and short story writers for granted -- they were all over the place.Not a single name comes to me from those bountiful years -- I have to go back to Poe and the old master, Ambrose Bierce, to even throw out a couple of examples.The collection in No Comebacks was a welcome surprise, and I had to stumble onto the volume purely by accident, not knowing that Forsyth had even written short stories. He's got the talent for it, that's for sure.Any reader who appreciates good, crisp short stories will love every one of these by Forsyth. But maybe the audience for them has ebbed, too. Which may explain why this worthy book is not readily available.Doug Briggs",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Forsyth is a master of detail, encased in tight, fine prose. In this collection of short stories, his hallmark of fine fiction derived from real-life situations prevails in an assortment of unexpected, even surprising, tales mostly of ordinary people leading ordinary lives. Several command re-reading, especially \"The Emperor\", which women will hate and men will adore.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I've read this book many years back and recently I read it again. &quot;No Comebacks&quot; is a real great book. Every story has its' own impression. Amazingly every story gives one common impression of a real fix, i.e. No Comebacks. There Are Some Days, There are No Snakes.. and of course No Comeback are really very good stories. The beauty of the book is that there are soft crimes &amp; no violence. This is probably one of the best work of Forsyth !",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The ten stories in the book are on a wide range of premises, from a man plotting to kill the husband of the woman he loves, to an indian exacting revenge on a co-worker. Half of the stories are relevant to Ireland, a country which Forsyth has a great interest in.The stories are all very believable, and some of them have shocking twists which will make the book unforgettable.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Very few writers are equally good at both novels and short stories. I will not leave you in suspense - Frederick Forsyth is a better novelist. That is not a problem, however, as his novels are strong enough that he can dip a bit below that level and still be quite good. NO COMEBACKS demonstrates this.As one would expect from Forsyth, the stories in this collection often have either a violent or malicious undercurrent to them or explore the inner recesses of man's psyche. Many of the stories have a bit of a twist at the end, with some easy to see, others a bit harder, while still others appear to be apparent only to take a last minute swerve to somewhere else. My personal favorite is Money With Menace because it illustrates one of my favorite principles - you should not mess with someone even if he looks to be a sap because you never know when that other guy is tougher and nastier than you. The story Duty is out of place, which Forsyth acknowledges in a footnote. But as it is claimed to be true, I am glad it is included and the story did stay with me for a while after reading it.Forsyth unfortunately tends to be far too technical with some of his descriptions. Usually this is easily overlooked but becomes irritating in the story The Emperor with its details of fishing equipment. I suppose, however, that one does not earn Forsyth's reputation without an eye for detail and one cannot blame a man for showing it. Get the book to read a story or two between larger and heavier books and you will not be disappointed.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I have returned to this book time and again, and it never fails to grip... even though I have read the stories before. Forsyth is a master at his craft, and every one of these stories is sure to grab you, to tease you into trying to guess where he is taking you, and finally to surprise you with the twist at the end. I have recommended these stories to several friends, and all have agreed with my judgment. The plots of the ten stories include deception, assasination, blackmail, revenge, confidence games -- but each one is a gem unto itself... guaranteed to entertain the reader. I recommend No Comebacks very highly.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I loved the twist endings, some were funny, some insighrful, others a little boring, but the overall effect was good. Great writing style, and interesting enough plots for short stories and the irony of life.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "No Comebacks was the first short story collection that introduced me to the dark side of society in a way that felt incredibly real. I was a teenager when I came across an audiobook (read by Frank Muller) from Recorded Books.I was riveted to these stories of people who--more often than not--get themselves into strange predicaments and have to resort to violence or the like to get out. Often the stories end with a twist on the level of O. Henry (except more dire, of course) where we learn something new about the character(s) that Forsyth had previously held back from us.I have yet to read any of Forsyth's novels but I keep going back to this collection time and time again, enjoying them as much as the first time (perhaps more now that I am older and can identify with them more).",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "outdoor life if nature callshang up outdoor life",
        "description": "This collection of original and classic humor from the past 50 years of \"Outdoor Life\" magazine features colorful yarns by Patrick McManus and other outdoor writers. Photos.",
        "authors": "['Creative Publishing International']",
        "infoLink": "http://books.google.com/books?id=fgoBAAAACAAJ&dq=Outdoor+Life:+If+Nature+Calls...Hang+Up!+(Outdoor+Life)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If your looking for a perfect gift for that outdoors person this is a great choice. &quot;If Nature Calls...Hang UP!&quot; is a collection of hillarious short stories, cartoons and tall tales straight from the archives of Outdoor Life. They will not only have you laughing till you cry, but also remembering your own adventures. Whether it be a classic Pat McManus such as &quot;Poof - No Eyebrows&quot;, a story such as &quot;Sucker Bait&quot; by Paul Miller describing his youthfull adventures collecting wasp grubs, the problems associated with too much moose meat, buck fever, etc... This book will keep you rolling with laughter not to mention short of breath. I highly suggest reading this book with your significant other so they can take over when you can no longer read through the tears. In short if you need a good laugh and love then outdoors, &quot;If Nature Calls...Hang Up!&quot; is just the book for you.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book is a collection of 23 short stories, mostly related to hunting. Most of these stories (about 8 pages a piece)are hunerous and delightful to read.The stories in this book relate to almost every aspect of hunting and fishing. There is a story on rabbit hunting on horseback with a stick to riding a bear (inintentionally of course). Between each story is a humerous &quot;Tall but Short&quot;, a one page tall tale, that reminds me of stories I'd hear from old timers, as we would sit around a campfire in hunting camp.Why is there a &quot;but&quot; in my title? The only downfall I found with this book is the fact that the stories are taken directly from the magazine for the most part. If you are a religious reader of &quot;Outdoor Life&quot;, then you have likely seen these stories before. As only a casual rader of the magazine, I quickly remembered several stories. Some of the stories were worth a good laugh, most were worth at least a chuckle. A couple of the stories were worth nothing more than a shake of the head.If you are looking for book of humerous outdoor tales, this is definately a book to get. I was by no means dissappointed. However, if you are an avid reader of the magazine, I would spend your money elsewhere. Enjoy!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the magic orange tree and other haitian folktales",
        "description": "A collection of folktales gathered by the author in Haiti with comments on Haitian folklore.",
        "authors": "['Diane Wolkstein']",
        "infoLink": "http://books.google.nl/books?id=M2NLAAAAYAAJ&dq=The+Magic+Orange+Tree+and+Other+Haitian+Folktales&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I lived in a remote village in Haiti for five years and found this book while home in the USA for a visit. I found its stories unusual and charming -- and authentic! When I returned to Haiti I had a wonderful time with my Haitian friends as I related the stories I had read in this book and they would finish telling them with me and share how their mothers and fathers had shared these same stories with them.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "By the author's own admission, these stories weren't necessarily the best-told she encountered while researching folk tales in Haiti. The flat page lacks the beauty of the oral tale, and some of these stories may have been a little weak in the telling; but on the page they reveal a great deal about Haiti, and are a fascinating read besides.Folk tales reveal a great deal about a culture-what it values, how members of the society relate, what their beliefs are. These tales do exactly that. While they aren't as clear-cut, with a defined beginning, middle, and end, as American readers have become accustomed to, they do give away a great detail about Haiti. Life is unfinished; hardship is to be embraced and studied; the spirit world is right here at hand, not a million miles away above the clouds.Even on their own, they stand as a monument to the creative act and the power of the human intellect. These stories will infect your head like a virus, spreading and replicating, until you have to pass them on. Read them casually, and you will be enlightened. Study them seriously, and you may be transformed.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "If you're looking for stories with pat, solid endings, this is not the book for you. But, if you're looking for something that reflects the eccentricity and style of Haiti, then this is it. The stories are magical and you can almost see the people telling them for themselves! Kric?",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "The amazing thing about this collection is Wolkstein's introductions...she tells you about the teller and the setting in which each tale was collected...it is like taking a storytelling tour of Haiti. I require all of my storytelling students to read these intros to understand the variety of the storytelling tradition. Plus the stories are really great for telling. AND she includes the music! EVERY school and public library should own this!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]