[
    {
        "Title": "walking in victory experiencing true sanctification and holiness through gods grace",
        "description": "The author manifests insight into the full reality of the victory we have in Christ. He uplifts the Lord Jesus Christ, pointing to Him as the Victor over self and sin.",
        "authors": "['Charles Trumbull']",
        "infoLink": "https://play.google.com/store/books/details?id=dF3X8mBgf8cC&source=gbs_api",
        "review": [
            {
                "review/text": "If you've never understood God's acceptance and grace fully, this is a book you would definitely benefit from! McCallum obviously put a lot of thought into how he could make these deep truths easier to understand and apply. Personally, I love the tables sprinkled throughout this book. They do so much to make things clearer, and are a great resource for group bible studies!!Some of the many tables found in this book:&lt;> Comparing Biblical and Modern Love&lt;> How the Means of Growth (Prayer, Word, Fellowship, Ministry) work together and affect one another.&lt;> Our Old Self (in Adam) vs. Our New Self (in Christ)&lt;> Living under the Law vs. Living in Grace",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "What a great resource to have to work through personal issues and also bringing along a friend in their life-long walk with God. Eye-opening for the new believer; a trusted reference book for the maturing Christian who wants to see more of Christ in their lives and their output to others. This is a unique book that has no real equal on the subject of \"how to\" walk more-and-more in godly obedience (which is our victory).",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book recognizes that our actions flow from our beliefs. It does an excellent job of using the truths of the Bible to align our beliefs with God's love for us. Our good actions flow from God's profound assurance of freedom and love.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Reading this book in conjunction with a Bible study on Romans 6,7,8 was life changing for me and my husband - and our marriage. I often wonder how things would be if we hadn't read it.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read Walking in Victory years ago, when it first came out. I still refer to it regularly and think of its content often in my daily life, and I use the information in Bible teachings regularly as well. The charts help to make deep truths clear and memorable. This book is a must-read for anyone who wants to understand *and live* what it means to be a \"new creature\" in Christ. ~Kathy Hoffer",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I refer to this book often to get God's perspective on grace and my new identity in Him.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "McCallum's book helped clarify for me what it looks like to walk in God's grace. I have often shared the truths with others and refer back to it myself.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I really like this author's body of work. I've read all his non-fiction. He's very objective and can sound a little bit like notes from a lecture. But it is also emotionally productive, without the bells and whistles, unlike many Christian authors, and has genuine feeling and vulerability to appeal to anyone's subjective sensibilities. This book is my favorite from this author. He wrote that walking with God is about tranformation by the Spirit, not a change of behavior. The author makes points about principles and leaves the reader in charge of how to purpose God based on teachings from the Bible. This message is biblical and encouraging to anyone who has accepted Christ but doesn't know what to do next. This book is not a self-help book. It's not a method plan. Many Christians love the book of Romans and should really take a look at this book as extracurricular. This book is not a substitute for reading the Bible but a companion, conversation piece, the result of the word of God in the author's live - which the author states could happen to anyone who wants a personal relationship with God through Christ.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Walking in Victory is a great book that helps to expound and compile the information in the Epistles. After reading this book, many events and experiences in my life made sense. It was much easier to apply the biblical truth in a fruitful way.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "bumps are what you climb on",
        "description": "We can't prevent crises from happening. But we can successfully deal with them. In this classic book, Warren W. Wiersbe offers solid hope and comfort in times of depression, frustration, disappointment, or loneliness. He extracts wisdom from the Bible and presents it in thirty brief, accessible meditations that guide readers to respond with faith, trust in God's promises, reap the benefits of forgiveness, find contentment, and add joy to life. With uplifting teaching and empowering challenges, this insightful book is a compelling devotional for any believer at any time.",
        "authors": "['Warren W. Wiersbe']",
        "infoLink": "http://books.google.com/books?id=zwnfsgEACAAJ&dq=Bumps+Are+What+You+Climb+on&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "His books have been in my collection of favorites for years. I ordered this one months ago and have been reading a chapter once a week as an extra devotional. He uses scripture to parallel life experiences and balances it out with encouragement for all sorts of perils in this walk of faith we all take daily. This book is a pick me up when I have had a troubling day. Its a dash of salt when I have missed my communion with God on rushed days. You don't just sit down at an empty table with this book. WWW brings you to the table where he seats you next to Christ and you are in absolute communion with the Lord Most high. Great literature for anyone regardless of where their walk is with Christ.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Orginal copyrighted in 1980, this book is now in its 28th printing. Contains 30 different messages of encouragment that were orginally used on a late night radio program from Moody Church, Chicago.I'm going to use this as a resource for our church's 18 support groups.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "Over the years since I received a copy of this book in 1983 as I was diagnosed with multiple sclerosis, I have given away numerous copies because I felt the other person needed it. It is the only book I know that encourages without \"happy get all better\" stuff. Some diseases or situations really cannot be expected to have a happy ending, but that is when encouragement is most needed. If I could give it 10 stars--I would.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "When you begin to read this book, you will not be able to put it down. The Holy Spirit has spoken to me so cleary through His word, and this book. I have personally given away appoximately 30 of these books to family and friends, and have heard of God's faithfulness to each of them through this book. Weirsbe has a way of sharing, but ALWAYS references the Bible.You will love this book. Great encouragement for whatever your need, situation, dilema.I keep 10 of these books at home, always ready to give out.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Really enjoyed this booklet of 30 uplifting messages biblically sound and inspired - Wiersbe 's style is simplistic yet so engaging to read and ponder, a good read any time of the day to bless and encourage your heart - little golden nuggets of Word of Truth. God Bless",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is one of three of Wiersbe's 30 day devotional books - the other's are \"Turning Mountains Into Molehills\" and \"God Isn't In a Hurry.\" Of the three this book is the most encouraging. If you are depressed, discouraged, or downtrodden, or even feeling up, this book will pick you up even more. All the lessons are either expositions of one passage of Scripture or topical teachings that are designed to help you be optimistic because God is Sovereign and good and has a purpose for every aspect of our lives to shape our character and skills so that we can be used more and more for His grand ultimate purpose. I would encourage anyone reading this to buy several copies because it makes a great gift - especially for those who are going through tough times. I have purchased at least twenty copies over the years and given them away and they have been very helpful to those who have read and taken to heart it's Biblical wisdom and encouragement.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is a great little book. Though it's small, it's packed with amazing insight. I underlined much of the book, and found myself saying, yes, quite often. I feel this is one of those books everyone should read, no matter where you're at in your walk with Christ. I purchased five more, with intent to share them with others that I know would benefit from the messages this great little book provides.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "You can't go wrong with a book by Warren W. Wiersbe! He surely has a gift for delivering God's messages, quoting appropriate scripture references, and writing clearly so you understand and can apply what you've learned to your own life. I can't wait to order two of his other books: Praise, Promises & Prayers and With The Word.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the listener what if you could hear what god hears",
        "description": "Something strange happened to Sam Bennett this morning. One minute he was sleeping peacefully. Then he was having the strangest dream. And now-Sam is hearing things. Voices, from people all around him. The waitress in the coffee shop. The elevator operator in Sam's office building. His wife, his secretary, even his pastor. Sam now has insight into people's hearts. He hears their deepest needs just by being near them. But what can one listener do for a world of souls in need of help?",
        "authors": "['Terri Blackstock']",
        "infoLink": "https://play.google.com/store/books/details?id=8XEsIa--m20C&source=gbs_api",
        "review": [
            {
                "review/text": "The Listener is a small book that is easy to read in a short amount of time. But it is a small book with a tremendous impact.Through the fictionalized story of Sam Bennett and the result of a God-given ability to \"listen\" to the thoughts of those around him, the reader realizes that although this book is fiction, he should be \"listening\" to those around him every day. Just as Sam teamed up with his pastor to share Jesus with those whose thoughts alerted him of the need, every opportunity to make a difference in the lives of those around us by sharing our faith should be taken advantage of.This book will get you excited about telling others about your faith. It will get you excited about going out in public specifically to find someone to talk to. It will get you excited about chatting with your neighbors and finding our how you can help meet their needs.You will never be the same after you read this book by Terri Blackstock. It will change your life and make you more aware of the needy world we live in.When you buy your copy you might as well buy two because you are going to want to give one to a friend!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book should be \"required\" reading for every Christian. Each day our lives cross paths with those who need to know the peace of God. We pass them by, simply because we are not \"listening\". This book, \"The Listener\" will help you to see how easy it is to minister the love of God to others, and offer them hope through a personal relationship with His Son, Jesus. You will get \"caught-up\" in the events that take place as the main character hears the \"silent cry of the soul\" of those he encounters. You will realize you need no \"special gift\" to offer hope that comes from knowing God. Your desire to be more tuned to the world of the Holy Spirit will be elevated. This is the most \"non-fiction\" fiction book I've read. Watch out because it could change your life! A \"keeper\"!",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book gets to your heart! I couldn't put it down.It's a great book to share or give as a gift.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "That is what this book made me want to do. I wanted to drive to the mall and just start talking to people about Christ. The story premise for this book was a great idea. I was challenged and excited. MUST READ for all Christians!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is abook about a man named Sam who has adream that gives him the power to here what god heres. So through out the book he goes about to different places and heres peoples spiritual needs and tries to fill them. In the end everyone he talks to ends up excepting Christ as thier lord and savior.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I am I huge fan of Terri Blackstock. I have trouble reading but after reading this book, I was hooked on to it. I took 3 days to finish the book and it inspired me a lot. This book gave me a new perspective in terms of my faith in God. Wonderful book, I highly recommend this book!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I hate to read but this book pulled me in and was tought to put down. I finished it in 2 nights and my normal time for a book is about 6 months.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "When I picked up this book, I didn't actually realize that it was a fictional narrative. I expected more like a practical, self-help book. The storyline is quite simple and takes place mostly over the course of one day. Sam hears a sermon about 'listening to others' and that night, he has a dream which turns out to be a prophetic vision. God has opened his heart and now he can hear the deepest desires, feelings and yearnings of those around him though they are not expressed verbally. The first scene occurs when he goes to a coffee shop and finds himself responding to what he assumes people are \"saying\" although in actuality they're not talking. Unfortunately, I had a hard time getting past the way it reminded me of that Mel Gibson movie, \"What women want.\" Nonetheless, it's a moving story of the ways in which we fail to hear and respond to our neighbors and how everyone HAS these deep desires in their hearts which are unspoken.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "It can easily be read in an afternoon, and is very inspiring. I would highly recommend it",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "just past oysterville shoalwater book one",
        "description": "A child abandoned. A life destroyed.Two hearts, unable to forgive...After a drunk driver leaves young Cassie Belanger an orphan, a cryptic letter, found among her mother's belongings sends her on a desperate journey in hopes of finding the man who fathered her but chose not to be her father.Driven by her anger, her bitterness and her desire to confront the man who abandoned her, Cassie meets Jack, a crusty old bachelor headed in the same direction. In his face Cassie begins to see what can happen to a heart that refuses to forgive.Will she forgive her father, or turn away from him and remain an orphan? Who is Jack, and how is his own shadowed past linked to her own?Will Cassie Belanger find the power that lies in forgiveness and the miracle of God's unwavering mercy?The answers lie... Just Past Oysterville.",
        "authors": "['Perry P. Perkins']",
        "infoLink": "http://books.google.com/books?id=wFsiQwAACAAJ&dq=Just+Past+Oysterville:+Shoalwater+Book+One&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Even before I read JUST PAST OYSTERVILLE, I knew Perry Perkins was an amazing writer from reading one of his short stories, but this book placed him permanently within the group of authors whose books I will buy immediately upon release.This book is so much more than the usual hyper-censored, unrealistic story to be found in Christian fiction. The characters are real people with strengths and weaknesses, and they live real lives filled with anguish, love, mistakes, and triumphs. And the underlying message of God's love is relayed so effortlessly and so poignantly that it comes through loud and clear and leaves the reader with such a wonderful feeling of hope--just the way I believe Jesus would have done it.I encourage everyone who loves a good story to read this book, and I can't wait to read the next installment in the series!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I thoroughly enjoyed every page. There was not once where I knew what was going to happen next. Every time I thought I could predict anything I found myself to be wrong. A sign of very good writing in my humble opinion. It was a very exciting, thought provoking book.This was a book that was difficult to put down and I was sorry to see it end. Fortunately I hear part two is coming soon and I will be the first in line to get a copy!If you're looking for a great book, be it a novel or a lesson in forgiveness, look no further. You won't be disappointed.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I loved the book. I would recommend it to all. Please read it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "louder than words the power of uncompromised living",
        "description": "Your character, more than anything else, will impact how much you accomplish in this life. It is more important than your talent, your education, your background, or your network of friends. Andy Stanley helps you chart a course toward becoming a man or woman of character. You'll discover a definition of character that will inspire you for a lifetime, the external and internal benefits of strong character, the six false beliefs behind negative behaviors, and more. Using practical insights, biblical exposition, and engaging stories, Stanley guides you step-by-step in setting the personal goals that will build the foundation for true success. The Secret to a Life with No Regrets How important is your character? It determines everything about you! How much you will accomplish in life, and whether you are worth knowing. How you will respond to success, and how you will weather the inevitable storms of life. This is a book about uncompromised living. It is about choosing every day to be a man or woman of integrity, a person whose actions speak louder than words. Bestselling author Andy Stanley challenges you to become what you were meant to be: a person whose commitment to doing the right thing, whatever the cost, will inspire others and change your world. Story Behind the Book As a pastor, I spend a substantial amount of my time with people who are digging themselves out from personal environmental catastrophes-circumstances that were often years in the making but \"took them by surprise.\" Another group of people have faced, or are facing, storms of life that are not of their own making, storms created by the character deficits of others-storms that are a natural part of a fallen world. There, in the midst of unjust treatment and seemingly undeserved pain, the true character of a man or woman is revealed. What you see in such moments is what was really there all along. This book is about change. It's about the process of taking raw materials and molding them, shaping them, and refining them into a finished product. Whether you know it or not, that process is happening in you. Your character, not your accomplishments or acquisitions, determines your legacy.",
        "authors": "['Andy Stanley']",
        "infoLink": "https://play.google.com/store/books/details?id=9D7ghu4j_XMC&source=gbs_api",
        "review": [
            {
                "review/text": "The author seems to be a good writer and he gets his ideas across very clearly. The tone is conversational and it is an easy book to read. And though I can see how some might be inspired by his words, I did not care for the book.I'll limit my critique to the assertion made by the author that genuine Christianity will not necessarily result in a changed life. Here are the direct quotes from the book:\"While Christianity does change our eternal destination, it's no guarantee that our behavior here on earth will be altered.\" (87)\"Being adopted into God's family does not necessarily, instantly, or automatically improve your character.\" (87 emphasis added)\"Being a Christian doesn't guarantee change.\" (89)These statements are not biblical; they're antithetical to what the scriptures teach us. In James 2 we learn that a faith that does not produce works will not save us. In verse 14 James writes, \"What good is it, my brothers, if someone says he has faith but does not have works? Can that faith save him?\" In verse 26 he writes, \"For as the body apart from the spirit is dead, so also faith apart from works is dead.\"I am not suggesting that we are saved by works. The bible is abundantly clear that we are saved by grace through faith and not by works (Rom 3.20; Rom 3.25,26; Rom 5.17-19; Gal 2.16; Gal 3.11; Gal 5.4). But the scriptures also teach us that faith that is genuine always produces works of righteousness.Andy Stanley claims that being a genuine Christian doesn't guarantee a change in our behavior in this life. I would say that being a genuine Christian absolutely guarantees a change in our behavior in this life. But what do the scriptures teach us about this?One of the clearest places in scripture regarding this matter is found in 1 John 3:4-10:4 Everyone who makes a practice of sinning also practices lawlessness; j sin is lawlessness. 5 You know thatk he appeared to l take away sins, and m in him there is no sin. 6 No one who abides in him keeps on sinning;n no one who keeps on sinning has either seen him or known him. 7 Little children, o let no one deceive you.p Whoever practices righteousness is righteous, as he is righteous. 8 q Whoever makes a practice of sinning is of the devil, for the devil has been sinning from the beginning. The reason the Son of God appeared was r to destroy the works of the devil. 9 s No one born of God makes a practice of sinning, for God's [2] seed abides in him, and he cannot keep on sinning because he has been born of God. 10 By this it is evident who are the children of God, and who are the children of the devil: whoever does not practice righteousness is not of God, t nor is the one who u does not love his brother.Now when John says No one born of God makes a practice of sinning, It's clear that he does not mean that Christians don't sin, for he says in 1 John 1:8 If we say we have no sin, we deceive ourselves and the truth is not in us. So what does John mean when he says No one born of God makes a practice of sinning?According to Wayne Grudem, John does not mean that Christians don't continue to sin, but rather \"Once we have been born again we cannot continue to sin as a habit or a pattern of life (1 John 3:9), because the power of new spiritual life within us keeps us from yielding to a life of sin.\" (Systematic Theology - an introduction to biblical doctrine - Zondervan, 1995)In addition to telling us that genuine Christians will not continue to sin as a habit or pattern of life, John says in verse 10 that it is precisely this change in behavior that is the evidence of who is truly born of God! He tells us that whoever does not practice righteousness is not of God!John MacArthur agrees with this when he says, \"True repentance and life-change are evidence of true saving faith.\" (The Gospel According to Jesus - Zondervan, 1988)It seems clear that Andy Stanley's assertion that being a Christian doesn't guarantee change is simply unbiblical. And Stanley does not himself offer up any scriptural support for his errant assertion.There are many other scriptural texts that teach us that genuine saving faith always produces a change in the heart and actions of true Christians. Romans 6:20-22 reads,20 v For when you were slaves of sin, you were free in regard to righteousness. 21 w But what fruit were you getting at that time from the things x of which you are now ashamed? y For the end of those things is death. 22 But now that you z have been set free from sin and a have become slaves of God, b the fruit you get leads to sanctification and c its end, eternal life.In a sermon on this text, John Piper, author and preaching pastor at Bethlehem Baptist Church in Minneapolis says, \"So the big purpose of Romans 6 is to show why justification by faith always brings sanctification with it. Or as the old-time teachers used to say: this chapter teaches why the faith that alone justifies, is never alone, but always brings a holiness of life with it.\"So we are not saved by works, but by faith alone - and saving faith always produces a change of character for those who are truly born of God.Evangelical Christianity has tended to reduce salvation to an alter call experience. It is absolutely true that many have been saved at a moment in proximity to their alter call experience. But many have not. We are not saved by simply praying a prayer or making a commitment with our mouths. The scriptures teach us that it is God who makes us alive in Christ. And as we had a passive role in our physical birth, so we have a passive role in our spiritual re-birth. In John 1:13 we read that those who experience regeneration are \"born, not of blood nor of the will of the flesh nor of the will of man, but of God.\" Grudem writes, \"In the work of regeneration we play no active role at all. It is instead totally a work of God.\" (Systematic Theology - an introduction to biblical doctrine - Zondervan, 1995)We see this in Ezekiel 36:25-27 where the prophet writes the words of God:25 e I will sprinkle clean water on you, and you shall be clean from f all your uncleannesses, and g from all your idols h I will cleanse you. 26 And I will give you i a new heart, and i a new spirit I will put within you. i And I will remove the heart of stone from your flesh and give you a heart of flesh. 27 j And I will put my Spirit within you, i and cause you to walk in my statutes and k be careful to obey my rules.It is precisely because the new birth is a work of God and not of man that it is guaranteed to produce sanctification.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I challenge you to read this book. Even if you are none of the things above, chances are you know someone who is. So buy the book for them (but read through a bit yourself).Andy writes like a person carrying on a conversation with you. He constructs scenarios that leave you with a handful of questions, and then he answer them one at a time with practical advice and scriptural support.This is a book about integrity and character. Andy provides real solutions that you can start implementing in your life immediately to start combating each character issue. You will see yourself, and the people around you, very differently after reading this book. You won't regret this change.I bought this book for each of the 11th grade guys in my small group. If you are a father, I recommend buying 2 copies and reading it along with your teenage son or daughter. Maybe schedule coffee every other week, and discuss one chapter per sitting.Andy says that every day you are either growing closer to, or further away, from the person you want to be. This book is a guide for those who desire to be deliberate about becoming the person they wish they were all along.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was so well written and so applicable to my life, but to be honest, it would be so for pretty much any body's life. And to be completely honest with you, Andy Stanley is such a great speaker and writer that I recomend just about any sermon or book by him. He has such a unique, but basic view on things and how they should be, and he is very well gifted in getting them across. He can make something as \"everyday\" as the Lord's Prayer not just interesting, but captivating. So, to get back to the book, If you're looking to not just improve your character but actually understand what character is, this is the book for you.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is an excellent book, but I cannot recommend the Kindle edition. Again, it's a good read, but buy the paperback.I suspect that this electronic version was published without being proofread. There were so many mistakes throughout the book--e.g., missing apostrophes, \"you'll\" rendered as \"you 11,\" and other words that were unintelligible--that it was distracting. There were times when I had to consult my husband's paper copy just to make sure I understood a sentence or phrase as it should have been written. Please understand that the comprehension difficulties had nothing to do with Mr. Stanley's argument or writing style, they were completely due to a horrible rendering of the text into the Kindle version.I enjoy my Kindle. I prefer to read on it. However, I find it extremely frustrating when I come across a book that has been released with so many mistakes. No editor worth her salt would allow this to happen in the \"paper world,\" why should it be allowed in the e-world?",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the search for significance devotional journal a 60day journey to discovering your true worth",
        "description": "This brand-new 60-day devotional journey invites readers to reflect, discover, and learn how to implement, on a daily basis, the principles of \"The Search for Significance.\"",
        "authors": "['Robert S. McGee']",
        "infoLink": "http://books.google.com/books?id=RJEumQEACAAJ&dq=The+Search+for+Significance+Devotional+Journal:+A+60-day+Journey+to+Discovering+Your+True+Worth&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I was lost then I was found. God answered my prayers and put this book into my life. Dr. Robert McGee's books continually inspire me to become closer to God. What I love about this devotional is the everyday process of mending my relationship with God. With many books I was unable to see the progress that I was making; however, this book let me easily see where I started and the path I was taking.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is an amazing read and will open your eyes to your inner self. It will assist you in breaking down the barriers you have put up since childhood. It will give you a new outlook on yourself and others and how you perceive things. Definitely a read that will be beneficial to anyone who is searching...",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book reveals the damaging lies we believe and shows you the true source of self worth and self confidence.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This study is wonderful for helping you change your view of yourself by shifting from the world view to God's view. The journal is a tool which should be used in conjunction with the bible study.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I got this book on a recommendation from a family member I have never met, ut found over facebook and boy did I not know what I was getting into. I am so grateful for this book, as it has aided me in understanding the nature of Christ. I am someone who has battled illness (mentally and physically) in my life and this book has given me the strength to stop thinking soooo much about myself and begin to focus on others, which I believe is leading to my own healing. It's a monumental book and I recommend it to anyone looking to find their purpose in life. If you feel lost, this book can help you find your way... if you let it.I also particularly love that it uses scripture to help solidify the points it makes.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "One of the best reads you will ever make. There is no debate regarding should you or shouldn't you, as far as I'm concerned. Buy this book and take the time to really read and answer the reflective materials included. I can't recommend it enough. Absolutely life changing.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "treasure principle",
        "description": "Readers of Randy Alcorn's bestseller The Treasure Principle encountered a revolution in material freedom and generosity that utterly changed their quality of life. In this companion Bible study, the principles become personally applicable and more real than ever, with a powerful combination of biblical concepts, practical quotations from the book, thought-provoking questions, group discussion starters, and short Scripture passages for meditation and memorization. Managing God's investment in their lives will become a new delight, as Christians learn to put their resources to their most rewarding use.",
        "authors": "['Randy Alcorn', 'Brian Smith']",
        "infoLink": "https://play.google.com/store/books/details?id=DtzBm-IBSe4C&source=gbs_api",
        "review": [
            {
                "review/text": "I got this book at a church. They were giving them away for free. I decided to read it, because I'm interested in giving and tithing. I have to be honest: I thought this was going to be another \"Rich Christian\" book, the kind that give you strategies for reducing debt, being a good steward, and investing responsibly in the stock market, giving a good portion of your profits to the local church.I was wrong.While there are some things about this book I don't agree with--at one point Alcorn says that financial stewardship is central to our spiritual lives(I'm paraphrasing)--the overall theme is actually pretty good. Almost two-thirds of the book is devoted to giving. But not just the usual give to your local church because you should type of giving. Alcorn calls Christians to give generously, until it hurts. He even gives an example from his own life which was quite impressive.If you're looking for a book on giving, The Treasure Principle is a good place to start. It isn't a very deep work, but it is surprisingly refreshing in a world of \"gimme, gimme\" Christians.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "-- Who wants to know why their giving doesn't work?-- Why, when you give, is the joy not there?-- Why, when the pastor does a series on giving at the beginning of the year is there a feeling that the church is trying to get into your wallet?-- If we think about tithing, why is there endless debate on gross versus net?-- Why, if we are trying to make prosperity giving work, do we feel fear that if we give, God won't give back in a large enough measure?Dr. Alcorn deals with these questions and more in the delightful little book. This is a book for those who really want to understand God's perspective on giving. It is not \"give and I'll bless you back,\" though He does say that He loves cheerful givers. It is not about the amount or percentage that we give. It is not about when or where we give. It is about our hearts and giving.Are you willing to explore the thought, \"Lay up for yourselves treasures in heaven, where moth and rust do not corrupt, nor thieves break through and steal\"? The Treasure Principle drills down on this thought and other key verses that help the reader understand that God is concerned about what our focus and perspective are, not on how much money we give. He is concerned about where our hearts are--compared to where they should be--not where our pocketbook is. He is concerned about the treasures we are collecting--and where we are storing them.Armchair Interviews says: This little book packs a punch, and it is backed by Dr. Alcorn's own experience of seeing The Treasure Principle at work in his life and the lives of those involved with his ministry.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Finally, a book that is able to encourage joyful, sacrificial grace giving without brow-beating people with a guilt-trip on tithing! Finally, a book that takes a scripturally sound approach to this important area of Christian doctrine and practice! Finally, a book that offers hope to escape the bonds of slavery to our own materialism!Pastor Randy Alcorn does a marvellous job in this small volume of unpacking truckloads of truth about how God intends His people to handle the money He entrusts to their stewardship. God intends for us to invest it, in ever increasing proportions, for the expansion of His kingdom -- not ours. God also intends for us to learn what it really means to trust Him, as He prompts and enables us to give \"even when the bottom line says we can't.\"God's \"inexpressible gift\" of giving is counterintuitive to most of us. Our normal mindset, heavily influenced by the world's materialistic bent, is to horde as much wealth as possible for ourselves. This is true even in the church, where more and more believers are giving themselves over to the materialism that our culture says we are entitled to pursue and enjoy.It pains my heart when I see believers who will spend many hundreds of thousands of dollars for a 4,000 square foot house, and tens of thousands of dollars on a new luxury car or SUV, but can't seem to find a hundred bucks to support a short term mission trip. Those dear brothers and sisters are caught in a snare of the enemy. Randy Alcorn's small but powerful book tells them how to escape -- by giving away worldly wealth to store up eternal riches.Scripture teaches, and I have found by my own experience, that the more we have, the more we want, and the more we have to worry about. When we implement the Treasure Principle in our own lives, God delivers us from the bondage of materialism and prepares a far richer, eternal inheritance that is out of all proportion to the pittance even the most generous of us are able to give in this life. We have experienced just a taste of this for ourselves, and look forward to the day when we can \"excel in this grace also.\" Many thanks to Randy Alcorn for sharing his insights and experiences.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Hands down, this is one of the best studies ever done on the gift of giving. Randy Alcorn has done a surper job of taking a tough life issue and wraping it into a wonderful package. The treasure principle is simple: \"You can't take it with you, but you can send it on ahead.\" This truth affects every aspect of our life as Christians.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you desire to know the joy that Christ promised His followers; read this book! It is radical, yet profoundly biblical. Finally, I have the answer to the questions I have been asking in my many years as a Christian. I read in my Bible that Christ tells us not to love the world, nor the things of the world; to store up for yourselves treasures in heaven, not on earth; to give as the widow who gave all she had; not to be as the rich young ruler, etc. But, in America, Christianity is generally not practiced in this way! And, it is no wonder that we do not see the kind of joy that Christ promised either. If you are hungering for \"abundant joy\" and are ready to \"put your money where your mouth is\" then read this book. I purchased 20 copies and will buy more. This message needs to be heard!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book will challenge you about your giving back to the Lord, even if you think you are already following Scriptural principles on giving. This book is NOT a guilt trip in any way. It will make you think. Randy Alcorn practices what he preaches and you will be amazed by his own personal story on giving. Buy two books: one for yourself and one you will want to give to someone after reading this book. This is a must read book for every serious Christian.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I was given this book free to review from Waterbrook Multnomah.I must say that I'm glad I didn't buy it. I was very excited to read it when it came, but was very disappointed once I had read it. I think that I am just not at a stage of my life for this book to be relevant to me, nor is the country in a financial state for it to be as relevant as it was 10 years ago when it was written.On top of that, I felt that the author used out of context scripture and circular logic to argue his point many times. He began every chapter with an out of place cliche or a story about a miserable millionaire. (Plus based on his other book titles, it seems that he fancies himself to be C.S. Lewis, but his eloquence is definitely lacking...)I did not disagree with many things that he said, mostly just the way he put things. I do think that people should give as they are able. He did try to make an argument for what types of organizations should be given to and which are not as worthwhile, and I think that is a very personal decision that he has not much business delving into.I also did not like how he assumed all of his readers had plenty enough income to spare, and that his main motivation for giving was so that he could be some sort of big shot in Heaven. I guess he thinks the homeless christians are going to be screwed over in Heaven too since they have nothing to give on Earth?? I just don't think that is how it works, nor should that be the motivating factor in giving.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a terrific,quick read. It is entertaining and memorable. Lots of great Scripture refs.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Randy Alcorn's \"The Treasure Principle\" is a book of very strong encouragement to give to the church and to charities the church supports. It includes all of the usual Bible verses on tithing and giving, along with Alcorn's personal experiences with giving, all of which are fine and appropriate for the topic.However, I did feel there was a bit too much \"this is what I did\" in this book. I very much disagreed with Alcorn's opinion that giving should be a competition, and that Christians should be basically comparing what they give to what their friends give, in some sort of friendly way of encouraging one another. I believe that human nature can all-to-easily turn friendly competition into gloating and self-glorification, particularly where religion is concerned. I also was very turned off by Alcorn's story of his forced salary-reduction due to the results of a lawsuit. I found myself all too often focused on the author's situation, rather than on the actual topic of giving.There were also many great Biblical verses, points and examples in this book, but I believe that the majority of these are covered just as well in other books on tithing. I much preferred Nelson Searcy's \"Generosity Ladder\" to this book.Please note that I received a complimentary copy of this book from WaterBrook Multnomah, through their Blogging for Books program, in exchange for my honest review. The opinions stated here are my own.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Show me how you spend your money and what you treasure most and I will show you your real god. That's the truth of the gospel and that is the truth articulated in the wonderful book The Treasure Principle: Unlocking the Secret of Joyful Giving by Randy Alcorn. The book isn't about money, but about treasure. Its about joy.There's no doubt that Jesus talked a lot about money. As Alcorn points out, Jesus talks more about money than He does about heaven and hell combined. There is good reason for this. Alcorn writes:Why did Jesus put such an emphasis on money and possessions?Because there's a fundamental connection between our spiritual lives an dhow we think about and handle money. We may try to divorce our faith and our finances, but God sees them as inseparable. (9)He's right. Show me how you spend your money and what you spend it on and I will show you where your treasure is. Or as Jesus put it, where your money is, there your heart will be also. Alcorn shows that sacrifice presents us with the gift of joy. This goes against natural wisdom. Normally, we think wealth and possessions make us happy (who doesn't want to be rich right?), but Alcorn shows biblically and scientifically that that is not the case. For example, Alcorn shows a study that compares lottery winners with the paralyzed. Though at first the lottery winner is joyous over their fortunes and the paralytic is distraught by their paralysis, years later their roles begin to change. The lottery winner finds themselves not as happy as they had intended. The paralytic, on the other hand, slowly begins to enjoy life again.This does not mean that we ought to seek out poverty or paralysis. What it does mean is that real joy is not in what we own but in the gospel. The treasure principle is in the gospel - Jesus Christ Himself.I highly recommend this little book. One can easily read it in one sitting. It is simple to read and can be enjoyed by believers of all walks of life. It is a message we need to hear. In a culture as rich as ours chasing our tails of greed, we need to hear Alcorn on this.I received this book for free from WaterBrook Multnomah Publishing Group for this review.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "ending the search for mr right how to be found by the man youve been looking for",
        "description": "Bestselling author Michelle McKinney Hammond, whose books have sold over 1.3 million copies, encourages single women to place their need for love in perspective, take their lives off hold, live purposely, and gain a better understanding of how to relate successfully to men. In her candid, no-nonsense style, Michelle assures the reader that the journey toward finding a mate for life does not have to be filled with anxiety or regret. She warmly offers encouragement from her own life experiences and gleans godly principles from Ruth, a sister in the Bible who got her man, to show readers how to get the love they want. Those stuck in the dead-end dating scene, along with those on an involuntary relationship fast, need to know that marriage could very well be on the horizon...if only they learn how to be found by the man they've been looking for. Formerly titled Ending the Search for Mr. Right",
        "authors": "['Michelle McKinney Hammond']",
        "infoLink": "https://play.google.com/store/books/details?id=e7-ikp_PCjkC&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book yesterday and I have not yet finished it, but already I must sing its praises. I just read another two chapters at lunch and can't put it down.It is a great source of comfort and wisdom for those of us searching for a mate. God is already our Soul Mate, as the author explains, and once we acknowledge and accept this, we are content to be the best we can be and not push, pursue or rush anything with members of the opposite sex. Trust in the Lord to provide.She gives very practical advice with biblical testimony to back it up - we must wait and be patient trust that God who loves and cares for us more than anyone on earth ever will, will provide the right partner when He is ready - not when we feel we are ready.This is just what I needed to hear as I go through another challenging time in this area of my life. What a blessing it was to stumble upon this book! I can't recommend it highly enough.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "I can't not reccommend this book enough.. I am an avid reader, and have plenty of books to still read, however I read this book in 1 weekend and I am re-reading chapter by chapter, I am taking notes of the \"gems\" contained and journaling the questions she poses.. this book is really a Divine-inspired healing tool for women. I have recommended this book to many of my friends, co-workers, etc.. It is one of the best!",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "As a guy, you want to be in tune on what the sisters are saying about you. When a man finds a woman he finds a good thing. Sure enough. But ladies, please be prepared to be found. I wasn't in agreeance with this sister but I do give her some credit. I'm one of those type guys that believes in doing it the Bible way. For no other way will work for me. But I can recommend a book that is on point about women being prepared and position to receive her mate and when she gets him, what she should do to keep him. That book is called WOMAN, TAKE YOUR POSITION by Beverly (forgot the last name), but the book is right-on.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I just borrowed this book from my sister a week ago and officially just finished it today. This is one of the best books I have read lately on the issue. Michelle was very real about the position single women are in. Usually we are awaiting the man of our dreams. I have learned that Jesus has to be the man of our dreams first before he can release us to another. Michelle used accurate scripture (the story of Boaz and Ruth--you can read it yourself in Bible) to relate God's plan to send us our husbands. The number one thing that I took away from this book is that we are single for a reason. It is usually because God is dealing with us as we are. He wants a deeper relationship with us before we have to share our love with him and someone else. \"Ending the search for Mr. Right\" will allow you to \"Begin the search for true happiness!\"",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I found this book to be very insightful. As a newly divorced mother of two. I wanted to make sure that I looked for the right things in a man and not just go for anything just to say I have one. It made me think about past relationships and not play the victim in what ocurred. To take a hard look at some of the signs telling me this person is not good for you, but did it anyway. Taught me about not investing my time nor my spirit in a person that is not fit for me. I must first Love myself. She writes as if she is sitting right there saying \"Girl you better learn some sense.\" Execellent job!! I have recommened this book to several friends.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was awesome! I just got out of a relationship where I compromised myself, my beliefs and my integrity because I could only focus on the relationship that I wanted. I lost my focus of God and of living life as a sacrifice for Him. This book shed a lot of light on how I was behaving and helped me to realize that I'm not alone. A lot of women go through this type of situation and this book can help save you from the heartache of an abusive relationship if you put it's principles into effect. Praise God for this book!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I thought this book was pretty good. Being single is hard when you really desire to be in a relationship. Michelle's books are always a good \"pep talk\"... the difficulty, for me, is to put her suggestions into practice.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the torch and the sword the sequel to the final quest and the call",
        "description": "The Torch and the Sword is the long-awaited sequel to The Final Quest and The Call. Written for mature Christians, this book is not recommended for the spiritually timid. Continuing themes established in the previous books, The Torch and the Sword carries these themes further and deeper while venturing into new spiritual territories The Torch and the Sword paints an increasingly broad and clear spiritual picture of our times. As Christians, we are called not only to endure the challenges with which we are faced, but also to prevail, seizing the great spiritual opportunities available to us. The truth of the gospel of Jesus Christ is the light which is stronger than any darkness. This book is a call to those who will love and stand for the Truth until His victory is complete.",
        "authors": "['Rick Joyner']",
        "infoLink": "http://books.google.com/books?id=E9zZAAAACAAJ&dq=The+Torch+and+the+Sword:+The+Sequel+to+the+Final+Quest+and+the+Call&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Each time my husband Phil and I read one of Rick Joyner's works, we walk away challenged in our spiritual walk and refreshed and empowered by God's Spirit.We have read both prior works (\"The Final Quest\" and \"The Call\"), and this sequel really brought home several truths which spoke to us personally as well as corporately.The three main points that spoke to us were:1) The children being raised up within the church to their rightful spiritual destiny.2) Women being released in power and ministry.3) The creative Hand of God shining through His people.Although an avid reader, I would have to say that most books I read have some level of \"fluffer fill.\" This book does not. It is a very strong message of repentance balanced with a message with encouragement and an impartation of God's strength. We highly recommend it.",
                "review/helpfulness": "48/52",
                "num_reviews": 52
            },
            {
                "review/text": "This is a must read for people who want to walk it the calling that God has given them. His revelation books have had a great impact on me. It has given me great understanding about the Bible, and has changed the way I think about Christianity.The book is a combination of many visions the author had. The main vision depicts the Armies of God fighting the Armies of the Evil one. Many great insights are revealed by the way these armies fight, their tactics, what weapons they use, the mistakes they make, the opportunities they miss, etc. The vision continues with the author walking in the Judgment Hall of Heaven, meeting may past saints, and hearing their stories.The Book, The Vision and also the Torch and the Sword, had a profound effect on me in these ways.1. It has dramatically increased my faith in Jesus.2. It has demolished any faith I had in Myself, Mankind, or Man's wisdom.3. It has given me a sobering awareness of the Evil one's tactics and craftiness.4. It has revealed many empowering and glorious resources of the Lord that I did not consider which has given me more Hope.5. I started to see the overall picture of God's Plan. And different parts of the puzzle started fitting together in harmony, and I got answers to many of the Hard Questions of Christianity.6. It has shown many of the Pitfalls and Traps that even the Seasoned, Mature Christians will fall into, and yet not even know they have fallen. The lessons were profound yet simple. They were they same lessons learned from the Bible, yet even I who have studied the bible have many times overlooked them. The Lord could not trust people with much anointing or power, until they learned the lessons.7. It reveals a great deal about those who hate the book, fight against it, and think it is from the Devil. He meets many of those types of people in Heaven, and their stories radically change after hitting the Judgment Seat. You can hear the MP3 of the book at SpiritLessons dot com. Hope you enjoy.You can read and hear many revelation by Rick Joyner [...]",
                "review/helpfulness": "29/33",
                "num_reviews": 33
            },
            {
                "review/text": "Eye opening for those who are seeking to walk by the Spirit of God and discern spiritual things.All of Rick Joyner's books are helpful. The Surpassing Greatness of His Power is a foundational book that I encourage you to read first. The Final Quest and The Call will help those more discerning folk.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is the third in a series of books by Rick Joyner in which he had a series of visions where he was allowed to see The Church of Jesus Christ as God really see's it. Not as we see with smiles and fascades.We see the Saints of God (the people who have asked Jesus personally into their lives) in an actual real live battle and we see Armies, Angels and Demons.We see the body of Christ deeply divided and many struggling in fear, unbelief, unforgiveness, bitterness, sexual and many other sins and the saddest part of it is they don't even realise what is happening. They think this is their 'lot in life' and put up with it.Then the Lord starts to restore His Church.But not without severe opposition from both inside the Church and the World.In the visions Rick himself makes many foolish mistakes which leave him open to attack and little by little he and we hopefully learn how to walk with God as He wants us to in love and faith.If you liked 'The Pilgrim's Progress' by John Bunyan (which was also given as a vision in a dream and has blessed millions world wide.) then you should like this too.I recomend you read the other two books first being in order; 'The Final Quest' and 'The Call'.All three books are excellently written too and with wondefull descriptions of Heaven and of our lovely Lord Jesus.These would be great books for a new Christian as they could jerk the slack out of his life and help him press deeper into the Lord.May God really bless you.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book was so interesting, I read it in two days which is something I haven't done in awhile. It has a lot of nuggets in it. It makes me look forward to what God is going to do with His people, mainly for the youth in ministry.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "I'm glad Joyner has taken the time to draw near to God and be sensitive to his calling to enlighten a confused generation by adding a depth of understanding and wisdom. As a literature teacher, I endorse all Joyner's books rather than the negative influences out there which often twist truth. I haven't met anyone yet who hasn't experienced a deeper level of conviction upon reading any of Joyner's books, though some must guise their convictions with criticism and some clearly are just plain confused. In my opinion, it's a \"must read\" for anyone who is hungry for Christ.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Rick Joyner is always good to read.His book has no redundancy; his logical flow is so natural.He is surely a master of a biblical knowledge and history, and its experience and practice alike. Especially his emphasis on \"humility\" at the end of the book is so overwhelming and engaging and even awesome.It is full of so many vivid imageries and powerful insights. I should say, \"Strongly Recommended Book to Everybody, Especially to the End-Timers!\"",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "humility true greatness",
        "description": "\"God opposes the proud but gives grace to the humble.\" -1 Peter 5:5 A battle rages within every one of us every day. It's the clash between our sense of stubborn self-sufficiency and God's call to recognize that we're really nothing without Him. It's pride versus humility. And it's a fight we can't win without looking repeatedly to Christ and the cross. C. J. Mahaney raises a battle cry to daily, diligently, and deliberately weaken our greatest enemy (pride) and cultivate our greatest friend (humility). His thorough examination clarifies misconceptions, revealing the truth about why God detests pride and turns His active attention to the humble. Because pride is never passive, defeating it demands an intentional attack. The blessing that follows is God's abundant favor. \"This is the one to whom I will look: he who is humble and contrite in spirit.\" -Isaiah 66:2, ESV God clearly states that He is drawn to the humble. He's also clear that He opposes the proud. These two, humility and pride, cannot coexist. Where one is fostered, the other is defeated. Which will you pursue? When you acknowledge the deception of pride and intentionally humble yourself, you become free to savor abundant mercies and unlikely graces. You will find a new life is yours-a life God richly favors. A God-glorifying life you don't want to miss.",
        "authors": "['C.J. Mahaney']",
        "infoLink": "https://play.google.com/store/books/details?id=7gVDKA2OCBsC&source=gbs_api",
        "review": [
            {
                "review/text": "The premise of C.J. Mahaney's new book Humility: True Greatness is from a quote by John Stott that says \"At every stage of our Christian development and in every sphere of our Christian discipleship, pride is the greatest enemy and humility our greatest friend.\" Mahaney takes the sin of pride very seriously and sees the solution to it as equally imperative.Being one of the founders of Sovereign Grace Ministries and the author of several other devotional books that are graced with endorsements by Al Mohler, Jerry Bridges Ligon Duncon, Mark Dever, and Wayne Grudem, Mahaney has much to be proud of; but he doesn't think so. Following his foundational principles laid down in his book The Cross-Centered Life Mahaney contends true humility is cultivated at Calvary \"beholding the lamb of God.\" This, he avers, transforms the self-confident into humble servants for the glory of God, and thus makes the strongest, most insightful point in the book.After delineating some helpful teaching on the nature of pride, humility, and the power of the gospel Mahaney spends middle section of his book developing a number of strategies that he believes will nurture seeds of humbleness planted in the sojourning saint. He recommends studying the transcendent attributes of God (omniscience, onimpotence, omnipresence), the nature of sin (according to John Owen), and \"the Doctrines of Grace\" (Calvinism). Though he does not say explicitly, the implication, at least in this area, that non-Calvinists cannot truly cultivate humility looms in the background-a truly fictitious notion when one examines the lives of such saints as D.L Moody and Billy Graham. This was the weaker portion of the book.Beyond that he spends an excessive amount of ink on habits of piety that require as much humility to practice as they produce. Things like rising early to worship God, memorizing Scripture while stuck in traffic, thanking God for sleep (!), inviting correction, and encouraging others are all part of the game plan for developing an unassuming, self-effacing character. These are wonderful things, of course, but problematic to teaching humility like this, however, is that they assume what they are trying to yield: humility. However, I only say this speaking from my own futile experience and don't claim to have a corner on the \"how to\" when it comes to refining a humble character, so readers of this review would do well to take my words with a grain of salt.Mahaney does break in with his sense of humor, however. The suggestion of playing lots of golf made me laugh out loud with hearty agreement. At this point Mahaney shines with his commitment to not taking himself too seriously, which is most commendable.He ends the book with some very helpful chapters on humbly engaging trials suffering by looking at the text of Habakkuk, and raising humble children.I cannot say this book is the best on humility and pride. Andrew Murray and CS Lewis have communicated it in more poetic terms mixing good doctrine with mystery that resonate more with the soul. Even so, Mahaney does provide a nice field manual for those in his Reformed Baptist heritage, and it is not surprising to see the endorsements come from this tradition.",
                "review/helpfulness": "55/68",
                "num_reviews": 68
            },
            {
                "review/text": "C. J. Mahaney has done it again. He has written three other books that have all hit the mark in terms of insightful teaching that is characterized by fidelity to the Bible and practical application to life today (his others are: The Cross-Centered Life; Christ, Our Mediator; Sex, Romance, and the Glory of God). Humility: True Greatness is no different. Here he brings to light the Scripture's teaching on the damning sinfulness of pride, and the glorious attractiveness of humility. The book contains the following chapters:Part 1: Our Greatest Friend, Our Greatest Enemy- The Promise of Humility- The Perils of PridePart 2: The Great Reversal- Greatness Redefined- Greatness DemonstratedPart 3: Our Great Pursuit- As Each Day Begins- As Each Day Ends- For Special Focus- Identifying Evidences of Grace- Encouraging Others- Inviting and Pursuing Correction- Responding Humbly to Trials- A Legacy of Greatness- A Final Word- How to Weaken Pride and Cultivate Humility: A List of SuggestionsThis book should be required reading for every Christian. Sadly today, our churches and larger denominational ministries foster a sense of pride and achievement. We must recover an understanding of true greatness if we want to see victory in the Christian life and true revival in our generation.Although, he would certainly deny it (as is clear, if you have ever had the privilege of hearing him speak) Mahaney himself is truly a humble man, and I believe that is one of the reasons he has been so mightily used by God. Buy the book, and get started learning humility.",
                "review/helpfulness": "46/48",
                "num_reviews": 48
            },
            {
                "review/text": "There is a certain irony in the pursuit of humility. We see a glimpse of that in the title of this book, Humility: True Greatness. Humility is true greatness. The pursuit of humility and the pursuit of greatness are one and the same, provided that we seek greatness as defined by the Creator. I have never met C.J. Mahaney (though hope to some day), but from all accounts he is well-qualified to write a book on such a difficult subject. And this is a difficult topic. After all, how can a person write a book on humility without sounding like he feels he is most qualified? The truth is he can, provided he uses the Scripture as the foundation for his teaching. And that is exactly what Mahaney does.The book is divided into three sections. Part one deals with the battle of humility versus pride, part two with our Savior and the secret of true greatness and part three with the practice of true humility.In the first part, Mahaney defines humility and shows how true humility is nothing less than a battle against the pride that lives deep within every heart. \"Humility is honestly assessing ourselves in the light of God's holiness and our sinfulness.\" These two realities must be the foundation of any definition of humility: our sinfulness and God's holiness. This is precisely why true greatness can only be achieved by followers of Jesus Christ, for only they have had their eyes opened by the Holy Spirit to see the depth of their own depravity and the overwhelming holiness of God.Mahaney teaches, rightly I believe, that God hates the sin of pride above all other sin. This is a sin that plagues all humans, though it manifests itself in different ways. So the issue facing the believer is he examines his life is not if pride is present, but where it is present. For most of us it is deeply ingrained in our lives and only a great amount of Spirit-guided self-examination can draw it to the surface.In the second part, Mahaney defines greatness as Jesus did, showing that being great means being a servant to everyone. Just as Jesus came to serve, so must we serve with our lives. Christ lived as the perfect example of humble service. As in all his books, Mahaney leads the reader to the cross, stating that apart from Christ's sacrifice, there is no serving. We can only attain true greatness by emulating Christ's example - the example that led him to the cross where He made the greatest sacrifice.In the third and final part of the book Mahaney builds on the foundation he has built through Scripture to provide advice on the practice of humility. This is far more than a bullet list of do's and don'ts. It is far more than a false, monastic humility that is really no humility at all. Instead, he examines several different areas of life and shows how humility can be applied to all of them. From the moment we wake up to the moment we fall asleep (and even while we are asleep) we can practice humility. Whether we experience joy or pain, whether we are correcting or being corrected, we all have opportunities to practice humility every day.Humility: True Greatness is a truly great book. I do not know of a person who shows no pride in his life, and thus I do not know of a person who would not benefit from reading it. I highly and unreservedly recommend this book. I pray that it will be widely-read, that humility may be widely-practiced.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "C.J. Mahaney's latest book, Humility: True Greatness, is an amazing challenge to believers to think seriously about how much weight God has placed on humility. The challenge of this book springboards from Isaiah 66:2, \"This is the one whom I will look: he who is humble and contrite in spirit and trembles at my word.\" As the title hints at, Mahaney has put together a concise and practical book that calls us to seek humility, which is how God defines true greatness.The author has a clear, yet personable writing style and Humility is a prime example. He tackles such topics as defining biblical humility (\"Humility is honestly assessing ourselves in light of God's holiness and our sinfulness.\" p. 22) and pride (\"Pride is when sinful human beings aspire to the status and position of God and refuse to acknowledge their dependence upon Him.\" p. 31).Mahaney also does a wonderful job giving practical encouragements of how to foster humility in our daily lives: through prayer, acting in grace toward others, and opening oneself up for correction. There is even a checklist summary of practical things we can do to strive after humility at the end of the book.Of course, a lot more could have been written, but an exhaustive manifesto on humility does not seem to be Mahaney's ambition. Rather, this excellent book is a crisp, if not humble, approach to a hugely important topic in the life of a Christ-follower.All in all, Mahaney has hit another home run. I can't imagine any believer not being challenge by this convicting and gracious book. He has such an accessible style that many readers will be able to devour Humility in one sitting. I would recommend that you go at a slower pace and let these powerful challenges transform your life. In fact, I've already bought several copies that I have been doling out to my coworkers. Thanks C.J. - please keep books like this coming! - Todd Burgett, Christian Book Previews.com",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "I thought, wow, this is going to be a great book.I wasn't prepared for what I got.A book that broke me, that had me on my knees, that used the word of God to pierce between my joints and marrow.Flawless theology, intensely practical, powerfully written.I feel I do the book an injustice by trying to describe or summarize it at all, so a sentence from the epilogue will do:Ultimately, there can be no effective expansion of your life's mission and ministry, no fulfillment of the specific purpose He's called you to, apart from the cultivation of humility in your heart and the weakening of pride in your life.Let this book be a tool that the Spirit uses to expose the pervasiveness and perversity of pride in your life and challenge you to turn in humility and repentance to a gracious God.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I just finished reading Humility: True Greatness by C.J. Mahaney. Now I hope you recognize immediately the need for humility when practicing evangelism. Often times, those with whom we want to share our faith are proud, self-righteous, and independant--and it would to little good to return pride with pride! God, in the Bible, over and over again reminds us of the need to stay humble and the consequence of such. See the following references for just a few examples: James 4:6, 1 Peter 5:5, Isaiah 66:2, Proverbs 8:13, Proverbs 6:16-17, Proverbs 16:18, Mark 9:35, Mark 10:32-45, Mark 10, Philippians 2:6-11,It should be clear to the reader that no one can be a self-proclaimed expert on this topic. It is clear that shouting \"I'm way more humble than you are!\" is self-defeating. Mahaney acknowledges this--he admits he is a proud person. It is only the proud person who acknowledges his pride that is qualified to write on humility. It is only due to Mahaney's failures in being humble that he can write about the need to be humble.Humility: True Greatness is not a probing theological book nor a deeply spiritual text. It is short and sweet, beginning with a few chapters on the necessity of humility and proceeding with several chapters of practical advice on how to live out a God-pleasing life of humility.One thing that I greatly appreciated was Mahaney's high view in chapter four of the death of Christ. Christ died not merely to demonstrate the ultimate in humility, but for us also to be humbled by dying with him and then being exalted because of him. He ransomed us--sorry, captive to sin, miserable and helpless. However, at this point, it seemed that Mahaney should explicitly explain the doctrine of Christ's substitutionary atonement. For readers not clear, to know this doctrine is crucial--that Christ suffered and died primarily to take the punishment we deserved for our many sins, and to credit to us his righteousness that we could never achieve. He endured in three hours on the cross our eternity in hell, and thus saved us that we might be forgiven and be made right with God. This doctrine is key to Mahaney's point in the first half of the book yet he assumes we know it. Still, Mahaney's resolute passion to write of the cross, the cross, and the cross is needed and appreciated.The practical chapters (starting in chapter five) almost alternate between general practical pracitices--such as setting aside time to pray in the morning and evening, or to study the attributes of God--and specific, almost quirky ways, like a recommendation to play golf, today's most humbling sport. This light though not comedic approach makes the book a breath of fresh air--I felt like I was getting friendly advice on how to live out the Christian life, rather than hardcore teaching from an authority. I don't think 400 pages of this would be any more edifying than the 120 that has been presented--Mahaney knows when to keep it shortThere is a section in Chapter 9 about using appropriate words that I thought were particularly fitting for witnessing. 1 Thessalonians 5:14 gives us a hint to \"admonish, encourage, help, and be patient\" to certain people (read the verse and learn who). Mahaney directs us better to consider the needs of those we meet, not trying to impress them or convert them, but rather listening sincerely and humbly to determine their need. The purpose of your words should be to give grace to those who hear (Ephesians 4:29). Another direction, especially when witnessing to those who claim to be Christians (and may indeed be) is to never correct another wihtout reminding the person of the gospel--because correction is impossible without Christ as the corrector.Mahaney also urges us to invite others to correct us and to seek correction. I pray and ask that you hold me accountable for the things on my site.This book is highly recommended, and it will not take you long to read. Take a few hours over two days and read Humility: True Greatness and you will receive \"grace to the humble.\"",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Though Humility: True Greatness is small, its depth and impact are big. It's accessible but profound, rooted in Scripture yet intensely practical. And there isn't a single one of us who couldn't benefit from its message. As Mahaney points out:\"The sad fact is that none of us are immune from the logic-defying, blinding effects of pride. Though it shows up in different forms and to differing degrees, it infects us all.\"Mahaney begins by making the case for how crucial this topic really is. He then takes a unique angle that I really appreciated. I always thought pursuing humility was important simply because the opposite, pride, was so abominable. But although Mahaney doesn't mince words about the seriousness of pride, he also turns attention to the positive: Humility is something to cultivate because of the promise it offers (\"God gives grace to the humble\"), not just because of the curse its alternative brings.Mahaney's self-deprecating humor and honesty about his own struggles with pride make him relatable and credible. He often anticipated my questions and objections with powerful illustrations of pride in his own life. And his disclaimers that he's unqualified to write a book about humility, combined with his friends' and family's endorsements of his humble spirit, only add to his credibility.More than once, he caught me with a direct hit--describing my prideful thoughts or heart attitudes with startling exactness. Yet Mahaney isn't out to beat you down and discourage you. Part of the beauty of the book is the thread of the gospel woven throughout. Over and over, he brings you back to the grace and mercy of the cross.One of the most powerful things I learned from this book was that having a correct definition of \"greatness\" and a perfect example to follow (Jesus) is not enough for me to attain humility. I can't be great unless I imitate Christ...but I can't imitate Christ apart from the cross. Only Christ's death--His sacrifice to ransom us from sin--will set us free from pride and enable us to be humble. Understanding that is the key to toppling pride. It all comes back to the cross--the foundation of Mahaney's life and ministry and the core of this book.Once he has laid the theological groundwork, Mahaney gets extremely practical. Pride must be actively fought; humility must be intentionally cultivated. This character development isn't just going to happen as we read the book--it's going to take work. So the second half of the book lays out specific steps to take--at the beginning and end of each day, throughout the day, and occasional practices. Each chapter challenged and inspired me.This book was a crucial one for me--one I know I'll need to read more than once. There are a lot of ways you could spend ten dollars, but I'm confident that spending it on this book will be a powerful way for you to invite God to shape you more into the image of His humble Son.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "A couple of weeks ago I finished reading C.J. Mahaney's Humility: True Greatness. I've been thinking about reviewing it but I wasn't sure how to share about how this little book addresses the big problem of pride. It is simple and easy-to-read but is addresses well the deep sickness of sin in our hearts and presents God's desire for us to be humble before Him. This book is convicting and encouraging, meditative and practical. Time spent reading this book would be edifying and worthwhile for anyone.\"This is the one to whom I will look:he who is humble and contrite in spiritand trembles at My word.\"Isaiah 66:2I agree with C.J's description of this verse-\"astonishing.\" How amazing that God, the Creator of the universe will look upon fallen and sinful people. This verse is also sobering because God does oppose the proud (James 4:6) and they are an abomination to Him (Proverbs 16:5). He writes, \"Pride is when sinful human beings aspire to the status and position of God and refuse to acknowledge their dependence upon Him.\" (p. 31) and \"Humility is honestly assessing ourselves in light of God's holiness and our sinfulness.\" (p. 22). This is why we need to be in the habit of studying and obeying His Word. When we are lowly and humble we can see more clearly how great and deserving He is.C.J. does a good job in warning his readers to heed conviction of sin and to be sensitive to weak areas where we are prone to pride. My favorite part of this book was where he gave advice on some habits that would beneficial in the quest to winning over pride in our lives. These two really encouraged me to work on them daily in my own battle against pride and striving for humility.-Begin Your Day Acknowledging Your Need For God.In this section he wrote about how the sin of pride is active. When we allow ourselves to be undisciplined for just a moment, it can creep in and taint our thoughts. He quotes Martin Lloyd-Jones who wrote, \"Have you realized that most of your unhappiness in life is due to the fact that you are listening to yourself instead of talking to yourself?\" C.J. reflects on this profound statement:Most of us spend more time listening to lies than we do speaking the truth to ourselves. And the listening process usually starts as soon as we get up. The alarm has rudely interrupted the gift of sleep, and the listening begins. As we stumble through our morning routine,we're not directing our thoughts in our mind-we're simply at their mercy. We're not in charge of our thinking. We're just there.But instead, you can declare war on pride by speaking the truth to yourself and set the right tone for your day by mentally affirming your dependence on God and your need for Him.p. 69-70-Identifying Evidences of Grace.C.J. explained why identifying evidence of God's grace in other's lives will help cultivate humility in my own heart-\"This means actively looking for ways that God is at work in the lives of other people.\" He encouraged the reader to become very familiar with the lists of fruits of the Spirit in Galatians 5:22-23, gifts of the Spirit in Romans 12:6-8 and 1 Corinthians 12:8-10 and to then be on the lookout for the Spirit's working in other's lives so that we can become more aware of what God is doing around us and not proudly focus on ourselves.Throughout the book, C.J. presents a beautiful image of humility as being void of anger or bitterness, being God-centered and a servant to others. He helped me remember that pride can be blind and so I need to be open to hear correction from others, especially in areas where I am possibly blinded by pride in my own heart. This book gave me a whole new perspective on the seriousness of pride and the decay it promotes in my heart and life. I am thankful that by God's grace, He will continue to change me to be lowly and tremble at His Word.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "C. J. Mahaney's Humility is a much-needed book for this generation of Christ-followers. I have a confession: Having recently read Andrew Murrary's classic of the same title, I was not expecting much from this book. No offense to Mahaney, for whom I have great respect, but I just couldn't imagine a book impacting me more on this topic than Murray's. To my delight (and conviction), Mahaney delivered a fantastic work that puts flesh on the topic of humility and provides concrete, practical steps to becoming people of humility. Obviously, Mahaney's book will be more accessible for this generation because his language is modern and his examples are fresh and referenced to contemporary culture.The book begins with a discussion on the battle between pride and humility and then demonstrates how Christ re-defined what it meant to be great. The last part, which comprises the bulk of the book, gives readers practical ideas for increasing their dependence upon Christ and therefore increasing in humility: spiritual disciplines for the morning and evening, Bible study ideas, ways to encourage others, the importance of accountability, etc. There was even a chapter on raising children who understand and strive for the Biblical greatness found in humility.As I read this book, I underlined a lot, jotted down many notes in the margin, implemented some of the principles, and discovered an idea for my next personal Bible study. I felt the chapter on practices for the end of the day would have been more developed if it included a more in-depth explanation of self-examination disciplines such as the Ignatian examen, and I disagree slightly with some of Mahaney's doctrinal positions, but this is definitely a book worth reading and recommending.This would make an excellent book for small groups to study.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "In his endorsement of the book Mark Dever says \"If you are struggling with pride you should read this book, if you are not strugglinh with pride, you definitely should read this book.\" I didn't need much convincing to let me know I was prideful, but as I read \"Humility: True Greatness\", I began to see how much pride ecompassed every aspect of my life.C.J. Mahaney's very biblical and practical approach to combatting pride is extremely beneificial and life-changing. There are many ideas expressed in ways that completely hit the mark. To think when we act in pride, when we place our own interests above others, when we fail to trust God and instead rely on our own weak selves we are contending for His supremacy!Please read this book and let the word of God pierce your heart, reveal your sin, and watch the Spirit change You into His image!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "all that matters",
        "description": "Get to the heart of the most talked about topics of our time. All That Matters runs the gamut of the most exciting, interesting and topical subjects of today. To provide a flavour of the All That Matters series, this exclsuive sampler provides the opening chapters from nine notable books including the following: God by Mark Vernon Love by Mark Vernon Water by Paul L. Younger Space Exploration by David Ashford Modern China by Jonanthan Clements Shakespeare's Comedies by Michael Scott Cyber Crime and Warfare by Peter Warren and Michel Streeter Philosophy by Julian Baggini Future Cities by Camilla Ween All That Matters books are written by the world's leading experts, introducing to the quick-minded and curious reader the most important topics and hottest areas of debate on the subjects that really matter.",
        "authors": "['Ross Fraser']",
        "infoLink": "http://books.google.nl/books?id=DKtSBgAAQBAJ&dq=All+That+Matters&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "One of the greatest joys I've been told is to live to see the offspring of your children. As friends often say we get to play with our grandchildren and then they go home when they're dirty and tired. And in the case of most grandparents, not only do they give their time and love, but also some of the best words of advice and wisdom because they have lived through so many experiences.But what happens when a grandchild lives far away from their grandmother and this child's mother dies when she's only 18 and the child as she grows older is bereft, alone considers suicide her only alternative. If you're an author of self-help books and a Rabbi like Jan Goldstein you might sit down and write a book with this theme and give it the title All that Matters. And while much of this book does teach a lesson as to what really matters in life, somewhere and for some reason this book fell flat for me and I do regret it.Jennifer lives on the West coast while her grandmother Gabby a Holocaust survivor and widow lives on the East coast. When Gabby's daughter and Jennifer's divorced mother dies suddenly Jennifer at 18 is left alone. Her father five years later is remarried and the father of a second daughter. And as if her life has handed her lemons, Jennifer's boyfriend has just ended their relationship. But after Jennifer is found on the beach in Venice, Ca with a stomach filled with pills, Jennifer learns she isn't entirely alone as her grandmother from New York journeys to Los Angeles and insists on bringing Jennifer home with her to recuperate. Elderly and very ill Gabby is determined make Jennifer realize the gifts life presents to her each day through the stories of her survival during the Holocaust and her love for her husband.A somewhat sappy story of a young woman who thinks she had nothing to live with and her grandmother who is determined to show her what really matters, I thought I would love this book and why not. I love stories about generations of a family and especially of survival during the Holocaust. And the book is so nostalgic to me as it is sprinkled with Yiddish expression I remember my grandparents saying to me and my mother saying to our daughter.So what went wrong did I think as was reading this book. I thought something was missing from the first couple of pages but even now can't put my finger on exactly what was missing. I think I felt that the young woman as sick as she might have been was portrayed as petulant, spoiled and was so unlikeable that she failed to garner much sympathy from me. The grandmother on the other hand was a saint and offered the young woman unconditional love and wisdom as only grandparents can do. I wish I had a woman like this in my life today to hug and cherish me the way she did this for her granddaughter. In the end I felt as though the author failed to move me to tears or even a sigh when I closed the book. There were some rather unlikely scenes and what could have been explored and really developed just fell short all around. Finally when the author casually pulled out the \"I just met a guy but he really likes me and this could be the one\" card, I really thought it was such a canned ending. I was ultimately disappointed in this book despite its wonderful cover filled with colorful leaves. I had a hard time rating this book but in the end gave it a B because above all else I did think the theme was a good one if not the execution.Despite this review and considering how I have given Nicholas Sparks books countless chances to make me a lover of his writing if not themes, I will definitely read Jan Goldstein's next book hoping it will be better.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "\"All That Matters\" is that you read this lovely story that confirms life with special and unexpected gifts, handed down, with love, from generation to generation. May the spirit of Gabby touch your heart as it did mine, reminding me of my \"Nana\" and her wisdom and zest for life. It is a very touching, yet uplifting story. A must read.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Classifying this novel as the most inspirational book I have ever read would be an understatement. Not only is it brilliantly written, this literary masterpiece captivates its readers in an ineffable manner. Cheers to you Mr. Goldstein and keep them coming!!!",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "In this beautifully written, thought provoking story, Jan Goldstein creates characters who touch our soul. Nana, who feels like our own grandmother, gives us a vision of the loving grandparent we hope we can become. Courageous and filled with the passion of a wise woman, she guides and helps heal her grandaughter. Jennifer, though troubled, is a child we want to wrap in our arms. Yes, love is the greatest medicine of all. Goldstein and his characters, Nana Gabby and grandaughter Jennifer prove this to be true. I cried, I laughed; Goldstein's book is a golden treasure.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Given the rave reviews of others, I expected an absorbing, thought provoking read. I found instead a book riddled with cliches, superficial character development and a predictable conclusion. Having just read Ian McEwan's Atonement, the contrast was dramatic. All That Matters would be a good fit for the condensed novel section of a traditional woman's magazine. All That Matters is to fiction what Rod McEuan(Listen to the Warm) is to poetry. Why do I feel that Jan Goldstein is hoping to cash in big with this one?",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Jan Goldstein's book took me through a journey that mimicked my own personal journey and, to some degree, can be related to by everyone. This book helped me to open my heart and let go of the meaningless, petty aspects of life and turn my attention to all that really matters. Love. My life has been significantly changed and healed since reading this book. To Mr. Goldstein, wherever you are, THANK YOU!",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "I picked up this book just as I was taking a flight to New York. I was so touched by the story of Gabby and her granddaughter, that I hardly noticed the time pass. As soon as we landed, I ordered three copies of \"All That Matters\" for my granddaughters.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Pure Gold-stein is all I can say about this novel \"All That Matters\". I was so captivated by the mixture and depth of the main characters that when I completed it (In one afternoon)I immediately went on the net to see what else the author had written. I found his personal email at jangoldstien.com and asked him about his other writings. He told me that his previous books were non-fiction but he is almost finished with his 2nd full novel. I begged him to tell me the story line and he shared with me just a little but it was enough to know that this writer is going to be around for a long long time. Apparently his characters in \"All that Matters\" are based loosely on real people. I read another review were it said that Gabby seemed to good to be true but guess what fans..she does exist. Well at least the person she was based on does and Jan told me that every year at Passover they read her story and that is what inspired him to write the book. I am not that big a sentimental person but when it comes to emotion \"All that Matters\" mattered a lot more to me than \"The Note Book\" which I thought tugged at the heart. Anyway I am off to tell all my friends about this book. God Bless, Angela",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Just in time - as fall ushers in- so too does this delightful and meaninful read. As the air becomes cool and crips in the Pacific Northwest and the leaves begin to change this was the perfect book to pick up and bring warmth to my heart - I couldn't put it down and read the whole book over 2 consecutive rainy days. The characters were so real and I couldn't wait to see how their relationships unfolded. I highly recommend this book as the first you pick up this fall season - it is the perfect way to welcome a change in season!!!!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I could not put this book down. From start to finish I was glued to the pages - I ended up reading it in 2 days. I was deeply moved by the characters and often saw myself in Jennifer. I HIGHLY recommend this book to anyone who loves a beautiful and touching story.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "when god takes too long learning to thrive during lifes delays",
        "description": "In When God Takes Too Long, Joseph Bentz examines the mysteries of God's timing and shows Christians how to thrive in the midst of one of life's greatest frustrations--waiting...",
        "authors": "['Joseph Bentz']",
        "infoLink": "http://books.google.com/books?id=3LjtAAAACAAJ&dq=When+God+Takes+Too+Long:+Learning+to+Thrive+During+Life%27s+Delays&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A friend gave me this book during a waiting period in my life otherwise I probably would have taken a look at the title and decided I could skip it. Had I skipped it, however, I would have missed some really wonderful insights. Joe Bentz takes the stories we so lightly read over in Scripture and delves into them pointing out the silences in the stories that are so important and yet so easy to miss. I especially appreciated the \"Almost, not yet\" sequence with Moses and the plagues.On a practical level, the book is divided into comfortable sized chapters/sections that make it work very well as a daily devotional. It's a book that will make you want to keep reading, but it's best taken one bite at a time (with plenty of time in between to chew and digest).If you want a new perspective on all those waiting times from stop lights to career moves to retirement, this is the book to read. It will almost make you grateful for that red light!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Not sure exactly where said reviewer is coming from, especially since the exact same review has been posted by him/her for yet another book by a different author! This sounds like more of a soapbox than a fair review of the book.You can't compartmentalize the spiritual from the material aspects of our lives, and I think this is what this book makes clear. The things we see within our own human perspective aren't the whole of reality-- if anything, this book reminds us that our own ideas of success, failure, good and bad are pretty relative in the scope of eternity. If you can't compare the details of our 21st century lives with Biblical characters, you're boxing the Bible in and overspiritualizing the omnipresence of God in all the details of our lives.And there's no way the author is making all the mistakes M. Galishoff is pointing out-- just read the last 2 chapters and you'll hear about Scriptures imcredibly hard for Western American Christians to deal with, such as Hebrews 11 (all the people who never got to see the ultimate ripple effect of their lives or the 'rewards' for their faith and yet lived for what they couldn't see) and passages in Paul's letters about how eternity makes the present pale in comparison. Seriously-- you can't come away from this book thinking that it's 'all about me.' Clearly, it's all about God-- learning to live in surrender to his ways that are totally different than ours.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Bentz has an incredible relevence in this book to those of us who feel like we are waiting! I highly recommend this book and this author. He writes with a wisdom and clarity of understanding. His words are helpful and illluminating. A worthwhile read.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the supernatural ways of royalty discovering your rights and privileges of being a son or daughter of god",
        "description": "Your Identity Unlocks Your Inheritance! To experience the full inheritance that Jesus purchased at the cross, you must understand your royal identity. In this classic bestseller, Kris Vallotton and Bill Johnson denounce those strongholds of thought that have kept many Christians from enjoying their supernatural inheritance. They lovingly guide readers into a revolutionary understanding of who God says they areroyal heirs to the eternal Kingdom of God. Step into your God-given destiny by dispelling the pauper mindset, uprooting the poverty mentality, and embracing royalty as part of your spiritual DNA! Claim your spiritual inheritance today!",
        "authors": "['Kris Vallotton', 'Bill Johnson']",
        "infoLink": "https://play.google.com/store/books/details?id=EdMwDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Do you feel like you suck? Do you think you have screwed up so much that no one could ever value you or find you to be amazing? Do you think that no one has ever seen you for what you really are? Do you feel misunderstood? Do you think God is out to get you? If your answer to any of these questions is yes, then this book is a must read for you!In it's pages you will learn that you are the most precious and valuable thing in God's eyes. You will learn that His forgiveness restores your life to the original standard of uprightness and cleanness you started out in! You will learn that you have the authority to hold your head up and be a prince or princess!This book is a mind-blowing presentation of truth that most Christians have never even imagined was out there.If you want to be free, then don't waste another second thinking you suck! Buy this book and watch your life get fixed and your heart be set free to be amazing!!!",
                "review/helpfulness": "77/83",
                "num_reviews": 83
            },
            {
                "review/text": "Kris Vallotton's book - THE SUPERNATURAL WAYS OF ROYALTY - is helping to transform the lives of many people in our area. As a minister of the Gospel of Jesus Christ I have given nearly 3 cases of this book away. The typical response from people so far is something like this - \"WOW! I wish I had read this years ago. I would not have wasted so many years squandering my inheritance as a Christian.\"This book is a must read for everyone - Christian and pre-Christian. The revelation Kris presents is critical for people to get so that they can truly reach their God-given destiny.",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "The authors have cut through layers of symptoms that have bound and emasulated the church for centuries. Like a medical researcher, Kris Vallotton has revealed root causes of the church's impotence, and some of the most insightful analysis I have ever read. Yea God!",
                "review/helpfulness": "31/35",
                "num_reviews": 35
            },
            {
                "review/text": "A powerful book. Full of Gods wisdom and heart. This book will open your heart and eyes to the fullness you can walk in.",
                "review/helpfulness": "21/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book carries a message that will completely change your way of thinking and will open you up to an entire new level of God's extravagant love for you! The main thing I took away from reading this book is, it's not what I do, but it's who I am that is going to influence the world around me.This is the kind of book that needs to be read with a highlighter in hand and revisited time and time again. Very, very powerful!",
                "review/helpfulness": "18/22",
                "num_reviews": 22
            },
            {
                "review/text": "It just keeps getting better and better. Tired of religion?? Tired of being powerless?? Want More? Expect More? Than this is for you!! Time to rise up and be revealed as a Son and Daughter of God!! This book will fuel your Holy Ghost fire! No Holy Ghost fire?? You will find it here!!!! AND DON'T FORGET \"When Heaven Invades Earth\" & \"The Supernatural Power of a Transformed Mind\" both by BIll Johnson!!",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "Identity! Identity! Identity! If it is true that our actions are merely representatives of our identity then this book goes to the heart of the matter. If you find yourself stuck somewhere between broken relationships and the perpetual fear of not having enough emotionally, physically, spiritually and financially then I urge you to grab this book. Eloquent? Yes. Well thought out? Yes. But if I had to use one word to describe it?..............\"REAL\"",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "If you ever struggle with feelings of inadequacy, depression or discouragement this book is for you. Kris Vallatton's warm, humorous approach to the reasons Christians remain impotent to live happy, effective lives is succint & impacting. If you're looking for answers, this one's for you. This book will transform the mind & heart of anyone who picks it up.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Kris Vallotton did an awesome job in putting this work together. His personal testimonies flow in a wonderful way along with timely revelation from God's heart and His written word. Especially the chapter about honoring others was life-changing to me.It is safe to expect God's favor to increase in your life, as you read this book and meditate on the truths contained in it.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book has revolutionized the way that I see myself. I am discovering my true identity in Christ. I have come to understanding that thinking less of myself in order to bring God Glory doesn't bring God glory at all. We were created to reveal his Glory, through our position as his Sons and daughters. A must read for every Christian.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "lords of the earth",
        "description": "Engulfed in the darkness of Irian Jaya's Snow Mountains live the Yali, naked cannibals who call themselves lords of the earth. Yet, in spite of their boldness, they live in terror and bondage to the women-hating, child-despising gods they serve. Missionary Stan Dale dared to enter their domain and be an instrument to change their future. Peace Child author, Don Richardson, tells the story of Dale, his wife, his companions, and thousands of Yali tribesmen in Lords of the Earth. This unforgettable tale of faithful determination and zeal against overwhelming odds brings unlikely characters together in a swirl of agony and bloodshed climaxing in a dramatic, unexpected ending. Readers will find their perceptions of how God moves enlarged and inspired by this classic story. For parents and youth leaders looking for real-life role models for the new generation of young people, you will want to meet the Dales in Lords of the Earth.",
        "authors": "['Don Richardson']",
        "infoLink": "http://books.google.com/books?id=v4iGoAEACAAJ&dq=Lords+of+the+earth&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This was an exciting book to read, not just for the exotic setting in remote Irian Jaya, not just for the odd social Yali customs, not just for the bravery and determination of the missionaries who lived among these cannibalistic people, but because Richardson is a superb storyteller who knows how to blend fascinating tales with a good dash of suspense. It took very little effort to read this book as I was so caught up in the story that it was hard to put down. Recommended reading.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "A riveting page turner full of surprise after surprise, that evokes emotions that swell to the very core of humanity and Christianity.The amazing story of Stan and Pat Dale among the Yali people, the battle on the front line over the lives and souls of men and women and children all made in the image of God, but having lost view of what the image means.In the end, like Don's other books: Eternity in their Hearts and Peace Child; this book brings about a humble recognition that God is God and there is no other, second only to the recognition and appreciation for people like Stan and Don and their families that risk life, health and comfort for their love and desire to spread the good news of the gospel of peace!",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "If this book won't give you a heart for missions, nothing will. This book tells the story of Stan Dale and the Yali tribe as cultures clash and the Gospel wins over the hearts of fierce and cruel warriors, whose enjoyment is to shoot so many arrows into a victim to porcupine him or her, and then eat with relish the corpse of a victim. These people are so entralled to their spirits that any violation of taboo was punished by death. Women were also excluded from all rituals and religion and deemed unclean. Into this walks Stan Dale charging forward with fortitude determination and a total reliance on God. Winning a few young converts coupled with tortuous hard labor to construct a basic airstrip, Dale and a friend were martyred. Then through a total act of Providence, God intervened miraculously and revival swept the Yali people at the same spot where the two missionaries were killed and dismembered by the appearance of a little missionary boy and his protection by a wise old man. You must read this book to find out what happens. After all is revealed, you will see the Hand of God, protecting Stan Dale and his family in a very humourous manner based on mistaken identity.This book will give you a taste of the challenges in reaching a lost world. It is still going on today with organizations such as the New Tribes Mission whose missionaries were recently martyred in the Philippines. Truly amazing real-life stories.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "lords of the earth is an excellent book! every time i read it i am amazed at God's grace and divine providence. don richardson is an excellent writer. his vivid description makes this amazing true story come to life. i've read it several times, and each time i just can't put it down.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "It is a very rare book that can move me to tears. This was so realistic, and so inspiring, I am recommending it to everybody I know",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "\"Lords of the Earth\" is the term the Yali warriors use to describe themselves. They live in the Heluk valley in Irian Jaya, and the only knowledge of them to reach the outside world are the dark rumors of the cannibals beyond the mountains. The first section of the book is about them, their customs, and the awful fear and darkness they lived in. Don Richardson does a great job portraying a people bound by chains of sin, and longing for release. The horror of their pain is graphic, and not suitable to be read to younger children.The second part of the book describes the early life of Stan Dale, his conversion, and his burden for those in darkness. He is drawn as a determined man, physically strong and fit, with firm convictions.The book goes on to tell of Stan's coming to the Yali people. How a strange story begins over his identity, protecting his life. How the first few Yali Christians were killed, and later Stan and a fellow missionary were brutally murdered. How another missionary family died in a plane crash, except for the nine-year-old son, whose friendship with the Yali paves the way for them to turn to Christ.The book reminded me Christ's words in John 12:24, \"Verily, verily, I say unto you, Except a corn of wheat fall into the ground and die, it abideth alone: but if it die, it bringeth forth much fruit.\" On earth, Stan Dale never saw the fruit his life and death brought forth, but he will rejoice in heaven with the Yali that are there through his witness.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is probably the best I have read. It puts you in the picture with excelent detail yet easy to read. Not to mention the real life suspense of the Yali mountain tribe people and the sheer guts and determination of missonary Stan Dale. If Speilberg wants to make another great movie like Schindlers List, this would have to be it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "My heart was torn apart as I read the story of the Yali people. This is one of those 'I can't put it down' books. I'm still somewhat smitten in my heart over the price these missionaries paid and the intense need for the gospel these people so desperately demonstrated. God help us to heed the call to go into all the world.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is an incredible true story of a man passionate to reach for Christ those who have never heard. It also clearly illustrates the darkness, evil and despair that comes from idolatry. But it also shows the true liberation and freedom that can come only for Christ. This book will draw you in from the first page.The world needs more people like Stan. People who are willing to trust solely in God and how are willing to go to dangerous remote areas to share Christ. This book will shatter your complaceny and force you to think. I highly recommend this book. For all Christians, but especially those (like me) who have heart for missions. This book details the good, the bad, and the ugly of missions work.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The surprising gift of this book is the introduction (for me, at least) to Stan Dale, a missionary of heroic proportions. In the flesh, Dale is portrayed as a resolute and courageous ironman; in the spiritual, he's portrayed as a giant. Inspiring, in that regard. I presume that Richardson's knowledge of some of the actions/thoughts etc. of the indigenous peoples are from hearsay and speculation (I don't know this to be true), and the writing style certainly seemed to be more sentimental in those portions of the book. Even so, this is worth the reading.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "walking with god on the road you never wanted to travel",
        "description": "The Christian life isn't always a walk in the park. Children of Christian parents do die. Christian businessmen do lose their jobs. And husbands of Christian wives do cheat. Being a Christian doesn't protect you from the tough punches life throws. Taking fourteen strategies from the biblical account of the Israelite journey, Walking with God on the Road You Never Wanted to Travel offers real hope to those on an unexpected, difficult journey. For forty years the Israelites wandered through a devastating wilderness, suffering many losses, and yet learning some timeless lessons. These lessons, presented here as strategies for modern believers, are simply stated, clearly explained, and beautifully illustrated with dramatic and inspiring stories.",
        "authors": "['Mark Atteberry']",
        "infoLink": "https://play.google.com/store/books/details?id=dfA5PCtigGsC&source=gbs_api",
        "review": [
            {
                "review/text": "The name of this book is misleading. The title leaves the impression that this book will present deep insights into the mind of God on the topic of God and human suffering, when in fact, that is not the subject at all.The title of this book should be \"How to Walk with God on the Road You Never Wanted to Travel\". Mark Atteberry makes it VERY plain and clear at the beginning that this is a HOW TO book, only, and not a book that seeks to answer the WHY questions.The exodus of the Israelites out of the land of ancient Egypt is both the backdrop and the main source of Atteberry's material, which he uses to demonstrate the lessons he wishes to teach. Each chapter contains a mix of biblical scriptures along with his experiences as a pastor/counselor. His biblical discussions were much more helpful to me than his personal experience stories.One of the important things this book drove home in my mind, is that a lifetime walk with God is a guaranteed certainty that the journey will be on a route no one would ever deliberately choose. Be careful what you ask for.....you just may get it!On the other hand, it is an irritating turn-off that Atteberry uses the \"Devil's gonna get you\" mentality throughout his book. Living in fear of Satan is not a basis for righteous living. It is more important to live a life motivated by the love of God.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "After reading this book, I knew I must pass it on to others in the Body of Christ who have been deeply wounded and to recommend it to others. From wounds inflicted by unwanted divorce; a child in prison; disappointment in how life has brought sorrow; wherever the path of life took them and they never meant to go -- without exception, each person I passed this book on to has these words \"Praise God for Mark Atteberry and this book!\" Some have even stated that if this book had been in their hands earlier, they would have been saved some of the anguish they went through.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I was so impressed with this book that I went online and bought nine copies to give to friends and family. It is appropriate for anyone dealing with loss. Loss of a spouse, a child or dealing with divorce. I read it in one day. I started on a Saturday morning and could not put it down til late that evening. This is a great book to help deal with pain in life.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I just finished reading this book and loved it. It helps put things into perspective. I would recommend it to anyone who is going through trials in their life. It's on my all time favorite books list, I just bought a copy for my mother-in-law and am encouraging many of my friends to read it.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I purchased this book for myself and subsequently for two others who had an incurable disease. It is Bible based, uplifting and a rewarding read. I will read it again and again!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have used this book to assist my church ministry in divorce care and in my own walk down the road. It is sound from a biblical perspective and filled with common sense solutions. If you find yourself lost, wandering in the wilderness, grab thus survival guide.It works.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I read Walking with God on the road you never wanted to travel some months back and have kept it out because I refer to sections that I've highlighted when I need help with my impending divorce.I found Mark's words and passages a source of healing and comfort. I hope that I can look back on my experience and email Mark with a success story someday. If you are currently dealing with a huge \"why did this happen to me\" situation this book is the one to read and re-read because of the many examples, biblical passages, and words of encouragement are well worth the book's price.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This book is a practical guide to living through suffering. The first chapter deals with looking at your situation to be clear on \"who's fault is it?\" Did you make choices that landed you here; was it someone else's fault; or was it nobody's fault -- just life as it happened. He doesn't bog you down in that -- he just wants you to look at how you got to this point so that you can use those lessons and move forward, even if it's still on that road you didn't want to travel. I find that there is a lot in common here with the Zen teachings that it's not the suffering that causes our problems, it's trying to avoid those sufferings.I, too, am going through a separation now and while I was the one who packed up and left, this road certainly isn't the one I saw myself taking when I took wedding vows over 15 years ago. I can face that and move forward and this book has practical steps of how to get there.The balance of personal stories with the Biblical background of the children of Israel seems just right. I can find myself in the stories and then see how my struggles are thousands of years old and common to humans.GREAT BOOK -- would recommend it to anyone who finds themselves in a place they didn't want to be, can't get out of or want to walk through in a way that glorifies God.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I read this book recently. I found it was the same old story written by most religious authors. I did not walk away from this book feeling overwhelmed or in awe.I enjoyed the real-life stories he tells within the book, as I thought they made a bigger impression into why things happen the way they tend to do in life.However, towards the end in the discussion section, I was a little drawn away that he offers no suggestions no how to go about locating or seeking the items/defining moments in your life, so as to answer the questions and progress onwards in your faith journey.I felt that this book might be geared more towards those that have already heard God's call versus those that are seeking Him out. Lost sheep would do better reading another book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "authentic relationships discover the lost art of one anothering",
        "description": "In a culture that promotes isolation and autonomy, this book reveals life-changing methods for creating healthy relationships and authentic community. Readers learn to apply New Testament principles that capture the essence of Jesus' teachings about effectively caring, serving, and loving one another. Beginning with God's simple command to \"Love one another,\" this book shows how to: * develop deep, genuine friendships * model to others a relationship with Jesus * create meaningful interaction with strangers * avoid the pitfalls of judging others * show people love, acceptance, kindness, and respect Complete with discussion questions, this book is appropriate for both individuals and church groups. It is a must for all Christians who wish to practice being the church rather than merely attending one.",
        "authors": "['Wayne Jacobsen', 'Clay Jacobsen']",
        "infoLink": "http://books.google.com/books?id=vW84DQEACAAJ&dq=Authentic+Relationships:+Discover+the+Lost+Art+of+%22One+Anothering%22&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the best book that I have read detailing what relationships should look like in the church. Using examples from their own experiences and Christ, The Jacobsen brothers cleverly and thoroughly go through 22 verses in the Epistles that focus on the concept of \"one anothering\". The chapters are masterfully ordered to display the progression of relationship building. The first section starts with one's relationship with God. The next progression is the genesis of a truly authentic relationship. The authors follow this portion with a section called, 'Sharing the Journey'. As the title states, this portion of the book details relationships within an authentic community. The final chapters deal with what happens with true spiritually linked relationships deepen. If this was not enough, the end of each chapter lists discussion questions that really allow you to search your heart and challenge the authenticity of your relationship with God and others.I have found the Jacobsen brothers to have true spiritual insight concerning what it means to walk the Christian journey in community with God and one another.Currently, I am involved with a fellowship of young adult believers who wish to reach out to our surrounding community and friends. I am going to purchase a few more copies and use it as a mid week study tool. I would advise you to purchase this book, prayerfully read it and allow God to show you how your relationships with people can become deeper!",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "Wonderful Book. Highly recommended reading for anyone interested in taking a closer look at how they and others deal with real community among believers. The author encourages believers to greater depths of fellowship as a people characterized by \"one-anothering.\" In this book Jacobson explores practical ways to encourage that community as well as takes a look at where we are now. This is an encouragement to read. The material is easy to follow for new or seasoned believers. I find myself referring back to the book in sermon preparation regularly. Pick it up!",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This book is helpful for all the relationships in your life. It's relatively small, but there is a lot of information here. I recommend reading it slowly, don't rush through or skim it, letting the ideas within sink in. Think over and meditate on them and how you can apply them in your own life.I'll definitely be reading this one again, down the track..",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is one of the best books on relationship development from a biblical point of view. Very practical and simple; not another list of \"to dos.\" Our small group is loving this book.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book is full of insight and has helped me a lot. Many of the thoughts are not original or new (there is nothing new under the sun) but have been put together in a way that just gels for me. I have heard and read these things many times, but now they have sunk in, and make sense, finally. Excellent writing. Starts with crucial foundations of accepting God's love and progressively builds from there. Can't say enough good about this book. Will read it over and over again.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is more than a book-it is (hopefully) a way of life, one that I am certainly desiring. Our Pastor has agreed to use this material as a basis to begin our home fellowship groups which is exciting to me. The subjects have been well thought out and applied and it is part of \"the progression\" of our christian walk that is a necessary ingredient.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book is a wonderful personal or group study book. It really helps us focus on how we can better serve each other and grow closer as a spiritual family.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I have met the author and corresponded with him several times and wanted to clarify after reading the reviews here. Everything said is true but don't walk away thinking this is just a \"self help\", \"relationship\" or \"5 step\" sort of book. The chapters are not long and can be red one at a time in any order you like. What they address is how the instructions to live by in the bible are not a checklist and set of rules but stem from a motivation to please God. Far from being another rule book, Authentic Relationships deals with how to live as a Christian and compares church life to CHRIST life in a practical real-life way. Nearly every church I know would benefit from the book if their pastors read it and took it to heart. If the hamster wheel of trying to \"be a Christian\" is wearing you out or disappointing you, this book can show you hnow to simply BE a Christian with other people with no religious strings attached--in a church or outside one. It is a life changer--highly recommended.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "My husband and I chose to read this book together and have really enjoyed it. It explains the practicality of one anothering each other in every relationship type -- marriage, family and friends (both old and new!).",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you are one who is seeking to have deep and intimate relationships with others in the body of Christ, this book is for you! Although spiritually deep, it is easy reading that leaves you changed into the image of Christ. There is no condemnation and this book is not about guilt trips. It is just pure truth held out in a loving way that draws your heart into being available to others who have been adopted into God's family! I would recommend this book highly to everyone. It would be an excellent Bible study for youth! The book has small group study questions that search your heart and beckon you to enter into the truths that are being presented. This one is a winner!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "wolfskin",
        "description": "An epic tale of enchanting adventure from the acclaimed author of The Sevenwaters Trilogy. Growing up on a farm in Rogaland, Norway, all Eyvind has ever wanted is to become one of the greatest Viking warriors-a Wolfskin-and fight for his leader in the name of the Warfather god, Thor. But his friend Somerled, a strange and lonely boy who arrives suddenly and is soon spurned by the other children, has his own plans for the future. And they begin with an oath of brotherhood, which Eyvind swears to prove to Somerled that he has an ally. A world away, Nessa, niece of King Engus of the Folk, begins her training to become a priestess of the Light Isles, and learn the ways of the mysteries. Many years later, Eyvind, now one of the most highly regarded Wolfskins, is obliged to accompany Somerled and a group of settlers, led by Somerled's much respected brother, Ulf, to begin a new settlement on the beautiful islands rumoured to lie across the western sea. The expedition begins badly, however, with a tragic event on board one of the ships. Something tells Eyvind that it may not have been an accident. . . In spite of these beginnings they reach the islands, and Ulf's new settlement is a harmonious one. Then one day, on a trip to a Holy place of the Folk, a brutal murder occurs. Now Eyvind begins to feel the binds of his boyhood oath, and realises what sort of future Somerled had in mind for himself all those years ago. . .",
        "authors": "['Juliet Marillier']",
        "infoLink": "http://books.google.com/books?id=3y4zBnBHLIsC&dq=Wolfskin&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book surprised me. People told me that, yeah, it was decent, but nothing to the Sevenwaters trilogy. I walked around it at the book store for nearly a year, thinking, I'll get it in paperback. I mean, I don't *really* want to read it. Finally, I gave in, got it. I've been reading some crappy books, lately. I was not expecting much here, either.Stupid, stupid me. I re-read the Sevenwaters books every few month, at least in pieces. It shocks me now that I could have expected anything but excellence from Wolfskin.The story is set in Norway and in Orkney, in the days of Vikings. The main character is, in fact, one of these northern warriors - the very best. He is a very simple man, is Eyvind. All he wants is to be a brave warrior for three, maybe five glorious years, and then to die a brave and glorious death. He is, for lack of a better word, wholesome. Despite the fact that he basically kills people for a living.When Eyvind is a boy, his brother brings home another boy child - Somerled - and asks Eyvind to teach this boy to be a man. Somerled is as complicated a person as Eyvind is simple; as unhappy as Eyvind is content; as brilliant as Eyvind is strong; as strong as Eyvind is brilliant - which is to say, not much. Nobody likes Somerled. Spending time with him loses Eyvind all his friends for the few months each year when Somerled is visiting. And yet... They become brothers, in more ways than one.Eventually, they grow up. Eyvind is the warrior he intended to be. Somerled seems to have a brilliant future at court. Everything seems right and just as it should be, except for some things that Somerled does - some things that are less than humane, less than conscionable - some things that are beyond Eyvind's ability to believe of his friend. Eyvind genuinely believes in the goodness of people and certainly in the goodness of his friend. He refuses to follow his suspicions to their logical conclusion. He refused to see the clues.An expedition mounts to sail across unknown waters, to find a place of rumors - a beautiful place, that promises advantages beyond count. Both men find themselves on the ships. Then, both men find themselves on the Light Isles, which are everything they could have expected or imagined. Here is a new place - a place for new beginnings, a place for opportunities, a place where a man like Somerled - weak, but brilliant - can have a worthy place. The only problem is that a place this beautiful has not been sitting unoccupied in the ocean all these years. It has a people and a long, deep history. There is a girl here, as beautiful as her land - Nessa. She sees in Eyvind more than he thinks of himself. And, soon enough, Eyvind begins to see things more clearly - all sorts of things, including his friend. And what he sees scared Eyvind, though he be a great, fearless warrior. It scares him and his bonds of brotherhood with Somerled begin to chafe. Unbearably.This is not an easy story to fit into your heart. It examines the worth of loyalty, the pain of betrayal, the necessity of denying love, and the strength required to do what is right. Nothing is over-exaggerated. Nothing is melodramatic. Nothing is predictable or obvious. Marillier has an extraordinary ability to capture life - the way it never seems to promise more than is already there, and the way things can change in the blink of an eye despite all expectations.Truly, I highly recommend this book. I can't wait for the second one, called Foxmask.",
                "review/helpfulness": "42/43",
                "num_reviews": 43
            },
            {
                "review/text": "Having read The Sevenwaters Trilogy, I was somewhat nervous about reading this new effort by Marillier. Too often in the past, I have been disappointed by second series from an author. Not this time.I won't try to compare the two, as this is a more realistic painting, with less, though not empty of, the magical elements of the old myths and legends. It is an excellent psychological portrayal of disparate personalities, forged in totally different settings and cultures.Marillier's blending of historical reality and fantastical imagination was well paced, beautifully worded and ended with a combination of both hopefulness and a fear for the future. All the characters came vividly to life.The basis of the story is written in other reviews, but the beauty of the book is in how it is brought to life. There is no stereotyping, no simplistic escapes. There is no dumb Norseman, no feministic ranting, no male chauvanistic chest beating.For a reader who likes depth to his or her fantasy reading, who likes character and plot development over gory action, this is the book for you.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "Although I felt this was a strong foray into another world for Marillier, Wolfskin never ended up affecting me as strongly as her previous Sevenwaters trilogy. The book in general was an excellent read, with some extremely haunting parts regarding Somerled's acts that made the story more real for me. However, after bringing the story to an emotional height, Marillier still had about 100 pages to go, and those 100 felt a little too dragged out for me.Although the fate of the Isles still had to be decided by the end, I felt as though much of the tension and interaction between the main characters had already been resolved, leaving me a bit bored while waiting for the ending to fall into place. I would still recommend it as a good book -- just doesn't compare to her first trilogy.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "While reading this book one scenario kept popping into my head. A group of children say all about eleven years old, goes on a walk to an abandoned field. Once there, they set up their own little world, totally cut off from adult supervision. The child among them most interested in law and rule is somehow removed. What happens to the truth in this group of children? Left all alone will they act as they should, with morals, or fall into a pit of desperation? Will the strong bully the weak and allow power to solely rule the people? What role with fairness, wisdom truth and standing up for what is right hold in this new world?That sounds a lot like Lord of Flies (not that I've ever read it) but it's also what happens in this book, about Vikings. A settlement to a far off island, already peopled, heads in a terrible direction when those interested in peace are removed, and everyone left falls under the spell of blindly following the leader. This novels deals with truth, redemption, and quite a bit about faith. Specifically, when does blind faith, or trust, cross a line that prevents free thought? How far can we go in our faith to anything? How much does truth matter compared to trust and faith and keeping your word? This is also a fairly dark book, but reminds us that there is always light in truth.Like all of this authors books the writing is beautiful. I felt this was a much more complicated novel then anything she's written before, especially with the subtext of the book. The plot also seems to be more complicated, even if it is a bit like something out of a fairy tale and thus fairly predictable. I did get annoyed with the latest in this authors never ending stream of amazingly wise, competent, beautiful and powerful 16 or 17 year old girls. An older heroine would be nice.This made me think, so four stars. I'll read the sequel, but this will never be one of my favorite novels. I did learn a lot about Vikings, especially the faith element of the so called \"berserkers\", and the way their life of war was viewed.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "I read and enjoyed Marillier's Sevenwaters Trilogy, but found Wolfskin to be an unsatisfactory follow-up. The language itself is beautiful, but sometimes I just got lost in it and had to surface for air. Anything that draws my eyes out of the book is not a good thing.I liked Eyvind, although he's not the sharpest tool in the shed, but, unlike some other reviewers here, I found Somerled to be completely unbelievable. He was straightforward evil. Boring. Marillier tries to make him conflicted, but she never showed me more than one act of kindness on his part in the entire novel. This doesn't make me feel that there is good inherent in him. I felt cheated. I felt like the other vikings were much too easily swayed to follow him.Also, I felt like she missed opportunities to truly show me people's reactions. With so many pages, there was ample opportunity, but her tendency to tell rather than show distances me as a reader.Overall, it had a good premise, but it fell short of expectations. On the positive side, I did finish the thing. If I really can't stand it, I just can't make myself plow through to the end.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Reading through all the other reviews a second time I understand that this great book cannot compare to Daughter of the Forrest. But compared to all the other books I have read this one is still an excellent read.I was compelled to write this review in order to urge people to read this book and not be put off (like I was) by some of the bad reviews. I was also angered to find after finishing the book that the 'dumb' hero never turned up through-out it, like I was told he would. Eyvind was not smart - he was wise. If you fail to see that then you are merely being drawn in by Somerled's words. Somerled - a man who is not at all wise, although he is wily and clever with words. Euvi had a dream to be a warrior - why is that so stupid? To believe in a God of war and to actually have a dream, which is more than some people, is amazing. Infact thats what he and Somerled shared - a dream. The fact that many people scorn those whose dreams are deemed 'stupid' shows how narrow-minded and cruel these people are. Any dream is great in itself.This story is not as good as Marillier's other series but it is still a delight to read. There are common plots and themes throught these two series but the mere fact of a different setting and race (like Vikings) make Wolfskin enjoyable.I look forward to reading Foxmask, the second book that follows, which is also not unlike the Sevenwaters trilogy in its link between children to continue the story.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Ulf, already a Viking warrior Wolfskin, learns about a magical place across the sea. Believing there must be plenty of treasure and a chance to do honorable deeds in Thor's name, he decides to sail for the Orkney Islands. Young Eyvind sees this as his chance to become a Wolfskin and pleads his way onto the crew.They reach this land, but find friendly people led by a kind-hearted king Angus who are willing to share their bounty with the \"invaders\". Eyvind meets the monarch's niece, the seer Nessa and falls in love but though attracted she does not trust the newcomers. Eyvind's new happiness is tested when his heart friend, Somerled, invokes their childhood blood oath of lifelong loyalty. Somerled's demand places Eyvind in a tug between honor andlove exacerbated by a disease that ravages the natives Folks, but not the Norsemen which leading to enmity and perhaps war between the two groups.Juliet Marillier takes her audience to the same Dark Ages that is the focus of many of her novels with this deep gritty tale. WOLFSKIN takes no prisoners as the audience observes a hostile world even when the two groups forge an alliance. The key to this powerful historical is the cast as Eyvind, Nessa, and Somerled seem genuine and their \"triangle\" makes for great insightful reading. Ms. Marillier shows why she is among the top writers of historical fantasy with a fabulous opening novel that will excite readers with its depth.Harriet Klausner",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "Reading over the reviews other readers have given, I can see frustration in the lines. too little, too late, some say....can't find the good part, others say. If you've read the Sevenwaters Trillogy, and you expect this to be also the Sevenwaters Trilogy, then yes, you're to be frustrated.The main character is not so perfect, here. Indeed, a great deal of psychological and sociological ugliness happens in this book, and there's many times when you want to reach into the pages and grab necks and thump heads, but that is the power of Juliet Marillier's writing.The first chunck is slow. Yes, indeed. Painfully so. But folks, get past the first bit, and you won't be sorry.It's a story of the evolution of personal mentality and ethics and awareness that takes the book to span. The psychology is good. The characters breathe. It isn't a tidy story...the convenient thing doesn't happen, and it does not bend to the reader's want for instant and complete gratification.I ADORE this book, even more than Daughter of the Forest, because of that.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This is the story of a brave Pictish (Scottish) girl who falls in love with a dumb, strong Norse invader. I love Marillier's writing, but this book could have been so much more! It comes across as a very pale imitation of her first novel, Daughter of the Forest. Do yourself a favor and read that one instead.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "After finishing the Sevenwaters trilogy, I was eager to read her other books, but hesitant as well. Although the beginning of this book got a bit long describing Evyind's life, I understood that it laid down a foundation for the rest. I enjoyed the romance much more in this book than her Sevenwaters trilogy. There was more leading to the romance and less abrupt in the coming together of the two people. Although I'd like some new material from Ms. Marillier rather than just having a heroine nurse a hero back to health all the time (like most of her other books). I enjoyed it at first but would like something new and maybe some more obvious romantic tension (kinda like in this book but more). Additionally, I liked how she wrote a little bit about the life they lead after coming together (some books just end at the part where the couple gets together and it always leaves me curious to know more). There were some cheesy parts in this book but it was a good, leaves-a-goofy-grin-on-your-face cheesy. Something I'd like to read in her sequel is about the life Evyind and Nessa have together and not just cutting straight to their children. It's a bit depressing to read about the people, who you cheered for in the previous book, die or become minor characters. I'm sure their lives can still be interesting and challenging after they come together... Thus far, my favorite book from Ms. Marillier is the first book in the Sevenwaters Trilogy (Daughter of the Forest) though it could've had more romance earlier, the characters and situation pulled me in and made it very interesting. Overall, I have really enjoyed Ms. Marillier's books and hope to read more in the future!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "alter your life",
        "description": "A rousing action program for overcoming adversity and taking charge of life -- by one of our century's greatest mystics. For unhappiness, frustration, loneliness, and other afflictions of the spirit, Dr. Emmet Fox prescribes a powerful remedy based on the life and message of Jesus. In Alter Your Life, Fox explains that these \"dreary\" problems are actually bad habits of mind -- habits from which we can free ourselves. \"There is no necessity for anything but success, good health,prosperity, and an abounding interest and joy in life,\" Fox writes Through a series of brief meditations, Fox shows us how to exchange our bad habits of mind for the healthy ones demonstrated by Jesus. Based upon biblical texts, Alter Your Life offers a progressive, life-changing course designed for all readers, whether or not they have read a religious book before.",
        "authors": "['Emmet Fox']",
        "infoLink": "https://play.google.com/store/books/details?id=c3Hx13_F5bYC&source=gbs_api",
        "review": [
            {
                "review/text": "This book is definitely one of my alltime favorites, as are most of Emmet Fox' books! For anyone who is serious about personal and spiritual growth, this book is a must. Emmet Fox' interpetation af the Scriptures are so profound......if you are a christian, this is a book that will help you to grow into greater understanding of the teachings of Jesus Christ, and if you are not, you will probably evolve into much greater respect of the bible and its teachings. I cannot explain in words how much this book, and others by Emmet Fox, has meant to me. It has completely liberated me in all ways and my life has been so much easier. Needless to say, I highly recommend this book to everyone!!!",
                "review/helpfulness": "29/29",
                "num_reviews": 29
            },
            {
                "review/text": "As usual, Emmet Fox uplifted my spirit and brought me closer to God in a way no religion has ever! A must read for the person that is willing and wanting to grow spiritually.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "I came across a beatup used hardback copy of this book in a Salvation Army 25 years ago. I am an African American woman with Pentecostal, Baptist, and Muslim background from my childhood. None of these doctrines ever spoke to my inner being the way Emmet Fox did in that little green book. It truly did alter my life and the way I viewed the universe and my place in it. I have since read all of Fox's other books an highly recommend this one for the novice in metaphysics.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "This book by the great metaphysical teacher deals with the practice of the presence of God and much more besides. It explains the technique of scientific prayer and explores allegorical interpretations of Biblical passages. Amongst the most interesting are those on the four horsemen of the apocalypse, the book of Genesis, the seven days of creation, Adam and Eve, the tower of Babel, and the Zodiac as a great cosmic symbol serving as a diagram for the unfolding of the human soul. The symbolism of the number 12 is also considered here.Fox focuses exclusively on the esoteric symbolic exegesis, but for the seeker of truth it is important to understand that there are many layers of meaning in the Judeo-Christian scriptures, and that the literal is often equally valid or relevant. In this regard it is always helpful to study the way in which the Hebrew sages approach the text, in both the Talmud and the Zohar.Other chapters of valuable insight include the Seven Main Aspects of God and the Magic of Tithing. Amongst the best passages are those that warn against false teachers and provide guidelines to discern the false from the true, and the section on the precession of the equinoxes and the long, mostly unknown history of mankind. The most comforting chapter: God The Deliverer, is a discussion of Psalm 18.This book was first published in 1931. On pages 116 and 117 of this 1950 edition, Fox deals with the great changes to come and their timing. Unfortunately here he has been proved wrong, as he maintained that the most revolutionary and far-reaching upheavals in the circumstances of human life \"will be over and done with in from twenty to twenty-five years from now.\" I am not aware of any major changes of such significance that occurred anytime between 1951 and 1956, unless he meant the coming of Elvis!That failure in timing aside, Alter Your Life is still a great read on various levels. Besides the first 14 chapters dealing with spirituality and the immanence of God, the last two discuss the American spirit and the historical destiny of the United States. I found these particularly illuminating, especially the author's views on the Declaration of Independence and the Constitution and his detailed explanation of the symbolism found on the currency and the Great Seal of the United States. This section includes illustrations.In the last few pages, he sounds a warning that seems to be ignored these days. He perceived that there was only one real danger to the USA - grave division among her people. He maintains that such a danger cannot arise as long as the American people are careful never to allow party spirit to become so embittered that the destruction of political enemies seems more important than the safety of the country.An orderly democratic state will only endure as long as the people loyally accept the verdict of the majority of their fellow citzens when expressed constitutionally, and loyally support those who are elected to office, whether they like them personally or not. In his own words: \"Any other attitude is really to put a faction before the nation, and if this is not disloyalty, what is?\" He further warns that any newspaper, politician or group that unduly fan the flames of sectarian or political bitterness is to be distrusted. This is an appropriate warning, more relevant than ever in these uncertain times. Take heed America.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book by the great metaphysical teacher deals with the practice of the presence of God and much more besides. It explains the technique of scientific prayer and explores allegorical interpretations of Biblical passages. Amongst the most interesting are those on the four horsemen of the apocalypse, the book of Genesis, the seven days of creation, Adam and Eve, the tower of Babel, and the Zodiac as a great cosmic symbol serving as a diagram for the unfolding of the human soul. The symbolism of the number 12 is also considered here.Fox focuses exclusively on the esoteric symbolic exegesis, but for the seeker of truth it is important to understand that there are many layers of meaning in the Judeo-Christian scriptures, and that the literal is often equally valid or relevant. In this regard it is always helpful to study the way in which the Hebrew sages approach the text, in both the Talmud and the Zohar.Other chapters of valuable insight include the Seven Main Aspects of God and the Magic of Tithing. Amongst the best passages are those that warn against false teachers and provide guidelines to discern the false from the true, and the section on the precession of the equinoxes and the long, mostly unknown history of mankind. The most comforting chapter: God The Deliverer, is a discussion of Psalm 18.This book was first published in 1931. On pages 116 and 117 of this 1950 edition, Fox deals with the great changes to come and their timing. Unfortunately here he has been proved wrong, as he maintained that the most revolutionary and far-reaching upheavals in the circumstances of human life \"will be over and done with in from twenty to twenty-five years from now.\" I am not aware of any major changes of such significance that occurred anytime between 1951 and 1956, unless he meant the coming of Elvis!That failure in timing aside, Alter Your Life is still a great read on various levels. Besides the first 14 chapters dealing with spirituality and the immanence of God, the last two discuss the American spirit and the historical destiny of the United States. I found these particularly illuminating, especially the author's views on the Declaration of Independence and the Constitution and his detailed explanation of the symbolism found on the currency and the Great Seal of the United States. This section includes illustrations.In the last few pages, he sounds a warning that seems to be ignored these days. He perceived that there was only one real danger to the USA - grave division among her people. He maintains that such a danger cannot arise as long as the American people are careful never to allow party spirit to become so embittered that the destruction of political enemies seems more important than the safety of the country.An orderly democratic state will only endure as long as the people loyally accept the verdict of the majority of their fellow citzens when expressed constitutionally, and loyally support those who are elected to office, whether they like them personally or not. In his own words: \"Any other attitude is really to put a faction before the nation, and if this is not disloyalty, what is?\" He further warns that any newspaper, politician or group that unduly fan the flames of sectarian or political bitterness is to be distrusted. This is an appropriate warning, more relevant than ever in these uncertain times. Take heed America.Americanism:The Fourth Great Western ReligionPower Through Constructive ThinkingThe Creative Process in the IndividualPracticing the Presence of God for Practical Purposes",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "Following the writings and thoughts of Emmet FoxI wished I could read his thoughts regarding theBible. If this mindset is what you seek:I highly recommend \"Alter Your Life\".Dr Fox explains his enlightened interpretationhow to exchange our bad habits of mind for healthy ones,using Allegory demonstrations by Jesus and the Bible.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The product arrived proptly and in very good condition.The book is a must read for those seeking deeper relationhsip with God and better self awareness of our place in the universe",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "This is an amazing book if you'd like to find a \"road map\" for internally changing your life! A MUST read!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the heartache no one sees real healing for a womans wounded heart",
        "description": "At a time that should have been considered the highlight of her career, Sheila Walsh admitted herself to the psychiatric wing of a Washington, D.C. hospital. Having worked for five years as cohost of The 700 Club, the years of treading water while trying to keep so much around her afloat and keep various plates spinning left her drowning in a hopeless sea of clinical depression. Despite her best efforts, she simply couldn't will herself out of it. Now more than ten years later, Sheila understands what it's like to be wounded. It has been the passion of her heart to study what God's Word has to say about this and then share her liberty with other hurting souls. Divided into three sections (Healing, Spiritual Warfare, and Relationship), this book offers readers practical steps not only to receive the healing that God offers but also to maintain the ground that Christ has restored to them.",
        "authors": "['Sheila Walsh']",
        "infoLink": "http://books.google.nl/books?id=rFPknQEACAAJ&dq=The+Heartache+No+One+Sees:+Real+Healing+for+a+Woman%27s+Wounded+Heart&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Heartache No One Sees opened my eyes and helped me dig past the mask that I wear in order for others to think well of me. Instead of hiding behind a everything-is-fine mask, Sheila Walsh encourages us to be open to God's redemptive work, to be realistic about the needs that we have and to reach out to others who are also hurting and hiding. Sheila is a real person and very easy to get to know through her writing. I am so thankful for God's work through this book!",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "This is one of the best books i have ever read!!!!!!!!! Especially on those that are hurting. It is balanced and its as if the writer knows exactly what you are going through. Anyone who struggles with depression should read this book. The author is so real and honest and her heart so true. i just gave this book to a girl who went into rehab. i gave her mine because i didnt have time to get another one. it was VERY hard to give up, but i knew that it would really help her. i am now looking to buy another one. this is not a book you read once. its a great book to refer back to over and over.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "Sheila is a blessing from God and has used her life to minister to those hurting. It's a blessing blessing others. Wonderful book that will touch any woman's heart with so many practical and easy to see examples that we can use and relate to in our own lives, even those of us not on TV or with WOF or in the public eye. She is down to earth and honest and gives/shows HOPE with lots of practical questions at the end to ask yourself and think and pray about!",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This was an awesome book. Through the book Sheila opens up her own life to illustrate to us the points she is trying to get across. I have always appreciated her honesty. After each chapter is a number of questions for application as well as a study guide in the back of the book. The book is broken down into 3 major sections: 1. Heartache, 2. Warfare & 3. Community. Part 1 Heartache: We all know that this world can be cruel and has a way of shattering our dreams. This part addresses the hurts & shame that we carry with us. In todays day in age we tend to isolate ourselves and put on that mask that tells everyone that we are fine even when we are dying inside. Sheila talks about things that can put us in these situations and the lies that we believe. She also addresses the questions of if God really loved us why am I do bad things happen to us?? A good point that Sheila makes in the book is that just because we are suffering, that doesn't mean God has stopped loving us. Part 2 Warfare: In this section Sheila shows us that our battle isn't against flesh and blood but against the devil. We need to be ready for battle and be on our guard every single minute because he is looking and waiting for ways to bring us down. In her chapter \"Dressed To Kill\". Sheila talks walks us through the whole armor of God as found in Ephesians 6. It was a good reminder to me. When I was in YWAM, I used to pray the armor of God over my body every morning in my quite time. Sometime ago for whatever reason I stopped and have completely forgotten about it. It is something I need to continue and we all should do. We need that protection each day if we are going to live for God and resist the enemy. Part 3 Community: Sheila uses this section to wake us up from our slumber and selfishness and get us investing into the lives of others. It is so important and something we in todays day and age have lost. I love community and I love the interaction but I must admit that I am selfish and times and don't want to get into other people's messy lives and yet that is what we were created for. We are so quick to judge and we need to be quick to offer love and grace to people. \"Lord, change my heart\". Sheila says if we truly want to live the way Jesus calls us to then we need to selflessly give our lives away for others. One point that I found facinating was: \"It is the Church's responsablity to be a healing community, bathed in grace and love, unbinding one another so that we can walk\". This is so timely. At my church, New Song, last Sunday we were talking about this and how we need to be investing in the lives of those around us. We get so caught up in our hurt and pain and pull away from people. And instead of being united (as we are suppose to be) there are big gaps where people have pulled away from each other. No wonder why Satan has such a foot hold. We are offering him wide gaps through which to enter! Sheila's closing thought on the book and the theme through out the book is Don't Hid Your Heart\"! Funny as that was the title track from her grammy nominated album in 1985. This book was a great read and I would recommend it to all.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book takes courage to read! But so very worth the effort that it takes to work through the \"gunky\" build up of the stuff life leaves behind. Like your car needs a tune-up, so does your soul, and you can find the tools needed here! But the work is not for the faint of heart! And know that in the end you will be stronger for it! Then, be ready to walk with someone else as she goes through it.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The Book is both comforting and inspiring. Sheila Walsh writes from the heart, there's nothing slick or glib in the book. I've also read her recent book titled Get Off your Knees and Pray and was equally impressed, her life experiences have transferred well.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I honestly never finished this book, but the part I did read and work through (questions, etc.), was absolutely wonderful! As I went on a retreat, I had forgotten this book, so I read and journaled through \"The Wounded Woman\" instead, and that was the book God usesd to help me overcome my \"victim mentality\". I believe this one would have worked just as well.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is on of the best books I have ever read on depression and heartache. Shelia shares her own heartaches and helps the reader realize even Christians have bad times, but God is always there to help. She give practical ways to overcome and cope as well as the truth that heals. She lifts the readers eyes to God from which cometh our help.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "my soul thirsts an invitation to intimacy with god",
        "description": "With years of reflection and experience with drawing closer to God, Korch, dean of Western Seminary in Northern California, offers insights that provide readers with tangible reference points for evaluating and building a more intimate relationship with the Creator.",
        "authors": "['Steve Korch']",
        "infoLink": "http://books.google.nl/books?id=MY6BmVih-SsC&dq=My+Soul+Thirsts:+An+Invitation+to+Intimacy+With+God&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an essential book for men and women who have been active in church for years but feel something isn't quite right. Their day-to-day Christianity is delivering a lot less than they had hoped. For them, God is a doctrine, not an intimate friend. This refreshingly practical book is about Intimacy with God from a guy who lives in the Silicon Valley, not a hermit's cave. Steve uses vivid metaphors and personal stories that slip biblical truth through the side doors of our hearts. He updates dusty labels on the jars of life-changing biblical truths like joy (for the \"humor-impaired\"), prayer/spiritual power (\"overcoming life's obstacles\"), knowing the Bible (\"hearing God's voice with your whole being\"), and authentic passion for God (\"dancing in the Arms of God\"), making them accessible and motivational! The thought provoking discussion questions at the end of each chapter make this an excellent choice for home Bible study groups or workplace Bible studies. Bottom line: Any follower of Jesus can have an intimate and adventurous relationship with God. It can happen and this book helps show the way!",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "This book expecially Chapters 3 and 5 changed my outlook on life. Thank you very much I would recommend this book to everyone who is searching for a deeper relationship with God.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "My Soul Thirsts is a rich feast of spiritual delights for Christians seeking a more intimate communion with their heavenly father. Korch covers a wide range of spiritual disciplines and dimensions and issues a challenge to every Christian, no matter how mature, to go deeper. This is a touchstone sort of a book that can be re-visited many times for thoughts and a spiritual tuneup. Korch uses many Biblical references, quotes and illustrations to help bring alive his message. Expect to be challenged by his direct, personal approach bundled with an easy-to-read, friendly style.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the other side of the river",
        "description": "Explores America's racial antagonisms through the story of two Michigan towns--one white and wealthy, the other Black and poor--and a Black boy's death and its repercussions",
        "authors": "['Alex Kotlowitz']",
        "infoLink": "http://books.google.com/books?id=8tE90cxVYtwC&dq=The+Other+Side+of+the+River&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a \"must read\" for anyone who has come to their senses within an apostate church and wondered what to do and how to do it. The Bible is clear that we are to mark and avoid false teachers (Rom. 16:17) and separate ourselves from those involved in sin (1 Cor. 6:17) while continuing to pray for them. But the issue of rejecting heresy and false prophesy becomes a matter of personal fortitude and deep emotional hurts when it involves close friends who have been brainwashed by \"the river\".My testimony is similar to Kevin's in certain ways, though the Lord saved me from deep involvement in the Third Wave. I lost a number of close personal friends when I found myself in the position of either obeying the Lord and His Word or coming to consensus with men. But the Bible does not give Christians an \"option\". We are to stand for the truth whenever and wherever it is demanded of us, whether in the world or in the churches. We must stand for unity, but that means we are to put on the unity of the Spirit and strive for unity in the Faith (Eph. 4). When unity of the Faith (unity in the core doctrines as taught by Jesus Christ and the Apostles) is not being upheld and taught, then the individual Christian is duty bound to reject that heresy and seek fellowship elsewhere. The Bible is clear that those who obey the Lord prove they love Him, and conversely those who disobey Him prove they do not love Him (John 14:15, 23, 24). We have many choices each day whether or not to obey the Lord. All of us fall down on this account. But we cannot be reconciled to the Lord without (1) repentance of sin and (2) not allowing ourselves into a situation of habitual, continual sin. Staying in a church that is teaching heresy, participating in false prophecy, and promoting false anointings (which are of another spirit) is putting yourself in a position where you are violating both of the above criteria for staying in the love of Christ. Only Jesus Christ can save because of His perfect substitutional salvation He purchased for us with His blood on the cross. But we must repent of our sins and turn to Him, taking up our cross daily and following Him. You cannot follow the Lord while living in habitual sin, and you will not be saved as long as you remain unrepenant. Remember that many will come saying \"Lord, Lord\" in the end but they will go to hell. They are those who think they will be justified by their many works of doing miracles, prophesying, casting out demons, etc. Today we have a whole generation of Christians who are enamored with works, and defend those they follow by constantly referring to them. But the Lord says this:Matt. 7:21-23 \"Not everyone who says to me, `Lord, Lord,' will enter the kingdom of heaven, but only he who does the will of my Father who is in heaven. Many will say to me on that day, `Lord, Lord, did we not prophesy in your name, and in your name drive out demons and perform many miracles?' Then I will tell them plainly, `I never knew you. Away from me, you evildoers!'What is the will of the Father? That we obey Jesus Christ. Jesus says we are to reject heretics by marking and avoiding them. The commands of the Lord are simple, but the reality of obedience is not. But we cannot be blessed by the Lord and gain eternal life without obedience.",
                "review/helpfulness": "19/23",
                "num_reviews": 23
            },
            {
                "review/text": "The Other Side of the River is the true-life memoir of author Kevin Reeves, detailing how a spiritual movement called \"the River\" (also known as the Third Wave or the Latter Rain) and its repercussions within his family's church, the New Covenant Fellowship, affected his life and faith, as well as that of his loved ones. The Other Side of the River tells of how warnings of divine retribution were used as threats to keep members in line; how such blatantly false or nonsensical beliefs such as the idea that faithful women never feel pain from childbirth (since pain of childbirth is allegedly the legacy of the Original Sin) were prevalent; questionable worship practices; the author's own search for truth in the words of Jesus Christ and scripture even as he became increasingly disillusioned with the cultlike behavior he saw; and much more. \"...the true prophets of old and the original New Testament apostles didn't charge at all for the Gospel, but today's prophets, acting more in the know than even Paul or John, make a hefty living drawing in the crowds. As long as they're able to come up with one more hidden key to spiritual prosperity, as long as they can persuade the average believer that he is lacking in some Christian fundamental, today's gospel merchandisers will continue to draw the misinformed with their promises of more. And make them pay through the nose with it.\" A sober and reflective testimony on the misuse of religious leadership, trust, and authority, highly recommended.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "I left these practices years ago and this book hits the nail right on the head. Excellent reading - won't be able to put this book down. Recommended reading for all Pentecostals and Charasmatics.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "II Timothy 2:15 tells us, \"Be diligent to present yourself approved to God, a worker who does not need to be ashamed, rightly dividing the word of truth.\" Much of modern Christianity has strayed from this important truth to their own hurt. Having been in the Charismatic movement for a number of years myself, I can relate to what Keven Reeves has to say about it's numerous excesses. For having the guts to expose the error in his own charismatic congregation, I admire him.I John 4:1 tells us, \"Beloved, do not believe every spirit, but test the spirits, whether they are of God, because many false prophets have gone out into the world.\" If this was true in the first century of John's day, how much more so are we seeing an abundance of false teachers or prophets dispensing teaching contrary to Scripture today! No longer are we encouraged to test the spirits, but rather exhorted to unreservedly enter into the latest move of God.Just as a person can be addicted to drugs, food, alcohol, spending, etc, they can also be addicted to emotional religion. While at first a little satisfies, just as with any other drug, you need ever increasing doses to get the same high (emotional rush).Having said that I really believe our God is the same yesterday, today and forever. Just as he healed when on earth, he still heals today. The important thing to remember is that when our Messiah did miracles in the gospels, people weren't rolling around on the floor, barking like dogs, writhing like snakes and on and on. In fact the Scriptures tell us that after being set free, a man who had moments before been inhabited by a legion of demons was \"clothed and in his right mind.\" (Luke 8:35) It was before Jesus set the man free that the demonic manifestations were taking place. Even if the leadership claims that a weird manifestation is of God, I contend that if what you see looks and acts like a demonic manifestation it undoubtedly is.While much of information in Reeves book is excellent, I have two problems with his presentation. First of all, Even though at times he comes across that way, he does not have the last period on Scriptural truth. None of us do.Also, while much of the Charismatic movement if full with error, we need to be careful not to throw the baby out with the bath water. While there are counterfeit healings, there are also genuine ones. Satan can't create anything. He's the master at counterfeiting God's wonderful works.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "I found Mr. Reeves' book after I bought \"Why I Left the Prophetic Movement\" which was very disappointing! Mr. Reeves shares his struggles with questionable teaching in the charismatic community in a way I found refreshing! He points out how a lot of what is being taught isn't found in the Bible but is based on experience and opinion. Much of what is being taught, especially in groups that adhere to the so called \"Toronto Blessing\" is actually heresy and Mr. Reeves' backs up what he's teaching with sound Scriptural teaching that sticks to what the Bible actually teaches and not what someone else may want it to say when it actually doesn't.I also found Kevin Reeves to be a man of godly humility and someone I can trust. He gives us freedom to doubt & question & helps us focus back on the truth of God's Word.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book was very helpful in understanding what the deception is that my own parents have been enamored with. It is a must read for anyone who is battling with loved ones who have fallen away from the truth and become involved in practices that contradict the Bible. My battle has lasted 5 years now, but I continue to pray that God will remove the scales from their eyes. Very definitve on Word of Faith, Charismatic and \"spirit-filled\" deception.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "If you have serious questions about what is God, or False folly that is breaking out in curches everywhere since the Toronto manifestations began, this is a book to read. It is an eyeopening account from a man who was in leadership for many years, and who has now bravely discarded 'the lie'. I suspect most christians will identify fully with the encounters he 'tolerated' despite his growing discomfort, due to the 'false' dilemma of loyalty to leaders versus loyalty to the WORD OF GOD.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is great for anyone that had never practised discernment and a must for people that were or are involved in word faith, charasmatic, holy laughter movements etc.I gave a book to my pastor and he asked if I had other copies so he could pass them on. If you have a loved one caught up in these things give this book to them to read...they will thank you for it.This is a must read!!! Highly recommended.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is a must read for anyone who has seriously questioned the new-thing approach to church and to Christianity itself. It is a lovingly worded corrective written beside a deeply personal reflection that draws us back to a faith that is upheld by the Word and lived out in love and integrity.I bought ten extra copies to pass along to friends. All have been read and appreciated.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "A great book by someone who was deceived for many years by the \"River Movement\", which also is related to the \"Word of Faith\" and \"Dominion/Kingdom Now\". These movements are endorsed by people like Benny Hinn, Kenneth Copeland and many other TBN heretics. Other well-known names to watch out for are Jesse Duplantis, John Wimber, and Rodney Howard-Browne. I would honestly like to see the amounts of money being made by any one of these people. It's a shame that Christians do not compare what these people say with the Holy Bible (KJV).So-called holy laughter, shaking, heat sensations, etc are not holy at all. Thank you Mr. Reeves for having the courage to come forth with your story and enduring the chastisement from others and also the embarrassment that comes with acknowledging your errors after searching the Scriptures.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "a faith to grow on important things you should know now that you believe",
        "description": "Bible passages, prayers, and word plays teach children about God, His creation, Jesus, and how to develop the characteristics of a Christian.",
        "authors": "['John MacArthur']",
        "infoLink": "http://books.google.com/books?id=xJUAAAAACAAJ&dq=A+Faith+To+Grow+On:+Important+Things+You+Should+Know+Now+That+You+Believe&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "It's has always been my hope that parents start building a strong understanding of theological truths in the lives of their children. This book is a great tool to do just that! I do believe that every home which owns and uses this book would benefit. An additional note: Although this book is targeted for the younger elementary age group, it can also be used with new believers who need to get acquainted with the basics. In this post-Christian era we live in, it's amazing how many adults don't know any of the content found in this childrens book.",
                "review/helpfulness": "23/23",
                "num_reviews": 23
            },
            {
                "review/text": "My daughter got this book as a gift for Christmas. It was the best thing she received! A child has such a hard time understanding God, and what he means to our lives. This book explained so much to her. As she progressed through it, I could see the changes in her both mental and emotional. Some of the best chapters and segments were: Can we see God?; What does God want from us?; What should we do when we don't understand God?; Had God really lived forever?; Does God want me to be punished. The list could go on and on, but there is just not enough room to explain how much this will help your child. Some of the other chapters include wonderful segments and descriptions of: Creation, Sin, Bible History, Jesus, Salvation, Worship, Prayer, Church, Forgiveness, Evangelism, and Heaven.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Catechism.It's a word that many evangelicals don't even know the meaning of, let alone practice with their children.Consequently, a whole generation of young people in Christian homes are growing up without a whole-orbed understanding of what God has spoken to His people.Don't just assume that your children will somehow pick up everything they need to know about Christianity: John MacArthur has given us a valuable resource to help us teach our children simply but systematically the fundamentals of the faith.In about eighty devotions subdivided into sections on God, Creation, Sin, the Bible, Jesus, Salvation, Worship, Prayer, Church, Forgiveness, Evangelism, & Heaven, Dr. Macarthur covers what every young person needs to know. Each devotion begins with a question, like \"What should we do when we don't understand God?\" A paragraph-sized answer with Scripture verses, a word scramble, a short prayer, and a suggested activity explain what the Bible says.Well written, this book can be used as a personal devotion by a young reader or as the basis for family devotions, as I have used the book for years. Highly recommended.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "So many Christian children get lost beyond the \"Jesus died on the cross to save us from our sins\" line they hear over and over again as young children, but then they never go deeper into their Christian faith than that.In this book, MacArthur does an excellent job of laying out the foundations of our Christian faith. As a parent -- and especially as a father -- I try to be diligent in presenting the Christian faith to my three children. This devotional is an excellent resource in explaining to our children what we believe in as Christians and why we believe it.If you are a parent, or even a Sunday School or Children's Church teacher, who wants to explain the foundational principles of the Christian faith to children, this is the book you want!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "THE BEST. Excellent. I highly recommend.As with all of Dr. John Macarthur's works, this ispacked with life changing Biblical TRUTHS, wisdom and sound doctrine.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Really wonderful, basic, BIBLICAL explanations of Christianity 101 for kids! Nice also that it has the little word scrambles - my 7-year-old engages with those! Wonderful explanations (I've learned a lot, too!)",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you are looking for a well-written family devotional that teaches biblical truths and will actually intrigue your child, then look no further. This book approaches several larger topics, such as God, then provides a two page devotional that addresses questions such as \"Is God perfect.\" At 191 pages, this book touches many topics in bite size pieces that children can comprehend. Within each topic, there is a section of Scripture, a small devotional, questions, a word scramble and prayer starters.When I first purchased the book, I was a little hesitant since MacArthur is the \"Charles Spurgeon\" of our day. I just did not know how his writing style would relate to children, but I was delighted when I realized how well it did. I lead my family through the entire book during family devotionals and both of my children enjoyed it. At the time, my daughter was nine and my son was six, some things were above my sons head. However, the book is recommended for ages 9-12. I would venture to say the age should be opened up from 7 - 12.As far as the physical book, it is hardback, fully colored, contains pictures of children on every page and is printed on semi gloss paper. From start to finish, this book is great for family devotionals with bite size biblical truths for children.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how far is too far where to draw the line on premarital sex physical intimacy",
        "description": "First, what this book ISN'T. This book is NOT designed to condemn you for your past mistakes or to create some kind of guilt trip. Nor is this book intended to glorify sin or encourage anyone to \"sin all the more so that grace may abound.? But as you read through this book, please keep in mind that all mistakes, bad choices, or just plain thoughtless decisions you may have made in the past or are currently struggling with, can be overcome by the never-ending mercy and grace of Jesus Christ. Also, keep in mind that if you totally trust in Christ, His cleansing, forgiveness, and a fresh start are yours for the asking! What this book IS: A way for you to develop a deeper and more meaningful relationship with Jesus Christ. You will experience a paradigm shift change from one way of thinking to another question that every student, young adult, and single person has asked on a very personal level: \"How Far Is Too Far?\"",
        "authors": "['Todd Lochner', 'Doug Haley', 'Chris Piper']",
        "infoLink": "http://books.google.com/books?id=U7YMAAAACAAJ&dq=How+Far+Is+Too+Far%3F:+Where+to+Draw+the+Line+on+Premarital+Sex&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've been going to church for years and this is the first book I have read concerning pre-marital intimacy that I felt the author had the right to give me advice. He really put his heart on the line and shared a part of his life before he began to teach what God had revealed to him. As a high school varsity cheerleader there is constant peer-pressure to succumb to the temptations of pre-marital relations. Trust me when I say, 'I wish I had read this book earlier.' I have had countless discussions with my pastor and youth minister about overcoming sexual temptations and no one has ever provided answers as clear as the author did in this book. The author's personal story gave me a new outlook on life and myself. I now know that I am worthy of what God has in store for my life and that I will NOT settle for anything less. I hope that my review will cause one extra person to read this book - It will change your life... It did mine!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As a parent and Sunday school teacher, I am constantly on the lookout for new material to help students. When I discovered this book, the title drew me in immediately; but the content was incredible. Once I started reading I couldn't put it down. When I finished it, I ordered enough for my entire Sunday school class. So far, every student that has finished the book has given the most incredible feedback I have heard from any book over the past few years. I highly recommend this book!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book makes the weakest possible arguments about sexual morality, and would do more to weaken the faith of those who need a book like this than to actually help them make informed decisions.The first half of the book may be reduced to the personal history of the writer, with vomit-inducing one-liners interspersed. Maybe its my hatred of his writing style that soured me on the entire book...because I was ready to throw it into a corner after a few chapters of LEARNING NOTHING and letting him ramble about himself...but I decided, to spite the author's ego, to finish the book.Here's what you learn in the first half of the book:He was a big, buff dude in high school, and hung out with some attractive girls (ie: cheerleaders) during his high school and college years. He made some mistakes.Well, that sets you up for the great revelation. But not from the author. From his friend. The author tells you all about himself and his past and his mistakes (which, honestly, sounds more like he is trying to politely brag about his conquests...not help out struggling Christian teens), then HANDS IT OFF TO SOMEONE ELSE TO MAKE THE POINTS ON ETHICS. Whoever is going to make the moral arguments ought to be the one whose name is on the cover.I won't spoil the answer of \"how far is too far,\" but I want to add that I disagree with the conclusions of this book (and I am a Christian man). However, that's not why I give it only 1 star. It is poorly written and poorly argued.I recommend, instead, anything pertaining to JPII's Theology of the Body...not just for Catholics, but all Christians. It is not necessary to follow specifics of the Catholic faith to appreciate the depth of insight in those writings...and they'll do a lot more good than these other silly books.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "How Far Is Too Far? Is a powerful and direct approach to the issue concerning sexual purity. It will challenge you to look at this age-old question in a fresh and creative way. The end result is a new theology of sexuality and how God sees His children in that light. How Far Is Too Far? is a must read for every family with young adults, students, and teenagers!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "joni",
        "description": "One of the most beloved Christian autobiographies of modern times, Joni highlights the unforgettable story of a young woman's courageous struggle to find hope after a broken neck left her completely paralyzed. On a hot July afternoon, Joni Eareckson Tada's life was dramatically altered in a split second. A reckless dive into shallow water took an athletic young woman from health and success to life as a quadriplegic in a wheelchair. In the forty-five years since the release of this book--which has more than five million copies in print in over forty languages--Joni's earnest struggle to find hope has resonated with millions of readers around the world. The hard-earned truths she shares in this special edition reveal the power of God's love to transform, as well as the triumph of faith over pain and suffering. Joni's message has inspired people facing all types of challenges, helping them overcome their own limitations with a determined smile. In this updated edition, you will discover how to stay satisfied in God through disappointment and affliction. Filled with practical insights, Joni will help you find hope in every hardship. This commemorative 45th anniversary edition features updated photos, as well as an all-new afterword in which Joni describes her current battle against two different cancers, her daily struggle with chronic pain, and the joys of leading a global outreach to people living with disability.",
        "authors": "['Joni Eareckson Tada']",
        "infoLink": "https://play.google.com/store/books/details?id=8QIlEAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This is one of those few stories that never leave you. Even after you have read the book, closed it and put it on the shelf, the story remains and you can't get it out of your head. A bright, energetic, full-of-life girl goes diving into the shallow water - an act that will forever change her life and ultimately change the lives of millions of others.Suddenly, this athletic, independent young girl is trapped in a body that will not move. Paralyzed from the shoulders down, she finds herself no longer independent, but fully dependent on the care of others for the simplest of tasks. Things we take for granted like wiping away tears, blowing your own nose or brushing your hair - now on someone else's time table, not your own.Understandably, this turn of events shakes her faith as she shakes her mental fists at God for dashing all her hopes and dreams for the future. Failed romances, rocky friendships, family heartaches - Joni holds nothing back in this insightful view into her world.Through her emotional and spiritual failings, the author shares her growth and understanding of God's plan for her life and the lives of others. Using her mouth to draw and paint, the author became an established artist long before people realized that the artist whose work they were admiring was completely paralyzed and unable to use her hands. This revelation thrust her into celebrity where she has been able to make more of an impact on the lives of others than she would have ever been able to have accomplished prior to her injury.Through her charity, Joni & Friends, the author has provided for wheelchairs for the disabled around the world and opened the doors of opportunity to wheelchair bound people everywhere.I've seen the author on Larry King a few times and always wondered, \"how does that woman keep smiling and keep such an upbeat attitude?\" It is hard to imagine a worse fate than what she has endured since her accident, yet after reading her personal account of her life since that fateful summer in 1967, the reader understands exactly why she smiles and truly has joy in her life. I picked up this book thinking it would be 'interesting' and nothing more - I was delightfully surprised to find this to be a page-turner I could not put down. Even though I've finished reading this autobiography, I doubt I will ever truly put this book down. This is a story that sticks with you long after you've closed the back cover.",
                "review/helpfulness": "44/44",
                "num_reviews": 44
            },
            {
                "review/text": "This is one of those few stories that never leave you. Even after you have read the book, closed it and put it on the shelf, the story remains and you can't get it out of your head. A bright, energetic, full-of-life girl goes diving into the shallow water - an act that will forever change her life and ultimately change the lives of millions of others.Suddenly, this athletic, independent young girl is trapped in a body that will not move. Paralyzed from the shoulders down, she finds herself no longer independent, but fully dependent on the care of others for the simplest of tasks. Things we take for granted like wiping away tears, blowing your own nose or brushing your hair - now on someone else's time table, not your own.Understandably, this turn of events shakes her faith as she shakes her mental fists at God for dashing all her hopes and dreams for the future. Failed romances, rocky friendships, family heartaches - Joni holds nothing back in this insightful view into her world.Through her emotional and spiritual failings, the author shares her growth and understanding of God's plan for her life and the lives of others. Using her mouth to draw and paint, the author became an established artist long before people realized that the artist whose work they were admiring was completely paralyzed and unable to use her hands. This revelation thrust her into celebrity where she has been able to make more of an impact on the lives of others than she would have ever been able to have accomplished prior to her injury.Through her charity, Joni & Friends, the author has provided for wheelchairs for the disabled around the world and opened the doors of opportunity to wheelchair bound people everywhere.I've seen the author on Larry King a few times and always wondered, \"how does that woman keep smiling and keep such an upbeat attitude?\" It is hard to imagine a worse fate than what she has endured since her accident, yet after reading her personal account of her life since that fateful summer in 1967, the reader understands exactly why she smiles and truly has joy in her life. I picked up this book thinking it would be 'interesting' and nothing more - I was delightfully surprised to find this to be a page-turner I could not put down. Even though I've finished reading this autobiography, I doubt I will ever truly put this book down. This is a story that sticks with you long after you've closed the back cover.",
                "review/helpfulness": "43/43",
                "num_reviews": 43
            },
            {
                "review/text": "I WAS FIRST INTRODUCED TO THIS BOOK AS A YOUNG CHILD. JONI HAS TRULY BEEN AN INSPIRATION TO ME. I AM NOW A 22 YEAR OLD WOMAN WHO HAS LIVED WITH CEREBRAL PALSY SINCE BIRTH. LIKE JONI, I TOO AM A BORN AGAIN CHRISTIAN AND I TRULY CANNOT IMAGINE (MY) LIFE WITHOUT THE LORD JESUS CHRIST IN IT. IN THIS MEMOIR, ONE TRULY SEES THE STRUGGLES, THE HEARTBREAKS, AND THE JOYS AND TRIUMPHS THAT THE LORD BRINGS THIS YOUNG LADY THROUGH. THIS IS A MUST READ FOR ANYONE-IN A CHAIR OR NOT, AND I TOO CAN SAY THAT I WOULD MUCH RATHER BE IN A CHAIR WITH THE LORD, THAN ON MY FEET WITHOUT HIM.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "I read this book a few months a go. I haven't read many of christian writer's story about their lives, but some that i have read never really touched me the way Joni did. I was impressed and blessed from her honesty in pouring out her thoughts and feelings, even the bad ones. It did not discourage me, but instead it made me realise that we need to deal with ourselves to be able to see the real us and to be able to see what God wants to do in our lives.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "If I could I would give this book the highest rank of rating out of any book that I have read. I believe that this book is emtionally and sipirtually lifting. I loved this book and I reccomened this book to any persono that is goin through alot in their lives.Thank You",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I first read this book when I was 11 years old. Joni's story evokes deep feelings of despair, sorrow, anger, frustration, hope, inspiration and love. At 11 years old, this book provided a much-needed introduction to the hardships of life. I believe reading this book at such a young age prepared me for life and ministry.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I first learned about Joni and her life through my nurse. I watched her movie and since then, I have deeply admired her in more ways than one, especially for her strenght and insiring attitude.I read the book \"Joni\" and I think it's much better than the movie because it explains in much more details everything that she went through. Joni is a great writer and reading her books is a very pleasant experience!!!I am also a quadriplegic, and Joni has brought me closer to God by her movie, books, radio programs, website, etc ... I can relate to her when it comes to how it is to live with a disability, so what she says and writes does reach me!!!I do recommend the book \"Joni\" to everyone, disabled or not!! It tells the story of a young woman who did overcome a personal tragedy, found a way to keep living and now she is a happy person who helps so many people!!As she said somewhere ..... \" There are many things which are more important than walking\"Carolina (Lola)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book is beautiful,it shows with gods love and help you can overcome anything, her pictures that she draws with her mouth, are just beautiful. This story of her life, should encourage everyone to go on no matter what the cost. JESUS LOVES YOU !!!!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Joni is an amazing woman. Her story touched me, and brought a deeper understanding of disablities, and the importance of faith. A good book to pass along to friends. Everyone will get something from it.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Joni's Story is an very inspiring book because she creates a good athmosphere by using a wide variety of words. She explained her feelings well and you get a picture in your mind of all the things she was going through after the acident. I liked the book so much I ended up reading it twice. The first time I read this book was when I was 8 but when I read it again I was 10 and that shows this book is not aimed at any specific age group.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "providence",
        "description": "\"Part love story, part supernatural thriller and completely engrossing\" (People)-from the acclaimed author of You, now a hit Netflix series IN DEVELOPMENT AS A PEACOCK ORIGINAL SERIES FROM THE EXECUTIVE PRODUCERS OF YOU \"A dark beauty of a book, Providence kept me up at night with characters that made my heart a little bigger.\"-Jessica Knoll, New York Times bestselling author of Luckiest Girl Alive Best friends in small-town New Hampshire, Jon and Chloe share an intense, near-mystical bond. But before Jon can declare his love for his soul mate, he is kidnapped, and his plans for a normal life are permanently dashed. Four years later, Jon reappears. He is different now: bigger, stronger, and with no memory of the time he was gone. Jon wants to pick up where he and Chloe left off-until the horrifying instant he realizes he possesses strange powers that pose a grave threat to everyone he cares for. Afraid of hurting Chloe, Jon runs away, embarking on a journey for answers. Meanwhile, in Providence, Rhode Island, healthy college students and townies with no connection to one another are inexplicably dropping dead. A troubled detective prone to unexplainable hunches, Charles \"Eggs\" DeBenedictus suspects there's a serial killer at work. But when he starts asking questions, Eggs is plunged into a shocking whodunit he never could have predicted. With an intense, mesmerizing voice, Caroline Kepnes makes keen and powerful observations about human connection and how love and identity can dangerously blur together. NAMED ONE OF THE BEST BOOKS OF THE YEAR BY REAL SIMPLE \"Providence is a novel that doesn't fit into one box-it's tender and dark, eerie and cool, heartbreaking but also an affirmation of the power of love. Kepnes perfectly captures each character's struggle and pain in such a unique, unconventional way that every page-every sentence-is a delightful surprise.\"-Sara Shepard, #1 New York Times bestselling author of Pretty Little Liars \"Caroline Kepnes is cool right this minute. . . . [Providence is] terrifically conceived and executed. . . . Kepnes has an exhilarating, poppy, unexpected voice.\"-The New York Times Book Review \"An addictive horror-tinged romance that'll keep you guessing.\"-Entertainment Weekly",
        "authors": "['Caroline Kepnes']",
        "infoLink": "https://play.google.com/store/books/details?id=iYckDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Arguably the best treatment of the Catholic doctrine of Providence: how God governs the world, to what purpose, and how we should respond. Rooted in Scripture and the teaching of St. Thomas Aquinas, this book offers solid doctrine, clearly expressed, to anyone seeking to discern and follow God's will. I try to read the fourth chapter every couple of years, where Garrigou-Lagrange explains when we should accept our circumstances, as coming from God, and when we should seek to change them. I recommend this book to all those who tend to worry too often and too much.As a point of interest, Fr. Garrigou-Lagrange taught at the Angelicum in Rome from 1909 until 1960, and the future Pope John-Paul II was one of his students.",
                "review/helpfulness": "39/41",
                "num_reviews": 41
            },
            {
                "review/text": "This is one of those rare books that is just almost impossible to start and not finish in one reading. I promised to read this book at the behest of a friend and, quite frankly, was a little hesitant because I did not know the author and usually do not read so-called inspirational romances. How surprised I was to get hooked on not only the story but the wonderful writing style of the author. To be sure it has romance and inspiration throughout but is done in such a subtle, unobtrusive manner that the reader feels it not only belongs in the story but is absolutely necessary. The story is one of the trials and tribulations of a woman trying to keep her family and ranch together after her husband's untimely death in the Oklahoma Territory. There are villians and drifting ranch hands and some indians thrown in for good measure. The characters are believable, the writing is professional grade, and the message is one of caring, sharing, and the importance of family and home. This is not your typical touchy-feely type of book. It is truly worth the readers time.",
                "review/helpfulness": "29/30",
                "num_reviews": 30
            },
            {
                "review/text": "The author's wisdom, common sense and attention to detail shines through in this book. I learned many things about life on a ranch in this creative and very believable story. Though there is light romance, the emphasis is on inspiration through life's trials. It is a good 'clean' read with an interesting plot as its foundation with twists and turns. Not that you're left hanging, I hope the story doesn't end here.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This work by Fr. Garrigou-Lagrange is more accessible than his work on Predestination. The two themes are somewhat related, but providence examines the meaning of God's sovereignty over all creation and history for us His creatures. The first two sections of the book are an examination of God's nature and perfections and how this necessitates His absolute control of all events, even the slightest or least significant. Because God is supremely good we can therefore have confidence in His providence and good will toward us. He quotes Bossuet who said we are much better off trusting our eternal salvation to God than trying to insure it ourselves. This should give the Christian much confidence and courage in the daily trials of life, knowing that all things work together for the good of those who love God.The third, fourth, and fifth sections of the book deal specifically with providenceand its bearing on the spiritual life. Great emphasis is placed upon how God's justice and mercy are manifested through His providence and how both of these aspects of His nature join in bringing about our conversion and growth in grace. A trusting abandonment to God's providence is the key to our relationship with God as our loving Father.While I enjoyed this work by Fr. Garrigou-Lagrange, it did not impress me as much as his work on Predestination. Much of what was said was covered already in that earlier work, but for those who would like something with less theological terminology, Providence is more reader friendly.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book has it all!!!! It is wonderfully written and as said in a previous review, once you start it you don't want to put it down. I love historical inspirational books and this is easily one of my favorites. I can not wait for the next one.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This new author's style of writing captures the mind's eye. It is very easy to invision each character, and Ms. Noland's attention to detail is unsurpassed. This author knows her subject, and her passion shows through. Would love to see a prequel or sequel to this book!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I truly enjoyed this read, mostly. I was disappointed with the evil rancher and his sadistic sidekick. That part never really went anywhere and seems almost innocuous. Then at the end, what happened to them? Were they hunted down and strung up? There is no mention after the shooting of anything happening with them? Did they just get away with it? I was so disconcerted when I finished this story, to have such an unfinished ending.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Very good theological work on the subject. It's also a good spiritual read. This book is a must for those who do not understand things related to God's plan (providence) like evil in the world or prayer. God is not a genie in a bottle. I'm excited to read more of Fr Garrigou-Lagrange's works.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Kate Shaughnessey Is a mighty warrior of courage and strength in this christian fiction . She has a faith, forgiveness, and love , but not to the point she doesn't seem real. I loved her little girl. I could just see her, the author made her come to life for me. It was well written .",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I read this book when I was extremely stressed out about a number of things. I woke up in the middle of the night, unable to sleep, feeling as if I was being drawn back downstairs. I finished the book that night, and was truly blessed by Ms. Noland's use of scripture -- scripture that spoke directly to me at that point in my life. The story was such a solid one, I've pinned it on Pinterest, I've written the author and I've recommended it by word of mouth to all my friends! And just because I mention Ms. Noland's use of scripture, don't think that means she can't write a really good romance! :-)",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "gods and kings chronicles of the kings 1",
        "description": "Gods and Kings is the story of King Hezekiah, heir to the throne of King David. When his evil father plots to sacrifice him, Hezekiah's mother, Abijah, searches frantically for a way to save him. But only two men can help her, and neither of them seems trustworthy. In a time and place engulfed by violence, treachery, and infidelity to Yahweh, Abijah and her son must discover the one true Source of strength if they are to save themselves and their country. Book 1 of Chronicles of the Kings.",
        "authors": "['Lynn Austin']",
        "infoLink": "http://books.google.nl/books?id=KIBjvgAACAAJ&dq=Gods+and+Kings+(Chronicles+of+the+Kings&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In my opinion, most religious fiction is not very good as everyone is just too nice or the scenes just aren't realistic as it's not \"Christian\" to write about how people really are. Lynn Austin, on the other hand, does a really nice job of fictionalizing a brief passage of the Bible into a full-length novel, and gets you into the heads of the characters. The imagery and scenery are very realistic and, for example, I could imagine me walking the dusty streets of the Middle Ages. The thing that struck me the most was this book really got me thinking and getting more out of the story than a random section of the 28th chapter of the book of Second Chronicles and makes me want to read the next one in the series: with the volume of books I read on a monthly basis, having one stick with me and recalling various sections of the book long after I read it (about a month ago) is, to me, impressive and tells me this was really a good book.I initially got this book during a Kindle free promotion and, as I write this review, the price is now $5.38 in the Amazon Kindle store - you will certainly get a lot more than $5.38 in entertainment value if you get this one!",
                "review/helpfulness": "199/206",
                "num_reviews": 206
            },
            {
                "review/text": "Hezekiah, prince of Judah, lives in a kingdom under siege from hostile forces within and without. His father, King Ahaz, has abandoned the worship of Yahweh and led his nation into idolatry. Gods & Kings chronicles Hezekiah's coming of age, detailing his turbulent childhood when he saw his father sacrifice his older brother Eliab to the pagan god Molech. Overwhelmed by fear, Hezekiah first encounters the life-changing touch of God through the love and teaching of his grandfather, Zechariah, a Levitical priest. These seeds of faith are all that Hezekiah has to guide him in a kingdom threatened by invasion and corrupted by idolatry. But surrounded by threats to his very existance, can he hope to survive and be given the chance to change the future of his country?This is one of the best biblical fiction series out there, easily on par with Angela Hunt's Legacies of the Ancient River series. I don't feel that Austin's writing is as strong or her characters quite as well-developed as is evident in her later books (such as the Christy award-winning novels Candle in the Darkness and Fire By Night), but that's a very minor issue. Austin does an excellent job bringing the world of ancient Judah to life in all of its color, pageantry, danger, and intrigue. She breathes fresh life into the character of Hezekiah, creating a flesh-and-blood man whose struggles and weaknesses make his triumphs as one of Judah's greatest kings all the more inspiring. And the book lives up to perhaps the best measure of whether or not biblical fiction succeeds or fails - it inspires study of the actual biblical text.When reading this book (incidentally this was my second time), I was struck by how timely the story felt. Hezekiah was one small drop in an overwhelming sea of danger and false gods, but God used his life to literally change the course of an entire nation and people. So read, study, and be inspired as Austin helps to bring to life the truth of 2 Chronicles 7:14 -- \"if my people, who are called by my name, will humble themselves and pray and seek my face and turn from their wicked ways, then will I hear from heaven and will forgive their sin and will heal their land.\"",
                "review/helpfulness": "123/125",
                "num_reviews": 125
            },
            {
                "review/text": "Every now and then, I enjoy \"escaping reality\" by reading a good Scriptural (and historical) based novel. I purchased the first book, \"Gods and Kings\" at a discount store, not even knowing that it was part of a series, and could not wait until I found it's sequels! I have read all 5 of the \"Chronicles of the Kings\" series and I hope that Lynn Austin writes more sequels to this particular series.I did get a bit confused at Amazon's website while looking for the rest of this series, so I am going to list them here in order for the convenience of future buyers:book 1 \"Gods And Kings\"book 2 \"Songs Of Redemption\"book 3 \"The Strength Of His Hand\"book 4 \"Faith Of My Fathers\"book 5 \"Among The Gods\"Another author whose sequel I am eagerly awaiting is Ellen Gunderson Traylor's \"Jerusalem The City Of God - Part Two\", also set in Old Testament times. These types of books really \"take you back in time\" to the way that things really were.",
                "review/helpfulness": "104/107",
                "num_reviews": 107
            },
            {
                "review/text": "Ms. Austin is a skilled and polished writer with a well-developed knack for grabbing a reader in the first two pages and pulling them in by presenting a dire situation for characters we have only just met, yet somehow, we already care about. In this case, the book opens with gentle children being threatened by a band of tough soldiers who storm into their bedrooms and take them captive.The horrible plans for those children quickly become apparent - they are to be burned alive as an offering to a pagan god. And the author does not flinch from the brutality, or let her readers look away. She dutifully has the young boys tossed into the brass maw of a bestial idol, where they scream horribly as they are engulfed by flames.If this sounds like raw, edgy, cutting edge fiction, well, maybe it is, but this is Christian literature. I almost never read this genre because I am not a Christian, but I am willing to read anything with an open mind as long as a compelling story is being told. And this book delivers that - for the most part.For me, again, not a Christian, I found many of the scenes rather preachy and repetitive of the basic Christian themes that the \"True God\" is one of \"endless love and compassion\" and that those who turn away from Him to worship false gods will face calamity in their lives, and so on. I'm not saying there is anything wrong with this - it's what Christian readers enjoy reading and what they want to read. They enjoy reading a compelling story, while also having their belief system reinforced for themselves. I'm all for it! Go for it!However, as an objective reviewer, I have to make other readers aware of what they are getting when they purchase this book. Yes, it's a historical novel, a take on the ancient Kings of Judah in and around the years 700 B.C. to 800 B.C. - but one needs to know that this is historical FICTION, but more accurately, fiction as seen through the lens of and colored by a modern day, mainstream Christian belief system.So if you are a believing, practicing Christian, this might be a 5-star read. For the rest of us, well, I'll give it 3 stars.",
                "review/helpfulness": "26/35",
                "num_reviews": 35
            },
            {
                "review/text": "I loved this book (series) because not only was it a very interesting read, but more importantly because it gave me such a good insight into life during the Old Testament. The stories of Kings Ahaz, Hezekiah, and Manassah have never been so real to me as when I read that book. I will never again read the Biblical accounts the same way!",
                "review/helpfulness": "30/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book is really interesting and well written but there are so many typos. Some are just missing punctuation that are easy to over look but there are also words missing in some paragraphs that are really frustrating and confusing. It really disrupts the flow of the book. I'd love to read the rest of the series but I hesitate to pay money for such poor quality. I'm glad this one was free. I reported the errors so hopefully they will look into it because this is a really good book.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "Like so many other people who have read Lynn Austin's Gods and Kings, I appreciated her fine writing skills and excellent story telling ability. However, her editors must have struggled with the manuscript translation to ebook style. There were so many lines that did not separate into paragraphs, punctuation problems, words not separated or separated words when not needed, and words run together, that at times it was difficult to read. I can't believe that Bethany House would release a script with this many errors in it. An author of this caliber deserves a better production than this gobblygook.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "Ms. Austin has taken the reader on a journey back into time weaving truth with fiction in such a way that she has managed to pen a read that is not only descriptive but good as well.This is the story of Hezekiah who will eventually assume the role of king as a descendent of King David. This story opens with Hezekiah as a young boy and we grow with him as he faces many challenges to both his life, and his faith. His father is King Ahaz, and he has plotted to sacrifice Hezekiah in order to gain the favor of the gods, and win the war that has currently decimated his army and killed his own brother. Hezekiah's mother Abijah will do all that she can to spare her last son from his father's evil machinations. She has only two men that she can rely on, but can she trust them to save her beloved son?Hezekiah is destined for great things and manages to survive his childhood but he is now a man and the dangers to him have not dissipated. He is now King, and his mother and his wife, two women that love Hezekiah, must now stand back, and wait to see if his faith is strong enough to help him survive the treachery and violence that surrounds him. Will he be strong enough to stand by his beliefs and save his country?This was a very moving read as well as being very descriptive. Fans of Christian novels will find no fault with this vivid story and characters. Ms. Austin has managed to bring the Old Testament to life in a way that is not only entertaining, but educational as well.Official Reviewer for www.romancedesigns.com",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "The Chronicles of the Kings series are THE BEST Biblical novels I have ever read. Lynn Austin's writing is so captivating, you won't be able to put the book down! While reading this series, I actually had to make myself not even touch the book before I went to work - because several times I did just that, lost all track of time and wound up arriving late to work!I thoroughly enjoyed this book and highly recommend it. It really fleshes out certain Biblical characters and events, enabling you to really feel involved with the Biblical accounts. They become more than just words on a page in a history book - they become living, breathing people that really walked this earth. I was pleased that the author stayed very true to the Bible. I have read novels in this genre before that took great liberties with the facts as presented in the Bible. I did not feel that this was one of those. In fact, the author uses direct quotes from the Bible at all times when the prophets delivered their prophecies! At the front of the book, the author lists the scriptures used to write the story and encourages you to study it more deeply.This is a well-written, page-turning, true-to-the-Word book that will keep you reading for hours and deepen your appreciation for God's love and grace. I cannot recommend this book highly enough.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I couldn't put this book down. Went out a few days later to purchase the next one. I am now on Book 5. My husband is now reading them. He loves them too. I hope the series continues. The story that I have heard before in the Old Testament comes to life. The characters are wonderful. Start reading you will not be dissappointed.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "the one year bible for children tyndale kids",
        "description": "This new devotion in The One Year line combines beautiful full-color illustrations with skilled writing for children and families. One or two days a week the book of Psalms is studied with a reading and question. A discussion section helps kids recall factual information, learn how the lesson applies to their lives, and learn how it relates to today.",
        "authors": "['Gilbert Beers']",
        "infoLink": "http://books.google.com/books?id=ckuZEEI-OjQC&dq=The+One+Year+Bible+for+Children+(Tyndale+Kids)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I thought this one year Bible would be an uncontested winner. I was disappointed in two ways. First, I found the writing to be very dry. It did not pull me in, instead it made me want to close the book.Secondly, as I skimmed the book, I settled on the January 4 entry. This is the story where Cain kills Abel. The author says the following about Cain's unaccepted sacrifice:\"Perhaps Cain did not love and obey God the way he should have.\"This jumped out at me. All my young life I wondered why didn't God accept Cain's sacrifice. It really bothered me, it didn't seem fair!!! I tried to find an answer to my question. My searching brought me to a better understanding of who God really is.If we really read that passage in the Bible, we see that Cain TALKED with God like we talk to a friend (God to Cain, \"Why are you angry, why is your face downcast?\"). He didn't fall on his face before Him like the Patriarchs. It leads one to understand that this was not something unusual. It was not uncommon for God to speak with Cain & Abel.God gave them specific instructions about sacrifice, this is how they even knew to offer a sacrifice. Abel knew exactly what to do (fat from the \"firstling\" lamb). God spoke to Cain with the understanding that Cain knew what was right (\"If you do right, will you not be accepted?\"). God had told both Cain and Abel exactly what He wanted. He didn't need to tell Cain the requirements at that moment or reiterate. Cain knew.It wasn't \"perhaps\" about Cain's attitude. It was about his disobedience. He did not follow God's instructions. \"But if you do not what is right, sin is crouching at your door. It desires to have you but you must master it.\"All these verses I found in Genesis 4:1-7. This is an exciting story with the answers to my question contained therein. So it really disturbed me that the author creates the question and his own answer for the child. He should have avoided the editorializing and pointed the child back to the source.This made me wonder where else the author would infuse questions and answers that don't necessarily lead the child back to the Bible but to the musings of men.Note: I really loved the illustrations and especially the questions that the author poses at the end of each chapter. But not enough to keep this item.",
                "review/helpfulness": "35/39",
                "num_reviews": 39
            },
            {
                "review/text": "This is an excellently written, faithful translation of the Bible that is broken down into 365 readings that are at just the right level for my five year old. I searched long and hard for a way to build Bible reading into our daily routine, and I have found many children's Bibles too watered down to get the point of the story across to my five year old. This one is at the perfect level, but I also think that there is enough in each story that we will be using it for another 4-5 years. My son begs me to read it to him every night before bed.The questions and lesson at the end of each reading help to get my son involved in the reading for the day. My son is regularly complimented by his pre-school and Sunday school teachers on his Bible knowledge and this Bible is why.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "I got this for my son who is in third grade. He took it with him everywhere we went. He read it in the car, when we were having to wait somewhere, to his grandmother's house, and to bed. He read it in just a few weeks. It was a real hit and he was able accurately tell us about the stories after he read them.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "We are a homeschooling family and were looking for a way to incorporate bible study into our already full schedule. The One Year Bible for Children is perfect. I have my son read the passage and then I re-read it to him to help him comprehend more. We have had some great discussions based on the prompts at the end of each passage. Taking one lesson a day seems to be managable and very enjoyable to both of us.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I'm sorry, I couldn't help myself; we're only on March 25, and already I have to review this book. It was just impossible to wait until we'd finished out the entire yearJ.Being a christian is hard even before you even consider God's command that we must also raise our children in the ways of the Lord and teach them the scriptures. It would be easy to just put that job off on the Sunday school teachers (and much of the time, that's exactly what I did), but is that really *their* job? Traditionally, my family not only went to church on Sundays but also Wednesday nights and we read from the bible, although not every night. That was how I grew up learning about the bible, but I confess, it seemed like a dry and dull way. My grandmother also had a set of vinyl records with bible stories and picture books to accompany them (I don't remember the titles) -- now that was more interesting, and stuck with me more as I grew and remembered the beautiful illustrations. So now as a parent, that seems more intuitively the ideal way to bring the bible alive for my own boys.The One Year Bible for Children is nicely geared toward children of about elementary school age as a daily \"devotional\" style read-aloud. It begins on January 1 with the Genesis creation story and follows approximately along the time line through the Old and New Testaments until the end of the year. Flipping through, I would say that about half of the daily selections have illustrations -- but they're truly top quality illustrations, nothing cartoon-y or \"babyish\" about them (please excuse me, those are pet peeves of mine..I believe children's books should be every bit as well-illustrated and lovely as anything an adult would read that has illustrations). The text is a simplified version of the more familiar bible stories, which seem to be selected for being interesting and action-oriented from a kids point of view, and they are told in a language that paraphrases to a child's level of understanding, but never patronizes them. Each \"day\" ranges in length from one quarter page to a full page of text. At the bottom of each selection, there are questions that parents can use to help the children recall details of the story and encourage them to analyze and apply the morals and principles to their own lives. My 6- and 10-year-olds never stall or complain when \"story time\" comes every night.To give you a taste of this book: As of this day in March 25 the book has progressed to Joshua 1-2, \"Spies Visit Jericho\", with a small box illustration in the bottom corner page. Tomorrow's has \"Crossing the Jordan River\" with a two-page spread and a colorful, panoramic picture taking up the entire bottom half. An excerpt reads: \"Joshua gave orders, too. \"Each of you must make yourself clean on the outside to show that your heart is pure and clean on the inside,\" he said. \"Tomorrow you will see a miracle\". The next morning Joshua gave orders to the priests. \"Take the Ark and lead us across the river\", he said. So the procession started.\" Skipping ahead to the New Testament, September 2nd, Jesus Stops a Storm, the entire two page spread is the picture of the disciples and Jesus in the boat with the text printed over it: \"Jesus spoke to the wind and the waves. \"Be quiet!\" he said. The wind and waves died down quickly. Suddenly everything was calm and still. \"Why were you so afraid?\" he asked the disciples. \"Don't you believe in me?\"Fabulous!Yes of course attending Sunday school and memorizing verses is indispensable in our children's education. Why not also make it seem real and alive to them? I will be giving this book to many other children as birthday and Christmas gifts -- what a great way for them to see bible history!Andrea, aka Merribelle",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the heart of wisdom teaching approach bible based homeschooling",
        "description": "Details the Bible-based homeschool teaching approach for parents, and discusses Christian education, learning styles, unit studies, bible study, and more.",
        "authors": "['Robin Sampson']",
        "infoLink": "http://books.google.com/books?id=Z1hXJbEUIiMC&dq=The+Heart+of+Wisdom+Teaching+Approach:+Bible+Based+Homeschooling&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I downloaded this ebook over the holidays and am in the process of implementing Robin's ideas. The review is lengthy, but I feel it is such a foundational and worthwhile book. The book is divided into five sections, so I'll explain my take on each section.The first section details their departure from public school and the different roads they traveled in homeschooling. Based on her success and failures she describes what led to the Heart of Wisdom teaching approach. One big issue for moms that she addresses is fear. Many wonder are they doing enough? Teaching the right thing? Are their children where they need to be? She does a wonderful job throughout the book of taking us to Scripture to find the answer. (Like Philippians 4:6-7 here.) \"God knows what your children will face in the future, and He will give you what you need to educate them in the way they need to be educated.\" These were powerful words that forced me to realize that I need to abide in God's word so that he can guide me and I can guide my children. In this, you will find peace not fear. My job is to run the race and keep my eyes on Jesus! (Hebrews 12:1-2)In Section Two she guides you in researching the biblical methods of education. You will also learn about the history of our modern and traditional forms of education. She ends with an appeal to return to a biblical Hebraic model. This section was an eye-opener for me. I learned the Bible's definition of true education and true wisdom. This section is a must for Christians. I now feel totally comfortable that education in my home doesn't look like education at the public school down the street.A description of the different methods used in her approach is outlined in Section Three. First is always the Bible, then you will recognize a little Charlotte Mason, unit study, delight-directed, and classical methods. However, you will always see the Bible first and most importantly interwoven into everything. She also discusses different learning styles and how to teach to them all using four steps. Doing something with what is learned is one of the four steps. This step usually involves some form of writing. A step that I struggle with, a struggle that's not uncommon for most homeschool moms.The fourth section gives you the how-to with instructions on just how to work out her plan. She tells you how to go about setting up your unit studies based on a four year study of history. I love how she splits your teaching day into two main areas: God's Word and God's World. She spends most of the morning on God's Word, reading the Bible and using Bible study tools. The afternoon is spent studying God's World using unit studies and living books. God's World studies include science, HIStory, and the arts all filtered through God's Word. She incorporates writing and language skills in everything they do. You will also find more information about making notebooks and timelines in this section. And probably the most important chapter in this section is \"Scheduling by Faith.\" We are all given 24 hours each day, how does God want you to spend yours? This is another chapter that I will need to reread over and over...any time that I'm feeling defeated in my homeschooling journey.Section three and four have a lot of information. I have read and reread, just trying to soak it all in. I was a product of the public schools and was never taught like this. It is a big paradigm shift for many of us and it will take time to make a complete change. But I believe she does a great job explaining her research and reasoning and then the methods and the how of fleshing out this approach.And finally, in Section Five, she lists the resources that you can use to teach your children using the Heart of Wisdom Teaching Approach. Hundreds of books and resources are listed by her four-year plan for ages K to 12. In addition to this chapter she lists resources for deeper study at the end of almost all of her 24 chapters. The resource lists alone make the book worth the cost.I will recommend this book to every parent that I can...hence the reason I'm posting it here on my blog! I am even considering buying another copy so that I'll have one to lend out! I do think this book will give you a fresh vision for what God has called us to do. I have always liked the book \"Educating the Wholehearted Child,\" by Sally Clarkson. I felt like it gave me a vision but left me hanging in exactly how to do it. Robin has said many of the things Sally Clarkson has said in her book, but she explains better how to implement it in my home. I can't decide to try her book on Wisdom or her unit study on Adam to the Messiah next, knowing me I'll get them both!",
                "review/helpfulness": "56/56",
                "num_reviews": 56
            },
            {
                "review/text": "Let me first say that I absolutely agree with the other reviews in regards to the premise of this book. The premise is that we are to teach our children the Word of God in everything we do. I wholeheartedly agree and for that, I give Mrs. Sampson five stars on that! The other reviews do a fine job explaining that part of the book, so I don't feel the need to elaborate.However, where I disagree with Mrs. Sampson, is that she clearly considers her brothers and sisters in Christ who adhere to the Covenant Theology doctrine, as heretical, and I dare to say she blames them for the atrocity committed by Hitler and his soldiers in the holocaust.I am slow to consider someone heretical, unless I have a firm grounding in scripture to do so. She fails to do such, but gives her opinion on the matter, which is hardly an explanation as to why she would make such an extreme claim. Without quoting her book, you are welcome to go to her blog and find her same opinion written there on this matter. Type in, \"Replacement theology\", and you will find what is found in this book. You can decide from there if you agree or disagree with her stand.Replacement theology is what it is commonly known among those who disagree with the belief, but the proper term is Covenant Theology. The reason for this distinction is clear; a misunderstanding of what Covenant Theology is. Those against CT call it Replacement Theology, because they wrongly understand what CT is, accusing it as saying Christ has replaced Israel and God has broken His covenant with Abraham. However, the right understanding is not that Christ replaced it, but fulfilled it (I have not come to abolish the Law, but to fulfill it -Matthew 5:17). CT says that Christ fulfilled the covenant, He did not replace it. The Covenant was fulfilled in Christ and continues today through God's people, the body of Christ.She goes on to say those within the RT camp (though, remember, it is properly called CT) are anti-semetic (and are the reason for the holocaust). This couldn't be further from the truth. I have great compassion for my Jewish friends and I love them dearly. However, Jesus said He is the Way, the Truth, and the Life, NO ONE comes to the Father but through Him. Jews do not believe in Christ, but deny their Messiah has come. Salvation is of the Jews, because Jesus was a Jew first, because He had not died yet, so He came to obey the Law in EVERY way, so that He could be the fulfillment of the Law. He is our Jewish Messiah. He is our High Priest! There isn't any more shedding of blood for the forgiveness of sins, because Jesus has fulfilled that requirement. Now we take communion, because we remember that very fulfillment in Christ through the breaking of his body and blood shed he paid upon the Cross through His death, burial, and resurrection. Again, Jesus said only He is the Way, the Truth, and the Life, no one comes to the Father, except through Him. If a Jew today is saved, but denies the deity of Christ and is still awaiting a future Messiah, is Jesus a liar? Paul was saved, because He believed and repented of his sins through Christ. In Acts, they called themselves, Christians; however, they were previously Jews. The Pharisees, teachers of the Law, who refused to bow to their Messiah, will receive their reward...and Jesus didn't make that sound like it was Heaven.Covenant theology agrees that there is one way to God and that is through Jesus Christ alone. Anyone who refuses to believe on the Lord Jesus Christ and repent of their sins, will not be saved. It's clear in the scriptures. I will witness to my Jewish friends, just as I witness to anyone else of whatever belief they have. If you don't have Christ, you don't have eternal life. It isn't anti-semitism at all. (If you claim to be a Christian and are anti-semitic, you need to examine your heart before God and repent. You are commanded to lovingly reach out to them with the saving faith of Christ, just as you would anyone else!) CT believers reach out to Jews, just as they reach out to an atheist. Both are lost without Christ.And that is the breaking point with this book. If you disagree with that, you will love this book wholeheartedly. However, if you are like me, and agree that Jesus is absolutely the ONLY way to God, you will absolutely gleen wisdom from this book in the sense that we are to teach the scriptures in everything we do with our children, but you may be put off by the strong use of the word \"heretical\" for those of us who believe Christ fulfilled the covenant with Abraham.I would rather recommend teachings from Voddie Baucham Jr. on this matter. Family Driven Faith is an excellent resource on how to live out the principle of Deut. 6. Answers in Genesis has a great resource from Diana Waring on teaching the history of the church, so that your children can see God in every aspect of history. I know there are other resources, but those come to mind.And one more thing to note, the whole OT is filled with stories that point us to Christ. All fuzzy pictures of something to come...Jesus Christ, the coming Messiah! Abraham and his son on the altar, the Passover, Jonah in the belly of a fish for three days and nights, David...the King, et cetera. It is all riddled with Christ in it. I thought I would mention that, as it is hard to \"replace\" something that was already there. :) Jesus has always been and will always be. He is the Alpha and the Omega, the beginning and the end. He is the author of the covenant and He is the finisher. Everything, absolutely everything, wraps around Jesus. And for that, I am not ashamed to say that Jesus is the Way, the Truth, and the Life, no one comes to Him, except by His mercy and grace alone to grant you repentance and faith in Him.Be good bereans and search the scriptures to see if these things are true. May the Lord bless you! :)",
                "review/helpfulness": "37/41",
                "num_reviews": 41
            },
            {
                "review/text": "This book is a magnificent Bible centered approach that is much needed in today's academic minded homeschool community. It will provide you with the methods, program, and resources for a course of study where students focus half the school day studying God's Word and the other half studying God's world (academics). Easy, entertaining and actually fun!Students study history chronologically and science in the order of the days of creation. This book will instruct you, step by step, how to give your child a Bible focused, comprehensive education from preschool through high school; one that will train him or her to read, to study, to understand, to LOVE TO LEARN and most importantly to desire and seek true wisdom. This approach can be used for all grade levels.Sampson gives an excellent Bible focused alternative to classical education by encouraging students to study snippets of the classics from a Biblical worldview without immersing them in the pagan writings.The \"Rethinking Education\" section explains the historical and cultural background of my recipes. Here you will learn how it is necessary to look at education through history. This section includes the origins and development of our traditional educational methods, from ancient times until today, with an appeal to return to biblical methods.The Heart of Wisdom Methods include the most popular homeschool teaching philosophies: Bible First, Delight Directed, Discipleship, approaches outlined by Charlotte Mason and Ruth Beechick, Hebrew methods, learning styles, and more!You will learn about the Heart of Wisdom four-year plan and philosophies for teaching each subject, as well as how to create your own unit studies (or use the lessons from Heart of Wisdom)The Resources section includes book lists included in the Heart of Wisdom four-year plan. This section explains books that should be in every homeschool library and provides hundreds of books by grade level to teach the unit studies.Sample pages are available from the author's site.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "Thank you, Robin, for a book that clearly articulates where, how and why a \"Classical\" education is not necessarily a \"Christian\" one! As a home schooler, I have been shocked at how most Christian curriculum not only embraces, but also endorses Greco-Roman mythology, philosophy and world views. At times, I thought I was the only one who felt this way, until I opened this book and read how articulately Robin had put my thoughts, feelings and ponderings into not just words, but a simple to follow outline approach that left me plenty of room to personalize! This is our third year of \"life learning at home,\" and my girls LOVE to learn now! THANK YOU for a great book!",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "If I had to choose only one homeschooling book, HOWTA would be the one! Amazing, stupendous work by Robin Sampson! I can't believe I'm so blessed to have found what I will use for the rest of my homeschool years this early on! I was homeschooled growing up, and worked in a homeschool bookstore. I've seen it all, and THIS is what it's all about. The resource section alone is worth its weight in gold. I can't possibly recommend it highly enough!!!",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is an amazing book! Robin Sampson will show you the different learning styles. She will take you through history to show how we have adapted the Greek system of learning. (Very Interesting!) She will guide and show how to incorporate God into daily \"school\" routine to make God the most important part of the day. Robin Sampson has done an excellent job of putting so much useful information into one book!!! I would recommend to anyone homeschooling or considering homeschool.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I found this book to be refreshing, challenging, and full of insight. It encouraged me to teach our children the way that God intended for them to be taught. Robin kept taking us back to the Bible the only source of TRUTH and WISDOM. I have told many people about this book. It is one of my three favorite books from the past year (the number 2 book is by Robin also, What your child needs to know when).",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I feel blessed to have stumbled across this book because for me it has been a prayer answered. I found it while looking for information on how to apply the Charlotte Mason teaching method.I withdrew my son from school and started home-schooling him with little warning and no planning. Although I knew this was the right decision it left me in a difficult possition. I either had time to reaserch how and what to teach him or to teach him but not both at the same time.The HOWTA has given me a frame on which to mount the canvas of our home-schooling. There are many great points about this method but there are two in particular which I love. The first is that is has such a sound biblical base - which is something which is so important to both myself and my son. This really shows through in all subjects. The other really wonderful thing is that I am inclined to go for a delight driven approach but sometimes lack confidence in this as it has no structure and is very difficult to plan round or collect resources for in advance. The HOWTA has given me the confidence that I lacked because it shows how to follow the delight driven path while being within a structure. And because it is a biblical structure I feel comfortable and secure using it. I have since purchased other items by Robin Sampson and was not disappointed and I plan to buy more as our home-school journey progresses.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Robin Sampson does an excellent job of presenting and authenticating her point of view that a child's education, to be most pleasing to God, should be biblically based; meaning that is should be based on the type of education that God guided the Hebrew people to give to their childre. This education, then and now, should be based on the study of God's Word and God's World. Robin points out the fallacies of classical educaiton from it's inception and also gives us an exellent choice of other books to refer to and read to substantiate her research.The book is well thought out, well-documented and well-written.Sampson not only makes an excellent case for Bible based unit studies, but gives us concrete plans to help get started, which is what many other method books leave out. I spent nearly 18 months researching classical education in the homeschool before I began to decipher exactly how it might look in practice.As a former homeschool mom, I wish Robin's book had been around 10 yrs ago. My goal now, with a Master's Degree in Christian Education, is to form a type of co-op school using the best methods available. After 2-3 yrs of research, what I was developing was very close to what Robin has. After finding her website and ordering this book I am now devoting my time to her reading list so I can better understand the underlying presumptions of her philosophy instead of reinventing the wheel.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is a must-read for Christian homeschool teachers. With dedicated prayer and insight, Robin Sampson has created a new approach to teaching that filters every subject through the Bible. The framework she provides at first seems complex, but after immersing yourself in it for a few days it becomes very clear and logical. I am so excited about this new school year and I am certain I will learn as much as my kids. That's one of the best things about this approach. It is applicable to you as well as to your students. It allows lots of room for creativity with options for scrapbooking, drawing, writing and anything else that can be documented for a portfolio. Even instituting a portion of the suggestions made in this book will revitalize your Christian homeschool and alleviate burnout for you, the teacher.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "they were single too 8 biblical role models",
        "description": "The Bible holds many examples of adult singles--including Paul, John the Baptist, and Anna--who lived godly, Christ-honoring lives. Through their examples, author David Hoffeditz leads the way to spiritual freedom in the midst of living single today.",
        "authors": "['David M. Hoffeditz']",
        "infoLink": "http://books.google.com/books?id=OH9HngEACAAJ&dq=They+Were+Single+Too:+8+Biblical+Role+Models&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am a married woman, and it may seem odd that I'd comment on a book about singleness. But I have a good reason. I married later in life. I'm glad that I did it, I'd do it again and I have no desire to end my marriage.My single years were wonderful and I did a lot, experienced a lot and learned unbelievable good things. But my singleness was marred by the constant pressure and even criticism from my friends, colleagues, and at times, even my own relatives. I was asked unbelievably personal questions and had to put up with remarks that were downright tacky. And the people who thought there were going to make me \"see the light\" about my singleness and settle down and marry were actually driving me AWAY from marriage and killing what desire I did have for it. For a long time I refused to pray for a mate. The story of how I met my husband and how we got married is a whole separate matter, but I can say this -- I was a contented single when I met him. We have a good relationship and I credit part of this to the fact that we both were able to lead good, useful lives when we were single.I think that David Hoffeditz has done the Christian community a real service with this book -- he gives sound, Biblical examples of people who were single or who had spent a great deal of their lives single. With the spate of books out pushing marriage over singleness and just about equating singleness with sin, I think this one restores a true, Biblical balance.In fact, the prime example of singleness: Jesus Christ Himself. In spite of all of the DA VINCI CODE controversey, Jesus was a bachelor!",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "David Hoffeditz is a highly skilled writer who examines various single biblical characters greatly used by God. In his book, They Were Single Too, I appreciated David's thorough examination of the texts of Scripture and his vulnerability in describing various facets of the single life. His timely humor and deep thought-provoking challenges encouraged me to view life as a single woman in an innovative way. I wish I would have had this book as a resource years ago! I highly recommend this book to anyone who seeks to understand God's perspective on the topic of singleness. As a graduate school professor and licensed professional clinical counselor, I see GREAT benefit in utilizing this book as a resource. This book is a \"must have\" for individuals, groups, churches, and academic institutions. I have yet to come across any other book that addresses singleness in such a creative way. I have read the book once and am already reading through it a second time because of the great encouragement I received from its content. I am looking forward to reading more of David Hoffeditz' books in the near future!",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "I was given this book as a birthday gift last year by a single friend. Although she is contented in her single state (or at least puts on a very good front), she knows that I struggle with it, and so doubtless meant this book to be an encouragement.I let it sit on my TBR pile for almost a year. I have read a few books on single-ness, most written by women, and have found that they all seem to follow one of three tracks: 1) 10 steps to finding Mr. Right; 2) 10 ways to get yourself a life while waiting for Mr. Right to come along, or; 3) 10 reasons why the single life is so fulfilling that you don't need to be married (why would you want to be anyway?!). These books have been of practically no help to me and I'm left feeling no better, because: 1) been there, done that, bought the t-shirt and even tried wearing it until finally, after several years, I realized it wasn't working; 2) I have a life, thank you, what do you think I've been doing for the past 20+ years? Sitting on the couch twiddling my thumbs?!, and; 3) in spite of how wonderfully fulfilling they say being single is, it doesn't feel wonderful to me and I don't feel fulfilled and complete. So what is wrong with me?When I finally decided to read this book, I realized from page 1 that it was going to be different. Really. On the first page of the Introduction the author talks about the so-called \"gift\" of singleness being a gift, all right: like the ill-fitting sweater your Aunt Lilly made and gave you as a Christmas gift. Having truly had an Aunt Lillie, who once really did make me the tackiest sweater you could imagine as a Christmas gift, I connected with the author immediately and realized, this guy is right on!My satisfaction deepened as I progressed with the book. I can now say that this is one of only two books on singleness/marriage that I have ever read and truly found to be helpful (the other being \"God Is A Matchmaker\" by Derek Prince). Coincidentally (or perhaps not) they were both written by men, and were both very short books; the authors cut the fluff and the BFF tone (both things that female authors tend to indulge in), and just get to the point, sharing substantive thoughts that are truly helpful.They Were Single Too is amazing in its authenticity. By that I mean, the author simply gets down to where the rubber meets the road; he doesn't try to convince the reader that he loves being single, but instead shares his struggles with it, thus opening his heart and exposing his vulnerability in ways that amazed me because I would never have the courage to do that myself. I'm not talking \"dates gone wrong\" here (thank goodness, I don't need or want to read any more of those, either) but honest, deep struggles; many of the thoughts he expressed were almost verbatim thoughts that I have had continually over the years, things I have cried out to God alone in the privacy of prayer. On the other hand, he is at times wryly funny, also; here again, he is totally real and this makes what he says even more hilarious.They Were Single Too isn't a manual for how to find a mate and thus escape your single state, nor is it a manual for how to be perfectly content and fulfilled in a lifetime of singleness. Rather, it is simply an encouragement to recognize and accept single-ness as a gift from God (no better or worse than marriage), maybe for a lifetime or perhaps only for a season. It is a reminder to totally trust God's love for us and his plan for our lives, even when that means being single. The author uses single lives from the Bible as examples for finding fulfillment and peace and purpose with where God has us right now, this day: not tomorrow, or next year, but just today. He stresses involvement in the work of God, commitment to that involvement, and, most of all, prayer.This book is absolutely a keeper; there are parts of it that I know I will re-read in times of struggle. I absolutely recommend this book for any Christian single over about age 35. It would be appropriate for younger singles, although they probably don't need it. In the 20s and often into the early 30s, you don't really feel the sting of being single. I know it didn't really hit me until my late 30s, and then it just about did me in mentally and emotionally. I sure wish I would have had this book about 7 years ago; nevertheless, I am glad I read it when I did. It is a blessing.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Despite the fact that I am an exceedingly slow reader, I just couldn't put this book down. As a 21 year old single facing the prospect entering entirely into adult singleness, this book caught my attention by the mere force of the topic itself. As I read I was delighted to see that the content of the book was highly beneficial and the style in which it was written made it easy and enjoyable to read. I'm not sure what I appreciated more, the level of honesty or the number of universal Biblical truths put forth. The level of honesty is key for this kind of work, as Hoffeditz clearly realized. The struggles are real and Hoffeditz given the chance for me to consider the real battles vicariously through his experiences while aptly describing my thoughts and feelings on the various struggles in \"solo living;\" as the author terms it. The book was universal in that the ideas put forth affect every person, single or not. The significance of this work is that these important idea were dealt with in the context of singleness; namely, sorting out the various issues, often with just you and Christ. As Hoffeditz highlights, often these struggles are dealt in the face of have no other person to help. Again, the universals such as pursuing Christ above all else are brought out beautifully and in a refreshing way for the single Christian. I enjoyed this work thoroughly; it will make a great gift for some on my list this year. I was very encouraged in Christ and am forced now consider and evaluate how I think about must in my single life before God. This is the sort of work where I found myself wishing I could have certain people read a particular chapter as it addressed the particular struggles that I know some around me are going through at this time. At the same time I was convicted that I needed to hear much of what was stated by the author. The topics dealt with include loneliness, how to face adversity as a single, the discouragement that often comes to the single adult from those who are married and/or have expectations of you being so soon, a strong reminder of who we are as follower of Christ (regardless of marital status), and many more. This will no doubt be a profitable book to read, regardless of your current relationship status.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Excellent book. It doesn't suddenly take away all the struggles associated with singleness, but it does help me focus on serving our God!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "seeking him experiencing the joy of personal revival",
        "description": "OVER 400,000 COPIES SOLD! Revival isn't just an emotional experience. It's a complete transformation. It can happen in your heart, in your home, in your church, and in your world. Restore your first love. Develop a heartfelt desire for God's Word. Resolve conflicts. Repair relationships. Remove bitterness, fear, and worry. Refresh your spirit. Renew your mind. Reenergize your life. You can't get back your passion and zeal for the Lord. Begin by Seeking Him! \"Seeking Him was transformative for me. ... It brought me nearer to the Father and helped me learn how to seek Him with joy. I totally believe it can do the same for everybody else.\" Jackie Hill Perry, Author, speaker, artist \"Every pastor's dream. Finally! A guide to assist every member in personal revival and every church in corporate revival.\" Tony Evans, Oak Cliff Bible Fellowship \"An intimate and insightful guide to holy living, a heaven-blessed soul, and a happy heart that can't help but to be on fire for the Lord Jesus!\" Joni Earackson Tada, Joni and Friends",
        "authors": "['Nancy DeMoss Wolgemuth', 'Tim Grissom']",
        "infoLink": "https://play.google.com/store/books/details?id=Xy-JDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Don't bother with this study unless you're willing to be truly honest with yourself and with God. But if you're ready to take a good hard look in the mirror and allow God to search your heart, this is a wonderful tool for personal revival. The study is thoroughly rooted in scripture and broken into very manageable daily segments over the course of the 12 weeks.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "This is such a wonderful book if you feel you have drifted away from the Lord, or if you feel that you would like to go deeper with Him. I drifted away from the Lord for about a year and got myself involved in all kinds of sinful things. \"Out of the blue\" one day I received a free sample chapter of this book in the mail. Tired of living the way I was and experiencing the consequences of my disobedience, I opened my heart back up to God and worked the chapter. I soon bought the book and it really helped me to \"re-bond\" with my Father and I'm so grateful. This book is full of conviction (with hope) and godly wisdom. There are lots of personal stories in there, so you won't feel like you're the only one who has stumbled in your walk. There are also a lot of questions to help you do some prayerful soul-searching and personal application. This book is certainly not just for men, or women. It can easily be used by both. Be blessed!",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "then this is your book. It's a wookbook designed to find road blocks to having the spiritual life you want. Even though I worked it in a group, I think it would work equally well as a solitary study.I must warn you, it will make you look at yourself with unvarnished honesty. Some of the excerises will make you squirm! However, if you have the guts and honesty to face yourself, it will help you find your way back.B. Story",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I thank God for introducing me to such a study. It is such an awesome, honest and reflective study of the Word and Heart of God for His people. The study is geared toward women but is also excellent for men who are seeking to have a closer walk with the Lord. God wants a revival of our churches which begins with a revival of each individual. We selected this for our women's study group. This material helps one to take an honest look on the inside to discover what is keeping us from Seeking Him. This is best taught with the video that can be purchased with it.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This study is written to help the reader recognize their need for a closer intimacy with God. I've only read and completed the first week in the lesson, but it penetrates the heart and reveals areas of sin and weakness, leading the reader to depend upon the Lord in every area of life. It is an excellent study for friends who want to draw nearer to God, experience accountablity to and with each other, forgiveness for others and self and all together know and live their own personal revival as God changes their hearts by His Spirit's work.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I have done several Bible studies and this was one of the hardest, most depressing, joyless one I've ever done. Very little diving into scripture, emphasis on corporate confession was discussed in several of the lessons, lots of lists to see what you may or may not be doing as a follower of Christ (which are incredibly impossible to do), and the faith builder lessons are stories about people understanding their need to confess something after having a revival at their church. Yes it is important to address the issues of sin and to confess them to God and others you've wronged, but only God can cleanse you through Jesus Christ. There is alot of guilt and condemnation after completing pages of lists. It is difficult to look at ourselves and to see areas in which we need to admit and confess sin to God, but we did not touch on the gift of Grace and forgiveness of sins through Jesus Christ and His work on the Cross and His resurrection. All the stories seem to end up hunky dorey and were pretty unbelieveable. Each week our small groups discussed how the material was presented and we had to infer what the author was trying to say. There were many questions and comments that were truly misleading. I don't doubt that the author's intent was to help, but this study could damage people and relationships if not guided by Christian counselors and Pastors. To tell someone who may have been physically hurt or sexually abused to ask the offender to forgive you for for responding incorrectly was a little bit out there. I still have 2 lessons to go so maybe it'll change? I just keep coming back to the point that it is my confession to Jesus Christ that washes me clean, that it is God working in me that changes me - not Christ plus me... but Christ alone that reconciles me to a God that loves me beyond my wildest dreams. This study depressed me and did not create a revival at all in me. My husband asked me to please quit taking it as it was not healthy for me or for our marriage. I know this study received high ratings, but I don't understand why. Ugh! It was based on a 12 step program and not focused on the grace and mercy of God through Jesus Christ. I hated it and quit nit.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I used this study in a Sunday School class. It is absolutely solid and, if followed as written, will draw you to the bedrock issues of genuine personal revival. Nothing in the book indicates an orientation toward women. I would recommend doing it in a small group setting instead of Sunday School to allow for full discussion (90 minutes/lesson is suggested by the book). Some sort of accountability to ensure that you don't glide over uncomfortable questions would also be wise. The companion DVD is not necessary but could enhance. Overall: Outstanding!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Seeking Him was purchased for a ladies only home Bible study group. There are 15 members, all of whom are believers in Christ, but of various ages and levels of spiritual maturity. We prepare the lesson ahead of time at home during the week, then discuss each question as a group. It will take us longer to complete the study, but speed is not the object. A closer walk with Jesus is the goal for each of us. Seeking Him provides an excellent, thought provoking study that is guiding us into serious reflection and soul searching. All 15 of us would highly recommend this study for other groups!!!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is an incredible Bible Study on personal revival. Over 70 women in our church are involved in this study. If you want lasting lifechange, this study is for you. This study is heart surgery.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am only into the second week, but this bible study is one that hits home. It is easy to read and get into. We (a group of teachers)are doing this study before school and it sets the tempo for the rest of the day. All of us are benefiting, thus far, and developing a closer walk with our unfathomable God. I would recommend it to anyone who wants an \"attitude chech\" with God.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    }
]