[
    {
        "Title": "labrador tales a celebration of americas favorite dog",
        "description": "A collection of poems and anecdotes describes the relationship between Labrador retrievers and the people who love them",
        "authors": "['John Arrington', 'Labmed', 'Walt Zientek']",
        "infoLink": "http://books.google.com/books?id=_XQMAAAACAAJ&dq=Labrador+Tales:+A+Celebration+of+America%27s+Favorite+Dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Being a labrador retriever owner since 1997, I was toucbed at the authors depiction of the way an animal can become so much a part of an individual's life. The book spoke of the hardships of training a lab puppy, to the struggles of dealing with the loss of an old friend. Any lab owner can agree, most of the stories found in this particular book, their lab has done at one time or another. In this book a labrador is more than just a companion. Great Book! I would recommend to all lab owners..",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "A rewarding and wonderful book of tales that will touch anyone who loves dogs. Every tale will touch you with memories of a Labrador Retriever you once had or bring closer to your Labrador pal that you now share your heart with. a must gift for anyone who owns a Labrador Retriever!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "John Arrington and Walt Zientek have touched the hearts of those who share Labrador related e-mail lists for quite a while! Their love of the Labrador Retriever is evident in every word and they have the amazing talent of making the reader feel each story.Everyone who has or had a pet can relate to the stories, essays and illustrations (Terry Albert has excelled). This is a must read! (Please Note: Kleenex are a necessary accessory!)",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a kind of book you'd want to take with you to work, and read a story on your break and at lunch. The stories are short, some funny such as the one where much researching was done to buy a pup and it happened the pup picked the owner instead. Some are sad. All are real. I have a lab, and have had other dogs. I identify with all the dogs I've had with this book. If you read this book away from your dog, you'll just want to go home, hug them all and thank them for being them.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I had the priviledge of reviewing the material in this book prior to it's publication. If you love Labrador Retrievers, this book is for you. It will make you laugh; it will make you cry; it will make you get down on the floor with your Lab and give him or her a big hug and a kiss! Walt, John and Terry are all to be commended on an extrordinary compilation.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the complete holistic dog book home health care for our canine companions",
        "description": "Naturally, you want the best for your canine companion...a lifetime of tail wags and dogged good health. In THE COMPLETE HOLISTIC DOG BOOK, animal healer Jan Allegretti shows you how to create an environment and lifestyle that will nurture your friend at every level, to help you care for her body, mind, and spirit. You'll discover keys to supporting and enhancing her innate healing abilities, while you gain a deeper understanding of how her body systems work-and what to look for if something goes awry. THE COMPLETE HOLISTIC DOG BOOK lends a warm and caring voice when you need it most, when your beloved dog is sick or injured, or when you simply need advice for keeping her healthy and happy. It's also a comprehensive reference manual packed with holistic therapies drawing on a range of modalities, including homeopathy, herbs, bodywork, Traditional Chinese Medicine, and the use of food as medicine. You'll find easy-to-follow recommendations for natural, preventive care, including early socialization, environmental safety, and nutrition, as well as practical techniques for treating hundreds of common canine illnesses and injuries using gentle, natural medicines that are easy to administer and painless-or delicious -for your dog. For all animal guardians, caregivers, and practitioners, at home or in a clinical setting, this book offers: -A unique, holistic approach that sustains your dog's physical and emotional health, from puppyhood through the senior years. -The Fresh & Flexible(TM) meal plan-the easiest, most effective way to feed your dog a nutritious, delicious diet. -A guide to creating a Holistic Medicine Chest to treat the most common illnesses and injuries-all with just 15 remedies. -A sensitive exploration of how you can address your companion's special needs as she ages, and ease the transition when it's time to let go. -An easy-to-use, 80-page Materia Medica covering nutritional supplements, homeopathic remedies, and herbs. -A comprehensive listing of illnesses, injuries, and behavioral issues, with a variety of treatment options to choose from. -Answers to your questions about how you can use Cannabis safely--and legally--to support your dog through a range of difficulties, from pain and inflammation to anxiety, neurological disorders, and cancer.",
        "authors": "['Jan Allegretti']",
        "infoLink": "http://books.google.com/books?id=nOsBvgAACAAJ&dq=The+Complete+Holistic+Dog+Book:+Home+Health+Care+for+Our+Canine+Companions&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I saw the word &quot;complete&quot; in the title, I thought thepublisher was probably stretching the truth...but now that I've read it I think the title does not go far enough in describing it. This book covers alot more than health care. For instance, under caring for an older dog, the tips are practical, simple, and have nothing to do with medicine or illness. Simple things like buying the dog a softer bed. Life style changes that may not cure, as somethings cannot be, but can make your dogalot happier.Dog care books are usually either written by a vet, who takes the linear Western medicine approach, or a holistic practianer who never sees the need to darken a doctor's office. This book is written in a partnership between a vet and a holistic person and the book shows the wisdom of both and suggests when and how to use either one or both of the approaches. Good common sense abounds. And always practical information. In a section on diabetes the authors list the dog breeds most likely to be susceptible. If you have one of these breeds it may make recognizing the signs easier. They do this for most of the diseases they discuss.And they discuss alot more. Prevention, diet, homeopathy, herbs, TCM. bodywork, alternative therapies and conventional medicine, and more. It's a fat book packed with info.If you have a dog, you need this book....though in truth I think alot of what they say can be applied to any animal, including the human.",
                "review/helpfulness": "76/77",
                "num_reviews": 77
            },
            {
                "review/text": "I sat down with this book intending to go through it in a \"first time kind of glance through\" way and ended up reading it for four hours - non stop.I started with the homeopathy section which had an excellent discussion on how the remedies are made and used. I am a novice in this area of medicine but found the explanations clear, concise, and informative.I then turned to the puppy section - and found a wealth of valuable information on the importance of puppy socialization - how exposing my puppy to lots of different people, dogs and places, (after their vaccination series is complete, of course!), helps him learn manners, gives him confidence, and allows me the luxury and joy of taking him with me to many places without having to worry about his behavior. The book also discusses how to select a good and compassionate trainer.There is a section on \"Letting Go\" - always a difficult and painful part of sharing one's life with an animal. I found the author's advice personal and heartfelt.The chapters on new vaccination protocols and nutrition are informative and complete. Although the two authors recommend a homemade diet, they also tell the reader how to select a high quality commercial diet, as well.I appreciate the author's balanced view and the fact that they explain the \"why\" of things - something which is often lacking in many books. Excellent.The book is loaded with helpful tables and graphs and personal stories. In addition, there are great photos of \"Found Dogs\" sprinkled throughout the book.It is obvious these two authors love their topic and want to improve the lives of puppies, dogs, and their people. I will recommend it highly.",
                "review/helpfulness": "54/56",
                "num_reviews": 56
            },
            {
                "review/text": "I have a variety of books on health for dogs, which I reference often. I noticed lately, however, that I've gone to this book first over and over and often I don't need to look at any of my other books. I usually cross reference material, but I've found valididated information from several other sources in this book so often that I save myself the trouble and just reference this book now.Rarely do I find a \"the only book you'll need\" in any book, but this one definitely has it all, and the information is not extreme. The authors recognize balance, recognize that there are a variety of methods to attack a problem, and they present each method thoroughly and non-judgmentally.For example, if a dog is vomiting and has nausea, they first differentiate between acute and chronic. If acute, they first give information on nutritional support, then homeopathy, then herbs, then accupressure and finally other methods including flower essences and considering addressing the dog's emotional state. If chronic, they are just as thorough but give other paths to follow in trying to treat the dog's vomiting.In addition to concrete suggestions for treating many health problems, very clear and professionally drawn illustrations abound throughout the book. In the section for vomiting, one drawing shows the dog's digestive tract and another the accupressure points for the digestive tract. When referring to the illustration in the text, the authors also reference corresponding charts and additional illustrations in another part of the book (and give page numbers!) that will further explain information regarding that particular illustration, such as finding the exact meridian point on the dog.The treatments the authors focus on in the book include diet, homeopathy, herbs, accupressure, acupuncture, TCM, bodywork, and energy medicine. The authors touch on a few other areas of therapy but they focus primarily on the topics just mentioned.I found the illustrations to be extremely valuable. They are peppered throughout the book showing parts of the dog that are relevant to the corresponding text. The illustrations aren't too detailed; they have just enough to explain. They're clear, concise, and easy to understand.Overall, this is the best comprehensive book on holistic dog care on my shelf. I'm gradually getting rid of the others because they don't compare at all to the accurately named, \"The Complete Holistic Dog Book.\"",
                "review/helpfulness": "51/52",
                "num_reviews": 52
            },
            {
                "review/text": "Dr Katy Sommers is my vet, yet when my Irish Wolfhound pup, Jessica, had problems with her diet, I took Katy's home-cooked-diet advice with a smile and continued to buy the top kibble. I was intimidated by the responsibility of balancing a diet for a giant breed!As she grew, Jessie failed to thrive on kibble. By the time she was 10 months old, she was a walking skeleton and I added more &quot;home cooked&quot; to her diet with some success.Then she had a medical crisis brought on by my feeding her fat trying to get her to gain weight. Dr Katy and I sat on the floor of her clinic late into the night, giving her morphine to help with the pain, and I had to make the decision to put her down or see her through her problems. When she recovered, I was convinced that I needed to switch over completely to a home-cooked diet.Luckily, Katy's book came out the same week! Great timing, Katy!I have several highly recommended books on Natural Health Care for dogs, but Jan &amp; Katy's is the easiest for me to apply. It provides easy-to-follow instructions on food selection, preparation and balance. Using her guidelines I'm able to easily fix Jessie's meals as I fix my own - my diet's improving too!I was also pleased to find thorough sections describing major illnesses, health problems and injuries, and appreciate Jan &amp; Katy's common sense approach to herbs and alternative medicine.Results? You Bet! I bought the book at the end of September; Jessie was 11 months old, 30&quot; tall at the shoulder and weighed 74 pounds. A month later, Jessie has gained +25 pounds and is a strong vigorous dog. The change is phenomenal, and has convinced me that THIS is the way dog should eat!Jessie agrees! Thanks Dr Katy, for being there for the Jessie's of the world!Linda Cowles",
                "review/helpfulness": "40/41",
                "num_reviews": 41
            },
            {
                "review/text": "Recently I have been interested in learning more about the holistic approach to veterinary medicine. I purchased this book but I am very disappointed with it. I find its descriptions very vague and not informative at all. It lists many different herbs and homeopathic medicines to give for different ailments, but it doesn't say why they work or if there are any side effects to them. I am sure it would be great for someone who already has an understanding of holistic medicine, but I don't. Also some of the viewpoints in the book I feel are wrong. Such as recommending making your dog a vegetarian and that dogs are not really carnivores. In fact I would say the whole chapter on diet is not very good information. Even some of the essential fatty acid sources they recommended (most of the vegetable oils) are not good for dogs. They are too high in omega 9 and actually cancel out the good omega 3 and 6's. It kind of makes me not trust any of the information in the book. And I feel diet is the most important part of a dog's health. I bought this book because it had such wonderful reviews. I wish this book had a look inside option. I don't think I will buy a book solely based on reviews again. Unless you already have a very good knowledge of homeopathy or just want to be told what to do with no explanation then I would not recommend this book. It was a waste of money for me.",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "Our dogs, like humans, are getting fatter, more cancer, more heart disease... Its not ievitable and this book shows you alterantives that can improve your dog's energy and extend their life. An excellent, practical book filled with everything from how to avoid over vaccination to adopting a vegetarian (or vegan) diet for your dog. Using this book, we successfully transitioned our adopted dog (4 years old) to a plant based diet (for a lot of reasons) and found after about 1 month she had a shinier coat, more energy, and gained up to her normal weight. More than your average vet will ever know about alternative dog care. Highly recommended.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "After getting another book, I found I wanted to ensure diversity in my book collection of reference materials. Saw this book, flipped through it in the book store and decided to get it. That simple. It has great information in it and bullets out just what I want to know. I also have the Natural Health Bible for Dogs & Cats : Your A-Z Guide to Over 200 Conditions, Herbs, Vitamins, and Supplements by Shawn Messonnier. Both of these books complement each other and provide what I need to know for taking care of my animals. Often, the herbs recommended correlate to the ones I'm taking (or that people take). I certainly don't mind sharing with my best friend and loyal companion.My quest initially started because my 7 YO schnoodle suddenly experienced a slipped disk and couldn't walk (essentially hind leg paralysis, both hind legs). I was completely distraught at the prospect of surgery on the little guy. After learning a local chiropractor (ours as it turns out) would take a look at him, I took him in. I consider it CAM - complementary alternative medicine. I kept him on steroids, and pain management, and the chiro adjusted him. By the next morning he was able to walk out of his cage (where the meds had clearly made him sick all night). I decided then and there that there is no question in my mind that there is something to be said for alternative therapies. No one can convince me otherwise. This dog dragged himself around for two days, and the vets told me they saw no improvement when they had him. I continue with touch therapy and supplements to his diet. But I will never forget this extraordinary and valuable lesson. Our families are valuable treasures and we are entrusted with good stewardship of our K9 companions. This book helps make that job a bit easier.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "Fabulous book!! It is packed with information, but easy to understand and apply. I found the book to be very balanced and subjective in it's approach and advice. For example, it fairly presents the pros/cons of different diet approaches, without specifically recommending a \"one size fits all\" solution. All chapters of the book are valuable, but the section on diet and nutrition is particularly outstanding! Since reading the book, I have adopted a diet of home-cooked meals for my german-shepherd-mutt that is virtually 100% vegetarian! Seeing the way she responded to the new diet has converted many of my friends into believers who were total skeptics of a vegetarian diet. Although my dog was always healthy and happy, the changes are unbelievable in terms of her temperament, appearance and personality.Regardless of whether you're looking to change your dog's diet (as I did), this is a valuable book and must-have for every serious dog owner!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Excellent book Well Written. Great format, great philosophy well researched.All dog lovers should read and have this in their library. High marks !Soleng K. Tom MDPalo Alto, California",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "Since buying this book it has become my best friend, it has helped me and especially my animal friends time and time again. Many of my dog loving friends also own this book now because of the info i have shared with them from this book . A definate must have if you are searching for alternative health care.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "best little stories from world war ii",
        "description": "BEHIND THE GREAT POWERS, global military conflict, and infamous battles are more than 100 incredible stories that bring to life the Second World War.",
        "authors": "['C. Brian Kelly']",
        "infoLink": "http://books.google.com/books?id=Mfxl4rwn_-4C&dq=Best+Little+Stories+from+World+War+II&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "&quot;Best Little Stories From WWII&quot; is somewhat of a misleading title. While the layout of the text is admirable...numerous short stories that can be read at leisure...the content of the majority of the stories is bland and unmoving. While a few of the stories are worthy of great praise, I found too many boring stories about the world's naval forces during the time period. After reading such great books from authors like Cornelius Ryan, Stephen Ambrose and Charles Marshall, I find that overall this book is missing much by comparison. The only reedeming quality this book has for me is that of a coffee table decoration.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "This is a collection of 101 obscure stories (vignettes) from World War II, mostly anecdotal, human interest stories combed from a variety of sources. They cover the full gamut of the war -- all theaters, all mediums. One lesson to be drawn is that people will be people no matter what their circumstances. An easy, entertaining read. With each story standing alone, it's an excellent book for casual reading.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "One of the fascinating things about war is the stories that come from it. Kelly has compiled over a hundred of these stories from World War II that would make any history buff proud. Books like this remind us that war is not only battles, generals and casualty rates. There is so much more beneath the surface. Wars are faught by people, by human beings, and when that many human beings share a common experience, there are certainly some good stories coming from it.The short tales show us the war from the eyes of those who lived it. Some are comical, some are sad, some are better than others. If nothing else, this book portrayed the human side of the war, reminding me that even at our worst times we are not animals. For the history fan, I highly recommend it, but it would also be a good read for all the generations that never actually knew those of the Greatest Generation, the men and women who saved the world. These are their stories, and they make for great reading.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was really fun to read -- the stories seem to flow pretty well one to another. They are arranged chronologically, and paint a vivid picture of the whole war for us who weren't there. Since each story has a different perspective and author, you get a well rounded taste of the heroes and horrors that came from the great clash of the 20th century. Best Little Stories of World War II is a wonderful choice for anyone interested in history or in WWII.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "A more accurate title for this book would be \"Little stories from WWll\"Many stories have no beginning and worse, have little or at best an anti climactical ending.I'm NOT a WWll vet, however, I can come up with better stories than this book. Couldn't finish the book---too boring.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "8 weeks to a healthy dog",
        "description": "Shows readers how to extend the life expectancy of their dogs by controlling parasites, controlling diet, and providing opportunities for exercise.",
        "authors": "['Shawn Messonier']",
        "infoLink": "http://books.google.nl/books?id=LO2AO-miQeAC&dq=8+Weeks+to+a+Healthy+Dog&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have been trying to get information about raising my dog holistically.There isn't much information out there for a novice like me. Then, I read this book, 8 Weeks To A Healthy Dog.It has all the information that I was looking for in one place. It has recipes for home cooked diets,what supplements to give and where to find them, and how to make life better for an aging pet.I will keep this book always within reach and refer back to it often.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I purchased many books in hopes of helping my 8 year old Schnauzer/Jack Russel mix return to good health. I feared that she was slowly dying, due to many \"scary\" symptoms including blood in her feces. After reading Dr. Messonier's book \"8 Weeks to a Healthy Dog\", and following his advice, I can thankfully say that my little Stella is totally healthy. In fact she is better than new--doing things she has not done in years!! I credit Dr. Messonier for saving her life. His book was the only one that gave practical, precise information on how I could help her. Stella says \"Thank you, Dr. Messonier!\", and so does her Mom and Dad!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Many of the pet care books on alternative care and feeding are biased in one directional only. Only home cooking or only BARF is recommended and everything else is the wrong approach. In Dr. Messonnier's book I found it to be the most logical approach yet. Conventional therapies are recommended IF necessary and alternative modalities are recommended to do the least harm to the animal. I've read many of the other authorities, Dr. Pitcarin, Wendy Volhard, and Lonsdale but in this book I feel finally a logical approach. The recommendations take you from visiting your vet for a thorough check up and blood work, to diet recommendations, vaccination discussions, grooming concerns, herbal remedies (although not in detail). This is a great springboard for someone with a dog that they want advice on a healthy path to begin their dog on to improve their health with the least amount of harm to the dog due to over vaccination or over use of antibiotics. An easy read - be assured you'll learn something.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a very basic book, which isn't to say it's bad, just lacking a lot of detail and explanation. There's very general information on choosing a vet (wk 1), parasites (wk 2), diet (wk 3), supplements (wk 4), disease treatment (wk 5), exercise (wk 6), drugs (wk 7), and grooming (wk 8). I don't believe grooming and exercise warranted their own chapters, but it was interesting to see what he recommended as dietary supplements for specific disorders.One thing I didn't agree with at all was Dr Messonnier's recommendation that all pets, regardless of age and condition, be given dietary supplements. Giving puppies supplements can seriously harm their skeletal growth, especially when fed a commercial diet. Giving supplements to any dog for anything but a specific purpose is just a waste of money.For a new puppy or dog owner this book may be useful as a guide toward building a good foundation, but other sources should be utilized as well (including Messonnier's \"Natural Health Bible for Dogs & Cats\"). For someone who is already well-versed in natural pet care: pass this one up.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a great book that is a quick read. I found it to be full of common sense ideas on how to incorporate traditional vet care and the newer ideas of integrative holistic care. It is broken down into one week sections that are simple to follow. Each week focuses on a specific item in the process. The chapters are filled with examples from Dr. Shawn's practice that help to reinforce the theme.I highly recommend this book to all dog owners! It is an easy guide that will walk you through the steps to a healthier and happier pet. Combine this with Dr. Messonnier's other book, &quot;The Natural Health Bible for Dogs &amp; Cats&quot;, which is an excellent reference book for all pet owners.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Let me say first that if you are going to buy this book (get it on sale!) and follow the program READ the entire book first before making a veterinary appointment...if you don't you may end up spending alot of money going back and forth to your vet. In this book the author recommends you take your dog to the vet and run a bunch of tests first. He does have some good concepts in here, less vaccines for dogs and more check ups. Honestly I only think you should do twice yearly check ups if you have a vet that is actually proactive (they are hard to find). He makes good points about how MANY vets don't even bother to aspirate (find out what is inside lumps on your dogs) really that is the only way besides surgery to check and see if lumps/tumors on your dog are cancer. If your vet doesnt recommend to aspirate every lump on your dog find a new vet! I believe the author is a great vet in his own right and if you happen to live in the area that he practices in I would def take my pet there...plus his diagnostic tests sound super cheap. He makes a good point about how yearly bloodtests and diagnostics should be done. I would probably only do bloodtesting and urine testing 1-2 year but wouldnt do the recommended xrays,teeth cleaning and EKG's. He makes a great point about dental cleaning and most dogs having peridontal disease (disease of the mouth)I agree with him there though my dog who chews bones everyday DOES not have it. He has a very interesting concept about skin disease/allergies in dogs, he recommend frequent bathing (daily or a few times a week) this makes sense to me. One thing that I strongly disagree with is microwaving your homemade dogfood...it really defeats the purpose of home cooking because you are actually radiating the food, killing enzymes and helpful things. I also don't necessary agree with giving your dog's supplements that are intended for dogs....if it's not human grade then it is \"ok\" for the product to be substandard (IMO). He recommends enzymes be given to the dogs, especially one called Prozyme which is a plant enzyme (which he tells you is a plant enzyme) that means it only breaks down plant material. If you are feeding a RAW food or non plant food it is useless (he didnt mention that). For geriatric dogs he recommends EKG and xrays yearly...in my belief over use of xrays ie radiation is harmful and will lead to cancer. So in that case not sure prevention is worth the overall risk (if that makes any sense). DONT buy this book if you think you are going to be told what types of herbal doses to give your pet. He highly recommends EVERYTHING be done under vet supervison. PLUS just note that just because a vet claims to be wholistic doesnt mean they are a good Dr (Dr. Messonnier sounds awesome) so do your research. We used a Wholistic vet that saw us coming and took us to the cleaners. I highly recommend the Martin Goldstein DVM book The Nature of Animal Healing (though wouldnt use his homecooked dogfood methods)",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "my rescued golden true stories of rescued golden retrievers and the people who love them",
        "description": "A loving celebration of the emotional bond between rescued goldens and their humans, this heartwarming collection of photographs and true stories conveys every aspect of the humor, devotion, fun and inevitable sorrow that exist within this special relationship. And honored are the volunteers of the rescue organizations that dedicate their time, energy, money, and hearts to this noble endeavor. Here, in the words of adopters writing about their rescued goldens, you'll meet: Dakota who was saved from the streets and now brings joy as a therapy dog; Promise who got a second chance at life after surviving years in a breeding kennel; Sproul who became a bomb detection Police K-9 dog after being surrendered by her owners for being \"too energetic;\" Ozzie who was rescued from the kill shelter and transformed his first-time dog owner into a \"real dog person;\" Nutmeg who saves lives as a search and rescue dog after being labeled as \"overly aggressive\" by her former owner; Hope who was saved from death in a backyard breeding nightmare to inspire her adopting family to leave Manhattan following another nightmare September 11, 2001; - and dozens more. These eloquent pictures and wonderful stories will touch anyone whose heart has ever belonged to a Golden. All profits will be donated to the rescue groups represented in the book.",
        "authors": "['Marjorie McHann']",
        "infoLink": "http://books.google.nl/books?id=J8Dza8rGy6MC&dq=My+Rescued+Golden:+True+Stories+of+Rescued+Golden+Retrievers+and+the+People+Who+Love+Them&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I felt so honored when asked to provide my Golden story for this book, and when it arrived I let it sit for a few days. I was worried that some of the stories would be sad and open old wounds for me. One day I sat down and read it cover to cover and am a better person for doing so. Author Margo gently nudged each and every one of her authors to speak from their hearts in their own voices and each tale is utterly unique and beautiful. This book pays a fitting homage to the most loving and companionable breed of all time, the Golden Retriever. It is a wonderful testimony to what adopting a rescued Golden can do to enrich the lives of the adopter and adoptee.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "I bought this book before it was even released by the publisher. It is excellent! As a volunteer for my local golden retriever rescue group (GRREAT) I could relate to every story told. It made me want to be able to rescue every GR out there who needs a second chance at life. To give of yourself to save the life of a GR in need is like no other experience you can imagine. If you've ever been owned by a golden, thought about being owned by one, or are just plain interested in dogs, this book is a must. If you are thinking about being owned by a GR and read this book, you will see why you must contact your local rescue group. There a rescue groups all over the country (US).I read it through the first time I opened it and quickly passed it along to my mom. Although she isn't owned by any dogs, I wanted my mom to get a look at why I volunteer for a rescue group and how my heart can go out to every golden in need that I hear about. Thanks to Margo for putting this wonderful collection together and thanks to all those whose stories are in this book or whose stories are just waiting to be told (hint for a sequel!). Your hearts are big and deserving of all the unconditional love these wonderful puppers give you.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Kudos to Margo McHann for putting together such a wonderful book, that will tug at the hearts of all Golden Retriever lovers everywhere! This is a must for anyone who loves or has been loved by one of these wonderful dogs. My own little girl is featured in this book and it will forever be a very special book to me! Thanks Margo, for opening the eyes of the world to &quot;Rescue&quot; and what it is all about!",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "In her book, Margo McHann proves that whatever you put into a dog, you get back with interest! The forward to this book couldn't encapsulate it any better: rescued dogs are not second-hand throw aways! Hopefully this book will convince many people why they should adopt from breed rescue groups.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "My Golden Frosty's story in in Margo's book. I read it first when I bought it, I was so proud. Then I started reading each of the other wonderful stories and was feeling every emotion, from tears to happiness and whatever lies in between. Each and every story brought such emotion to me. There are so many out there who love Goldens so much they devote their lives to them. I am very proud to be included in this wonderful book and to have been owned by such a wonderful dog.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Marjories McHann's stories of rescued Goldens and their people are a must read for every dog lover. These stories and photos are a wonderful telling of what Golden Retriever Rescue does to help dogs and what these rescued dogs have done for the people who love them. Even the toughest reader may need a tissue or two - the stories are full of joy and a bit of sadness too...",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "My story is in the book and I am absolutely delighted with the book. The story is exactly as I wrote and beatifully displayed as all the stories are. It gives others a look and feeling of what it is like to own one of these beatiful animals and the love they give back--unconditionally! I am so very grateful to Margo for doing this for all of our golden loved ones and those yet to come. A truly wonderful book. I plan to give several copies to my friends and family for Christmas presents.Thank you again Margo!!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I found Marjorie's collaborative collection of short stories about our beloved rescued golden fuzz butts a wonderfully passionate account of what canine and human life is like when our four legged friends get a second chance at a life they have longed deserved. I brought it to work and by the end of the night 3 of my coworkers had read it through cover to cover. It is hard to put down once you get started. Kudos to Marjorie for sharing with us the \"tails\" of the rescued golden. Every story brought out a different emotion in me.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As soon as I opened the book, I was hooked. I was suppose to be doing a zillion things around the house but could not put the book down. I sat down and read it from cover to cover much to the disappointment of my 3 goldens. I love the short stories and pictures about the rescued goldens. It made me laugh, cry, smile, and want to read it all over again.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a must for dog lovers especially Goldens. It is full of wonderful stories and pictures, all different but all full of love. The book is well presented and has other useful information which was an added bonus",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "fifteen hours warhammer 40000",
        "description": "An inexperienced soldier receives his first taste of the horrors of combat against the monstrous orks on the nightmarish, futuristic battlefields of the Warhammer 40,000 world. Original.",
        "authors": "['Mitchel Scanlon']",
        "infoLink": "http://books.google.nl/books?id=c-JSAAAACAAJ&dq=Fifteen+Hours+(Warhammer+40,000)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "From the first sentence: \"The sky was dark, and he knew he was dying\" Mitchel Scanlon's first Black Library novel, Fifteen Hours, sweeps the reader up in a darkly evocative and almost sublimely grim tale of the recently conscripted Imperial Guardsmen Arvin Larn. It is clear that due to his attention to detail and the novel's seamless transition from the pastoral agri-planet of Jumal IV to the war-torn streets and trenches of the city of Broucheroc that Scanlon has a firm grasp of both the facts and the nuance of the bleak and violent future of humanity. He shows this knowledge in both in the far-distant future universe of Warhammer 40,000 in general and it's foremost military machine, the Imperium of Mankind's Imperial Guard in particular.Scanlon further punctuates the first person experiences of Trooper Larn with the occasional interlude where we are presented with insights into the characters and personalities of the Imperium that caused Trooper Larn to come to be at this hell-hole of a planet where he doesn't belong and in a war he has no part. We see through eyes and hear the thoughts everything from an Administratum Scribe to the Grand Marshall of a planetary army. Through these interludes we gain a further insight and the very real sense of an ominous future.This is not a novel for the feint of heart. Mitchel Scanlon is almost aggressive in his realistic portrayal of the dark and at times hopeless life of a lowly infantryman of the Imperial Guard. He is, without a doubt, the first author of the Warhammer 40k universe that may actually present the universe as too grim, if such a thing can be said and it is clear he is no fan of the officer ranks. At times, this reality he confronts you with is so surprising that it will hit you in face and leave you jarred for a chapter or two. However, there is a method to Scanlon's madness, his sensuously morbid portrayal of the universe makes those rare moments of Pyrrhic victory, of laugh-out-loud levity, and even of hope feel all the more powerful and moving. I don't mind telling you, its one hell of an experience.",
                "review/helpfulness": "33/37",
                "num_reviews": 37
            },
            {
                "review/text": "from the first sentince this book pulls you in and you do not want to put it down. it feels like you are there in the trench with them.I could not put this book down i read it in two days. it would have been less but work got in the way.This book is a must for a new reader of warhammer 40,000 or loyal fan.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "I'll admit it right away: a significant proportion of the 40K fiction that I've read seems almost as though it's written itself. While this certainly has something to do with how rich the universe is -- and how well Games Workshop has fleshed out so many aspects of that richness -- it can leave Black Library novels feeling a bit stale.I have found very few BL books satisfying -- the only three in the past few years have been the uniformly wonderful Uriel Ventris novels from Graham McNeill. This book was certainly satisfying, but in a much different way.As a child, I read Remarque's \"All Quiet on the Western Front\" and it helped to change my boyish illusions of war forever. This book -- truly, a novella more than a novel --, while certainly not \"All Quiet\" by any means, evokes those same feelings. There is a power in this story that is well-expressed by the soldier who reviewed it: this is how it is. This is not madmen in power armor cleaving through thousands of tyranid monsters while sustaining minor scratches -- it's war.To those that mentioned the unsatisfying ending, the unpolished prose, and the ease with which they were able to put the book down, I ask: do you believe that reality always has a satisfying ending, especially for those that take up arms to protect us? Are you certain that you were not tempted to take up a more formulaic and rosy book, rather than face the harsher ugliness of this one?As for the unpolished writing -- I agree, there were some spots that could have been better edited. However, I question any unfavorable comparison between this and other pieces of Black Library fiction: even the excerpts from \"Gaunt's Ghosts\" included in the Imperial Guard codex itself could have used some fairly heavy editing.In short, I found this book to be a readable, evocative account of life and death. That it took place within the 40K universe is secondary. The story itself was excellent and well-told. In a way, I feel as though this book may, as mentioned by another reviewer, have been a bit darker than other 40K fiction, and therefore a bit mature for the folks who have come to expect the sword-spinning antics of superhuman genetically-engineered monsters.A great book: definitely worth a read.",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "As a active duty soldier in the Army, having served in Afghanistan, and deploying to Iraq within the next week, and a military history buff, I was very impressed with this story. Very true to form with regard to aspects of trench/urban combat, the personalities of the characters/soldiers (I was reminded of several guys I have known), the behaviors and rank structure with regard to heavy casualties, and the knowing belief that \"higher\" has no idea on what the situation really is, the difference between doctrine & reality, etc.The story itself goes quick given the title, the ineptness of command, and several other factors. The slight touch of how an individual's actions have 2nd & 3rd order effects on others, and how long, or short, a time you've been in a combat situation, death waits for you. Patiently.Left me wanting more, especially what happens to the various minor/major players and the objective that is trying to be held/taken, even though it is obvious what the eventual outcome will be.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Imperial Guard... ATTACK!!!Wow.. I've read this book in two days. For me it's fast 'cause I don't have much time unless you count the trips to work and so...This is Mr. Scanlon first book. I think he did an exclent work. I've read the reviews and most of all agreed this is a fast turning book. It's catching and it's not for the feint. I've read some parts that make me feel I was in that battlefield.It remind me some stories about WW I in the trenches. It add some good perpective about the guardsman life and the connection between them and their superiors.There is one part that blow me away and made me tremble..\"From the corners of his eye Larn caught gimpses of the others around him. He saw Bulaven, a lasgun in his hands taken from other Guardsman. He saw Davir. Scholar. Zeebers. He saw Chalker, his expression cool and detached, working the slide of his shotgun to send round after round into the enemy. He saw Vladek. Medical Oficer Svenk. The cook, Trooper Skench, a laspistol blazing in his one remaining hand as he stood besides others. He saw their faces. Scholar drawn yet steadfast. Bulaven dutiful, Zeebers nervous, Davir spiting obscene and angry oaths at the advancing orks. He saw steely determination and a refual to go easily to death. AS he saw it, Larn felt a feelting shame that he had doubted these men when he had first met them. Whatever their manner they were all wahat a Guardsman should be. Brave. Resolute. Unbending in the gace of the enemy. These were the men on which the Imperium had been built. The men who had fought its every battle. Won its every victory. Today, they were hoepelessly outnumbered.Today it was their final stand.(page 227)After reading this book, and before as well I prefer the guardsman stories than to Marines stories.Other reviewer said this was a teeneger writing or something. I agree. It's not like Dan Abnett or Ian Watson. But I guess this \"teenager\" writing made this book even greater. The common soldier is not a writer or poet. I guess that made us see almost from the eyes of the main character. It was good also 'cause the pages were turning even faster.Overall.. If you want to read about a common guardsman and not a hero like Rambo I would reccomend this book.You won't see here a man who have kill 1001 orks while drinking beer.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I tend to read 40k fiction like a voracious predator patroling a feeding ground resplendent with a variety of prey.I had just finished reading the Blood Angels duology and the most recent Ciaphas Cain novel, when I started this one. It required an immediate change in gears from the action-packed, high-energy style and pace of those novels to the slower, more reflective nature of this bleak, but poignantly realistic portrayal of life in the trenches.You KNOW the ending of the story immediately, but proceed to read anyways. It's obvious from the beginning that this will be a story that illustrates the journey of an individual and the experiences that, in the end, bring things full circle to where we began.For those of you with any real-life experience in the military or in life-or-death conflicts, this will have a much more powerful impact on you. Refer to the previous reviews and you will see what I mean.As a simple connoisseur of 40k fiction, I enjoyed this tale. I may not have had the same level of appreciation for it as others, based on my own perspective; but I do acknowledge the talent and craft displayed in this piece of work.It is well worth the read.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love junkfood. That's why I read the WH novels. They're really good junk food for your brain. That being said I was really disappointed with how boring and completely unoriginal this book turned out to be. Don't waste your time with this one lads move on to the Ultra-marine Omnibus.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "Mitchel Scanlon's debut novel is an excekkebt entry into the 40k canon!With the barrage of 40k books out there chronicling the space marines, I thought it was interesting to see a writer take a different approach and offer us a glimpse of the warhammer universe from a more understandable perspective, that of the Imperial Guardsmen.Don't come into this book expecting all of the fantastic and gruesome elements we typically associate with a 40k book. This story is much more intimate, focusing on a fireteam of Guardsmen dug into the trenches of a war they know they're losing, and Larn, a new Guard who, through a tragic, trivial turn of events, is accidentally brought into their ranks and forced to survive the next fifteen hours under their tutelage.Scanlon's writing is simple, effective, and true, and he does a great job of conveying the camaraderie that the Guardsmen share in the face of insurmountable odds and a relentless enemy.Looking forward to reading more of Scanlon's work!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Want realism in you sci fi?Can you handle it?No, it's not always \"fun\", but it seems very close to the truth in a war of attrition. Read \"All Quiet on the Western Front\" by Erich Maria Remarque and then read \"Fifteen Hours\". Or read \"Fifteen Hours\" first, but read them both. Then you'll understand Scanlon's achievement.I wait in rapt anticipation for his next book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This is proper war fiction. There's nothing glorious or pompous here ... its guts and hardship and brooding shadows. The concept works well, and Scanlon is clearly talented ... but something just seems not quite right, somehow. A great read, but it left me a little unsatisfied. Perhaps 15 hours is not enough, after all?",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "james herriots favorite dog stories",
        "description": "Tells the stories of ten dogs, from border collies and sheepdogs to the exploits of Tricki Woo, the unforgettable Pekinese",
        "authors": "['James Herriot']",
        "infoLink": "http://books.google.nl/books?id=Dgk6Rf0hZ1sC&dq=James+Herriot%27s+Favorite+Dog+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you have any passion for animals at all, you will devour this book. It's so sweet and wonderful -- a masterpiece of 20th century literature.Mr. Herriot was truly a gifted writer. His heart could be felt in every word -- he deeply cared for the animals he doctored over the years. Aside from the endearing tails (pardon the pun), he masterfully described the European countryside, the people who belonged to the pets, the pubs he frequented and his everyday astonishing feats of medical marvelry. Yet he was so humble and down-to-earth. His stories are either tear-jerkers or pant-wetters. More than once I found myself nearly crying during study period at college because I was laughing so hard.Some of my favorite shorts were &quot;The Card Over the Bed&quot;, &quot;Tricki Woo&quot;, &quot;Granville Bennett&quot;, &quot;Have a Cigar&quot; and &quot;Mrs. Donovan&quot; -- the latter being my favorite. (Mrs. Donovan was a crone who patrolled the streets of Darrowby trying to cure people's animals quite often causing strife for Mr. Herriot.)The very best thing about this book, aside from it being a quick and easy read, is that the stories are broken up so that you can put it down at any time and come back to it without fear of having lost your place.James Herriot was the master of animal literature. Never have I encountered a more tasteful writer who so accurately depicted the behavior of dogs. I am a huge animal lover having two cats and a dog of my own. I found amazing similarities between the antics of the dogs showcased in this book and my own golden lab, and reading it made me want to cuddle him closer.",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "James Herriot's Dog Stories is written by a man who loves both people and animals. The descriptions of people, dogs, and his humble view of himself are an irresistable combination. The accuracy and wit with which he presents people's relationships with their dogs is priceless. When I read this book, I laugh at the eternal goofiness of dogs and also dog people! The sadder stories are written with a balanced view. This book is an amazing collection of short stories. Highly recommended.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "Do you have a passion for animals? If so, you'll inhale this book. The authors heartfelt emotions can be felt on every page. He clearly adored the animals he cared for over the decades. He described the colorful European countryside, the diverse pets, and the people who owned them in fine detail. Each story is accompanied by an ink sketch that added some warm visuals. My favorite stories were of \"Tricki Woo\", \"Judy The Nurse Dog\", \"Granville Bennett\", and \"Cigar.\" What was nice is that since the stories were broken up, you could not lose your place when you took a break. Yet, I only took one because this was a fast page turner. I have had several dogs in my life and these are the most honest depictions of dog behavior I have read thus far. All animal lovers will enjoy this. Time to hug my dog and adopt another.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "In has been roughly two decades since I read James Herriot's salubrious &quot;All Creatures...&quot; series, yet when I picked up this &quot;best of&quot; concoction, many of the dulcet vignettes were as fresh in my mind as if I had lived them last week. Although trained as a vet, James Herriot had a true gift with the written word. These tales about pets and their two-legged counterparts shine a light deep into the mechanisms of human nature.While he succeeded admirably as an honorable animal doctor and found worldwide fame as a late-in-life author, perhaps he missed his true calling as a psychologist. The humor, heartbreak, and humanity that he so eloquently captures in these stories shows a sagacious mind. It's no wonder that his time on earth brought many smiles and caused many a tail to wag.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This TV vet has put down in words stories of some of his most famous dogs. The characters, both human and canine, are unique and entertaining. His style of writing is concise, and descriptive and passionate.Loved the story of 'Judy The Nurse Dog' who nursed all the other animals in the barnyard, including licking of a newborn calf to nursing a chicken back to health. This sheepdog was true Florence Nightingale of Canine World.Great heroes and such to be found in this great read. All dog lovers will enjoy this one.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I was looking to buy a book for a friend who was getting a new puppy. I thought that &quot;Favorite Dog Stories&quot; would be a good start for both puppy and his owner. But then, I saw the beutiful illustrations inside the book and I could not resist. I read it in a day. And it brought all sort of emotions, because stories were so beautiful. This is an excellent book for both children and adults. I would recommend it to anyone. And you know what - I am a two cats owner. Not even a &quot;real&quot; dog person. Enjoy this wonderful book. Thank you Mr. Herriot for sharing these wonderful stories...",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "If you love dogs, you'll love this book. It is so interesting to get to read about his life with so many dogs that entered his life. He can be very comical through the book and he can make you cry too. His writing makes you feel that you were there with him when the stories happened. It is unfortunate that James is no longer with us here on Earth. God rest his soul.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Part of my 7yr old daughters homework every night is to read 15-20 minutes of a chapter book. I picked James Herriots stories because she loves animals and the stories are heart warming and I enjoy reading along with her.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "James Herriot's Favorite Dog Stories is a short but delightful book written by the world famous veterinarian. It is beautifully illustrated by Lesley Holmes.This book consists of ten stories from Herriot's previous books that feature dogs that he has treated over the years. It's difficult to pick a favorite as they all have amazing personalities. There is Brandy, who is such a scrounger that he gets his tongue stuck in tin cans that he digs out of the trash can. TrickiWoo, a Pekingese, picks winning horses at the races. And Gyp, an epileptic sheepdog, only barked once in his entire life. Although all the dogs have special characteristics, it is obvious that it would take a veterinarian with compassion and humor to see that these animals are more than just pets.I truly enjoyed Favorite Dogs Stories. However, if you've already read Herriot's other books (which I haven't), you will find that they're repeats.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Herriot writes about his favorite patients - dogs! Fifty beautifully written stories take you to his world of loving caretaker for dogs of all social status in Yorkshire. Here is a masterpiece of love and devotion. Stories range from the achingly sad to humorous but never fail to reach the heart.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the literary dog great contemporary dog stories",
        "description": "Gathers stories by Donald Barthelme, Doris Lessing, Raymond Carver, Alice Adams, John Updike, William Trevor, Ann Beattie, and Michael Bishop",
        "authors": "['Jeanne Schinto']",
        "infoLink": "http://books.google.nl/books?id=aaAX7PKgLSoC&dq=The+Literary+dog:+Great+contemporary+dog+stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I will admit, I may not be suitable to write a review: I only read half the book. By that point, I had my fill of short, dark stories that were not about dogs at all, they only used them as a plot device. In fact, in many of these stories, being a plot device is a far less terrible fate. Dogs are shot, trapped, beaten and drowned. How anyone who truly loves dogs could read this is beyond me.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I wanted to be entertained but instead I was disappointed as a dog lover, and a lover of the short story. I continued to read the book because I couldn't believe it could be that bad. If you like dogs, don't waste your time. If you like short stories, ditto.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I think the publisher made the mistake of giving this collection the &quot;look&quot; of a &quot;dog lover's&quot; product. And I can see why it's not a dog lover's book. The cover and the contents don't match. The stories in this collection are BRILLIANT, written by some of today's BEST short fiction artists. To say that a story is depressing should not indicate that it is a &quot;bad&quot; story. If it depressed you, it may then be a very successful story, as it AFFECTED you. That's why the key term in the title of this collection is Literary. The dogs in these stories are indeed &quot;used&quot; but to serve the story in a way that only dogs can because of the tender relationship that exists between dogs and humans. This collection of stories may be, for dog lovers, an education in how to deepen our understanding of dog symbolism, and what it is behind that, and what about dogs has such power on our ideas about them.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Being a dog lover and a lover of literature I was thrilled when I found this book on the store shelf. A quick look at the list of authors and the cover illustrations and I was thinking what a find. This book boasts that it's \"for lovers of good fiction - with a healthy side interest in dogs\". This sounded perfect for me. I was very disappointed reading this book. I found a number of the stories to be uninteresting and I felt a few were very poorly written. While I will admit that a few (and I mean a very few) of the short stories were good the majority of them were appalling to any dog lover that I know and many of them had nothing but a brief mention of a dog in them. It truly is not a book for dog lovers or even remote animal lovers. If I had known what this book was really about, I wouldn't have spent my hard earned money on it and would urge others not to bother. Borrow someone else's copy or see if the local library has a copy but don't spend your money in hopes of some good dog stories because you won't find them in this book. As for the literary value of this book, it might be more highly respected if it wasn't so misrepresented and marketed to dog or animal lovers but I doubt it.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "twentyfive yards of war the extraordinary courage of ordinary men inworld war ii",
        "description": "From the sinking decks of a navy cruiser to the cockpit of a doomed B-25 bomber, Ronald J. Drez takes us to the front lines of World War II. Through Drez's gripping narrative style, we meet twelve men, all ordinary soldiers, and learn what the war was like through their eyes, experiencing their own 'twenty-five yards of war.' The men in these pages represent all branches of the military who were sent on impossible missions, where they witnessed triumphs and tragedies. As a result of Drez's ten years of research and over 1,400 interviews, Twenty-Five Yards of War is a tribute to all of the soldiers who fought in World War II--those who walked away with amazing stories to tell, and those who did not make it home.",
        "authors": "['Stephen Ambrose', 'Ronald J. Drez']",
        "infoLink": "https://play.google.com/store/books/details?id=PN9zDQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book contains accounts of 10 actions in WWII; some famous, some unknown. Some of the more famous actions covered are Doolittle's raid on Tokyo, the battles for Iwo Jima and Betio, and the 82nd drop into Normandy. My favorite account in this book is the little known stand made by Lt. Lyle Bouck and an I&amp;R platoon from the 99th Infantry Division. This untested unit just happened to be at the town of Lanzerath when the Battle of the Bulge started. They were ordered to hold until relieved. The men fought hard until they were killed, overrun, or surrendered when out of ammunition. Although badly outgunned and outnumbered, they managed to hold up advancing German infantry and armored units long enough for engineering units at critical points behind them to blow up bridges and further delay the German advance. Their gallant stand bought time for reinforcements to arrive and stem the tide of battle. This is an enjoyable read and will appeal to anyone with an interest in WWII. The author was instrumental in the research for Ambrose's book, &quot;D-Day June 6th, 1944: The Climactic Battle of World War II&quot;.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "In Twenty-Five Yards of War, Ronald J. Drez tells the heroic stories of 12 men who have shown inspiring courage in their contribution to the United States' World War II effort.It was interesting that those men and all who contributed to the war were named &quot;Warriors&quot;. These warriors were &quot;called upon to bear unswerving allegiance to the nation...and to surrender part of their own rights and freedoms so the people they protect can better enjoy their own. And this service is predestined to be forgotten&quot;. This quote awakened me to the tremendous gratitude that is owed to all those who have unselfishly fought for their country. The warrior theme was appropriately carried out throughout the book. In every story, each soldier, no matter what branch he was in, pushed himself to the limit to get that victory for the U.S. He never worried about whether someone back home would appreciate his deed.The book kept me engrossed in a way that truly made me excited about history, especially World War II. I had learned about the Doolitte Raid, Battles of Midway and Tarawa, Invasion of Normandy, Battle of the Bulge, and Iwo Jima, but the book expanded upon that knowledge in a way that was clear and easy to read. Also, focusing on one person's experience at each of the battles helped me to have a better understand of what hardships and successes the soldiers went through.I encountered, for the first time, information on the development of U.S. submarines, like U.S.S. Barb, throughout WWII. I was shocked at the number of deaths occurring on both sides of the war. After every battle the numbers were listed off in the range of hundreds to thousands of men. It was sad for me to think that each man probably had a remarkable story to tell just like the 12 men featured in the book.Overall, the book was exciting, and was good for me in clarifying basic information. For example, I correlated, for the first time, that The Battle of the Philippine Sea was the same thing as The Great Marianas Turkey Shoot. The book is a good read for someone who is interested in World War II.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I'm an avid reader of WWII history, and found much to like in this volume. It covers 10 significant battles and key people who's actions were important to the eventual Allied victory. Covered are both Pacific and European Theatre battles, giving a good balance. This is a fine book to read if you're looking for a single volume that covers a lot of ground that can lead you to more in-depth books covering the battles that interest you most. The author works with Stephen Ambrose, and this volume is reminiscent of Ambrose' works. Enjoy!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a easy read, filled with many many facts previously not read, and the short stories of various battles, with specific people was EXCELLENT. Best author since Ambrose I've read in years.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "Ron Drez is a US Marine Vietnam combat veteran but rather than talk about his own heroic accomplishments he shares twelve stories of WWII. The Twenty-Five yards of war from the title refer to the individual in combat and how major events of conflict impact the individual. Some of the events such as Doolittle's raid over Tokyo and the sinking of the USS Indianapolis are well known but some of the stories are much less familiar. By seeing events unfold from the soldier, sailor, airman, and marine's perspective you feel like you're part of the battle. The book is well-written and each story keeps your attention. One of the great surprises of this book involved the actions of Navy flyers during the Battle of the Philippine Sea. After the Marianas Turkey Shoot where over 350 Zeros were destroyed, the Japanese made a run to escape. The Task Force 58 commander decided to try to intercept the naval force with airpower but the distances involved meant that the Navy pilots would be flying \"one-way\" missions and ditching at night on the return leg. Almost eighty aircraft splashed into the ocean on the return flight and the next day, half of those pilots were recovered along the path of their flight. You'll learn similar facts in the other eleven stories. You won't be disappointed.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "out of darkness into the light a journey of inner healing",
        "description": "Known for his extensive pioneering in the field of attitudinal healing, Dr. Jampolsky now shares his journey from severe depression, guilt and near alcoholism to a true \"miracle\": an inner healing and infusion of life that was truly against the odds.",
        "authors": "['Gerald G. Jampolsky, MD']",
        "infoLink": "https://play.google.com/store/books/details?id=sAz51xSudUkC&source=gbs_api",
        "review": [
            {
                "review/text": "This book is very easy reading!!! Praise the lord,Gerald was lead to write this book...this is all stuff,that i have known, yet was never able to communicate with others.I have often said if everyone followed the rules of life the world would be a better place...understand one another,love one another,forgive one another,why if ever one loved one another in hole ,there would be no need for forgiveness....This book is not easy to come by were i live,and i can't believe i have never heard of it before now,i just happen to come by it at the libarary. i feel this book goes hand and hand with the bible.,If ever there is a book worth reading ,this is,i know i'm just a little excited about it :)HEY! don't let the bible thing scare you away,it just helps me to understand what the bible is now saying,LOVE =PEACE,if u want peace in your life,here it is.i believe gerald shows even the ones that can't believe in God ,that just a change in thinking can make you a happy person !!!! YEAH!",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "It was not only inspiring, but, it was written with such honesty. I learned so much from this book. It really taught me, what the &quot;ego&quot; mind is all about. Dr. Jampolsky, wrote this book, so that everyone could be aware, how the ego mind works. Clear and simple to understand. Highly recommend this book for anyone who is searching for his/her truth...",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "The editorial reviews above by Publishers Weekly and Library Journal don't do justice to Jerry Jampolsky's greatness of spirit in so candidly sharing his journey. His courage and faith in revealing the utterly dysfunctional legacy of his childhood that he carried beneath his facade as a successful psychiatrist help millions of us to face and heal the same in ourselves. And he gives us the most effective road map for that healing available, in my opinion as a student of A Course in Miracles.For this reason, I give Jerry's autobiography 5 stars even though I wish his editor had been more assertive in asking him to replace his repetitive reiterations of Course principles with more of his potent personal stories that illustrate those principles much more enjoyably and cogently. I humbly read through the didactic parts because I know that the Course is so challenging and our egos so cunning that no amount of repetition is too much. But it was much more interesting and edifying to breeze through his personal stories.I thank Jerry with all my heart for helping me to awaken with this book and with his others (Love is Letting Go of Fear, Goodbye to Guilt, and One Person Can Make a Difference), which I also highly recommend.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I love his books. And learning more about his life was very interesting. A person who lives a ACIM.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the world and other places stories",
        "description": "Oranges Are Not the Only Fruit, Jeanette Winterson's delectable first novel, announced the arrival of 'a fresh voice with a mind behind it,' as Muriel Spark has written. 'She is a master of her material, a writer in whom great talent deeply abides'--and her reputation and accomplishment have grown with each of her five subsequent novels. Now, with her first collection--seventeen stories that span her entire career--Jeanette Winterson reveals all the facets of her extraordinary imagination. Whether transporting us to bizarre new geog-raphies--a world where sleep is illegal, an island of diamonds where the rich wear jewelry made of coal--or revealing so perfectly, so exactly, the joy and pain of owning a brand-new dog, she proves herself a master of the short form. For her readers, a celebration--and for everyone else, a wonderful introduction to this highly original and consistently daring writer, who has become 'one of our most brilliant, visionary storytellers' (San Francisco Chronicle)",
        "authors": "['Jeanette Winterson']",
        "infoLink": "https://play.google.com/store/books/details?id=Tm9JT56h-yEC&source=gbs_api",
        "review": [
            {
                "review/text": "I enjoyed reading Winterson in a short-story form for a change. Working within the confines of a shorter structure lends unusual economy to her generally spiraling imagery; she's more direct and paints with a somewhat broader stroke. I was delighted to experience a wide range of perspectives on a wide range of topics. &quot;The 24-Hour Dog&quot; works on so many levels I want to teach it in a writing class. I'd recommend this to anyone wanting an introduction to Winterson, because here one finds some almost conventional works among stories of almost surreal bent.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Jeanette Winterson is acclaimed as the foremost lesbian writer today. Don't let this title fool you. I'm not a lesbian or gay, and I still appreciate the fine writing I found in The World and Other Places. This book is introduced as a collection of stories. While there are some sort narratives, many of the pieces in this collection could be considered prose poems. In these little portraits, Winterson uses peculiar and striking metaphor to describe the love between people (and even between one person and a dog). Most of these prose-poems linger after you read them, and warrant a second look or closer reading. With vast subjects ranging from time and space and love, it is difficult to grasp the meaning after one quick glance over. Winterson also shows a great deal of breath: the narration and main characters vary greatly as you move through the book. The comments in the narrations have several points that do make you try and interpret what exactly is being said. One of my only gripes is that some of the pieces are very political. Somehow, a few of the stories or prose poems reminded me of the last hundred pages of Richard Wright's Native Son. Rather than telling an interesting story will issues to be discussed, Winterson just latches on to a sort of in your face, &quot;I'm a lesbian, so that makes this special&quot; message, which, rather than being interesting, just bored me most of the time. Other than that, there were really only minor draw backs for me (meaning, maybe I didn't like a story or two. Isn't that expected?). I admit that I enjoy strange stories, so, of course, this book is not for every reader, and I'm sure there will be many reader who do not accepted its slightly bizarre presentation. If there is one that proves that a book is good, it would be that the book makes the reader want to read more of the author's work. This is the case for me after I read The World and Other Places. This is definitely a book to read, if, for anything, to get a different perspective and flesh the kinds of books you read out a little.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "Winterson's fiction is compelling because she teaches a little bit about the physical world while at the same time leading the reader on a spectacular emotional journey. She is like a naturalist of the inner life, pointing out highlights along the way. Her writing is so beautiful it may make you cry.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Having read the rest of Winterson's in-print books this year, this volume of short stories proved a lovely, fitting end. Some were reflections found in her other works (Sexing the Cherry, Written on the Body), some were completely new to me. Just beautiful.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Jeanette Winterson never fails to amaze me. Her stories -- an assortment of ambiguous genders and historical elements mixed with poetic and philosophical undertones and magical realism -- are true literary masterpieces. Having read The Passion, The Powerbook and Written on the Body, I thought I'd give one of her anthologies a whirl. The World and Other Places transcends Winterson's talents in gigantic proportions. My favorite stories are \"Atlantic Crossing,\" \"The Poetics of Sex,\" and \"24-Hour Dog.\" The aforementioned stories are what Winterson is about. She humanizes situations that are otherwise seen as taboo subjects -- and she does so with wonderful literary offerings. I couldn't recommend this gem enough...",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I find Winterson's writing and style utterly electrifying. These various stories, some of which delve into the theme of what one risks reveals what one values, explore a variety of worlds and lives. One or two of the stories didn't resonate with me as much as the others, but overall this collection is marvelous. From the lush &quot;The Poetics of Sex&quot; to the dazzling &quot;Orion&quot; to the delightful &quot;Turn of the World&quot;, these stories border on fables, and reminded me of works by Emma Donoghue, Angela Carter, and Ben Marcus, among others. Such an invigorating assortment that is certain to gratify daring readers.My favorite line is from the story &quot;Orion&quot;: &quot;She realised that the only war worth fighting was the one that raged within; the rest were all diversions.&quot;",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "The story entitled &quot;Newton&quot; makes this book worthy of purchase. Jeanette Winterson continues a streak of powerful, ingenious writing with this collection of short stories.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "As usual, Winterson provides dreamlike, well-written, creative stories. This is not her best work, but still worth reading if you are a fan.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "These stories have re-shaped me with a force equalled only by Salinger's intrusion into my late 60s adolescence. I think. Could be the touching detail and frankness of women courting and loving each other. Could be the tone-poem lyricism, prose style. Could be the spring weather or could be the news. Could be luck, but I'm impressed. Winterson is wide open and she'll likely open you up a bit as well, with love.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "aftermath an anthology of postvietnam fiction",
        "description": "Gathers a collection of fourteen stories that examine the effects of the Vietnam war on the families, lovers, and hometowns of those who served",
        "authors": "['Donald Anderson']",
        "infoLink": "http://books.google.com/books?id=JUAbtAEACAAJ&dq=Aftermath:+An+Anthology+of+Post-Vietnam+Fiction&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book of short stories is an excellent compilation giving a full treatment to various subjects related to war. It looks from different perspectives both during and after the war. In addition to being thought provoking, it is a fun read, and some images will stick in your head for years! Donald Anderson teaches Creative Writing at the Academy (I took his class!) and I look forward to more work from him.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is an excellent collection of short stories that take on the meaning of the war in a way you've never experienced.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "wow the big picture the bible in 7 minutes a day",
        "description": "This Bible presents the \"mountain peaks\" of Scripture--the main stories, people, and principles of God's Word in 365 daily readings.",
        "authors": "['J. Carl Laney', 'Jeff Schulte', 'Lloyd Shadrach']",
        "infoLink": "http://books.google.com/books?id=MN0UKwSmCF0C&dq=WOW:+The+Big+Picture+-+The+Bible+in+7+Minutes+a+Day&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is terrific. Not the &quot;Bible-lite&quot;. It's the whole message of the Bible in only 7 minutes a day. Now I have a workable plan to read through the whole Bible in a single year. 7 minutes a day? That's something even I can handle.",
                "review/helpfulness": "17/23",
                "num_reviews": 23
            },
            {
                "review/text": "Are you one of those people, like me, who've tried to read the bible but get distracted by all the \"details\" and then a chapter later, realise what the actual story line is? Well, this book is the perfect solution. Each day you get the \"main gist\" of the bible story in a few condensed bible paragraphs. This book gives you a great understand of the message the Word is conveying easily and clearly. My appreciation of the bible stories from this book has help fuel my pursuit of comprehending the bible. Each day also gives you a few verses from Psalms for worship and Proverbs for wisdom. And the end of each day is the question \"So what?\" to make you think about how this story should affect your daily life. I think it's a great book and really appreciate it. One con is that each day is not dated like Oct 1 or April 15. Each day is titled Day 5, Day 322, etc. But that's the only con. I just keep my bookmarker in place and go to the next day. I hope you enjoy this book as much as I do. My knowledge of the Word has increased exponentially. Thank you WOW team!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "even more short and shivery turtleback school library binding edition",
        "description": "A collection of scary traditional tales from all over the world.",
        "authors": "['Robert D. San Souci']",
        "infoLink": "http://books.google.com/books?id=oq-eAAAACAAJ&dq=Even+More+Short+And+Shivery+(Turtleback+School&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Even More Short and ShiveryBy: Robert D. San SouciHave you ever read a book that you were afraid to read because it was so frightening? For me this book was just like that. In my book there are forty- five scary stories, but I think the scariest one was \"Knock, Knock, Knock.\" It's about this girl and her boyfriend that were going out to eat, but their car dies. It was a stormy night and a notice on the radio said that a crazy guy was on the loose, but the had to find a repair shop for their car. So her boy friend said he would go find one and when he came back he would knock on the car door three times. (spoiler)Another spooky story was called \"A Night Of Terrors.\" The story is mostly about a young girl and her dog. There is another scary maniac on the loose again and the girl is at home with her dog. She was feeling really depressed and her dog was under the bed. She put her hand down over the bed and he licked it as always. Then suddenly a police man burst in the door and told her she had to get out of the house.(spoiler) .For me this was a really great book but my favorite short story was probably \"Knock, Knock, Knock,\" because it seemed the scariest. The story I didn't really like was, \"A Night Of Terrors,\" because it was really creepy and kind of sad. (spoiler) The characters in the story were either dead, scared to death, or completely crazy. I'm not sure if I want to read this story again, I probably have nightmares or just be freaked out.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "You may think ghosts are real. Some think they never exested. But maybe they do. Read this book before you judge. This book doesn't really tell you if they are real or not. This book tells stories about ghosts, and did a great job. If you don't like scary stories that much that is ok. This book isn't that scary, but to some people it may. I only have read a couple of stories but those were great stories. They didn't frighteen me a bit. Only some parts did. But believe me it is a terrific book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I've been infatuated (and terrified) of scary stories ever since I could read. So it's no wonder that as soon as I picked up my first copy of Short of Shivery at my Elementary School Library, I had a difficult time putting it down. Even now, some odd 10 or 15 years later, I still love picking up these books at reading them again and again.The stories are always fresh and colorful, (though some may be a bit tedious for younger kids) and the accompanying illustrations provide an excellent atmosphere to the book. Of course, it's 10 times more frightening when your 7 and suddenly the Murdering Rampage of some psychopath or ghost pops into your head while your trying to sleep, but in general, even adults can appreciate the folklore and mysticism of these short stories.For any lover of urban legends, folklore, ghost stories, or paranormal, I'd definitely recommend this for a read.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "handbook of applied dog behavior and training vol 1 adaptation and learning",
        "description": "Twenty-five years of study and experience went into the making ofthis one-of-a-kind reference. Veterinarians, animal scientists, dogowners, trainers, consultants, and counsellors will find this booka benchmark reference and handbook concerning positive, humanemanagement and control of dogs. Reflecting the author's extensive work with dogs, this bookpromises thorough explanations of topics, and proven behaviouralstrategies that have been designed, tested, and used by the author.More than 50 figures and tables illustrate this unique andsignificant contribution to dog behaviour, training, andlearning.",
        "authors": "['Steven R. Lindsay']",
        "infoLink": "https://play.google.com/store/books/details?id=zZcMxLKpM0UC&source=gbs_api",
        "review": [
            {
                "review/text": "I am a \"pet dog owner\" who became fascinated by training and how dogs learn. Lindsay's book is a godsend. Having read a lot of the dog literature over the last 15 years, including struggling through some of the classics like Scott and Fuller, I was left with questions about what theories and practices were valid, and which had been superceded by further research that perhaps I hadn't discovered yet.Lindsay puts the entire science of dog training and behavior into perspective, with astonishing completeness, brilliant organization, and elegant writing. He sorts through the history of our knowledge of dogs, discriminating between that which is good science and that which is not-so-good science. He compares and contrasts the theories and experiments of every person who has had anything to say that's relevant to what we know about dogs, including those from the fields of human and other species learning.I especially appreciated the outlines at the beginning of every chapter, and the bibliographies at the end of every chapter (as well as at the end of the book). Some of the content is of special interest to me, and he makes it easy for me to go straight to the original sources.His discussion of aversive training is outstanding, clarifying what has been a much misunderstood area in the last few years. And in spite of the scientific approach (\"what do we really know\"), Lindsay is able to discuss the softer issues of animal awareness and mysticism with touching grace.The sheer quantity of literature that Lindsay has read and digested - and summarized for our benefit - is absolutely mindboggling. This book is a must-read for anyone who has a serious interest in dogs.",
                "review/helpfulness": "73/73",
                "num_reviews": 73
            },
            {
                "review/text": "The author succesfully tries to offer a thorough and detailed view of what is known and what isn't known about dog behavior and learning. His approach is above all scientific, which doesn't mean he avoids phenomena like ESP etc., nor does he simply give a description of the autorities' viewpoints. Lindsay also carefully analyses everything commonly accepted by laymen and experts, without resorting to emotional arguments. His systematic and straightforward 'nothing to hide' approach as well as his concern to include all practices and opinions certainly makes this book an authoritative study which counterbalances a lot of 'extreme' books on dog training (like Jean Donaldsons controversial book 'the culture clash' or the Koehler books).For everything said in the book, scientific research and logical reasoning serves as basis, and sentimentality doesn't get a chance. Lindsay clearly stresses the reasons behind behavioral tactics and leaves the choice to the reader, providing all scientific facts necessary to support your decision. His view on the use of aversives is the most enlightening and waterproof explication I've read on why, how and when to use it -- or not...Lindsay concentrates a lot on theoretical models to understand all kinds of phenomena. He never annoyed by giving too much information. Monuments of psychology like Skinner and Thorndike are equally critically analyzed as less famous men and at all time Lindsay remains consistent in his application of a thorough scientific approach to clearify and explain.It isn't a cheap book, but it certainly lived up to my (high) expectations. The reference section at the end of each chapter provides a good means of exploring more studies and Lindsay doesn't hesitate to give suggestion for further reading. He acknowledges without hesitation the accomplishments of other people without idealizing them (he criticizes Skinners and Thorndikes view on punishment etc.).I think it will take a long time before a more open and thorough book on dog behavior will appear. Therefore, if you want a book that gives a complete and detailed account of what is known on dog behavior and that provides a solid basis to expand your knowledge (even very rare phenomena are treated in detail), I would certainly recommend this book. The only negative thing about it I could think of, is the price -- and even then...",
                "review/helpfulness": "66/67",
                "num_reviews": 67
            },
            {
                "review/text": "I got a new puppy about 6 months ago. This was just about a 2 year process that involved searching out a specific breed that fit my personality and lifestyle and reading piles (Probably $500 worth) of books about raising puppies, training, specific breed books, etc. Mainly because I have always been deathly afraid of owning that unruly dog would be a nightmare to have around the house.Of the 20 books that I have, this book is by far the most in depth and well researched of all. Most books on the subject of dogs in general are short overviews that should take care of some specific needs, such as potty training, obedience, tricks, etc. This book has a culmination of 100+ years of scientific research and other case studies of not only dogs but of the behavior mentally and physically of other creatures and how they apply to dogs. There is so much information to soak in, its incredible. I read through it occasionally had to sit back in awe thinking about what i've just read and how many things make sense now.I seriously think that most books will get 90% of dog owners by without a problem. This book is for those 10%, or breeders, trainers who need to have that extra level of knowledge. I'd compare it to needing a cupfull of knowledge and receiving 5 gallons instead.",
                "review/helpfulness": "38/40",
                "num_reviews": 40
            },
            {
                "review/text": "The first thing to know about this book is that it is not an \"easy read,\" but more of a textbook. That said, it is invaluable reading for professional trainers--in fact, I am on the faculty and advisory board of the Companion Animal Sciences Institute and Lindsay's books are required reading in many of our courses. The Handbook of Applied Dog Behavior and Training should appeal to canine professionals as well as anyone looking for an in-depth analysis of canine origins, neurobiology and behavior. This is the first of Lindsay's comprehensive three-volume set. It begins with the origins of dogs, covers the neurobiology of behavior and learning, and sensory abilities of dogs. The behavior section goes to great lengths describing classical and operant conditioning, the effect of aversives on behavior, and much more. A multitude of fascinating studies are referenced throughout the book. Again, although this book is more technical and dense than most on the subject, it is an invaluable resource that you will find yourself referring back to again and again.- Nicole Wilde, author So You Want to be a Dog Trainer (2nd edition) and Help for Your Fearful Dog: A Step-by-Step Guide to Helping Your Dog Conquer His Fears",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "Mr. Lindsay has compiled a thoroughly researched, well written tome, that is perhaps the best book on canine behavior I have ever read. Readers who enjoy detailed manuals respecting the reader's attention span, intelligence, education, literacy, and quest for knowledge will cherish Applied Dog Behavior and Training. The book is sufficient as a textbook at the graduate university level. For readers interested in learning intricately about the developmental history of domestic dogs, ontogenetics, neurophysiology, sensory physiology, canine psychology, learning theory,and training/conditioning theory this book is nonpareil. Moreover, the book is insightfully organized and formatted so it as easy to read as possible given the depth and breadth of the text and concomitant illustrations.Nevertheless, unfortunately, Mr. Lindsay's book is not for everyone. In fact, it is probably appropriate for very few pet professionals and even fewer pet owners. The book is written tantamount to the materials utilized within a Master's or PhD program in biology, psychology, zoology or animal behavior. Although I am enthralled with the book, I believe most persons will be fatigued by the amount and complexity of information.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "I'm not a professional trainer, just a lifelong owner of multiple dogs. I also volunteer at a humane society, so I interact with a wide range of dogs on a non-professional level. Material in this book helps provide the foundation for understanding what trainers are doing and why it may work--or not! If you plan to be a professional, this book is a must.The only downside to this book for some people will be that it is written at the collegiate level. It reminds me of any number of psychology and biology textbooks in college courses--the comprehensive ones that cover the genre from start to end! I end up taking notes while I'm reading, because there is so much there that I want to integrate into my approach. He presents information, shows how it can be applied to practice and proves his points with studies. Actually, sections are eerily applicable to human interaction. I'm a firm believer in using evidenced-based science guide practice, and Lindsay is exacting and detailed. He doesn't preach as much as present research and draw conclusions.I only regret the generations of wolves and dogs that had to suffer to gain this knowledge. Read it and apply it, because some of the studies done to gain this knowledge could never be ethically replicated again (such as over-reactivity in sensory-stimulus deprived environments).Contents include:Origins and Domestication (of dogs)Development of Behavior (in puppies)Neurobiology of Behavior and Learning, which includes sections on motivation, fear, aggression, attachment and compulsive behaviors (see how interesting all this is!)Sensory Abilities--knowing the dog's abilities helps target learningBiological and Dispositional Constraints in Learning--has interesting sections on genetic strains with breeds and within breeds such as the 'nervous pointers'Classical ConditioningInstrumental LearningAversive Control of Behavior, including avoidence learning and punishmentLearning and Behavioral DisturbancesHuman-Dog Companionship--the signficance of the relationship between people and dogs, and when it breaks down.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is book has a wealth of knowledge. It addresses formal behavioral analysis and dog anatomy in a text book fashion. The strength of this book to me was how it covered each topic micro and macroscopically. I have heard many conflicting beliefs with respect to interpretation of dog learning. Each opinion is addressed and supported by scientific study here and not just taken left to the \"because I said so\" sort of logic I often hear. This is a dense read. It covers many subjects I had no clue that I may even care about but I took a lot from it. I look forward to reading volume 2 & 3.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I'm a dog owner and enthusiast in dog training and behavior. I've read some \"lighter\" books on the subject, and kept asking for more information. It took me a long time to decide on buying this book, because 1.it's expensive and 2.I thought maybe it would be too rough a reading. I decided to order the 1st volume, and when it got to my house I just couldn't stop reading. There's so much information, and the text never got boring as I thought it could.So, it is for people who are SERIOUSLY interested in dogs, its origins and behavior. Not for the regular pet owner, but for those owners who MUST know more, and definetly for trainers. There are no tales in the book, only serious information and reviews of many theories on the subject.I'm very satisfied with the information I'm getting from this book, and pretty sure I'm going to order the other volumes. There are some pictures in this book (only to elucidate issues mentioned in the text), and I thought they could be clearer. That's my only complaint.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is excellent. I have been training dogs for the last 5 years and I wish I had read this book before. The book provides tons of information about learning process. The book has a lot of topics, and it is noticed that he made a very deep investigation. Something that I really like about the book are all the references that you can consult if you want to make a deeper investigation by yourself. The book is not easy to read, because it has a lot of technical (medical) terms. In some cases I had to look up in medical dictionary some definitions to understand the book. I will read the other 2 books soon.This is a book that a dog trainer must read. For a dog owner probably it would provide information that could be called nice to know, but it will help you to have a better understanding of your best friend.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "it was on fire when i lay down on it",
        "description": "From the author to the reader: Show-and-Tell was the very best part of school for me, both as a student and as a teacher. As a kid, I put more into getting ready for my turn to present than I put into the rest of my homework. Show-and-Tell was real in a way that much of what I learned in school was not. It was education that came out of my life experience. As a teacher, I was always surprised by what I learned from these amateur hours. A kid I was sure I knew well would reach down into a paper bag he carried and fish out some odd-shaped treasure and attach meaning to it beyond my most extravagant expectation. Again and again I learned that what I thought was only true for me . . . only valued by me . . . only cared about by me . . . was common property. The principles guiding this book are not far from the spirit of Show-and-Tell. It is stuff from home-that place in my mind and heart where I most truly live. P.S. This volume picks up where I left off in All I Really Need to Know I Learned in Kindergarten, when I promised to tell about the time it was on fire when I lay down on it.",
        "authors": "['Robert Fulghum']",
        "infoLink": "https://play.google.com/store/books/details?id=4TfPpi0uaVUC&source=gbs_api",
        "review": [
            {
                "review/text": "I extensively mark books that move me, motivate me, inspire me, and instruct me. I have virtually no marks in this book. It reminds me of the communicators who know how to play with an audience's emotions, but when they're gone, there's no substance. This book will move you emotionally, but it doesn't really leave you any better off in the long run.Fulghum has the gift of communication. He can tickle your emotions, but he just doesn't say much when he's through. His book is full of personal anecdotes. Nothing wrong with that, per se. A lot of storytellers have made a fine living that way. If that's what you want, escapism, then you'll find it in this book. It's just that Fulghum and I apparently don't have the same worldview or appreciation for the same things.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "With great wit and gentle grace, Robert Fulgham holds up a mirror so that we may see ourselves and our foiables more clearly. He has a unique ability to point out the treasure of the little things, the common things in life. After reading one of his books, I feel more serene, more appreciative of my blessings, and smile at the memories he has helped me recall. If you have not been &quot;stopping to smell the roses&quot; this book will help you start. Enjoy!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This book is simliar to ALL I REALLY NEED TO KNOW I LEARNED IN KINDERGARTEN in consisting of several dozen short, easily readable, reflective essays. I liked his first book a little better - I thought the overall quality a little higher. There are, however, many fine pieces in this collection (including one commenting on the theme of his first book that is brutally honest). The mood is a bit darker in this second volume, but that is not meant as a perjorative description, it merely means that Fulghum shows a different side to his ponderings. If you liked his first book, you will like this one. If you didn't, then you won't like this one either.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This was my first introduction to Robert Fulghum and meeting this humorous man was truely enjoyable. Like many personal accounts on life, there were things that he writes about I found touched me deeply and others that were just interesting. It was a pleasure to take a peek into his world of &quot;show and tell&quot; and compare it to my own. Robert Fulghum's perspective is healthy and positive and he even redeems himself with the dog population in the credits at the back of the book. His humor added a dimension to some of his tales that made them truely memorable &quot;lessons of life.&quot; A book to make you laugh and cry.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "Robert Fulghum has a magnificent sense of humor, which contributes greatly to his skill as a writer and speaker. With his Unitarian sense of the world, he sucks us in...even when we don't realize we are being sucked in. He captivates our imaginations and emotions and much like our friend from Lake Wobagon, he makes the everyday come alive with excitement.It's well worth your time to read this book.Jeffrey McAndrewauthor of &quot;Our Brown-Eyed Boy&quot;",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "I must confess that, when I heard that this was a bestselling collection of inspirational anecdotes and essays by a minister, I was prepared to be skeptical. I was expecting oversimplifications, sentimentality and proselytizing.In fact I found myself moved to laughter and sadness.It is indeed written in simple language, but it is the simplicity of the clever writer. Fulghum quotes from Horace in Latin and from the Septuagint in Greek, and describes attending a talk on chaos theory at the American Association for the Advancement of Science, but makes it all sound plain and easy.He mentions \"Apocalypse Now\" but not the Book of Revelations. He is a long way from original sin and Calvinism. I think the central message is that there is much good in people and you can bring it out by being patient and being nice to them. I was almost convinced.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "If you've read my other reviews, you know I am a HUGE Robert Fulghum fan. He is my mentor - the reason I began writing my first book that got its first contract. This book is almost funnier and better than the one before, if that's even possible, but only almost. This book inspired me and made me think, made me cry, and made me laugh. You can't ask for a better read than that!The title piece of the book talks about a man who was interviewed by the news for a house fire. The question posed to the man was how the fire, which was in the bedroom, from the mattress, had started. The man had answered that he didn't know how the fire had started, since the bed was in fire when he lay down on it. Mr. Fulghum talks about how we do that, sometimes: lay down on burning beds. This is, of course, a metaphor for us making poor decisions, decisions not in our best interests, when we know this is the case when we're making them.And that is the best example of what Mr. Fulghum's writing in all his essays and books I've read have been, including this book. It Was on Fire When I lay Down on It is a series of poignant memoir-style essays, each with their own metaphorical 'lesson' or moral to them... some are touching and moving while others are giggle and snort funny, but all of them speak to a bigger picture or a deeper meaning if you're willing to look beyond the implied. Well worth the read.I agree with some about his attitude about dogs. I am a dog lover. My Jake is my son, my furry fur-legged brat dog and I love him dearly, but I can't see discrediting an entire man and his entire library or work and contributions to literature, reading, faith and humor just because his opinions differ from mine on one point. The stories he tells are not graphic in nature about his dislike of dogs, so I take those with a grain of salt and move on to the other more poignant things with which I can relate. I will never agree 100% with anyone on everything, and this is simply a point of division in mind between me and Mr. Fulghum. To stop reading him for his personal opinions when he is doing no physical damage (it's just opinion), is something I'm not wont to do.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book has touched me more than any other one I've ever read. I sometimes refer to it as my personal bible. Fulghum's ideas on the simple things in life always give me hope that life isn't as bad as I sometimes think it is. This book will make you think about things in a different way. Personally, I carry it with me wherever I go and use the stories to apply to some of the hardest subjects in life.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I started reading this book on an airplane...and in some ways I wish I hadn't. I was laughing and laughing at the sheer unexpectedness of this book, shaking the entire row with my convulsions. I think some were trying to figure out if I were laughing or crying, as I had tears running down my cheeks. The stories were a total surprise to me, for I didn't buy this book for the humor. I actually bought it because a friend had told me one extremely meaningful story out of the book, regarding the meaning of life. In essence, this story-ette is about a priest and his meaning of life, and a small mirror...he believes the meaning of life is to bring light to dark places, a game he used to play when he was a kid with sunlight and a mirror. That game has become a metaphor for his life. So I bought the book for that reason, for a few little pages. But now 1/2 way through the book, it has entertained me way more than expected.The book is written in article form, with each story-ette lasting 3 to 7 pages, so it makes for excellent bedtime reading. FYI, this book and the writing remind me of Bill Bryson, and his writing style.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "mortal engines a continuum book",
        "description": "Stories ranging in tone from slapstick to pathos and in mode from fantasy to realism probe the implications and consequences of the creation and deployment of artificial intelligence. Bibliogs",
        "authors": "['Stanisław Lem']",
        "infoLink": "http://books.google.com/books?id=160crILVPO8C&dq=Mortal+Engines+(A+Continuum+book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is surely one of the greatest collections of 'linked short-stories' ever written -- it matches Calvino's COSMICOMICS and Borges' LABYRINTHS. Lem is a total genius. A writer of playful little fables that are also philosophically profound (and logically consistent). This book is a brilliant companion to Lem's THE CYBERIAD, with which it shares many themes and ideas. Lem has a beautiful style: he can make engineering terms sound poetic. His rigorously modern metaphors are as original as those of J.G. Ballard, but more varied and lyrical. For Lem, the Periodic Table is an unwritten poem. This book is the final and true ode, and each line is a fantastic, fabulous, incredible story. I give this book 200,000,000 stars. And that's only because I'm not feeling so generous today. It probably deserves A GOOGOLPLEX (1 to the power of 100 raised to the power of 1 to the power of 100) of stars. At least.",
                "review/helpfulness": "16/22",
                "num_reviews": 22
            },
            {
                "review/text": "The first dozen stories in this book are brief, amusing, and very clever. Most of them start in the traditions of fairy tales, with bold knights, beautiful princesses, powerful kings, and deadly dragons. As in traditional fairy tales, some describe great quests, while others narrate hubris and downfall. The difference is that every story is peopled (if you'll pardon the term) by robots. It creates a grand setting for Lem's adventures and warmly humorous inversion of all the old storytelling.The final two stories, though, are the real gems of this collection. They are longer, they feature humans as well as robots, and are serious, even somber in tone. One is told by a human, part of the party that has to hunt down a dangerous robot across the stark surface of the moon. The teller finds the rogue in the end and fells it, but something in that last moment turns it from victory into completion of a much more ambiguous kind. The final story, \"The Mask,\" is a sensitive look into a man-made mind. It conveys real complexity in the robot's sense of its own life. One of the story's many readings is a warning that, even if the feelings are carried in metal cases, they're as real to the minds feeling them as ours are to us. Creating a mind that can feel such feelings imposes a responsibility on the creator - a responsibility not met in this chilling story.This is Lem at his best, and his best is very good. The happy satire of the first stories is some of Lem's most amusing. The conjecture in the last story is some of his darkest. The set as a whole shows Lem's range as a writer, even within the constraints that unify this wonderful collection.//wiredweird",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The title of this assembly of stories is the translator's clever triple pun: an allusion to Othello, \"mortal engines\" are manmade, impermanent, and sometimes deadly machines--robots, to be exact. Included are all the tales from Lem's \"Fables for Robots\" and three other stories (\"The Sanatorium of Dr. Vliperdius,\" \"The Hunt,\" and \"The Mask\") that double the size of the book.The fables are like--well, fables. That is, the prose style resembles Aesop or Andersen (\"Once there lived...\"); the narrative recounts long-ago events; and each tale presents a message--or, at least, a lesson for us humans disguised as a moral for them robots. These eleven shorts recall Borges (or even Poe) at his most playful, but read in sequence they tend to become a tad formulaic (several robots are sent on a mission; each fails, but the last one succeeds). And if you're a lover of science jokes, these stories will be your playground; Lem packs references to chemistry, physics, geology, computer science, and electronics--often in the same sentence: \"self-motes came from distant lands, like the two Automatts, vector-victors in a hundred battles, or like Prostheseus, constructionist par excellence, who never went anywhere without two spark absorbers, one black, the other silver; and there was Arbitron Cosmoski, all built of protocrystals and svelte as a spire....\"If, like me, you prefer a little more story and a little less pun, you'll find that the gems of the book are the three bonus tracks. The last two, in particular, are among the best I've ever read by Lem, and have nothing in common with the fables other than the automaton theme. \"The Hunt\" is a rollicking adventure story featuring Lem's famous alter ego, Pirx the Pilot, on a mission to destroy a homicidal robot. \"The Mask\" may well be the best Lem story I've read: the haunting stream-of-consciousness of a robot who, like an otherworldly Tristram Shandy, narrates its own birth, consciousness, self-realization, metamorphosis, rebellion, and--above all--its futile pursuit of love. The opening pages have a deceptively languid pace, until the robot sheds its \"mask\" (in a surprisingly squeamish scene) and, during the ensuing chase, reveals its lethal assignment. These last stories are worth the price of the whole book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the undivided self alexander technique and the control of stress",
        "description": "Outlining the basic principles of the Alexander Technique--the objective of which is to gain conscious control over one's actions--The Undivided Self challenges the concept that mind and body are interacting systems. Once we become aware of damaging patterns, we can learn to break these habits and establish a new, beneficial approach to health that will help control and prevent anxiety, pain, and distress.",
        "authors": "['Theodore Dimon']",
        "infoLink": "http://books.google.com/books?id=cfU7zgCwJ5wC&dq=The+Undivided+Self:+Alexander+Technique+and+the+Control+of+Stress&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the finest book available explaining the deeper significance of the mind/body work done by F. Mathias Alexander, creator of the Alexander Techinque. But what I liked most about reading it was its wonderfully fresh perspective on age-old human problems. For thousands of years, philoshophers have pondered the human condition from the standpoint of someone sitting under a tree. What Dimon sees is that perhaps our greatest gift is our ability to decide to get up. From his perspective, how and where we go tells us more about who we are than we might ever have thought possible. I urge anyone curious about life and eager to improve his or her own to give this book a try.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Ted Dimon has written the definitive mind/body book, explaining how it is possible to reduce stress and tension by learning to gain a greater awareness in living. He articulates his view by conceiving of mind and body as a functional system which can be brought under conscious control, making possible, not simply therapeutic improvement in health, but the potential for becoming fully conscious of action and behavior. The book also provides the foundation for a theory of stress that recognizes the possibility for education, and not treatment, as the basis for identifying the causes of stress.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "AS A PSYCHOTHERAPIST I AM ALWAYS SEEING THE DISASTROUS EFFECTS OF THE MIND AT WAR WITH THE BODY. I HAVE ALWAYS URGED MY PATIENTS TO TRY AND INTEGRATE THE ALEXANDER TECHNIQUE AS PART OF THE THERAPEUTIC PROCESS TO RESOLVE THIS BATTLE. THEODORE DIMON, A NOTED ALEXANDER PRACTICIONER AND TEACHER (WHO HAS HIS OWN SCHOOL IN BOSTON) HAS WRITTEN A BOOK ANYONE INVOLVED IN HEALING THE MIND BODY DIVIDE MUST READ. IT WILL HELP PATIENT AND HEALER ALIKE. I URGE PEOPLE TO READ IT AND FIND OUT MORE ABOUT THE ALEXANDER TECHNIQUE.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Where F. M. Alexander's own writings read almost like philosophy, Dimon's book is more grounded, with the feel of a psychology textbook. It's a distinctly objective approach, an argument for the Technique with the logical impact of a medical journal.Cautious or skeptical people who hear the success stories of others who have overcome physical problems with the Alexander Technique say, &quot;OK, so what is the technique? How does it work?&quot; It can be hard to get a straight answer - it's a complicated issue, and in any event the only way to really understand the Technique is to experience it for yourself with a teacher. If an intellectual introduction is what you're after, though, and if your approach to this sort of thing is more empirical, this is the book for you.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the warriors reflections on men in battle",
        "description": "J. Glenn Gray entered the army in May 1941, having been drafted on the same day he achieved his doctorate in philosophy from Columbia University. Over a decade after his discharge in 1945, Gray began to reread his war journals and letters in an attempt to find meaning in his wartime experiences. The result is a philosophical meditation on what warfare does to us and why soldiers act as they do.",
        "authors": "['Jesse Glenn Gray']",
        "infoLink": "http://books.google.com/books?id=hhn5ku4X2tcC&dq=The+warriors%3B+reflections+on+men+in+battle&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Gray served in the intelligence service in the American army in Italy in WWII, after receiving his doctorate from Columbia. He saw many things he despised, yet was surprised to note that war also had its delights. On reflection, he realized that was logical. Without positives why would we war? This book details the seductive elements of war, explaining some of the feelings many of us have in viewing and studying combat of all sorts. Without understanding those feelings, we are more likely to dismiss them as only shameful and deceptive. Understanding them will help us, Gray hoped, to avoid the terrible cost of seeking them by warring again. This is probably the best book on why we war and the surprising things war teaches us about ourselves ever written. And its style is neither pedantic nor abstract but engaging and enriched by memorable stories and wisdom.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "I haven't read this book for twenty years but it still sparkles in my memory. It is one of the two or three best books on war. Grey has a marvelous writing style, a penchant for thought-provoking observation, and the discipline that allows a philosopher to see, but not pre-judge. You will be challenged by his fairness, surprised by the things he saw (that few others have described), and stimulated to think again about one of the most important of recurring human events: War. Excellent, engaging, intelligent.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "To begin praises of this book is hard, because as a man who has never been in combat, I hesitate to speak on matters so foreign to my experience.But J. Glenn Gary leaves me stunned and humbled. The amount of pure excellent reflection in this book was utterly wonderful, and I left with a real sense of understanding nothing else has accomplished. It is clear Gary has created a book that is more complete a discussion of battle as any man alive.Rarely is a book worthy of cult status. This one is.",
                "review/helpfulness": "17/20",
                "num_reviews": 20
            },
            {
                "review/text": "Gray's book gives us a chance for a better understanding of what men face in the battle with themselves while in war. A very different view as oppposed to movies and text book history, where all the American soldiers were hero's with little or no fear. Gray does an outstanding job of making someone who has never been in the hell of war, understand why soldiers act the ways they do. An excellent read for any war student or historian.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "One of the reviewers stated it was one of the worse war books. That's not surprising, because this is not a 'war book.' You will not read of battles, etc. Instead, you will read an excellant account of the mind and emotional spirit of the fighting man. This is not an easy read, but is well worth your effort to read it. Never before has an author described the conflicts of mind and conscience (or lack of) of the warrior, the combat veteran. I gave 4 stars only because J. Glenn Gray writes in a manner that surpasses my reading ability. This is a great book.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a deeply personal and thoughtful reflection on the subject of men in battle. While its style displays the academic training of the author, it is really the story of his own search for a philosophical understanding of his experience as a soldier in World War II. While not insistently theological, the author seems to believe that war is included in God's providence and redemptive activity. The strength of the book is the writer's passionate investment in the subject, and his willingness to struggle honestly with the questions facing every warrior.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "It is all too easy to understand why a book this good is ignored today; post-modernists cannot even agree that there is such a thing as an objective world, let alone establish that it is inhabited by human beings or justify claims that they engage in a violent practice known as warfare. What is less easily fathomed is the fact that the book has never really garnered much attention, something that Hannah Arendt comments on in her rather disappointing introduction to this fine book.Gray's \"Warriors\" is that rare combination of lucid intellectualism and poignancy that ought to be an immediate success with readers, yet the book remains obscure (indeed, I had to order it since my local seller didn't stock it). Ironically, it addresses many topics that should be of interest to contemporary scholars: trauma and what we now call PTSD, memory and forgetfulness, objectification, guilt.... Gray also ruminates on what he calls the appeal of battle. At various points I was reminded of the psychological insights of Robert Jay Lifton, whoseThe Nazi Doctors: Medical Killing and the Psychology of Genocideintroduced the idea of \"Doubling\" (as Lifton calls it). And there is plenty of evidence for Lifton's psychological theory in this book, though Gray doesn't refer to it as such.What makes Gray's book so impressive is his ability to remain critically aloof and emotionally close to his topic at the same time--a very tricky proposition that he pulls off marvelously. He very smoothly juxtaposes passages from Plato and Shakespeare to those from his own personal letters or war journal, the latter of which is moving without ever being maudlin or depressing.If Gray's last chapter, \"The Future of War,\" seems dated and hopelessly optimistic, I think we can forgive him. Gray, like the existentialists who were his contemporaries, cites Nietzsche here, but unlike them, he suggests that one day we may have the superhuman strength to \"break our swords\" once and for all. Sadly, as our present world stage confirms, ubermenschen we still are not.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Glenn Gray's The Warriors is not an easy read. The analytical writing style will not appeal to readers that are looking for exciting anecdotes of battle from WWII. What we have instead is a look at the range of attitudes different soldiers have toward battle, love, death, the enemy and guilt. What some readers might derisively describe as \"moral equivalency\" on Gray's part, is really objectivity, born perhaps of his academic experience in garnering a doctorate in philosophy from Columbia University.What gives this book its real value is that Gray's academic thoroughness is combined with a keenness of insight into human nature. He deftly catalogues the gamut of psychological and emotional conditions that are manifested in the behavior of men in combat. One of his major conclusions, that men fight, not for their country or lofty ideals, but for their \"comrades\" in arms, should come as no surprise to anyone well read in infantry memoirs from WWII. I place quotes around the word \"comrades\" because Gray assigns to that word a very specific meaning.As for drawbacks: There is no index, footnotes or bibliography. Also, the last section on \"The Future of War\" could have been omitted since it seems too optimistic and utopian in tone compared to the grim realism of the earlier chapters.The Warriors is an important book for anyone wanting to look beyond the cheerleading of the \"Good War\" or \"Greatest Generation\" and see what really animated the men who fought in WWII. As the author says, it is war that compresses the greatest extremes of the human condition into the smallest of ranges in time and space, and no more so than in the unprecedented savagery of WWII.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "worlds of clifford simak",
        "description": "Earth: expensive, elite graveyard to the galaxy. Ravaged 10,000 years earlier by war, Earth was reclaimed by its space-dwelling offspring as a planet of landscaping and tombstones. None of them fully human, Fletcher, Cynthia, and Elmer journey through this dead world, discovering human traits and undertaking a quest to rebuild a human world on Earth.",
        "authors": "['Clifford D. Simak']",
        "infoLink": "http://books.google.com/books?id=DstaDwAAQBAJ&dq=Worlds+of+Clifford+Simak&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I first picked it up at a library book sale, I gave it no thought. After all, I love science fiction. But I never expected the book to be as good as it is. The revelations you experience within the book are really quite exciting. For example, many of the short stories it contains end with pretty severe and &quot;out-of-nowhere&quot; plot twists. There were some dull stories I'd heard ideas about before, &quot;Green Thumb&quot; being one I recommend you skip over, (it reminded me too much of &quot;Little Shop of Horrors&quot;) but overall, it did contain a huge amount of new, fresh stories.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Clifford D. Simak's _The Worlds of Clifford D. Simak_ (1960) is a collection of a dozen good Simak stories published between 1954 and 1958. One is from _Infinity_, two are from _Astounding_, and nine are from _Galaxy_. Two stories (\"Idiot's Crusade\" and \"Founding Father\") are chillers. One (\"Death Scene\") is bittersweet. But the tone of most of the stories is that of gentle humor.Probably the best-known story in the collection is Simak's Hugo-winning novelette, \"The Big Front Yard\". It's the one about the Yankee handyman and trader who begins to notice strange goings-on in his house. And then there is a discovery made outside his front door that proves great for the handyman, his dog Towser (Simak stories frequently feature dogs), and his retarded assistant. I have read this story over half a dozen times over the years, and it still holds up well.Two other stories in which the \"little guy\" emerges triumphant over the forces of bureaucracy are \"Operation Stinky\" and \"Green Thumb\". The first is the one in which the little skunklike alien tricks the Air Force brass. The second involves a county agent who investigates unusual holes and soil samples appearing in his territory-- and forms an alliance with some alien plants. (There is a dog in this story, too.) \"Idiot's Crusade\" is still another tale in which the little guy wins. But this time, the results are horrific rather than comic.Four stories-- \"Honorable Opponent,\" \"Founding Father,\" \"Jackpot,\" and \"Lulu\"-- involve humans who go out into space and run into some strange situations Out There. The first story is about the Army brass who must meet the teddybearlike aliens who have whipped them in battle to discuss terms of surrender. The second tale is about delusions planted in the mind of a spaceman that begin to take over his life. The third is about a spaceship crew (not, shall we say, like that of the _Enterprise_) that discovers that it is better to travel hopefully than to arrive. And the fourth is about the lovesick ship's computer with a taste for soppy poetry.Three stories in which Earthmen make alien contacts that are not to their advantage are \"Dusty Zebra,\" \"Carbon Copy,\" and \"Neighbor\". The first is about a boy who finds a way to trade with denizens of a parallel word and about his father, who is too clever for his own good. The second dramatizes a real estate scam that backfires on the agent. The third (_another_ story with a dog!) is about the alien who literally has a way to keep people down on the farm. This story is marvelously told, but it always bothered me a bit. It describes what amounts to a benevolent dictatorship.\"Death Scene\" is the most unusual tale in the book. Suppose that everybody could see exactly twenty-four hours into the future. The story is about an elderly man who _knows_ that he will shortly die-- and how he and his family quietly prepare for the event. The tale is so beautifully told, it seems almost petty to point out the flaw in the story: Not everyone will die quietly, painlessly, peacefully, or in dignity.Simak has often (and accurately) been called an author of pastoral science fiction. \"Neighbor\" is the purest pastoral piece in the book, since it deals with a spot of country isolated from the rest of the world. But there is a \"small town\" feel to many of the other stories as well. Aliens in these stories may be a bit strange, but they are usually benevolent-- just plain folks. Simak's world is a world in which many problems can be solved by dickering, playing chess, going fishing, or swapping drinks from a bottle. It's a world that I enjoyed visiting. I suspect that you will like it as well.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "into the dragons teeth",
        "description": "Into the Dragon's Teeth is the real-life story of three men who experienced the events of World War II and the Battle of the Bulge, and survived. Their stories are typical of many members of the U.S. Army who fought in this infamous battle. These are stories from a vanishing group of men who saved the world from unspeakable evil. These stories deserve to be told and documented for posterity.",
        "authors": "['Daniel Lynch', 'Paul Rutherford']",
        "infoLink": "http://books.google.com/books?id=6nDzAAAAMAAJ&dq=Into+The+Dragon%27S+Teeth&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have read a great deal about the experiences of our fighting men in WWII. Unforturnately many of them don't write very well. To have these men tell their story to a professional writer, and Lynch is a much better writer than he was when he wrote editorials for the Times Union, was a masteful stroke. By having 3 stories to follow, the book never dragged on endlessly. The personal stories of these 3 warriors is compelling and I highly recommend the book. The anit-Semitism Al Cohen experienced is well described but not overdone. Lynch makes his point and moves on like a good writer. The personal views of these men are insightful and Lynch makes them come alive after nearly 60 years. If anything, I wish it were a longer book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Loved the story and the way history was written in a novel form. I like the way it incorporated the stories of the three veterans along with the chronlogy of the war. It reads so well that your done before you realize it. I highly recommend this book to anyone, not just WWII buffs.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book was an experience I am not yet likey to forget. There were members of my family that served in WW II. Yet I have never known exactly what went on over there. It is something never talked about nor taught in school. My best friend sent me this book and I will have to thank her. People have to know what went on. I feel like I have lived a very sheltered life. I applaud these three brave men and all who have served. Paul and Dan, it is fortunate for us, you both cared enough to take the time to research and write this book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "give your dog a bone the practical commonsense way to feed dogs for a long healthy life",
        "description": "Dr. Billinghurst's most important piece of writing is the book Give Your Dog a Bone. Because cats and dogs have different food requirements, (cats are obligate carnivores while dogs are omnivores with a carnivorous background), he decided they each needed their own book, and that he would write the dog book first. Thus was born Give Your Dog a Bone. This book was launched at a 3 day Bichon Frise conference in western Sydney on the 17th November 1993. The book was advertised in all the canine breeder magazines throughout Australia. Give Your Dog a Bone? proved an instant hit, with many breeders adopting its ideas. Since that time it has been making steady inroads into the minds of breeders and dog owners throughout Australia and overseas. To date nearly fifty thousand copies of this book have been sold. Give Your Dog a Bone is the book that began the worldwide BARF dietary revolution for pets and remains 'the book' to read on the subject of BARF. It remains the practical common sense way to feed any dog for a long healthy life. It is the only book available that deals exclusively with feeding dogs their natural or evolutionary diet. This book contains vital information for all dog owners. It is a must for the owners of new puppies. Its 320 pages are packed with practical authoritative dog feeding advice that will drastically reduce vet bills. It shows that a dog's diet, which is based on raw meaty bones, is simple to produce, promotes health and is inexpensive. Give Your Dog a Bone explains why processed foods are the major cause of growth, reproductive, dental and most of the degenerative diseases including problems such as cancer, diabetes, arthritis, kidney failure, cardiac disease, the auto-immune diseases etc.",
        "authors": "['Ian Billinghurst']",
        "infoLink": "http://books.google.nl/books?id=zUnEAAAACAAJ&dq=Give+Your+Dog+a+Bone:+The+Practical+Commonsense+Way+to+Feed+Dogs+for+a+Long+Healthy+Life&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Yes, it is terribly written. It is also confusing - often contradicting information is presented. BUT this is the book that got tens of thousands of people taking a very hard look at how they have been feeding their dogs, and coming to the conclusion that a commercial diet is by far from the best choice, and in fact raw, natural foods are the best choice for dog nutrition.For those curious about getting started in changing their dogs' diets, I would recommend Kymythy Schultze's &quot;Ultimate Nutrition&quot; and Carina MacDonald's &quot;Raw Dog Food&quot; before recommending Billinghurst's &quot;GYDAB&quot;.But I would buy this little book too, as it's surely the &quot;Grand Daddy of them all.&quot;",
                "review/helpfulness": "73/79",
                "num_reviews": 79
            },
            {
                "review/text": "Dr Billinghurst's book indeed suffers from a pretty bad presentation and the Dr's tendency to be a little redundant, but let's face it : the information inside the book will hit like a freight train, anyone who has been feeding kibble for years thinking it was the right thing to do.I was one of those, I am a University Professor and like to think of myself as rather smart, besides I have been competing and breeding rottweilers at the highest levels since 1995 and feel I know lots of things about dogs... and yet this book really pointed at how stupid and naive I had been, feeding my dogs industrial kibble and not seeing for what they were, the warning signs that my dogs needed something else.I didn't hesitate for long after reading that book, I made the switch to Dr Billinghurst's BARF Diet and my dogs have never been so great !There are probably better books in order to have details on feeding ammounts, precise meal suggestions, etc. But Dr Billinghurst's book is a great starting point because it will really change your outlook on dog feeding.",
                "review/helpfulness": "63/66",
                "num_reviews": 66
            },
            {
                "review/text": "All the info you need to feed your dog the way they are meant to eat is in here. Squeamish Americans may have trouble with this Australian vet's no-nonsense philosophy, but he's right and it works. He is a bit repetitive and production costs were kept to a minimum, but it serves his purpose well - to re-educate people. Great basic nutritonal primer. No matter which chapter you turn to, you will be regaled with his basic tenet - dogs need FRESH, RAW food (mostly raw, meaty bones) EVERY DAY to be healthy their whole lives.",
                "review/helpfulness": "28/32",
                "num_reviews": 32
            },
            {
                "review/text": "After reading many websites on the BARf diet, I was rather disappointed in this book. Our dog trainer recommended it so I purchased it(rather expensive). The author repeats over and over what could have been said in a few chapters. Commercial dog food is bad and bones are good pretty much sums it up. It would have been nice to have an index to look up specifics, like the actual diet.If you do a search on the BARf diet on the web you'll get precise, comprehensive information for no cost!",
                "review/helpfulness": "29/31",
                "num_reviews": 31
            },
            {
                "review/text": "I read this book nearly 5 years ago after getting a puppy. It is fantastic. I have been feeding the raw diet to my dog ever since. She is brimming with health, never smells, has a shiney beautiful coat.",
                "review/helpfulness": "24/29",
                "num_reviews": 29
            },
            {
                "review/text": "I found a boon with Dr. Billinghurst's book \"Give Your Dog a Bone.\" I've been an advocate of home made meals for some years now. I knew dogs needed the calcium from bones. I thought it was enough to provide ground bone in their meals. I never anticipated that pets might derive satisfaction from doing what God intended them to. Rip, tear and crunch. My dog, up to that point, had been happily living on pooch meat patties I bought from the market. In this book, Dr. Billinghurst condemned these. He said they robbed a dog of satisfaction.Made sense to me. My dog is a rescue. She has issues. She needed some satisfaction.It was so funny giving her her first chicken wing. She had NO idea what to do with it. This really surprised me! She knew she wanted it. She whined and danced around the bone. She licked it and whined some more. My Persian, on the other hand, took to it like Jabba the Hutt.In the past, she'd had taken only two or three minutes to wolf down her food. Sometimes she'd barf it right back up. Too much, too fast. But with the wings, she takes anywhere from 30 to 45 minutes to eat. She really enjoys her food. Often she makes little noises like a nursing puppy.To top it off, she had an emotional break through as a result. As an abused dog, Honey had a lot of issues. Some manifested as her over eating. Some manifested as destructive behavior. After putting her on raw meaty bones (complimented with Orbee Tough toys during the day), these behaviors ended. Also, while she remains a very high energy pooch, she is no longer manic.The sad ending to this story is that, I just discovered Dr. Billinghurst has sold out. I liked his book so much I went looking for more. Sadly, his third book advocates exactly what he condemns in his first book. Prefab doggie meat patties. I guess he smelled the profit factor.While it's true that a dog can live a happy life on these patties, don't deny your dog the satisfaction of a raw meaty bone.Also, I have an issue with Brewer's Yeast. If you won't give your pet by-products of a meat plant, why give them by-products of a brewery? Brewer's yeast is bitter and can cause gas. The alternative is often cheaper as well. Because the focus is health. Not making profit off of trash. \"Nutritional yeast\" is grown specifically for its nutrient qualities. It has a mild cheddar taste that both my dog and my cats love. You can sprinkle it on food or mix it with a little water and flax seed oil to make a yummy and nutritious sauce. As a side note, it goes great on popcorn.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "I was introduced to this diet by a relative. I have been personally involved in the rescue of abused dogs for years. I am a rather no-nonsense type of person. I have no interest, normally, in alternative medicine, meditation, accupucture or any other sort of \"alternative lifestyle\" trends. HOWEVER, this is a book of significance for any who really care about those animals, who by no choice of their own, depend upon human beings for their existance.Basicly, I see a dog as a dog, not a little, slightly retarded person. If a dog can be saved, save it and give a good life. If a dog can't be saved, give it as much comfort and love as possible in its remaining time. I have found this diet to turn around animals faster and to a more robust state of health than I have often believed possible for my animals. Yes, the book is not going to win any awards for literature, but I read this book for informaion, not to play at being petty editor or a know it all. I consider this to be now a valuable addition to my library. Sure you can get a lot of information off the internet about BARF, but this book is important and the author should be supported by purchasing his extrodinary effort. I know what I know, and I know this information is significant. And, by the by, dogs really are ominvores.",
                "review/helpfulness": "17/22",
                "num_reviews": 22
            },
            {
                "review/text": "Good information but very repetitive. The book should include a sample schedule or meal plan for feeding your dog but it doesn't. The author just provides some very broad feeding guidelines. Other than that, the very idea of feeding your dogs the way nature designed them to eat makes perfectly good sense to me. I first experimented with my own dog by giving him a raw chicken wing and my dog devoured it with relish!!! No hesitation there, as there was when I gave him cooked chicken. And indeed, my dog's breath really is sweet after all!!! It's raw from now on for my dog.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I bought this book about 8 years ago, when my Boxer wasn't doing well on any commercial diet (I tried a few premium brand foods). He also had lots of other ailments and I was one of my vet's best clients.After starting him on Dr. Billinghurst's ORIGINAL diet of raw meaty bones along with vegetables, I haven't needed a vet, except for rabies shots when I wanted to take him with me to Germany, and when he needed stitches in his ear after a fight. I was so happy that he was so healthy!Of course, unfortunately there is no guarantee that your dog will not get ill when fed an exclusively raw diet.My beautiful boy was diagnosed with malignant lymphoma at the age of 8 years and 9 months. The cell-types were of a kind that couldn't be cured with chemotherapy. We did enjoy another 3 months of playfull and quality time together, until I had to take the final decision.My other dog (now 5 years old) has been fed a raw diet since he came to us at age 13 weeks, and has only been to the vet to be chipped and to have his puppy-shots and/or rabies shots. He has never been ill during these past 5 years.Since Dr. Billinghurst's book I read a lot of other books on this topic, but I did find his book helpful for the starter on the path to B.A.R.F., that I was then. I re-read it a couple of times throughout the years.The only thing that surprised me and I think is a pity, is the price...",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Okay... first off, I feed my dogs & my cat raw. Pretty much the 'Barf' style of feeding. But, I have found this book to be VERY disappointing as I was hoping for some actual facts supported by 'evidence' that I could back my feeding practices up with. Instead, he says a lot of stuff that, while true, he doesn't bother to provide the sources to his 'facts'. So he makes it easy for someone who is skeptical to just dismiss the whole raw feeding thing altogether. This book is very repetitive, each chapter is basically some new info with a bunch of the old info rehashed over again (with no supporting evidence, of course... just 'take my word for it'). If you are looking for 'proof' that raw feeding is the right way to go, I'd recommend reading Tom Lonsdale's books instead (Raw Meaty Bones, Work Wonders). If you're the type of person that isn't looking for proof, but rather 'how to', then this book is probably Okay for that. Another issue that I have is the cheesy cartoons throughout the entire book. It takes a lot away from the author's professionalism & credibility. The 'Work Wonders' book from Lonsdale has the same sort of silly artwork, ????Oh, & another concern... Billinghurst has his own line of special 'supplements' which are ridiculously overpriced, & has a website 'Barfworld' that you have to pay an annual membership fee to be involved with it. NOT cool.....",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "chicken soup to inspire the body soul motivation and inspiration for living and loving a healthy lifestyle chicken soup for the soul",
        "description": "A collection of writings offering words of inspiration, reflection, and wisdom to motivate a healthy, active, and loving lifestyle.",
        "authors": "['Jack Canfield', 'Mark Victor Hansen', 'Dan Millman']",
        "infoLink": "http://books.google.com/books?id=R0AnMQAACAAJ&dq=Chicken+Soup+to+Inspire+the+Body&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Another in the long line of Chicken Soup books, and as such, a bit predictable. Still, some of the stories are pretty amazing. Many stories of people with health problems that had been pretty much abandoned as hopeless by their doctors who decided that they were going to find some way to help themselves - and they did. One story about a woman Grace Halloran with retinitis pigmentosa, an eye disease, who managed to improve her eyes enough to get her driver's license back. I have a friend with RP, and what she describes is really a miracle. I like stories about real people and their real lives. Yes, its another Chicken Soup book, but I bought it, I read it, I liked it and I recommend it.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "Since this is my first Chicken Soup book I have read, I can fairly say from a great portion of this collection that I have been touched and inspired. I also have a friend with Retinitis Pigmentosa and Grace's story hit the heart. I also have had a near death experience as described in Hal's story &quot;Grateful Life, Joyous Passage&quot; and found it such a joy to read that there is someone out there who has felt and truly experienced what I have and so much more. This collection will have something for everyone.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "bursting with energy",
        "description": "In this updated revision of his acclaimed book, Bursting with Energy, Dr. Frank Shallenberger makes a clear connection between the amount of energy you have and the amount of aging you do, pointing out that, in medical terms, aging refers to a loss of function, not chronology. A thirty-year old with no loss of function is identical to a twenty-year-old, he says. And the same is true for fully functional people in their sixties--they are the same as thirty-year-olds. According to Shallenberger, the loss of functions that result from aging are themselves the result of energy loss: more energy, less aging; less energy, more aging. When Dr. Shallenberger discusses anti-aging methods, he is actually talking about improving energy production. His work with patients over the years has proven that an energy deficit is the root cause of every disease and symptom, from cancer, to fatigue, to obesity.",
        "authors": "['Frank Shallenberger, M.D.']",
        "infoLink": "http://books.google.nl/books?id=oWqlpha5bogC&dq=Bursting+With+Energy&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book takes scientific basics of nutrition and physiology and transcribe them into everyday language. The explanations for why things are the way they are with losing weight are very helpful and provide a moderate level of knowledge, but enough to allow the reader to make informed personal decisions. I especially liked the position the author took of making small changes while building to a bigger goal. We all know of failure from trying to \"bite off more than we could chew.\" Great book! Wonderful lessons!",
                "review/helpfulness": "30/35",
                "num_reviews": 35
            },
            {
                "review/text": "What a great read. Health and wellness is your responsibility. The simple truth is that most illness and disease is preventable. Its all explained here in a very straight forward yet detailed way.There is a big difference between getting older and aging. To avoid aging as we get older, back to basics is a great place to start: Drink plenty of clean water, not bottled or tap. Get plenty of sleep AND good rest, not pill induced sleep and manic vacations. Eat whole organic food not processed junk food. Exercise, do both resistance and cardio. Meditate. Take a few quality supplements. Get regular sunshine. Breathe clean air and get plenty of oxygen. Have some fun. These are the kinds of things that are so obvious yet we've become completely separated from how simple and powerful these simple things are a prescription for long lasting health and a vital life.What's great about Bursting With Energy is that the 'WHY' is explained in detail so you have a genuine appreciation of just how powerful these lifestyle choices really are. And as both an MD and a Naturopath, Frank informs with a very broad yet even-handed approach.I see my clients everyday in my Full Spectrum Coaching practice become transformed by the simple application of these principles. They drop weight, look younger and healthier, feel better, have more energy, are able to focus and concentrate like never before, have an awesome sex life, greater confidence, are more successful, and lead happier lives in general. What's really interesting is how much scientific data has come out in the last 15 years to support what are truly the secrets to happiness. In fact, I recommend they read this book as one of the support texts for the work we do together.Honestly, this is as good or better than any comparable best seller on the market in terms of content and delivery. Nice job.Enjoy!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Anyone looking into a healthier way of living should read this!! Full of interesting and eye-opening information.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I have learned a lot from this book from eating the right fats to how to breathe correctly. I would recommend this book!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I love this book! I review it often to remind myself how basic the care of our health really is. All the key elements to stay healthy require no special searching. These key elements should be appreciated and used daily. Stay away from the sedentary lifestyle and processed foods out there. A must read if you ask me.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I haven't read a book that made as much sense as this book, on improving energy and health. The author explains the science behind why and how your cells make and use energy. I read the book, tested the stragies outlined in the book.. I notice a huge difference in my energy.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "behavior problems in dogs",
        "description": "Revision of: Handbook of behavior problems of the dog and cat. 2003.",
        "authors": "['Gary M. Landsberg', 'Wayne L. Hunthausen', 'Lowell J. Ackerman']",
        "infoLink": "http://books.google.com/books?id=eYbVBMkYvSAC&dq=Behavior+Problems+in+Dogs&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When faced with problem behaviors in a rough collie back in the 70's, I read every dog behavior book on the shelves at the time. William Campbell's book was the only reference which addressed the issues I needed to understand. Campbell's description of 'active defense reflex' vs 'passive defense reflex' dogs made all the difference in my understanding of Shasta's behavior. He gave me all the advice I needed to turn this behavior around with very specific instructions which worked to perfection. We went on, after reading this book, to earn a CD in obedience whereas before I could not even touch his body without being bitten ('active defense reflex'). I recommend this book to anyone I contact who is dealing with dog behavior problems and I'm very interested to see how this new edition compares to the one I purchased in the 1970's!",
                "review/helpfulness": "43/45",
                "num_reviews": 45
            },
            {
                "review/text": "Ever since we got our dogs ... we have been reading and reading dog related books ... mostly out of interest and sometimes because we needed advice with particular issues we're encountering with our canine family members ...Some books were far too general, a few (fortunately very few) actually contained bad or poor advice ... most were reasonably good &amp; useful ...But by far ... this is the best we have come across ...The author makes no pretence at offering quick or instant solutions ... in the first few chapters and without emotional tangents (we all think our dogs understand us *laughs*) he takes the reader through the psychology and mindset of a dog, ... it becomes very clear that the author believes a dog cannot be effectively trained simply by rote, punishment or treats ... but through a process of learning to understand their true nature and positive healthy reinforcement ...But what makes the most difference is that ... the author is prepared, without fear of alienating his readers, to require dog owners to delve into their own psychology and inner nature ...This approach makes the book all the more useful ... it made me realise the futility of trying to train our dogs, without first considering how I might be affecting them, with my behaviour and reactions (conscious &amp; subconscious) ... I was asked to consider how my own understanding or lack ... might be causing or contributing to the dogs' good as well as bad behaviour ... The book also provides useful case studies and plenty of practical advice.It does require a little more concentration than one would normally devote to the reading of a pet training book ... but the effort is well worth it ... any dog owner, new and experienced will benefit ...",
                "review/helpfulness": "37/37",
                "num_reviews": 37
            },
            {
                "review/text": "This is an excellent book detailing behaviors and causes, as well as corrections. This is one of the few books around that shows medical causes and remedies for certain conditions. For those problems that are truly behavioral, and not medical, in origin, Dr. Campbell details owner/handler behaviors designed to correct, rather than punish, those involved. This book should be the dog-trainer's bible, and it wouldn't hurt potential owners to read it, either. I read the version published in the seventies, and would like to check on any modifications which may appear in the 1992 edition.",
                "review/helpfulness": "34/36",
                "num_reviews": 36
            },
            {
                "review/text": "A book is only as good as it is useful. I wanted to copy something for my sister, new to dogs, but gave up after 5 minutes of not being able to find it. Because the author really only has 3 recommendations for any given problem (leadership exercises, counter-conditioning (&quot;Jolly routine,&quot; in his verbiage), and distract-and-redirect), he should have laid those out somewhere in the book and then applied them to the problems he discusses.That said, the very strong &quot;pros&quot; of this book are:(a) one of his first tasks is to explain how dogs perceive the world (and, thereby, show why they don't instinctively understand people!);(b) he speaks in terms of &quot;leadership&quot; instead of &quot;dominance&quot;;(c) he does not compare dogs to wolves or human children -- they are neither!;(d) he very importantly points out that almost every dog &quot;misbehavior&quot; is due to frustration, and that a dog's basic temperament will determine how it responds to this frustration (outward or inward); and(e) his solutions are practical, humane, and focused on altering the cause, not punishing the effect.The &quot;minuses&quot; include:(a) poor presentation of his methods;(b) criminal lack of proofreading;(c) some unfortunate outdated terminology (I cringed at every use of the term &quot;correction&quot;);(d) presentation of his &quot;pet&quot; issues of a high-protein diet, and treatment of hyperkinetic dogs.The buyer should also know that he expects you to have trained your dog basic obedience, as he uses basic commands in some of his solutions.",
                "review/helpfulness": "26/29",
                "num_reviews": 29
            },
            {
                "review/text": "This book opened my eyes in several ways. At the time I read it I had been looking for an approach to dog training that didn't rely on the harsh corrections recommended by proponents of the alpha theory, which were all the rage at the time. Campbell was only the second author I read who claimed that the alpha theory wasn't relevant to training. (Kevin Behan, author of NATURAL DOG TRAINING, 1992, was the other.) What's even more brilliant is that Campbell wrote his book in the 1970s, long before we all found out that the alpha theory is a total myth! (The top wolf experts don't even like to use the word alpha anymore because, as Dr. L. David Mech puts it, \"it falsely implies a hierarchical system in which each wolf assumes a place in a linear pecking order,\" (Canadian Journal of Zoology, 2002).)I especially like Campbell's \"jolly routine\" exercise and his distraction/praise approach to stopping a puppy from doing natural, though destructive, behaviors, as opposed to using physical corrections or scolding the pup.That said, I've found that many of the other exercises-like \"no free lunch\" (now called NILIF)-don't really work. And some-like the exercise for keeping the dog from going through a door ahead of you-are completely unnecessary. That's why I'm only giving BEHAVIOR PROBLEMS IN DOGS three stars. It's still worth reading though, especially if you're a dog trainer.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "... This is a very good read ... this book offers much more than the usual approach of `tell the dog to sit, and reward it with a treat' ... the author approaches the problem of bad dog behaviour from the owner's perspective, as well as from the dog's perspective ... a holistic approach that avoids harsh punishment ... The author tells us that in order to correct a dog, oftentimes we must first as owners correct ourselves, our approach ... our whole attitude ... we are encouraged to try and learn the nature of dogs, their instincts and propensities ... the numerous case studies are also extremely useful ... All in all, a very good book, informative, sensible and effective.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "... This is a very good read ... this book offers much more than the usual approach of `tell the dog to sit, and reward it with a treat' ... the author approaches the problem of bad dog behaviour from the owner's perspective, as well as from the dog's perspective ... a holistic approach that avoids harsh punishment ... The author tells us that in order to correct a dog, oftentimes we must first as owners correct ourselves, our approach ... our whole attitude ... we are encouraged to try and learn the nature of dogs, their instincts and propensities ... the numerous case studies are also extremely useful ... All in all, a very good book, informative, sensible and effective.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the worlds of clifford simak",
        "description": "Twelve short stories reprinted from science fiction magazines.",
        "authors": "['Clifford D. Simak']",
        "infoLink": "http://books.google.com/books?id=DpqRAAAAIAAJ&dq=THE+WORLDS+OF+CLIFFORD+SIMAK.&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I first picked it up at a library book sale, I gave it no thought. After all, I love science fiction. But I never expected the book to be as good as it is. The revelations you experience within the book are really quite exciting. For example, many of the short stories it contains end with pretty severe and &quot;out-of-nowhere&quot; plot twists. There were some dull stories I'd heard ideas about before, &quot;Green Thumb&quot; being one I recommend you skip over, (it reminded me too much of &quot;Little Shop of Horrors&quot;) but overall, it did contain a huge amount of new, fresh stories.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Clifford D. Simak's _The Worlds of Clifford D. Simak_ (1960) is a collection of a dozen good Simak stories published between 1954 and 1958. One is from _Infinity_, two are from _Astounding_, and nine are from _Galaxy_. Two stories (\"Idiot's Crusade\" and \"Founding Father\") are chillers. One (\"Death Scene\") is bittersweet. But the tone of most of the stories is that of gentle humor.Probably the best-known story in the collection is Simak's Hugo-winning novelette, \"The Big Front Yard\". It's the one about the Yankee handyman and trader who begins to notice strange goings-on in his house. And then there is a discovery made outside his front door that proves great for the handyman, his dog Towser (Simak stories frequently feature dogs), and his retarded assistant. I have read this story over half a dozen times over the years, and it still holds up well.Two other stories in which the \"little guy\" emerges triumphant over the forces of bureaucracy are \"Operation Stinky\" and \"Green Thumb\". The first is the one in which the little skunklike alien tricks the Air Force brass. The second involves a county agent who investigates unusual holes and soil samples appearing in his territory-- and forms an alliance with some alien plants. (There is a dog in this story, too.) \"Idiot's Crusade\" is still another tale in which the little guy wins. But this time, the results are horrific rather than comic.Four stories-- \"Honorable Opponent,\" \"Founding Father,\" \"Jackpot,\" and \"Lulu\"-- involve humans who go out into space and run into some strange situations Out There. The first story is about the Army brass who must meet the teddybearlike aliens who have whipped them in battle to discuss terms of surrender. The second tale is about delusions planted in the mind of a spaceman that begin to take over his life. The third is about a spaceship crew (not, shall we say, like that of the _Enterprise_) that discovers that it is better to travel hopefully than to arrive. And the fourth is about the lovesick ship's computer with a taste for soppy poetry.Three stories in which Earthmen make alien contacts that are not to their advantage are \"Dusty Zebra,\" \"Carbon Copy,\" and \"Neighbor\". The first is about a boy who finds a way to trade with denizens of a parallel word and about his father, who is too clever for his own good. The second dramatizes a real estate scam that backfires on the agent. The third (_another_ story with a dog!) is about the alien who literally has a way to keep people down on the farm. This story is marvelously told, but it always bothered me a bit. It describes what amounts to a benevolent dictatorship.\"Death Scene\" is the most unusual tale in the book. Suppose that everybody could see exactly twenty-four hours into the future. The story is about an elderly man who _knows_ that he will shortly die-- and how he and his family quietly prepare for the event. The tale is so beautifully told, it seems almost petty to point out the flaw in the story: Not everyone will die quietly, painlessly, peacefully, or in dignity.Simak has often (and accurately) been called an author of pastoral science fiction. \"Neighbor\" is the purest pastoral piece in the book, since it deals with a spot of country isolated from the rest of the world. But there is a \"small town\" feel to many of the other stories as well. Aliens in these stories may be a bit strange, but they are usually benevolent-- just plain folks. Simak's world is a world in which many problems can be solved by dickering, playing chess, going fishing, or swapping drinks from a bottle. It's a world that I enjoyed visiting. I suspect that you will like it as well.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "dog company six",
        "description": "While the focus of this history is on the big wars, it doesn't slight events in between, among them the humanitarian missions that have helped define the Corps. Nor does it neglect the intermittent but never-ending fight for the Corps's survival at home where it faces periodic challenges from the Army, Navy, Air Force, and, on occasion, unfriendly presidents.",
        "authors": "['Edwin H. Simmons']",
        "infoLink": "http://books.google.com/books?id=FrzuAAAAMAAJ&dq=Dog+Company+Six&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Don't let the title fool you. This book is not about dogs. Dog Company is the phonetic alphabet designation for D Company that was used by the U.S. armed forces in World War II and Korea. Dog Company Six is the kind of book that many will want to read at least twice because it's so good. It's a novel about Marines in combat written by a Marine combat veteran. The prose is spare and to the point. The combat scenes are realistic and exciting. The book begins with an inexperienced infantry captain struggling with fears and doubts about his ability to lead Dog Company into war in Korea. As Dog Company fights its way through the Inchon Invasion, the battle for Seoul and the Chosin Reservoir - some of the most honored and storied battles in U.S. Marine Corps history - the commander matures into a tough, capable and brave captain of Marines. Author Edwin Howard Simmons is a retired Marine brigadier general who also fought his way up and the down the Korean peninsula in the same battles. His dialog is true to the Corps and his combat scenes have the realism that only a man who's been there can write. Dog Company Six isn't just a book about war and killing. It's about bravery, sacrifice and dedication to duty. Dog Company Six isn't just a book for and about Marines. It's an entertaining story, well told and deserving to be read by a wide audience.",
                "review/helpfulness": "31/36",
                "num_reviews": 36
            },
            {
                "review/text": "While &quot;Dog Company Six&quot; is billed as a novel, it might well be viewed as a diary of a Marine rifle company, the down-and-dirty war fighters, during its long guelling days of combat in a miserable war that shouldn't have happened. Author Simmons knows all-to-well of which he writes. He's been there and back, having commanded every kind and size of Marine Corps combat unit from platoon to a division while serving as a Marine during World War II, Korea and Vietnam. He is also an accomplished writer and Marine Corps historian with a shelf full of fine books to to show for it.Throughout the battles that ensue, from the mud flats of Inchon to the frozen wastelands of the Chosin Reservoir, Simmons masterfully and meticulously sets the scenes in which the company operates, allowing the reader to share in the intensity and realism experienced by Dog's Marines. The ongoing dialogue, expertly and abundantly woven throughout the book, will indeed be familiar to those who have endured and survived combat.",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "Dog Company Six: This is an excellent book, exceedingly well written. Although presented as a novel, this work of fiction provides a thorough history of Marine Corps action in Korea, from the landings at Inchon up to the end of the war. The author, General Edwin Howard Simmons, records the Marines' struggles, up and down the peninsula, north and south, through the eyes of Captain Bayard, the commanding officer of Dog Company. General Simmons writes with an excellent command of the English language, which he employs to describe the foul-ups and successes of the Marines in Korea. This book is definitely written from the point of view of the &quot;grunt&quot; in the mud (or snow). The highest rank for a character in the book is a light colonel. I would highly recommend this book.",
                "review/helpfulness": "30/30",
                "num_reviews": 30
            },
            {
                "review/text": "&quot;Dog Company Six&quot; is one of the best war novels I ever read, and I'm a fan of the genre. Without swashbuckling heroics, it shows what war is really like from the point of view of an infantry company commander. That it is set during the Korean War is coincidental. It could have been set in any modern war. The courage, loyalty, self-sacrifice, exhaustion, grief and heartbreak experienced by the officers and men of Dog Company are universal. They have been experienced by the men fighting all mankind's wars throughout history. The author's own experience as a combat Marine in Korea give it an authenticity that is rare in war fiction. &quot;Dog Company Six&quot; deserves a lot more attention than it has received.",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "In recent years, the trials and sacrifices of World War II and Vietnam veterans has been brought to the attention of the public by huge movie productions and media hype. However, the story of the American soldier in the \"Forgotten War\" in Korea largely remains to be told. Simmons' book tells this story with the authority of a retired Marine General, the accuracy of the director of the Marine Corps Historical Center, and the passion of a front-line infantryman. Given the media attention this book deserves, it could easily fill the gap in the American consciousness regarding the Korean War, and give the men who fought there their long delayed due.In _Dog Company Six_, Simmons expertly combines realistic accounts of combat, an engaging character study of an everyman Marine officer, and sneaks in the `big picture' view of the operational and political climate in Korea. While the combat is harrowing and the historical account is instructive, I felt one of the most interesting and overlooked aspects of the book was the character study of the Dog Company Six (Six meaning Commanding Officer in Marine lingo), Captain Bayard. Simmons shows where Bayard came from, where he grew up, how he came to be a Marine. He develops Bayard's career from a bit role in World War Two, through time in the Reserves, back to an active duty role with connections in Washington D.C.. In doing so, Simmons gives a real feel for where the citizen soldier comes from - Bayard could easily be the reader, the reader's father, Grandfather, the neighbor next door. The character evolves before the reader, giving a real sense of how war can change the individual.Standing on its own merits, I cannot recommend this book highly enough. However, if you really want to get the most out of this book, a superb adjunct would be the first few chapters of _First to Fight_ by Victor H. Krulak. _First to Fight's_ opening chapters concisely provide a first hand account of the struggle for survival of the Marine Corps in the post World War II force reductions amid the attitude that \"...the era of amphibious warfare is over...\", and the later affirmation of the Marine Corps' role with the amphibious landing at Inchon. Krulak illustrates that the Corps mobilized for Korea with a speed and expertise that no one else could match, in a logistical feat that is still mind boggling today.Finally, to the Chosin Few, and all Korean War veterans...Thanks.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "This was a great novel and I enjoyed reading it thoroughly. Simmons is a wonderful writer and has been given the gift to convey the pain, the power and the emotion of Bayard. I found the novel engrossing and I could barely keep it down. When I finished it, I was left hoping that Bayard could live a happy life that he had earned. I actually found myself caring about the character, which tells a lot about how well he was created. I recommend this to anyone that wants to know more about the Korean War.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "This novel is the best combat read since Black Hawk Down. The Naval Institute Press wanted a successor to Tom Clancy; they have found him.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "This was book was recommended reading by my local public library. If you have any doubts that our top military men are intelligent and aware, read this. I write for a living, and I think Simmons is a top-notch thinker and writer.This is the first book I have read about the Korean Conflict, and I found it to be a fast-paced, well-written account of what it was like to be on the fontlines in Korea. If you like Stephen Ambrose (e.g., &quot;Citizen Soldier&quot;), you will probably like this book.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I loved this book. One cannot doubt that the author knows his soldiers, knows the terrain and knows the weapons. An immense authority infuses the story.The action begins slowly, as the war began slowly, builds in intensity, ends in retreat.The scenes in Japan were not quite as convincing. There can't be all that many beautiful willing women waiting at the bar, although many Marines must wish for them.I don't understand why this little masterpiece didn't get more attention.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book was very interesting to read. However, there are also some confusing parts to the book. It keeps jumping back and forth suddenly and with no warning from the war scenes to memory scenes to scenes in Japan. It's probably more real this way but hard to follow for the average reader. But for anybody who is interested in the Korean War this book is worth reading and sticking through the confusing parts.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "reluctant prophets and clueless disciples introducing the bible by telling its stories",
        "description": "A retelling of fascinating Bible stories--including Beginnings, Moses, Solomon, Parables of Jesus, Peter, and Paul--offers a unique way for individuals to get to the know the Bible, bringing out the original humor, inspiration, and pathos within each story. Original.",
        "authors": "['Robert Darden', 'Bob Darden']",
        "infoLink": "http://books.google.com/books?id=aUWgc88QX-oC&dq=Reluctant+Prophets+and+Clueless+Disciples:+Introducing+the+Bible+by+Telling+Its+Stories&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Bob Darden's \"Reluctant Prophets & Clueless Disciples\" offers a fruitful method for teaching adults how to read the Bible. Combining his talents as a creative writer, humorist, and Sunday school teacher, Darden helps a novice (and perhaps even \"experienced\") reader of the Bible begin to understand the Bible not as chapters & verses (or worse, fodder for 'proof text poker') but rather as a variety of different narratives that require attentive reading.Darden sprinkles his book with illustrations drawn from his colleagues at \"The Door\" magazine (aka The Wittenberg Door, typo intended). A visual and narrative treat!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book was very helpful in taking me through the Bible stories. It explained everything clearly and it was very easy to follow. I highly recommened for beginners as well as for those who need a refresher course.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "my naked journey a reiki masters quest to live authentically",
        "description": "Compilation of 30 plus articles written by a Reiki Master about her journey toward a more honest and simple life.",
        "authors": "[\"Maureen O'Shaughnessy\"]",
        "infoLink": "http://books.google.com/books?id=6yBiAAAACAAJ&dq=My+Naked+Journey:+A+Reiki+Master%27s+Quest+to+Live+Authentically&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I couldn't put it down once I started. It felt as if Maureen was in my livingroom with me and sharing these stories and experiences. I had to smile and cry. It left a smile on my face when I closed the book.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My Naked Journey touched, moved and inspired me with stories and vinyettes about the authors' life as a Reiki Master. O'Shaughnessy is disarmingly humble and humorous, pointing out her own weaknesses in a way that gives the reader permission to be more fully human. Though her life focuses on Reiki, the book will speak to every reader who is on a journey toward wholeness, or would like to be on one!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "The author's path to increased spirituality, in short vignettes, is written to help us along our journeys to more spirituality and authentic living. Individual topics are written with humor, honesty, and compassion. A book for living you can refer to time and time again. Get in touch with your authentic self! Live life as it is meant to be lived!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Maureen has written this book from her heart. The honest sharing is a joy and is so easy to relate to. It is wonderful to see different events in our lives from having the author share her personal journey!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "The path to real life wisdom and enrichment is not marked entirely, or even \"mostly,\" by grand epiphany. Here we glimpse the down-to-earth way to genuinely practical insight and solid happiness. This is just the sort of book I've always loved reading: an intimate, friendly, and honest voice telling me about fascinating things that I want to understand better. It's easy to see why Mz. O'Shaughnessy is so \"in demand\" as a reiki master, teacher, and guide. This book is like a good talk with an old friend. Afterwards one feels wiser, more secure, happier. Thank you, Maureen, for fearlessly sharing your story. You assure us that you are \"just like us\" and yet reveal yourself to be an authentic \"master.\" You show us that we are pretty amazing beings, and then invite us to become. . . even more! Cloudia W. Charters, Honolulu; Author:ALOHA Where You Like Go?: From Survival to Satisfaction by Honolulu Taxi",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Reading My Naked Journey is like sitting down with a great friend and having her tell you interesting stories that openly and honestly illustrate her thoughts on life, love, authenticity, embarrassing moments and more. It is thought provoking as well as an inspiration to be the best person you can be -- while never asking for perfectionism or that anyone be anything other than her authentic self.Maureen's stories are entertaining, open, honest, and real. There is no pretense or posturing, just an open-hearted sharing of the human condition and some of the challenges we face. The stories are short, so it is a book you can read straight through or a little at a time. Or you can do what I did and read straight through and then go back and read them one at a time. It's a book that I'll read many times over -- each time I pick up something that I hadn't seen before. Some of the ideas I want to keep coming back to and exploring.It's a lovely book -- I hope you enjoy it!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "stressed is desserts spelled backwards rising above lifes challenges with humor hope and courage",
        "description": "A doctor describes how using faith, humor, love, and optimism to battle stress can lead to success and spiritual depth",
        "authors": "['Brian Luke Seaward']",
        "infoLink": "http://books.google.nl/books?id=QmvGhLGWgwIC&dq=Stressed+is+Desserts+Spelled+Backwards:+Rising+Above+Life%27s+Challenges+with+Humor,+Hope+and+Courage&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really enjoyed this book. It has two - three page true stories relating to huge or small accumulative challenges modern every day people deal with. I am tired of being told to reduce stress and calm down, I needed ways and means to do just that, and this book gave me some realistic methods. So much of our adult lives feel out of controll and we need every day heroes to help us understand we can all get &quot;through it.&quot;I look forward to the next book by this author and plan to read others. He writes clearly and mainstream with a hopeful theme.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "It's very difficult to find the words to describe the books written by Brian Luke Seaward. If a book is over 150 pages, it must have something about it to hold my attention.. Stressed is Desserts spelled backwards is a book that you don't want to end. It's one of the rare books that I'm able to read in one sitting, and at the same time go back and read parts of it again and again. Different stories and antecdotes within this book resonate within a person at different phases in his or her life and it's so easy to relate to the truths the author speaks of with times in your life or the lives of loved ones. I love to travel and explore the world, and as I do so I also explore the inner depths from within..... With a copy of this book and the Alchemist I am ready to begin my journey, both inner and outer.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "After reading this book, I hold firmly to my belief that we all experience many of the same feelings, and that a mentality of separateness is the cause of many of societal ills. I applaud Dr. Searward for revealing a personal side of stress in what I believe is an effort to heal many through the exposure of one's struggles in life and the resultant successes. I am reminded of Lance Armstrong as I get caught up in my self-created daily worries. Attitude is everything and Dr. Seaward certainly shows that with the right attitude, the blessing in every situation will be revealed. I have also read &quot;Stand Like Mountain, Flow Like Water&quot; and feel that this book is excellent follow-on reading. I think that this book helps remind us of the big picture of life, and will hopefully help many people get out the petty details that fritter life away and open our hearts.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I picked this book up at Barnes &amp; noble because I thought the title was clever.As it turns out this book is ingenious! The stories were funny and heart-wrenching. A great gift for anyone",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "&quot;Stressed is Desserts Spelled Backward&quot; is a book of that's full of inspiration! I like this book because you can open it to almost any page, start reading and find a valuable bit of information wrapped in a wonderful story. It's like a reference book on stress written in short story form! It also includes practical suggestions for dealing with rough times and for calming the mind, body and spirit. Brian Luke Seaward, PH.D., has a knack for writing as though he were talking to you in person. His other books &quot;Stand Like Mountain, Flow like Water&quot; and &quot;The Art of Calm&quot;, just to name a few are also wonderful spirit-filled works that encourage you to embrace life and all that comes with it from a centered, enlightened, inspired perspective.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Dr. Seaward has written another winner! This wonderful book is filled with only good stuff--rich and delightful--you feel full but want more. And, no calories!!!Dr. Seward has a way of writing that makes you smile, reflect and relate. Witty, charming and refreshing and does not feel &quot;new wave&quot; but written in reality and based on his interaction with many people over the years. My favorite dessert!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I got this book as a gift. I am not particularly stressed, but you don't have to be to read this collection of inspiring stories. Collectively, they remind me of the Hero's path by Joseph Campbell. My favorite story was about the guys who were electocuted and survived. I look forward to reading my by this author as these motivational stories are a great way to start or end each day. Thanks!!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "As a single mother of (2) teenagers in this hectic workaday world, it was wonderful to find a book that seemed to understand. I'm always ready for a second helping of Desserts. Look forward to more from Brian Luke Seaward.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Is calming, entertaining and stimulating and Desserts is no exception to the rule! It is a lovely book, especially in that it can be enjoyed cover to cover or as a nice pick-me-up, thought for the day-starter, stories to amuse and de-stress friends and associates, et cetera.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    }
]