[
    {
        "Title": "the ultimate improv book a complete guide to comedy improvisation",
        "description": "Provides a curriculum consisting of twenty-four lessons, explaining what improvisation is, techniques, and how to start an improvisation team.",
        "authors": "['Edward J. Nevraumont', 'Nicholas P. Hanson', 'Kurt Smeaton']",
        "infoLink": "http://books.google.com/books?id=HIMrAQAAMAAJ&dq=The+Ultimate+Improv+Book:+A+Complete+Guide+to+Comedy+Improvisation&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I had thought that this book would be a good guide for beginner or experience improvisors to improve their skills; however the book is written with advice on how to start an improv team at a high school and has a great deal of focus on competiting in the Canadian Improv Games (two areas i was just not intersted in). The chapters are very short and try to drop in every improv term without going into depth on any. The book does have a nice list of exercises and suggestions at the end, but many again focus on performating them with younger improvisors and some descriptions weren't complete enough to attempt to use them.This book would probably be most helpful to someone who is already very familiar with improv and who wants to teach it to high school students. But for the sake of those you are teaching, seek out more complete references like those by Viola Spolin.",
                "review/helpfulness": "32/32",
                "num_reviews": 32
            },
            {
                "review/text": "ANYONE and EVERYONE involved with the Canadian improv games should own this book. Teams who are just starting out, teachers who are thinking of starting a team, and players who have been improvising for years can all benefit from the information. Great skill-developing games, lists of characteristics, genres, and so on to help teams practise, and conprehensive descriptions of each game. Outlines dos and don't of improv. I love this book more than life itself.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I'd recommend the Del Close book if you want a good read on improv. This is for kids",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "one great game two teams two dreams in the first ever national championship high school football game",
        "description": "For more than a century, no Number 1 and Number 2 high schoolfootball team had ever met -- until October 6, 2001 One Great Game This is the story of two teams -- Concord De La Salle, a private Catholic school in an upscale Northern California suburb, and Long Beach Poly, a proud public institution from a blue-collar SoCal seaport -- striving to achieve the same goal: the all-American dream. In this supercharged account of the first-ever national high-school championship game, acclaimed sports journalist -- and former Poly varsity football player -- Don Wallace goes out onto the field and straight into the heart of each team. One Great Game offers a rare look at the world of young-adult sportsmanship, featuring up-close and personal interviews with the team players and their families, coaches and cheerleaders, rabid fans and sworn enemies. The result is a powerful piece of sports literature in the tradition of the classic Friday Night Lights. More than a book about football, One Great Game is an engaging cultural history about twenty-first-century American life.",
        "authors": "['Don Wallace']",
        "infoLink": "https://play.google.com/store/books/details?id=mrNnKw_gjUEC&source=gbs_api",
        "review": [
            {
                "review/text": "Don Wallace's ability to capture an essence of not only the emotions of what was truly a first in the world of prep sports, but the historical content that lead to a memorable event just a few weeks after this nation's 9/11 tragedy. The game was a temporary remedy for sports fans wanting to escape the horrors that occured in New York City. ESPN had named it one of the top sporting events in the country to watch for that week.Wallace is able to captivate an audience with his descriptions of the preparation that went into the game itself. His attention to detail as to how each schools football programs arrived at the point of their unforgetable matchup is outstanding. I am most impressed with how the book uses high school football as a metaphor for how life as viewed by those involved in the game.Don Wallace describes his own upbringing in Long Beach and the dynamics that have that have occured since he has moved away. His definitions of the suburban community of Concord, California, and how it somewhat evolves around the school with the infamous winning streak, actually makes the town sound interesting.I believe those choosing to purchase this book will realize it is more than just about one football game. It reaches more into depth of two contrasting communities, that despite the differences, are very similar. It is more about the country we live in today.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I confess I was intrigued partly because of the success of &quot;Friday Night Lights,&quot; H.G. Bissinger's classic look at high school football. However, I like Wallace's book better. While &quot;Lights&quot; drifted into long, rather dry sociological digressions, &quot;One Great Game&quot; is focused, beautifully written, and still explores--in a hard-hitting way--the fascinating contrast in two football cultures. It's an irresistible matchup: white, upscale Concord De La Salle, No. 1 in the nation and riding a 113-game winning streak, versus blue-collar, diverse Long Beach Poly, No. 2 in the nation and producer of more NFL football talent than any school ever. I was amazed at the access Wallace must have gotten to produce this book. He obviously spent a lot of times in the lockerrooms, absorbing the changing emotions and dreams of these young athletes, and he also proves himself an exceptional student of the two communities where these schools are based. It's worth the read just to glimpse into the mind and philosophy of De La Salle coach Bob Ladouceur, architect of the record winning streak, a guy who's apparently able to turn young men of good or even modest athletic ability into a juggernaut through discipline and commitment to the common goal. It's the kind of thing that's rare and makes an amazing story.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book chronicles the first-ever meeting between the #1 and #2-ranked high school football teams in America. In October of 2001, #1 Long Beach Poly, a Southern California powerhouse with a long, storied tradition, alma mater to a record 50 past and present NFL players, played host to #2 De La Salle, a Catholic all-boys school from the upper-class suburban town of Concord, CA, home of the nation's longest football (and perhaps all team sports) winning streak, which, before the Game, stands at an astounding 116 games.Prior to this game, no #1 and #2 teams had ever met in head-to-head competition, which always beggared the question, \"Who's REALLY #1?,\" since most, if not all of the USAToday's Top 25 high school teams would end up the season undefeated.Long Beach is the \"most diverse city in America,\" a sprawling city of 425,000 sandwiched between monstrous L.A. to the north, and the Pacific Ocean to the south. It has a long and rich history, much of it less-than-sparkling, where waves of immigration, first of blacks, Hispanics, and Japanese in the early part of the 20th century, then of Vietnamese, Cambodians, and Central Americans following upheavals in their respective homelands, made for a boiling brew of racial tension. Despite all this, Polytechnic High School, located in the decaying heart of downtown Long Beach, is a shining beacon for the whole community, not only as an athletic powerhouse, but as an academic springboard to prestigious colleges. in the 2001 season, the Poly Jackrabbits have perhaps their most talented team ever, with 5 players ranked among the 100 best high school players in the country.Concord, California, is a wealthy, mostly white, upper-middle-class suburb in the East Bay Area, populated by the professional, educated types who toil in nearby San Francisco. De La Salle is an exclusive all-boys school where tuition is $7,200 per year. The De La Salle Spartans are coached by a living legend, Bob Ladouceur, who since 1979, has lost only 14 games in his entire career, and none since December of 1991.The book takes two parallel stories, one of Poly, the other of De La Salle, focusing on the players, coaches, families, and overall atmosphere of each school and community, before intersecting them at the Game, which is described in bone-jarring play-by-play detail. You can almost imagine listening to the game on the radio, the play-by-play is so well-written.The Game was billed as a sort of David vs. Goliath, with De La Salle playing the part of David, traditionally undersized but winning on the basis of suberb coaching and relentless conditioning, and Long Beach Poly playing Goliath, with massive offensive and defensive lines and Division I college talent populating every skill position. However, when reading about each program, the reader gets the impression that instead of David vs. Goliath, it's more like Godzilla vs. Mothra, two unstoppable juggernauts heading toward a climactic Battle Royale. And ultimately, that is exactly what it is - simply one of the finest battles between two programs of the highest caliber in the biggest game of their lives, and possibly the lives of many others.I was very satisfied with this book. If you like football, sports in general, or just like a thrilling and consuming read, this book delivers.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "When I first picked up the book I was worried that the account would be bias toward the Poly side, especially considering it's the writer's alma mater. However, Mr. Wallace presents a fair, balanced account of one of the most anticipated prep sporting events ever. He starts off about a year prior to the game, when it was only a rumor and concludes with an action filled account of the game (portrayed play by play). Characters are well developed, and -- although I can only speak from experience on the De La Salle side -- seem to be very accurate. The introduction leading up to the game got a bit long winded at times, but outside of that the book was hard to put down. I recommend it to any fan of high school sports, as well as for people curious of how two of the most successful football programs in America opperate.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the complete idiots guide to basketball",
        "description": "\"Irreverent in approach, these guides include tips and advice from leading authoritimes, aiming to help with life's big decisions and challenges, as well as hobbies. This book should help readers how to watch and understand basketball. \"",
        "authors": "['Walt Frazier', 'Alex Sachare']",
        "infoLink": "http://books.google.com/books?id=KcIF8rb7g9MC&dq=The+Complete+Idiot%27s+Guide+to+Basketball&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Classy Clyde Frazier covers the fundamentals of basketball: the vocabulary, the role of each position, the basics of offense and defense, and a few common set plays. His writing is fun to read if a bit dumbed-down (hence the title). He draws examples largely from his playing days, but knows well and comments aptly on players of all eras. He draws the distinctions between college and pro ball and includes women's and high school ball, but properly focuses primarily on the NBA, where the game is played at its highest level. He shows you what to focus on when you watch a game and demonstrates how each player's skills come into play in the course of offense and defense. This book will enhance the novice's appreciation for and enjoyment of the game; from what I have read of Digger Phelps' &quot;Basketball for Dummies,&quot; I'm glad I read Clyde's book instead.",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "Buy Basketball for Dummies instead.In search of a book which would get me up to speed about a sport which I had never played but which my sons have become increasingly passionate about, I bought and read both. You would be and idiot to buy The Complete Idiot's Guide to Basketball.The author appears to be more preoccupied with telling you how wonderful he and the players of his (long bygone) era were. The references to today's players are painfully few. His snipping asides against the work ethic of today's players should have no space in a book of this sort; it serves only to make him sound whinny. His writing is practically devoid of humour and his descriptions of plays and strategies are fairly tedious. The game just does not come alive under his pen. Had I been an absolute newcommer to the sport when I read this book, I would have encouraged my boys to take up more exciting sports like synchronised swimming. FOrtunately, I had watched several live and taped games and had my children's interest to help me realise that there was much more to basketball than I could find in the pages of this book.Try again Mr. Frazier",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            }
        ]
    },
    {
        "Title": "basketball skills drills",
        "description": "Basketball Skills & Drills is your guide to mastering the basics of basketball, including footwork, ball handling, player positioning, post and perimeter play, rebounding, plus offensive and defensive individual and team tactics.",
        "authors": "['Krause, Jerry V.', 'Nelson, Craig']",
        "infoLink": "http://books.google.com/books?id=WlFyDwAAQBAJ&dq=Basketball+Skills&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is aimed at coaches who have had little or no expierence in the game of basketball. It includes all the basics of basketball and some players may benifit from it. The book is for the coach who is concerned about their players overall developement. This book will help the beginner but, it will be of very little use for the more advanced.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "Even the most experienced players will need to review basketball fundamentals if they decide to begin coaching. What is second nature for you is brand new to young players.You will be doing a better job than 99.9% of youth league coaches if you teach your young players the solid fundamentals in this book. I have coached youth basketball for many years, and this book is the first place I look at the beginning of each season.Some drills are too complex for very young players, but if you instill the basics found in the early chapters, your youthful players will reap the benefits for the rest of their basketball lives.Highest recommendation!",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I found this book to be an excellent tool for running youth practices. It explains every phase of the game and makes it easy for you to pass this knowledge on to your players.What is contained in this book are rules you will use for your entire basketball career. A great reference book.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I would highly recommend for any basketball coach at any level. I have been playing basketball for 30 years and found several new techniques, ideas and concepts in this book. Very well done.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Jerry Krause and Don Meyer really bring home how to teach fundamentals of basketball through progression. They break down defensive stance, passing, cutting, screening, and more like I've never seen before. The DVD brings any confusion to a halt by explaining drills and the exact sequence needed for players to fully understand how to play the game of basketball. This book/DVD combination is a must have for all coaches!!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I had the distinct privilege of working for coaching legend Don Meyer for 16 GREAT summers at his Bison Basketball Camp when he was the coach at Lipscomb University. I got to meet Jerry Krause, the coach who mentored Coach Meyer on teaching fundamentals. Meyer is a master teacher of the basics of the game, but he learned a lot of it from the author of this book,Coach Krause.This book is a great tool for beginning coaches, youth coaches and recreational coaches who want to teach more than a play or two and how to run a zone defense.It is also a great reference for the serious high school coach who really wants to master teaching the essential fundamentals of the game of basketball. If the skill and how to teach it cannot be found in this book, it is not worth knowing about.Kevin Sivils - author of Game Strategy and Tactics for BasketballGame Strategies and Tactics for Basketball: Bench Coaching for Success",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "highperformance soccer techniques tactics for advanced play",
        "description": "Trapattoni has coached 6 teams: AC Milan, Juventus, Inter Milan, Cagliari, Bayern Munich & Fiorentina. In this book, he shares his philosophy of coaching soccer & offers invaluable tactical insight, drawing on years of success at the highest level of the game. He also provides an example of a complete pre-season conditioning and annual work plan for a high performance team. Learn from one of the world`s best coaches!",
        "authors": "['Giovanni Trapattoni']",
        "infoLink": "http://books.google.com/books?id=Bye2IP2_ZogC&dq=High-Performance+Soccer:+Techniques&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is fantastic book for the young soccer player. The book is written to the level of a high school player and details the passion and discipline it takes to make it to the next level. The tips and drills to perform with friends and on your own,are with out a doubt, excellent and should be done on a daily basis. I highly recommend this to all youth soccer players and coaches.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is a great book for young players who want to take their game to highest level in high school and prepare for soccer at the college or even professional level. It teaches some advanced moves, but its real strength is helping young players understand the discipline and love for the game it takes to play at the highest levels.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "High Performance Soccer gave me great insight into the world of upper level soccer. All players that aspire to bigger and better things can learn a great deal from Paul Caligiuri. The information in these pages can apply to all age groups of competitive soccer. I can't wait to get on the field and teach these new found skills. I read it from cover to cover and then went back and hilighted all of the items that I believe to be useful. The inside of the book is now flouresant yellow!",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "levels of the game",
        "description": "This account of a tennis match played by Arthur Ashe against Clark Graebner at Forest Hills in 1968 begins with the ball rising into the air for the initial serve and ends with the final point. McPhee provides a brilliant, stroke-by-stroke description while examining the backgrounds and attitudes which have molded the players' games.",
        "authors": "['John McPhee']",
        "infoLink": "https://play.google.com/store/books/details?id=8PvaYZxLD-QC&source=gbs_api",
        "review": [
            {
                "review/text": "Ostensibly this book is about a tennis match, Arthur Ashe versus Clark Graebner in the 1968 US Open Semifinals. The match was historic in itself:&quot;It has been thirteen years since an American won the men's-singles final at Forest Hills, and this match will determine whether Ashe or Graebner is to have a chance to be the first American since Tony Trabert to win it all. Ashe and Graebner are still amateurs, and it was imagined that in this tournament, playing against professionals, they wouldn't have much of a chance. But they are here, close to the finish, playing each other. For Graebner to look across a net and see Ashe--and the reverse--is not in itself unusual. They were both born in 1943, they have known each other since they were thirteen, and they have played tournaments and exhibitions and have practiced together in so many countries and seasons that details blur.&quot;But McPhee is actually after bigger game than this one match. He also provides insightful portraits of the two very different contestants. Ashe, the only championship level Black tennis player of his time, is single, liberal, mercurial, a finesse player and a risk taker. Graebner is married with kids, conservative, religious, a power player and risk averse. McPhee demonstrates how their personalities influence, indeed shape, their play and how their lifelong rivalry lifts their games to higher levels when they play one another, ultimately lifting Ashe's game towards perfection by the end of this contest.Ashe would go on to win the tournament, becoming the only amateur to win it in the Open era and together Ashe and Graebner lead the US to it's first Davis Cup in years. After that though, while Ashe went on to a respectable career, Graebner slipped into obscurity. But in this book, McPhee has preserved a moment in time when the two were evenly matched on the court, despite being polar opposites off of the court and in charting the lives that brought them to that moment, he provides a penetrating glance at two fascinating men.This is a real pinnacle in Sports writing.GRADE: A",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "To say John McPhee has written the best tennis book ever is to say too little. This is far more than a tennis book and, if you're looking for instruction, far less. The platform, if you'll excuse the tennis pun, is a U.S. Open final between Clark Graebner and Arthur Ashe, but it is a study of two men and what brought them to this point, athletically but especially sociologically. The reflective Southerner forced to be a pioneer because he is black. The more rigid son of the Midwest and privilege, with greater power and less versatility. The vagaries that make them human: Graebner, the more up-tight, gambling with a prepared point successfully at a crucial spot in the match. And at the end, there is Ashe, triumphantly whistling a winner off his suspect backhand to close out the match. You want to cheer. And you understand more about people than when you opened the book.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is so gracefully written that it isn't till the end that one realizes that McPhee's writing style(s) has been imitating the players' tennis styles, and that his language has moved effortlessly intune with the 'Levels of the Game'. Inlight of Arthur ashe's death, the book acheives a new poignancy.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This was my first John McPhee book, selected because of its subject matter (I'm an ex-serious tennis player). John McPhee was recommended to me as a writer/essayist who can take any subject and write about it intelligently and interestingly. After finishing this book, I would agree with that characterization, but clarify that the subject in this particular book is not professional tennis or even the game of tennis but rather two people and how they have managed their lives. That they play tennis is the point around which the book comes together, but it is not the point on which the book stands. If you're looking for insight into the game of junior/professional tennis, try David Foster Wallace's great essay about Michael Joyce in _A Supposedly Fun Thing..._. If you're looking for insight into two particularly interesting people--Arthur Ashe is one of them, but his compatriot and opponent, whose name, of course, I have forgotten, is worth equal time--in a particularly interesting time period and situation, check this book out.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Reading this book in 2011 was really interesting. 1968 was the year of the Big Bang for tennis with the onset of the Open era.The whole character of this match between Ashe and Graebner feels like a period piece. Imagine at the time, being 6 foot tall was pretty tall for tennis. Nowadays, if you are not at least 6 foot you are short for this game. Back then, serve-and-volley was the dominant style of playing. Nowadays, it has completely disappeared. When is the last time you saw a guy rush the net routinely on his second serve? Well, maybe Taylor Dent a couple of years ago. That's when playing against a modern returner like Robin Soderling, Dent hardly picked up a game per set in two consecutive devastating losses. In other words, the standard style of play in 1968 is now obsolete. That's probably because 3 out of 4 of the Grand Slam tournaments were played on grass. Now, only Wimbledon is. And, they changed the quality of the grass and the pressure of the balls to slow down the game. Also back then, they did not play tie breakers. Sets could go on forever (scores like 10-8, 12-10 were not uncommon). Additionally, out of the 128 men field I think only one of them had a two-handed backhand (Cliff Drysdale who had a most formidable backhand at the time).Despite the book historical interest, I felt like the book had a few weaknesses.First, why politicize the game in the most meaningless way. The concept of Graebner playing conservatively like a Republican and Ashe more deliberately like a Democrat was the most vapid framework.Second, McPhee picked up the wrong match. The 1968 US Open was among the greatest tennis tournaments of all time. The Ashe-Graebner match up was one of the dull ones compared to a cocktail of sensational match ups. The final between Ashe and Tom Okker was a far better match than Ashe-Graebner. Ashe ran into probably one of the most talented players of all time. Okker was a short, light footed, speedy, versatile, elegant Dutchman whose game most resembled Federer. Ashe barely won in 5 sets. If you wanted politics, you could get a lot more drama in the intense match between Cliff Drysdale from South Africa (in the days of the apartheid) vs Ashe. For a battle of the generations, the Pancho Gonzales - Tom Okker match must have been pretty great too. Okker won it in a tough 4 set battle. But, Gonzales must have been more than 15 years older. You never see such an age gap between pro tennis players nowadays.In summary, this book is historically interesting. However, it could have been far more interesting.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Written for the New Yorker magazine in 1969, this 150 page sports 'classic' has all the punch-and-jab terseness that makes John McPhee's writing both immediate and immediately recognizable. It's fun to read, no question. And it has a way of implying that more is at stake than the ostensible subject of investigation, although McPhee is often artfully cagey about declaring what that \"more\" might be.\"Levels of the Game\" is constructed around a point-by-point account of a single tennis match played in 1968 by Arthur Ashe and Clark Graebner, an African-American and a German-American who were the soul of the championship American Davis Cup team, playing both as singles and as doubles partners. Ashe and Graebner were as much friends as fiercely competitive rivals can ever be, despite their markedly different personalities and world-views. Graebner, the 'spoiled' scion of a conservative Christian dentist, plays stiff and predictable power tennis, \"Republican tennis\" as it were. Ashe, also a 'privileged child' despite his color and father's illiteracy, is \"bold, loose, liberal, flat-out Democratic.\" Several critics have made McPhee's point more explicitly than McPhee would ever do: \"You are the way you play.\"Like the volleys of an exciting match, the profiles of Ashe and Graebner - their childhoods, their fathers, their training in life and tennis, their quirks and virtues - are lobbed back and forth between the points of the game, from Ashe's first serve to Ashe's last winning stroke. McPhee is crafty; he depicts both men with implicit admiration and maintains as judicious an air of impartiality as an nominee for the Supreme Court under hostile questioning. But there's little doubt about whom he assumes HIS readers will root for, and his tone shows it. Ashe's victory - Ashe's whole career - was a triumph of Civil Rights in America over the forces of stand-pat hold-on-to-your own conservatism. Anyone who doesn't cheer when Ashe scores a point in this match has totally missed the point.When McPhee wrote this book, in 1969, it must have seemed that the societal match which it symbolized was almost over, almost won. Racism had 'charged the net' in the South of Wallace and Faubus, and the ball had been lobbed out of reach. Watching the ads on TV today, couple-watching on the streets of American cities, noting the approval ratings of the First Couple in the White House, one could indeed say that Ashe's victory was prophetic of America's racial Redemption. \"Game, set, match to Lieutenant Ashe,\" McPhee wrote; \"When the stroke is finished, he is standing on his toes, his arms flung open, wide, and high.\"However, if we take this historic match as an analogy for the cultural match-up between conservatism and liberalism, McPhee's success as an oracle is less clear. In 1969 perhaps, the egalitarian ideals of the New Deal and the Great Society might have seemed pervasive and permanent. The 'loose' liberalism expressed in Ashe's tennis was the preferred style of American youth, and the tight hind-end game played by Graebner didn't stand a chance.Ahh, that was before the Culture Wars, before the 'Southern Strategy', before Reaganism and Ollie North, before egalitarian idealism got lost in the Bushes. What McPhee didn't foresee was that Clark Graebner's 'Republican tennis' could claw and scratch, rage and pout, and make a comeback. After all, they play how they are.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "In Levels of the Game, John McPhee once again creates narrative structure out of his subject matter, in this case, a tennis match. The book is ostensibly about a single game of tennis played by Arthur Ashe, the first great black tennis player and one of the best tennis players of all time, and Clark Graebner, a white tennis player who was Ashe's rival for many years on the amateur circuit.McPhee develops the two men as the opposite of each other: liberal v conservative, black v white, calm v emotional. And the narrative takes this another step. Just as the tennis ball bounces back and forth in a match, so does McPhee bounce back and forth between his two subjects, Ashe and Graebner, race and tennis. McPhee wants to draw a parallel between a person's background and their tennis-playing style, and for the most part, he succeeds.As any reader of nonfiction knows, John McPhee writes perfect sentences, does unparalleled research, and crafts his books like a master carpenter. Levels of the Game has all these typical McPhee traits, is easy to read, and full of insight. On the other hand, by todays standards, the book is awkward. The shifts back and forth from Ashe to Grabner, from past to present, become jarring over time, and some of McPhee's sentences are unusually stiff and formal, almost academic.Levels of the Game is a book about sports the way that Friday Night LightsFriday Night Lightsis a book about sports. It uses the game as a window into something else, an attempt to describe two very different men, and all that they represent in America in 1968.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "\"Levels of the Game\" is, on the surface, an account of a single match between Arthur Ashe and Clark Graebner in the semifinals at the U.S. Open in Forest Hills. But as the title suggests, a game --- any game, at any degree of competition --- is not just about competence. How you play is a revelation of character; how you play is who you are.It's on all the other levels that this is a great book --- one of the greatest you may ever read, period. First, because of the subject. Arthur Ashe was not the Jackie Robinson of tennis; when he emerged in the 1960s, he was the only African-American player of note in America. Clark Graebner was a dentist's son and a ringer for Clark Kent. As it happened, Ashe and Graebner were both best-of-breed. It's not inaccurate to say that they were friends. But you can't miss the notion that they are also archetypes: privileged white kid from Ohio vs. against-all-odds black kid from Virginia.In a mere 146 pages, John McPhee --- you know his byline from a zillion profiles in The New Yorker, many of them mesmerizing, some beyond dull, but all meticulously reported and more carved than written --- has pulled off a literary coup. He has written an account of the match that's thrilling sports reporting. After, he clearly interviewed Ashe and Graebner at length, for he recreates what they were thinking and feeling at every key point in the match. And then he goes still deeper, talking to parents and wives, coaches and mentors, so he can deliver acute biographies of each player and a revelatory portrait of a sport --- and a nation --- in transition.A mediocre writer would construct this book with long passages in italics. Or chapters that pull us out of the match and take us back to Virginia or Ohio. Well, you don't write a book called \"Levels of the Game\" without being aware of the levels of your craft --- and knowing that, when you settle yourself at the keyboard, you can play at a championship level.Which is not to say that the book reads like \"great writing\". Just the opposite. It reads like great storytelling. There are no flights of language. It's just great reporting. And then, for a paragraph or a page, the telling of a story that takes place far from Forest Hills that helps to explain why Ashe or Graebner are playing a certain way or having certain thoughts about their match.The biographical, historical and psychological passages are surprising. And thrilling --- you will be amazed at what Ashe had to overcome, and who helped, and how it worked out. And the same for Graebner, though, of course, the challenges are considerably smaller. But what's most exhilarating is when the strands merge, and you're both in the match and inside the players' heads. Like this:Now the thought crosses Graebner's mind that Ashe has not missed a service return in this game. The thought unnerves him a little. He hits a big one four feet too deep, then bloops his second serve with terrible placement right into the center of the service court. He now becomes the mouse, Ashe the cat. With soft, perfectly placed shots, Ashe jerks him around the forecourt, then closes off the point with a shot to remember. It is a forehand, with top spin, sent cross court so lightly that the ball appears to be flung rather than hit. Its angle to the net is less than ten degrees --- a difficult brilliant stroke, and Ashe hit it with such nonchalance that he appeared to be thinking of something else. Graebner feels the implications of this. Ashe is now obviously loose. Loose equals dangerous. When a player is loose, he serves and volleys at his best level. His general shotmaking ability is optimum. He will try anything. 'Look at the way he hit that ball, gave it the casual play,' Graebner says to himself. 'Instead of trying a silly shot and missing it, he tries the silly shot and makes it.'Notice what's missing: the construction \"he thought\". McPhee has no need to step back from the moment and use that writerly qualification. He knows what Graebner thinks --- he's writing from authority. And so every word can drive the narrative forward. The writing has the power and velocity of the game it describes.Everyone who likes tennis even a little will savor and learn from this book. But even more, anyone who likes good writing --- or aspires to write well --- should clutch \"Levels of the Game\" like a lifeline. The way you learn to write, after all, is to read great writing and imitate it until you break through to a style of your own. If that's your game, start here.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "coaching volleyball building a winning team",
        "description": "One of the most complete books on coaching volleyball ever printed - includes advice, tips, and cues that take the experienced coach years to accumulate. This comprehensive book covers every aspect of coaching volleyball - from the beginning basic skills to information on aiding the talented college-bound athlete. It guides the coach through the decision-making processes of tryouts, practice schedules, setting up the team's offense and defense, coaching a game, and dealing with parents and administrators. Here are the keys to creating a winning volleyball class or entire volleyball program from the elementary to collegiate level, based on the solid knowledge that comes with years of experience. Volleyball coaches and physical education teachers.",
        "authors": "['Carl McGown', 'Hilda Ann Fronske', 'Launa Moser']",
        "infoLink": "http://books.google.nl/books?id=dk0HQwAACAAJ&dq=Coaching+Volleyball:+Building+a+Winning+Team&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you buy ONE book on how to coach volleyball, make it this one. Carl McGown is the &quot;guru&quot; of volleyball and if you read this book, implement what it says, your team will be better RIGHT NOW!A book which goes beyond the x and o's to provide the coach with the correct skills and attitudes necessary to compete at a high level.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "As the subtitle \"Building a Winning Team\" implies, the book touches on the various aspects required to building a team. The authors do an admirable job of providing a wealth of information across a broad spectrum of topics. If you're interested in a general guide with the basics this is the book for you.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "McGowan is a master teacher. When you implement his ideas and theories you can't help but become an awesome coach and your athletes will improve their physical and mental skills at an incredible rate.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I played high school volleyball for one of these authors, so I grew up playing all of the drills and games in this book. I am now a college coach myself & I STILL use this book as a reference guide when I go to plan out a practice. Your athletes will love the different games included in the book that put a different spin on the regular game of volleyball.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "coaching youth football betterway coaching kids series",
        "description": "Handbooks in \"The Parent's Guide\" series serve as the perfect step-by-step introductory primers for parents and coaches. Written in an easy, conversational style, these books cover all the basic skill-building techniques, rules of the games, proper equipment, and first aid. in addition to the physical skills of the game, these guides focus on team spirit, the importance of fair play and overall fun. Special attention is paid to developing a child's confidence and self-esteem, as well. All books are heavily illustrated to help both the coach and child visualize the plays, drills and proper techniques. Filled with creative tips for working with children and personal anecdotes and suggestions, these books offer sound advice for all coaches.",
        "authors": "['John Mccarthy']",
        "infoLink": "http://books.google.com/books?id=b2JPrc-aimEC&dq=Coaching+Youth+Football+(Betterway+Coaching+Kids+Series)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book as part of a series of books that I was going through for youth coaching. I have been coaching for a couple of years now and was looking for maybe something that I could add to my team's game. This book was both disappointing and scary at the same time. I'll explain.Early on in the book the author suggests that yelling at the kids to get them fired up, even if you don't mean what you're saying (i.e. \"Kill'em!\") was a good thing, part of the game and suggested in so many words that it would separate the grittier players from the weaker ones. I'm not sure what kind of game he played when he was growing up, but I have never had a coach like that, nor do I coach my kids that way, and I've never had a problem with getting my kids fired up. Furthermore, it's insane for any coach to assume for one second that the game should be one of win-at-all-costs. Although he didn't say it directly, it appeared like it was more about the coach then it was about the players. Sure, he goes over the \"teamwork\" concept, but it was vague at best.On more than one occasion there was the feeling that you should coach your better players and yell at the weaker ones. What ever happened to, you know, coaching? For starters it should never be about you the coach... ever! It should always be about the players and the TEAM. There were a few entries about how you put your slower players on the offensive line and at the full back position (which I completely disagree with) and that your smartest player should go at QB. According to the author, the QB should be able to identify the defense being played, the blitzes, and the weak slots by the time he reaches the line of scrimmage from the huddle. Of course there are no suggestions on how exactly you are supposed to coach this professional level concept to a child.The book is filled with nice suggestions, but with no hint as to how to execute them. The techniques are maybe 50% accurate at best, and offer little in the way of correcting on-going errors. It just says to look for them. Right, because my 6th graders are all NFL caliber athletes that understand the intricacies of the game. The plays in the book are poorly illustrated, have no real explanations and will never work on a football field, ever, which is why I assume the author never posts anything about his success as a coach; probably because he hasn't had any.There are far better books than this one out there. Try \"Coaching Youth Football (Baffled Parent's Guides) by Paul Pasqualoni\". It is a far better quality book and absolutely designed for the first time coach in mind. In fact, even if you have only been coaching for a couple of years, like me, there is still tons of information in there that is far superior.This book is as irresponsible as it is dangerous, not to mention a complete waste of money. Don't waste your time on this book when there are far better ones available.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is an excellent book for the first time coach. I was asked to coach a team after another coach bowed out after the first week of practice due to family crisis. I had not been involved in football for 20 years and was lost. This book saved me. Lots of good information, particularly on how to run a practice, useful drills and fundamentals. Does not include a lot of offensive or defensive strategy (See the &quot;Coaching Youth Football&quot; series by John T. Reed) but tremendously useful in helping a beginning coach get up and running.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "the peaceful classroom in action a k6 activity guide on how to create one and how to keep it",
        "description": "This inspiring, practical and highly usable activity book shows how to create peaceful, productive classrooms from the first day of school. Teach students respect, acceptance and conflict resolution skills while also improving writing and language skills-important with today's emphasis on academics and accountability. The Peaceful Classroom in Action will show you how to: create a peaceful classroom from the first day of school build a climate of respect help kids resolve conflicts maintain an atmosphere of peacefulness throughout the year teach all your students, even your most difficult, how to be peacemakers improve your students' writing ability as you teach peacemaking concepts integrate literature and peacemaking build collaboration across the curriculum implement effective techniques for dealing with challenging students These simple peacemaking skills will enhance your students emotional competence and make classrooms everywhere caring and inviting places. (A companion book to \"Learning the Skills of Peacemaking\" by Naomi Drew) Grades K-6.",
        "authors": "['Naomi Drew']",
        "infoLink": "http://books.google.com/books?id=ogQBAAAACAAJ&dq=The+Peaceful+Classroom+in+Action:+A+k-6+Activity+Guide+on+How+to+Create+One+and+How+to+Keep+It!&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Let me just tell you that Peaceful Classroom has changed my life!! I am a totally different teacher today than I was 4 years ago. I feel that I am a much more positive and inspiring person and teacher. I want to thank you for helping that to happen. I am blown away by the response my children have taken to it. We read, write, discuss and role play each day to strengthen our understandings and passion for peace. It is just wonderful to be a part of it!I am so excited about the transformations and accomplishments that my school has made since adopting the Peaceful School concept. I cannot speak enough about it. I am constantly trying to refer other teachers to your books. I can't imagine teaching any other way now. I live and breathe peacemaking and my students are better friends and citizens because of it. So, again, THANK YOU!!!! I would highly recommend this book to any educator who strives to create a peaceful and productive learning environment for children.From my heart to yours,Stephanie WallaceMultiage Teacher(1st/2nd)Summerville, South Carolina",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "After using Naomi Drew's first book Learning the Skills of Peacemaking, I decided to try this one. I loved it! The Peaceful Classroom in Action helped me integrate writing and language arts with peacemaking. My students really enjoy the activities, they're getting along better, plus their writing skills have improved. I highly recommend this book. Not only is it helpful, it's laid out in a way that makes all the content extremely accessible. I wish there were more books out there like this one.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "coaching youth hockey 2nd edition coaching youth sports",
        "description": "Packed with drills and tips for practice and game days The fun and easy way(r) to kick-start your soccer coaching skills Volunteering as a youth soccer coach can be a great experience, both for you and your squad. But what if you've never coached before? Don't worry! This friendly guide explains soccer rules, shows you how to approach coaching, and gives you practical pointers on improving your team's soccer skills and encouraging good sportsmanship. Discover how to Understand soccer rules Develop a coaching philosophy Teach soccer fundamentals Run great practices Lead your team during a game Communicate effectively with parents",
        "authors": "['National Alliance for Youth Sports']",
        "infoLink": "https://play.google.com/store/books/details?id=zBMGm3dNPz0C&source=gbs_api",
        "review": [
            {
                "review/text": "This book offers a comprehensive set of introductory materials needed for the first time or experienced hockey coach. It is useful for either ice or roller hockey. I particularly appreciated the author's including the social, communication, and motivational aspects of coaching youth sports. Full of handy checklists and drills to emphasize the needed skills, this book provides a solid foundation for developing &quot;your own&quot; hockey teaching and coaching program. The drills and progressions are excellent. The book would be better with more technical emphasis on skating skills and techniques. But overall, I would recommend it for any coach or parent who is close to this fast-growing sport!",
                "review/helpfulness": "74/75",
                "num_reviews": 75
            },
            {
                "review/text": "I needed to understand how to teach children under 10 the game of Hockey and start towards gaining a coaching award in this age group. This book gives me a greater understanding of what turns on a childs interest and haw to maintain this interest.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "quotable wooden potent quotables",
        "description": "John Wooden was arguably the greatest college basketball coach of all time, a teacher as well as mentor whose handiwork produced a dynasty bridging the '60s and '70s. Quotable Wooden is a compilation of more than two-hundred inspiring quotes by and about Wooden. Other notables quoted include Kareem Abdul-Jabbar, Bill Walton, Denny Crum, and Rick Reilly.",
        "authors": "['John Reger']",
        "infoLink": "http://books.google.com/books?id=rI56mAEACAAJ&dq=Quotable+Wooden+(Potent+Quotables)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "John Reger has done a masterful job in collecting a wonderful variety of John Wooden quotes and organizing them in a way that gives the reader doses of Wooden's wisdom on a variety of subjects. The book is a quick, easy read and the only negative thing about it is that it comes to an end so soon. After reading Reger's book, it makes it easy to understand part of what made Wooden such a great coach. He was also a teacher, a motivator and a man who believed and stood behind his principals. He taught about life as much as about basketball.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I highly recommend this great, little book to anyone. Whether you are already familiar with the extraordinary life and career of Coach Wooden, or you are looking for a quick biography-like synopsis of Coach Wooden's incredible story, or even if you have never heard about Coach Wooden, this book can inform, inspire, and entertain you.This book contains over 200 quotes by and about John Wooden, the greatest college basketball coach of all time (10 national championships in 12 years, including 7 in-a-row and an 88-game winning streak), and, more importantly, one of the greatest teachers of morals, character, and life values. As a long-time fan of Coach Wooden, I was impressed with how the selected quotes accurately captured the essence of Wooden the Coach, and Wooden the Man. The chapter titles provided a great working outline of Wooden's life and the teaching environments from which he has taught, and continues to teach, so many life lessons to so many people over the last 60+ years: Indiana Years, Early Westwood Days, Practices, Games, Dynasty, Teacher, Pupils, Philosophy, Retirement, Tributes, The Game Today, and Family.Although best known for his accomplishments on the basketball court, by far Wooden's greatest contributions have been made off the court. Reger's skillful selection of personal snapshots and anecdotes from and for Coach Wooden truly show how positively influential one person can be in the lives of others. Reger accurately assessed Coach Wooden's character and influence and paid the ultimate compliment to Wooden the Man when he wrote, \"This world would be a better place if there were more human beings like John Wooden.\"",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "faith facts for young catholics drills games and activities for middle school students",
        "description": "Names of saints, Catholic vocabulary, biblical passages and lessons come to life as students drill individually and in friendly competition with one another to learn important lessons of their faith. 25 easy-to-use drills, games, and exercises that can be used for individual review or in the classroom. Answers are included as well as adaptations for each game.",
        "authors": "['Kieran Sawyer']",
        "infoLink": "http://books.google.com/books?id=CnYFAAAACAAJ&dq=Faith+Facts+for+Young+Catholics:+Drills,+Games+and+Activities+for+Middle+School+Students&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Faith Facts for Young Catholics is a great way to get kidsinvolved. The games and activities are easy to explain and you getseveral different activities per topic. I like the fact that youdon't need a lot of preparation. A Xerox machine is all that isrequired ahead of time. The kids will be having so much fun that theywill forget they are learning. This is a fun way to teach. This is agreat tool for young middle school students.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "Are you searching for a resource that makes learning the Catechism fun? Faith Facts for Young Catholics is an excellent resource for middle school Catechists. The activities for learning the ten commandments are engaging and encourage application to every day life. Scripture quote games are great tools for getting our Catholic kids to memorize and apply scripture. All in all Kieran has put together a great resource that I highly recommend for all middle school catechism classes.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I thought there would be more different topics for the drills, there are probably only 7 topics and each topic has 3 or more different ways of using the drills. I do like the Flash card concept. We have went away from memorizing and it is another good tool to learn with.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "secondary stages revitalizing high school theatre",
        "description": "Secondary Stages combines in one volume everything a high school teacher needs to organize and implement a sucessful, dynamic theatre program. Bennett's approach is based on a simple premise: that exposure to theatre can be an utterly transforming experience for students - one that enables them to reach unimagined levels of personal, emotional, and intellectual growth. His book delivers hands-on techniques to make it all happen, illustrating how to: draw interested students into the program inspire students to act with truth and conviction establish the connection between good improvisation and good scene work carry passion for theatre outside the classroom and into the mainstream of school life choose material that's stimulating enough to attract a sizable student audience without creating unwanted controversy structure activities and lessons so that they encourage maximum sensitivity and awareness lay the basis for mounting memorable productions. With these goals in mind and with more than three decades of experience, Bennett presents strategies that have consistently proven effective for the broadest possible range of students.",
        "authors": "['Jeff Bennett']",
        "infoLink": "http://books.google.com/books?id=rRfuAAAAMAAJ&dq=Secondary+Stages:+Revitalizing+High+School+Theatre&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have had the pleasure of being a former student of Jeff Bennett's classes in high school. Mr Bennett has shared a wealth of knowledge about the theater industry with me, but I believe he has taught me much more than just the theater.Jeff Bennett is a sage of wisdom, and through our countless conversations he has guided me on the right paths, in life as well as my career goals. By being my mentor through the troubling years of high school woe, Mr. Bennett has been the most influential teacher I have ever had.People who are involved in theater, or teaching theater at the secondary school level need to read this book.Yet, life-long learners would benefit from reading Jeff's perceptiveness.Jeff Bennett has the uncanny ability to connect with students of any age. Through this book, others can now share the privilege I have had for years.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "How many teachers can you remember who have had a signficant influence on your life. You can probably count them on the fingers of one hand, which in itself says something about the math teachers we've all had. The one vital thing that most teachers never discover is that the greatest thing we can &quot;teach&quot;is the excitement of learning, the thrill of discovery.A great acting teacher is not one who can most effectively direct actors where on teh stage to stand and with what expression to recite their lines. A great teacher helps, directs, creates the environment wherein the students can make discoveries. And any discovery is part of self-discovery.Jeff Bennet's book, SECONDARY STAGES is a roadmap to the process through which disovery becomes possible. It makes the journey dangerously safe, instructively fun. It methodically conducts us through the maze of adolescent psychology to the lovely place where spontaneity is possible.It is able to be inspirational and simultaneously grounded in practical reality. It is pedagogical (in the best sense) and simultaneously personal. The book is logically organized. Its structure is a function not only of ideas but of the experiential progression of the teacher-student relationship.It sets inspirational and practical goals, it offers pathways to get there, it identifies problem areas and offers incisive and practical ways of understanding them and solving them.It is a great guidebook for any student or teacher of the craft of acting...and of teaching.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the game win your life in 90 days",
        "description": "The motivational speaker offers a game with prizes, rules, time limits, and coaches to help readers set goals, measure results, and achieve personal and professional objectives.",
        "authors": "['Sarano Kelley']",
        "infoLink": "http://books.google.com/books?id=jqxvOwAACAAJ&dq=THE+GAME+Win+Your+Life+in+90+Days&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I sat through a Sarano Kelley seminar a few years ago while I was employed with a financial services firm. He is a dynamic speaker to say the least. He is also incredibly manipulative. He has a way of convincing everyone in the room they are \"asleep\" and need his \"Game\" very urgently. His game, or the away from home motivational boot camp he puts together in San Diego, costs over $20,000.00! You get up early in the morning, go through high physical exhaustion, highly emotional conversations, and then you get to the training sessions. When you are exhausted and emotional you are at your most vulnerable to suggestion. This is classic nuerolinguistic programming, or NLP. NLP techniques are how cults brainwash people. Look it up!Sarano also loved to talk about the movie The Matrix and how it was like real life. I guess he likens himself to the character of Morpheus. He has the way, the answers, the road to being awake in life while others sleep. Classic hucksterism.I went away from his seminar convinced I was a piece of crap and needed fixing. I even considered the whole \"Game\" program. I also knew I was manipulated. I soon started to get phone calls from their sales department trying to pressure me into the program. \"Just put it on your credit card\" they would tell me. When I asked them to stop the calls the sales person said, \"Well, it's obvious you're not coachable.\" The high pressure stuff felt evil and insincere!I will never forget Sarano. I will also never look at the whole business of motivational speakers the same again. I'm sure some are great and sincere. Some are nothing more than mind games that feed off of the frailty of the human condition.Don't buy his book. Don't drink the Coolaid.",
                "review/helpfulness": "27/36",
                "num_reviews": 36
            },
            {
                "review/text": "I played the game as a participant in the coaching program. It forever changed the way that I look at life. During the game I cleaned and reorganized closets, drawers and rooms. I built a zen garden in my backyard, painted a garden on my bedroom walls, reduced my body fat by 15% and increased my reading speed from 300 words per minute to 2600 words per minute. I recorded over 21,000 concious acts of will during the 90 days that I played the game.The value of choosing a partner for this game is immeasurable. It's good to have another person to be accountable to. This structure was very effective for me on those days that I was tempted to let a work-out slide or if I just didn't feel like completing on a committment.The book stresses the importance of structure, community and affinity in achieving goals. It guides the reader through exercises that help to put these in place. There are many real-life examples in the book from past &quot;game&quot; players. This clearly demonstrates that anyone can achieve their goals by putting the principles of The Game to work.The tone of the book is conversational, making it very easy to read. This is not just another self-help or motivational book. If you truly have the desire to realign your priorites and live your life with passion and purpose, you will enjoy this book.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Kelley's book covers a lot. I hope to do it justice while giving you a sense of what you'll find in it. First of all, there really is a &quot;Game&quot; that the author challenges and instructs you to play for 90 days (The game is very much like goal setting exercises transformed into a game you play with a partner). Kelley provides the rules, the scoring system, the strategies, and even a grand prize reward of $50,000 for whichever partner-team he deems to have changed their lives the most in 90 days.So what is the game? Well as the title implies, you are playing to improve your life dramatically. You choose the three or four areas you want to improve the most -- you are choosing from: Balance, Body and Health, Money, Relationships, Spiritual Life, Mind, Tools, Environment, Education, Family, Work, Charities, Hobbies, Interests, and Art. There is a chapter on each of these areas, full of excellent advice and true stories of previous game players, so that you have loads of strategies and inspiration to make your improvement. Let's say you read the book but opted to never register at the official website to play the game -- these chapters would still be worth the price. I liked the combination of smarts, specifics and spirituality woven into each one. But the originality of the book lies precisely in actually playing the game from start to finish -- from reading the book to turning in your final essay that extols your breakthroughs -- because the game provides an added motivation and support system that other books lack.My final comment would be this -- the books easily worth the price. The question is, once you read it, will you have the determination to play for 90 days? Realistically most won't -- it is a big challenge. But the ones who do will undoubtedly make major improvements. How could you not? Conscious, concentrated, focus on improvement for 90 days will change anyone's life. I humbly submit that if you are interested in succeeding, you will also like my book, Major in Success, especially for career or college success, it would be a great complement to Sarano's excellent book.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Being a psychiatrist I am exposed to man theories, publications, and other forms of communication regarding improving ones's life. As you can imagine I have become rather skeptical about this genre of &quot;self help&quot; titles. I began reading The Game by Mr. Kelley with a fairly high degree of doubt whether it would have any meaning or standout from other works of its ilk in any way. I must say I was pleasantly suprised and found Part I of to be an excellent outline for the one thing we all strive for... some degree of CONTROL in our lives. Mr. Kelley gives a clear and consise plan to begin this process, followed by more detail in Part II &amp; III, on how to accomplish this life long task. Having been an athlete The Game strikes a cord prompting me to re-examine several aspects of my life and make some changes. This was no mean feat for a cynical physician. I am even going to offer The Game to the employees in my practice as a Holiday gift. One will not find the Holy Grail in any book of this nature, or anywhere else for that matter, but with The Game at least you can begin the search.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Mr. Kelley provides a great conversation about all those 'messes, what-tos and to-dos' rattle around in mind. Why do we carry these for years and never perform? You know the lists: I have always wanted to get in shape, I'd really like a better relationship with my daughter, I should learn those cell phone features... and the like. Where do these come from and why are they always so frustratingly just out of reach?More important than recognizing these frustrations, Mr. Kelley provides an elegant solution. In the form of a Game, a very special game, he challenges and empowers us to climb life's mountains whether actual or symbolic. This book is not about theory. It is a wake-up call and a will get you too to perform. In the end, like with all good games, there is a PRIZE.The book is well written and easily read. It is full of personal stories from both Mr. Kelley and from his clients built up over years of coaching successful people to even higher performance. And, along the way you will learn some timeless lessons about what it is to be human. A future Classic.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I have been playing the game for over 90 days and the changes are amazing. I am more focused, relaxed and my business and perosnal relationships are being transfomred. Reading this book will dramatically change your life.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I recently had the ability to listen to Sarano speak, and I have read his book. Outstanding to say the least. He helps YOU realize what YOUR potential is and he helps YOU open your eyes to what is holding you back from being the best you can be. In all honestly, he made me face the things that I hated to face, and didn't want too, more importantly the truth. After you realize what is holding you back, he gets you on track to make the changes you need to make, not in the future, but in the NOW. I would recommend this book to anyone wanting to better themselves no matter if it professionally, personally, or spiritually.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Saraon is right we are all aslep. we get up, do our thing and hardly notice where we are and what we are doing. Very few of us reach our potential. Very few of us build on relationships and let friends help us. We all think we have to do it ourselves and end up frustrated because we know we have not reached our full potential. Sarano's insights into the humnan psyche are right on. He has found a way for us to wake up and reach for new levels of success. There is not a person on this earth that will not learn and grow if they apply just some of the ideas put forth by Sarano. Ted Fuller",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The Game is deceptively simple in construct. In chapter after chapter,busy people tell how applying simple disciplines worked in their lives when they competed in the &quot;game&quot;. The people are real. The changes in their lives are real, and some of them are dramatic. But the practical, simple, transforming work of the book is for each of us to decisively intervene on our own behalf in the sleepiness of daily life so that it becomes for us the miracle it really is. Yes, after a hundred pages or so the format of the story told is repetitive and even a little dull. The real news is however, that the book will do nothing in anyone's life who does not go to the website or call for help in setting up to play the game. Reading about the game will not do it! Only players savor the sweat and reap the benefits. If a prospective reader really wants to do something to enliven areas of her/his life then reading The Game combined with playing it with structure, affinity and community will alter the reader's level of awareness and increase the delight possible only in being present in the moment.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "The title, The Game: Win Your Life in 90 Days couldn't be more accurate. I read this book in one evening. I found myself so excited to get into action and accomplish the things I had always wanted for myself. I began to play the game with a co-worker of mine and started to see results immediately. It was when I decided to take The Game Class through The Coaching Program that people around me started noticing the changes in me. They made comments like, 'you seem so much happier' and 'you have been so pleasant to be around'. I realized that by playing the game and getting out of life what I had always dreamed, I had a new vitality and it was clear to everyone around me. No amount of money could have bought this new lease on life.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "ready to use physical education activities for grades 56 complete physical education activities program bk 3",
        "description": "\"Over 500 ready-to-use fitness-oriented activities and games [per book] to help you prepare and teach interesting, fun-packed physical education lessons tailored to your students's specific developmental needs.\" --Cover.",
        "authors": "['Maxwell J. Landy']",
        "infoLink": "http://books.google.com/books?id=7f59uwEACAAJ&dq=Ready+to+Use+Physical+Education+Activities+for+Grades+5-6:+Complete+Physical+Education+Activities+Program+(bk.+3)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is full of age-appropriate activities for P.E. teachers to use. I have used it in my student teaching at the University of Arizona and plan to use it while teaching. It contains all the areas of a good lesson: intro activity, fitness, game skills, and closing. Give it a try, you won't regret it.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "A very good resource for educators that require suggestions on activities for PE. I suggest all my students in my elementary teaching physical education to purchase this resource.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "soccer for dummies",
        "description": "Packed with drills and tips for practice and game days The fun and easy way(r) to kick-start your soccer coaching skills Volunteering as a youth soccer coach can be a great experience, both for you and your squad. But what if you've never coached before? Don't worry! This friendly guide explains soccer rules, shows you how to approach coaching, and gives you practical pointers on improving your team's soccer skills and encouraging good sportsmanship. Discover how to Understand soccer rules Develop a coaching philosophy Teach soccer fundamentals Run great practices Lead your team during a game Communicate effectively with parents",
        "authors": "['National Alliance for Youth Sports']",
        "infoLink": "http://books.google.com/books?id=CvzIAgAAQBAJ&dq=Soccer+for+Dummies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the first time I have reviewed a book for Amazon. I am doing this because I consider this book to be 100% garbage.If you are looking for a book full of annoying cross references (i.e. see page 118; see page 73) and for a book which repeats the same quotes or phrases in different chapters (was there really no editor?) BUY THIS BOOK.Also, if you are looking for cheap tid-bits and trivia about the US women's soccer team (was it really necessary to write three times about one female ripping her shirt off after a goal?) BUT THIS BOOK.If you want to have a general overview about the rules of Soccer but want nothing of strategy, technique, training, then BUY THIS BOOK. (or why not just go to the FIFA website and download the same rules which make up 50% of this book)But if you want to learn how to play or coach soccer, forget it. This book is a COMPLETE waste of time.",
                "review/helpfulness": "49/68",
                "num_reviews": 68
            },
            {
                "review/text": "This is the best soccer guide I've found yet! It begins with basics (rules, positions, equipment) that really helped this soccer dummy feel at ease with the game. It progresses through the fundamentals to excellent instruction on preparing and coaching, and includes additional information that will make the game more enjoyable to watch as well. The 28 chapters and two appendices are well organized into seven sections: Getting Started, Fundamentals of the Game, Calling All Soccer Moms and Dads, A Spectator's Guide, From Saturday Soccer to the World Stage, The Part of Tens (which includes several soccer &quot;top ten&quot; lists that help you &quot;talk the talk&quot;), and Appendices (a glossary and a list of soccer associations). The book is well illustrated with all the photos and diagrams needed to learn to perform those essential, parental soccer duties. It also includes useful annotations of tips and warnings (injury prevention, player's tips, etc.) you need to know. The 16-page index allows this book to be useful as a field guide as well. As a soccer-challenged father with four daughters, I love this book. It is helping turn what was a chore into quality time with my girls.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "If you have never played soccer this book might be 'just' OK for you. The book gives some basics of the game but then completely skips tactics and goes into all the different league types in the USA and the 10 best world players and than 10 best US players and then does reviews of certain great games. But once it lists the basics it misses tactics and goes straight to soccer History. If you play the game try the 'usborne soccer school' booklets instead. They're short but at least well written. I've bought 10 'For Dummies' books and have never been disappointed till now!",
                "review/helpfulness": "25/31",
                "num_reviews": 31
            },
            {
                "review/text": "Carries on the excellent tradition of the &quot;for dummies&quot; books: offers solid content and information for veteran soccer afficionados while organized as a well-written, well rounded introduction for the novice. Gives comprehensive overviews about all aspects of the game -- rules, strategies, the world of professional soccer (the leagues, tournaments, events), as well as an excellent history of the game and its development. It's refreshing to see a book for newcomers that doesn't strip things down - there is a wealth of well-researched information here that is useful for the experienced fan or participant.",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "An excellent refresher for those out-of-touch with soccer as well as for those just learning the game. As the parent of a former high school and college soccer player, but that was a few years back, I thought I knew the game. Now with 4 grandchildren playing, I wanted a easy-to-read refresher. This is it. I applaud the writer and encourage all who are players, or spectators, to spend a few evenings with this easy, and fun to read, book. It is very well done.Phil",
                "review/helpfulness": "15/16",
                "num_reviews": 16
            },
            {
                "review/text": "I just wanted to know what the rules, plays, and basic strategies of soccer were. There's almost none of that here - I wasted my money.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "Soccer For Dummies is an excellent introduction for anyone who wants to understand the game of soccer. This book covers every aspect of the game, from the rules and the equipment used all the way up to soccer strategies and formations. This work also provides detailed information about international soccer and soccer clubs. The only improvement I could suggest for this book is that some of the illustrations are not helpful and that certain rules are not illustrated (the offsides rules definitely needs an illustration or two).",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I bought this book for my husband because my son started Soccer for the 1st time and my husband has no clue about the sport. He says that this book has helped him out a lot in understanding the game!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "big game small world a basketball adventure",
        "description": "Alex Wolff canvasses the globe and travels to 16 different countries (and 10 states in the U.S.) to find out exactly why basketball has become a worldwide phenomenon. Whether it's in a pick-up game on the Royal court in Bhutan, in the heart of a former female college player of the year turned cloistered nun, in the tragedy of the legendary junior national team in war torn Yugoslavia, or in the life's work of one of the greatest players to ever play in the NBA, Alex Wolff discovers that basketball can define an individual, a race, a culture, and in some instances even a country. Fusing John Feinstein's talent for finding the human drama behind sport with Bill Bryson's travelogue style, Wolff shows how the power and love of basketball extends to the four corners of the earth and engages people of all cultures, races, genders, and generations.",
        "authors": "['Alexander Wolff']",
        "infoLink": "http://books.google.com/books?id=lXPepy2Z3gYC&dq=Big+Game,+Small+World:+A+Basketball+Adventure&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The book is a basketball travelogue that takes the reader around the world to illustrate the global nature and universal appeal of the game of basketball. As a fan of Ivy League basketball two chapters in particular stood out to me: &quot;Philadelphia: Quaker Meeting House&quot; and &quot;Princeton, New Jersey: Through the Back Door&quot;As you might have guessed, the &quot;Quaker meeting house&quot; in question is the Palestra. The first half of the chapter recounts the past glories of the building while the latter half brings to life the famous Penn-Princeton game that took place on February 9, 1999.The Princeton chapter deals with the legendary &quot;Princeton offense.&quot; It uses the context of lunchtime pickup games at Princeton's Jadwin Gym to make its points and gives a wonderful look inside the family atmosphere that permeates Princeton basketball like few other college basketball programs.I would add &quot;Big Game, Small World&quot; to a list of recommended basketball reading that includes John Feinstein's superb &quot;The Last Amateurs.&quot;",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "'Big Game, Small World' is a modern bible of basketball. The NBA has never been more popular, and just one look at any team's roster will tell you how global the game has become. At the World Championships this summer, more than thirty players on international teams will have NBA experience on their resumes.'Big Game, Small World' documents the intercontinental journey of Alex Wolff, in pursuit of his self-stated goal: rediscovering the game of basketball. From Ireland to Angola, Wolff provides us with unique and often amusing anecdotes showcasing how universal basketball has become.Alex Wolff only further establishes his already unquestioned position as the premier sportswriter in America. His prose is always clear and concise, and he never fails to get the story everyone can appreciate. His mastery of the craft is as evident in this book as anywhere.For all fans of modern basketball, young and old alike, 'Big Game, Small World' is the one piece of basketball literature you must own.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This may be the most far-reaching basketball book I have ever read. Wolff chronicles the game's impact and value in such disparate locations such as a modernizing China, the backwaters of Eastern Europe, and even within Bill Bradley's aborted 2000 presidential campaign!Since the author visits such a long list of out-of-the-way places, you would expect his prose or reporting to suffer as the book progresses. Rather, Wolff keeps the story light and full of offbeat humor, while using his sharp skills to sniff out a story. For example, the author learns much about the Phillippines' national league and even meets the country's greatest player. Yet he is not satisfied with basketball's role in the country until he wanders the streets and unearths the tale of a local's fight to build a community court.The story is broken down into epsiodes, as Wolff devotes each chapter to one of his stops. This makes it easy, should a particular subject or country interest you, to read the book slightly out of order. Yet the author does tie together many of his threads, and makes Big Game, Small World an informative look at the ways the game of basketball is shaping (and being shaped by) the world, as well as doubling as a minor commentary on many countries' natures and traditions.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "arie selengers power volleyball",
        "description": "Describes the basic rules and skills of volleyball, explains team strategies, and discusses training and preparation",
        "authors": "['Arie Selenger']",
        "infoLink": "http://books.google.nl/books?id=zSN2QgAACAAJ&dq=Arie+Selenger%27s+Power+Volleyball&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I just returned from an Arie Selinger camp and it was terrific. The man is passionate about the sport and is obviously extremely knowledgable. He has spent the last 40 years thinking about the training and the teaching of the game. Whether it has to do with technique, strategy, training, mental game, or state of the game, he has an opinion which is more than backed up with experience and data. Lots of data.The book is a little problematic in that the explanations of the concepts are a little too involved for the beginning coach. But the man is obviously the foremost thinker on the game that the American game has seen in a long time. You may disagree with his conclusions, but his attention to detail and his arguements for his ideas are very strong. He is a great believer in statistics and measuring progress, so a lot of it has to do with measuring athlete accomplishments.If you are looking to get a book to help your kids with their intramural team, forget about this book. If you are out to learn to coach volleyball at a very high level, this could be the one book you need. Keep in mind that he has always dealt with the highest level of athletes and have had the luxury of training six hours a day seven days a week, so some of the offense are way too complicated, even for college teams. But they are good ideas which stimulated even more ideas.I wish he had put in more of his unique training ideas based on the Asian training methodology, but that is quibbling.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Arie Selinger is a legend among coaches, and this book won't let fans of the former coach of the U.S. Women's Olympic Team down. Whether you want to learn more about Arie's philosophy or to pick up some tips for your own game, this book is worth a read.As a high school coach, I've implemented many of Arie's ideas into the program I took over 3 years ago, a program that had struggled for decades. And this season, I'm proud to say, we posted only the 3rd winning record in school history. A complete turnaround in 3 years!Our girls now FEEL like winners, and players that's the first step toward becoming winners. Arie Selenger's Power Volleyball helped bring that change about, and that's high praise, indeed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I consider this book to be one of the best ever written.The detail is fantastic.I refer to sections every week.I was just reviewing the section on spiking.A few weeks ago I reviewed the team play on the down call.Every time I read it I learn more.I just want Arie to write a new book with his experience in JapanVic LindalCanadian National coach 69 to 72currently coaching club (16 and 17 girls)On Vancouver Island BC",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "age of empires iii sybex official strategies and secrets sybex official strategies secrets",
        "description": "This exclusive, official strategy guide, written with the full cooperation and support of Ensemble Studios and Microsoft Game Studios, features: Strategies and tips straight from the game's creators Expert analysis of each civilization's strengths and weaknesses Detailed military and economic strategies In-depth statistics for everything in the game Step-by-step walkthrough of the single-player campaign Hardcore multiplayer tactics for every game mode",
        "authors": "['Doug Radcliffe', 'Michael Rymaszewski']",
        "infoLink": "http://books.google.com/books?id=mtpJAAAACAAJ&dq=Age+of+Empires+III:+Sybex+Official+Strategies+and+Secrets+(Sybex+Official+Strategies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In a word: exceptional! I don't play many real time games, so a good strategy guide is a must for me. This one is really, really good. I wish the author wrote for some other games I foolishly bought.And now the rant: Most strategy guides I've purchased in the last 5-6 years are not worth the price of the paper they're printed on. And a lot of games that don't have one, truly should. I wonder if anyone else has noticed how rare good, clearly written, complete, illustrated game manuals have become?Anyway, if you're thinking of buying this guide: do!",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "Filled with many helpfull tips and tricks anyone who plays Age of Empires 3 needs this guide.I don't care if you say you are plenty good at this game already(I was), there will surely be something in that will make AoE 3 even more fun to play! It features:Great and in-depth analysises of each civilization as well as strategies for them(even the native americans!).Great economic and militaristic strategies as well as multiplayer strategies from the experts.A helpful appendix showing every unit, shipment, and upgrade and what each one does.Step by step walkthrough for the single player campaign.Great strategies and suggestions for your home city as well as telling you what cards are keepers and what ones are not and so more.The thing I loved most about this guide is that(though the suggested strategies are killer) I was never given the feeling that I had to play the game just like those suggestions said as so many other guides do. You can always mix in your own touch creating a new(and maybe improved)strategy.This guide is the only one that I have that is not a prima's official; it's also the best. For twelve bucks this 280 page guide is a must have for anyone who owns AoE 3. Even if they don't love the game this guide will shed new light on it and get them begging to play.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "The guide is well written and covers most relevant topics. It will give you a head start in understanding the game, and the opportunity to start and finish levels easilly.What I did miss is some color in the guide, it's all black and white which makes it more boring to read.All in all, worth the money.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I am a big age fan since AOE II. This guide has helped me get up to speed on AOE III quick. I especially like the strategies for each civilization as laid out in chapter 5 . I also found the cilization strategies from members of the AOE III team in chapter nine very helpful.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Filled with many helpfull tips and tricks anyone who plays Age of Empires 3 needs this guide.I don't care if you say you are plenty good at this game already(I was), there will surely be something in that will make AoE 3 even more fun to play! It features:Great and in-depth analysises of each civilization as well as strategies for them(even the native americans!).Great economic and militaristic strategies as well as multiplayer strategies from the experts.A helpful appendix showing every unit, shipment, and upgrade and what each one does.Step by step walkthrough for the single player campaign.Great strategies and suggestions for your home city as well as telling you what cards are keepers and what ones are not and so more.The thing I loved most about this guide is that(though the suggested strategies are killer) I was never given the feeling that I had to play the game just like those suggestions said as so many other guides do. You can always mix in your own touch creating a new(and maybe improved)strategy.This guide is the only one that I have that is not a prima's official; it's also the best. For twelve bucks this 280 page guide is a must have for anyone who owns AoE 3. Even if they don't love the game this guide will shed new light on it and get them begging to play.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "heaven is a playground",
        "description": "In 1974, Rick Telander intended to spend a few days doing a magazine piece on the court wizards of Brooklyn's Bedford-Stuyvesant. He ended up staying the entire summer, becoming part of the players' lives and eventually the coach of a loose aggregation known as the Subway Stars. Telander tells of everything he saw: the on-court flash, the off-court jargon, the late-night graffiti raids, the tireless efforts of one promoter-hustler-benefactor to get these kids a chance at a college education. He lets the kids speak for themselves, revealing their grand dreams and ambitions. But he never flinches from showing us how far their dreams are from reality. The roots of today's inner-city basketball can be traced to the world Telander presents in \"Heaven is a Playground,\" the first book of its kind. Rick Telander is a senior writer for \"Sports Illustrated\" and the winner of the 1987 Notre Dame Club Award for Excellence in Sports Journalism.",
        "authors": "['Rick Telander']",
        "infoLink": "http://books.google.com/books?id=zqAmx_SNOV8C&dq=Heaven+Is+a+Playground&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I've read a few really good books on basketball -- David Wolf's &quot;Foul,&quot; and John Feinstein's &quot;A Season on the Brink&quot; immediately come to mind -- but Rick Telander's &quot;Heaven Is a Playground&quot; is the best, for my money. This book captures not only the spirit of the game, but also vividly recreates a time (the mid-70s) and a place (Brooklyn).Telander was in his 20s in 1974 when he went to Brooklyn to spend a summer, in part because he was in search of the elusive playground legend James &quot;Fly&quot; Williams, who figures prominently in the book. During the course of the three months he was there, however, he met, played with, interviewed and befriended a host of regulars at the courts in Foster Park in the Flatbush section of the borough. They were African-American boys and men for whom basketball was far more than recreation. For many of them, the game was a way of life and even more importantly a form of self-expression.Besides Williams, Telander also met Albert King, then an astonishingly gifted 14-year-old, who was to go on to a successful NBA career. Telander brings to life the court skills of King and others, but he humanizes them, and this is where the great strength of the book lies. For example, King agonized over his talent, which brought him attention and adulation that embarrassed him and sometimes made him angry and withdrawn. Williams' incredible pure talent was married to an unpredictable and sometimes violent temperament that ultimately shortened his career.Despite an obvious empathy for his subjects -- he wound up coaching a group of teenage park regulars, with mixed on-the-court success -- Telander does not romanticize them. Flatbush, Bedford-Stuyvesant and Brownsville, where the action of the book primarily takes place, were poverty-stricken, crime-ridden places. Many of the people Telander spent extensive time with were scarred by their environment, and he does not try to hide that. Though the book is refreshingly free of a sense of &quot;white guilt,&quot; Telander does agonize at one point over a boy he left off his team who succumbed to drug use and was later killed.At times funny, often poignant, and filled with a love for its subject, &quot;Heaven Is a Playground&quot; remains an engrossing, and still timely, read nearly 30 years after its publication.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I read this book around '93, just after having read the \"white version\" in both Larry Bird's biography and autobiography. What was interesting was these two very similar yet distinct experiences and how they related to my own experience, growing up it what would seem like a very safe and socially adjusted rural town.Heaven is a Playground was a departure for me in to a world where basketball had the utmost symbolic and cultural meaning - where legends were born and died and everybody else was willing to take the gamble. Was basketball more a sacrifice of a better future (missing school) or a one shot escape from certain poverty? Telander would probably argue the latter. What I found interesting was that only a few of the characters in the story actually had the potential for professional basketball, yet all the other young men seemed (unconsciously) willing to sacrifice their own futures for those players. Not so much blinded by their dreams they were living them.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Certainly some other reviewers have me beat in the department of basketball-related literature, but I count \"Heaven Is A Playground\" amongst the many social science books that I have read. And indeed, it matches up quite well with the best reads of the past few decades. On the surface, the book seems to be about inner-city basketball, but within the pages, it is a complete dissection of the (one segment) inner city African-American man.The amazing book \"Tally's Corner\" managed the same feat in its analysis of street corner men. Both have achieved great feats with their respective works. For basketball fans like myself, \"Heaven Is A Playground\" not only reads as great/sad/true/mystifying social commentary, but also as plain sports entertainment. Rick Telander, as a sports writer, was really able to hit home with the writing, really giving readers a feel of the 1970s game - which has many similarities and differences to the game of today.Another great aspect of the book is that it reads as if you there. Telander makes only the necessary analysis in the pages about what went on, and basically leaves the facts as they are. The book could have easily become a textbook lesson on sociological concepts, a lofty preaching on the ills of inner city life, or a rambling 200+ page play-by-play. Fortunately, the easy going style of writing is great journalism. Telander's style fit me well.Thanks Rick for a great read.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I have read this book once a year since I first picked it up 14 years ago as a 16 year old playground junkie. It is a primer for learning the rhythms of America's premiere urban sport, basketball. It is also about Telander's love for the game. I always remember the manifesto on a sticker in Rodney Parker's Flatbush apartment - &quot;Basketball - it's a way of life&quot; One of the great thrills of my life was having the opportunity to interview Rick as an undergrad at DePaul University in Chicago for the student newspaper. He was encouraging to a young, aspiring writer to undertake such a project like this while still young if that's what I wanted to do. A couple of years later, I found myself living in Newark, NJ. While there in 1994, I went on a Saturday afternoon to Foster Park and hooped all day long. I remember being so happy going home on the subway, thinking, &quot;I did it! I played in the spot that has given me such happiness over the years.&quot; To anyone who wants to visit Foster Park to go play, I say do it! You won't be disappointed.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "With this book Rick Telander has captured the sociology of inner-city basketball. These kids do not see basketball as merely a sport but as a means to an end. It is a ticket to a better way of life that can become an obsession for some (such as Clavin Franks). In this book Telander points out all that is good about basketball and some of the bad. This book should be read by all basketball fans, especially those who dream of playing in the NBA. If you liked this book you should also check out the movie &quot;Soul in the Hole.&quot; It is a movie about Brooklyn playground legend Edward &quot;Booger&quot; Smith.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is the best book on basketball I've ever read. First read it when I was a kid in the late '70's, and it still rings as true today. Just about the best sportswriting ever.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "more theatre games for young performers improvisations and exercises for developing acting skills",
        "description": "By popular demand, we offer a follow-up book of theatre games specifically for young acting students. Written especially for those who coach adolescent actors, this delightfully fresh updated workbook tells you how, when, what and why of theatre games for young performers. Starter scenes allow first-time performers to ease onto the stage in baby steps. Spontaneity is encouraged along with etiquette and basic acting principles. The concept of pantomime, improvisation, character development, voice and body control are all presented in game format with exercises. Anyone working with young actors in schools or recreational centres will find the book exceptionally helpful.",
        "authors": "['Suzi Zimmerman']",
        "infoLink": "http://books.google.com/books?id=A0UIAQAAMAAJ&dq=More+Theatre+Games+for+Young+Performers:+Improvisations+and+Exercises+for+Developing+Acting+Skills&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Zimmerman did it again! Her previous work, Intro to Theatre Arts was a clear, readable and comprehensive textbook for middle and high school theatre. Her present work is not only a collection of games and exercises for the classroom, but a creative, logical, and step by step approach to incorporating improv into any middle school or high school curriculum. She includes forms for the students to evaluate their own work. Many of the games are old hat to experienced teachers but there are a number of unique exercises and even non-acting theatre games that even the seasoned professional educator may find of interest. Zimmerman starts off each chapter with an inspirational story about a theatre educator.I must admit that this review may be biased since she uses one of my games in her book.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Had this book been written in the mid 80's it may have been vaguely cutting edge. As a first edition published in 2004, it is sadly behind the times. It gives me the small town \"Waiting for Guffman\" feel, and NOT in a good way.The commentary in this book is not helpful and should be eliminated almost in its entirety. I also did not find any of the games listed as new material. These games were either old games that had been re-named or fragmented versions of other games. One google search on the internet would have brought me closer to a new game than the entirety of this book.Many of the scene examples in the book break the iron clad laws of Improv: 1) Yes, and 2) Don't ask questions and 3) No real time I.S.C. (Improv Stage Combat). As a teaching tool, especially for young children (is the target market for this book middle school children?) this book missed the mark. If a teacher wants to teach children to be polished and clever Improvisers, (s)he needs to make sure the children have a strong basic understanding of the Improv rules, especially for short form games.The author of this book needs to read the Pearls of Wisdom from \"Truth in Comedy\" by Charna Halpern, Del Close, Kim Johnson, the bulleted pearls are helpful for beginners. She should then read anything by Viola Spolin, \"Theater Games for the Classroom: A Teacher's Handbook\" or \"Improvisation for the Theater\". She should also read \"Group Improvisation: The Manual of Ensemble Improv Games\" by Peter Gwinn.I teach high school Improv and am currently putting together an Improv book list of items that will be added to the school library. Unfortunately, this book is nowhere on that list.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "my losing season",
        "description": "NEW YORK TIMES BESTSELLER -> A deeply affecting coming-of-age memoir about family, love, loss, basketball-and life itself-by the beloved author of The Prince of Tides and The Great Santini During one unforgettable season as a Citadel cadet, Pat Conroy becomes part of a basketball team that is ultimately destined to fail. And yet for a military kid who grew up on the move, the Bulldogs provide a sanctuary from the cold, abrasive father who dominates his life-and a crucible for becoming his own man. With all the drama and incandescence of his bestselling fiction, Conroy re-creates his pivotal senior year as captain of the Citadel Bulldogs. He chronicles the highs and lows of that fateful 1966-67 season, his tough disciplinarian coach, the joys of winning, and the hard-won lessons of losing. Most of all, he recounts how a group of boys came together as a team, playing a sport that would become a metaphor for a man whose spirit could never be defeated. Praise for My Losing Season \"A superb accomplishment, maybe the finest book Pat Conroy has written.\"-The Washington Post Book World \"A wonderfully rich memoir that you don't have to be a sports fan to love.\"-Houston Chronicle \"A memoir with all the Conroy trademarks . . . Here's ample proof that losers always tell the best stories.\"-Newsweek \"In My Losing Season, Conroy opens his arms wide to embrace his difficult past and almost everyone in it.\"-New York Daily News \"Haunting, bittersweet and as compelling as his bestselling fiction.\"-Boston Herald",
        "authors": "['Pat Conroy']",
        "infoLink": "https://play.google.com/store/books/details?id=YuCyFqLYjyoC&source=gbs_api",
        "review": [
            {
                "review/text": "There's a scene in a 1970s movie in which Gene Hackman tries to grind up a broken wine glass in a garbage disposal. Reading this book is a lot like that.I picked up &quot;My Losing Season&quot; not as a great fan of Pat Conroy or as a former athlete. I was attracted more by the theme of loss and its lessons. And I expected a different personal story than the one Conroy tells. The losing basketball season in his last year as a cadet at The Citadel in Charleston, SC, is a pretext for a much deeper theme - survival in the face of humiliation.And it's not the losses of the games that are humiliating. On the one hand is the brutal and unrelenting contempt of his marine colonel father, a child abuser and wife beater. On the other hand is the withering scorn of Conroy's arbitrary and capricious coach, Mel Thompson. Both, in Conroy's account, do their best to beat the spirit out of the boy who has grown into an indomitable (though undersized and modestly talented) point guard for his team. And all of this takes place in the regimented, fierce, all-male environment of The Citadel in the 1960s, where incoming boys are routinely broken by the merciless hazing of their upperclassmen.Humiliation is a much more difficult subject than loss to deal with. Loss leaves scars, but humiliation remains an open wound, and in writing about it there is the risk of slipping into the tug of war between self-pity and self-blame. Conroy takes us there sometimes, and those are the parts of his story that are lacerating. But win or lose, the ups and downs of the season are fascinating and the accounts of the games are thrilling. As a writer, he has a gift for hustling the reader with suspense and drama and sudden shifts of mood. As an observer of character, he vividly brings to life the individual boys who make up the team. As someone deeply wounded, he is able to freely and convincingly express the many articulations of the heart - especially love, admiration, and gratitude.Once I started into this book, I could not put it down. It kept me reading late into the night. And when I wasn't reading, it filled my thoughts, as I'm sure it will for a long time. It's a troubling book that wants to resolve a host of dark memories. And it may well want to show the reader how to do the same. I'm not sure that it's completely successful in either regard. And maybe that's the point. It's enough to recast humiliation as loss. That is a wound that can eventually heal.",
                "review/helpfulness": "114/115",
                "num_reviews": 115
            },
            {
                "review/text": "I was a bit unsure at first if I was ready to read a non fiction work by Pat Conroy. I enjoy non fiction and have lately devoted most of my reading to it, but I wasn't sure what I was going to be getting when I read the description of &quot;My Losing Season&quot;. After all, who cares about an unknown college basketball team that played in the sixties?I haven't read all of Mr. Conroy's books yet, not because I don't think he is one of the great writers of all time, but because I know that I'll only get to read them once for the first time. My introduction into his worlds of fiction caught me by surprise because I was well into 'The Prince of Tides' before I realized that the book wasn't a true story. I now realize after reading 'My Losing Season' that everything he writes is true, even the fiction.I would have broken down crying several times during the reading of this book, but my heart is still guarded by never sleeping sentinels whose tireless detail is to walk the stone walls that guard my interior. Mr. Conroy manages to gain an entrance, however, and at times during reading his work I feel a sense of hatred towards him. Not meanness, just anger with no where to go.So what is it about this book, this story that makes it so worth reading? The nakedness that Pat Conroy brings to the page. The truth. Simple and raw and courageous. Enduring and joyful, sad and painful.I envy his memories, his legacy, his past, not because I feel that the journey was easy or he was lucky, but because whatever molded him into the man he became, whatever blessing or curse that was bestowed him at birth, whatever angels or demons followed his path, he has been able to live outside of the shells and caves and fortresses that most of us dwell in. Or at least he has done so enough to make a difference.While I can't recommend 'My Losing Season' enough, I do have one slight reservation, that being I don't know whether or not a first time reader will enjoy it more before or after they've read one of his previous books. But do read it, whether or not you are familiar with basketball, military colleges or the journey of broken boys trying to become men, you will turn the last page wishing there was more. I promise.",
                "review/helpfulness": "60/64",
                "num_reviews": 64
            },
            {
                "review/text": "This is a well-written book for anyone who ever experienced failure or the fear of failure while trying very hard to succeed. \"My Losing Season\" is an autobiography that focuses on the author's senior year as a college basketball player at The Citadel, the famous military school in Charleston, South Carolina. The Citadel Code begins with, \"To revere God, love my country, and be loyal to The Citadel. To be faithful, honest, and sincere in every act and purpose and to know that honorable failure is better than success by unfairness or cheating.\"This book holds a demonstration of how to grow more honest with oneself and sincere with others. This is a story of fear, sadism, injury, failure and loss and how these can lead to courage and achievement or degradation and estrangement.In a way that smells like truth, Conroy tells his story, reconstructing memories over 30 years old. His understanding matures as he reconnects with the shattered team of his youth and the boy that failed them. He doesn't blame, he reveals - everything. When Conroy writes about himself, he is telling the truth about all of us. When reading this poetic work, one cannot avoid feeling connected to deeper truths of the human condition. There is no better way to spend one's reading time.",
                "review/helpfulness": "61/64",
                "num_reviews": 64
            },
            {
                "review/text": "MY LOSING SEASON is a sports memoir as honest and heartbreaking as a double overtime loss to a hated rival.It is also the only memoir that deals directly with the true story --- step by step, game by game --- of an NCAA Division I basketball team that won a mere eight games (out of 25). This is counterintuitive for a sports book. You see, we are supposed to remember those athletes and teams that never lose, the Knute Rocknes, not the Bill Buckners. Yet both examples offer powerful stories.This was the only type of sports book Pat Conroy could write.In a moment of kismet while on the book tour for BEACH MUSIC, Conroy reconnected with his former teammate John DeBrosse. They found themselves replaying the minutiae of a loss on a basketball court 30 years ago. Both men were marked by that losing season. This encounter served as catalyst to search for meaning from this lost season. Conroy devoted two years to pouring through old newspaper clips, interviewing former teammates and diving into his own memories to reignite the fires of regret and disappointment.He recalls that the best memories his teammates had from the 1966-67 Citadel Bulldogs Varsity Basketball team were of the great players they went up against. They remember the Michael Jordans --- or in this case the Johnny Moates. Conroy writes, \"In every home I entered as I reconstituted my team, I found instead of memory scar tissue and nerve damage. There is no downside to winning. It feels forever fabulous. But there is no teacher more discriminating or transforming than loss.\"This memoir peeks audaciously into the minds of players on a losing team: what made them tick, what they thought and who made them what they became. So the daring part is --- who cares about a bunch of losers?You will, and whether or not you ever played college ball you will soon discover what pushed this entire team to fixate on a single season, letting it overshadow major accomplishments. This was no ordinary team --- these men were the products of the Citadel, a military college in Charleston, South Carolina. Recounting the emotional destruction that is Plebe life (freshman military hazing) to the harsh demands of athletic scholarships (vomiting on the basketball court during six-hour workouts), it is the story of a terrible rise to manhood in a microcosm.Before landing at the Citadel, Conroy was a military brat whose family was always on the move, with the only consistency being a father who wielded love with flying fists and words of debasement. Bloody beatings, unexplainable scars and raw masculine brutality slowly built the foundation of Conroy's childhood memories. His very first memory is from age 2, \"my mother tried to stab him (Conroy's father, Colonel Donald Conroy) with a butcher knife and he backhanded her to the floor, laughing, a scene I observed from my high chair.\" After each game Conroy played, his father made a point to wait and dismantle his self worth. He loomed above him at 6' 4\" to his 5' 10\". \"You're ... You didn't have an off night. You couldn't hold my jock as a ballplayer. I used to eat guys alive on the court,\" he would say.The treatment of Conroy by his father is often overwhelming. At age 9 the young Conroy decides to become the best basketball player alive and prove his worth to his father. At 17, when he enters the Citadel, he is a human emotional husk (a neophyte, a virgin), and it becomes for him the ultimate fantasy to conquer the windmills of his father's brutal Chicago childhood. He wants to show his father he exists, that he is unique and worthy of love.The intimate domestic politics of Pat Conroy's family is well-mined territory (THE GREAT SANTINI., THE LORDS OF DISCIPLINE, THE PRINCE OF TIDES, BEACH MUSIC), but never has it moved with such visceral force as when it is described through the eyes of a young, willful basketball player whose only and last bridge between father and son is sport. Conroy does not overstate his pain, it is real. (Conroy's brother committed suicide and his mother died of leukemia.) Conroy has contemplated suicide many times when taking stock of the shipwrecks in his past.Mirroring life, the story of Conroy's senior year basketball season in 1967 is complex, his pain is fierce and its shadow lurks behind every word he writes. This was no ordinary season; it was a dismal season, one of loss, pain and very few personal triumphs for the author as well as his teammates. In this personal history the moments that make up Conroy's brutal upbringing find an equal immediacy to the game of basketball.Conroy never gives up on himself or his team because he yearns for the freedom a Citadel education can give him. He eventually graduates from the Citadel a member of their prestigious honor board, the head of its literary magazine and the captain of his basketball team as well as its most valuable player. In this way the budding author overcomes the regrets --- the \"what ifs\" --- that have pursued him throughout life.MY LOSING SEASON is work of heartbreak and loss, it is honest and true to life, not a testament to \"ifs\", it simply is.--- Reviewed by R. Scott Hillkirk (",
                "review/helpfulness": "30/32",
                "num_reviews": 32
            },
            {
                "review/text": "As an avid reader of Pat Conroy, I am thrilled to read his most autobiographical book to date. In My Losing Season, his insights are so reflective and passionate that reading his book is a learning and insightful experience that I can apply to my own life. No wonder he continues to remain the best of Southern writers. Now, his new book places him at the pinnacle of American authors.My Message: You MUST read this book!",
                "review/helpfulness": "20/24",
                "num_reviews": 24
            },
            {
                "review/text": "I don't think I wanted to enjoy this book as much as I ended up doing, gosh darn it. I know I didn't expect to.For one thing, I've never enjoyed basketball, and don't think I've ever in my life sat through a basketball game end-to-end, either live or on TV. And I had seen other reviewers' complaints about Conroy's wordiness.But as it turned out, I enjoyed this book a lot -- not only for the revelations about sports and manhood and (my particular interest) life at a military college, but also for the author's sheer storytelling ability and skill at bringing people to life on the page.Yes, Conroy can be wordy. With a bit of effort, this book could have been 100 or so pages shorter. But frankly, I don't mind. Conroy's writing has always been intensely personal -- both about himself and *for* himself. He makes a passing reference here to writing &quot;the books which explain who I am to myself&quot; (p. 163), and later to finding &quot;the gargoyles and stunted trolls that ate me alive&quot; (p. 344). If he sometimes confuses his basketball season with the Trojan War, and waxes Homeric about every drop of sweat that fell to the hardwood during that miserable, wonderful year, it's because that's how this season looms in his life (aided and abetted by an English professor, Colonel John Doyle, who himself compared Conroy to Hector). I'm more than willing to let Conroy frame his season in those terms in return for his letting me into his introspection.While Conroy was failing as a point guard, he was also discovering himself as a writer, and it's this part of his story that I found most compelling -- that and the post-season (thirty years post-season) discoveries and reflections that finally knit this group of individuals, once and for all, into a team.Anyone who's ever read &quot;The Great Santini&quot; will want to read this, to discover &quot;the rest of the story&quot; about Conroy's father and the impact that book had on his life and family.I didn't expect to like this book, but I really do, and recommend it highly. (I still don't like basketball, though.)",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "All Of Conroy's books blossom from the same themes, yet all of them are invidualistic in their own way. Only a real artist can make each charecter (fiction or non) rich with emotions of love, hatrid, sadness, humor and devastation.All of Conroy's books live in a warm spot in my heart, each individually eliciting a wonderful storm of emotion that can only be found within the pages he writes.\"My Loosing Season,\" is another fine example of what makes Conroy such a elite writer. This book will touch the hearts of all that have experienced the feeling of loss in any facet of life, not just on the basketball court.This books modest prose is very enlightening about the man Pat Conroy is. For those of you who have read Conroy in the past, this book ads much in the way of insight to how and why those books were written. For those who have not read Conroy before, this book is as good a starting point as any.The man is a genius, a writer that comes around once in a lifetime. My only fear is that this will be his last novel. I can only cross my fingers and wait....Thank you Pat Conroy",
                "review/helpfulness": "11/16",
                "num_reviews": 16
            },
            {
                "review/text": "My Losing Season is the story of The Citadel's '66-'67 season. Pat Conroy begins the book with a little background as to how he got into basketball and fell in love with the game, as a child in a military family moving from town to town every year. He takes the reader through his journey up until he arrives at The Citadel for college. While Conroy does give tremendous details about his experience at The Citadel, the majority of the book deals with the '66-'67 basketball season. Conroy takes the reader game for game through the ups and mostly downs of the season - their crazy coach Mel Thompson, the Green Weenies, the loss of confidence of the starting 5, and all the teams they play in the Southern conference.As a reader you'll get to know these guys - DeBrosse, Cauthen, Kennedy, Zinsky, Tee Hooper, etc - you truly feel for them especially because they're real people and these games really happened! It's a great lesson on what one can learn from losing. Are those lessons more important that having a winning season? My only complaint was that since every chapter was really a different basketball game it got tedious at times. You definitely have to be a sports enthusiast to enjoy this book!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Having practically memorized the football accounts in The Princeof Tides (carefully handling my prized signed copy as I re-readit) and the basketball scenes in The Great Santini, I was eagerfor more when My Losing Season came out. Indeed, when PatConroy turns his incredible ability to put the nuances of asituation into words, it is beautiful and when he turns it againto basketball and his life, it's even more so.It's not whether he won or lost, it's how he wrote the game ! I found lots of &quot;winning&quot; in the stories that he tells. A lover of basketball will be engaged by the descriptions of every play, pass, dribble and lay-up; and about how he developed his game, what it meant to him, and how he interacted with the various people who were part of it.The meta-message in this book, to me, is one of resilience. Thereal gripper is how Mr. Conroy, under relentless pressures fromhis violent father, the Citadel and his coach, simply kept going.To apply the words of that famous North Carolina State coach,Jim Valvano, Pat might be envisioned as having said to himself,&quot;Don't give up, don't ever give up !&quot; We know that sports inthe lives of some youths make them more resilient in the faceof life's stresses and unfavorable circumstances, and thisaccount is a compelling support for this. However, the reader needs to be steeled for a noir aspect to Mr. Conroy's account. This is the subtext of violence - physical and emotional - that like the proverbial river, runs through it. It can be as shaking as an elbow in the face when posting up to the basket.I was also left hungry by My Losing Season. Why ? Pat Conroystill has another story to tell that he just holds out temptingtidbits about here. This would be about the origins of hisdesire to write and his love of books that he describes alltoo briefly as coming from the place in himself that he wentto in order to deal with the violence that surrounded him.There are a few marvelous passages describing this truescholar-athlete's interactions with English teachers and professors. I would love to read more of this. Now that Mr.Conroy has told us his story of basketball, perhaps for hisnext book he'll tell us the story of his life as a writer.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "Mr. Conroy is arguably one of the best writers living. This memoir focuses on his senior year at The Citadel, The Military College of SC-recently in the headlines for the losing battle to remain all-male. It offers keen insights into his life through writing of the highest level.Conroy's tale follows his senior year but also delves into his life as it centers around his basketball and academic careers. At the forefront of the scenes from his life is the maniacal behavior of his father, an abusive, sadistic marine who was a tortuous figure throughout Conroy's youth.I found the story of Conroy's development as a lover of books and as a writer extremely interesting. One could even surmise that all the events of his life served as ingredients to making him a great novelist.One cannot help but to ride on the emotional rollercoaster that this book creates as it follows Conroy's ups and downs on and off the basketball court. As he writes about specific games he played, it reads like the play-by-play to the NCAA championship game, which every game was to Conroy.The book offers great details about his relationships to other players and people in his life, including teachers, who made a lasting mark on him.As a Citadel graduate and athlete, I found the memoir to paint accurate illustrations of life as a Citadel athlete, trying to excel in a sport when everything seems to be against you-the school, the coach, the students-everything.I don't think any reader will be disappointed in this book. I highly recommend it.Craig Stephans, author of Shakespeare On Spirituality: Life-Changing Wisdom from Shakespeare's Plays",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            }
        ]
    },
    {
        "Title": "jags to riches the cinderella season of the jacksonville jaguars",
        "description": "Jags to Riches is the ultimate fan book chronicling the Jacksonville Jaguars' improbable run to the AFC Championship Game and within one game of going to the Super Bowl. In Jags to Riches Prisco and Oehser of the Florida Times Union cover the wildly successful 1996 season of Jacksonville's pro football team, a surprising development because the Jaguars were in only their second year and had compiled a dismal 4-12 record in their first. An expansion team in a city that had sought a pro grid franchise since 1979, its concentration had been on signing young athletes, with the expectation that they would be ready to make a major move in three years. And, although coach and general manager Tom Coughlin had gotten off to a bad start with the team members, he was an important contributor because he judged players solely on their ability and drive and not on their press clippings, according to the authors. In his first year, Coughlin's coaching reflected more of his college than his pro background: gradually he relaxed many of his rules, and the team was better for it. Most amazing was the record, since, after 11 games, it stood at 4-7; then came five straight wins in the regular season and play-off victories against highly favored Buffalo and Denver.",
        "authors": "['John Oehser', 'Pete Prisco']",
        "infoLink": "https://play.google.com/store/books/details?id=ttDrAwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Anyone who regularly reads the Florida Times Union sports page would expect that John Oesher and Pete Prisco could provide this fascinating and sometimes provocative story of how this world class franchise was put together. The pair's sensibility and willingness to force Coach Coughlin's respect lends to a short but compelling read.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "The way this book reads is a direct analogy to the Jaguars. A quick and powerful example of how to write and how to win correctly. The Andre Rison anedote and Tom Coughlin's use of fear to gain respect were excellent. With the Jaguars poised to make a run at the Super Bowl, I look forward to seeing a following on this model franchise by these two gifted writers.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "a sense of where you are",
        "description": "When John McPhee met Bill Bradley, both were at the beginning of their careers. A Sense of Where You Are, McPhee's first book, is about Bradley when he was the best basketball player Princeton had ever seen. McPhee delineates for the reader the training and techniques that made Bradley the extraordinary athlete he was, and this part of the book is a blueprint of superlative basketball. But athletic prowess alone would not explain Bradley's magnetism, which is in the quality of the man himself-his self-discipline, his rationality, and his sense of responsibility. Here is a portrait of Bradley as he was in college, before his time with the New York Knicks and his election to the U.S. Senate-a story that suggests the abundant beginnings of his professional careers in sport and politics.",
        "authors": "['John McPhee']",
        "infoLink": "https://play.google.com/store/books/details?id=RC2TZw-B0qQC&source=gbs_api",
        "review": [
            {
                "review/text": "John McPhee's profile of Bill Bradley at Princeton is classic McPhee: the careful, meticulous observer;the passionate but objective reporter; the master wordsmith. For anyone who hasn't read McPhee, this is a great introduction to his work (it's also McPhee's first book, and has been in print every year since it was written in the mid-'60s).What do you call this book? Sports writing? A detailed profile? Both, I guess, and it really provides insight into Bradley's character, intelligence, and ethic of hard work and determination. McPhee has a great way of reporting the archetypical anecdotes to illustrate specific points--in this case, what a careful student of the game (and of life) Bill Bradley is. There's a great climax here, too, as we follow Bradley's career to his final game, in many ways the perfect ending to a stellar college career. Other nice touches are the photographs and the printing of an updated essay McPhee wrote about Bradley when he was campaigning for senate reelection. If enough people read this, Bradley will be a shoo-in for president.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Curious about Bill Bradley, the man? Sometimes a sense of the man can be had by looking at the youth. This book was written in 1965 after Bradley had finished his Princeton career and was on his way to Oxford. John McPhee's books pack powerful character studies into deceptively simple language. On the surface this is a book about basketball (it's a good book about basketball!), and about excellence through dedication and discipline . The ironic title refers to Bradley's always being aware of where he was on the court in relation to the basket, and to his deep sense of social responsibility for his gifts of privilege, intellect and ability. The portrayal is of a decent, conscientious young man, undistracted or affected by intense celebrity-- whose success in athletics and academics was as much a function of attitude and determination as any innate talent",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I'm writing this review because the fact that it didn't have a 5-star rating irritated me. I first saw the McPhee/Bill Bradley piece in the New Yorker Magazine about 30 years ago. After reading it I xeroxed the entire article and sent copies of it to every member of the University of South Carolina basketball team (which for those of you who are as old as I am was coached by the legendary Frank McGuire (the assistant coach was Donnie Walsh, now President and General Manager of the Indiana Pacers) and featured a cast of great college players like John Roche, Tommy Owens, Billy Walsh, Bobby Cremins, etc. All of the players (an unusually intelligent group) loved the article. We had many conversations about Bradley's approach to the game in the months to come. This is definitely a 5-star book for any lover of the true game of basketball. It's great and can't possibly be outdated. Highest recommendation.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Written when Bill Bradley was still a student at Princeton, the book is a synthesis of McPhee's interviews with and observations of the three-time All American. It creates a picture of Bradley as a person of character who brings his personal integrity to whatever he does and who succeeds as a result of hard work applied in accord with his personal principles. We learn, for example, that as a youngster Bradley apparently had no special basketball ability, but he decided he wanted to play and literally taught himself the game piece-by-piece, constructing his jump shot, for example, from five separate pieces and being so aware of his movements that when he missed a shot he knew which of the five pieces he had not performed correctly. And this same dedication shows through in Bradley's pursuit of his education and in his private conduct: while a student at Princeton he taught a Sunday school class for some of the town's children, and even after a Saturday night away game (followed by a six hour bus ride, reaching campus after 4 a.m.) there was never any thought of not teaching the class the next morning. This inspirational book, A Sense of Where You Are: a profile of William Warren Bradley, gives us a very clear sense of who he is, a man of honor.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "Bill Bradley, a three-time basketball all-American at Princeton, Olympic gold medalist, Rhodes scholar, member of the New York Knicks and two time NBA champion definitely has a passion for basketball. This books helps show what goes into the making of a champion. Discipline, selflessness, respect, courage, imagination and passion are elements that made him a success on and off the court. I knew nothing at all about Bill Bradley before reading this book, but I have great respect for his personal code and his shining example.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This was John McPhee's first book, so it obviously holds a lot of interest as a glimpse at the man's later style. I'm happy to say that while this is obviously McPhee -- you can tell it's him within a page or so -- it's one of the weaker McPhees. Which is praising by faint damns: McPhee's style seems to have emerged fully-formed from his forehead at The New Yorker, and moved continuously upward in small, methodical steps. By the time we get to Uncommon Carriers, which I'll review soon, the McPhee style has been honed to a keen edge.A Sense Of Where You Are is also notable as a first glimpse at Bill Bradley: future Rhodes Scholar, future New York Knicks basketball player, future senator, future presidential candidate. One wants to say \"All of the future Bradleys were there when McPhee wrote A Sense of Where You Are,\" and that may be true: not only a great athlete, Bradley was the most admired man on the Princeton campus. And this isn't just retrospective I-knew-him-whenism: A Sense of Where You Are came out in 1965, before anyone could know what Bradley would become.If I tell you that this is a McPhee book, and if you've read McPhee, I can basically stop there. A McPhee book is characterized by a gentle forward motion propelled atop sentences that have no right to work as they do. The sentences are largely staccato, and in books other than this one they tend to feel like a sequence of random observations. In The Curve of Binding Energy, for instance, you feel like you're reading a mere litany of facts about nuclear fusion which seemed interesting to John McPhee, yet by the end you really have learned a lot about the construction of a nuclear weapon, and the sentences more than merely hang together; they flow. It's the strangest thing; McPheee routinely pulls off a nonfiction magic trick.McPhee studies men at work. He quickly falls into their lingo, which is both one of the greatest irritants of his books and one of their key charms. It's irritating because McPhee will often use a long string of disciplinary buzzwords before defining them; this reaches its nauseating pinnacle in Annals of the Former World, where we've absorbed a couple hundred pages of dense geological concepts before McPhee gets around to telling you what those concepts mean. It's charming because you feel like you're right in the thick of the action with citrus pickers in McPhee's Oranges; with truckers, ship captains, and UPS employees in Uncommon Carriers; and with basketball players in A Sense of Where You Are.McPhee follows Bradley on and off the court; when not watching Bradley -- the greatest basketball player, apparently, at the time McPhee wrote, and by some measure the fourth-best athlete on earth -- he's asking Bradley to walk, step by step, through how he negotiates difficult problems on the court. Standing in McPhee's kitchen, one imagines, Bradley pivots, feints, dodges and leaps to show McPhee exactly how his mind works. It's absolutely captivating.It's also a lot of hero-worship. It's a beautiful work, but a bit adulatory for my tastes. Orangemen, truckers, pilots, and nuclear engineers surely fascinate McPhee, and he respects them for the difficult tasks that they get done, and moreover he writes about them from the thick of the action, but somehow he manages in those later works to stay above the fray. By contrast, John McPhee is godfather to Bill Bradley's daughter.Don't let that dissuade you, though. If you love McPhee -- and if you don't, you must not have read him -- dive into A Sense of Where You Are and observe two great men at work.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "John McPhee starting out as a writer profiles Bill Bradley and his Princeton Tigers basketball team, through the Ivy League and into the NCAA Tournament, leading up to Princeton making it to the Final Four Bradley's senior season. In the background and unmentioned is John Wooden, whose UCLA team wins the tournament, Wooden's second of ten NCAA championships. Wooden praised Bradley, who along with Jerry Lucas and Wooden himself was the ideal student-athlete. All three were consummate team players.Included is Bradley's famous \"creed,\" \"When you are not practicing, remember, someone somewhere is practicing, and when you meet him he will win.\" (p. 65) Like Wooden, his success came from being far ahead of most of the competition on the crucial element of practice. Bradley, deeply analytical, is right out of The Talent Code by Daniel Coyle. He did have, as Lucas did, superior eyesight, but one meaning of the title of the book comes from his learning to make a shot without looking at the basket, which he frequently did--a shot for which there is no name.One of the greatest if not the greatest sports books I've read.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "squash steps to success",
        "description": "\"Squash: Steps to Success\" will teach you the skills and strategies you need in order to play and win. Included are 13 progressive instructional steps, so you'll learn all aspects of the game. Also, as part of the best-selling Steps to Success Sport Series with over 1.5 million copies sold, you'll follow a guaranteed track record of success.",
        "authors": "['Philip Yarrow', 'Aidan Harrison']",
        "infoLink": "http://books.google.nl/books?id=SkbqoQEACAAJ&dq=Squash:+Steps+to+Success&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book with my first squash racquet, and found it invaluable in learning the game. Each chapter builds upon the last, giving the impression that when you finish the book you won't need it anymore. However, it is a great resource to refer back to when having trouble with the technique of a particular shot. The author could have provided more drills in each section, but then again, there are other books that are dedicated to drills and improving your game. . .this book's focus is on teaching the beginner.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I bought this book out of frustration. Unable to beat my partner despite practicing secretly, I was hoping this book may help improve my game. Though it has useful drills and tips, I still cannot beat my partner. Rather than award this book 4 stars and recognize limits of my talent, I hold the author responsible.This book does offer a lot to an intermediate player who needs to improve their technique. Final analysis: Very useful for the beginner to intermediary category, no revelations for strong intermediates and up.Be aware that the dimensions of book are similar to a magazine, not something you can shove into your racquet cover.",
                "review/helpfulness": "10/13",
                "num_reviews": 13
            },
            {
                "review/text": "Both beginners and more advanced players should be able to get a lot out of this quality reference work as it offers detailed (yet practical) text, illustrationa and diagrams covering all aspects of the game. The book is considered by most experts in the sport to be among the top two or three instructionals ever published on Squash. It won't make you a championship quality player, but it should help your game no matter what skill level you are currently at.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Within 30 pages, this book had made me aware of 2/3 basic problems with my game and given me an insight into how to solve them as well.Each chapter becomes a building block for successive chapters, allowing you to correct basic faults before trying any advanced techniques. At the end of every (all that I've read) chapter there is a table that lists Common errors found within the area being improved and methods to correct them - I FOUND THIS INVALUABLE!If I had to find fault, then I wish there were more pictures/drawings to explain the techniques and drills covered. However this won't detract much from my enjoyment of the book!If you play squash for fun or are a little more serious, this book will have something to help you improve. I only hope the practice goes as well as the theory!!",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a good book for beginners. It covers basic technique and some general court tactics. Squash is a difficult sport to teach via the printed medium.I have found the best way for intermediate players to improve is to watch live matches,buy or rent video tapings of the pros(and to learn how to juggle).",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I found the drills in this book to be very helpful in improving my game. It is an excellent resource for beginners/intermediate players. The drills are very good for improving accuracy. For those of you willing to impove their game this book is an excellent buy.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The book is well written. Provides a basic understanding of the game for beginners and intermediate players. excellent drills......",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I bought this book to look at the drills and the workouts one needs to do to imporve the oncourt acceleration, endurance and stamina. This books have lot of drills which one can do to improve his or her game. Lot of strokes can be practised by oneself but there are a lot of drills that the book describes which need the help of a partner, which are very good for ball control like playing a game where both partners hit the ball to the back of the court and point is scored if the person hits short of the mid court line. etc., etc.,In other words this is an excellent for all beginners/ intermediate players.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "amazing book give knoldge that a coach has so u know whats right and whats wrong",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "It is a complete training guide for any squash player and is very useful to serve as a reminder to prevent bad habits in squash.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the hundred yard lie the corruption of college football and what we can do to stop it",
        "description": "The lead college football writer for Sports Illustrated examines the myths that surround college football and obscure the reality of the game.",
        "authors": "['Rick Telander']",
        "infoLink": "http://books.google.com/books?id=pumVyiz86sEC&dq=The+Hundred+Yard+Lie:+The+Corruption+of+College+Football+and+What+We+Can+Do+to+Stop+It&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A good book with some slow parts in the middle where the author goes to subjects that could be shortened. Telander is a former player in college and is watching the game he played be ruined. But he honestly discloses more than once that what is being said now has been said since the 1930s.Maybe Telander should stop tilting at windmills and just give up to fight another fight and that may be my feelings also. But then you read his well-thought suggestions for changing the game and you see they could solve the problem. Let big colleges run professional sports team for entertainment and segment other colleges. The players would be paid and would not be required to attend college. The suggestions are fascinating and seem to address most of the points of weakness in the problem. All it will take is backbone from the college presidents and a few other powerful players. Oh, well. There goes this problem as no one associated has backbone. Witness the Oklahoma president presiding in the late 80s who years later tries to downplay the problems he faced. Witness Walter Byers who presided over the NCAA and now has his own book stating that there is a problem and it should be solved. Where were you years ago Mr. Byers?If you love college football, you should read this book. Maybe it won't change your mind but it should at least let you see there is a problem. And Mr. Telander still doesn't cover football. Nice boycott.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "Money, money money. What ever happened to sport? In this well-researched and soundly reasoned exploration, Telander looks at what is wrong in big time college football from the Golden Dome to FSU. And he has some interesting suggestions for making it better which include honesty about $ - and the ability for players to participate. In between each chapter he writes an emotional &quot;Streaching&quot; which expresses the real love of the game and why saving it is important",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Read this 10 years ago, and have never viewed bigtime college athletics the same way since. In a just world, this book would be very well known. In reality, this is the type of thing that the NCAA, big 3 networks, sports magazines, and sports announcers don't want you to know about. Too many cushy, do-nothing jobs ride on the exploitation of superstar college athletes that really have no business being in college at all. Telander's writing is clear, simple, passionate, and grabbing. His arguments are lucid and well constructed. Unfortunately, they fell on deaf ears.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "Telander exposes rampant cheating, exploitation, and NCAA hypocrisy in this searing look at the sordid underside of college football. The author attacks amateurism as fraudulent and unworkable, and shows that scandals have recurred almost since the game's founding (by rebellious students) in the late 1800's. We also learn that athletic programs rarely turn profits or boost fund-raising for their host schools. Despite these criticisms, this author (and ex-player at Northwestern) remains as attached to the game as us fans. Telander concludes his concise and highly readable book with a sensible proposal for reform. \"The Hundred Yard Lie\" fell on predictably deaf ears when first published in 1989. Still, it's an eye opener for those who dare question football's relationship to education.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "learning to learn revised edition strengthening study skills brain power",
        "description": "Help students of all ages maximize learning and strengthen study skills. This interactive workbook is a powerful resource for students, teachers, and parents. Use the step-by-step procedures for improving organizational skills, time management, problem solving, power reading, test taking, memory skills, and more! Anyone who wants to \"learn how to learn\" will benefit from the wealth of activities in this engaging resource.",
        "authors": "['Gloria Frender', 'Marta Drayton', 'Janet March']",
        "infoLink": "http://books.google.com/books?id=MFXbngEACAAJ&dq=Learning+to+Learn,+Revised+Edition:+Strengthening+Study+Skills&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If I could rate this book more than five stars, I would. I've been a study skills consultant for many years, and a high school teacher even longer. This book I recommend to both parents and teachers. It comes with duplicating rights for an individual teacher's classroom (but the amount of paper you'd use if you duplicated it all would be prohibitive for most schools). In my classroom, I've picked and chosen the units I felt would be most helpful for each class. The work is clearly explained with good examples and self-tests. The illustrations are whimsical enough that they are not offensive to high school students. What's even nicer is that the students see the value in these lessons--they don't have to be sold.",
                "review/helpfulness": "63/65",
                "num_reviews": 65
            },
            {
                "review/text": "I give a course on study skills and have read all the available literature. This one tops them. Worksheets are clear and easily understood by students of all ages. The advice contained includes the gamut of techniques. Only reservation is that it's longer than neccessary.",
                "review/helpfulness": "57/61",
                "num_reviews": 61
            },
            {
                "review/text": "I teach study skills to 7th and 8th graders--this is the text I prefer. It is clear and well-written, even if a little wordy. I teach it in units, having the students learn one skill, then building on it. Good Stuff!!",
                "review/helpfulness": "53/56",
                "num_reviews": 56
            },
            {
                "review/text": "This is a terrific book! The strategies in it are useful and easy to follow. In being able to understand how each student learns, you can better teach that child. Also, when the students themselves understand how they learn, they can adapt their studying to fit their personal style.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I buy and read alot of books, but have never taken the time to do a review, but after going all the way through this book, I knew I needed to share with others the help this resource can be. I am home schooling two 16 year olds this year. They have just come out of the public schools, and I'm finding they have limited study skills. After going through Learning to Learn, I have a list of 40 pages I'll present in the \"Learning Styles and Learning Strategies\" class we're doing this summer to prepare for our full schedule. The book is solid information, based on reseach and experience, and covers everything I had planned to present to the girls in this class. Having also worked with middle school students, I'm sure this book would be helpful for 5th graders and then on through high school. The forms and lists are well done and very usable and have saved me immeasurable time in creating comprehensive lists and forms. She even includes a one page summary of Howard Gardner's 8 Multiple Intelligences. Buying this book was the best money spent in a long time.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I am an ADHD coach, and I work with students of all ages. The common deficiency that links all of my clients is a lack of basic knowledge of the tools needed to learn. Of all the study skills books that I have used, this is by far the best. The simple elegance of the explanations, and the user friendly templates make this an invaluable resource for all ages. Whoever wrote this has taken the best of all fields: memory research, education research, and psychology, and blended it into the perfect one stop source of Learning How to Learn. Thank YOU!",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "The book was easy to read. It provided clear, reasonable guidelines and suggestions for students to organize. read, take notes and generally improve study skills. Specific strategies and examples are presented. It is a practical blueprint that will be useful for struggling students and those who simply want to be more effective.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book arrived in three days. I was really impressed.I have had this book before, but I'm afraid another teacher liked it even more than I did. This has graphic organizers that really work for the everyone, not just the learning challenged. My high-schoolers, as well as my elementary crowd have found this book helpful.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I love this book. I purchased it because I was going to teach an English class this summer. I included a unit on how we learn and then the students had a presentation by the schools learning specialist. She was proud that many of the students were ahead of the game and could identify what kind of learners they thought they are. Kudos to the team that prepared this book!",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I use this for teaching a class on study skills. It is probably best for kids 7-9, but could be adapted for younger or older kids.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the draft a year inside the nfls search for talent",
        "description": "An explosive look at the NFL Draft from the inside out that exposes the multilayered feeding frenzy that swarms around America's top college players. The Draft follows a handful of NFL hopefuls through the ups and downs of the 2004 college football season and the predraft process, culminating with the 2005 draft. Among the prospects are Virginia defensive end Chris Canty, who overcomes a devastating early-season knee injury to reestablish himself as a top draft hopeful, only to suffer a detached retina in a nightclub skirmish; and Fred Gibson, a talented but rail-thin Georgia wide receiver who struggles to put on the weight needed to go over the middle in the NFL. It's a complex environment, with college coaches attempting to protect their \"student-athletes\" from exploitation (while fully aware that they can only remain competitive if they attract NFL-caliber players to their schools), along with sports agents and NFL scouts trying to stay a step ahead of their competition. These parties provide a multi-angled view of the world of emerging NFL talent. The reader follows the season through the eyes of a host of power players and scouts, from veteran agent Pat Dye Jr. to Jerry Maguire clone Jack Scharf, to the coaching divisions of Florida State University and the University of Virginia---headed by longtime Bill Parcells disciple Al Groh. Also central to the narrative are the Atlanta Falcons and executives Rich McKay and Tim Ruskell (now with Seattle), who use a character-based evaluation system to set their draft board. These parallel stories weave together, culminating in draft weekend, to create a gripping and fascinating look at a world few see from the inside.",
        "authors": "['Pete Williams']",
        "infoLink": "https://play.google.com/store/books/details?id=TLtgmvtOcjAC&source=gbs_api",
        "review": [
            {
                "review/text": "While not exactly a pieced of hard-hitting investigative journalism, Williams' book is one that most NFL fans will find enjoyable. It's not to cause much in the way of controversy because of its non-critical tone towards players, agents, coaches, and just about everyone involved in the draft, but it's still a good look at the process involved when a player moves from college to the pro ranks.Focusing on several players - among them Chris Canty, Fred Gibson and Ray Willis - Williams examines the events that take place from the time a player \"graduates\" from school (many drop out immediately after their team's bowl game) up through the draft itself. Besides the players, Williams also looks at the role played by many others, including coaches, compliance directors, families, agents, and teammates.The book's strength is that Williams goes lightly on all the participants. It's easy to portray agents as sharks, or schools as taking advantage of the kids, but Williams sticks to facts without adding too much of his own spin. That's not to say that he doesn't criticize certain people or tactics, but he's more interested in passing the story along to the reader for them to make their own judgments. It's this nonjudgmental approach that allows us to draw our own observations about featured coaches like Al Groh, or agents like Jack Scharf and Pat Dye, Jr. They may not always come across in the most positive light, but they're at least given a fair chance to speak for themselves without being judged by the author.If there's a weakness to the book, it's that Williams spreads himself a little thin. With trying to cover the roles played by everyone listed above, the book can often seem scattered or presented in a non-linear way. When dates jump back and forth, it can be a little confusing, especially from a book geared towards a very specific date. However, it's difficult to fault the author too much for trying to present so much information without loading us down with a 500-page work.This isn't a subject that has been covered often in such great detail, so Williams' work should be a worthwhile read for any fan of the game. For those of us who spend much of the off-season worrying about our team's draft-day prospects, this is an essential read. A title that will be enjoyable for any NFL fan, this one is recommended.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "The Draft: A Year Inside the NFL's Search for Talent is a detailed look at what players, agents, and NFL teams go through leading up to the annual NFL Draft where teams select college players.The PlayersWilliams chooses several players to follow for this book, some first rounders and a few who start with great promise but ultimately flounder in the draft for a variety of reasons. There are three main things that stand out about what players go through leading up to the draft. First is the feeding frenzy with agents jockeying for their attention. The more talented and greater the potential, the more demand there is a player's time and attention. Agents communicate with them directly when they are allowed (and sometimes when they are not) and often try to woo their parents, girlfriends, and anyone else that they think might have influence on the player's decision on which agent to go with. Secondly, there is a lot of money involved and many temptations to break NCAA rules. It's illegal for players to take money or gifts from agents while playing college football but it undoubtedly happens. Third, is that the NFL selection process is a meat market. NFL scouts are watching players, many from high school through college. The best players have agents hanging around them, especially their senior years in college. After their college careers are over they are faced with extensive training for the NFL combine, working out for teams at their schools or at team facilities.The NFL Combine, where the NFL brings any eligible player that wants to participate, is really the centerpiece of the entire draft. Here players are put through all kinds of drills, timed in the 40 yard dash, interviewed by team representatives, are poked and prodded for physicals, and given an intelligence test called the Wonderlick. Most players go to specialized training facilities paid for by their agents just to do well at the combine to improve their draft status, whereas some locks for the first round skip it fearing a bad performance could drop their draft status.And then, of course, there is the emotion of draft day of either going in the round you thought you would go in or slipping to later rounds and realizing the amount of money you just lost as a result.The AgentsAre the agents greedy sharks looking to make their livelihood off of young millionaire players, or hard working men (there are few women) in a very competitive business doing their best for their clients? Undoubtedly there are unscrupulous agents but for the most part Williams paints them out to be in the later category. They sacrifice their personal life to recruit players and then work to make sure they maximize their potential in the draft and negotiate the best contract possible for them with the team that chooses them. Williams paints the profession as extremely cut throat. As noted above, agents talk extensively with players' families, spouses, girlfriends and anyone else that they think will help them get an edge in signing a player. Then they must spend their own money for specialized training to get players ready for the NFL Combine or workouts before pro scouts. In the meantime they are constantly worried about other agents poaching their clients after they have invested so many resources on them. Further, since agents get only a 3% commission off contracts, if a player doesn't maximize his potential they often find themselves in a hole instead of making money. On the flip side, when they have a solid stable of highly paid players, the profession can be very lucrative. It's an odd profession and one that many look at with a jaundiced eye. They do perform an important service for the players they represent but it is also clearly a profession that makes its money on the backs of the players.The TeamsThe most important thing for teams in the draft is to pick the most talented players they can in the appropriate round who will fit their team concept and fill needed positions on team. That is all they care about. And they spend a lot of time, money, and effort to study every angle, from raw physical talent, intelligence, and good character. A bad draft can significantly impact the prospects of the team, and a great draft can greatly enhance it. Scouts spend much of their life on the road watching games or watching game film, evaluating every aspect players available for the draft. All the poking, prodding, interviewing, and even background investigations on potential draftees is important as teams stake their future on the success of the players they select for their teams. It comes down to figuring out what combination of physical talent, character, and intelligence will best fit the team.The SchoolsThis book did not focus as much on the schools, but it did have a good deal of coverage of the Florida State Seminoles and their compliance director and Virginia Cavaliers head coach Al Groh. It's important for schools to facilitate appropriate contact with agents and help players fulfill their potential in the draft. Schools worry about the distractions, and even worse, possible infractions, as players interact with agents. Especially damaging is players taking money or gifts from agents before they are finished their careers, which could cost the team sanctions by the NCAA. It's a tough job when you mix young immature players and aggressive agents with money to throw around. On the flip side, if a school is seen as helping players improve and make it in the NFL, it helps them recruit talent.ConclusionOverall this book is journalistic in its approach relying on extensive interviews and closely following the entire draft process. It is well organized and the chronological structure works well. That said, the writing style is not the most exciting, and it mostly reads like an extensive, in-depth newspaper article at times. Despite focusing on specific individuals and teams, the book often is very matter of fact, and less emotional or personal in its approach. Nevertheless, it does bring out the not so dirty secret of professional sports - it's about money and lots of it. Avid professional football fans should find this book interesting. Non-football fans would likely find it tedious and boring.Overall I would recommend this book to NFL fans for the insight it gives into an important aspect of the sport.",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "Just short and to the point...this was an interesting book that covered topics like how players prepare for the combine, how teams scout players, how agents pursue draftees, etc. Unfortunately, the book was marred somewhat by less than perfect writing. There were spots where you felt like you were reading the same material over again, and other spots, such as the \"Draft Day\" chapter, where the author bounced between characters so much it was hard to follow. Don't read this looking for a literary masterpiece, but do pick it up if you are a true fan of the sport...just feel free to skim at a few points.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the truth about winning",
        "description": "150 powerful bite-size techniques for handling virtually every day-to-day management challenge, from motivation and team-building to job design Three full books of practical techniques for handling virtually every day-to-day management challenge! Discover how to build winning teams and design high-productivity jobs... motivate people when you can't pay them more... sell your decisions, even when they're unpopular... use non-verbal communication techniques more effectively... and much more! From world-renowned leaders and experts, including Stephen P. Robbins, Martha I. Finney, and James O'Rourke",
        "authors": "['Stephen P. Robbins', 'Martha I. Finney', \"James O'Rourke\"]",
        "infoLink": "http://books.google.com/books?id=45hbz7xrYsYC&dq=The+Truth+about+Winning!&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I want to highly recommand this book,to every normal player (like me) that want to improve his game.Without any doubt.The reason is that I am following the indications,the explanations, and the system that Tom Veneziano explain so well in his book.And right now I am a brand-new tennis player.I am more relaxed and happy on court.Now, I really use my mind on court.My muscles are much more relaxed on court.I look at my tennis, and at the game of the ATP players,in a different way. I understand a lot more, than in the past.You could imagine how, those differences, have had a wonderful effect on my tennis.The main reason is that, Tom Veneziano,give to the reader, a system, something you could begin to understand and put in practice the next time on court.On this book, there is no word about tennis stroke's tecnique.It's all about the mental game, and the mental side of tennis.He dont teach you, how to use your arms and legs, he teach you how to use your mind.Something much more delicate, to use on court.We all know how tennis is difficult, and full of worries,after this book, tennis will became less difficult,and a lot of worries will desappear.In my opinion it's very important to read it a lot of time.Because it's full of indications, rights for us,very normal, but eagers to improve, tennis players.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "&quot;The Truth about Winning&quot; will help you win a lot more matches because thinking clearly matters so much during competition. Whether you're a club player or a world-class pro,you'll play better if you use Tom Veneziano's refocus and relaxation techniques. They will help you learn to handleadversity better. I especially like his advice: &quot;Do not emote.Evaluate.&quot; Mental toughness is so important in the individual sport of tennis. This book helps you use your head so you can play up to your potential more often. I recommend it!Teaching pro from New England",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "lacrosse technique and tradition",
        "description": "Publisher Description",
        "authors": "['David G. Pietramala', 'Neil A. Grauer']",
        "infoLink": "http://books.google.com/books?id=uRwAEAAAQBAJ&dq=Lacrosse:+Technique+and+Tradition&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a must for any lacrosse player. It covers all aspects of the game from its history, to its play.As a player one learns all of the fundamentals of the sport. Equipment, rules, plays, defensive and offensive strategies and techniques are all covered.As a coach one gets a good foundation from which to build. It includes drills and practices to follow.Table of Contents-Section I: The Game and Its History1. the game of lacrosse. 2. a brief history. 3. the rules. 4. what makes a player.Section II: Techniques and Tactics5. fundamentals. 6. individual offence. 7. team offence. 8. extra-man offense. 9. individual defense. 10. team defense. 11. man-down defense. 12. goal tending. 13. clearing. 14. riding. 15. fast breaks. 16. faceoffs. 17. drills.Section III: Lacrosse at Johns Hopkins18. the eighty-seven-year record 19. my twenty Hopkins teams.I hope that this was of help",
                "review/helpfulness": "34/34",
                "num_reviews": 34
            },
            {
                "review/text": "This book is best for all players, beginning through advanced. The book focuses on both individual and team play. Great for coaches and players. The best Lacrosse manual I have ever read.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            }
        ]
    }
]