[
    {
        "Title": "the art and science of logic",
        "description": "This introduction to logic, which aims to reflect recent advances in the field, focuses on natural language, analyzing the structure of arguments conducted in English. The text includes problems with which students can test their skills.",
        "authors": "['Daniel A. Bonevac']",
        "infoLink": "http://books.google.com/books?id=4i8QAQAAIAAJ&dq=The+Art+and+Science+of+Logic&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A humerous, brilliant, masterpiece. Bonevac does it again!",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Straightforward, understandable, entertaining, with an easy-going style, chock full of explanations--both solemn and humorous--and examples--both historical and contemporary. This volume teaches. I learned. I can't think of a better book for personal exploration or for the classroom. It was originally the textbook for a course I was taking at the university, but it became a textbook I could never bring myself to sell back. Years later I still keep it on my shelves for both reference and recreation.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "sound advice a basis for listening second edition student book",
        "description": "Sound Advice, Second Edition helps students understand rapid, relaxed English, starting at the word and sentence levels and expanding to short conversations. The text/audiocassette combination helps students develop their own strategies for understanding language as it is spoken and exposes them to a variety of listening phenomena essential for comprehension of authentic, natural speech.",
        "authors": "['Stacy A. Hagen']",
        "infoLink": "http://books.google.com/books?id=KhRuIQAACAAJ&dq=Sound+Advice:+A+Basis+for+Listening,+Second+Edition+(Student+Book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My teacher recommended this book and took it as the context. It solved our many listening problem. I have studied it every chapter. It is really good for my listening.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is excellent for topics like linking and ellipsis, and the way unstressed vowels are pronounced as one of our two minimal vowel sounds. It also can be flipped around and used as an outstanding, if not essential, supplement to most pronunciation texts. I'm a biased teacher in that I think pronunciation books tend to over-emphasize sentence stress, which learners can pick up naturally, rather than discrete sounds, which they generally cannot.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "clear speech students book pronunciation and listening comprehension in american english",
        "description": "Teacher's resource includes notes and tips, answer keys and audio scripts, diagnostic tests and unit quizzes.",
        "authors": "['Judy B. Gilbert']",
        "infoLink": "http://books.google.com/books?id=orpSa8VCa94C&dq=Clear+Speech+Student%27s+Book:+Pronunciation+and+Listening+Comprehension+in+American+English&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I got this book to help one of my advanced level students with her pronunciation. I was surprised at what the book really focuses on, and I have found it to be quite helpful. THE GOOD: 1) This book is different from other pronunciation books in that it only spends part of the time focusing on the sounds of English letters. Rather, it is organized into chapters based on other features of English, such as rhythm, linking, syllable length, stress, intonation and reduction. This is a wonderful &quot;next step&quot; for students who have had adequate practice with the sounds of English letters, but still have an accent. 2) It provides practice exercises that allow the student to practice more than one thing at a time. For example, one exercise allows the student to practice linking words while practicing the &quot;sh&quot; sound. 3) I think that the most valuable part of this book is the Clear Listening and Clear Speaking test at the beginning of the book. These allow teachers to get very specific responses from students, and then focus on the problem areas. THE BAD: While the book is great at helping students practice consonant sounds, it doesn't give much practice or help with vowel sounds. This is really my only complaint with this otherwise wonderful book. OVERALL: A great book that will help students fine tune their English speech. I recommend it for high-intermediate or advanced students. If students are looking for a good way to reduce their accents, or make themselves more understood by Americans, or even understand North American English better themselves then I highly recommend this book.",
                "review/helpfulness": "78/78",
                "num_reviews": 78
            },
            {
                "review/text": "Clear Speech is a well-conceived pronunciation text that, in my experience, students have found very pleasant to use. It covers individual sounds, as well as speech rhythm and intonation, in a very fluid way. It can help instructors teach ESL students to pronounce well not only word by word, but also to arrive at more natural-sounding sentence flow. I have found that the exercises in the book benefit students beyond their own pronunciation, and actually help them to understand native English speakers better. The third edition is a vast improvement over the previous one, because it guides students in deciphering English spelling and provides more practice in specific, troublesome sounds. The new edition also includes a practice CD, which is something many students using the second edition often wished for. The graphic simplicity of the book is a huge advantage over other pronunciation texts available. All in all, I think Clear Speech is one of the best - if not THE best - choice for teaching pronunciation.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I split this book to create a 2-level pronunciation course for lower intermediate and higher students in Japan. The courses were extremely well received time and time again. The book is an excellent guide for such classes.I rated the book at 5-stars on its own merit. However, together with the audio cassettes I would have given it four and a half stars, as I believe the audio component needs to be available on CD for cueing purposes and ease of use.Teachers who have training in teaching pronunciation will probably be delighted with the book. Instructors trying to use the book without the benefit of training in teaching pronunciation may not have the background to utilize it fully.Rather than use the tapes an instructor can easily use their own pronunciation to model the lesson targets. This allows for easy adjustments of the speed, timing and rhythm of the exercises for different class groups.Students can practice the targets as a group, and then individually during the listen and repeat sections. The students generally loved the excellent pair work that followed, which allowed them to further practice and master to some degree what they had covered.As much as it is a pronunciation course, listening skills are an equally strong component. Again, the pair work was excellent in ensuring each student strove to achieve the listening and production targets.This book allowed mixed levels of students to work together harmoniously, challenge themselves in a very enjoyable and insightful way, and achieve real gains in their struggles to produce and understand spoken English. Students liked the limericks.I agree with the other reviewer who stated the diagnostic test with the book is an extremely useful tool.Highly recommended.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "Although I find the second edition useable with students, in my opinion, it was written for the trainers. I used the first edition with far more student successes because each chapter was built on the preceeding ones and stuck to the basics. In contrast, the second edition is TOO full of the many intonation elements all jammed and crammed into each chapter. Frankly, I was hoping that the second edition would give us more practice examples to solidify the the basic intonation elements people need and most can absorb. Instead,by comparison to the first edition, the book is overfilled with way too much &quot;stuff&quot;. Still, it's the best book on the market in it's class and I would highly recommend it to the trainers. I believe most students will have difficulty sorting out and dealing with the &quot;details&quot; in each chapter on their own. On the other hand, because of this jammed text, it is easily used for both intermediate to advanced level students ... you can get more bang for the buck.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This is one of the rare pronunciation textbooks that focus on helping speakers of English as a Second Language understand the way American English sounds when spoken in context, not just the way individual words are pronounced in isolation. Speaking more clearly and fluently often requires speaking word LESS clearly but using the proper simplifying rules. Native speakers 'know' these rules but are usually not aware of them. My colleagues and I have found that advanced students really love this book, and self-study is possible to some extent when used with the accompanying tape.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I am attending an accent modification class right now and I found this book very helpful. I practice aloud with the audio tapes and I begin to &quot;hear&quot; the subtle variations between vowels and similar consonants. This book helps me a lot in improving my speech.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "The product contains mainly the answer key for the acutal student exercise book, and if you don't have that to refer to, it's not as useful. The teacher editon should contain the student workbook for easier reference. There is a CD that comes with it but again without being able to see the corresponding exercises in the student workbook, you feel as if you're working blind.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a pragmatic approach to teaching pronunciation. Many pronunciation texts embellish lessons with unnecessarily difficult academic/phonological terms that serve no real purpose for the student, but rather confuse and complicate the student's learning process. Judy Gilbert simplifies this process and keeps the customer/student focus paramount. Her approach is refreshingly honest, stressing the most useful elements of pronunciation--those which are tied to listening. It frees the teacher and student from unnecessarily complex pedagogy. Over the past 6-7 years that I have used the text, I have found that this is one text that both the students and teachers can ENJOY! Thank you Judy Gilbert! (I look forward to using your new text &quot;Clear Speech from the Start.&quot;)",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "As an experienced language teacher and DOS at a language school, we have designed a short course around this book. Providing one keeps sound understanding of what language is made up of and what sound language teaching consists of,the Clear Speech book is extememly useful, fun, and interesting to both the learner and the teacher. Some of the exercises are a lot of fun. Informed language teachers realise that language is not infact just about discreet points of aspects of language i.e. language is largley about successful communication and involves all the skills and features including socio-linguisitic as well as purely linguistic. We know these days that language needs to be approached with an ecclectic perspective and the learners' needs foremost as part of a program. Part of any program should include pronunciation, so long as it is in balance. This book focuses on the wider influences surrounding pronunciation which affect overall fluency and language proficiency, for example, stress, intonation, timimg, rythum, syllable-length, patterning, problem sounds, and listening. Most importantly, I would argue that it is a very soundly designed book useful for serious language teachers which will help develop a personal monitoring system into the learners' language useage awareness, thus influencing significantly their fluency. In this context, the exercises are very beneficial. I am sure the book is not so focused as to ignore or intended to take the place of the wider needs and other macro skills that need more attention overall such as is found in general English classes etc, but offers a user friendly and relative set of exercises in a format that has continuity if desired, or can be utilised as a selective supplimentary tool. I would say Clear Speech is a book that should preferrably be teacher-taught to be truly effective.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "\"Clear Speech\" is the best. First, I use the text book & CD at a college, and I brought the Class Audio CDS for self-study at home. You need it, because CDs coming with Student's or Teacher's books don't include all listening dialogs.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "how to increase your childs verbal intelligence the groundbreaking language wise method",
        "description": "The creators of the acclaimed Phono-Graphix method of reading instruction explain the importance of teaching children comprehension skills and present dozens of exercises and activities to improve those skills--as well as writing ability--in children from six to 18 years of age.",
        "authors": "['Geoffrey McGuinness', 'Carmen McGuinness']",
        "infoLink": "http://books.google.com/books?id=PpTKz_JoDY8C&dq=How+to+Increase+Your+Child%27s+Verbal+Intelligence:+The+Groundbreaking+Language+Wise+Method&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Carmen and Geoffrey McGuinness have added the perfect complement to their first book, &quot;Reading Reflex.&quot; I have previously believed that there are two components for reading, decoding and comprehension. I now believe that they should be decoding and language development. Through my already extensive involvement with the &quot;Language Wise Method&quot;, I am convinced that comprehension is a byproduct of verbal intelligence. I have witnessed it with my own eyes. Understanding what one reads proliferates when syntax (the categorical and functional relationship of words), vocabulary, attention, memory, logical reasoning and creativity improve. But verbal intelligence is not limited to producing comprehension, but has manufactured writing skills, communcation skills, memory and much more.The comprehensive presentation concerning what verbal intelligence is, human motivation, the nature of language, vocabulary, comprehension, attention challenges, memory, logical reasoning and creativity, make up the first section of the book and supplies the reader with a solid foundation of knowledge about the real issues. Section two presents an aggregate of about forty activities that all team-up to produce the end result, verbal intelligence or making one language wise.Having read, studied and applied this book to numerous children, I have obtained outstanding results to date. One example is a tenth-grade girl, comprehending at first-grade level who reached grade-level in 15 one-hour sessions with me.The efficacy of this program is due, in part, to the way in which children are taught. Most of us are aware that when a child discovers something, the likelyhood that she has learned it increases. Through implicit/discovery learning, children are engaged in problem solving, connecting words, analyzing, metacognition, increasing their own vocabulary, and more.I give &quot;How To Increase Your Chid's Verbal Intelligence&quot; a five star rating. It works and it's a blast.Swen Nater",
                "review/helpfulness": "56/57",
                "num_reviews": 57
            },
            {
                "review/text": "Having this volume dedicated to me, one might think that a review would have biased leanings. With that in mind, I will be as objective as possible. Having implemented this program into one-on-one and small group tutoring, I can say, from experience and from a pragmatic point of view, that it works. Personally, I have had the priviledge of testing it on a 10th grader who was comprehending at a second grade level, and with astonishment, watched her reach grade level in just 15 one-hour sessions. In addition, this young lady, who was cursed with detachment syndrome, due to being left on a Korean doorstep by her mother when she was an infant, blossomed in her communication and writing skills. Her liberation from the shackles of her, then supposed, doom, has made an incredible difference in her life, as you might well imagine.But that is only one child. I have perfomed small group instruction and witnessed similar growth, proportionally.My assessment of Verbal Intelligence is that it is a masterpiece. Discovery learning has always been a great teacher, and this program allows a child (or a person of any age) to implicitly learn the English language. This volume majors on this type of learning, allowing children to uncover and grab for themselves, the valuable syntax, vocabulary, and other components of verbal intelligence.I have seen children grow wings as they learn a strategy for learning the meaning of a new word, based on the rest of a sentence, or group of sentences. And, as they learn to tackle those words, I have witnessed an atrophy in the intimidation of new words and in the strategy of skipping over them. I have seen prodigious smiles as children compose an interesting, informative and complex paragraph through the caveman activity. I have seen excitement and incredible improvement as children engage in connecting words and deduction activities.It is my opinion that Verbal Intelligence is the exact thing that parents should be doing with their children all through school, and, I would go so far as to say that if parents engage their children in this, before kindergarten, they, and the school, will be amazed. It is not optional, but should be original equipment for our preschoolers.In short, I believe that Verbal Intelligence should not be simply &quot;added&quot; to a library, or integrated into a curriculum. It should have preeminence when language is taught.Swen Nater",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I am a recent graduate with a teaching degree who started teaching in a second grade class. I bought How To Increase Your Child's Verbal Intelligence, The Language Wise Method because of the author's first book, Reading Reflex. I wanted to improve my students' writing and language skills. I found the book informative and motivating. I have used several of the lessons from the book in my classroom. My students love the lessons and are eager to participate in them. I have noticed a dramatic increase in my students' writing and speaking vocabulary. Every lesson is taught in context and is meaningful to my students. I believe everyone who works with children should read about the Language Wise method, it has given me a better understanding of the learning process.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "With a plethora of ways to address reading comprehension, it is difficult as a teacher and parent to know which are really effective and why. As with Reading Reflex, the McGuinesses have led me to a deeper understanding of the familiar. The book's activites are simple and powerful and often ones that I have used before but without the accompanying understanding of why they are effective. The book is divided into two sections, the first explains the underlying theory. The second describes the activities. So many times we see activities without theory and theory without activites... here the twain have met. Understanding the logic of the activities makes them adaptable to the classroom setting. For example, there is an activity &quot;Connections&quot; where children are asked to relate not obviously related things. I used this as a prereading activity with a Native American myth, introducing some key elements of the story. The children generated connections and virtually predicted the story as they established relationships between a flute, a blanket and a branch. This is how understanding brain research can enlighten and strengthen our teaching practice, giving our students powerful experiences with written and spoken language. I highly recommend this book.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I think that Carmen and Geoffrey McGuinness have hit the nail on the head when it comes to both teaching decoding skills and verbal intelligence. These books have been a great help teaching my dyslexic son to read and comprehend. I finally found a system that worked!But, the \"Language Wise Support Manual\" that goes with this book is pricey (about 3 times the price of the book) and unnecessary. While it might help a classroom teacher who needs worksheets that he/she can send home for the student to work on, a parent can just use notebook paper to do the activities.For example, to go with \"Using Elaboration in Writing\" page 234 in the book, the workbook simply as a sentence at the top of the page that says \"Fill both pages on the topic of________\", followed by two pages of lined paper. A great number of the pages are like this.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "Geoffrey and Carmen McGuinness have written another great book for parents and teachers. How to Raise Your Child's Verbal Intelligence should be a primer for every pregnant mom and every school teacher in the country. The lessons are fantastic, and the wealth of information is invaluable.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "With a plethora of ways to address reading comprehension, it is difficult as a teacher and parent to know which are really effective and why. As with Reading Reflex, the McGuinesses have led me to a deeper understanding of the familiar. The book's activites are simple and powerful and often ones that I have used before but without the accompanying understanding of why they are effective. The book is divided into two sections, the first explains the underlying theory. The second describes the activities. So many times we see activities without theory and theory without activites... here the twain have met. Understanding the logic of the activities makes them adaptable to the classroom setting. For example, there is an activity &quot;Connections&quot; where children are asked to relate not obviously related things. I used this as a prereading activity with a Native American myth, introducing some key elements of the story. The children generated connections and virtually predicted the story as they established relationships between a flute, a blanket and a branch. This is how understanding brain research can enlighten and strengthen our teaching practice, giving our students powerful experiences with written and spoken language. I highly recommend this book.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "best practice todays standards for teaching and learning in americas schools",
        "description": "In this extensively revised and expanded second edition, we find updated descriptions of progressive teaching in six subject areas: reading, writing, mathematics, science, social studies, and the arts.",
        "authors": "['Steven Zemelman', 'Harvey Daniels', 'Arthur A. Hyde', 'William Varner']",
        "infoLink": "http://books.google.com/books?id=kpycAAAAMAAJ&dq=Best+Practice,+Today%27s+Standards+for+Teaching+and+Learning+in+America%27s+Schools&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Within Chapter One of the Best Practice by Steven Zemelman, Harvey Daniels, and Arthur Hyde, the three main principles are Student-Centered, Cognitive, and Social. Of these three Principles, the sub principles are Experiential, Holistic, Authentic, Challenging, Developmental, Constructive, Reflective, Expressive, Democratic, and Collaborative. This Chapter describes each principle, how each are being implemented and utilized in our schools, how government and educational organizations are recommending these principles, how these principles are uplifting student's academic achievement, and how they are positively renewing our educational institutions.Cognitive, a main principle, states \"The most powerful learning comes when children develop true understanding of concepts through higher-order thinking associated with various fields of inquiry and through self-monitoring of their thinking\" (Zemelman, Daniels, & Hyde, 2005, p.11). This type of learning moves away from memorization into conceptual learning. \"This self-awareness helps students develop more effective strategies for accomplishing tasks, making decisions, and reviewing their work\" (Zemelman, Daniels, & Hyde, 2005, p.15). I particularly liked this principle, because it helps the students be more analytical, creative, and have a deeper understanding.In Chapter 6 in the section of \"Qualities of Best Practice in Teaching Social Studies\", several research results, recommendations, and approaches towards an improved social studies curriculum existed. One of the learning experiences or recommendations I found quite interesting is \"Social studies should explore the full variety of cultures found in America, including students' own backgrounds and other cultures' approaches to various social studies concepts\" (Zemelman, Daniels, & Hyde, 2005, p.182). After students interviewed their parents, grandparents, neighbors, and other adults to make a connection with their own background, community, and diversity, this information enabled the students to give meaning to subjects such as history, politics, economics, culture, and folklore. These interviews were methods of learning, other than text book, that encouraged them to take interest in the class.Chapter Ten, entitled \"Will It Work in City Schools?\", in Best Practice by Steven Zemelman, Harvey Daniels, and Arthur Hyde, tackled the assumption that best practices wouldn't work in city or \"urban\" schools in big cities. \"Yet most people conclude that urban schools across the country are not working, that so-called at risk kids aren't learning, and that city schools haven't discovered the strategies of Best Practice\" (Zemelman, Daniels, & Hyde, 2005, p.294). This chapter discussed socio-economic statuses, class, race, and dialect as factors damaging city schools and students. Violence, witnessing shootings, deaths, and continued relocation were pressures placed upon students' concentration, being withdrawn, and being interested in education.The chapter mentioned that \"detailed research on child development during the early years reveal that at age three, they possess all the basic concepts for reading, stability of meaning, representation of reality through symbols, and linear directionality of print. \"There are no observable differences of such acquisition at this stage between any groups, rich or poor, urban or rural, black or white\" (Zemelman, Daniels, & Hyde, 2005, p.296). Most people would think that because of one's environment, genetics, or financial status, children would be subject to educational deficiencies in such early years, but this indicates that at some point in their lives, children usually start out on an equal learning level and playing field.The chapter touched on class, race, and how almost 100 percent of the teachers in urban schools are middle-class. This chapter pointed out cultural differences and gaps, and how important it is for teachers to understand them. Teachers don't have to totally identify with the students background, culture, or experiences, but those teachers who have a better understanding or knowledge that there are issues, their interaction and communication with the students will be more effective.The chapter deals with financial resources, politics, size of city schools, and how costs for retraining staff are factors that may cripple these schools. This chapter discussed standardized tests, change, resistance to change, and the \"traditional\" approach to learning. With all of the obstacles in front of city school's ability to provide a rich learning environment, or the obstacles in front of these students to survive and excel, best practice principles and \"good\" teachers are hurdling these obstacles to enable academic success. I believe Best Practices are working in city schools, county schools, and in major colleges.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is essential to recognizing that if we want to prepare our kids for the world they will actually live in we must teach in a way that prepares them for that world. The requirement in teaching and learning today is to produce thinking students who can read and write and compute while discriminating between fact and fiction; students who can seek new vistas of solutions and ask questions that offer new possibilities! Our world demands not rote facts and content but how to use knowledge to evaluate new insights, directions and solutions. It all begins in the classrooms with teachers who inspire students. Sadly, there are still many classrooms that are teacher directed with passive learners. The book offers specific strategies that when increased can re-engage, motivate and inspire our students today. I believe eager, motivated and inspired students is essential for our world's future!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I am finishing my first foundational class for becoming a teacher and this book was a great help. It provided so many real and practical ways of teaching different subjects. The layout of the book was easy to follow and was the same for the different subjects (reading, writing, math, etc.). It also provided some helpful tips for how parents and principals can contribute to a successful learning process in each of the subject areas as well. This was a nice addition you don't find in every book. I found the ideas easy to implement in any subject matter and easily adaptable to any type of student learner. This is a great book that will remain in my professional library for years to come!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "schaums outline of understanding calculus concepts",
        "description": "Confusing Textbooks? Missed Lectures? Not Enough Time? Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills. This Schaum's Outline gives you Practice problems with full explanations that reinforce knowledge Coverage of the most up-to-date developments in your course field In-depth review of practices and applications Fully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scores! Schaum's Outlines-Problem Solved.",
        "authors": "['Eli Passow']",
        "infoLink": "http://books.google.com/books?id=Lfr6CJehxHwC&dq=Schaum%27s+Outline+of+Understanding+Calculus+Concepts&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book explains the theory of differential and some integral calculus. There are worked problems, but I mostly ignored them in favor of the raw concept discussion.I read the book in the summer before my university Calc I class, and it seemed to make everything fit together much more quickly for me than most other students in the class. The book may not be as valuable as others for review, however.Highly recommended reading before you start a calculus adventure. One of the clearest explanations of calculus theory that I've ever seen. A few hours a week with this book in the summer will save you months of frustration during a hectic semester.",
                "review/helpfulness": "31/32",
                "num_reviews": 32
            },
            {
                "review/text": "Understanding Calculus is a esay and quick way to review and learn the hard topics in that course. The author uses a simply manner to explain the exercises and the theorems discuss.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the globalization of world politics an introduction to international relations",
        "description": "The Globalization of World Politics, the bestselling introduction to international relations, offers the most comprehensive coverage of the key theories and global issues in world politics. The eighth edition engages with contemporary global challenges, featuring a brand new chapter on Refugees and Forced Migration and updated coverage of decolonization to ensure the book continues to cover those topics that will define the key issues in IR into the future. Tailored pedagogical features help readers to evaluate key IR debates and apply theory and concepts to real world events. A fully updated Opposing Opinions feature facilitates critical and reflective debate on contemporary policy challenges, from decolonising universities to debates over migration and the state. Leading scholars in the field introduce readers to the history, theory, structures and key issues in IR, providing students with an ideal introduction and a constant guide throughout their studies. Students and lecturers are further supported by extensive online resources to encourage deeper engagement with content: Student resources: International relations simulations encourage students to develop negotiation and problem solving skills by engaging with topical events and processes IR theory in practice case studies encourage students to apply theories to current and evolving global events Video podcasts from contributors help students to engage with key issues and cases in IR Guidance on how to evaluate the Opposing Opinions feature, supporting students to engage in nuanced debate over key policy challenges Interactive library of links to journal articles, blogs and video content to deepen students' understanding of key topics and explore their research interests Flashcard glossary to reinforce understanding of key terms Multiple choice questions for self-study help students to reinforce their understanding of the key points of each chapter Revision guide to consolidate understanding and revise key terms and themes Instructor Resources: Case studies help to contextualise and deepen theoretical understanding Test bank - fully customisable assessment questions to test and reinforce students' understanding of key concepts Question bank - a bank of short answer and essay questions to promote students' critical reflection on core issues and themes within each chapter Customisable PowerPoint slides help to support effective teaching preparation Figures and tables from the book allow clear presentation of key data and support students' data analysis",
        "authors": "['John Baylis']",
        "infoLink": "http://books.google.com/books?id=Y1S_DwAAQBAJ&dq=The+Globalization+of+World+Politics:+An+Introduction+to+International+Relations&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The organization of the work is excellent and many of the chapters (including those written by John Baylis) were clear, concise, and easy for a graduate class to follow. Unfortunately, other selections in the work are diffuse, rambling, or awkwardly-written. Moreover, despite an attempt to provide a balanced perspective on whether globalization is actually occurring, the work tends to support the globalization argument without providing strong evidence. Baylis' brilliant initial chapter actually presents a plausible case against globalization. Finally, despite the importance of nationalist and religious-based ideologies in motivating transnational behavior, these concepts receive less coverage than, for example, feminist theories. I had to construct an entire unit on Christian and Islamic principles of transnational relations from supplementary materials. Although I might assign Baylis' first chapter as required reading, the quality of the writing in the remaining 400+ pages is too inconsistent to be a good text.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "This book helped me understand my initial international relations module at college. It is concise, informative and provides detailed analysis of key issues, and sets out typologies on how best to understand international issues.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "clear speech teachers resource book pronunciation and listening comprehension in american english",
        "description": "3 class audio CD's ; teacher's resource manual with accompanying audio CD ; student's book with accompanying audio CD.",
        "authors": "['Judy B. Gilbert']",
        "infoLink": "http://books.google.com/books?id=A-TUHpqEIfwC&dq=Clear+Speech+Teacher%27s+resource+book:+Pronunciation+and+Listening+Comprehension+in+American+English&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I got this book to help one of my advanced level students with her pronunciation. I was surprised at what the book really focuses on, and I have found it to be quite helpful. THE GOOD: 1) This book is different from other pronunciation books in that it only spends part of the time focusing on the sounds of English letters. Rather, it is organized into chapters based on other features of English, such as rhythm, linking, syllable length, stress, intonation and reduction. This is a wonderful &quot;next step&quot; for students who have had adequate practice with the sounds of English letters, but still have an accent. 2) It provides practice exercises that allow the student to practice more than one thing at a time. For example, one exercise allows the student to practice linking words while practicing the &quot;sh&quot; sound. 3) I think that the most valuable part of this book is the Clear Listening and Clear Speaking test at the beginning of the book. These allow teachers to get very specific responses from students, and then focus on the problem areas. THE BAD: While the book is great at helping students practice consonant sounds, it doesn't give much practice or help with vowel sounds. This is really my only complaint with this otherwise wonderful book. OVERALL: A great book that will help students fine tune their English speech. I recommend it for high-intermediate or advanced students. If students are looking for a good way to reduce their accents, or make themselves more understood by Americans, or even understand North American English better themselves then I highly recommend this book.",
                "review/helpfulness": "78/78",
                "num_reviews": 78
            },
            {
                "review/text": "Clear Speech is a well-conceived pronunciation text that, in my experience, students have found very pleasant to use. It covers individual sounds, as well as speech rhythm and intonation, in a very fluid way. It can help instructors teach ESL students to pronounce well not only word by word, but also to arrive at more natural-sounding sentence flow. I have found that the exercises in the book benefit students beyond their own pronunciation, and actually help them to understand native English speakers better. The third edition is a vast improvement over the previous one, because it guides students in deciphering English spelling and provides more practice in specific, troublesome sounds. The new edition also includes a practice CD, which is something many students using the second edition often wished for. The graphic simplicity of the book is a huge advantage over other pronunciation texts available. All in all, I think Clear Speech is one of the best - if not THE best - choice for teaching pronunciation.",
                "review/helpfulness": "27/27",
                "num_reviews": 27
            },
            {
                "review/text": "I split this book to create a 2-level pronunciation course for lower intermediate and higher students in Japan. The courses were extremely well received time and time again. The book is an excellent guide for such classes.I rated the book at 5-stars on its own merit. However, together with the audio cassettes I would have given it four and a half stars, as I believe the audio component needs to be available on CD for cueing purposes and ease of use.Teachers who have training in teaching pronunciation will probably be delighted with the book. Instructors trying to use the book without the benefit of training in teaching pronunciation may not have the background to utilize it fully.Rather than use the tapes an instructor can easily use their own pronunciation to model the lesson targets. This allows for easy adjustments of the speed, timing and rhythm of the exercises for different class groups.Students can practice the targets as a group, and then individually during the listen and repeat sections. The students generally loved the excellent pair work that followed, which allowed them to further practice and master to some degree what they had covered.As much as it is a pronunciation course, listening skills are an equally strong component. Again, the pair work was excellent in ensuring each student strove to achieve the listening and production targets.This book allowed mixed levels of students to work together harmoniously, challenge themselves in a very enjoyable and insightful way, and achieve real gains in their struggles to produce and understand spoken English. Students liked the limericks.I agree with the other reviewer who stated the diagnostic test with the book is an extremely useful tool.Highly recommended.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "Although I find the second edition useable with students, in my opinion, it was written for the trainers. I used the first edition with far more student successes because each chapter was built on the preceeding ones and stuck to the basics. In contrast, the second edition is TOO full of the many intonation elements all jammed and crammed into each chapter. Frankly, I was hoping that the second edition would give us more practice examples to solidify the the basic intonation elements people need and most can absorb. Instead,by comparison to the first edition, the book is overfilled with way too much &quot;stuff&quot;. Still, it's the best book on the market in it's class and I would highly recommend it to the trainers. I believe most students will have difficulty sorting out and dealing with the &quot;details&quot; in each chapter on their own. On the other hand, because of this jammed text, it is easily used for both intermediate to advanced level students ... you can get more bang for the buck.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This is one of the rare pronunciation textbooks that focus on helping speakers of English as a Second Language understand the way American English sounds when spoken in context, not just the way individual words are pronounced in isolation. Speaking more clearly and fluently often requires speaking word LESS clearly but using the proper simplifying rules. Native speakers 'know' these rules but are usually not aware of them. My colleagues and I have found that advanced students really love this book, and self-study is possible to some extent when used with the accompanying tape.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I am attending an accent modification class right now and I found this book very helpful. I practice aloud with the audio tapes and I begin to &quot;hear&quot; the subtle variations between vowels and similar consonants. This book helps me a lot in improving my speech.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "The product contains mainly the answer key for the acutal student exercise book, and if you don't have that to refer to, it's not as useful. The teacher editon should contain the student workbook for easier reference. There is a CD that comes with it but again without being able to see the corresponding exercises in the student workbook, you feel as if you're working blind.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a pragmatic approach to teaching pronunciation. Many pronunciation texts embellish lessons with unnecessarily difficult academic/phonological terms that serve no real purpose for the student, but rather confuse and complicate the student's learning process. Judy Gilbert simplifies this process and keeps the customer/student focus paramount. Her approach is refreshingly honest, stressing the most useful elements of pronunciation--those which are tied to listening. It frees the teacher and student from unnecessarily complex pedagogy. Over the past 6-7 years that I have used the text, I have found that this is one text that both the students and teachers can ENJOY! Thank you Judy Gilbert! (I look forward to using your new text &quot;Clear Speech from the Start.&quot;)",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "As an experienced language teacher and DOS at a language school, we have designed a short course around this book. Providing one keeps sound understanding of what language is made up of and what sound language teaching consists of,the Clear Speech book is extememly useful, fun, and interesting to both the learner and the teacher. Some of the exercises are a lot of fun. Informed language teachers realise that language is not infact just about discreet points of aspects of language i.e. language is largley about successful communication and involves all the skills and features including socio-linguisitic as well as purely linguistic. We know these days that language needs to be approached with an ecclectic perspective and the learners' needs foremost as part of a program. Part of any program should include pronunciation, so long as it is in balance. This book focuses on the wider influences surrounding pronunciation which affect overall fluency and language proficiency, for example, stress, intonation, timimg, rythum, syllable-length, patterning, problem sounds, and listening. Most importantly, I would argue that it is a very soundly designed book useful for serious language teachers which will help develop a personal monitoring system into the learners' language useage awareness, thus influencing significantly their fluency. In this context, the exercises are very beneficial. I am sure the book is not so focused as to ignore or intended to take the place of the wider needs and other macro skills that need more attention overall such as is found in general English classes etc, but offers a user friendly and relative set of exercises in a format that has continuity if desired, or can be utilised as a selective supplimentary tool. I would say Clear Speech is a book that should preferrably be teacher-taught to be truly effective.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "\"Clear Speech\" is the best. First, I use the text book & CD at a college, and I brought the Class Audio CDS for self-study at home. You need it, because CDs coming with Student's or Teacher's books don't include all listening dialogs.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "making literature matter an anthology for readers and writers",
        "description": "Students have always responded powerfully to the memorable stories, poems, plays, and essays gathered in distinctive clusters in Making Literature Matter's thematic anthology. At the same time, the book's chapters on reading, writing, and research help students harness those responses into persuasive, well-supported arguments about the issues raised by the literature. As ever, the new edition of Making Literature Matter reflects John Schilb and John Clifford's careful attention to emerging pedagogical needs. In response to instructor requests, the text includes even more instruction on the key skills of argumentation, critical reading, and research, while linking literature more directly to the newsworthy current issues of today in new \"Literature and Current Issues\" clusters. Further, they have read widely to identify the most engaging recent fiction, poetry, drama, and nonfiction, and based their new choices for the seventh edition on how well that literature explores issues that matter to students right now. Making Literature Matter is also available with LaunchPad Solo for Literature, a set of online materials that helps beginning literature students learn and practice close reading and critical thinking skills in an interactive environment. To order Making Literature Matter packaged with LaunchPad Solo for Literature, use ISBN 978-1-319-07191-2.",
        "authors": "['John Schilb', 'John Clifford']",
        "infoLink": "http://books.google.nl/books?id=pDOsswEACAAJ&dq=Making+Literature+Matter:+An+Anthology+for+Readers+and+Writers&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Truly an anthology for readers and writers, this book encourages students to think more critically about the world around them. It calls on a variety of timely themes and genres to satisfy numerous interests and tastes in literature. It also provides many helpful rhetorical strategies for arguing about literature. Freshman writing instructors should give Making Literature Matter a look; it will not disappoint.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "A good required text for a Freshman English Composition class. A wide variety of selections that bring up a lot of ideas for in-class discussion or composition.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "activity workbook to accompany side by side book 1",
        "description": "Expressways, by Steven J. Molinsky and Bill Bliss, is a complete four-level course that features all-skills language practice. The series incorporates cooperative learning, critical thinking, problem solving, role-playing, cross-cultural discussions, self-assessment, and community activities to promote an interactive, student-centered learning experience. New Activity and Test Prep Workbooks provide a variety of exercises and activities for reinforcing grammar, and grammar and test-taking practice to prepare students for standardized tests.",
        "authors": "['Steven J. Molinsky', 'Bill Bliss']",
        "infoLink": "http://books.google.com/books?id=wfCyAAAACAAJ&dq=Activity+Workbook+to+accompany+Side+By+Side,+Book+1&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is an amazing series of books for any age beginners of Oral English as a Second Language (American English). I taught this series in China for 3 years, and am currently an M.Ed student. This series not only allows an inexperienced teacher to be able to jump into any class and feel confident teaching, but offers a strong order to the subject matter that is taught. The vocabulary and grammatical forms that are introduced are very useful in daily life.If I were to offer criticism about this series is that these books are very sterile. Without supplemental activities, students will find the repetitive 'conversations' quite droll. Secondly, although it can be used at all ages, it's better to be used as a young adult/elementary book to be used as a SUPPLEMENT to other regular English classes. Without further instruction, many students feel that the material progresses much too rapidly. For example, Lesson 1 teaches the Alphabet and \"What's your name?\" while Lesson 3 is teaching Present Continuous Tense.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I have to say..I just started using this series and thus far, the written portion is great! But how could I have known it required a very expensive CD? I sure wish that part had been stated before I ordered this series.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This workbook gives beginning English learners a great review in the four basic skills of listening, speaking, reading and writing. In addition, there are grammar raps or jazz-like songs for pronunciation, intonation and rhythm practices. Check-up tests after every three lessons make a teacher's task much easier.I have used the Side by Side series for years and found them very well-organized, interestingly designed and user-friendly both for students and teachers. To help students improve writing even more, I usually ask them to write out complete answers in their notebooks instead of just filling out the blanks in the workbooks.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book is a big help in teaching English to some precious Spanish speaking folks. We tried using just the regular workbook last year and there wasn't enough reinforcement or practice without this activity workbook. Side By Side goes rather fast in the skills it tries to teach.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I am helping a Japanese lady with conversational English and a friend of mine recommended \"Side by Side.\" I scheduled our first class on Sept 2nd and went to Amazon to order \"Side by Side\" on Aug 28th. The message at the end of the order said that I would receive the material on or about the 5th. I figured I would just be able to do simple conversation with my student on the 2nd and 4th. HOWEVER, I received the \"Side by Side\" books on Sept 1st (3 days after I ordered them)!!! That was so wonderful!My student and I are really enjoying the beautiful pictures and she is making great progress.Thank you,Esther Shafer",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "goal setting for students",
        "description": "Using Goals to Amplify Student Learning Step Into Student Goal Setting provides an action plan for answering the question: What does this student know and how do I build from it? Research-driven and practical, this guide shows teachers how to integrate formative assessment, student metacognition, and motivational strategies to make goal setting an integral instructional strategy for learning growth and agency. Readers will find: Actionable strategies for incorporating goal setting in instructional practice Tips for using goals as motivational strategies to drive student growth Guidance on how to coach students through setting their own goals Vignettes and examples to demonstrate what goal setting looks like in the classroom",
        "authors": "['Chase Nordengren']",
        "infoLink": "http://books.google.com/books?id=5d9EEAAAQBAJ&dq=Goal+Setting+for+Students&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Goal Setting For Students is an effective educational tool for teaching young people how to focus on specific goals in order to increase their chances of academic success. Ideal for any school curriculum, as well as home-school instructors and/or self-study, this consumable workbook is filled from cover to cover with diverse activities to reinforce its message of working for whatever needs to be achieved. From learning how to set realistic goals; to measuring academic progress; to walk-through examples, and more, Goal Setting For Students is an ideal motivational tool for any student regardless of academic subject matter.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "I'd rate it with more stars if I could.Goal Setting for Students is a nice, 68 page book that will help every parent get his or her child started on goals and achievement. The layout is simple and easy-to-read, and each chapter offers questions, with do-able and interesting activities, plus a final review at the end to recap what was taught. The book encourages children and teens (the book is for 5-12 graders) to invest in themselves, and why.I tutor kids in my home (though I don't have children of my own), and can't wait to show this guide to parents. If your child seems \"lost\" or is not achieving on a level you'd like them to, this book is a great place to start.What a valuable yet inexpensive investment!John Bishop has zeroed in on a problem with kids--they have no purpose and no direction.Parents: Goal Setting for Students will help you to help your child.Teachers: Goal Setting for Students will help you to help your students.Even though the age range is for students in grades 5-12, if you have younger students or children, I'd buy it anyway. The tools in here are great for almost any age.What a legacy to leave your children: success and direction",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the confident student",
        "description": "Building confidence through accomplishment remains at the heart of THE CONFIDENT STUDENT. This practical and accessible text features self-discovery, self-assessment and confidence-building activities to keep students motivated and help them develop the skills they need to be successful in all of their courses. The Eighth Edition delivers more explicit critical-thinking instruction in every chapter. New Thinking with Bloom activities encourage active reading and processing of information by guiding students through the six levels of thinking as they reflect on chapter concepts. In addition, more intentional practice of reflective thinking is provided in the fully revised Your Reflections exercises at the end of every chapter. New questions and writing prompts invite students to engage in self-reflection for the purpose of assessing progress, discovering strengths, and addressing weaknesses. Available with InfoTrac Student Collections http://gocengage.com/infotrac. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
        "authors": "['Carol C. Kanar']",
        "infoLink": "http://books.google.com/books?id=BigJzgEACAAJ&dq=The+Confident+Student&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I use this book with students. They love it! It provides helpful strategies to enhance listening skills, note taking skills, comprehension, test taking preparation and time management. Students keep this book and refer to it often.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "That's the main message of this textbook. According to this worthless piece of junk, if you fail in a class, it's totally your fault. There are no such things as bad professors, just bad students. No matter how well you think you tried to take notes and be an \"active listener,\" you apparently just weren't trying hard enough! If you get a bad grade on a test, why, the professor NEVER could have supplied you with unclear, badly written questions, or even quizzed you on material you didn't cover! It's all YOUR fault! And don't you ever dare disagree with the teacher, even if they're stating something factually wrong! You're mistaken!",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "scool moves for learning",
        "description": "A reading specialist and occupational therapist come together to discuss why children struggle with academics and behavior challenges. This book is packed with powerful learning theory and practical application. The authors solidly explain why optimal learning occurs when connecting body, mind, and emotions. The theory is based on Margot Heiniger White's Learning Pyramid, developed from over 30 years working with children experiencing behavior and developmental challenges. Integration of eight pyramid levels lead to academic, emotional, and social success. The book is divided into chapters for each pyramid level. Strategies for success, student profiles, integrative movements and activities are included in each chapter. Interviews with specialists in the fields of autism, developmental optometry, and listening therapy bring together perspectives from related fields. Five years of statistical data showing the effectiveness of the program is found in the appendix. Poster PE, Minute Moves, and Focus Plans also available by the authors. \"As soon as teachers recognize that movement helps children learn, they search for safe and appropriate activities to incorporate into their school day. Thank you, Debra and Margot, for a book chock-full of imaginative, stimulating, and effective movement ideas!\" --Carol Stock Kranowitz, author, The Out-of-Sync Child.",
        "authors": "['Debra Wilson Heiberger', 'Margot C. Heiniger-White']",
        "infoLink": "http://books.google.com/books?id=SKjgAAAAMAAJ&dq=S%27cool+Moves+for+Learning&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The collaboration of a reading specialist and occupational therapist provide readers with a unique perspective on how the foundation for learning develops. Authors Heiberger and Heiniger-White offer an in-depth perspective on the neurophysiological and developmental causes for learning difficulties. S'cool Moves for Learning provides clear explanations for writing difficulties, reading challenges, and attention and focus problems. Interviews with an audiologist, physical therapist, and vision therapist further the readers understanding of how the systems of the body must be integrated for optimal learning to occur. Dr. Robert Sylwester, author and educator states, \"We've too long viewed education as something directed to only the very top several inches of the body. We now realize that we are modular-composed of biological systems that must collaborate in any decision and action we make.\" The authors state that if we truly want children to reach their maximum learning potentials, we must provide opportunities for their body-mind-emotional systems to become integrated as a whole, and not see cognitive skills as something separately taught-with the body and emotions having no bearing on the outcome.Teachers in Northern California using S'cool Moves daily in their classrooms give their stamp of approval, and report students show great improvement in self-control, focus, and academics. Minute warm-ups for reading, writing, and focus blend smoothly into their jammed-packed academic schedules. Linda Michaels-Spivey, a fifth grade teacher comments, \"It's a joy to see how much students love the program and add their own unique style to the movements. The activities bring relief for children having a difficult time regulating behavior and focusing on academic tasks.\"Simple to follow theory, charts, and activities make this book an excellent resource for teachers, parents, medical professionals, day care providers, counselors, and anyone working with children. S'cool Moves offers the perfect blend of current brain research, mind-body science, and leading edge therapies. Each chapter is complete with an observation checklist, a short scenario focusing on a child with difficulties, classroom strategies for success, and specifically-designed movements to integrate the child's mind-body system.The authors support their work by including six years of statistical data showing improvement in standardized math and reading scores along with high achievement from their Title I students. Blending S'cool Moves techniques with powerful reading and math programs shows promising results. With expectations for academic achievement high and filtering down to earlier grades, S'cool Moves for Learning offers an effective approach to strengthen the learning foundations for all students, especially those struggling to keep up with their peers.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I highly recommend S'cool Moves to teachers, para-professionals, support teachers and parents. I've been working with this book for three years within a classroom setting - working one-on-one with a special needs child. The gross motor activities can be taken into the school yard while others are easily done in the classroom. The step-by-step instructions are clear, even for novices. The book relates exercises and activities to the affected systems and how they influence learning. Its easy-to-read format and good visuals make it a handy field book. I've found that I can go directly to a section and find what I need according to the child's developmental progress and level. If used diligently four days a week it will yield results.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "introducing phonetics and phonology",
        "description": "Previous edition: London: Hodder Education, [2010].",
        "authors": "['MIKE. HANNAHS DAVENPORT (S.J.)', 'S. J. Hannahs']",
        "infoLink": "http://books.google.com/books?id=wH2TygEACAAJ&dq=Introducing+Phonetics+and+Phonology&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In my view, this book is the best introductory textbook to the fascinating fields of Phonetics and Phonology currently available.As a mature undergraduate studying Linguistics, with no A Level English Language under my belt, I had no prior knowledge of the areas this book covers, and as such was disadvantaged in comparison to the other students who had done the A Level. However I soon found, with the aid of this worthy publication, that the playing field had been levelled.This is not to say that this was the only book at this level that I read. In fact, I have at least four others in my collection. Why this one stands out is because of its clear and informative style, understandable examples, and sensible, logical layout.Initially there is an overview, laying out the underpinning theory that the modern sciences of Phonetics and Phonology are built on. The distinction between physical language and the underlying mental representation of its physical form, as adopted by Generative Linguistics, is introduced, and Phonology and Phonetics are placed into the 'big-picture' of a total language model that includes Syntax, Morphology and Semantics.Next comes an introduction to articulatory phonetics: the actual physical mechanisms used in the production of speech, including airstream, vocal cords and places of articulation. This then opens up the complete exposition of consonants and vowels, and details all the possible types of sounds that humans produce. Clear tables and diagrams are used throughout, making understanding and revision an easy task.After this comes a chapter on Acoustic Phonetics, the captivating study of the properties of speech sounds. Not only does it consider the physical nature of these, but also focuses on the linguistically relevant acoustic features that play a part in production and reception. Here the authors have taken some complex physics and made it fathomable, no mean feat!From here on, the book investigates the phonological rules and features used when we produce speech. Davenport and Hannahs introduce the Linear Model of phonology, as pioneered by Noam Chomsky and Morris Halle in The Sound Pattern of English, (1968. New York; Harper &amp; Row), and developed by many, which to the uninitiated would make you run away faster than a gazelle! The chapters develop in a logical manner, each building upon the previous, and the reader comes out with a sense of mastery over the data.Throughout this discussion, however, the book does not take this Linear Model as gospel, and the authors frequently highlight problems that the model cannot account for. They introduce several alternative models, like Autosegmental Phonology and Feature Geometry, and the discussion of the relative merits is open and unbiased.Finally, the book concludes with a well-written chapter that stresses the need to constrain the phonological model so that over-productive rules are dismissed with. Concepts like extrinsic vs. intrinsic rule ordering, abstractness and the power of the phonological component are discussed, leaving the reader in a frame of mind to delve into further reading.Overall this is an excellent book, well written and interesting all the way. As a student of Linguistics this is a must, with exercises at the end of each chapter to test your knowledge, not just at degree level, at High School Level too it will prove an invaluable resource. Also, for the non-academic with an interest in how we produce speech, Introducing Phonetics &amp; Phonology is an excellent and enjoyable read.",
                "review/helpfulness": "23/24",
                "num_reviews": 24
            },
            {
                "review/text": "If I could I would put 4,5-star rating here. The book is definitely higher than 4-star ones, but it lacks some rather important issues to be rated full 5 stars. It would be nice to have more info on tone and intonation, and prosody in the book. Besides the authors failed to include issues on auditory phonetics. As for the issues which the authors did tackle, they are dealt very well. The book is easy to read, supplied with exercises to consolidate skills and knowledge, and expands on contemporary phonological theories. I would advice this textbook as a major one foe the 1-yesr students of linguistics, provided they use some supplementary writings on the basics of perceptive phonetics and intonation.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "sixway paragraphs 100 passages for developing the six essential categories of comprehension middle level",
        "description": "Six-Way Paragraphs, a three-level series, teaches the basic skillsnecessary for reading factual material through the use of the following sixtypes of questions: subject matter, main idea, supporting details, conclusions,clarifying devices, and vocabulary in context.",
        "authors": "['Walter Pauk']",
        "infoLink": "http://books.google.com/books?id=-2o_QQAACAAJ&dq=Six-Way+Paragraphs:+100+Passages+for+Developing+the+Six+Essential+Categories+of+Comprehension,+Middle+Level&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was recommended to me by the Lindamood Bell folks who teach reading comprehension etc.The paragraphs and the questions help develop comprehension.Each paragraph has multiple choice questions on main idea, subject, supporting details, clarifying devices, conclusion, vocabulary.These really help the student focus. I also use the paragraphs forthe visualizing exercises encouraged by the Lindamood bell system.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Our school district purchased one of these books for all of the Language Arts teachers in the middle schools. I used them once a week in my classroom as a fluency reading activity. My reading comprehension scores improved as well as the students ability to summarize the information. We also piloted a handheld program in our school and I reformatted the questions at the end of each selection and the students took the selections \"quiz\" on QUIZZLER...",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "This book contains over 100 mini lessons to help student identify parts of paragraphs, graphs to chart student's progress, and answer key. A great resource for struggling readers or writers.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "longman preparation series for the toeic test advanced course",
        "description": "Longman preparation series for the new TOEIC test: listening and reading, intermediate course, give students the skills, strategies, practice, and confidence they need to increase their scores on the Listening and Reading sections of the TOEIC test. Ideal for a TOEIC test preparation course or for self-study, the Intermediate Course is indented for students who achieve TOEIC test scores from 300 to 600.",
        "authors": "['Lin Lougheed']",
        "infoLink": "http://books.google.com/books?id=9HlftAEACAAJ&dq=Longman+Preparation+Series+for+the+Toeic+Test:+Advanced+Course&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book has proven successful in preparing our students for the TOEIC exam as shown in our control exams for measuring language learning progress. I recommend it for intermediate level students. There is also an Introductory Course by the same author for Elementary Students which is as good as this one.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is excellent, as are all the Toeic books that Longman publishes. One shortcoming is strident, however, and that is the absence of tapescripts at the back of the book. I can only postulate that this omission is designed to stop the Toeic aspirant from cheating, but it certainly makes the acquisition of this set of Toeic material both costly and cumbersome.Rebecca Reynolds",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "macmillan mcgraw hill reading grade 5",
        "description": "The Treasures program is building brighter futures for all students in K-6 Reading/Language Arts. This all-new comprehensive, research-based reading program offers a wealth of high quality literature to engage learners. Explicit instruction and ample practice ensure students' growth in reading proficiency. Each week's lesson integrates grammar, writing, and spelling for a total language arts approach. - Publisher.",
        "authors": "['Diane August', 'Donald R. Bear', 'Janice A. Dole', 'Jana Echevarria', 'Douglas Fisher']",
        "infoLink": "http://books.google.nl/books?id=6U1TSQAACAAJ&dq=MacMillan+McGraw+Hill+Reading+Grade+5&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Used these in public school, so like them for homeschool. A variety of activities and reading exercises. My homeschool student loved this book and learned a lot of content as well as reading skills.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I use this reading textbook for my fifth grader that I'm homeschooling this year. As a reading textbook, it presents stories for the child to read that are culturally diverse, and some of them very inspiring. At the end of each story, there are questions aimed at testing the child's reading comprenhension, and some activities aimed at improving a child's reading and writing skills.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "a concise introduction to linguistics",
        "description": "Now in its fifth edition, A Concise Introduction to Linguistics provides students with a detailed introduction to the core concepts of language as it relates to culture. The textbook includes a focus on linguistic anthropology, unpacking the main contributions of linguistics to the study of human communication and culture. Aimed at the general education student, the textbook also provides anthropology, linguistics, and English majors with the resources needed to pursue advanced courses in this area. Written in an accessible manner that does not assume previous knowledge of linguistics, this new edition contains expanded discussions on linguistic anthropology, sociolinguistics (including a section on gender and language), and pragmatics. The textbook incorporates a robust set of pedagogical features including marginal definitions, a substantial glossary, chapter summaries, and learning exercises. Brand new to this edition are suggested reading lists at the end of every chapter, and recommended websites and apps to further aid students in their study.",
        "authors": "['Bruce M. Rowe', 'Diane P. Levine']",
        "infoLink": "http://books.google.com/books?id=LjZlDwAAQBAJ&dq=A+Concise+Introduction+to+Linguistics&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I have learned so much from this book. A great textbook for a fun Linguistics class.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "Concise, easy to read and understand. Great examples. Covers a wide variety of topics without losing the jist of Linguistics. Highly recommend for an introductory class.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "selfcontrol patrol workbook exercises for anger management",
        "description": "This workbook is designed to be part of a theraputic program for impulsive children, or children having behavioral difficulties. The exercises are designed to make learning self-control skills fun.",
        "authors": "['Terry Trower']",
        "infoLink": "http://books.google.com/books?id=QWWrAAAACAAJ&dq=Self-Control+Patrol+Workbook:+Exercises+for+Anger+Management&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book ought to be a best seller. I guess they just don't spend much money promoting it. It does not just tell kids to behave, it uses activities to show them. It gets them to think about what they are doing. Many times kids act impulsively. They need this book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This workbook is helpful for elementary school children who have difficulty controlling their anger. It starts out by helping the child identify what angers them, and what happens to their body when they are angry. This is the beginning of learning awareness, which is the building block of self control. The concepts are simple enough for younger children and progresses to slightly more complex concepts for the older elementary child. I highly recommend it.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "As an educator of students with social and and behavioral issues, I am always looking for new resources to use with my students. I originally bought this workbook about 10 years ago when I was teaching elementary school and have always found the activities extremely valuable. I lent it to another teacher who lost it and was very thankful to find it once again on Amazon. I teach High School now and still find the activities essential. This workbook can be used for all grade levels and functioning levels, modified for lower functioning students and expanded upon for higher cognitive functioning students. The basic premise is ageless.In essence this book stresses that it is okay to be angry and that the most important part of being angry is how we express the feelings. The lessons flow logically from a metacognition, having students explore situations that they feel anger, to how angry feelings manifest within their own bodies. Alternative outcomes are explored from the choices made in how feelings are expressed. These same methods and exercises are used in Cognitive Behavioral Therapy by professionals making a heck of a lot more money than me, with essentially the same results. I have had a great deal of success using these exercises and activities and the students really seem to enjoy and participate. I highly recommend this to educators, therapists, or anyone working with kids, or adults for that matter, with anger management issues.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "electric circuits",
        "description": "Designed for use in a one or two-semester Introductory Circuit Analysis or Circuit Theory Course taught in Electrical or Computer Engineering Departments. Electric Circuits 9/e is the most widely used introductory circuits textbook of the past 25 years. As this book has evolved over the years to meet the changing learning styles of students, importantly, the underlying teaching approaches and philosophies remain unchanged. The goals are: - To build an understanding of concepts and ideas explicitly in terms of previous learning - To emphasize the relationship between conceptual understanding and problem solving approaches - To provide students with a strong foundation of engineering practices.",
        "authors": "['James William Nilsson', 'Susan A. Riedel']",
        "infoLink": "http://books.google.nl/books?id=SAUoAQAAMAAJ&dq=Electric+Circuits&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "A stinkerThe major frustration students mention when derogatingthis text is the fact that solutions are not provided. While this is a legitimate complaint against the book there are much larger systemic problems with the text. Even though I had access to all the solutions I found this book to be fairly pathetic.First the book conceptually sloppy. Aesthetically its nicely laid out and I suspect the average rushed professor pursuing through it when searching for an appropriate text for their class will look at its superficial qualities (pretty pictures, major topics are appropriate ordered and highlighted) and think the book is suitable for their class. I assure you it's not suitable for most students. Secondly the book, which somehow and tragically got a foothold in universities, has enough critical mass and momentum to perpetuate its obsolete and sad existence despite many better contenders. This is a major problem in academia which is so sessile and scared of change that it takes a miracle to usurp an established text, no matter how poor that text actually is. I suppose this is because they are freightened that they will be looked down upon if they dont follow the same established pracitces as other universities they wish to measure up to. Probably the same reason they will hire bad professors from Harvard or Yale over better teachers from less famous schools. A self-perpatuating, group think cowardice that fails to serve their students.Now the book is sloppy in the sense that concepts aren't developed or explained well, or at all, explanations are cloudy or lead back onto themselves. Worst of all The drill exercises and problems don't correlate well with the text. Most exercises seem to expect you to go one to two levels of creative and intuitive abstractions beyond what's stated in the text. This is not acceptable in a putatively introductory text. Despite the authors stated belief in the foreword, this is no way to teach beginning students who want to learn the basics and learn them clearly. This is totally inexcusable, nave, and fundamentally wrongheaded.As an example exercise 1.10 cannot be answered with the scant and unhelpful information provided.Exercise 2.11 is truly a circuit divider problem but circuit dividers aren't introduced into later in the book. It seems the author expects you to figure out a circuit divider on your own -ya right.This is just a preliminary taste of the sloppiness and wrong-headedness present in this tome. I have reviewed several of my textbooks all positively except for this mess.This work is embarrassing for the authors and I would think with so many poor reviews they would work to correct some of these issues. But alas the last three editions of this book are next to identical with no changes between the editions except for rearranging the problems order in the back of the chapters and an obvious intent to generate new monies from poor students by reissuing the same tired material - classy move there.Now I'm concerned the authors will blow off these poor ratings and just attribute them to bitter, underachieving students, but how can so many complaints be ignored? The author previous editions are almost identical to his latest mess so why doesn't he correct at least some of the issues repeatedly stated by students. One can only guess he doesn't care, is too lazy, or is in a state of denial.Jim and Susan need to reconsider their errant ways. So many students cant all be wrong, you produced a stinker here that's sloppy and ill conceived. Please put substance in front of pretty layout and address the needs of so many frustrated students. Please!",
                "review/helpfulness": "73/84",
                "num_reviews": 84
            },
            {
                "review/text": "REA's problem solvers series starts out with a treatise on why they have written their books. Many of the problems they express with textbooks are evidenced in Electric Circuits by Nilsson, et al. The following problems, that REA states are evident in many textbooks, are evident with this one: \"No systematic rules have been developed which students may follow up in a step-by-step manner. . .\" the subject matter is written \"by a professional who has insight. . .not shared by the students\" and \"the examples following a topic are too few in number and too simple to enable the student to get a thorough grasp of the principles involved.\"While Electric Circuits does a presentable job at being clear, it tends to gloss over important nuances that are not described in the examples. With no answers to exercises available with the book (you can find them on the book's official website with some searching-but even those solutions have multiple errors) and no study guide showing step-by-step solutions to some of the problems, the student is left with trying to figure out the exercises without adequate examples or explanations. This reduces the textbook from being a resource to being a reference that sits in the student's book bag all semester only to be opened to find the assigned problems.For an individual to read to get an extremely basic explanation of circuit analysis, or for an expert looking to refresh his or her memory, Electric Circuits may be adequate. For a student trying to learn the minutiae of circuit analysis, this book is woefully lacking.",
                "review/helpfulness": "57/60",
                "num_reviews": 60
            },
            {
                "review/text": "I am using this text right now in a circuit analysis course, and I believe the text is actually making the course harder than it needs to be. I have a number of years experience in electronics and have taken circuit analysis in the past (far past). This book, while doing a fair job on the basic explanation of the principals, uses trivial examples for illustration, then leaves you to figure out the more complex drill and homework problems with absolutely no help whatsoever. In addition, the authors and Prentice apparently think that a student solutions manual would hinder the education experience, so their solution set is illustrated only in the instructor's manual, which is unavailable to students. Consequently, you have no idea whether you have worked the problems correctly unless the instructor corrects them, or provides access to the solution manual somehow. If I'm working problems at 2 am, running to the library or the department office is not an option. The authors should redo this book completely and make it useful to students, rather than relying on the good graces of the teachers who use it. In the meantime, be prepared to do a lot of outside research to help you with the examples. Unless you have to have it for a class, send Prentice a message and buy a different book.",
                "review/helpfulness": "44/45",
                "num_reviews": 45
            },
            {
                "review/text": "This is a review of the SEVENTH edition of \"Electric Circuits\" by Nilsson & Riedel. Amazon generally keeps reviews of previous editions combined with later editions and that can be quite confusing. For example, many of these reviews make a complaint that the book has no answers in the back. That may have been true in their edition, but for this, simply turn to Appendix G page 939 and many answers are provided for selected problems. The authors state that all text and problems in this edition have been triple checked for accuracy.The student should come to this book with some familiarity with integral and differential calculus and an elementary course in physics. That will carry you through the first twelve chapters. For the last six chapters you will also need to have some facility with differential equations.I found the book to be clearly written and the quantity of problems provided to be quite useful and helpful. It is by working with the material being learned that one gains facility and it sticks in the memory more permanently. Each chapter is laid out clearly with boxes of extra material as well as Assessing Objectives that help the student know if they have command of the principles being discussed. There is also a chapter summary and a series of problems. The book provides something like 1,000 problems for the student. Good illustrations, diagrams, and pictures to illustrate the text.The book also comes with a limited student version of a commercial circuit design software package called PSpice using ORCAD 9.2. The manual says that the software is more menu driven and requires less programming than previous versions.This is a very solid resource for students to use in coursework or for someone to work through on their own.",
                "review/helpfulness": "13/19",
                "num_reviews": 19
            },
            {
                "review/text": "James W. Nilsson 2nd edition was a required text at Florida Atlantic Unviersity's Electrical Engineering Department at one time. The text was found to be difficult by most students to understand. Nilsson chose to quickly begin using Current and Voltage sources -- without too much detailed explanations.Note, the usual general malady with most engineering textbooks is that they cover the material in the Chapters at \"one level;\" and then later authors ask questions at the end of the Chapters that are mostly beyond students' beginning \"radar\" ssytems. Most authors typically defend this writing technique by saying that it challenges the student by having students spend over 10 hours on any one problem and if they are lucky they may get an answer. But, at this slow rate it's no wonder that students hardly ever acquire a broad understanding of many key concepts, since they stay stuck at too many places in the first few chapters. This becomes a very INEFFICIENT educational delivery system in a Postmodern fast-moving world -- where knowledge's Bandwith speed is in the order of the many Mega bit per second range while the educational textbooks are at the Kilo bits per second range.From a strictly cognitive position, this type of old fashion \"educational\" European-style methods helps not the students, but the educational \"gatekeepers\" who have a vested interest in holding back many talented students. The dropout rate in science and enginnering is alarming and society should take a real hard look at this silly mistake our eduators are making. Thus, their keeping this old European style in our American classrooms is bad.Textbook writers MUST write for all students and not for some \"pie-in-the-sky\" ideal few while overly burdeing other students. Thus, today I'm suggesting that a Federal law mandating authors to write student-friendly textbooks. Normally, I wouldn't suggest this drastic measure but since the emotional pain and dropout rates are so alarmingly high every year, maybe someone should shoutout from some Rocky Mountain's top and say we must do better with writing textbooks. If authors don't want to change, then places like Amazon.com can greatly help persuade these old style writers to change, since the criticsm they will keep receiving will be unforgetabe and huge. A sample reading of other Amazon.com students shows that there is much dicontent with author Nilsson's texbook. Therefore, instead of authors encouraging and helping students learn faster by giving them all the information in a Chapter, authors force students to waste a lot of time chasing other students or teachers for more help. I now think that authors probably concocted these end-of-chapter problems.Please note, that society spends many hundreds of billions of dollars a year on education; however, the damning results from this spending on textbooks, teachers and administrators are mostly discouraging and sometimes even dismal! Only a small percentage of students can learn or \"survive\" in this inimical educational old-fashioned environment, and textbook authors don't usually help much either. In most engineering curriculums textbooks got so foggy that Schaum Outlines became very popular among students. Other small companies have followed suit, by making technical subjects clearer with many types of Examples problems of varying difficulty.Publisher's RoleTechnical textbook must improve.Publisher must also pitch-in by formating textbooks that cognitatively assist the reader read faster. Publishers can begin by first placing Diagrams and Figures very close to where the text discusses these particular diagrams. But since Publishers sometimes hire in-experienced workers, students can't expect too much creativity from publishers despite the fact that textbooks sticker prices have recently skyrocketed. Furthermore,these low-paid textbook workers could care less how they lay out a given textbook. They will be prone to slap it together and be done with it!Moving to Videos and DVDs:But why don't we forget about textbooks altogether and go directly to videos/DVDs which provide 3-d figures along with animation -- which greatly helps students cognitatively retain what they see longer! The printed word can only go so far, and moreover, if it's not written well, then it can be very difficult to comprehend. Most Postmodern students don't even bother reading these foggy rambling technical textbooks since they know from past bad experiences that most textbooks are just good door stoppers.Adding Sound to TextbookHollywood discovered in the 1920's that silent movies were not as good as movies with a sound track added. So too society must find a way to add SOUND to textbooks in order to make them more useful and more effcient.Lately, publishers are trying to add colors and even some CDROMs but these are only small steps, while publishers are disproportionatley forcing students to pay much higher prices for these pricey door stoppers. Publishers are changing editions every 2 years whether the textbook gets any significant change or not. Publishers are just ordering that authors comply with this corporate revision mandate. Students are now scarmbling for relief by buying used textbooks and older editions since students now realize that the textbook changes are minor in scope.My Conclusions:If Nilsson corrected his many errors in his textbook and then also gave the students ALL the info inside each chapter so they could do the difficult problems and then added CDROMs, then his textbook would start looking good. It may even begin to compete with the handful of best Circuit textbooks on the market today.Laely, I'm beginning to become more encouraged that with Amazon.com publishing students real-life feedback to the whole Web world. Hopefully, these authors will get the clue that something is wrong with their old-fashion writing style/methods and perhaps begin making real substantial modifications to their textbooks. If they do, then life would become easier for everyone in American classrooms.After authors have done making real changes to their books, then the final thing for authors to do is begin using the SAME math symbols so as to reduce the confusion. Some auhtors use different math symbols for the SAME device or concept. For example, if you get 100 authors writing an Algebra textbook, you will probably get 100 different symbology math set used by each author to convey the same algebra concepts. This is a nightmare. Most technical books do this sort of thing. This math symbology set situation isn't seen in the Literature or Philosophy textbooks or other Liberal Arts textbooks, it's a problem unique to technical authors.Technical authors must believe that using new symbols set is wonderful; however, students think it's an added hardship while they are trying to learn new technical concepts!So, come'on guys, let's think about the students and stop playing games. Communicate clearly for once and for all and be done with it. I just got done having a big discussion on these same sort of educational issues as above with an RPI alumni located in Troy, New York. What she told me would dismay or even horrify all technical students. She thinks it's wonderful stuff to write a textbook at \"one level\" and then ask students difficult questions for homework, for a project or for a college exam!I told this adjunct instructor that she somehow got hypnotized or even brainwashed by the old European-style of teaching students. I think it's high time she, too, got modernized and began helping students by ordering well-written and well- formated textbooks.Finally, some teachers calling their students stupid if they can't do the \"end of chapter\" problems of each textbook simply will not further modern educational reforms in any meaningful way.I hope author, James W. Stilsson, is amenable and open-minded to effect textbook reforms and not add more unnecessary educational burdens to students.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "Background: I've used this text for 5 years now, beginning with the 7th Ed, and now probably moving to the 9th. Before my teaching career I was a circuit designer for HP for about 12 years. I teach at a community college, and we use this text because most of the universities to which my students transfer use it. I've never had a student complain about this text, either personally or in a student evaluation.The good:I think the text is well-written, the explanations are clear and concise and at exactly the level that sophomore EE/ECE students need. The examples are well-chosen and sufficient in number to effectively present the fundamental concepts.What could be improved:1. More general problems are needed that require the student to solve the circuits using generic components (R, L, C) instead of giving numeric values for all components. The purely numeric approach leads to a \"sea of numbers\" plug-and-chug solution that has little meaning to the student and even less value in terms of understanding circuit behaviour. Students need to get used to working their solutions into the standard algebraic forms that provide insight into the behaviour of the circut. (I have designed my labs to make up for this.)2. The order of the topics assumes the student is taking their first course in differential equations concurrently, and so postpones the introduction of the LaPlace transform until near the end of the semester. Too much time is spent solving 1st and 2nd order linear, constant coefficient ODEs by methods engineers will never use again. This makes LaPlace methods look like an afterthought, when in fact it is how EEs actually work in the field.All in all, I view this book as a very positive text, and will probably continue to use it. It does a good job of demonstrating the thinking required of an engineer, and helping the persistent student to develope it.---------------------------To the struggling student using this text:More than likely your problems are with prerequite concepts. All circuits texts appropriate for this level assume you are good at algebra, trig, and calculus (no, I mean GOOD at them), and that you have completed 2 semesters of calculus-based physics. This is requred to learn the topic of circuit analysis at the level expected of you.Also, you should not expect to learn the concepts in any engineering, physics, or upper level math class by simply mimicing examples. You must learn to generalize the fundamental concepts so that you can apply them in ways you haven't seen in an example. If you can't learn that, then you may want to consider a change in either attitude or major. Engineers are not \"paid the big bucks\" to solve problems that have already been solved before. You must develope the ability to think generally, and this entails a lot of time and effort. Unless you are a genius, there is some frustration inherent in the process. It is at these times that \"the book sucks, the professor sucks, so I guess I'll go write a review on Amazon.\"Your time would be more profitably spent making proper use of the examples in the book (and in your class notes). Before beginning your homework problems try working through all the examples without referring to the solution. Don't just read them, work them out on paper. Keep working the examples until you understand them, only then are you ready to begin the homework set. You might think you don't have time for this, but it will reduce your \"head-banging time\" later on. The examples are not intended to be templates into which you can substitute similar values from each assigned problem in order to produce an answer. That would be the opposite of helpful.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "I used this book for my introductory circuits class three years ago and, upon reflection, it was one of the worst books I was forced to buy in 4 years of engineering. The examples are too trivial to help with the problems, which are too hard because the explanations are horrible. My teacher wasn't much better at explaining the material, making this the worst class I have ever taken. But after taking more advanced circuits classes, I find them to be less appalling.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "reasons I wouldn't go with this book:1. poor pedagogy, i.e., easy examples, but unsolvable problems2. not necessarily very up-to-date, lacking in innovation, extremely old-fashioned3. there are surely better written books on Circuits out theree.g.: Alexander&Sadiku; (which is an easy but great read), or Dorf (which is pretty decent)",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "This textbook is missing so many of the key ingredients that make a good textbook -- I am still amazed at the large amount of instructors that continue to use this inefficient and lacking text as their main instruction manual.Using this in a circuits course probably will not help you and will make the subject more confusing most likely. If you have a poor instructor as well, consider yourself lost for the class. Get another text. The examples in here are so simple but then the homework problems make these conceptual leaps that prove quite challenging for students -- even engineering students.This book needs quite a bit of improvement before I would use it as my main circuits text.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "The difference between the example problems given and the homework problems is analogous to citing 2nd grade mathmatics in college level differential equations. Are the authors that pompous to believe that they are doing any good with this strategy? I am struggling through the book right now. It is almost painful to read, and riddled with mistakes that almost frustrate you from attempting anything else. I am a 4.0 student and accustomed to difficult material, but I usually have something to fall back on if something is unclear. Every time I ask for help from my instructor, I take out the book point out a few passages and problems, and ask him to translate it. The first words out of his mouth are always, &quot;Just put that thing up, it will only confuse you.&quot;To any faculty member concidering this book for their class I have this advice: Don't, that is unless the echoes of tortured students rests well on your pillow.My advice for any student looking for the cheapest place to buy the book: Don't, save yourself. Its too late for me. Drop the class and run as far away as you can.I hope this was of some assistance",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "learn hungarian",
        "description": "Do you want to learn Hungarian the fast, fun and easy way? And do you want to master daily conversations and speak like a native? Then this is the book for you. Learn Hungarian: Must-Know Hungarian Slang Words & Phrases by HungarianPod101 is designed for Beginner-level learners. You learn the top 100 must-know slang words and phrases that are used in everyday speech. All were hand-picked by our team of Hungarian teachers and experts. Here's how the lessons work: -> Every Lesson is Based on a Theme -> You Learn Slang Words or Phrases Related to That Theme -> Check the Translation & Explanation on How to Use Each One And by the end, you will have mastered 100+ Hungarian Slang Words & phrases!",
        "authors": "['Innovative Language Learning', 'HungarianPod101.com']",
        "infoLink": "https://play.google.com/store/books/details?id=p7jRDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Beginning with the simplest sentences possible in Hungarian, this book builds over 30 chapters to literary excerpts from M&oacute;r, Miksz&aacute;th, and M&oacute;ricz; in between is systematic coverage of Hungarian grammar and wordbuilding. The readings are interesting (including biographies and historical articles); there are abundant exercises with a complete answer key, and many grammar tables which make the book a useful reference even for those who have a mastery of Hungarian. The glossary is complete, both Hungarian-English and English-Hungarian. The only caveat is that even the most recent edition contains some dated terminology belonging to the Communist era. &Ouml;t csillagos bizony!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book provides a traditional introduction to Hungarian for students in a classroom setting. Each chapter begins with extensive texts, then Hungarian-English word lists ordered chronologically according to when each new word was introduced in the texts. Following this comes the grammar points for the lesson, usually 3-5 points, and finally exercises, mostly of the translation or mechanical substitution type.In general, the grammatical explanations are relatively clear. However, they don't do as good a job at helping students master overall sentence structure as Erdo\"s et al's Hungarian in Words and Pictures. The reading texts for each chapter tend to be quite long, and the vocabulary lists are impossibly long for beginning students. The choice of vocabulary is not well thought out- -instead of introducing words essential for daily life and conversation in the very beginning chapters, we find words such as stork, peasant, and sour.I purchased this book with the intention of using it for self-study and tried to use it earnestly. I tried and tried, made little progress, and gave up twice. After taking formal classroom lessons where we used the Erdo\"s textbook with much success, I found that I could come back to this book for supplemental readings or grammatical explanations. But I wouldn't recommend it as a main text either for self-study or classroom purposes.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "teaching and learning elementary social studies",
        "description": "With more and more attention to interdisciplinary teaching and learning and a new emphasis on constructivism, teachers need better strategies for involving their students in social studies content. New material on the National Council of Social Studies has also been incorporated. KEY TOPICS: The sixth edition of this popular book maintains its focus on the child and provides teachers with teaching strategies that emphasize inquiry, concepts, and moral development. The entire book has been updated with new information and insight. Teachers of social studies or daycare providers who want to incorporate social studies education in their daily routine.",
        "authors": "['Arthur K. Ellis']",
        "infoLink": "http://books.google.com/books?id=p1skAQAAMAAJ&dq=Teaching+and+Learning+Elementary+Social+Studies&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In the most conversational tone, Dr. Ellis invites new teachers to create classrooms that fully engage real children in real situations that result in real understanding. Infused in each chapter is a reminder of the ultimate purpose of education, which is the development of inquisitive and thoughtful people who can investigate life and solve problems cooperatively. He does a remarkable job of avoiding the trap of sacrificing depth for breadth. A good portion of this book is actually a literacy text encouraging every teacher to develop thoughtful and effective reading, writing, and communication by establishing a culture of inquiry and response and shared culture. His introductory chapters are actually short outstanding synopses of educational theory.Ellis communicates a deep respect for the subject matter concepts and how children can grasp them as opposed to the random collection of facts. Considering other texts of its type, this looks like Joy of Cooking compared to Betty Crocker.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I enter graduate school in the fall in elementary education. I have no education credits in my bachelors, so I picked up this book to give me some background about social studies. My first graduate class will be &quot;How to teach social studies.&quot; This is an excellent overview and is written in a very easy-to-understand fashion. The &quot;sidebars&quot; of information and the &quot;checkups&quot; on assessing your personal values system are very helpful. I am grateful Dr. Ellis took the time to write it and I am sure it will help prepare me for the graduate class on the subject.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I studied Dr. Ellis' book every night during my first few semesters of my college teaching program. His sections on Jerome Bruner highly influenced my own philosophy of education.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "sociology a down to earth approach",
        "description": "A Down-to-Earth Approach James Henslin shares the excitement of sociology, with his acclaimed \"down-to-earth\" approach and personal writing style that highlight the sociology of everyday life and its relevance to students' lives. With wit, personal reflection, and illuminating examples, he shares with readers his passion for sociology. In addition to this trademark down-to-earth approach, other distinctive features include: comparative perspectives, the globalization of capitalism, and visual presentations of sociology. Teaching & Learning Experience Personalize Learning -- The new MySocLab delivers proven results in helping students succeed, provides engaging experiences that personalize learning, and comes from a trusted partner with educational expertise and a deep commitment to helping students and instructors achieve their goals. Improve Critical Thinking - Learning Objectives & Questions on each page reinforce key concepts and build critical thinking skills. Engage Students - Personal narrative from the perspective of an international field researcher invites students on a sociological journey. Explore Theory - Offers a balanced approach; relevant theories are discussed in each chapter. Understand Diversity - Global, national, and personal material combine to present a complete view of the world. Support Instructors - Written activities and assessment in MySocLab engage students and help them succeed. Note: MySocLab does not come automatically packaged with this text. To purchase MySocLab, please visit: www.mysoclab.com or you can purchase a ValuePack of the text + MySocLab (at no additional cost): ValuePack ISBN-10: 0205252281 / ValuePack ISBN-13: 9780205252282",
        "authors": "['James M. Henslin']",
        "infoLink": "http://books.google.com/books?id=zMd_ZwEACAAJ&dq=Sociology:+A+Down+to+Earth+Approach&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I was assigned this textbook for my high school Sociology class that I took as an elective in the last semester of my Senior year. I had gone into the class expecting an intriguing, thought-provoking subject that led students to ask the big questions about why people and society are the way they are, and that the textbook would help guide me along the way. Unfortunately, I was pretty dissapointed, to say the least.Let me add a disclaimer saying that I am a firm Independent; I'm a college-bound kid who dislikes political and ideological squabbles and believes both the Right and the Left have equal merit in their own ways. That being said, the reason for my rating is that, as my title suggests, the author's opinions and biases shine through quite blatantly, much of it appealing sharply to the Left wing of the ideological spectrum. While most textbooks simply give you facts, with maybe some interpretations to help you form your own conclusion, Henslin has the negative tendency to editorialize, using word choice and selected statistics (not to mention his own \"personal observations\") to paint certain aspects of society in a good or bad light as he sees fit. This is a very inappropriate, and I might go so far as to call it dangerous, thing to do when writing educational material to be taught to youngsters.As an example, take a look at his chapter on economic theories, in which capitalism and socialism are both given analysis. The problem is, when socialism is mentioned, Henslin spends a significant majority of the time in which it's mentioned explaining the goals and the lofty ideals of it, and little time mentioning its inherent drawbacks (which all ideologies have).The whole rest of the chapter, however, is dedicated to capitalism; more specifically, how capitalism basically is so totally exploitive, greedy, and concentrates power in the hands of the tiny few, with the phrases \"exploitation,\" \"greed\", \"believe greed is good,\" and \"elite\" dropped here and there. Add further excerpts implying that American democracy is little more than a puppet show controled by rich business interests who sway the government, and it's not hard to see how someone impressionable would learn to unflinchingly hate the whole theory in general. This is NOT what a textbook is supposed to do.Henslin then spends much of the time talking about class, race, gender, etc...as was to be expected. The problem here is that, again, he editorializes, rallying around whatever the oppressed group of the time may be and almost relentlessly guiltmongering against whites, men, and people in classes that can live comfortably.The chapter about gender is a particular treasure trove for this sort of thing; near the beginning, Henslin writes a particular gem referring to gender in the workplace, which goes something along the lines of \"Imagine that two women are talking when they are supposed to be working. When the male boss walks by, he would most likely tell them to get back to work. But what if it were two men talking? For instance, if they were talking about sports, would he be more likely to join in on their conversation instead of telling them to get back to work? This is just one of the inequalities that women face in the workplace.\" (not a verbatim quote, but that's the basic gist of it).And it just gets better from there, some of it based off of true injustices that happened in the past and do still happen today, but a lot of it off of generalizations and editorials that I, as a young male, found quite offensive. When my class finished with that chapter, I felt as if Henslin was doing everything short of saying that I was going to roast in Hades for having an XY chromosome. Extremely one-sided, with the guilt and blame poured on heavily.I could go on about how the book gives readers guilt trips about how people in our own supposedly-prosperous nation and around the world are living in poverty while we comfortable-living ingrates sit on our butts taking part in an exploitive culture driven by self-interest, but I've already gone on long enough.Suffice to say this much; this book's biases are dead obvious to anyone who is truly objective-minded enough to notice it. It's kind of a shame, because I truly believe that Henslin had good intentions when he wrote this, and I do believe that, like many liberal-minded people, he has a genuine concern about the injustices of the world and a desire to see it change for the better. But that doesn't excuse the fact that opinionated language, finger-pointing, guiltmongering, and editorializing play a major role in getting this textbook's points across.A schoolbook is supposed to present cold hard facts to students with an absolute minimum of bias, so as to respect them enough to form their own beliefs and interpretations; not indoctrine them with the exlusive ideas of a narrow ideological philosophy. I'm almost disheartened that this book has gotten so many rave reviews singing its praises about it's objectivity and enlightening messages. Then again, as much as I hate to perpetuate stereotypes, this is mostly read by college students, and, on the political spectrum college kids are often...well, you get the idea.I wouldn't really recommend this textbook to any educator who wishes to maintain a proper balance of opinion in the classroom. If you do end up reading it, though, be prepared to take your grain of salt to class with you.",
                "review/helpfulness": "38/54",
                "num_reviews": 54
            },
            {
                "review/text": "We used this book in one of my college Sociology classes and it is by far, the Best textbook I've encountered thus far in my college career! You will be amazed at how much this book will teach you about People, Society and Life! It is easy to follow - Kudos to the author for his outstanding writing style! When you sit down to read a chapter in this book, you're done before you know it because it's all just too interesting to put down! I even found myself reading through the chapters that were not assigned! Even if you're not a sociology student, you will LOVE this book! I want my whole family to read it!",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "infants children and adolescents with interactive companion website 4th edition",
        "description": "Taught well, Health and Physical Education can provide purposeful, stimulating and challenging learning experiences. It can help children to develop sophisticated understanding, skill and capabilities through their bodies and to see greater meaning in not only what they are learning but also their wider lives; and it can enrich all other aspects of the curriculum. This practical new text will help pre- and in-service teachers to develop and implement quality health and physical education experiences in primary schools. It introduces the general principles of teaching and learning in Health and Physical Education and explains why this learning area is an important part of the Australian Curriculum. Chapters then discuss considerations and practical implications for teaching both health and physical education using a strengths-based approach. Packed with evidence-based and research-informed content, this valuable text also includes numerous examples and activities that help you bridge the gap from theory to real-world practice. Above all, it will give educators the confidence to teach primary health and physical education so that every child benefits.",
        "authors": "['Dean Dudley', 'Amanda Telford', 'Claire Stonehouse', 'Louisa Peralta', 'Matthew Winslade']",
        "infoLink": "http://books.google.nl/books?id=33dLDwAAQBAJ&dq=Infants,+Children,+and+Adolescents+(with+Interactive+Companion+Website)+(4th+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As a Forensic Psychologist I use this text and recommend it to clients to better understand and appreciate the psycho-developmental needs of their children. Of particular interest to most of those parents are the diverse tables which clarify the expected and unique behaviors of children by age group. This provides those parents with a guide book to assist them in child rearing through age 18. That reference material not only facilitates the parent's understanding of the needs of the child, but also better prepares more effective parenting skills and preparation for developmental issues which are significant in custody and visitation (or access) legal questions. Parents have reported developing a feeling of confidence since they are using scientific data in making parenting decisiions. Legal authorities -- judges and attorneys -- have felt more confident in their recommendations, opinions, and decisions which are based upon evidence. -- Swen Helge, Ph.D.",
                "review/helpfulness": "24/25",
                "num_reviews": 25
            },
            {
                "review/text": "Hi,I love how the book divides the development of human beings by age, physical development, socio-emotional development, and cognitive development. I also love how the important words are highlighted.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "The book is well written and very interesting. I don't mind reading it unlike other textbooks. Was a little nervous about it not getting it in the mail before my class started, but it did get shipped and delivered right on time.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I bought this book for a class; psychology is something I dread and have a difficult time reading psych textbooks. This book, however, is easy to read. I like the stories at beginning of each chapter; it sets up what the author will be discussing throughout the chapter nicely.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "no child left behind no parent left in the dark",
        "description": "Are Students Being Prepared for the Technological Age? Can AP and IB Programs Raise U.S. High-School Achievement? Do Teachers Assign Too Much Homework? These are just a few of the provocative questions posed in Issues in K-12 Education. This engaging reader allows students to see an issue from all sides and to think critically about topics that matter to them. Classroom discussion will never be dull again! About CQ Researcher Readers In the tradition of nonpartisanship and current analysis that is the hallmark of CQ Press, CQ Researcher readers investigate important and controversial policy issues. Offer your students the balanced reporting, complete overviews, and engaging writing that CQ Researcher has consistently provided for more than 80 years. Each article gives substantial background and analysis of a particular issue as well as useful pedagogical features to inspire critical thinking and to help students grasp and review key material: A pro/con box that examines two competing sides of a single question A detailed chronology of key dates and events An annotated bibliography that includes Web resources An outlook section that addresses possible regulation and initiatives from Capitol Hill and the White House over the next 5 to 10 years Photos, charts, graphs, and maps",
        "authors": "['CQ Researcher,']",
        "infoLink": "https://play.google.com/store/books/details?id=aQchAQAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "As a parent I found this book insightfull, and recommend this parent aid to all who wish to gain the most out the education system.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book was presented to me as an aid to sucessful parent teacher conferences, and I must say it live up to its recomendation. But even as valuable is the way its ideas and sugestions opened up new lines of communication between me and my children. Communicating with a child about their education is difficult and pointless if you have no goal or standard by which to compare your progress. This publication give you that point of reference and explains how to establish better open communication.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "student development in college theory research and practice",
        "description": "THE ESSENTIAL STUDENT DEVELOPMENT REFERENCE, UPDATED WITH CUTTING-EDGE THEORY AND PRACTICE Student Development in College is the go-to resource for student affairs, and is considered a key reference for those most committed to conscious and intentional student affairs practice. This third edition includes new chapters on social class, disability, and emerging identity theories, with expanded coverage of faith and gender identity. A new framework provides guidance for facilitating dialogues about theory, teaching theory, and the importance of educators as consumers of theory. Discussion questions conclude each chapter and vignettes are woven throughout to provide practical context for theory. Learning activities in the appendix promote comprehension and application of theory. Get updated on the latest in student development theory and application Consider both the psychosocial and cognitive aspects of identity Learn strategies for difficult dialogues, and the importance of reflection Adopt an integrated, holistic approach to complex student development issues Student Development in College is the ideal resource for today's multifaceted student affairs role. \"With five new or expanded chapters and critical updates throughout the text, this third edition expertly presents the complex, multifaceted, and continually evolving nature of the theories that inform scholars and professionals in their research and practice with college students. These authors, consummately aware of the needs of emerging and continuing student affairs professionals, have crafted a text that will be both eminently practical and intellectually engaging for graduate students, professionals, and faculty alike.\" -Dafina-Lazarus Stewart, associate professor, higher education and student affairs, Bowling Green State University \"This third edition of Student Development in College beautifully presents the theoretical terrain of student development by honoring the foundational theories upon which the field was developed and foregrounding newer theories with brand new content and fresh perspectives. The result is a text that is comprehensive, sophisticated, and accessible-and one that is attuned to the contemporary realities of the complexities of student development.\" -Susan R. Jones, professor, higher education and student affairs, The Ohio State University",
        "authors": "['Lori D. Patton', 'Kristen A. Renn', 'Florence M. Guido', 'Stephen John Quaye']",
        "infoLink": "http://books.google.com/books?id=E-lRCgAAQBAJ&dq=Student+Development+in+College+Theory,+Research,+and+Practice&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I needed this text for my graduate work, and it will remain on my shelf for many years. It does a great job of covering all of the major developmental theories and a few others!",
                "review/helpfulness": "14/22",
                "num_reviews": 22
            },
            {
                "review/text": "I applaud the authors' attempt to provide an accessible, easy to understand synthesis of student development theory, but they have sacrificed depth for breadth and left the reader with a text that, like over-processed food, provides some nutrition but ultimately fails to satisfy. The book is below the level of most master's degree students and practitioners in student affairs, though it might provide a useful introduction to theory for undergraduates or a useful reference book for administrators who don't have time to read original sources.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "I also used this book in my graduate program. This book provides an excellent overview student development theory. It is an excellent introductory text. I had the added benefit of using this text in a course taught by one of the authors.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book was one of my textbooks in a class on college student development. The other one was the supposed \"classic\" by Chickering. If you have to choose between the two books, go for this one. It's much more clearly written and has much better research supporting the authors' claims. Moreover, each chapter is organized concisely with a vignette at the beginning, a section on theory, and then another on measurement and research based on the theory.I personally didn't like that book, but that's just because my interests are elsewhere. (It's more of a problem with me than with the book.) That doesn't change the fact, though, that this book is theoretically and scientifically strong while staying easily digestible for the average graduate student.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This was a required text for a graduate class and I thought it was good enough to keep. It is a great introductory book that provides a good look at many of the different theories. It is true that it is not really deep, but that is what makes it a good introductory book. It goes just deep enough to help you understand.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This was a required book for my graduate class. It provides an excellent overview on a variety of student development theories. I will be hanging onto this text to use a resource.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a required text for my graduate class, but it does a good job of introducing student development theory",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "painless vocabulary barrons painless",
        "description": "This fun-filled guide to learning vocabulary replaces the fear with fun! Students will learn the meanings of new words by seeing them used in amusing contexts, find examples of vocabulary for modern technology, learn Greek and Latin word roots, track progress with challenging games, and more. Titles in Barron's extensive Painless Series cover a wide range of subjects taught at middle school and high school levels. Perfect for supporting state standards, these books are written for students who find the subjects somewhat confusing, or just need a little extra help. The authors' main goal is to clear up confusion and pique interest by emphasizing the intriguing and often exciting ways in which students can put each subject to practical use. Most of these books take a lighthearted, humorous approach to their subjects, and offer fun exercises including puzzles, games, and challenging \"Brain Tickler\" problems to solve. Bonus Online Component: includes additional games to challenge students, including Beat the Clock, a line match game, and a word scramble. Includes a new appendix.",
        "authors": "['Michael Greenberg']",
        "infoLink": "http://books.google.com/books?id=aSc2jwEACAAJ&dq=Painless+Vocabulary+(Barron%27s+Painless)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I needed a vocabulary book for my high-school level children that would teach as well as keep them entertained, and this book definitely delivered. It gives words that are not common in the teenager's everyday conversations, yet explains and defines in ways they can easily understand. The words are broken down into sets of five, so the reader is not overwhelmed by learning new words. It's great for the parent who homeschools their children or anyone wanting to broaden their vocabulary. Trust me -- it's absolutely PAINLESS!",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "- I'm not in school now but this book is very helpful to me. It shows me how to use 300 plus English words more accurately. What makes it unique is it makes learning these words fun and easy to remember.- There are 20 chapters. Each begins with an essay that includes in context all 15 new words. After that, the terms will be introduced to the reader 5 at a time. The introduction will provide the user with italicized synonyms for many of the words. There's also an exercise called Brain Tickler. Here the learner has to select the right synonyms for the 5 terms he has just learned. The answers to them appear at the end of each chapter. A sidebar entitled Major Mistake Territory will alert him to certain pitfalls of the new words. At the end of each chapter, there's a section called On Your Own. Here there reader has to write an essay using all the terms he has learned.- The explanation of the new words is easy to understand and remember because of good example. For example, the next sentence explains \"ardent\". I feel ardent about thin-crust pizza. But you probably feel \"passionate\" about something else, right? (By the way, ardent comes from the Latin \"ardere,\" which means \"to burn.\" If you feel ardent or passionate about something, you practically burn for it.\"- The book's organization is clear, easy to the eyes due to illustrations and red print. There are illustrations on every 2 or 3 pages. Red print are used for new words and some headings.- I have been spending 15 minutes a day to learn and practice using 5 new words. This books keeps me coming back for more. It's not like the ones I used while in school. Those made me scared of learning vocabularies because of their dry presentation.- In short, every high school student and school library should have one copy. It's one of the BEST that MY MONEY CAN GET",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I teach ESL (English as a Second Language) to adults and use this book with my students. It provides the (pre-college or ESL)reader with an advanced level of words that high school students need for SAT or college, and adults need for business and college writing. The vocabulary is presented in essay form first to see its usage in real life, then the words are presented in detail in groups of five so it's not overwhelming. My students liked this book so much they actually recommended it to their friends.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I purchased this book because a friend of mine lent me her book for a while. I found it a great tool in and out of the classroom and recommend it to any middle school or high school student.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "My high school and college students use this every day, trying to increase their use and knowledge of over 300 words that you might find in modern essays and writings. The book is fun in that there are brain ticklers, sidebars, helpful hints; plus the essays are interesting and apropos. There is one page dedicated to words from Greek and Roman myths, plus besides the 300 words covered, the author produces another 270 words that are words that everyone basically assumes that you know...but not necessarily because some are difficult and not often used in everyday conversations. This little book is a resource for any student, and also a good study guide just before the SAT and ASVAB examinations.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book has provided me with much needed vocabulary to use in my classes.I like the predesigned quizzes and tests.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I purchasd the above book, the Painless Vocabulary book, The Grammar Devotional Book, and Grammar Girl's Quick and Dirty Tips for Better Writing. These books are not only funny, but I have been able to write better papers for my college classes. Love them!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This is one of those books that helps you to avoid reinventing the wheel.You could delve into a good classic novel and find all kinds of vocabulary words for student to learn... or you could save yourself the time and buy this.Michael Greenberg has taken choice words from choice reading material and compiles it into twenty chapters with fifteen words per chapter.First, the student reads an essay that includes the fifteen words. Greenberg discusses how to find the meaning of a word by its context, he covers the ways in which a word can often be misused or misapplied.There are then exercises for the student to work through (answers are in the back) on meaning and using the words in context.Stick with this book and you will gain three hundred new words, use them and they will be yours for life.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "what the best college teachers do",
        "description": "Winner of the Virginia and Warren Stone Prize awarded annually by Harvard University Press for an outstanding book on education and society What makes a great teacher great? Who are the professors students remember long after graduation? This book, the conclusion of a fifteen-year study of nearly one hundred college teachers in a wide variety of fields and universities, offers valuable answers for all educators. The short answer is-it's not what teachers do, it's what they understand. Lesson plans and lecture notes matter less than the special way teachers comprehend the subject and value human learning. Whether historians or physicists, in El Paso or St. Paul, the best teachers know their subjects inside and out-but they also know how to engage and challenge students and to provoke impassioned responses. Most of all, they believe two things fervently: that teaching matters and that students can learn.",
        "authors": "['Ken Bain']",
        "infoLink": "http://books.google.nl/books?id=noPWDwAAQBAJ&dq=What+the+Best+College+Teachers+Do&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As a former college professor who does some online teaching from time to time, I was fascinated by Bain's book. Bain identified a number of teachers who made a meaningful impact on student lives. He and his team followed up to ask, \"What makes them so great?\"And he has answers. Anyone who's been teaching awhile will not be surprised. Ask questions. Get students involved. Don't just tell -- teach students how to learn. And so on.But, as other reviewers have noted. Bain's \"best\" professors appear to dwell among the Olympians of higher education. We don't have a complete list of the \"best,\" but we get references to Harvard and Vanderbilt.In the real world, the vast majority of today's students enter large state institutions. They begin with large lecture classes. It *is* possible to personalize those classes to some extent but you certainly don't have room for discussion.Additionally, most students juggle work, family and social pressures along with school. Many spend more time watching television than studying. A friend who won a major teaching award told me, \"I don't make students do the reading. I know they won't.\"Bain also ignores institutional pressures on faculty. When I taught online for a well-respected university, I was told, \"You're expected to give at least a couple of C's and F's in every class.\"OK, I said, then we should be fair: we need to let them know there's a forced curve, as Harvard does. No dice. And in this particular class, most students were majors who worked full-time. Their assignments were linked to their jobs. All were motivated to work hard. As Bain says, high grades can also reflect high learning -- but just try and prove it.I've also been in environments where students were expected to get A's -- a B-plus was the closest to a failing grade. Students who genuinely wanted to learn were frustrated by whiny, do-nothing classmates who could hardly provide a stimulating classroom conducive to learning.Most important Bain dismisses evaluations. but in reality, nearly every professor will live or die by student opinion. And great teaching does not always lead to top evaluations. I once heard a talk about an experimental astronomy class, where students engaged in participatory exercises throughout the term. They performed better on tests and appeared to learn far more thoroughly. Yet evaluations were lower than those of conventional classes. Unless the professor has some protection (and even tenured profs can get penalized for weak reports), you can bet he'll go back to the tried and true methods next time.I had a similar experience myself, while teaching in a large state university. I would overhear students say, \"I've never participated as much as I have in your class.\" One group of students even organized a little party for our class -- and they were commuters. We had a great community and students learned a lot. But the course evaluations had no place to describe these experiences. Students told me openly, \"I base my evaluations on the grade I get.\"If you're going to read this book, I'd also recommend Rebekah Nathan's Freshman Year. Nathan, the professor who went undercover to learn how students really live, identifies some reasons students continue to be demotivated. For example, Bain notes that an attitude of \"Everyone is right\" comes at a stage of learning development. But Nathan shows us orientation exercises where everyone shares an opinion -- no judgment, no synthesis, no analysis.A professor can get lots of good ideas from reading Bain's book. Putting those ideas into practice -- well, that's another book.What would be far more useful would be a serious study on learning. In Chapter 2, Bain cites studies showing that students don't change beliefs readily. I think he's right. A college sophomore who was studying psychology told me, \"I don't like what we're learning. Depression isn't real. I was brought up to think about those who are worse off than I am -- and then I won't be depressed anymore.\"Will this student's belief be changed by the \"best\" teaching? Does she belong in a university at all? These questions should haunt us as we study the real issues of higher education.",
                "review/helpfulness": "186/207",
                "num_reviews": 207
            },
            {
                "review/text": "Ken Bain has written precisely the sort of book I wish someone had shared with me during my graduate school days. Like many of my colleagues, I was left to my own devices inside the college classroom. My solution was to emulate those professors I respected as a student. Other than a few days of preparation in 1990, I never had any sort of systematic training about good classroom performance or how students learn.Ken Bain, Director for the Center of Teaching Excellence at New York University, has provided a valuable resource for all of us in a similar situation. Perhaps the most striking feature of Bain's book is that it is not a how-to approach. If you are looking for a host of specific techniques to apply, then other teaching resources will better suit your needs. Instead, Bain's book looks at the best college teaching from a more bird's eye view to identify the essential characteristics of our best teachers. Some of the key themes include:- How the best teachers connect content knowledge with real-world practice so that students exhibit learning (change).- How the best teachers exhibit some combination of 13 goals or targets for preparing to teach.- What the best teachers expect of their students.- How the best teachers draw from seven unifying principles to deliver a course.- The types of invitations that the best teachers extend to their students when attempting to draw them into a learning community.- How we can learn more about our teaching, and improve, by pursuing a robost course evaluation system.These are the key themes. Each is developed with a variety of examples that the author has gathered over the years while working at Vandebilt, Northwestern, and now NYU. The book unquestionably draws from a variety of important research articles, but in no way is this a dry read about pedagogical research. Ken Bain tells a good story in each chapter and uses both his experiential base and the literature to bolster his conclusions. What emerges is a practical, wise, and intelligent discussion of the best college teaching that is written in plain English. I read the book in two evenings quite easily. It is unusual to find such a well-written book containing a wealth of knowledge you can take back to the job.This book is suitable for anyone teaching at the college level. Regardless of whether you are a graduate student preparing to teach for the first time, an experienced educator at the undergraduate level, or a top-flight researcher delivering graduate seminars, I have no doubt there is something we can all learn from each chapter.Maybe as my final point I will share that I found the book so useful I purchased a copy for all new faculty arriving at my university this year. I can only hope my colleagues find the book as engaging as I do.",
                "review/helpfulness": "195/203",
                "num_reviews": 203
            },
            {
                "review/text": "This is a review of What the Best College Teachers Do by Ken Bain.Bain, the director of the Center for Teaching Excellence at NYU, did a study of outstanding college-level teachers. For example, the students of calculus teacher Dan Saari of UC Irvine obtain a disproportionately large percentage of the A's on their school's college-wide calculus final. The medical students of cell biologist Jeanette Norden of Vanderbilt do far better than the national average on their board exams. In other cases, the success is in principle less clearly demonstrable. (How would one \"prove\" that a philosophy or English professor taught exceptionally well?) But Bain and his colleagues were particularly interested in professors whose students said changed the way they think, and sparked a lifelong interest in the subject.Bain wanted to find out what such outstanding teachers had in common. The basic lesson he arrived at is easy to formulate (although challenging to implement). Mediocre and bad teachers typically subscribe to a \"transmission model\" of education, in which teaching is a matter of transmitting knowledge from the professor's brain to the students' brains. Outstanding teachers, in contrast, assume a \"learning model\" of education. The teacher who subscribes to a learning model is constantly searching to find what her students need to learn, constantly adjusts to meet those needs, and always responds to students' failures with efforts to teach better.This might seem like an obvious point, but it is not. Speaking as someone who has been teaching for about twenty years, it is very easy to get into the mindset that says, \"I put the knowledge out there. It's the students' job to pick it up.\" I have not myself fallen into that mindset (not most of the time, anyway), but many teachers do.A further conclusion of the book is that the attitude of the professor is far more important than any other aspect of teaching. Pedagogic styles vary greatly among outstanding professors. Some lecture, others do not. (Interestingly, none lectures exclusively.) Some have outgoing personalities, some are shy. Some argue with their students, others are more collegial. (Significantly, no outstanding teachers humiliate their students or make them afraid to argue. It follows from this study that someone like \"Professor Kingsfield\" of the Paper Chase is the very worst kind of teacher.) Outstanding teachers have a style that goes beyond simple technique, but is not (for that reason) unlearnable. In particular, outstanding teachers are extremely knowledgeable about their subject, but at the same time they manifest humility (that they do not know everything themselves, and that their teaching can always improve), respect (for their students as humans, whom they never humiliate), faith (that their students can learn if given the right opportunity), and trust (that their students will make an honest effort, given the right environment).The difficulties of achieving real learning are vividly illustrated by a study conducted by two physicists who tested students at the beginning of introductory physics courses on their understanding of the motion of physical bodies. Unsurprisingly, the students \"entered the course with an elementary, intuitive theory about the physical world, what the physicists called 'a cross between Aristotelian and 14th-century impetus ideas'\" (22). After the students had completed the course, they tested them again. Surprisingly, most students had exactly the same ideas about motion that they had entered the course with, including a number of students who got A's. Wait, it gets worse! The physicists conducted interviews with some of the students, and performed experiments in front of them demonstrating that their views were mistaken. \"What they heard astonished them: many of the students still refused to give up their mistaken ideas about motion\" (23). Part of what this illustrates is that professors need to develop an awareness of what mental models the students bring to the course and of how these models may interfere with learning. Then the teachers have to devise methods for encouraging the students to dismantle these models for themselves, and get better ones.Of course, some students face additional challenges. In one experiment, two otherwise comparable groups of African-American students were given a portion of the Graduate Record Examination. One group was told that it tested their ability, while the other group was told that it was a \"laboratory task that was used to study how certain problems are generally solved\" (70). The former students performed significantly less well. Apparently, stereotyping produces performance anxiety that can adversely affect students. Even more stunning (I thought), in another study, three groups of Asian American women were given the same math test. Prior to the test, one group was given a questionnaire that included a question identifying their race, one group had a questionnaire that included a question identifying their gender, and the third group's questionnaire mentioned neither. The group with the racial question performed the best (responding apparently to the reverse stereotype that Asians are good at math), and the group with the gender question performed the worst (responding to the stereotype that women are worse at math).What kind of learning are we trying to promote in our students? One group of psychologists has identified four levels of understanding that students can go through. (1) \"Received knowers\" are students who expect there to be definitive answers that they can regurgitate on tests or in papers, ideally word-for-word. Received knowers may eventually become aware of the fact that, in many areas, there are no simple right or wrong answers. They then typically graduate to being (2) \"subjective knowers.\" Subjective knowers regard everything as simply a matter of opinion. If they get a low grade, their initial reaction is that it represents nothing but the professor's subjective (and annoyingly punitive) personal opinion. (3) \"Procedural knowers\" are the students who have learned to \"play the game.\" They have learned that there are standards internal to intellectual disciplines, and they have learned to meet those standards. But for procedural knowers, it's still just a game. Like the students in the physics class who get an A but continue to think the same way about motion, procedural knowers never really internalize the standards. (4) Those who do internalize the standards of the discipline have achieved \"commitment.\" But commitment is not just mindless acceptance of the standards. The student who is committed thinks deeply and critically about those standards. Within the level of commitment, the study distinguished between \"separate knowers,\" who like to remain skeptical and critical, and \"connected knowers,\" who try to understand other views sympathetically and synthetically. (Interestingly, more women than men seem to prefer being connected knowers. This implies that different techniques may be needed to guide male and female students to the fourth level, and that they may manifest having achieved this level in different ways.)How can we achieve these goals? Empirical testing shows that extrinsic rewards for behavior that are seen as manipulative tend to decrease long-term interest in an activity, whereas intrinsic rewards (finding something interesting in itself) and positive verbal reinforcement stimulate and maintain interest. This applies to grading as a motivator as well. Students motivated by grades learn less effectively and have less long-term interest in the subject than those motivated either by the intrinsic interest of the topic or praise.Students generally seem to respond best to being given high standards, along with assurances that they can meet them. Indeed, it turns out that students who are \"at risk\" in science courses actually do significantly better if they are invited into honors courses, rather than being put into remedial classes. This counterintuitive approach apparently works because it signals to students just that combination of high standards and confidence in the student's abilities.In the chapter on how outstanding teacher conduct classes, Bain identifies the five elements of what he calls a \"natural critical learning environment\": (1) start with some question that students will find intriguing, (2) help the students to see why this question is important, (3) encourage the students to think actively and critically, rather than just listening and remembering, (4) guide the students to working out an answer, and (5) leave the student with further questions. Some of us have done this intuitively, but even so it is helpful to have the steps laid out explicitly. Although he stresses that good teaching is more than techniques, Bain also provides some helpful tips in this chapter. One should call on shy students the way one \"might do so around the dinner table rather than the way they might cross-exam them in a courtroom\" (131). When lecturing, use techniques like dramatic pauses, and change one's pace every ten or so minutes. Invite students rather than commanding them: for example, begin the semester asking for a show of hands of who is willing to show up, be on time and intellectually participate in every class.Scattered throughout the book are a number of other interesting facts. Like many teachers, I have been very skeptical of whether student evaluations are anything other than a popularity contest. (This is not sour grapes: I have more than once received \"perfect\" ratings from an entire class of students.) However, it turns out that there is empirical evidence that two evaluation questions do correlate with independent measures of student learning: \"Did the professor help you learn?\" and \"Did the professor stimulate your interest in the subject?\" (13) On the other hand, a 1993 study showed that student evaluations of teachers based on video clips of a few seconds in length were substantially the same as those they would give after a semester. Bain charitably concludes that students have simply gotten very good at accurately determining who will or will not turn out to be a good teacher. Well, perhaps. But if my snap judgments of students at the beginning of the semester generally correlated with the final grades I assigned them, would you assume I was an insightful teacher, or a superficial and dogmatic one?Although it occasionally succumbs to vague rhetoric, this book is overall a very useful guide to some of what we know about good college pedagogy.",
                "review/helpfulness": "154/176",
                "num_reviews": 176
            },
            {
                "review/text": "If I had to summarize this book in two words, they would be \"only connect\" (E.M. Forster). Bain advises college teachers to orient their teaching to the students in the room. We--and I say we because I am one--need to know what presuppositions students bring to the class; we need to keep students' attention by connecting the new to the familiar; we need to turn students into learners and thinkers, instead of cramming facts into their heads. Etc. etc.All this sound like common sense, but in fact it goes against the standard orientation of college teachers. The usual thing is to think first about the subject of the course, about which the teacher is presumably an expert. The subject, and the teacher's deep knowledge of it, steers lectures and exams. The problem is that this can put students to sleep and leave them with an acquaintance with the subject that fades soon after the final exam.I'm glad I bought this book, I recommend it, and I think it's going to make my own teaching better. All that being said, here are some more negative reactions. What if everything Bain says is actually true? What would that say about the American college student? His advice makes the student sound like a fragile creature who's got to be seduced into an interest in anything outside of himself.For example, Bain says professors shouldn't use the word \"requirements\" on the syllabus. They should promise students specific valuable things, but never demand. In fact, he seems to say that the exact way grades are computed shouldn't be stated. What would happen if there were clear and straightforward demands? Would students crumble?The huge emphasis Bain puts on connecting course material to a student's personal concerns makes me wonder what would happen if a professor got up and talked about... the civil war ...computers ...botany. Can't teachers count on the inherent interest of anything?The advice in the book frequently ignores real world teaching problems. Bain is very positive about take home exams, thinking it's silly to pass up their advantages because of worries about cheating. But these worries are serious.He's very positive about the idea that every exam should be cumulative, with only the last one counting. A student should be able to miss an exam with impunity. They probably had some good reason. Hmm. In the best of all possible worlds, yes. My students wouldn't come to the exams that didn't count.Be tolerant of late work, he says; there was probably a good reason. That's not my experience. Students need firm deadlines or some of them will never do any work.It puzzles me that Bain's best teachers do things in their classrooms that really would be unworkable in mine. There's nothing in the book that addresses this disconnect.",
                "review/helpfulness": "125/132",
                "num_reviews": 132
            },
            {
                "review/text": "This book had some good insight. The emphasis on creating a community conducive to learning, while not novel, is important. I think, or at least hope, that the author was well-intended. However, most of the ideas were jumbled, inconsistent and presented in a highly condescending manner. The most annoying approach was creating a straw man, followed by destroying the straw man, and concluding with some statement to the tune of \"now thay we've shown ....\" Of course all Bain has shown is that some idea that most thoughtful instructors never considered a possibility is actually ... not a possibility. Often he would, later in the text, argue that he's proven something about good or bad instructors. As an example, in Chapter 4, \"Recall that we found [in chapter 2] many less successful instructors who think of memory as a storage unit and intelligence as the capacity to use the information in that tank.\" Realistically, I suspect that most instructors are a lilttle bit more thoughtful about what constitutes intelligence. I found his shallow dualistic view of education demeaning to the intelligence of instructors and students.",
                "review/helpfulness": "39/57",
                "num_reviews": 57
            },
            {
                "review/text": "Although I like a great deal in this book, underneath it strikes me as basically a re-statement of the innovative teaching manifestos of the 1960s, right down to quoting Jerry Farber (whose book I still have).Bain's is a book about student control, authenticity, caring, deep learning, involvement, meaning, collaboration, positive expectations, trust, take-home exams, students teaching one another, higher order thinking skills...That's truly grand and wonderful, except to those of us who have lived and worked for a few decades with the limitations of some of those concepts. They magical concepts, but magic turns out not to be enough.To make these attractive ideas sound even better, Bain sets up, throughout the book, a straw man who teaches \"a frozen body of dogma,\" in terms like: traditional, conventional, habitual, memorizing, recognize the correct answer, details, orthodox (p. 114), surface learning, bulemic learning (!), counting off for late work, frozen artifacts, using \"old yellowed notes in the teacher's mind\" (158).It is truly weird to see such a substantial book setting up a false opposite and ridiculing him/her/us. By contrast, Bain never considers what happens when well-meaning teachers take his concepts to excess. (And they/we certainly do.)The book does not address certain concepts vital to teaching and learning, and I miss them -- such as willpower, setting priorities, managing time, developing and improving skills, practice and repetition, hard work, relentless effort, self-sacrifice, commitment to excellence, competition based on achievement, professionalism, responsibility, internalizing values, gaining content knowledge, self-discipline, ethics, and self-directed learning skills in the sense of Knowles.Part of the reason seems to be acceptance by Bain and the teachers studied of the concept of Higher Order Thinking Skills, developed from Bloom's cognitive taxonomy. First of all, the HOTS idea devalues its foundation -- content knowledge through comprehension and recall. Second, the cognitive taxonomy rests invisibly upon the taxonomy of affective skills, less known, more important. That's about commitment, participation, and the disciplined internalization of values -- more or less \"professionalism.\"Four-fifths of the teachers studied for this book came from rather elite institutions (\"research institutions\"), and even though Bain claims these concepts work well anywhere, I'm not convinced.With eager, accessible, willing students (think Northwestern, NYU, Harvard), an amazing variety of teaching approaches work well. But many of these concepts do not work easily or well with college students who are underprepared, undermotivated, and do not know how to succeed in the classroom. And may not want to.Would an ordinary teacher put down this book and know how to teach better? That's not a sure thing. Will good teachers improve from it? I'd like to hear from you.For a very different book, a \"what do I cook for dinner\" kind of book on teaching, take a look at Barbara Gross Davis' \"Tools for Teaching,\" the kind of practical, how-to book that you need alongside Bain's invigorating, inspiring, glorious ideas. Davis gives you a list of things to do the first day of class, and it goes on from there.I don't want to discourage you from reading Bain's book. It's worth reading.",
                "review/helpfulness": "53/57",
                "num_reviews": 57
            },
            {
                "review/text": "This book was completely unhelpful. It is filled with inspiring anecdotes of \"what the best college teachers do\" that illustrate some inspiring and earth-shaking revelations such as \"treat your students like human beings\" and \"don't lecture for 2 hours at a time.\" All of his advice is abstract with few practical applications, and the rest is common-sense knowledge. Do not buy this book.",
                "review/helpfulness": "32/50",
                "num_reviews": 50
            },
            {
                "review/text": "What the Best College Teachers Do (Bain, 2004) is a good read for teachers interested in deepening their understanding of the art and craft of their profession. The book provides an in-depth definition, through field study research, of the scholarship of teaching and learning. Bain's research goes to the heart of what legislators and college accreditors call \"assessment\" by documenting what \"teachers do that truly makes a difference in students' lives, and what any teacher can do to improve\" (blurb by Richard Light on back cover). The best performers in any field are the ones most likely looking for ways to improve, but Bain's method does include examples of poor techniques for comparison.Bain offers numerous examples of highly effective classroom assessment techniques. One idea he offers is the \"small group analysis.\"\"Someone goes into the class while the instructor leaves the room. The consultant divides the students into small groups or pairs and asks each team to spend six or seven minutes discussing three questions: In what ways has the instruction/instructor helped you learn in this course? Can you suggest some changes in the instruction/course that would better help you to learn? If the course/instruction has helped you learn, what is the nature of that learning? Each team receives the questions on paper and is encouraged to take notes of their discussions. After six or seven minutes, the consultant brings the groups back together and gets feedback from some of them while inviting others to share any major additions to or disagreements with what they heard from their colleagues. The whole process takes less than twenty minutes and allows the consultant both to clarify (to ask those questions that we have all wanted to pursue when we read students' comments) and to verify (to find out if there are any divisions in the ranks)\" (p. 159).The book describes the results of scholarly and also intuitive modes of inquiry concerned with more effective teaching and learning for the teacher that wants to help create better learning. This book provides some research-based ideas about how college teachers can use experimentation, research, analysis, and reflection to deepen student learning.The book is short (178 pages minus appendix etc.) with a conversational style that makes it a quick read in spite of the wealth of information.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "As a professor myself, I highly recommend this book to anyone who teaches college students. While it doesn't offer easy answers or a fool-proof formula, it poses many helpful questions that have made me reconsider my strategies in front of the classroom- and so far to good effect. The fact that this book is based on real-life research makes it more than just a how-to book. It also makes me think about how completely unprepared my education made me to stand in front of students every day...",
                "review/helpfulness": "27/30",
                "num_reviews": 30
            },
            {
                "review/text": "This book presents itself as a serious source of ideas for becoming an effective college progessor. However, it is extremely vague to say the least. The author indicates that it is the product of 15 years of research but no serious data are provided; it's all anecdotal. For a better coverage of effective college teaching read \"Saints and Scamps\" by Steven Cahn, which is shorter and far deeper in its coverage.",
                "review/helpfulness": "18/27",
                "num_reviews": 27
            }
        ]
    },
    {
        "Title": "molecular and cellular biophysics",
        "description": "Biophysics represents perhaps one of the best examples of interdisciplinary research areas, where concepts and methods from disciplines such as physics, biology, b- chemistry, colloid chemistry, and physiology are integrated. It is by no means a new ?eld of study and has actually been around, initially as quantitative physiology and partly as colloid science, for over a hundred years. For a long time, biophysics has been taught and practiced as a research discipline mostly in medical schools and life sciences departments, and excellent biophysics textbooks have been published that are targeted at a biologically literate audience. With a few exceptions, it is only relatively recently that biophysics has started to be recognized as a physical science and integrated into physics departments' curr- ula, sometimes under the new name of biological physics. In this period of cryst- lization and possible rede?nition of biophysics, there still exists some uncertainty as to what biophysics might actually represent. A particular tendency among phy- cists is to associate biophysics research with the development of powerful new te- niques that should eventually be used not by physicists to study physical processes in living matter, but by biologists in their biological investigations. There is value in that judgment, and excellent books have been published that introduce the int- ested reader to the use of physical principles for the development of new methods of investigation in life sciences.",
        "authors": "['Valerica Raicu', 'Aurel Popescu']",
        "infoLink": "https://play.google.com/store/books/details?id=qr3KWd2hJWcC&source=gbs_api",
        "review": [
            {
                "review/text": "This book is aimed at providing the advanced undergraduate student or beginning graduate student a solid foundation in the basic concepts of molecular and cellular biophysics. I would suggest that this course be given prerequisites in physical chemistry and a very solid math background.To cover the math background the author has added six appendicies to the book covering: expansions and series, matrix algebra, Fourier analysis, gaussian integrals, hyperbolic functions, polar and spherical coordinates. All of this is covered in only 16 pages. You would have to be a lot better than I was to learn Fourier analysis in only four pages. In undergraduate school I had full semester course in Fourier analysis, and it was by no means the first math class that I took. Perhaps I was just slower than today's students. But in my mind learning all this math from the appendicies while studing the rest of the material in this book would be asking a lot of an undergraduate student.More important than the math, the author says, is having some knowledge of physical chemistry to include thermodynamics, kinetics, and statistical mechanics. And finally he assumes that the student has had some exposure to biochemistry.Having gotten that out of the way, the central theme of the book is of course what it says in the title. This is an excellent and very inclusive text. The author ranges far and wide to bring up as many different aspects of biophysics as possible. It is very current in its coverage of material on subjects not found in other texts.",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "This is a well written text book for students and researchers teaching basic concepts of biophysics. Especially biological membranes are dealed with comprehensively. The figures are easy to understand and the price is rather low. Actually it is the best book of this kind I encountered. It can be highly recommended.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I am doing research in biophysics and wanted a book that I could use as a review in my spare time. The book refreshed me on topics outside my immediate research area. This is useful because sometimes ideas for my research come from other sources. I enjoyed reviewing topics I already saw in my graduate classes years ago. I also learned a few new things as this book went into greater detail. I liked how it has problems at the end of each chapter. However I could not check my progress as there is no answer key. I think it would make a good senior level undergraduate text or a first year graduate text.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "linguistics for nonlinguists a primer with exercises 4th edition",
        "description": "Linguistics for Non-Linguists is a highly readable introductory text that presents students with the basic elements of linguistics in a clear and concise style that any beginner will understand. This newly revised edition continues to expand on the success of earlier editions, taking a subject that is generally considered quite complicated and making it accessible to virtually anyone who requires a basic understanding of linguistics. The authors illustrate major concepts in an easy-to-read style, giving students and specialists in language-related fields an introduction to the essential principles and methods of linguistic theory. Non-linguistics majors will also find this book user-friendly, with a wealth of exercises and references interspersed throughout to help reinforce concepts. Specialists in language-related fields, including Speech-Language Pathology, Experimental Phonetics, Communication, Education, Psychology, and English as a Second Language, will find this text a must-have reference for all courses.",
        "authors": "['Frank Parker', 'Kathryn Riley']",
        "infoLink": "http://books.google.com/books?id=eyNuPQAACAAJ&dq=Linguistics+for+Non-Linguists:+A+Primer+with+Exercises+(4th+Edition)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am currently taking a graduate applied linguistics course and this is our text. It is a frustrating book. Half of each chapter is devoted to practice \"exercises\" {the book is subtitled \"a primer with exercises\"}, however the authors provide answers for less than 10% of these exercises which are supposed to help us understand each new concept.Further, I am extremely disappointed that with each concept introduced, on average only one example of the concept is given. Imagine trying to understand a concept of word relations, when only one example is provided, when the study of linguistics implies that there are so many different ways to interpret words and sentences. With only one example, what if my interpretation of the example is \"wrong\" and I go on to apply this wrong interpretation to further understandings and problems.In our course we have to answer the chapter questions, and since there has been so little modeling in the book itself, and this is an online class, I cannot adequately judge if I am learning the concepts throughout the chapter exercises that I then have to demonstrate for a grade at the end of the chapter.The lack of answers to the instructional content of this text makes me feel like I paid for one text book, and the authors supplied only half a text book. Please don't choose this text for your course unless the authors include complete answers for the practice exercises in future editions.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "My guess is that the other reviewer was disappointed with his or her instructor NOT this textbook. As someone who has been studying and teaching linguistics to novices for twenty years, I recommend this book over any other introductory text. The authors include far more and far better exercises than any of the other introductory texts. The fact that the book includes answers for only a portion of the exercises is, I'm sure, a consequence of marketing this book as a college textbook. The assumption is that a knowledgable instructor will ask students to work the exercises and bring answers to class for discussion. Although a highly motivated and bright student might learn linguistics using this book without an instructor, I have met few such students in the past twenty years.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a very clear introduction to the various fields of linguistics (The chapters are: Pragmatics, Semantics, Syntax, Morphology, Phonology, Language Variation, First Language Acquisition, Second Language Acquisition, Written Language, Language Processing, The Neurology of Language). The book explains the basic concepts and gives some examples. There is a \"Supplementary Readings\" section at the end of each chapter with recommendations for specialized books on these topics. The exercises the first reviewer is complaining about are mostly very basic and it seems to me that they are designed to give additional examples rather than to challenge the reader. The text focuses on English, which is OK for an introductory book. One thing that may make you think twice before buying this book is its price, which naturally reflects the ideology of the textbook publishing companies - \"Students are _required_ to buy textbooks, so we might as well charge them a fortune.\"",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    }
]