[
    {
        "Title": "jazz harp",
        "description": "The purpose of this book is to prepare harmonica players to play jazz music by teaching both the technical skills and the harmonica knowledge needed for fluid, effortless improvisation. Topics include vibrato, articulation, twelve-bar blues, the blues scale, pentatonic scales, intervals, melody development, and chord progressions. This book uses diatonic 10-hole harmonicas in all keys, and the 12 or 16-hole C Chromatic harmonica. The audio files are in split-track format and include both simple and complex versions of the tunes in the book. Includes access to online audio files.",
        "authors": "['Phil Duncan']",
        "infoLink": "https://play.google.com/store/books/details?id=lwHMDwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Richard Hunter is an excellent harmonica player and his contributions to the harmonica community are well received. Jazz Harp was published in 1980, it comes complete 6 cuts which are used with practical examples through out the book - BUT, the cuts are on Vinal, so be warned. This book is written for BOTH chromatic &amp; diatonic harmonica.Richard starts with a light practical primer on Jazz theory, enough to get going, followed by chapters using a number of popular pieces of music over a wide range of 11 Jazz artists &amp; their style - ordered by difficulty, and discusses how to approach them on the harmonica. Each music example is transcribed in music notation and harmonica tab. Each example finishes with additional discographys, so Richard has done his homework. Its a good practical approach to getting up and running with Jazz styles on the harmonica. The last part of the book covers a number of points regarding playing techniques on the harmonica including a quick description of how to &quot;overbend&quot; the diatonic harmonica to get some missing notes. There is an Exercises chapter which can also be used in part as a reference to chords &amp; scales. Its music notation with tab for diatonic harmonica. And at the ending is an interview of Toots Theilsman, arguably the best Chromatic Harp Jazz player to date. Its a nice touch.I'd recommend purchasing additional good music theory book &amp;jazz theory book for seriously indepth music theory studies. Richard also recommends finding teachers, and asks that you find the tracks given in each chapter so that you can follow his explicit references.This is a good book, well written and presented. If you are starting to learn Jazz on the harmonica: this is the one.",
                "review/helpfulness": "18/21",
                "num_reviews": 21
            },
            {
                "review/text": "Bought this book expecting a purely jazz oriented instructional book and was very disappointed. Not only that, I was unhappy with the way the book was written, a lot of fluff and not a lot of meat. Audio quality of the cd was extremely poor, and the tracks were not even numbered. What a pain when you want to hear an example over and over without having to go through the boring narratives!",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is a terrible, but not worthless item. You get an 18 minute CD which is a single track copied from the original 1978 cassette. (yes, this is a very old book and recording). Besides having to be stuck with a single track, the original instruction couldn't even manage to fill both sides of a cassette, which could easily have been 30 minutes per side, with some cassettes holding an hour on each side--so space was never an issue. There are no recordings, or even discussion for most of the transcriptions in the book, which is disappointing because there are some good transcriptions, like Miles Davis's \"So What\". I would have liked to hear that played by a harmonica ace, and there was plenty of space on that 60 minute cassette to do so. Since Oak Publishing had already obtained the copyright to print the sheet music, I don't think playing all the pieces would have been a problem, and if so, then pick other pieces to demonstrate!! About halfway through the recording, about 3-1/2 minutes are wasted playing a recording of a folk ballad in which Mike Turk plays harmonica for a few seconds. Certainly a better, more succinct example could have been used instead of one that takes up about 20% of the meager 18 minutes that we're allowed. Near the end, Hunter plays \"Golden Mel\", for which he has no transcription--I think it's his piece. How hard could it have been to include the sheet music? Besides that, it is a DeFord Bailey styled tune that has no place in a book on jazz harp. It seems to have been a convenient way to eat up recording time. On Hunter's own composition \"Winter Sun at Nobska\" the sheet music doesn't exactly follow what he plays and he doesn't even play the entire written music. His excuse for this is that he says that pieces may be shortened and altered according to the player's discretion. What sort of cop-out is this? This is an instruction book and the author should play the piece exactly as written, unless improvisation is being demonstrated. His tips on overblowing are good, though he doesn't discuss tuning a harp to make this easier. In fact, overblowing may be impossible unless your harp has been tightened up with gapping and embossing. I could go on, but I think you get the point--the book is terribly flawed in many ways.There are a few good written and oral tips on jazz playing if you are already an advanced player, but the book has little value for beginning and intermediate players. I can except the fact that recording is on one track--that can be easily dealt with, but the original 1978 effort was poorly done, and that can only be fixed by a complete rewrite. Not a big seller, so the financial incentive to rewrite a 30+ year old book isn't there--don't hold your breath.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "improvising blues piano",
        "description": "A guide to blues improvisation introduces different blues styles, with all exercises and examples professionally demonstrated on the accompanying CD.",
        "authors": "['Martan Mann']",
        "infoLink": "http://books.google.com/books?id=hfPfQgAACAAJ&dq=Improvising+Blues+Piano&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "If you can play a little piano say grade 2 or 3 and like the blues you will get a lot out of this book. Beautifully presented with pictures of the masters and different types of blues, takes a slow and easy progression from very basic triads to simple but really terrific sounding stuff to the more complex stuff. He encourges you to experiment and improvise and truely teaches ways to do this. Happily for my nieghbours I have headphones on my piano! CD has all the music on it with some different versions in triplet feel etc. Richards is a performer and teaches at a London music college. Certainly helped me. If you want to learn the blues this is really nice book. The book has its own web site so hunt around. Allows you to download a very nice blues and the sheet music to it.",
                "review/helpfulness": "54/54",
                "num_reviews": 54
            },
            {
                "review/text": "This is a great book! I'm a beginning/intermediate piano player, I went through the first two Alfred's All-in-One Adult piano books and really enjoyed them (and recommend them!). But I found myself at a fork in the road: I was happy to continue memorizing \"pieces\", and practicing \"technique\", but I found myself wanting to know more about improvising. I play drums in a blues band, and I've had some music theory for keyboard percussion, so I'm not a total musical-novice. I tried out some other books (Mark Harrison's \"Blues Piano: Hal Leonard Keyboard Style Series\", but it's still a little over my head, perhaps in a year or so it'll be good for me. Also \"David Bennett Cohen Teaches Blues Piano: A Hands-On Course in Traditional Blues Piano\", but it really didn't light my fire either, and if I recall correctly, didn't have finger markings which I still find helpful.) This book pulls it all together for me: some blues music theory, some blues history, clearly-marked \"assignments\", a CD included, (a spiral binding that lays flat on the stand!) ... I'm hooked!",
                "review/helpfulness": "39/39",
                "num_reviews": 39
            },
            {
                "review/text": "I've bought several other blues piano books over the years, and in my opinion this one outclasses them all. The pieces sound great, and the pacing of the material is fantastic. The book does a great job of slowly introducing the idea of improvisation, by encouraging mixing and matching ideas from the different pieces. It also goes into ideas like horizontal and vertical improvisation without making it too intimidating, and introduces some blues &quot;cliche&quot; endings and turnarounds. It covers many different styles from barrelhouse to stride to jazz blues.The included CD lets you know how this stuff is really supposed to sound, and it's got a full &quot;Recommended Listening&quot; in an appendix if you want to explore further. All around one of the best instructional musical texts I've seen.",
                "review/helpfulness": "37/38",
                "num_reviews": 38
            },
            {
                "review/text": "I play in a 60s/70s cover band that also plays a few blues standards and am always looking for new ideas. This book feels like a bunch of 3x5 cards grouped into chapters, a confusing arrangement. Richards doesn't address many basic blues piano techniques and never discusses soloing. The last part of the book wanders into jazz territory. I would recommend the book to jazz students, but not blues or rock fans.The \"lessons\" are a piece of sheet music (played on the CD) followed by bulleted points on parts of the piece and assignments for working on the piece. Frequently, the key and corresponding scale are reviewed before the piece, which seemed silly to me.I got so frustrated by the irrational organzation, I finally just put on the CD and listened for any phrase or riff that caught my ear, and referred to the book to find out how it is played. The CD is only piano, no band.",
                "review/helpfulness": "18/29",
                "num_reviews": 29
            },
            {
                "review/text": "I'm not a good pianist but I'm playing blues bass since more than 20 years.I did purchased a lot of books, but this one is really the best. When my teacher saw it, he immediately ask where he could purchased it.A lot of songs, exercises and explanationThe book is not only about improvising, it's also about all kind of left-hand pattern and I know what I'm talking about. The example on the CD are also greatIf at first looks it seems expensive you will see that it is worth every penny",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is, by far, the best blues piano book out there. Mark Harrison's book is also good, but more as a quick guide for those who already have some chops and some understanding of theory.Richards' book is a full course in Blues theory and practice and as such, you have to work through it. I've been at it for 14 months now and have just finished the second chapter. The material is perfectly paced for a pianist of my level (about Gr. 2-3, RCM, 30+ years ago). The pieces are fun to play and jam packed with important ideas and blues cliches. I'm really starting to see the beginnings of true hand independence that works , not only when I play memorized pieces, but that I can invoke when trying improvisations!If you want to play professional-level blues piano in a month, then this is not the book for you. If, however, you live in the real world and are prepared to work at it, this book will do more than show a few riffs or tricks. It will give you a deep and firm foundation in popular piano improvisation in general, and blues in particular. I estimate I'll be another couple of years with this book and I can't wait to get back to it!This book is a work of genius. Thank you, Tim Tichards!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "There realy are not many great methods for the blues out there, but Tim Richards is thorough and goes into the required detail to show you how each blues style works.The examples are very playable, suiting more or less an intermediate level pianist. Richards is one of the few take-away instruction teachers to be concerned about fingerings, and takes the trouble to suggest good ones. His playing instructions work very well and add a dimension that you don't often get in these method books - he has a great insight into the chords, and the notes and the way they fit the music. The breakdown of theory is very well explained, if sometimes overdone. But he never floods you with scales without showing you how to apply them - that in itself is a good thing!Richards' choice of music is impeccable, and calssic blues standards of af all styles are presented from boogie, to funk, slow blues, and some jazzy numbers. And he shows you music in a number of keys so you aren't stuck to one or two and get a work out in the other keys. I found the music very playable, and well sounding, although I didn't always find the improvising instructions that intuitive.The historical background he gives is accurate and informative and the pictures of blues and jazz legends really make this book interesting.My criticism of the book is that it should have stretched up to the more advanced techniques of the blues - where the top players are, like Oscar Peterson, for example. That is its dissapointment - a teacher as good as this who dedicated the time to work a out a progressive and different course in blues shouldn't have stopped at the middle level. He surely should have stretched us, his interested audience up to the highest level.But this should not stop you from using this very useful and inspiring book - I Thank you sincerely Tim.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "I'm an aspiring jazz pianist in Canada (I'm 32). I'm another one of the victims of the classical music education system that was taught to read the page and nothing else. I always thought that people who were good at jazz and could play by ear were born that way.When I was in high school I wanted to play jazz piano. Someone recommended the Mark Levine book to me. I tried going through it but gave up because I couldn't even figure out what a II-V was from his explanation. I figured jazz was this impenetrable language. I was sick of classical lessons by that time and gave up the piano.Fast forward ten years when I decided I didn't want all those hours of practicing (before school, even) to go to waste. I headed to a local music store and literally went through every piano book before I found IBP. It's pretty much been a revelation, from discussions of notations to chord types to ideas. I still suck at improvising, but before this book I wouldn't have even tried.I've got Tim's other two books on my shelf, patiently waiting for me to get to them. Seriously, his books are phenomenal. If I had found IBP back in high school instead of Mark Levine's brick wall of jazz accessibility, I might be ten years ahead. I can't recommend it highly enough. Rumour has it he's working on a fourth book about Latin piano, too.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "Now and then you run across a method book that makes you a better player and is great fun to work through. \"Improvising Blues Piano\" is one such book. It starts out very simply and steadily progresses to a pretty sophisticated level. The accompanying disk is well recorded and the author's playing, particularly his timing, is quite musical. On most examples, if you can make your playing sound like Tim Richards, you'll really swing.Starting in \"C\" and moving on to other familiar blues keys, the author mixes theory and practice in a logical progression of \"bite sized\" lessons that are very complete and doesn't assume anything about the student. At first, the experienced player may find the pace a bit slow but each section builds smoothly upon the foundation of the preceding material and I think it's worth while to patiently work on your weaknesses. When you can make those first simple exercises sound really musical, you've learned something valuable.The volume is accessible to beginners (this will take you a long way) while remaining useful for the more advanced because there is so much good content. I particularly like that he weaves in biographical information of known blues players along with examples of their style. The history of blues unfolds along with the student's expanding ability to play.If you are interested in the blues, I can't think of a better learning tool.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "I grew up learning to sightread classical music; a pretty standard set of piano lessons. Unfortunately, those lessons were weak on the theory of how music is created. This is a great book for someone like me who now wants to understand how to start in a key and figure out how to combine chords and rhythm and the right notes to make music. The book has things like how the blues scale works, how to pound out a barrelhouse left hand while improvising with the right hand, turnarounds and endings, and much more. There are some tunes in here to learn (Blueberry Hill, Pine Top's Boogie Woogie, etc.), but that's not really the point--Tim Richards goes on to explain how those tunes were created, and how to change and improvise over them. The CD lets you hear the exercises, and is quite helpful. I looked around a lot, and bought some definitely inferior books, before finding this one. The author also wrote Exploring Jazz Piano, volumes 1 and 2, which basically build on this book. I recommend buying all three. No book is going to substitute for practice, but if you practice what's in these books you're going to love what you learn to do.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "its recorder time",
        "description": "A basic method of building finger technique, intonation and tonguing through the performance of folk, classical and familiar songs.",
        "authors": "[\"Alfred D'Auberge\", 'Morton Manus']",
        "infoLink": "http://books.google.com/books?id=rZvMnQEACAAJ&dq=It%27s+Recorder+Time&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Wnat a gentle introduction to music? Here's a cheap, effective approach: a ten dollar plastic recorder and this four dollar book.d'Auberge and Manus don't bother with Every Good Boy Does Fine. They start with B (and quarter notes), then add the other notes of a soprano recorder, one at a time. As the book goes on, new notes are added less frequently, and there are more songs to practice. The result: the material starts easy to master, and stays easy to master as new material is added. The reader/performer learns through practice, not memorization.This book is only an introduction, but it's a great one.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            },
            {
                "review/text": "Great book for absolute beginners who don't read music. Gently guides student one step at a time through learning fingering and learning to read music. Better than any other book I've seen or used; even parents who don't play themselves could use this book to teach their children. Might be *too* easy for those who already play another instrument or know how to read music, though.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "I have been trying to learn to site read music for 30 years. This book has made it so that I can look at the note and I know exactly where my fingers belong. I wish there was a volume two to go past the basic nine notes, but it feels really wonderful to have those notes finally make sense without having to review each time I pick up the book. Really wonderful book for adults or children.",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "I own an Alto recorder, which is the principle instrument of the recorder family. This book is for students of the Soprano recorder. This creates two serious problems. First of all, the fingering for the Alto very different than for the Soprano and, secondly, the sheet music is intended for an instument with a much higher range. The product description fails to note this rather essential feature. The book is useless to me.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "I took recorder lessons in first and second grade, and wanted to offer my kids a similar intro to music experience. (I later studied flute, cornet, piano, and guitar--and feel early exposure was key.) We can't afford violin or piano right now, and the schools don't offer much...so I decided to seek out recorders. I found these greatYamaha YRS24B Soprano Recorders on Amazon and chose this book to go with them. It's a great book for young kids (8, 6, and 4)--as well as adults. I usually go through the lesson myself alone...and then work with the kids on it. They'll be playing recognizable songs by the third lesson! I'm so happy with my purchase. For under 25 bucks, I have a beginning music program.I also highly recommendBeethoven's Wig: Sing Along SymphoniesandStory of the Orchestra : Listen While You Learn About the Instruments, the Music and the Composers Who Wrote the Music!for an early introduction to music for kids.Classical Baby 3-Pack - Music, Art & Danceis wonderful too!",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "I am using this to refresh my own memory from third grade and to teach my eight-year-old daughter to play. I am very impressed with the way they focus on one note at a time yet manage to pull some songs together so you feel like you're really playing something special vs. just doing a bunch of exercises. By the second lesson, we were playing together.We have both been amused by the song lyrics, and we are sharing lots of laughs in the process, which is of course priceless.They also include some parts for a teacher (if one is available), so you can play duets. This has also been a fun feature for us since I already know how to play.One thing beginners should pay attention to is the timing. As they teach you notes (A,B, C, etc.), they also teach you the aspect of timing (which of course is essential). Be sure to learn that part of the lesson also.It cost less than $30 for two recorders and this book. For that price, we are making memories and building the foundation for a lifetime of musical enjoyment. You simply can't go wrong with this book.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I'm a 48 year old grade school music drop out. I could not read music at all. This book has given me the general idea. The left hand has been fairly easy to pick up. The right has been more difficult. Of all the recorder books I purchased, this one is best for a person of my limited experience.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is a great book for the person who does not know much about music, other than they like and have always wanted to learn music. The instructions are very clear and presented in more than one way so that one is sure of what they are to do to produce the correct tone.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "WIth some trepidation, I tried this with my daughter (nearly 5 yrs) who is very enthusiastic about learning recorder. It was a great success due to its clear, simple layout. It is very satisfying for beginners to feel they rapidly progress to playing 'real' tunes -- including tunes with two player parts and words! Also, basic musical concepts -- clef, rests, measures are systematically introduced. I learned recorder in the 70s and remember my book as being fairly simple, but it did not offer the swift learner satisfaction that this one does, while building a solid foundation. Because of the range of tunes introduced, I think it would also work perfectly well for adults without being boring, and can help anyone who previously hasn't learned notation. Strongly recommended all round.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is old--but it still works. I first came across it when I was in fourth grade and we learned how to play recorders. That was in 1985. I stumbled across the book almost 30 years later and found that it holds up well. The 32 book page is excellent for children and those of us who have little background in reading music. Alfred d'Auberge and Morton Manus do an excellent job in providing simple instructions and varied if somewhat dated pieces to practice on. Keep in mind this book is for true beginners--and some more experienced readers will find it very simple. Despite this, \"It's Recorder Time\" remains an excellent introduction after all this time. Recommended.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "mel bays deluxe accordion method",
        "description": "Three levels of instruction teach music reading and playing from the very beginning. Students learn to play by feel and touch rather than depending on sight. Helpful illustrations and photographs are also provided. This method mentions the 120-bass accordion, but focuses on the 12-bass instrument.--From publisher description.",
        "authors": "['Frank Zucco']",
        "infoLink": "http://books.google.nl/books?id=lCLtwAEACAAJ&dq=Mel+Bay%27s+Deluxe+Accordion+Method&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The legendary Chet Atkins, who recorded something like 175 albums, even wrote an &quot;Ode to Mel Bay.&quot; This series of instructional books has been around for decades. When I was a whippersnapper, I thought they were terribly boring. I've played piano for about 40 years, and recently developed a curiosity about the accordion. I bought this to learn some basics by myself , without benefit of a teacher.If you were alone on a desert island with nothing but an accordion and this book, (how's that for a scary thought?) you could become a decent accordion player. This book is appropriate for the total neophyte to music, as well as someone with musical experience who is new to the instrument. It is organized in a logical and stepwise manner, with successive exercises and tunes building on previous ones.I highly recommend this book",
                "review/helpfulness": "54/57",
                "num_reviews": 57
            },
            {
                "review/text": "Ever since I fell in love with They Might Be Giants, I have always wanted to learn to play the accordion... I bought an accordion almost a year ago but never got serious about it, but finally decided to just LEARN. On a whim, I bought this book from Amazon and now - TWO DAYS after receiving it - I am able to play waltzes and other complex music I'd never thought I'd be able to play!!It is important to understand just HOW little experience I've had with musical instruments. Before buying this book, I had no concept of any kind of musical theory, I couldn't read sheet music, I'd never made any kind of music in my life. Now I feel like there's no limit to what I can do!",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "I don't claim to be an expert on accordion instruction books but this book seems to be a good starter book. I has a lot of photos and drawings to explain things and has a system of easy to harder concepts to get you going. I suppose nothing beats either an instructor taught or at least video taught program but I think this will help you get going on the accordion. From here you will know if you are a player or just playing around. I like the spiral binding. All music books should be in that format so you can play from it with out it deciding to close up on you. I only give it 4 stars rather than five because I had some questions that were not answered but I suppose that would be true of any book. I think you would be safe to buy this book. Hope that helps. Ric.",
                "review/helpfulness": "21/22",
                "num_reviews": 22
            },
            {
                "review/text": "The book is intended for use with an instructor- it mentions this in the text. The instruction is a bit &quot;terse&quot; but clear. It starts with layout of a 12 bass, 20 key instrument but also contains a bit at the end on the more complex keyboards.",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            }
        ]
    },
    {
        "Title": "fiddlers fakebook the",
        "description": "From the author's preface: \"This book was conceived four years ago, almost to the day, at a time when I was teaching fiddle and mandolin in New York City. It was my idea then, with my students in mind, to compile a book of the most often played, most important and most interesting fiddle tunes from the various Celtic and North American traditions. The tunes were chosen by cataloging a large number of recordings by tune title. A tally was taken to find out which had been recorded most often. This established a foundation of material that could not be left out. To this list I added the names of other pieces which had not been recorded as frequently, but which I knew were played regularly and with respect. I admit to sprinkling the collection with a few lesser known tunes which happen to be personal favorites, but I am sure they will hold their own when placed next to the old war horses of the fiddler's repertoire. . . . Although I started out with my students in mind this book has turned out to be the book that I've always wanted and I hope that it will serve the advanced player as well as the beginner.\"",
        "authors": "['David Brody']",
        "infoLink": "https://play.google.com/store/books/details?id=YqHIDgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Printed in 1983, the Fakebook remains the undisputed champion of music references for fiddlers, and it's aided a fair number of other non-fiddlers as well.Inside its broad covers you'll find nearly 500 tunes from the various fiddle traditions. Jigs, reels, hornpipes, rags and breakdowns, each clearly labeled for origins (Irish, bluegrass, French-Canadian, old-time, etc.) and including a short list of recordings where the tune can be heard. Just flip it open randomly for a taste of its contents, and imagine the sound of tunes like &quot;Haste to the Wedding,&quot; &quot;Leather Britches,&quot; &quot;The Munster Buttermilk,&quot; &quot;Drowsy Maggie,&quot; &quot;The Wind That Shakes the Barley,&quot; &quot;Hanged Man's Reel&quot; and &quot;Great Big Taters in Sandy Land.&quot;Eight pages of textbook materials -- music theory, history and culture, style and genre -- give a wonderfully brief overview of the things you'd like to know without loading the book down with endless information which, frankly, can get in the way of the tunes and make it too bulky for carrying. Better still, the book is held together by a sturdy plastic binding which allows you to plop it down on your music stand with ease. There's nothing so frustrating as a music book with tight bindings which make it impossible to play straight from the page.",
                "review/helpfulness": "44/45",
                "num_reviews": 45
            },
            {
                "review/text": "We chose this book to be the standard for our Jam session in PRovidence because it has good versions of many popular old-timey, bluegrass and celtic tunes. Most of the session players around here play in several styles. This book has versions of 500 tunes taken from authentic sources, and most of the versions are pretty similar to what you will hear in the local sessions, so you can learn tunes from the book and be pretty certain that you will be able to play along when you hear the tune at the festival, in the bar or wherever. The author listed record or CD sources that you can get to listen to the tunes, so you can check the notation against the playing of well-known musicians such as Tommy Jarrell, Bob Wills, etc. The tunes are arranged alphabetically, so it is always easy to find what you want. This is a very useful and well-done book.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "Brody provides a good background on fiddling and fiddle tunes in this wonderful selection of music. The book appeals to fiddlers, and it also provides violinists interested in old-time tunes with sufficient resources to begin playing in styles different from classical music. The large selection of music provides great versions of mazurkas, waltzes, hoedowns, reels, jigs, hornpipes, airs, marches, and numerous other genres. Although the focus is on tunes commonly played by old-time fiddlers in the USA, the selection is international in scope, and the book includes tunes from Scotland, Ireland, America, Canada, and other countries. Each tune is annotated with a description of where the tune originated and a listing of various musicians who recorded the tune. These annotations will be especially helpful for musicians interested in the history of fiddling and for fans who wish to hear how the tunes sound prior to learning them from the printed page. The book should appeal to fiddlers of all skill levels; there are simple tunes for beginners as well as more numerous tunes that are a challenge for more advanced players.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I played classical violin when younger( 12 + yrs) and had returned to lessons as an adult in classical violin.Truth be told,I did not enjoy classical as much as I used to, so I started playing fiddle ( bluegrass,Irish etc) and have switched teachers to a fiddling teacher instead.I am far more relaxed now and having a WHOLE LOT MORE FUN!!!I don't think these are overly complicated songs to play,in fact I dont think many of the songs go beyond first postion (as I have seen) but I do understand that it is critical in bluegrass to LISTEN to the song( s) and how they are played so the student can learn better ( or even see some of \" the greats\" play on a DVD.For a classically trained violinist its unusuual to read about everyone's personal \" bowing style\" as I had no real freedom in that area while playing classic alone, or on an orchestra. ( classical people you know what I mean here!)This is just SO freeing! For once I feel I can honestly play and add my own emotions in my music and not try SO hard to interpret and read what the composer meant right down to which end of the bow I need to use as I did a concerto in a state competition ( It was a challenging piece, but it wasnt FUN!!) And I have no intention of pursuing orchestra again, but I DO have every intention of being able to play with other musicians in this genre as I understand it more and more,,,,While this book has no CD accompanying it ~ (it can hardly do so because it is PACKED with songs!) the author is kind enough to list for us the resources to listen to by a variety of artists, so I assume they can obtained them from any local library or be purchased them as time goes on.I understand that this is THE collection to have if you wish to get together with other musicians and PLAY bluegrass! ( just recently I heard about local pubs in my area doing Irish tunes and while I never \"did \" pubs , I am going to now! )(This was told to me by a Scottish drummer who cant read any music but plays incredibly well! )I also do not think that the binding on the book could take a lot of bumping around,,,so I am copying songs as I go along(~not for sale but for personal use~) so I can keep this collection in tact and make my personal notations. This is a precious collection to me.I purchased this from a brick and mortar store because the last 2 music books I ordered came damaged from amazon,,,,,( and all I received in return was shipping costs),,, but that in no way reflects on the quality of the collection of songs this book offers- it simply reflects on amazon.Get a copy of this book whereever you can get it if you are into fiddling! I ordered it from Barnes and Noble,which by the way helps you decide if you even WANT the book in the first place simply by being allowed to view the book ahead of time.I have 3 Irish fiddle books I ordered at B&N; just to view and see which one I prefer. I am waiting for them to come in now.My fiddling teacher has told me this book contains the most frequently played tunes for fiddle at bluegrass festivals and fiddle competitions, which my husband and I are planning on attending as much as we can in a few states. She should know , both her and her husband are professional musicians and play in 3 bluegrass groups ( so I was very happy to have her as a teacher!)I plan to keep some notes on this as we go to festivals,, and fiddling competitions and I can watch the bowing style of each fiddler.There are SO many styles in this genre ,,unlike classical, its a true learning experience for me!( I just feel like a kid in a candy store all over again!)Listening and memorization is incredibly important I understand if you are learning to play by ear( as I am now),,,, but those of us that can read music and have been trained many years to do so ,,,will have NO problem working thru the songs by note reading.Memorization is also great according to my instructor,,,, and every tune we work on, I try to commit to memory.Learning a whole new genre takes effort, time to practice and time to go over each song till I know it inside out.If you are NOT a note reader you may want to re consider this book .I love this book and am VERY happy it has accompanying chords for guitar but will take it to my fiddle teacher to have banjo parts written in clearly so my husband and I can play together. He plays guitar and banjo, and we have a friend that plays mandolin.I have taken to playing bluegrass simply because it is just plain FUN to do so!!!!!We are having great time playing this as well as playing on our worship team in our church.I am now looking for some great old time gospel bluegrass to add to our worship team's list of songs to be played on a Sunday morning so if anyone reading this has any recommendations I would be grateful!This is one heck of a book , very much worth the buy as far as I am concerned, plus,, you need not invest in many more bluegrass books outside of this one as it covers SO many tunes SO well!!!!!!",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is the third and LAST &quot;fakebook&quot; I will buy.It should be called &quot;the Fiddler's Realbook&quot;While the other fakebooks are just that, this one actually uses sheet music rather than tab. Now I can play the tunes with any instrument, or any other musician (who can read sheet music) I very much recommend it.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "When I first started playing the fiddle seriously about eight or 10 years ago (after several years of tinkering) a friend in a local contra dance band showed me his copy of The Fiddler's Fakebook. Though I was a marginal music reader at best, I decided to buy one. It was the best music investment I ever made. Because I've never completely decided whether I wanted to be a Celtic, old-time or &quot;other&quot; fiddler, this book was the perfect match. Over the years I have learned dozens of tunes from it - perhaps 30 percent of my repertoire. Now as a semi-professional player in a Celtic band, as well as a contra dance band, I continue to use it to learn tunes. One of the few drawbacks of this book is that many of the tunes are odd-ball transcriptions, quite different than many people play them, at least in this part of the country. Some are over-simplified, but if one uses them to learn the basic tune and then relies on listening to recordings or other players for variations and style, one can still benefit greatly from the Fakebook version. I would recommend any fiddler have this in his or her collection.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "When ordering this item i read the reviews, looked at the picture, and have seen the book in person. TO my dismay when i opened the box the book was not spiral bound but had your standard book binding with a slightly larger spine margin. The wider margin allows for you to keep the book open with ease however does not allow for folding the book in half like the spiral version.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This is the tune book to get. It contains most of what is being played, and in the key and style and version you are most likely to hear it. Sure there are other tune books you will want, but this one will always be the core of your collection.I am on my second one, the first one got so weathered and beaten, and the binding eventually broke and fell away, and I carried the pages held together with a large binder clip for awhile, hesitating to buy a new one because I did not want to lose all the hand written notes I had scribbled. Ok ok, I also did not want others to see the shiny pages free of the coffee stains and sun dried water stains.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you're looking to start playing bluegrass (or bluegrass style) music, this is the book to get. It's packed with great songs, and each song has an extensive discography, which makes it easy to find and listen to the songs you like. The organization isn't too great- simply alphabetical, but I don't find that this slows me down. The notation is clear and simply written, with a few ornaments to show you the right way. The introduction also instructs the beginner on modifications to technique - different bowings, fingerings, extended technique (glissando, etc.). You will like this book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I chose this book based on the review I read and the picture showed it's a spiral bound book. To my disappointment when I received the book was not spiral bound but had the standard book binding with normal paper weight. There is no differences than other paper music score book except the book has 302 pages which make it harder to place in your music stand.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "how to play the 5 string banjo",
        "description": "\"Pete Seeger has led millions of people in joyful singing for over sixty years, and his banjo style has influenced innumerable players. On this unique DVD he teaches up-picking, frailing, whamming, double-thumbing, tremolo, 6/8 time, calypso rhythm, hammering-on, pulling-off, two-and three-finger picking and a variety of wonderful songs\"--Container.",
        "authors": "['Pete Seeger']",
        "infoLink": "http://books.google.com/books?id=eVbyHAAACAAJ&dq=How+to+Play+the+5+String+Banjo&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Thirty-four years ago I started buying and using banjo instruction books. Today I have only one still in my possession, Pete Seeger's &quot;How to Play the 5-String Banjo.&quot; In addition to his many other gifts, Seeger has mastered the difficult job of teaching a musical instrument on paper. His approach is to take the student step by step with clear explanations in the text to making music as quickly as possible. Even readers with absolutely no knowledge of musical notation will be able to grasp his explanations and his illustrations. His drawings of the fingerboard are not the most sophisticated graphics in the business, but they don't have to be. The book (which isn't very long) also teaches the student about traditional and home made music as it touches on many styles of banjo playing. Seeger clearly uses banjo instruction as another means to spread his lifelong gospel of the integrity, value and sheer joy of music that comes out of living rooms rather than loudspeakers. Despite its popularity, the three-finger bluegrass banjo style of playing gets only cursory treatment in the text, but that is not a slight. There are plenty of slick and heavily tabbed (for &quot;tablature&quot;) music books focusing on the so-called Scruggs-style. Seeger's book acknowledges bluegrass, but gives the many other styles the due they receive nowhere else. I was at first frustrated, but later pleased at his technique of giving the student the words and music for only the first verse of a traditional song, telling me that I can get the complete version elsewhere. He was saving valuable space for more songs and other styles, and forcing us to expand our horizons to the sources he cites in the text. Thus, does his banjo instruction book inject the reader into the world of traditional music. My enthusiasm for the book is such that I've gone through 2 copies. I easily learned the frailing style. I have a grasp of Scruggs-style (and I tried Earl Scrugg's own book, too). But, I never got the hang of the drop-thumb. I don't blame Pete or his book for that lapse. Along the way I was introduced to songs, and the musical and social histories from which they sprang. Seeger's book was the best musical investment I ever made after I bought my first 5-string. Its purchase price is a pittance compared to the decades of enjoyment it has allowed me to experience.Bruce Collins Greensboro, MD",
                "review/helpfulness": "193/196",
                "num_reviews": 196
            },
            {
                "review/text": "So, there I was. A thirty-something workaholic looking for a new hobby to unwind a bit, but with very little in the way of musical experience. Nonetheless, inspired by a local Allison Kraus concert, I found a hot deal on a great used banjo on E-bay and I was off and running! What fun! I'm hooked on the 5-string twang!! About 3 months or so at 30-minutes a day (give or take) and I can play well enough to entertain myself - and my wife and the cat can at least stay in the same room!Not many banjo instructors in New England, so I thought I'd go in for a few good teach-yourself manuals. I bought four. In order of usefulness they were - Revised Banjo Primer by Geoff Hohwald - First Lessons Banjo by Jack Hatfied - How to Play the 5-string Banjo by Pete Seeger - How to Play Banjo by Tim Jumper.The Banjo Primer was the best of the lot. I was able to make good progress with about 30 minutes practice each day. The instructions were clear and the tunes were fun to play (Cripple Creek, Boil 'em Cabbage Down, Worried Man Blues). It was VERY helpful that the book came with a CD. Some lessons I just couldn't get until I heard them played, then they came easily. Each lesson is played at three speeds, but I've pretty much given up EVER matching the insanely fast top speed.First Lessons was next best. It also came with a useful CD with multiple speeds and I think I've at least got a shot at the top speed. It also includes tracks with only the backup musicians so you can jam on your own (I haven't reached that point yet). The choice of music wasn't as good - the intro claims that well-known songs are easier to learn, but I found them to be cliche and boring (Tom Dooley, Old Time Religion, Good Night Ladies). It was much more fun to learn a song I didn't know and finding myself actually playing something that sounds like bluegrass after the long struggle!Both books cover roughly the same techniques and both focus exclusively on Scruggs Style picking (all plucking, almost no chord strumming). It's turning into my favorite style. But my goal is to play well enough to sit in on a local bluegrass jam, so I've also started to learn other styles (e.g. frailing) that will let me strum on chords in the background to build confidence. For that I need other books, but so far I haven't found a good one.By all accounts, Pete Seeger's book seems to be the classic in the field. It started as a set of hand copied notes and it really is lots of fun to read. I hope that once I improve a bit more I'll be able to get more out of it. My guess is that its the book you'd want if you already had a community of pickers around to lend advice and guidance. As a teach-yourself manual though, I'm finding it tough going.How to Play Banjo is the worst of the lot. To my untrained eye it seems more like a guitar book than a bluegrass banjo book. The focus is on chords and strumming (which is good for my next step I suppose), but it's just boring. The instruction is minimal and the music uninteresting, at least to me. I tried several times to get into it but found myself quickly going back to the other manuals when I realized I was no longer looking forward to my practice times. I finally threw in the towel on this one when I used it to try to learn &quot;frailing&quot;. I like to think I'm a smart guy, but I just didn't get it. And I don't think it was me. Maybe if it came with a CD that I could listen to I could work it out. I'm now in the market for an alternative, but in the meantime I'll keep pickin' with the Scruggs Style.One last bit of advice. I highly recommend getting at least two books. I found myself much more motivated jumping back and forth between the Primer and First Lessons - when one got too hard or too boring, I'd work on the other for a few days. A great trick to keep from getting stuck. I'm in the market for some &quot;intermediate&quot; books next and I'll probably take the same approach.Happy Picking!!",
                "review/helpfulness": "64/67",
                "num_reviews": 67
            },
            {
                "review/text": "What can you say about a little book that started out as a handful of mimeographed sheets, and has been in print for over 40 years? Like thousands of other player, my banjo playing began with a borrowed Harmony 5 string banjo and the this little book.And what a marvelous little book it was! In a few pages Pete introduced me to scores of styles, tunings and songs. I didn't even know there was more than one way to play a banjo, but by the time I worked my way through this book I could frail, I could play a bit of clawhammer, and I could even work my way through a slow and tortured version of Earl Scruggs' great &quot;Foggy Mountain Breakdown&quot;. All the songs and techniques are presented in a simplfied tablature, and Pete's explainations and the illustrations are goods enough that I managed to develop a pretty good clawhammer stroke even though I'd never actually heard one played before.It's amazing how much Pete squeezed into this tiny book. Besides instruction in playing, there are bits on the history of the banjo, choosing a banjo, installing a fifth-string capo, lengthening a banjo neck- in short, everything the total novice needs to get started and then some. I eventually progressed to other books- notably Art Rosenbaul's &quot;Old Time Mountain Banjo&quot; and &quot;Art of the Mountain Banjo&quot;, and of course Ken Perlman's many fine books on clawhammer style, but I always kept a copy of this little manual around, as much as a reminder of those early days as anything. What more can I say? It's a gem. I love this little book.",
                "review/helpfulness": "42/43",
                "num_reviews": 43
            },
            {
                "review/text": "I bought this book over 35 years ago. I still use it today. Learned Seeger and Frailing (claw-hammer) style from this book. Probably the best book for the beginner, who wants to learn the original bluegrass style.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "There wasn't any way I could tell when I ordered this book that it was written for C tuning banjo. I was interested to learn with G tuning. The book was helpful but not what I was looking for.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "I agree with other reviewers that this book has historical merit and is interesting to have on your shelf. But inside the cover Pete Seeger says himself that the one useful revision of this book would be to rewrite it for G tuning. Why did he or a colleague NOT do so? When buying this book over the internet it is not apparent that the whole book is written in C tuning. Hence the book as an instruction manual on how to play the 5 string banjo was pretty useless for me. I would rather have spent my $$s elsewhere.Carole M",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "I purchased three instructional banjo books: Banjo Primer, by Geoff Hohwald; How to Play the 5-String Banjo, Third Edition (Banjo), by Pete Seeger; and Teach Yourself Bluegrass Banjo (Teach Yourself Bluegrass), by Tony Trischka.How to Play the 5-String Banjo, Third Edition (Banjo), by Pete Seeger, is a good book, but teaches a different style of banjo playing than most of us are familiar with. The book focuses primarily on frailing (strumming), rather than the finger-picking, Scruggs-style bluegrass that we all know. It's more \"folky\" oriented, but is an excellent book nonetheless. I have not really used it as a practice book, but the amount of information contained in the book about music and the history of the banjo makes it a worthwhile investment for any picker.Banjo Primer is the book most easily used because it is very simple and easy to learn from. The songs that are taught take you step by step through the learning process and are played at two or three different speeds on the accompanying CD to help you progress. Even though the book is great, I find that I am going to take additional banjo lessons along with using the book, as I find myself developing bad playing habits already.These bad playing habits are covered in the book, but should be addressed by a professional teacher to help you develop good technique from the start.I also purchased Teach Yourself Bluegrass Banjo (Teach Yourself Bluegrass), by Tony Trischka, because I am familiar with Tony Trischka's music, but the book seems to be geared more towards the intermediate/beginner level of playing. Once I've been taking lessons for a couple of months, I'll probably take another look at the book and use it. The CD that accompanies the book has all the songs, but because the titles are not explained as you're listening, it's easy to lose track of where you are on the CD and where you are in the book.Bottom Line: Banjo Primer, by Geoff Hohwald is the best beginner banjo book and I would recommend it to anyone who is learning to play the banjo, but definitely pick up Pete Seeger's book just for the information contained within it.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I first bought this book around 1980 to teach myself to play my first banjo. I never really got very far, and marriage made for further distractions. Then in 1984 a rental truck fire claimed both my banjo and my book.Fast forward twenty years. I finally replaced my banjo (it just arrived five days ago). I was delighted to find Pete Seeger's book was still in print and available through Amazon, and it arrived a few days ahead of the instrument. I am also using the Janet Davis book and DVD, which is a great tool, but I wouldn't be without Pete Seeger to guide me as well.The main benefit of this book is that Pete covers a wide range of playing styles, and lets the student sample them all. He encourages readers to skip around the book and experiment. This is a far cry from today's banjo books that tend to lock you into one style or another right away.I love the way the book is laid out. It begins with a basic strum in C tuning. This is what I learned many years ago, and it was well suited to simple accompaniment of folk songs. This will have you making useful music in a fairly short time. It moves into more advanced concepts from there.This book isn't slick and polished like modern works. The printing looks amateurish, and the tablature is hand-drawn, as are many illustrations. Photos look like they were made on an old copy machine. But all of this only adds to the book's down-home spirit.Besides teaching technique, Seeger sprinkles the book with music theory, banjo history, and lots of other flavorful items. My favorite is a Peanuts cartoon (I'll let you buy the book to see it.) His writing style is also very friendly and readable, and often quite funny. This may not be your main instructional book, but it is a must have for any banjo student, for it captures the spirit and soul of folk music far better than most books which tend to read like technical manuals.The 2002 edition includes handwritten notes from Pete inside the front and back covers. He indicates that if he had time for a major revision, he would start with G tuning and three-finger picking, where are more in vogue nowdays. He also makes mention that some obsolete addresses of banjo supply and record companies still remain in the text.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "i wouldn't call this a book for \"all levels.\" it's not going to take a scruggs style picker very far. this is a basic introduction to several different styles of banjo playing -- seeger style, frailing, scruggs, etc. it's probably going to be difficult for most people to use unless they can get and accompanying audio cd or tape or teacher who is familiar with the styles covered, so they can hear how the written music is supposed to sound. the wonderful thing about this book in my opinion is that it's written by pete seeger. the flavor of who pete is, his love of music, his embrace of all cultures and musical styles, and his politics (my recollection is that he initially sold the book at a very modest price and declined to copyright the book), all come through as you read the book. if you love what pete does, this book is a good choice. if you want to really get into clawhammer style, scruggs style, or melodic style banjo, you'd get more mileage out of other books.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Pete Seeger's \"How to Play the 5-string Banjo\" is easily one of the most informative and readable books about the 5-string banjo ever written. For years, it was the only such book available, and countless of today's best-known banjo players got their start studying its pages and listening to the accompanying LP (available on CD from Smithsonian/Folkways; a new DVD version is also available from Homespun Tapes).From an historical standpoint, this book contains the first usage of the terms \"pulling-off\" and \"hammering-on,\" which Pete coined to describe these now commonplace left-hand playing techniques. Pete is also responsible for reviving the use of tablature, a simplified way of diagraming music that had not been used for centuries.It is important to note that this book was written before bluegrass became the most popular style of banjo playing. So while \"Scruggs style\" is ably discussed within its pages (with the help of Mike Seeger), many other playing styles are explained and demonstrated. These \"other styles\" were the ones used by Bob Gibson, Erik Darling, Peggy Seeger, Hedy West and all the banjo greats of the so-called \"Folk Era\" (including, of course, Pete himself). So if you're a fan of banjo music from that period, this book is a must.For me, the key thing about Pete Seeger's banjo playing (and teaching) is his belief that the 5-string banjo is not a narrowly defined \"bluegrass\" or \"folk\" or \"old-timey\" instrument--but rather, that it is a musical instrument whose usefulness is limited only by the player's imagination. Thus in this book we find TABs of mountain tunes like \"Darling Corey\" and \"East Virginia\" side by side with \"Jesu, Joy of Man's Desiring\" and Seeger's beautiful accompaniment for the \"Burgundian Carol.\"The current edition is identical to the classic \"Third Edition, Revised\" from 1962, with some notes from Pete added to the inside covers. Regarding these notes, one reviewer said: \"He indicates that if he had time for a major revision, he would start with G tuning and three-finger picking, where are more in vogue nowadays.\" The part about Pete wanting to start with G tuning (rather than C tuning) is accurate. But the picking style Pete says he'd now prefer to start with is not three-finger picking; it is a type of two-finger picking (index finger and thumb) he learned from Bascom Lamar Lunsford. And my guess is that he now would like to start with G tuning not because it is \"more in vogue these days\" but simply because it is easier to learn to play in the key of G using G tuning than it is in the key of C using C tuning. (For one thing, a G chord in G tuning requires no left-hand fretting at all.) Likewise, while the \"Lunsford Lick\" has the same \"bump-dit-ty\" rhythm as the \"basic strum\" and frailing, it is easier for the beginner to master. And Seeger's aim has always been to get people playing (and singing) as quickly as possible.Is this the best book to start with? Probably not, especially if your interest in the 5-string banjo is restricted strictly to bluegrass. But if you're open to exploring many different banjo-playing styles and applying them to many different kinds of music, there is no better place to begin.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "arnold jacobs song and wind",
        "description": "Arnold Jacobs: Song and Wind is written by Mr. Jacobs' assistant, Brian Frederiksen, and edited by John Taylor. Material comes from masterclasses, private interviews, previously published writings and contributions from his students and colleagues.",
        "authors": "['Brian Frederiksen']",
        "infoLink": "http://books.google.nl/books?id=Fq4QAQAAMAAJ&dq=Arnold+Jacobs:+Song+and+Wind&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "It's a sorry state of affairs when great talent,inspiring teachers as Jacobs doesn't get more comprehensive treatment. Mr Frederiksen has done the best job he could,but only about 20 pages,(as the other reviewer said) are valuable. That's if you are interested in the art of Arnold Jacobs: how to become a virtuoso wind player,a consummate musician.There seems to be a lack a support for books like within the corrdors of established music in the United States.I also know that music books are not great blockbluster sale items,so they frequently get edited to hell.Well this book should have been edited that's not the problem.The problem is focus and funding. There should have been other writers,those who have shared Jacob's craft for teaching,the various problems in playing a wind instrument,and more on the theories he developed for respiratory situations and breathing,which were quite unique to the world of brass.That's here,but not fully explicative and quite sketchy.The Chicago Symphony should have found the money to produce a more indepth study of Jacob's art. Instead it seems Frederiksen has much filler material here, biographies of conductors and other brass players which reallylooses a focus and is not important for this study.Also the hardcover price keeps it out of the reach of the multitude of student wind players throughout the country,those who could really benefit from a study like this.(There is no paperback,nor is one contemplated)There are such similar situations in music where funding is misplaced. The composer Ralph Shapey,as another example, also from the Chicago area should by now have a book length analysis and discussion of his profoundly powerful music.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "This is a book for the Arnold Jacobs devoted fan only. Full of seemingly everything the author could find on Jacobs, it will leave the reader who wants to get a sense of Jacobs the musician, teacher, or person feeling empty. For a serious musician who wants ideas on how to improve his playing, practicing, musicality, etc., there are about 20 valuable pages buried in the middle of the book. While we have had many great music teachers, there have been far too few books that capture any of the essence of their teaching. While clearly this is difficult to do, it is something that needs addressing. What a book like this should do is to give a sense of what it was that made Arnold Jacobs great. It should analyse what in his methods, psychology, personality, made him what he was. It should give a sense of what a lesson with him was like, how he would deal with various pedagogical problems. I would reccomend this book, because there is information in it that needs to be published. But it also points out the need for further study and publication.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "As a former student of Arnold Jacobs, reading this book brought back many fond memories of this giant of tuba players. His life touched many of the world's best tuba players living today. Those thirsting for Jacobs discography will find a listing of all the recordings he participated in. The book provides fascinating insight into the master's approach to teaching. Any former Jacobs student who wants to have a &quot;refresher lesson&quot; as our friend smiles down on us from heaven will find a treasure trove of knowledge within these pages. And, it has plenty of pictures, too, including the history of Jacobs' find York tuba, which I was priveleged to play when I was his student in Gunnison, Colo. in the '60's.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            }
        ]
    },
    {
        "Title": "rhythmic illusions",
        "description": "Created for drumset players who find themselves in a creative rut, this book and audio package easily breaks down the mystery behind subdivisions, rhythmic modulation, rhythmic scales and beat displacement. The author makes the transition from mathematics to musicality with an easy and systematic approach.",
        "authors": "['Gavin Harrison']",
        "infoLink": "http://books.google.com/books?id=ifwU-J3AOYkC&dq=Rhythmic+Illusions&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "WOW! Now here is a Great book, I've often been Puzzled by some of the Rhythms I've heard in either Modern Music or some of the Jazz or Fusion Music I've been listening to and I've not been able to figure them out, But finaly here is a book that Explaines much of it, and it's funny that some of these Illusions are quite simple actualy, that is in theory, But in practise they can be very difficult, at least some of them.This Book is for the drumset, I don't play the drumset but bought it anyway because these Rhythm concept can be applied to any instrument.The Book deals with many Rhythm concept like Beat displacement, Modulation, Rhythmic scales and Polyrhythm, ther's a lot of Material here and I must agree with Bill Bruford in his Foreword to the book &quot;I've got Work to Do&quot;.Other good books that deal with some of these things are &quot;Rhythm and Meter Patterns By Gary Chaffee&quot; and &quot;Polyrhythms by Peter Magadini&quot;.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "This book showed me so much about what can be done on the drums. It explains things that one might never think of or might have ideas about but never be able to put them on paper. Also comes with a brilliant CD that will make your head spin!Take a look at some of Gavin's solo stuff on youtube. He does a few lectures about metric modulation and displacement. You'll get a feel for how innovative his approach is and how challenging some of the concepts really are.This really, really changed the way I play drums and how I approach writing.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Great book. Very interesting stuff that you've heard Simon Phillips, Vinnie Collaiuta, and the like do forever. this takes the \"mystery\" out of some elusive concepts and gives you a systematic way to develop the tools. It's kind of like the Chaffee material in that it is very well laid out, systematized, and organized to go through all (or most) of the permutations. Especially great if you're disciplined enough to go through it a little bit at a time b/c it's not easy stuff. It can give you a bit of a headache. Once the concepts, feel of the displacements and modulations, and application of the material within a musical context are together, you're going to impress a lot of people.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "funk keyboards the complete methoda contemporary guide to chords rhythms and licks book cd",
        "description": "(Musicians Institute Press). Explore the chords, rhythms, and techniques used by the greatest funk keyboardists! Subjects covered include: common chords and progressions; classic funk rhythms, licks and patterns; synth bass & multiple keyboard playing; and pitch wheel and modulation. The accompanying CD includes 81 full-band tracks.",
        "authors": "['Gail Johnson']",
        "infoLink": "http://books.google.com/books?id=pErZjgEACAAJ&dq=Funk+Keyboards:+The+Complete+Method--A+Contemporary+Guide+to+Chords,+Rhythms,+and+Licks+(Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I picked up this book knowing some chords and scales, and it is putting it all together for me. It has taught me new voicings to all the old chords and new rhythems for all those scales. I sound so much better now. It's teaching me great techniques for using both hands to create a professional sounding bubble gum machine of sound. After working with this book for just 4 days I went and jammed with friends and they were amazed at how much I had improved. If you want to sound funky on the keys, buy this book.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "I love this book. Gail Johnson has taken me from loving this style of music to being able to actually play it. She's just done a fantastic job of introducing and teaching funk keyboards.The book comes with a companion CD, which is very useful, as the notation is fairly complex, and I find it quite helpful to also hear the parts and play along with them. After a few repeats of each exercise, the recorded keyboard drops out, and if you're playing along and there's no apparent transition, you know you've nailed it.I will spend weeks digesting this, getting facile with it, learning it in various keys, and integrating it into my playing. The cost is miniscule compared to the value.If you love funk keyboards but haven't been able to work out how to play them just by listening or you don't know someone who can show you this stuff, this book is for you. I just wish I had had it 20 years ago.The only change I would request is for her to add extra audio tracks of the complete songs that go at maybe half speed. It's taking me quite a while even to learn a couple measures of the best stuff and bring it up to full speed. I'd like to be able to play along sooner, at a more manageable speed.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I think Jeff K.'s review is entirely correct. There are a multitude of usable examples of runs and progressions. I really enjoy using the cd with Digital Preformer - I'll load up an example, loop it and play over it until I have the timing right.After using Levine's Jazz Piano Book (if you don't own this book you should) for five years Gail Johnson has helped me change up my voicings and rhythm - even helping me modernize (if you can consider 70's and 80's funk modern) my personal sound.If you like Bob James, Deodato, George Duke, etc. this book will get you a little closer to what you are looking for.I'm not a bass player, but Josquin des Pres wrote an OUTRAGEOUS book on classic funk and r&b; grooves for bass. I load some of his audio into my sequnecer and try to incorporate some of Gail's ideas. It's really good practice and infinately more interesting than most of my workouts.There's a book by Peter Gelling that has a similar title that is no where near as good as this one.For a fourth of the price of one piano lesson you will learn a lot.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book is what I have been looking for in a method book. The chords, the music, and the rhythms are \"funky.\" I popped in the included CD into my cd player to listen to a few examples of the music that's in the book. I've always wondered how funk was played. This book contains most of the answers.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Gail Johnson has done a great service to the music community by writing this book/cd. It is chalk full of USEFUL riffs, rhythms and changes actually heard in contemporary and classic funk. The cd has almost all the examples (80+) found in the book and a lot of the riffs will sound very familiar if you are acquainted with the genre. It's a welcome change from examples in other music books/cds which often times are more theoretical than practical. Her writing is very concise yet enlightening and a great variety of styles and topics are covered. I especially appreciated the clav licks. As well her funk discography at the beginning is of the highest order. Price of $15 retail? This deal smokes. Great job Gail and Musician's Institute. More quality publications like this please.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "very repetitive, midi jam tracks that sound awful,and you are with nothing that you can applyto real world of playing.I gained much more from the Hal Leonard Blues Pianoand Smooth Jazz Piano Series books. i.e. useful licks,chord progressions and basic soloing techniques",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "Gail Johnson is not only a good teacher but she is an inspiring person aswell. I have not met her and only know her music from this book, but I can say that the method is thorough, and the music is playable and it genuinely builds your technique and musicianship.She takes you from basic grooves to complete songs. All the while the music is sensible and meaningful, and allows you to grow your knowldege and technique.This is what good music instruction is about - presenting beautiful music with insight and inspiration. It's not easy to do outside of a music lesson, but she has pulled it off. Now how about a book 2, something with more funk studies, perhaps?",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I'm a funk person. I like writing funky grooves, I play, and have been playing. I've got minimal funk chops, and so I was looking for material to learn more vocabulary from.Well, this book ain't it. It covers the basic of the basic, bread and butter type stuff. I guess it's very good as an intro to funk keyboards. In other words, if these phrases sound foreign to you, then you definitely need to get these bases covered. But beyond that, the book doesn't offer too much.Bottom line: Can the book inject a good amount of funk into a stiff classical player? Yes, and it will cure his bad knee too. (funk heals) If you already know what you're doing fairly well, NO, this book isn't for you.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "teach yourself bluegrass fiddle",
        "description": "Teach yourself authentic bluegrass fiddle with this book. The book contains clear instructions on the basics: bowing and left-hand techniques, solos, backup, personal advice on performance, and much more, as well as a complete selection of the best bluegrass songs to learn from. Written by Matt Glaser, chairman of the String Department at the Berklee College of Music in Boston since 1980.",
        "authors": "['Matt Glaser']",
        "infoLink": "https://play.google.com/store/books/details?id=TZrIDgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book is designed for someone who already has at least a basic knowledge of how to play fiddle/violin. It will help you learn how to read music, and has very good descriptions of several bowing techniques. It includes numerous classic fiddle songs. Perhaps the most valuable aspect of the book is that for most songs it tells you not only the melody, but also a suggested way to play backup for each song and a suggested way to play a break/solo to accompany the song. Therefore, it will keep you entertained by allowing you to play with a song in a number of ways, either by yourself or with a band.",
                "review/helpfulness": "51/51",
                "num_reviews": 51
            },
            {
                "review/text": "I agree with the other reviews, this is definitely not intended for players with no violin/fiddle experience. However, for someone who already knows how to play and wants to venture into bluegrass, it's perfect. Each tune has sheet music with backup and breaks, plus the cd has each tune twice - once with the fiddle and once without. The tempos are good - challenging but not impossible. It's like having a very patient band behind you - they never get tired!",
                "review/helpfulness": "28/28",
                "num_reviews": 28
            },
            {
                "review/text": "the book is intended for people who already play the fiddle and would like to play bluegrass. with this qualifacation out of the way, I liked the book.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "The title and it's description is misleading. The first part of the book states something along the lines that \"This book is intended for those who have played violin and want to start playing bluegrass\" I started playing fiddle just a few months ago with an instructor and purchased this book to help me along. I'm not interested in learning sheet music (nor is my instructor the kind who teaches it), more so just back porch picking. This wasn't the book for me.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "IF YOU ARE A BEGINNER, don't expect to walk in and be able to teach yourself how to use a violin bow to make good sound. If you want to learn how to play a bowed string instrument, GET A TEACHER - you will not learn it in a book.While I do play some violin, I'm primarily a bassist, and I decided to have little fun - by playing bluegrass fiddle licks on double bass. This is no small undertaking, but many of the tunes here can be played on bass in different octaves (depending on your playing ability.) Some are easier than others, but the more difficult ones could be transposed into easier keys or played at a different octave where the fingering might be easier. The CD is helpful - tracks with solo fiddle allow you to hear the style, and those without are for fun practice and improvisation.If you are a bassist, I suggest having some knowledge of the Rabbath Bass Method first - Book 1 played up an octave would be a good start. This book is a great way to expand your bass technique and learn a new style of music.Keep in mind I'm not using this book as it was intended (i.e. for violin.) Good luck.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "I love this book. I've played violin for 10 years or so, but only recently have I found an interest in playing bluegrass. This book was perfect for my situation; challenging, but not for life-long fiddlers either. I love the \"breaks\" that this book gives. Double-stops, slides, 16th note triplets, this book's got 'em. I really enjoy it.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "A NICE COLLECTION OF BLUEGRASS TUNES, AND A GREAT ACCOMPANYING CD TO PLAY ALONG-- BUT YOU BETTER BE A RATHER ACCOMPLISHED FIDDLER BEFORE YOU TRY THESE TUNES--- DEFINITELY NOT FOR THE BEGINNER",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "I like this book very much, but I can already read music. Also, I can already play the violin with some proficiency. This would be a horrible book to try to start with if you didn't have fiddle experience, but in terms of getting a feel for bluegrass music when you come from a classical background, I think it's very effective. I would recommend it as an introduction to the style, not to the instrument itself.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Useful as an etude or method book; good tunes for practicing, but I think one would need a teacher to get the most out of the material, so not really \"teach yourself\" -- that is, even if you can already play violin, having a real person show you specific bluegrass techniques really helps. Playing along with the CD is fun, but the tempos are a bit quick for someone new to the style. I would give the product five stars if the CD included slow jam versions as well.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "This books is so light. Others criticize it because it is not for the beginner, but the book is up front on this matter. The point is that there are only 5 and a half pages on playing bluegrass and the remainder is sheet music you can download from the Internet. If you are too lazy to get free sheet music from the Internet, then blow your money on this book. If not for the CD that comes with it, I would only give it one star. But the CD does not help you to teach yourself bluegrass, it only shows you how your music might sound 10 years from now, after you master bluegrass, ON YOUR OWN. The String Department at the Berklee College of Music in Boston should have paid Matt Glaser and Oak Publications to not mention the school and protect their reputation. You can also listen to several renditions of many of these tunes for free on YouTube, AND you get to see the fingering and bowing technique of the old masters of bluegrass - most now dead. The YouTube videos may be more helpful than the CD in this books. Glaser handles jazz and improvisational music at Berklee, played the beautiful Ashokan Farewell in the movie The Civil War and released a jazz and bluegrass CD for Rounder Records with Wayfaring Strangers. So he has talent, but why would he put his name to such a poor effort of this book?",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "elwoods blues interviews with the blues legends and stars",
        "description": "(Book). Elwood's Blues is an entertaining and informative collection of conversations with the legends and rising stars of blues and rock music, drawn from the popular syndicated radio series, The House of Blues Radio Hour . Host Dan Aykroyd, in character as Elwood Blues of the legendary Blues Brothers, has interviewed over 900 blues and rock greats since 1993. This book compiles the best of those, including discussions with living legends B.B. King and Buddy Guy, past masters John Lee Hooker and Stevie Ray Vaughan, rising stars Keb' Mo' and Susan Tedeschi, and blues-rooted rock stars such as Robert Plant and Bill Wyman.",
        "authors": "['Dan Aykroyd', 'Ben Manilla', 'The Blues Brothers']",
        "infoLink": "http://books.google.com/books?id=74G8kP6fkLUC&dq=Elwood%27s+Blues:+Interviews+with+the+Blues+Legends+and+Stars&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I really love books like this. The formula was done by E-Street drummer Max Weinberg in The Big Beat, where he interviewed top percussionists. For years it's continued to call to me for yet another reading. I suspect this book will produce similar reactions. There's way too much to absorb all-at-once, even though the book reads so quickly you have to pace yourself down.The lineup is stellar. Understandably, my particular favorite interviews are those on my favorite artists. R.L. Burnside is worth the price of the book alone. But the artist I most was pleasantly surprised by is Taj Mahal. He's far more articulate than I'd've imagined, causing me to retreat to his CD catalogue and re-explore his depth and scope of musical influences.This is blues made accessible. But don't misinterpret that statement as \"blues lite.\" This book's subjects are substantive and worthy. It's a mighty fine tribute to these deserving artists.Perhaps the nicest aspect is how Elwood Blues stays out of the way of his subjects and lets them occupy center-stage, where they justly belong. In the hands of lesser authors, the book coulda easily become a \"look at me interviewing a living legend\" mess.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "I have seen at least a dozen of the artists interviewed in this book live and I have heard the music of almost all of them. I thought hearing them interact with Dan Aykroyd would be fun and really lighthearted. These interviews are so much more interesting, historical and enlightening than I expected. Anyone that would like to hear about some great musicians experiences, anyone that really wants some help getting into Blues music, anyone that wants some real clear and simple Blues history, anyone that wants to motivate themselves or a young person over the age of 12 to continue or clarify their musical interests would love this book.This book is comfortable reading for anyone. You can read the interviews one at a time or in any order and it won't effect the experience. Aykroyd's knowledge of the Blues is much more significant than I would have expected. I can't remember one question in the whole book that was just for a joke or soley comical reaction. Every musician seemed very comfortable talking to him. Every musician seemed to enjoy this opportunity to tell some real and simple truths about the Blues or their lives. Blues history books can become tedious. In this book once you hear four or five different artists that are not associated with each other describe the same Blues history or musical perspectives you know this book is really something special. Also the Blues discography was a great bonus.After reading the first four interviews I bought a copy as a gift for a friend. By the time I finished this book I had a list of six people that I want to buy copies for, each for a different reason. This book is now my Blues mini-encyclopedia.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "contemporary music theory level one a complete harmony and theory method for the pop and jazz musician",
        "description": "(Piano). This book is the product of Mark Harrison's experience teaching hundreds of students at the world-famous Grove School of Music in Los Angeles. Suitable for instrumentalists, vocalists, composers and songwriters, this Level 3 course covers the chord tones, extensions and scale sources for all major, minor, dominant and diminished chords, and then applies the contemporary shape concept to create voicings, polychords, and to harmonize melodies.",
        "authors": "['Mark Harrison']",
        "infoLink": "http://books.google.nl/books?id=pofgPwAACAAJ&dq=Contemporary+Music+Theory+-+Level+One:+A+Complete+Harmony+and+Theory+Method+for+the+Pop+and+Jazz+Musician&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Mark takes you through chapters on notation, major and minor scales, intervals, triads and four-part chords, modal scales and diatonic relationships. A VERY detailed and well explained book w/ great examples on what a certain topic is about. A must for anyone who's just starting to get into music theory. Might want to also consider Contemporary Music Theory level 2, also by Mark Harrison once you're well versed in Level 1.",
                "review/helpfulness": "52/53",
                "num_reviews": 53
            },
            {
                "review/text": "I have 3 of mark's books. This one, the second one and the pop piano book. The one I like most is the pop piano book but this book is almost required reading. On with the review!This book teaches music theory and it is what you will get. It is very clear and moves in a slow steady pace. If you pay attention you will never lose yourself. It is ideal for someone learning alone because it has exercises at the end of each chapter you can use to brush up on what you just learned. Just like chemistry (which is what I always read!) theory isn't going to take you anywhere. You need to use it too. This is almost prequisite reading for the &quot;pop piano book&quot; unless you already have a good grasp of music theory. I use it in conjunction with my keyboard playing. If you just read and go through the exercises, you will learn but you will forget too! So it is recommended you actually use what is learned in conjuction. This will not tell you how to &quot;use&quot; the theory. That is up to you. Play your instrument frequently!So if you always wanted to know the background about music get this. Stop memorizing chords having no idea why they are what they are. The print is clear, large, easy to read. But I don't like the binding on the book. kind of weak.",
                "review/helpfulness": "25/26",
                "num_reviews": 26
            },
            {
                "review/text": "Contemporary Music Theory is a well paced thorough introduction to music theory. It starts with the basics and then builds on them in a very strightforward way. Each step is explained in depth with simple and clear examples. Beginners should already know note names on the keyboard and music staves, but that's about it.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "It is the first of three volumes but I can say that if they had used a little smaller font sizes, all volumes can be in a mid-size book. And the information in all volumes is just for the very beginner. If you got his The Pop Piano Book so don't get them - just a waste of money. It's bad that in the text the writer is always offering you another book of him, sounds like 'i never teach you anything if you don't buy all of my books'. And after all he's got 6 books but the other 5 except the Pop Piano Book, are useless: Don't let the very big font sizes fool you, all the page have only 15-20 sentences, so with a normal size font it can take only 40-45 pages. Buy just a little book about harmony for beginner and you'll get what you expect from this one.",
                "review/helpfulness": "15/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book is clear enough that even a young student can learn from it.I must echo the sentiments of the earlier reviewers: If you can already read music and want to get started on the theory (scales, intervals, chords, and the like), then this is an excellent choice.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "I'm not really a musician, so I can't compare this book or its method to other books on the same subject. But I found this book very clear and understandable and I read it all the way though, did all the exercises. And it taught me a lot. This really is an excellent book, and I would recommend it to anyone who can read music but doesn't know the theory behind it.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "&quot;CMT - Level 1&quot; serves it's purpose wonderfully. It taught me many things clearly where other books failed (such as intervals, and the Circle of Fifths/Fourths). Mr. Harrison is a good teacher, and I would recommend this book to my friends. But I will keep the praises brief seeing as there are many reviews here that do just that for me.The reason I give this book four stars rather than five is because of the typesetting used. The text is very large, and there is a *lot* of wasted real-estate on each page. If the typesetting had been improved, this book could have been truncated by at least 100 pages, allowing for cheaper production, and finally, a less expensive book for the public. If it's any revelation, I was able to complete this book in only four days, with two-three hours each day (this includes doing half of the exercises).Also, there is one more complaint. Mr. Harrison is a great teacher, but is not as fortunate in his writing skills. Although this does not take away from the things learned, it is a bit annoying at times. For instance, about every other sentence is terminated with an exclamation mark. There were times I felt like I was reading a chat log from an AOL channel. Also, there are numerous places where paragraphs (and sometimes several pages) were copied and pasted into another area of the book, with a few [music] notes changed here and there. About one-third of the book is a result of copy and pastes from the other two-thirds.All of that aside, it did exactly what it was meant to do: give me a clear introduction to music theory.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "While the book kind of sputters at the beginning it really takes off in the third chapter. Alot of emphasis is placed on the contemporary jazz second dominant. Also I liked the treatment of styles of Bill Evans and John Abercrombie. Both of these artist&quot;s styles are meticulously broken down and analyzed. The book also does a good job on the I-ii-iv-v-I progression.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I teach college level music and was experimenting this semester with this text. I was initially drawn to it because I was looking for a little more modern approach as I also strongly gear students toward being able to play by ear as well. I thought that it would be a good reference for my students to have later in its explanation of theory, too.But I was very disappointed when I got to the section about the Circle of 5ths. It's diagram explains it so that the flats circle clockwise and sharpes circle counter-clockwise. This is backwards to me! I could not teach my students something I felt was unconventional, so I had to avert to a supplemental text. Also, it totally skips introducing music notation (counting rhythm of notes,etc in written music) in the first book entirely! Even though I agree that contemporary and jazz music is best expressed by introducing chord structures,and jazz music is more liberal than what is just written. I just can't personally totally eliminate rhythm altogether and ignore it as if it weren't a foundational element.Also, overall I found it too wordy to make reference to while explaining the topic during class. Good for individual study but not classroom. IT was not concise enough and on some topics skipped around illogically on explaining it.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "Quite the best explanation of music theory, for both classical and contemporary music, that I've come across.Mark Harrison does not &quot;put the cart before the horse&quot; (as he explains himself) and as such brings clarity.Even though there is some repetition to bring home important points, overall there is a delightful brevity.Don't even think of skipping any.The appendices contain a very useful set of triads in all keys.Highly recommended. I can't wait to order volume II.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "mel bay fun with the tin whistle method song book for d tin whistle",
        "description": "This beginning method/songbook is designed for the D tinwhistle. Includes music theory, fingering diagrams, note studies, and plenty of songs for practice. the stereo recording features tinwhistle, guitar, and keyboard and contains many of the solos featured in the book.",
        "authors": "['WILLIAM BAY']",
        "infoLink": "https://play.google.com/store/books/details?id=T0a-pibW5bkC&source=gbs_api",
        "review": [
            {
                "review/text": "Well when I got my first tin whistle I could play it a bit because I'd been playing the flute for a few years but when it came to buying a simple beginners book for it, it proved a challenge. All I wanted was a clear book with large printing that had a fingering chart for all the notes and lots of easy traditional reels and jigs and things. That's exactly what I found in this book, I just picked up my whistle and away I went, playing for hours on end with this fabulous book. The only suggestion I have is that you have a tin whistle in the key of D.This book is designed for a D whistle, most books are. A C whistle will work as well but you won't get the same rich tone from it as you will from a D. I also suggest Walton tin whistles because they give you an excellent tone and last for ages. My first tin whistles were Waltons and I've never looked back. Well thanks for reading my review. This is an all in all excellent book and I totally reccomend it for beginner whistlers.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "Very good self-teaching book for the beginner musician.If you don't know anything about reading music or are in need of a music reading brush up, this is the book for you. It starts with bare basics from note types, even naming the pieces of a note (head stem, flag) rests, time signatures etc, in easy to understand detail. The music progresses from absolute beginner to pretty involved intermediate arrangements. I wasn't familiar with a lot of the songs themselves but there were enough familiar songs, ie: Cockles and Mussels, The Wild Colonial Boy, Battle Hymn of the Republic, Loch Lomond, I Saw Three Ships, When Johnny Comes Marching Home, Irish Washerwoman, Amazing Grace, to keep it interesting.If you already read music and are just looking for sheet music, there are better books out there for that.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Great book for the beginner, but would recommend getting an accompanying CD as it would be quite helpful in learning some of the techniques described in the book. Sometimes it is helpful to be able to hear a demonstration of what is described, especially for the person who is new to the Irish Whistle.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "First of all, be sure to get a book that comes with a CD - I've found that to be super-useful.I looked at 3 books in this genre: \"Mel Bay You Can Teach Yourself Tinwhistle\" (1999), \"Mel Bay Fun With the Tin Whistle\" (1990), and \"The Penny Whistle Book\" (1992). In that order:(1) The guy who misspells the word \"beginner\" in his \"Mel Bay You Can Teach Yourself Tinwhistle\" review asks for \"finger charts or tablature for the songs\" - none of these books do that, but it actually does the best job of slowly and incrementally introducing musical notation.\"Mel Bay You Can Teach Yourself Tinwhistle\" has a fantastic incremental approach to learning in general as well - you learn a new concept or skill (a note, a technique, etc.), and then there are one or more exercises, usually musical pieces, that include the new concept and skills along with concepts and skills previously learned. Everything is clearly labeled, and the writing is clear, concise, and brief. Five Stars.(2) It's also basically and updated and expanded (twice as many pages) version of the older Mel Bay book, \"Mel Bay Fun With the Tin Whistle\", so I don't see why you'd want the older book, which I'm giving one star as I think they should just withdraw it from the market.(3) I find \"The Penny Whistle Book\" by far the worst of the three. It gets complex way too quickly. It's overly chatty, and focuses on the names of pieces, not musical concepts, so it's really hard to find anything you may have forgotten. For example, the fingering for C natural isn't shown until the middle of the book, and then only under the heading \"Cuckold's All Awry\", after a discussion of famous 17th century diaries. It has little genre variety. It tries to do too many things at once - history of songs, history of people, history of places, random artwork.It also shows putting your finger on the last hole as a requirement for some notes, which it is not - it's just to steady the whistle, which can be done with the pinkie when needed. On a lot of whistles, esp. non-key-of-D ones, if you do this you mess up the note; so unless you are only planning on playing a subset of D whistles forever, it's instructing you in how to ingrain a bad habit.There is no option to get a CD with this book, which is actually worse than it would be with the other two books, since many of the pieces are more complex and less well known. One star, although if you are only going to be playing Irish traditional music in the key of D, and already know what a lot of traditional Irish music is supposed to sound like, this might be the book for you.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "I decided I wanted to learn to play the Tin Whistle and purchased this book along with a Clarke celtic whistle. I have had formal piano lessons, but needed a review, since I hadn't played in many years. This music book is perfect for those starting out on the Tin Whistle. It has a nice collection of tunes and very easy to read as well.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "baroque music style and performance",
        "description": "Describes how Baroque music was performed and appreciated by its contemporaries and suggests choices of tempo, rhythm, ornament, and accompaniment for modern performances",
        "authors": "['Robert Donington']",
        "infoLink": "http://books.google.nl/books?id=esNueLupa1IC&dq=Baroque+Music:+Style+and+Performance&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a good source to get anyone started on their way performing in a \"period\" manner. The only drawback is more recent research and advances in style make large portions of this book seem dated and even quaint.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            },
            {
                "review/text": "I bought this as a text to a class on Baroque Performance Practice. Along with brilliant lectures from my Professor Dr. Timothy Howard, this book was exactly what it took to bring a rounded, informed, and accurate base on which to interpret my Baroque repetoire. Highly recommend, the beginning and end of Baroque interpretation.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "Self I'm guitar player and baroque music lover. After I started to read (study) Donington's book I was surpised how bad and wrong I was playing Bach, Kapseberger, Sanz, Murcia and other baroque composer. And I have conservatory studies!!! Even tecnichal problem with the instrument has been solved. It is so important to know how to frase well in order to make the playing enyojable. The book also gives you a lot of literature to continue digging in the baroque era. You just want to know more and more. Nothing better to discover that you really don't know anything to let you feel the hunger of knowledge.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the phantom of the opera piano vocal selections",
        "description": "(Easy Piano Vocal Selections). 15 easy piano selections, including: Alone at the Drive-In Movie * Beauty School Dropout * Born to Hand Jive * Greased Lightnin' * Look at Me, I'm Sandra Dee * Summer Nights * We Go Together * and more.",
        "authors": "['Andrew Lloyd Webber', 'Bill Boyd']",
        "infoLink": "http://books.google.com/books?id=SspXLwEACAAJ&dq=The+Phantom+of+the+Opera+-+piano+vocal+Selections&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The book is great! however, I do think it is a book for more advanced piano students than what I was hoping for. I had gotten the book for one of my piano students who loves the musical, but she would only be able to play a very few of the songs even though she is in Level 5 of Alfred's. I decided to give the book to my married daughter to enjoy instead and found a couple of the selections in an Alfred's level 5 piano solo's book to give to my student. I do wish these music publishers would let us have a look at the music before we buy. That would certainly help to let the buyer know if it will be challenging, just right, or too easy. I agree that the bass clef was a little boring, but you can always improvise. For those of you who aren't sure, let me tell you that most of the songs (not all) have 4-5 sharps or up to 5 flats. \"Think of Me\" starts off with 2 Sharps, then moves into 3 flats. \"Angle of Music\" starts with 2 flats, moves into 5 flats, then back to 2 flats, moves to 5 sharps, and ends with 2 sharps. This gives you a good idea how the songs move throughout the book. If you like a challenging book, then you will enjoy this one--unless of course you are a concert pianist--then look for one with more difficulty.",
                "review/helpfulness": "70/70",
                "num_reviews": 70
            },
            {
                "review/text": "I'm a huge Webber fan and was playing music book collections of his music back when I was 13. Well, when the movie came out, I took a chance that the sheet music will have improved from his earlier collection and it indeed had! The songs are richer plus all of the major songs are available. \"Angel of Music\", \"MotN\", and \"Wishing You Were Somehow Here Again\" are probably the most beautiful.As for my meager complaints.. I still await a really complex release of these songs. I only found myself struggling with one song in the first day that I got the book. The biggest complaint I have in reference to this is the simplistic left hand. In the old and newer arrangements of these songs, the left hand often has to resort to lazily hitting one note. I know something more complicated could have been done with the left hand.But then... if you are advanced enough to complain about the difficulty of this book, you should be advanced enough to ad-lib in your own improvements to the music. And, really, even John Williams' arrangements are at this level of difficulty, so I may be hoping for arrangements that are rarely released by any movie/musical composer.So aside from those small complaints, the music is just beautiful in this book... the way you play them has a flow that reminds the player of how it is sung, entrancing. I highly suggest it to piano-playing fans of PotO.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I bought this for my wife and here is her review of the book:I consider myself an intermediate piano player. I absolutely love this book and can't help coming back here to write a review for it. This book is actually much easier than I thought. I can start to play mostly by sight reading. The hard part maybe the frequent key change and some parts have lot of flats, but it is not really difficult as it appears. The book also includes some scenes from the movie. It is nicely arranged and the paper is of good quality too.I enjoyed very much while playing the music.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "After reading the other reviews, I was a bit hesitant about ordering this book. Although I took piano lessons for a year, I am, by and large, self-taught.Some of what the other reviewers said is true. The left-hand is quite simplified. However, it does remain fairly true to the original cast recording, so there is something to be said for that.Although some of the songs do change keys quite frequently, (and to keys with multiple sharps and flats!), they were easier to play than what I expected -- I just play all of the black keys and forget most of the white ones, lol! So don't let all the talk about sharps and flats deter you. I can actually play most of the music in this book -- and reasonably well :-). There are only one or two small sections where I do struggle a bit, but what's life without a few challenges? The simplified left-hand might just be a blessing in disguise here for those of us who are less-than-accomplished pianists but who still want to enjoy playing the music from \"Phantom\".",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "This collection is superb. It contains three songs not included in the Original Broadway sheet music (Learn to Be Lonely, Journey to the Cemetery, and The Fairground) as well as all of the main pieces from the movie. Great pictures and information about the movie as well. The music itself is advanced, but well worth learning. I definitely recommend it to Broadway fans!~Hillary Rose",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is not the \"simple\" version, though with practice, it's not too difficult. I would not recommend this book for a beginner; but for an occasional player, the music is easy enough to call up on occasion. The songs don't have that 'empty' sound like many songs transposed from orchestra to piano and, in my opinion, you could play them for an audience and receive applause.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I have dreamed of this music at least for ten years. In the night of New Year I saw the movie in TV and after that I started to look for the sheet music. This one seemed to have the most complete selection of songs with the piano accompaniment and nice photos from movie. I am very much pleased with this book.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "At first I had difficulty playing some of the songs but once I got the hang of it I couldn't stop for me it was like watching the movie or listening to the soundtrack and it was alot of fun to learn to play the songs that capture the love of millions!I would reccommend this book to more advanced pianists, if you are a biginner try the easy piano vocal selections. But I promise you won't be disappointed.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I played piano for nine years, then quit for a year and a half because of lost of interest. After seeing the movie a few times, I decided I wanted to play the music. I ordered this book and now I am learning to play them. It is a little hard since this is advanced, but I am getting it. This book brought me back to music. I applaud Andrew Lloyd Webber.Amanda",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This is the piano folio to the 2004 film of \" The Phantom of the Opera\", based on the Musical of the same title by Andrew Lloyd Webber and Charles Hart ( with additional lyrics by Richard Stilgoe). The notation is the same as it is in the Phantom of the Opera piano vocal book to the stage musical ( with the logo white mask on the cover and the shattered glass looking title lettering). There are a few differences though. 1 This book contains photos from the film instead of the show. I can't recommend one or the other both are beautifully photographed so that part is up to you which you like better and would rather buy in a piano book. 2 While the arrangements are the same, the font size is slightly bigger in here which makes it easier to read. A big plus for this edition. Also, in Prima Donna raoul's line \" Christine spoke of an angel..\" is included in the music. 3. This version contains three new pieces written by Andrew Lloyd Webber solely for the film version.The Contents areThink of Me, ANgel of Music, Phantom of the Opera, Music of the Night, Prima Donna, All I Ask of You, Masquerade, Wishing you Were somehow Here Again, Point of No Return, Journey to the Cemetery, The Fairground, and Learn to Be Lonely.A note on the pieces themselves. The skill level at least is late intermediate to advanced. The songs change keys frequently and can be quite difficult in to that extent, or if they dont' change, the keys that they are in already can be challenging.A run down of the starting keys per tune ( and to let you know if there are key changes at least, since going through all of the different keys one by one can take a while. )Think of me, Dmajor, that is 2 sharps....... key does change mid way throughAngel of Music B flat Major, two flats........ key changes a few times so be carefulPhantom of the Opera, D minor, 1 flat....... key changes several timesMusic of the Night, D flat Major, 5 flats...... key changes throughout between D flat and E majorPrima Donna, C major ................ key changes midway through, but not difficultAll I ask of You, D flat Major..........NO KEY CHANGESMasquerade, C major ........... Changes keys through out. can be tricky but do able with practiceWishing You Were Somehow Here Again, G minor..... Changes throughout but not hard.Point of No Return..... A minor.... starts in a minor but changes to F minor. key changes throughout as wellLearn to Be Lonely, B flat major, 2 flats..... changes a few times throughout the songThe two score pieces from the film are written in \" C\" that is, no set key, but rather have sharps and flats throughout as they are needed. This aspect can make them a bit complicated first for the intermediate pianist, but with practice its possible to get it down. On the whole I recommend this book over the broadway one just for the three new pieces by Mr. Webber. As for photo selection, if thats the deciding factor between which book to buy, then thats up to the individual pianist.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "theory of harmony",
        "description": "A new critical foreword by Walter Frisch, H. Harold Gumm/Harry and Albert von Tilzer Professor of Music at Columbia University, expands this centennial edition. Frisch puts Schoenberg's masterpiece into historical and ideological context, delineating the connections between music, theory, art, science, and architecture in turn-of-the century Austro-German culture.",
        "authors": "['Arnold Schoenberg', 'Walter Frisch']",
        "infoLink": "http://books.google.nl/books?id=pdDsQQAACAAJ&dq=Theory+of+harmony&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "No...Schonberg's Harmonic works are not where anyone should start when trying to learn standard western harmony. Let's get that out in the open first. You should not read this book as a way to learn the rules of figured-bass style harmony. For that, better to read Piston. This book is a philosophical tome. As such, it is verbose, but it is also extremely instructive, mostly for the composer.I first read the Theory of Harmony as a grad student. My composition teacher suggested it. (He was always correcting my chord spelling in ways that didn't make sense to me, until I read the Schonberg.) This book opened me to the &quot;mystical&quot; side of harmonic theory. It also was a great clarifier on the relationship between harmony and counterpoint in voice leading. And, most harmony texts really are based on the rules of Rameau, which amazingly work up until the post Wagnerian era, when they begin to break down. Schonberg's work is the best examination of post-Wagnerian tonal harmony that I've come across. So to me, this is more than an historical artifact, it is a useful tool for the experienced composer. But definately not for your usual undergrad!",
                "review/helpfulness": "69/71",
                "num_reviews": 71
            },
            {
                "review/text": "I have read most reviews below...and I find most of them incomprehensible. Someone compares Shoenberg's Treatise to the Treatise by Rameau,for example. A rather irrelevant comparison,because both books have their area of undeniable expertise. How do you compare a book about building a Ferrari and one about building an aeroplane? They both talk about aerodynamics,but there are differencies,I think!Then there is the person that finds the book very hard to grasp. Well,I doubt this is Mr. Shoenberg's fault!This is a books about CLASSICAL harmony! It seems that nowadays people playing popular pop or doing songwriting or jazz-rock fusion guitarists (nothing wrong with any of this ) think,for some strange reason, that Shoenberg's book is actually a whatever course of harmony and because he was so open-minded and wide ranging,that actually anyone after learning a Beatles song just starts on Shoenberg? Or that in the book the technique of 'atonality' is taught ?No,no....there is some very real confusion here. Not many people know that Shoenberg practiced and learned the traditional techniques in an amazingly diligent and through way for years....incredibly hard work. On his own! The 'serialism' part it's entirely his own quirk and style,and it is not the main point in this book...it's only people that see it this way. It is basicly an assumption.So basicly,if you want to fly,learn to run properly on your own ground first. That is the philosophy,and this is exactly what he does in the book: he starts and progress VERY logically. Some people may be puzzled ,but again,if you dont understand,well,read it 'till you do. Do not forget that Shoenberg had unsurpassed experience in teaching ,and that he started teaching in universisites WITHOUT the help of titles or master degree's but ONLY because of his SKILL.And that has to be kept in mind too,so,if they appear ramblings,I am sorry,it's only laziness on the part of the student. Sure it's not easy to keep pace,but if you do,you will be rewarded.If anyone actually STUDIED seriously even part of the book,he would realize that ,in fact,this is exactly what Shoenberg says:''I bolt the door against the bravado which would like to burst in absolute disregard for the rules. I bolt the door by developing his sense of form,according to the rigorous old rules.''The people that say that 'it's not a textbook' ,dont know what they are talking about. This is a course in harmony prepared by a real artist,a real composer,not by an historian,not by a teacher in a university,master's degree or otherwise. You make out of this whatever you want. Of course I am not saying that the other people are bad ,or good. I am only saying that this book was written by a real composer,not by a theorist. He just happened to study most major harmony texts and compose in his mind for 14 instruments while going for morning walks!People who think of his book as having a place as a theorist treatise did not really know the book in question.This book was written for people that want to learn about harmony. Very simply. But not to the extent that a guitarists may really study it on guitar! Otherwise,as some reviewer mentioned ,it will not be understood why Shoenberg calls a first inversion chord a 'sixth' chord. This is classical method,Rameau for example calls it the same way. It is simple: because the bass ,being in first inversion,forms a sixth with the root above it.It cannot be studied by a guitarist if that guitarist does not know the difference between a root and a bass note. In popular music it's just the bass,but not in classical.I am about halfway the book,and no,I did not read it,I am STUDYING it.That is an ENORMOUS difference. Some people said that they read it...or worse,studied 'a couple of chapters,and then read the rest'. I STRONGLY doubt that you will get much from that book in this way. That is just superficiality and laziness,let's be very clear about this. Again,this is hardly Mr. Shoenberg' fault.You will better off by not even starting on it.To me he is a unique teacher ,musician and artist. I am learning A LOT from his book,and I am grateful he took so much time and patience to write it down. I really like his book,even going so far as being very honoured that I actually study a book written by such an intelligent artist ,musician and teacher. Someone mentioned that he calls the student of the book 'pupil' as if it's a strange,unnecessary thing....I fail to understand why,I would not really be interested in knowing why either,since the book is a complete course in harmony,if not ,infact, a much better one than even the university one. I feel honoured that he calls the person that decides to study the book, 'pupil',and I only hope I will work even much harder than I do.It's no-one business if Shoenberg viewed harmony in his own way,he does not have to excuse himself for lack of superficiality or laziness or personal idea.If you want the book that teaches you modulation in a couple of ways only,then, by all means 'Theory Of Harmony' was definitely not written for you. By all means buy another book.But ,if you want to became an EXPERT about modulation,then start eating it! It's up to you. Shoenberg it's not making it simplistic for you. But it does not ,ever ,makes it difficult or superficial.You do not care about the roman empire,fine,but just so you know,Shoenberg was a very cultured person,and he really cared about self-education,musical independence and independence of thought. He knew people like Strauss,Mahler,Brahms,Goethe. He had amazing musical and pedagogy skills. He was a famous and controversial composer from Vienna,and,quite frankly,I doubt that anybody here has even a right about saying what's best or not about him,and I refer even to master's degrees owners here,simply because you cannot be taught such independence in in any school;as Bruce Lee said 'All real knowledge it's ultimately SELF knowledge'. You will not be taught that in any music course,Shoenberg is a real master because his wish in his books is not to create students or historians or theorists,his hope instead is to create creators.Someone here even said that 'it's not a textbook' ; 'it's a supplement'. I do not think those people understood much about the book. Those are just pretentious assumptions of people who just box the book into a narrow category,and the job's done.It's funny,but I do not find Shoenberg's book difficult. I have bought it because I wanted to teach myself CLASSICAL harmony. And believe it or not, I learn more from it than going to a music college. Yes,I say that without any doubts because I actually went to a college ,and as I was studying BOTH the book and at the college,I found I was really MUCH better off with the book.I must say that at the very beginning,I too did think the book was hard and complex and had 'too much philosophy' in it,although I did think highly of it from the start,and never actually went as far as defining Shoenberg's thoughts 'ramblings'...it may appear so only to superficial and green attidudes. Someone with a penchant for doing things quickly rather than throughly,maybe?There are other misundertandings,I think,about the book,for example the fact that most people do not really know that this book is about TRADITIONAL harmony ,not a manual that makes of a total ignoramus a 'serialist' in a couple of months.It's your choice...but one last thing I will say; I have seen concepts such as modulation and many other treated with such amazing detail ONLY in this books. I have bought many others,including Rameau,C.p.e Bach,Piston,Kitson,Lovelock and others,but I will stay with this one because it teaches in such detailed way.I recommend it highly,very highly,but only to people that really want to create ,not to historians or 'theorists'. I respect all of them ,but to me Shoenberg is no mere historian.So,if you have courage and true dedication,buy this amazing book and go slowly,but actually start it and make sure you keep going. I think it is amazing just as the other books by the same Shoenberg....they are all keepers as far as I am concerned.",
                "review/helpfulness": "46/60",
                "num_reviews": 60
            },
            {
                "review/text": "Schoenberg is willing to reconsider and rethink every aspect of traditional music theory. It's too bad his conclusions are almost invariably wrong, but this book will help you reconsider and rethink traditional music theory yourself--and come to your own conclusions. Also: this is much too unwieldy for the classroom; use Robert Ottman's texts instead. I recommend as well PENTATONIC SCALES FOR THE JAZZ-ROCK KEYBOARDIST by Jeff Burns--for theory and for practice.",
                "review/helpfulness": "31/43",
                "num_reviews": 43
            },
            {
                "review/text": "Overall, I would rate this book as &quot;good&quot;. It starts out by presenting basic music theory and even goes so far as to explain WHERE it all comes from (which many other texts do not (explains overtones, how they are created, and how they were used to create scales)) which I found fascinating. However, the book is more useful for historical purposes than for actual learning of music theory/harmony. It was written by a master who completely rewrote the way we thought about music and it is fascinating to see his thought process as he came to these conclusions. However, the English translation is not really very well done, often making it difficult to follow, and the writing tends to ramble on for pages and pages at a time often making me wonder &quot;what exactly is he talking about?&quot; midway through page 5 of the same extended paragraph. Also the examples tend to be very confusing and the rules regarding chord resolution, etc. are not presented clearly.If you are interested in Schoenberg's ideas about twelve-tone music, etc., and already know at least a fair amount of music theory, this book may be an interesting read. Otherwise, I'd recommend one of Kostka's texts, as they are much more clear and concise.",
                "review/helpfulness": "22/28",
                "num_reviews": 28
            },
            {
                "review/text": "This book is a must for a musician.It is not a textbook. You need another standard one for this purpose. But it is essential as a companion, if you want to UNDERSTAND the reasons behind the rules. And you better read it in parallel with a standard textbook.Schoenberg starts from the most ancient sources to the most modern and EXPLAINS everything! You are his pupil because this book was written for his real pupils. (And btw a 6th chord is a 6th chord for every classical harmony manual...).I agree that sometimes some digressions may be questionable and some &quot;rules&quot; are introduced and then eliminated in a questionable way, but he is undoubtely an artist, and this book reflects it. The way he explains, for instance, the minor mode is unsurpassed.You can't break harmony rules if you don't know what's behind them.AMM",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "I think not.Schoenberg's theoretical approach is not the approach accepted as as standard in American music schools. He was an independent thinker. In this reviewer's opinion, Schoenberg was right.I would not recommend this volume as a primary textbook for the study of tonal harmony; it is too rich and complex for that, and undoubtedly way beyond the reading level of most college undergraduates. Schoenberg's thought is subtle and elegant to a degree rarely found in books of this sort.I would recommend this volume to anyone willing to dig more deeply into the subject than is done by most three chord pop musicians or Schenkerian purists, but it takes time and patience and an open mind as well as a firm command of complex sentence structure. Schoenberg does not provide the reductio ad absurdam desired by many.This is one of the most important books ever written on the subject of music theory. It is essential reading for any serious student of early 20th century tonal music.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "Schoenberg presents a systematic method for learning/teaching traditional harmony. He gets into fairly advanced levels of harmony, but does not really get into 12-tone composition, except fleetingly toward the end of the book. You have to remember that at the time he wrote this, he was still only beginning to work out his ideas about serialism, and all his works prior to and surrounding the publication of this book were still written in his earlier harmonic style. One of his major premises is that it is necessary to the _craft_ (a very important word) of music to be intimately familliar with the older ways, because it guarantees the ability to at least write music of &quot;established effectiveness.&quot;He leads the reader from scales and diatonic triads, through modulations and diminished chords, and into &quot;wandering&quot; non-diatonic chords. He does not have the student realize figured bass lines, or harmonize chorales, and he goes into great detail describing the fallacy of these teaching methods. Rather, he has the student composing from the outset, manipulating musical materials in a manner more like the act of &quot;real&quot; composition.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "I studied this book as a popular music writer when I was younger. The book was very difficult to grasp in the musical sense. What kept me reading it was the philosophical overtones to the book. Upon becoming a student of philosophy I realized why I had liked the book so much. Shoenberg defines \"the enlightenment\" in historical terms. His thinking is fresh and lucid, although he rambles. It is the ideas that jump off the page not his clarity in expressing them. Today he may seem \"old hat\" but for the time his willingness to question the past and invent anew were revolutionary.Musically, I gained a tremendous amount from the book. Again I was very young and the music was simple in relation to \"classical\" pieces, but I did learn 4 part harmony that worked and was a little different sounding. I ended up writing a few songs from the material that were well received (within my circle of friends). So, for people just intested in playing around with music, you may find something of use. It is terse however. I only studied a couple of chapters, it took me about 40+ hours of intensive reading and note taking to get anything out of those chapters.I did read read the entire text of the book for the philosophy and that is much easier, although still difficult.I am certain there are better ways to learn what I did from the book (musically). Nevertheless inspiration can come from strange places. Maybe it is worth a shot for you.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "It is historical book in theory of harmony area. The author wrote detailed explanation about each theory. All harmonic theories are expained in structural and systemic concept. All theories are constructed on the properties of frequency of sounds. I astonished at the systemic, logical explanation about the theory of harmony. The author wrote this book for the his students of composition lesson.The author, Schoeng is the representative great real composer of twenty centry. It is well organized relatively to other text. It attach great importance to not only theory but also practice method of composing. The most superior stuff to other text is, reader will learn how to compose music by only following the text even beginner. It will be suitable for beginner, advanced student and teacher.I strongly recommand this book if you have no chance to consider the ground of harmonic theory. Tis book will give the answers to you why many harmonic rules and theories must be! such like that.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Walter Frisch writes in the new foreword to Schoenberg's Theory of Harmony that it \"should be required reading for everyone interested in Schoenberg, in the history of harmonic theory and practice, or in the Austro-German culture of the first decades of the twentieth century\". It is hard to disagree with such a statement, but it also delineates clearly who such a book should be relevant for.I have to agree with the many writers who have already pointed out that this book, while not entirely unsuitable as a harmony textbook even today, is eclipsed by newer textbooks. I used Piston's Harmony book for learning purposes, but even that one is to be considered almost as old as Schoenberg's book these days; I don't know how the newer books are, but judging from the number of releases during the last decades there has probably been quite a bit of innovation even in such a field. The harmonic language described may not have changed much, but pedagogy definitely have. I therefore cannot wholeheartedly recommend this as a theory book for novices.What is left, then, is an enormous amount of philosophising about the nature of the rules of tonality, and how they came to rise. Schoenberg himself says that he is a composer, not a scholar, and many of his ideas do, indeed, seem to be taken out of thin air. His thoughts on parallelisms seems particularly pitiable today, but historical benevolence must be granted: In the hundred years since the release of this book an enormous amount of information regarding medieval and renaissance composition and performance practice has been uncovered, things Schoenberg could not have known. For a mere mortal it is of course consoling to see that even a giant like Schoenberg could be so wrong when he acted on his intuition. The book is therefore somewhat flawed when it comes to explaining the philosophy behind common practice harmony, which is the field where this book seems to get the most respect.In the end, the book's value comes from the fact that it is written by one of the pivotal composers in music history, and gives us a window into his thoughts. I realize that many reviewers state that the book had ignited their interest in harmony, or even composition, an interest previously dulled by more succinct and to-the-point textbooks. I can definitely sympathise with this view, as the book gives a lot more food for thought than your average harmony book does. On the other hand, it has always been my opinion that people who are easily bored by textbooks are so because they are unable to think of it's larger implications and possibilities. Unused is probably a better word that unable, because it certainly is possible to learn. And while one should not scoff at this book in that respect, there are many roads to Rome, after all, it is in a way dangerous due to the fact that Schoenberg's opinions may be taken as fact. Of course, it is a good and thought provoking read, but it must be read as a hundred year old book, that is, with the benefit of hindsight.In that respect I would have wanted (and sceptically hoped for) a new edition where we were explained, in linear notes, where Schoenberg goes wrong in his musings on the history of theory, and, to the degree it is possible, which contemporary sources (in the broadest sense of the term) made him do so. Alas, such a thing was not to come for the 100th anniversary, and one is therefore left wondering whether it will ever come. Frisch's foreword is interesting, but not exciting enough to warrant buying the new edition, and I can't find any noticeable differences in content between this edition and the earlier one from my university library, save the introduction by Frisch. So while the book is primarily for those interested in Schoenberg it could have been made more useful by a thorough questioning of Schoenberg's claims, but unfortunately it doesn't look like anything like it is in the horizon.I feel a bit bad about giving three stars, especially since the new binding, though paperback, is very nice, and the print is as good as anything out there. But the bottom line is that this book is useful, but for fewer people than one might presume. For the present day reader I find it first and foremost about Schoenberg, like Frisch.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "the peanuts illustrated songbook",
        "description": "(Piano Solo Songbook). This coffee-table quality songbook is a celebration of the art of Charles Schulz and the music of Vince Guaraldi. Within its stunning full-color, high-gloss pages are: an introduction by veteran music journalist Hank Bordowitz, which provides background on how the Schulz/Mendelson/Guaraldi collaboration came to be, and reflections from fellow musicians influenced by Guaraldi's music; and piano solo arrangements of 30 terrific tunes, each featuring a Peanuts illustration by Schulz. The songs include: Baseball Theme * Blue Charlie Brown * The Christmas Song * Christmas Time Is Here * Freda (With the Naturally Curly Hair) * Happiness Theme * He's Your Dog, Charlie Brown * Linus and Lucy * Oh, Good Grief * The Pebble Beach Theme * Peppermint Patty * Red Baron * Schroeder * Skating * You're in Love, Charlie Brown * and more. This book will be an absolute treasure for any Peanuts or jazz fan!!",
        "authors": "['Vince Guaraldi']",
        "infoLink": "http://books.google.com/books?id=xY05AQAAIAAJ&dq=The+Peanuts+Illustrated+Songbook&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is great in three ways: First, the music itself is first rate. The arrangements in the book are the real thing and are quite a bit more difficult than the \"easy\" piano versions. Second, there are great-looking comics on most every page, which makes it a joy just to look at. Lastly, there is a lengthy history of Peanuts and how Vince became involved with it.The only aspect keeping this book from a 5 rating is the binding. The book wouldn't lay flat on the piano, which made it practically impossible to play. I brought it to Kinko's and got it spiral bound for about $4, and now it works great. Poor thinking on the publisher's part, though.",
                "review/helpfulness": "67/69",
                "num_reviews": 69
            },
            {
                "review/text": "I've just received this today and it really is beautiful to look at. But I do wonder why they had to print every single page of this book on glossy paper?It seems like it would be much less durable than regular paper over time, and more prone to smudging and fading. This special paper requires extra careful handling, so don't even think about going near this with unclean or greasy fingers unless you delight in seeing great black finger streaks across your music.Also, since the pages are so glossy and thick, it is impossible to open this book at the piano without it snapping shut in your face. I usually prefer music books bound this way, because spiral-binding destroys paper edges faster, but I really cannot open this book to a particular song for more than 2 seconds, even when I try to hold doewn the sides with heavier books.It's a great value anyway, and I'm probably just being overly anal about the glossy pages. This is the only place you'll find some songs, such as \"Thanksgiving Theme\" and \"Frieda with the naturally curly hair,\" so you might as well add it to your music collection.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            },
            {
                "review/text": "Where to start? First, Vince Guaraldi was a great talent and our real loss is the wonderful music he would still be producing today.Second, his Peanuts work is one of the main gateways to jazz for today's young minds. I don't know where the music would be today without the fans he introduced to it.Third, Fantasy Records, who release his CDs, does an abysmal job in preserving the Charlie Brown musical legacy. Each and every CD they release is a slap-dash affair and dishonors the creators. \"Oh, Good Grief\" was less than 30 minutes long! His son should kick some butt. Just had to get this off my chest.Finally, this music book is a delight! It's comprehensive and lovingly presented with colorful illustsrations. Most selections include transcriptions of Vince's jazz solos, grace notes and all. And the harmonies seem to be complete and error-free. (I really like Vince's use of the 13th chord with the flatted 9th.)I did the same as the previous reviewer and had the book spiral bound at Kinko's. One star deducted from an otherwise excellent product.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "Moderately easy to intermediate difficulty; reasonably accurate interpretations. Since it's not easy to find anything but simple sheet music type arrangements of these pieces, this folio is well worth the money. The introductory essay is excellent.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This full color book borders on a coffee table work with a soft cover: It fuses Peanuts history/trivia with classic illustrations and, of course, sheet music. The illustrations are beautiful, the coated paper is of high quality, and the arrangements are closer to the originals than anything else I have found on the market. Any Peanuts fan would love this book, musician or not. As for the reviewer complaining about the binding, this is your standard perfect book binding that also appears on other music books I own. I can foresee that it is unlikely any serious Peanuts fan will want to mark this fine book up, in which case photocopying the desired portions is one way of keeping it in pristine condition ---- and a solution to the fact that it isn't easy to keep the book open short of \"breaking it in\" or using an M-shape page holder/book clip.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Excellent note-for-note transcriptions of a wide range of tunes. Fun to play and fun for kids to hear. Others complain about the glossy pages, but if you bend (break) the spine, the book stands up no problem.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "learn to read music",
        "description": "A study of the fundamentals of reading musical notation that will teach the reader to read music in 4 hours",
        "authors": "['Howard Shanet']",
        "infoLink": "http://books.google.com/books?id=g1DGB-XaWI4C&dq=Learn+to+read+music&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is THE most useful book I've purchased and read on how to read music so far. I have just started learning to play the violin (I am in my mid-40s)and although all my life I've sung and music is, and has always been, a huge part of my life(many of my family members are accomplished musicians)I've never played an instrument or had any formal musical theory training. This book is the reference I have gone back to again and again as I progress with my violin and I have questions or areas that aren't clear to me (such as the concepts of major and minor scale, flats/sharps/accidentals and how they came about). . not only does this book take you from the very basics to the complex, Howard Shanet takes the time to explain WHY certain things are the way they are in written music. I was struggling with some concepts and when my teacher explained them to me I didn't get it....I looked it up in a smaller book on music theory and the explanation was there but I still didn't quite get it . . and then I looked up the subject (this happened to be accidentals/flats and sharps and also time meters) in this book and because Howard Shanet explained why sharps and flats are written the way they are, I was able to understand the concept and work beyond it. Just an excellent book and I recommend it to anyone learning to read and play music. It is true, this book will not teach you how to play any instrument, BUT without the basics and theory in this book it would be very difficult for me to progress with my violin playing. Highly recommend it.",
                "review/helpfulness": "145/146",
                "num_reviews": 146
            },
            {
                "review/text": "This book is a gem for any adult interested in teaching themselves the fundementals of reading music.It lets the reader teach themselves by presenting examples to be solved and then explaining the solutions with painstaking detail and clarity.The examples proceed in a logical order; commencing soley with reading rhythms, then soley reading pitch, then finally combining rhythm and pitch into melodies to be analysed and played at the piano.The chapter on explaining the concept of tonality is masterful.The examples are plentiful, and over time (in my case about three months of 5 to 15 mins per day), are meant to instil the basic skills and confidence you need to acquire to read single note melodies by sight. As Shanet points out, and very accurately from my experience, the examples must be done, not glossed over, because one learns to read music by doing it, not only understanding it or reading about how to do it.What the book won't do is teach you how to p! lay an instrument although the basic examples at the piano provide a solid foundation from which you can go on to learn any instrument with much more confidence than you might have otherwise.The language is clear, though sometimes wordy (it was written in 1958 and so does reflect the language style of the day).I feel that Howard Shanet has a real appreciation of the problems people face when learning to read music and has successfully written a text that works.In my estimation, a classic educational text.",
                "review/helpfulness": "138/140",
                "num_reviews": 140
            },
            {
                "review/text": "Though there is no substitute for one-on-one teaching, this book gives a very good introduction to the fundamentals of learning to read music. It has very thorough explanations on musical notation and offers many useful activities to build one's skill.Upon finishing this book and its exercises, you will not have learned to play an instrument. What you will have gained is an understanding of how to read the notes and symbols on sheet music, which will be extremely beneficial to your musical development.",
                "review/helpfulness": "50/50",
                "num_reviews": 50
            },
            {
                "review/text": "I bought Howard Shanet's book about 15 years after I had been playing guitar for 10 years, and after a short flirtation with the violin.Although I had learned to play guitar quite well during that time, and although I had managed to fake my way through playing violin in the school orchestra when I was a teenager, I was frustrated by not being able to read and write music well.In the following years, I bought numerous books - most of them guitar books with chords and guitar tablature which I understood fine, and others books on how to read and write music, which I found confusing, complicated and frustrating.Despite progressing to writing and playing songs, and playing in bands, I resigned myself to thinking that I'd always have to rely on a combination of a tape recorder, chord symbols, and my own quirky form of notation in order to write down the music that I wrote.Finally, I found Mr. Shanet's book, and it explained all that I had been confused about in clear, simple and enjoyable ways. I do think that people are right when they say that learning the mechanics of music (notation etc.) is related to mathematics; a subject that I have always failed miserably in, and that's where Mr. Shanet's book excels - he explains all of this in simple terms.Just to be clear about this, I have a pretty good sense of rhythm and timing, it's just that I could never write it down in standard musical notation, nor could I read it very well.The whole process of counting from, and writing to, paper was too complicated a process, and no other book had ever unlocked this process for me until I found 'Learn to Read Music'.Another book that I found recently that seems to use the same kind of approach, relative to learning the piano, is 'Play Piano in a Flash' by Scott \"The Piano Guy\" Houston.I cannot recommend 'Learn to Read Music' highly enough. Don't be put off by the fact that it was published in 1956: it is a gem and a classic, and I hope that Howard Shanet is still around, and is aware of the wonderful contribution that he has made to music education.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "This book is very great to people who want to read music. You can learn about rythm, pitch and a little more. For those who want to learn (or teach) in an easy and fast way. Good for beginners and teachers.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "It has all the basics, so it's a good introduction to music notation. For those who forgot some things about reading music, this a good reference book to keep in your house. I strongly recommend this book.",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "If you want to quickly learn to read music and have a clear idea of every kind of musical sign, this book is REALLY helpful.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is an interesting, complex, detailed, authoritative, little book that promises 1. In two hours you can read it through and understand the principles involved in reading music and 2. In an evening you can learn to read practically any melody and pick it out on the piano. Amazingly, 1. and 2. worked for me. What worked for me might also work for you. Why not give it a try? Howard Shanet, the author, is more than qualified to teach music as he was a professor of music at Columbia and the conductor of that university's orchestra. But more than music, he knows the ropes through years of experience teaching this subject and actually makes learning easy and fun. In part I, he deals with the all-important and often neglected topic of rhythm and in part II, the important elements of pitch. It all boils down to when to play and what to play. Right? In parts III, IV, & V he puts rhythm and pitch together and introduces the elements of tonality. Along the way, we get brief asides on music history that help fix our memory. Since he explained the bass clef, I shall never forget where it came from and why in shows where F is on the written sheet. Can you guess why time was considered the perfect time in the middle ages? Something to do with the trinity? You bet. For better results, you should do as I did: work the problems and exercises with a piano so that you can see, feel, and hear what the text is talking about. Actually touching the keys makes all the difference and works lots better than the author's suggested tapping and singing. Despite some key signatures that are blurred and poorly printed, and two mistakes in the answer key on page 169, and the failure to give out the quick and dirty secret for reading any key signature (explained in Piano for Dummies)+, this little gem of a book is highly recommended for novices who need to learn the basics and previously experienced people who need to refresh their memories after a long absence from the keyboard. Also suggested: Paul Hindemith's Elementary Training for Musicians and Blake Neely's Piano for Dummies.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I already had a very simple understanding of music theory, so some of this stuff I skimmed over, but within the first few pages I learned things that immediately opened my eyes and my mouth in amazement. I found myself several times saying aloud, \"So that's what that means!\" I was ready to give up on singing in my church choir, but now I feel much more confident and am ready to resume with more vigor.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book was a well thought out approach for learning to read music for the absolute novice. I used the approach with great succcess in teaching my church choir to read music quickly. I highly recommend it!",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "the pop piano book",
        "description": "(Piano). This cutting-edge keyboard method is a total step-by-step approach to creating keyboard parts spontaneously. Rhythmic and harmonic concepts are applied in all keys, and are then used as a basis for developing specific solutions in rock, pop, ballad, funk, new age, country and gospel styles. Endorsed by Grammy winners, top educators, and Keyboard magazine.",
        "authors": "['Mark Harrison']",
        "infoLink": "http://books.google.com/books?id=-fcJAAAACAAJ&dq=The+Pop+Piano+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Keyboardists can use this book as well. The first part details basics (chords, scales, etc) real quickly (I guess experienced users wont need the basics in detail) The second part goes through genres specifically. (pop ballad, rock, r&amp;b, gospel, country etc)Parts are split up among accompanying and melody leading. A beginner with no background will have no idea how to use this book. It is not a manual, more of a reference book for popular piano styles. Not for beginners, for the experienced. There isn't too much text explaining things. More of it showing and the reader to understand, digest and improvise. So you need some prehand understanding.Excellent book no doubt.I do have complaints though. First the binding is terrible. My book's pages started falling apart very quickly. I needed to go to a publisher friend of mine who took it apart and rebinded it for me. I may have had to lose the pretty cover but now it is sturdy. Second the paper is made of somewhat heavy stock making the book itself very large and weighty. I'm sure this contributed to the book falling apart.",
                "review/helpfulness": "36/36",
                "num_reviews": 36
            },
            {
                "review/text": "This could be a very good technique book as well for people who want to learn popular piano if it is read and used carefully.He has an abundance of technical exercises in rhythm patterns, which is something that cannot be gained from Hanon, the king of technical exercise books.Many teachers are not very good at teaching popular piano, instead preferring to reinterpret it as classical music (which is not appropriate given its different rhythm patters and key signatures--often less complicated than those in classical). This was written by a man who teaches popular piano and has a very clear idea of the rhythm patterns that make that unique. For example: He makes extensive use of the tie line and syncopation in his examples of R&B;, which is what one finds in real music of this genre. But it is very hard to get that type of practice if learning classical songs.As it has been noted before, the binding for this book sucks. But there are ways to get around that.Also: This seems to encompass almost everything in other basic theory books that I have read/ own. It has actually obviated my other theory/ rhythm books. It will be a good saving of money to invest in this before any others.Finally: The book CAN be used by beginners (in tandem with learning some scales) if it is used as he recommends. He says in the opening pages that it was written/ designed to be used by people at myriad levels.",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "This book is really a great ressource for musicians who want to improve their style in pop ballad, gospel, new age music, ... I would advise it to anyone who already has some basic notion of how to 'fake' a song = interpret a song based only on a lead sheet (melody + chords), and who wants to go further. The author gives lots of examples, breaking them down in basic components, and analysing them. He gives hundreds of patterns of accompaniment (arpeggios, chord voicings, rhythmic patterns).A warning: the title 'The Pop Piano Book - A complete method for playing piano and keyboards in contemporary styles', is misleading. This book is definitely NOT intented for beginners. Rather for people who already have a few years of experience on the piano (correct fingering, and independance of hands), and preferably have some notion of note reading (although the purpose of the book is of course to be able to play music without having to read notes).",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "I have been playing the piano for over 13 years, mostly classical, more recently jazz and pop, but I've never been very pleased with my contemporary piano skills. Most books that teach the techniques of contemporary styles assume the reader has little or no playing background and don't progress very far beyond the basics, clearly not much help for the serious player.However, The Pop Piano Book is precisely the book I've been looking for!! This book is perfect for the intermediate or advanced player who aspires to be a master of contemporary styles. With this book you can learn how to interpret a song in numerous modern styles, and learn the subtleties that will demonstrate your total understanding and mastery of each style.The Jazz Piano Book by Mark Levine is my jazz bible, and Mark Harrison's Pop Piano Book has taken a place right beside it as my contemporary piano guide. It is phenomenal!",
                "review/helpfulness": "22/22",
                "num_reviews": 22
            },
            {
                "review/text": "I have had some 20 years of piano lessons/experience. Unfortunately, like many, I was only taught classical music and every attempt of my teachers of young years to teach some &quot;modern&quot; music failt due to the necessity of having to learn about the theory behind. Years later I find myself wanting to improvise, and alas, there are not so many good books to learn from!I already own a couple of books and recently bought this one. This finally bridges the gap which all the others could not! Harrison just tells you everything including some good tricks which would take some time for you to realise on your own! Ok, make yourself familiar with some basic theory first because I doubt you can find the necessary details here. Also, better get some technical skills, practise scales, Hanon, Czerny whatever. This remains important also in this genre! If you have the technical know-how you can really do without the MIDI files because you will be able to play it for yourself and get used to the sound he wants to create. Yes, and then it is totally up to you and make no mistake, this is serious brainjogging what you are asked to do! But I really think it is worth it and will give you some automatism later which will really pay off.What I particularly like about this method is that Harrison teaches proper voiceleading which I am missing in nearly all the other books. If you are an experienced piano player, you feel there is something wrong without the correct voiceleading. Here this is not the case. It is hard work but good fun and will hopefully give some good sounding results and finally the ability to improvise in the near future.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I've been working out of this book for a few weeks now and it's excellent. I consider myself an intermediate at piano, I'm completely self-taught and never taken piano lessons. I just got fake books and taught myself. However this book fills in a huge whole (for me). It gives patterns in different styles. So after completing this book, when I read a fake book I'll have lots of patterns to chose from.As the others said, this isn't a book for beginners. Someone with years of piano lessons can probably go right through it, whereas I spend 30 minutes just on a couple patterns. If you're a novice and don't mind spending a lot of time praticing, you can greatly benefit from this book as well.Finally, I purchased the MIDI files from Mark Harrison's website. I strongly recommend these if you're not a really good piano player. I mute each hand while playing the other while learning each hand. It's very helpful.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book is very helpful.Mark Harrison takes you through several styles of piano playing.In each style he starts with a sample song. It starts simply and then builds in complexity. Then he adds variations.This book fills a void in the market for people who need to know how to approach different styles and then gives them enough material to become proficient in each of them; not just knowing a few generic licks for each one.I can't give this book 5 stars because it doesn't include a CD. There is a CD available that you can buy from the author's website but these days it's very common to include a CD with the book- especially an expensive one. Plus there's a lot of references to the CD which makes you feel like you're missing out if you don't have it. I think the author should make the files available online for free. But that's just me.I have another gripe that is really my own dilemma and I wouldn't hold it against this book: The author offers very little in the way of insight. While you have a systematic breakdown of each style there's no simple overall view of each style. He never shows you any tips or tricks to understand the style you're working on.In short, the book is like a text book.Also you should know that without the CD and spending a long time on each style you should be a pretty decent player and reader to get results from this book.I'm OK and I felt like because my chops a so so the samples became tedious.This is due to my limitations and shouldn't reflect on the author but this is not a book for beginners.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a fabulous book for anyone who's interested in how contemporary music works-it's basically a fun, practical, and in-depth primer on popular harmonic and rhythmic styles; it is invaluable for anyone wanting to learn sophisticated and stylistically appropriate comping techniques. As someone who has spent a lot of time composing, improvising, and exploring music on my own, I find it tremendously empowering to be learning the conventional tricks and the conceptual framework behind those tricks.My only caveat would be that it may not be the best resource for people who are true beginners or who are scared off by memorization (effective comping, it turns out, requires a tremendous amount of memorization, and the first half of the book is devoted to getting you to memorize various scales and chords in as fun and interesting a way as possible). This isn't a book for people who just want to read music, and it has little to say about technique. But if you want to understand music, and you're willing to work for it, this book gives you a tremendous number of tools. Every musician who's interested in popular styles should have a copy!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is the single greatest influence on my playing. I've worked through a dozen piano theory books, and they usually focus on one aspect of playing. For example, I own books on quartal jazz voicings, 100 blues riffs, intros/turnarounds, reading from a fakebook, the jazz piano book, tons of runs, etc. Those books are great, but they don't provide a foundation to playing. They don't provide the ability to sit in with a band and jam in any popular style. This book lays down a solid and expansive foundation, upon which to build the more specialized structures.I've been slowly working through this book for over a year, and I'm probably 3/4 through it. I often laugh as I'm practicing, because I can't believe how good it sounds. I'd wasted a lot of time practicing without a guidebook, and never made much progress. In one sitting, I'm learning techniques that make me sound like I'd only dreamed, and never would have realized on my own.Don't be intimidated by the size (500 pages). Contrary to a previous review, the book IS full of tediously thorough descriptions of each exercise. The descriptions count for at about half the book, and you frequently won't bother to read them. Each chapter in the 2nd half of the book teaches one specific genre. I've just picked my favorite genres and focused on those only. Each genre is about 30-60 pages, and will have people wondering how you got to be so good in that style.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I gave this book to my father as a gift. Months earlier, he had called to sign up for a piano instructor he was going to pay $250 a month. He got the book and loved it immediately. When the piano instructor came for the first time (he was moving from New York), my father showed him the book. The instructor liked it also. However, this demonstration hardly compares with what happened next. My father decided that he thought the book so thorough, that he FIRED the piano instructor!!!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "how to play popular piano in 10 easy lessons the fastest easiest way to learn to play from sheet music or by ear",
        "description": "Explains how to learn to play the piano by mastering chords, and covers scales, tonality, triads, and improvisation",
        "authors": "['Norman Monath']",
        "infoLink": "http://books.google.com/books?id=Lk7GtuX5WBUC&dq=How+to+Play+Popular+Piano+in+10+Easy+Lessons:+The+Fastest,+Easiest+Way+to+Learn+to+Play+from+Sheet+Music+or+by+Ear&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There seem to be two main ways of teaching the piano. In the first, one grinds along like a junior typist learning which keys to strike in response to printed music. The sheet music starts easy and gets harder. One's brain and fingers get better at working together. When one is pretty good at pounding out notes in pretty hard compositions, one is considered a pretty good piano player.The other way of teaching focuses on learning chords and music theory. The idea here seems to be that, if one has the theory, one can figure out where to place one's fingers. So, one learns a melody and then, using music theory or a fake books adds chords. After a little practice, the devotees of this method argue, one can actually make music, i.e. play tunes that you like and make them sound good, though not necessarily the way they are written on sheet music.Both approaches have problems. The first is drudgery, and if one really wants to make music, you have to engage in this drudgery for years. The second requires, but doesn't teach or encourage, a great deal of facility hitting the right keys. It's very fun to know how music is put together and how one might play it. Yet it is very frustrating not to have developed the physical coordination to actually do it.The Monath book uses the second approach. It is a delightful introduction to music theory, chords, scales, and how music is put together. Like many of the books that follow the second approach, the style verges on the messianic. Yes, one starts playing songs almost immediately. Unfortunately, without a good deal of practice, those first songs might take an hour or so to pick through.If you have some facility on the keyboard, this might be a very helpful book. If you don't, you won't instantly become adept by reading this book, though reading the book will certainly be interesting, worthwhile, and edifying.I must also say that, if you are considering this book, you might want to take a look at the Cannell and Marx book - &quot;How To Play The Piano Despite Years of Lessons.&quot; Cannell and Marx follow the same approach, but describe some things differently and emphasize slightly different things. The Cannell book provides a much more detailed (and mechanical) pattern for actually playing songs - a big advantage.",
                "review/helpfulness": "303/314",
                "num_reviews": 314
            },
            {
                "review/text": "For the beginner, this book is excellent. I have looked at many piano books when I first began playing, and most of them were usually too complicated, or too simplistic. This book, however, was one that fell right in the middle and helped me understand all kinds of important ideas in music, such as harmony and melody, building chords and scales (and understanding HOW), reading music, how to understand progressions, and how to play by ear and improvise. It is certainly geared toward getting you &quot;up and playing&quot; in the simplest, fastest way, at a moderate pace, with a good depth of information that does not get overwhelming. Because of this, this book is probably suited much more for the person who has no music experience and wants to learn the basics of how to play out of fake books and begin improvising. It is probably not good for those who want in-depth and more advanced theory of music, but it is an excellent book to use as a stepping stone toward more adva! nced piano study. This is a must have book for any beginnger.",
                "review/helpfulness": "190/192",
                "num_reviews": 192
            },
            {
                "review/text": "Having taught piano the \"traditional\" way for 20 years, I bought this book for a student who already played by music but wanted to learn to play off a chord sheet (used a great deal by Christian Praise Bands). Mr. Monath uses very clear terms to describe how to play on the piano basic chords found in most fake books. I have too often found that the pianist who learns by using a traditional piano course method, can't play basic chords or play by ear. This book gives examples of songs to try to play using the right hand melody line and chords. I wouldn't recommend this book for someone who doesn't read music at all, but for anyone who's had traditional piano lessons and can play basic right hand melodies, it's a great way to learn to play chords and fill in from fake books or praise music.",
                "review/helpfulness": "69/69",
                "num_reviews": 69
            },
            {
                "review/text": "At first a true beginner would be suckered into thinking he/she would be able to play popular very quickly with this book, but that isn't true. A beginner should not use a book to learn how to play piano. A teacher is what you need. The problem with learning through this book is that it doesn't tell you when you need to practice or how to play specifically and the fact that it goes right into chords and songs that use a lot of black keys. The first 50 pages or so are easy enough but after that it is frustrating. The melodies given are in some ridiculous keys for a beginner. And with no references to what fingers to use someone with no experience would end up with a mess. Still it is a good read but not a teaching manual. 3 stars for a beginner.. on the OTHER HANDFor an intermediate player with a grasp of most scales and able to read notes and not spend 3 seconds pondering where to press, this book is an efficent book. An intermediate player would chuck out the first part since they know it and go right into the chord guide and beyond; gaining knowlege. An intermidiate player would know when and how to practice and be able to play with correct fingering, play different keys without too much trouble. At the end of the day improve their piano skills without too much frustration. 4.5 stars for an intermediate player interested in playing popular styles.I do not recommend this book for learning the piano but as a reference book for beginners. Useful for an intermediate player though. An advanced player would be beyond this book.",
                "review/helpfulness": "63/69",
                "num_reviews": 69
            },
            {
                "review/text": "Norman Monath's book is the most practical music self-instruction book, for intelligent adults, that I've ever seen. It is clearly geared for folks who want to do what the title says, play popular piano, versus becoming serious pianists. You won't learn much about treble clef, finger position, or proper technique here. But you also won't spend months repeating &quot;Tommy the Turtle&quot; and &quot;Camptown Races&quot; (or more likely give up the whole thing in discouragement). The basic idea is to learn how chords work (it's not as complicated as I thought!), and then start playing in a simple but effective style: melody with the right hand, block chords with the left. At age 44, I could read music but not play piano. Within days, literally, of reading Monath's book, I had bought a fake book and begun using it. This is not an overnight system that will turn you into a professional pianist -- but it is a legitimate alternative. I like it!",
                "review/helpfulness": "56/58",
                "num_reviews": 58
            },
            {
                "review/text": "This was the fourth &quot;beginners&quot; book on piano I had tried, but it was by far the very best!! In fact, I could have skipped the first three and been much better off.Monath's style was easy to understand and he included just the right combination of examples and explanation to make it worthwhile.I liked his book so much that I just ordered his guitar book. Not bad for someone who couldn't even find middle &quot;C&quot; just six months ago!!I'd highly recommend this book for the true beginner. You'll be playing songs in no time and with this book you'll learn enough to quickly pick up a music book and give the songs in there a try.",
                "review/helpfulness": "50/52",
                "num_reviews": 52
            },
            {
                "review/text": "I got a piano for Christmas and lessons are $65/mo for a half hour class a week! Glad I bought this book instead! It explains in a logical, non-technical way how to read music, find chords, and by the end how to augment and diminish chords, write music, play by ear, or transpose a song into another key for singing accompnament. I was playing &quot;Silent Night&quot; like a pro my first day. Give it a try!",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "I'm a 30 year old man and I started playing the piano 3 months ago and decided to teach myself with books. I started with Russell Baker's books (1-5) which are great to get you started if you know absolutely nothing about music - like me. I progressed to buy some sheet music and the lights just went out. There were so many notes and I could not process them quickly enough, particularly co-ordinating the right and left hand.I saw this book and read it, and within 2 weeks was playing a tune by Oasis that I could hardly read before. The key (no pun intended) is in the use of chords which are based upon mathematical rules. Once you understand the (simple) rules, you only have to find one note in the bass and develop the chord from there. This takes care of so much mental effort and also helps you to understand the form, structure and tone of the music. I feel so much more accomplished and learning the chords comes very quickly indeed.So it's very good, the only proviso being that you need to be able to read the notes of the melody and know what each key is to extract maximum benefit. The book does cover this in more detail towards the end, but rather raced through some bits.My advice to all those adults coming to the piano and music for the very first time is to find a good, simple \"Welcome to your first piano\" book and practice the simple tunes therein. Build confidence. When you can read the melody and know the names of the notes, you just have to buy this. Perhaps some purists may think of it as \"cheating\" but the author gives a very clear statement of intent and makes no apologies for the methods.I love the clear, concise and lively prose the book contains. It makes reading it all the more fun. I do wish, however, that ANY book which is designed to read in front of, or in conjunction with, a piano, is RING-BOUND and does not have a fixed spine. Otherwise this forces you to break the spine to hold the book flat, which is not good at all.",
                "review/helpfulness": "42/42",
                "num_reviews": 42
            },
            {
                "review/text": "While this title is somewhat dated (1984) it represents one of the best pop piano tutorials presently in print. The author clarifies early on the purpose of the book and delivers the rudiments of treble clef plus chord playing styles. As the author properly notes, this book will do nothing toward developing a classical repertoire but will allow the student (assuming the requisite practice) to play numerous pop/jazz standards from fakebooks or sheet music.Authors of this genre tend to avoid music theory like the plague and this book is no exception. By including just a little more information on note/finger selection Mr. Monath could have put the student in a much better position to avoid the often alluded to \"bad habits\" critics of these books are quick to mention. However, it's still a very good and accesible book that will have the student playing with confidence by the end of Chapter 3.I would also recommend purchasing a book such as \"Total Piano\" by Terry Burrows. Not only does this book fill in some of the theory/technique missing from \"..Play Pop Piano in 10 Lessons..\", but it does so along with easy classical pieces and historical information that is entertaining in a much more polished package. Buy both!",
                "review/helpfulness": "38/41",
                "num_reviews": 41
            },
            {
                "review/text": "After reading the reviews of this book I thought this book could be used by beginners such as myself, I was disappointed! I read the first few chapters and found I needed to know how to play the piano and be able to understand vocal scores in order use the book. The book maybe \"useful\" to me in the future but not now.",
                "review/helpfulness": "26/35",
                "num_reviews": 35
            }
        ]
    },
    {
        "Title": "the best of eva cassidy pianovocalguitar",
        "description": "The Best of Eva Cassidy features four pages of color photographs, and a heartwarming introduction written by her father. Titles are: Ain't No Sunshine * At Last * Autumn Leaves * Blue Skies * Blues in the Night * Dark End of the Street * Easy Street Dream * Fields of Gold * How Can I Keep from Singing? * Kathy's Song * Need Your Love So Bad * Over the Rainbow * People Get Ready * Songbird * They Call It Stormy Monday * Time After Time * Way Beyond the Blue * What a Wonderful World.",
        "authors": "['Eva Cassidy', 'Hugh Cassidy']",
        "infoLink": "http://books.google.com/books?id=iwyGPQAACAAJ&dq=The+Best+of+Eva+Cassidy:+Piano/Vocal/Guitar&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "WELL DONE! MUSIC PHARASEING GREAT.EVA WAS VERY UNIQUE . HER MUSIC IS THE MOST BEAUTIFUL THAT I HAVE EVER HEARD. BEING A SINGER/MUSICIAN THIS IS A MUST TO HAVETHE ARRANGEMENTS ARE AWSOME.",
                "review/helpfulness": "22/26",
                "num_reviews": 26
            },
            {
                "review/text": "Eva was the best singer of our generation. She has everything from an original style to an amazing voice.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This was a gift and have given 3 of them. They all loved the book.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book captures the details of Eva's arrangements on both the vocals and accompaniment. Someone took a great deal of time to notate her phrasing and the actual chords she plays. An excellent study of her beautiful style.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I was looking for intermediate-level piano music that captured Eva's lovely arrangements. The book is perfect. The arrangements are not too difficult, but not so easy as to be boring. I love it and will give it to friends who are Eva fans.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Do you like Eva Cassidy? Do you want to play and sing with her special style? I found this book challenging for me, just a plain piano player. And I was glad that the tunes are in a low voice, just like on her albums, so I can sing and play just for my own enjoyment. I am so glad to have this music in my collections.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Wonderful yet sad...yet wonderful. Everyone should read and learn and try to be just a little bit like this wonderful woman. Why kill an ant when you can just offer him something tasty and lure him outside? Eva says it all. Well, maybe not all, her music says the rest.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "berklee music theory book 1",
        "description": "Teaches the concepts of music theory based on the curriculum at Berklee College of Music.",
        "authors": "['Paul Schmeling']",
        "infoLink": "http://books.google.nl/books?id=HesqmgEACAAJ&dq=Berklee+Music+Theory+Book+1&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "When I researched this book and read reviews for it, I saw many complaints about there being no answer key included... And, furthermore, people who had contacted Berklee Music College to inquire about it had been told that there was no answer key available... and that to get the answers they would need to enroll in the course.Well, I spoke with a Berklee College Student Advisor who connected me to someone who could help,and I was sent an answer key via email that same day - so, as of now, there IS an answer key available - just contact the college to obtain it.(None available yet, though, for Music Theory Book 2... hopefully soon, though)",
                "review/helpfulness": "46/48",
                "num_reviews": 48
            },
            {
                "review/text": "This book is very clear and concise in teaching the basics of music theory. Each chapter is followed with excercises to apply your knowledge and each group of 3 or so chapters has even more excercises reviewing the topics covered in the past 3 or so chapters. There was one HUGE problem however. NO ANSWER KEY!!! Why anyone would make a book like this and not give an answer key is beyond me. It's easy to learn from this book, but how do you know if you've mastered the material if you can't check your work? If you can find someone to check your work get this book, otherwise I would look elsewhere for a book with an answer key.",
                "review/helpfulness": "47/47",
                "num_reviews": 47
            },
            {
                "review/text": "The book is great if you're in a classroom with an instructor to correct the practice tests that are all throughout the book. The book is meant to be used in schools, and in that setting, it is hard to beat. All they had to do was include a page or two with the answers and possibly perforate them so depending on the situation it could be removed or left in. If you don't care about the answers to the practice tests, it's great.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I have always wanted to play the keyboard but I was a little intimidated because I knew very little about music. I heard that Berklee Press had great music books. I found Music Theory and I orderd it. The book was perfect for me because I needed to start from the beginning. The book has key signatures, which now I understand. It also helped me to read bass and treble clef because I will need them for playing the keyboard. After finishing the book I felt more confident and now I have moved on to more difficult books.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "ok, I just recently bought this Berklee Book on music theory. Even though I have a strong theory foundation, this book covered a lottle more material than what I learned in school! It teaches the basics such as note placement to chord structures. I strongly recommend this book to those who write songs or can play an instrument.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "If you received an older pressing of this book please contact us at the link below to request your answer key. It will be sent via a .pdf file.[...]Sincerely,Matt IorlanoBerkleemusic.com",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Berklee has been in the business of teaching music to a diverse population of students for decades. They are experienced professionals at this. So there should be no surprise that the instruction in their music theory books is clear, concise, complete, well organized, and well-sequenced. The instruction is specifically targeted to piano/keyboards; even so, guitar players may also benefit from this training.This book was designed to be used in a class at a music college, with a music teacher. As a student workbook for such a course, this book would deserve a five star rating. I gave it a four star rating because it does not include the explanations that the instructor would (perhaps) normally provide. It would probably be best if you went through these music theory books with a music teacher (perhaps two or three chapters per week) as an integrated part of instrument instruction. Because of the lack of detailed explanations, I doubt that a self-studier could learn this material.Book 1 focuses on learning how to read and write music notation, as well as the major and minor scales. Book 2 focuses on harmony, including chords (triads, seventh chords, etc.), inversions, and voice leading. Each book develops listening, reading, and writing skills through exercises and \"ear training\" (included on audio CD).By way of contrast,The Complete Idiot's Guide to Music Theory, 2nd Editionis much better at providing detailed explanations (with an easy-to-read narrative). I would highly recommend reading the Idiot's Guide before starting the Berklee Music Theory books.List of lessons: Pulse and meter; notes; rests; eigth notes and rests; beaming eighth notes; dots and ties; rhythmic notation guidelines; eighth-note and eighth-rest placement; other time signatures; pitch notation; the treble clef; the bass cleff; the grand staff; accidentals; enharmonic equivalents; half steps and whole steps; the chromatic scale; the whole-tone scale; the major scale; scale degrees; major scales using sharps; major scales using flats; the natural minor scale; the relative major/minor scale relationship; minor scale syllable names; the harmonic minor scale; the ascending melodic minor scale; the descending melodic minor scale; minor scale key signatures; interval naming; perfect and major intervals; major vs. minor; perfect and diminished intervals; augmented intervals; compound intervals.My book came with an answer key. A great number of people have given this product a lower rating because they were mad that their book did not have an answer key. If you obtain an older edition without an answer key, simply contact Berklee (at berkleemusic dot com slash contact) and ask for the answer keys to Music Theory 1 and Music Theory 2.For a (literally) heavier book on music theory, take a look atTonal Harmonyby Kostka and Payne. This is a textbook that is intended to support a music college classroom/lab course with a music teacher. I really doubt if anyone could self-study their way through this book. You might want to try to get your public library to buy one, so you can take a look before buying. (It is rather expensive.)",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Where are the answers to the exercises??? For a novice, the material seems to be what is needed, BUT there's no way to tell for sure if the lessons are being finished correctly. An answer key would be VERY helpful!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This book (Berklee Music Theory Book 1) is helping me confirm what I already know about music and slowing introducing the next levels of theory in a clear and comprehensive fashion. The textbook offers room for written responses within each chapter and the CD (included) offers listening lessons with written response areas provided in the text as well. My guitar teacher recommended this purchase and now that I have both books 1 and 2, I see the need for these items. My instructor and I go through 3 chapters a week and the lessons flow quickly and easily. I highly recommend this item (book 1) as well as book 2.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "unfinished business the life and times of danny gatton book",
        "description": "UNFINISHED BUSINESS - THE LIFE AND TIMES OF DANNY GATTON",
        "authors": "['Ralph Heibutzki']",
        "infoLink": "http://books.google.com/books?id=0UAIAQAAMAAJ&dq=Unfinished+Business+-+The+Life+and+Times+of+Danny+Gatton+(Book)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I enjoyed this book overall. It gives one a good enough idea of who Danny Gatton was and what made him such a respected guitarist. I knew a little about Gatton going in, not a lot though, and I feel like the author succeeded in filling in the blanks. I also thought the book handled Gatton's unfortunate death in an objective fashion while remaining sensitive to the emotional issues involved.[Reviewer note: This review was edited on 02/07/2005. After looking it over again, I decided it appeared a bit more negative than I had actually intended.]But this book also has a couple of problems, I think. The most significant being that, in an effort to give Gatton the status he deserves, the author includes a fair amount of material that puts down other great guitarists as a way of building Gatton up. You can see this, for example, on page 76 with regard to Chet Atkins, and at other times throughout the book with some other guitarists.This happens most often, though, in relation to Roy Buchanan. And I particularly think that's a shame. Danny and Roy were both great guitar players, two of the greatest of all time, in fact, and neither one gets near the recognition he deserves. That being so, I don't see where pitting them against each other adds much to the discussion. But regardless, which one was 'better' is highly debatable, and the relative status of the two should be presented fairly as such, as was done in Phil Carson's Roy Buchanan: American Axe.The other thing I thought could have been improved would have been for the book to have spent a little more time giving us an idea of who Danny Gatton was as a person. Don't get me wrong, it does give you a better idea of who he was, and the book certainly does a great job covering Gatton's music and career, but I didn't come away from the book feeling like I really knew the man behind the guitar god, at least not as well as I would have liked.This is a very worthwhile book though, despite the minor drawbacks. You may want to supplement the book with some CDs to get a better feel for Gatton's status as an elite guitar player, and who his influences were. Of course that starts with Danny Gatton CDs, but I would also suggest picking CDs by the following: Roy Buchanan, Hank Garland, Lenny Breau, and Tal Farlow.",
                "review/helpfulness": "17/21",
                "num_reviews": 21
            },
            {
                "review/text": "Finally! The long awaited biography of Danny Gatton by RalphHeibutzki has arrived. The best biographies provide insightinto the character, motives, and personality of their subject.Who was Danny Gatton? In answering this question, Heibutzkihas done an admirable job. Through many, many interviews fromall the people who were part of Danny Gatton's life; family andfriends, I know so much more about this brilliant musicianwho Steve Vai (no slouch guitarist himself!) describes on thecover jacket, \"...Danny Gatton comes closer to anyone else tobeing the best guitar player to ever live.\"What drove Gatton to suicide? How did he view himself as amusician? Why was he at once once blase about fame and atthe same time so driven to acquire it? At one point, heforgot to call John Fogerty back to join his band, but wasclearly very excited to be signed to Elektra Records.He craved the notoriety and money that came with stardom,but would rather play small clubs close to home andwork on customizing vintage cars.Why wasn't he more famous? Wasn't he arguably the best?Maybe it was precisely because of his extraordinary skilllevel. Can it be that he could only be appreciated by othermusicians or guitarists? Many people (non musicians) I playhis music for elicit a \"ho hum\" reaction, while my mind isreeling with his stunning technique and musicianship. Whoknows? As someone who knew him observed, \"he never threwaway a note\".Those issues, and more, are addressed in this biography,and I feel after reading it that I know Danny Gatton, theperson, a bit more. Good job Ralph!",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "I was not an initiate of Gatton's music before reading this book, but I had heard of Gatton and was familiar with the legends surrounding his guitar heroism. I was curious, but, being a fan of songwriters more than instrumentalists, I never felt motivated to dig deeper until reading this book. Now, however, I am listening to Danny Gatton's music for the first time, propelled into his history by Heibutzki's excellent biography. Heibutzki has done a wonderful job penning a living, breathing *story* here, far beyond what is usually done in rock bios of this sort. He pays all due homage to Gatton's technical bent and &amp; instrumental artistry, but he never forgets to illuminate the human being behind it all. Yes, for you gearheads, everything you ever wanted to know about the pick-ups Gatton used, the type of guitars he favored, and how he invented his own effects box is all here ... But those of us who want just to know why Gatton was so special will not be disappointed either. This isn't a story of a guitar-player; it's the story of a friend, husband, father, and man of principles. Heibutzki has covered all of the bases here. Recommended.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "The other reviewers have discussed the merits of Danny's playing, so I will mostly stick to extolling the book. Heibutzki talked to just about everybody, and found most if not all of the print material and used this in his thoughtful, comprehensive biography.As an interviewer, the author got his subjects to open up, and what they say frequently tells as much about themselves as about Danny. As a consequence, the reader gets a sense of the mileau of clubs, studios, band and record label politics, and Washington DC and Southern Maryland music and lifestyle from the 60's to the 90's. A great deal of attention is paid to Danny's interest in cars, and his family life, as well as his early days gigging in various teenage bands and with Liz Meyer & Friends before he became \"unfamous\".Also, the book comes with a bibliography and discography, as well as a useful index, showing the author's almost academic thoroughness.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Ralph Heibutzki clearly spent a lot of time and effort collecting information and interviews for this impressive look at the life and music of the late guitar legend, Danny Gatton.Starting with Gatton's roots as a child in the 1950's in Washington, DC--where he absorbed an amazingly varied batch of musical influences--&quot;Unfinished Business&quot; presents a captivating trip through every era of Danny's life until his self-inflicted demise in 1994. The book succeeds in giving readers a thorough examination of Gatton's personal triumphs and struggles as it traces the evolution of his music. The interviews with friends, family members, long-time DC-area music journalists and fellow musicians help paint a complex picture of a man with a great gift as a guitarist, but a rocky relationship with the recording industry. It was what Heibutzki calls Danny's &quot;genre hopping&quot; (and the fact he did not sing) that made his music tough to market in a category-obsessed business.The book also includes an interesting assortment of photos plus discography, videography, bibliography and a listing of unreleased material. With the reissue of much of Gatton's musical catalog on the horizon, the timing is perfect for this fine document of his life and work.-Charlie Young",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Written by respected published journalist Ralph Heibutzki (a regular contributor to the &quot;All Music Guides&quot; and whose articles regularly appear in a number of music magazines and journals), Unfinished Business: The Life &amp; Times Of Danny Gatton is the informative biography of a guitar virtuoso who was popularly known for his love of a broad selection of genres including country, gospel, soul, as well as his own self-dubbed style of &quot;Redneck Jazz.&quot; Danny Gatton's work spread in influence, even though he never received popular acclaim, and even though his own personal troubles would lead him to end his own life in 1994. Gatton's musical legacy lives on, and Unfinished Business is a profound and introspective life story recommended to the attention of his legions of fans and admirers, as well as American Music History library collections.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "This account of guitar great Danny Gatton is welcome news to his many fans and friends. Ralph Heibutzki has give us a well rounded presentation of Danny, his talent, sparkling personality and sense of humor, and his struggles with the mercurial business of music. Gleaned from scores of interviews (including this reviewer), Heibutzki has covered the accomplishments, disappointments and the sad, troublesome days leading up to Danny's taking his own life in October, 1994. There is a comprehensive index, discography and bibliography. And a lovely foreward by guitarist Arlen Roth.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "As a musician, I was very fortunate to know Danny personally as he played in one of his earliest DC bands with my uncle, Rick Harmel. I recall that he took time to show me a few practice scales almost everytime I ran into him - no matter how busy he appeeared - and he was a warm-hearted, generous guy to the core.This book balances the abrupt, tragic end of Danny's life with the highs and motivations that made Gatton a player's player. It also spotlights many of the people (like Arlen Roth) that contributed their loyalty and friendship to Danny. Thank you Ralph for a great homage and superb, thorough account of the life of the Master of the Telecaster. A \"must read\" for all guitarists - and anyone else who enjoys a moving account of an accomplished human being.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Danny and Lenny, IMO, are the ultimate, the guitarists' guitarists. No guitarist I've ever heard could touch them. Both approached their music differently, but both played with a taste, intelligence, feeling, and respect for their predecessors that is unmatched. Both ended their brilliant lives early. Both seemed to be fighting inner (and outer) demons.I've read this book, countless internet articles, obituaries, etc., about Danny (everybody who is familiar with his music feels that they know him and are on a first name basis with him). But I doubt that anybody, even his own wife or daughter really KNEW Danny. His psyche seems impenetrable--and this book, not surprisingly, does not crack the shell.\"Danny plays like everybody, but nobody can play like Danny.\" Was the fact that he never seemed to settle in a single groove destructive to his career commercially? Was he too good for his own good? He was probably a man of contradictions, and in the end, the unresolved contradictory wants and needs may the be underlying cause of his suicide.\"Danny had God's hands. Sometimes I heard God come out of his speaker.\" I'm not religious, but I know what his drummer meant. Lots of fans think that the best musician is the one that can play the fastest. That's a neophyte opinion. It's ballad playing that separates the men from the boys, and no guitarist played them better than Danny.His last recording (that I know of) was at the Birchmere near where his farm was. A month later, he would be dead. The CD is a monument to his brilliance as, not just a guitarist, but a musician and artist. There is no anger, not a mean note in there. If you are one of those people who think that a writer's, musician's, composer's, life is reflected in his work you are going to find little backing for that theory here. The music is ethereal almost (\"Secret Love\"), funny (Surf medley), madly swinging (\"Caravan\")--you shake your head and wonder why such a talent would want to kill himself.According to friends, Danny loved his music, old Ford trucks, drinking beer, and family. He had all those. So why? If you are looking for answers, this book provides none, but merely a portrait of a genius whose person will probably always remain a mystery. \"He could play it all. Now all we can do is listen.\" And listen. Amen...",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "alfreds teach yourself to play mandolin everything you need to know to start playing now",
        "description": "\"Includes great folk, blues, country, pop songs with lyrics\"--Cover.",
        "authors": "['Dan Fox']",
        "infoLink": "http://books.google.com/books?id=-RF5oAEACAAJ&dq=Alfred%27s+Teach+Yourself+to+Play+Mandolin:+Everything+You+Need+to+Know+to+Start+Playing+Now!&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I found \"Teach Yourself to Play Mandolin\" by Dan Fox to be a wonderful beginner's guide to the mandolin. It gradually introduces new concepts and techniques as it goes along, and it constantly reinforces previous ideas. The examples are very well done, and the music selections are very enjoyable. I had several other mandolin instruction books, but this one was clearly the best, and it was the one that I stuck with. I have since introduced two other people to the mandolin, and this is the book that I had them use. They have both since progressed nicely, and both have given very high praise to this book.",
                "review/helpfulness": "61/61",
                "num_reviews": 61
            },
            {
                "review/text": "Having played electric and acoustic guitars for more than 30 years, I was surprised at how different it was to learn the mandolin. Dan Fox's little book got me up and running in about a week. The author introduces the mandolin in a step-by-step manner that is quite easy to follow. The exercises grow more difficult as the book progresses, however, the instruction remains concise and clearly communicated. The book ends with a handy Chord Dictionary illustrating the proper frettings and a Mandolin Fingering Chart. All in all, this book is a great tool for those learning the mandolin. It can even be recommended to young readers looking for musical instruction.",
                "review/helpfulness": "40/40",
                "num_reviews": 40
            },
            {
                "review/text": "I purchased this book on ratings and found it to be very in depth. This is a good book if you have a good background in music, but if you do not it may be over your head. I use this book very little as I have found much better in depth books available.BillN.C.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is an excellent book for learning mandolin except it does not come with a CD. At first I was discouraged but then used another mandolin book that included a CD and then went back to learn from this one, which worked out great. Great excercises for learning the fret board.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            },
            {
                "review/text": "This is a terrific book for the beginner! It takes you through all the basics as well as introducing you to some more advanced techniques...The \"hammer on\", \"slide\", double stops and pull-offs to name a few. Music is found in the traditional form as well as tablature (for those of us who dont read music!) There's also a list and diagrams of all the chords you'll probably never need! Go ahead, try it, you wont be disappointed.",
                "review/helpfulness": "9/13",
                "num_reviews": 13
            },
            {
                "review/text": "I like the book, but the descrption is very inacurate.It says that it will teach you \"a variety of strumming techniques\" when only one page at the very back of the book describes strumming techniques.The emphasis of this book is on LEARNING TO READ MUSIC for the mandolin and playing melodies on the mandolin.Already having some background in music I would have appreciated a little less emphasis on learning music notation and more on fingerboard and picking techniques. I feel I am left out there a little to figure these things out on my own.For example: in the section on \"cross picking\" they say \"cross picking is one of the moste difficult things to do on the mandolin... here is a song where you have to do a lot of cross picking...\"What the *& ^%$% do they mean by \"cross picking\" and how do I know if I'm doing it right? Really?And also the descrption mentions lyrics and there's not lyric ONE in this book! Not that that is really important to me at all; i's just wrong. It says the same thing on the cover of the book, but no lyrics anywhwere.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a good general introduction to the mandolin, suitable for those with no background in string instruments.A previous reviewer stated that the book included standard notation and tablature. That is incorrect. There is no tablature for the musical selections in this book.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "It's been 20 years since I read sheet music; this book has a terrific introduction to reading music and some fun practice songs to play. I highly recommend it.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "OK for the money with varied info but short on the mechanics of playing. Uses the \"low' thumb position. Really could use a dvd. On the other hand, has varied scores of different types of music and gives info not found in other starter learning material that I have seen.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "If you've got any training or experience with a stringed instrument you might think about passing on this book. I thought I might find some information that was specific to mandolin (tips, techniques, etc.) but it's really just a very basic instructional guide.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "barrelhouse and boogie piano",
        "description": "(Music Sales America). An important instructional guide to the blues-style piano. Learn blues style piano from complete transcriptions and a recording of excerpts from the original recordings of 22 piano greats: Jelly Roll Morton, Memphis Slim, Meade Lux Lewis and more.",
        "authors": "['Eric Kriss']",
        "infoLink": "http://books.google.com/books?id=H5opxgEACAAJ&dq=Barrelhouse+and+Boogie+Piano&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I cut my teeth on this book, I bought it in the Spring of 1981 and bored the heck out of my parents, wife and then children learning classics like Peetie Wheatstraw stomp and Honky Tonk Train.Recently I just bought another piano and I've picked the book up again.If you want to play classic boogie and blues piano then you must have this book!Does it still come with a floppy vinyl record?",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "A fantastic book. It gives you history, transcriptions and tips. It's not a great method book though, so between this and a good blues method book you can learn a lot about blues piano. You need to get recordings of the transciptions though to really get the feel for the differnt styles, and really understand the subtleties of the rythms that the notation really cannot fully show. Its fun to just listen and look through the transcriptions at times. I've tried playing as close as I can to the recordings then once the feel is there used it as a springboard for my own explorations. This book helps you both learn the music and appreciate it more.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am thrilled with this book/sheet music. They took the time to include a CD of the original piano players/writers playing about 20 seconds of each tune. I'm new to playing bookie piano, so I need to hear it as well as read it. Not to mention, it's fun to get a sense of the history involved in this style.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book is flat out great! Lovingly edited and transcribed. I have to be honest - it's not for rank beginners necessarily, but it's worthwhile. I bought this many moons ago. How long ago? When it had a flexible phonograph acetate you could play instead of a CD! Anyway..the included music is a great help. Now with the CD, the cool thing is in Windows Media Player 10 or above, you can reduce the speed 50% without changing the pitch - good for taking the parts apart i.e. \"what notes was he playing on that line or phrase??\"",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "While I've played for 30 years, I never gained good improvisational skills (guess you have to be born with that). So when I'd hear a tune I liked and ran out to buy the sheet music for it, I'd be disappointed that the basic melody would be there, but what made the song \"cool\" and fun to listen to was all added by the pianist (like buying Billy Joel or Elton John sheet music). Conversely, Barrelhouse and Boogie Piano songs have every grace note and riff written in, a CD that contains all the songs, and detailed instruction on how to play the pieces. This is for the technical artist. I would imagine the \"natural\" pianist would be very irritated with the level of detail in this music.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "100 piano classics to grow on the steinway library of piano music",
        "description": "This compilation is a source of enjoyable, approachable and very listenable piano music, and an extremely valuable educational tool for teachers and students. It includes the pieces that the masters from the Baroque, Classical and Romantic eras composed for their own students. All music has been engraved in an enlarged note size and with extended spacing of measures to provide an open, airy appearance, facilitating easier reading and annotating. Each piece has been carefully edited to provide fingerings for playing ease and comfort. As with all books in this series, it includes a unique lay-flat binding to help keep the music open on the music stand.",
        "authors": "['Edward Shanaphy']",
        "infoLink": "http://books.google.com/books?id=ibh_KGo1VPgC&dq=100+Piano+Classics+to+Grow+On+(The+Steinway+Library+of+Piano+Music)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "As an average piano talent, lessons for 5 years, and then career and children, I found this book to be perfect for me. I really am enjoying the challenge of playing all 100 Classics as provided in this book. The music is wonderful and has easier fingering than the maestros wrote. Marilyn in Las Vegas",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book didn't have as many well-known songs as I wanted, but it has a nice range of songs at the intermediate level. It's pretty good!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "elements of the jazz language for the developing improvisor",
        "description": "A comprehensive book on jazz analysis and improvisation. Elements used in jazz improvisation are isolated for study: they are examined in recorded solos, suggestions are made for using each element in the jazz language, and specific exercises are provided for practicing the element.",
        "authors": "['Jerry Coker']",
        "infoLink": "http://books.google.com/books?id=iQNVErQnTVUC&dq=Elements+of+the+jazz+language+for+the+developing+improvisor&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is an excellent book on the music language of jazz. It's not a method book on improvisation but it can be used as one. Jerry Coker points out that all of the jazz great musicians are not pulling musical notes out of the air to improvise. Their solos are truly well thought out music compositions. Jerry Coker points out that in order to create or play an improvised solo you do need to know what you are doing. Throughout the book he has shown excerpts from various solos of very great jazz musicians, such as Charlie Parker, Bill Evans, John Coltrane, Kenny Dorham just to name several. He has also shown analyses of full solos by some of these great musicians. What Jerry Coker has done is taken this book to explain the various elements of any jazz solo and presented them in a way that any intermediate level musician (possibly a beginner) could understand. I think this book is for the musician that is at an intermediate level in music or jazz music theory to benefit from it. Mr. Coker has identified many improvisational elements that goes into creating musical jazz solos from aural and written analyses of solos. For example, the number patterns, scalar patterns, 3-b9 melodic motion, target note enclosures, 7-3 melodic resolutions, linear harmonic generalizations, the difference between musical quotes and musical licks, bebop scales and more chord related scales and why they work for certain types of chords, bar-line shifts of linear harmony. Mr. Coker tactfully explains each element and how they can be connected to make good melodic sensical jazz music. He has created exercises along with a play-along CD to help the aspiring jazz musician.This book takes the mystery or mystique out of the solos of the jazz greats. It IS possible and probable for any dedicated musician to reach that stature. In the past my lesson teacher would always tell me to play my scales and chords for solos...and I did. But nothing was making any musical sense. After studying this book, my solos now make jazz musical sense because it has musical shape and substance.My final word is that I believe that no musician will be disappointed after studying this book.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is not a method book but a useful text laying out essential elements of jazz improvisation, and an excellent reference particularly useful for the aspiring jazz improviser seeking the scope for practicing.The double CD contains numerous examples to illustrate each of the improvisational elements which the famous jazz educator groups into 14 chapters. Moreover, perhaps the serious jazz fan who wants to learn appreciating jazz music in a deeper context, could also benefit from this work. Highly recommended.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "This book took my jazz improv to the next level. After practicing scales and standard patterns in all keys I needed ideas to craft more sophisticated solos. This book offered a lot of insight into the nitty gritty of creative, melodic soloing. The text is comprehensive and the exercises are easy to master. Transcriptions from recorded solos by many Jazz greats show the validity and heritage of the licks and principles described. Certain licks and treatment of common chord progressions should be ingrained in one's playing so that one can fly over them without having to think. This book will show you tricks, examples and deliver insight on how to achieve this. I would recommend this book to anyone who is proficient on his/her instrument and wants to get a better understanding on how to play bebop. I am glad I bought this book and I believe no serious Jazz musician should be without it. You can't go wrong with Jerry Coker :-)",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This book comes with 2 CDs and the chapters are structured to show you the most commonly used elements in improvisations. It shows you real licks from the great according to what a particular chapter is about and has exercises that pertain to the material that you can practice. You can incorporate the licks into your own playing and make up your own. Lots of helpful material and good for hearing characteristic sounds found in jazz improvisations.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "If you're interested in grasping the finer points of practicing jazz and understanding how to hear and implement aspects of the jazz language into your own playing, then this book is the comprehensive guide. Perfect for the deep thinker, this book demonstrates how jazz musicians hear and implement elements of the jazz language into their musical vocabulary.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "alfreds teach yourself to play piano book enhanced cd teach yourself series",
        "description": "A two volume set that teaches beginning learners how to play the piano, featuring a step-by-step approach to learning the keyboard, techniques for playing, instruction on forming chords, and an introduction to reading music, andincluding live performances demonstrating how the music should sound.",
        "authors": "['Morton Manus', 'Willard A. Palmer', 'Thomas Palmer']",
        "infoLink": "https://play.google.com/store/books/details?id=YeBxfLa8n7kC&source=gbs_api",
        "review": [
            {
                "review/text": "I bought this book to see if I could teach myself the basics of playing the piano. It works great for me. I am a visual learner. Yes, I like pictures. The book has drawings of correct finger position and placement. There are basic scales, songs, and lots of skill building exercises. I am very pleased with my purchase. I would buy this book again. It works for the adult who has never played the piano. It teaches you to read music!",
                "review/helpfulness": "114/115",
                "num_reviews": 115
            },
            {
                "review/text": "This book with DVD is absolutely fantastic! I never thought I would be able to learn the piano but this set makes it so much easier! The DVD follows everything in the book, page by page, with the benefit of the piano teacher providing a little more detailed information than the book provides. It's been a pleasure going from lesson to lesson always thinking that there's no way I can play what she just played. With a little time, I'm able to complete each lesson successfully and move on to the next one. The lessons are set out perfectly, growing your skills little by little. A+ in my book!! Not one regret with this purchase!!! The cost of this DVD far out weighs the cost of piano lessons. This is a steal!!!!!!!!",
                "review/helpfulness": "80/81",
                "num_reviews": 81
            },
            {
                "review/text": "I purchased this kit to help teach us how to play the piano. We just purchased a Casio Privia PX-330 keyboard and wanted to start lessons as soon as possible. I work part time with the Air National Guard and I am a full time student. I don't really have time for lessons so I wanted something I can do myself. This kit is amazing and really does help. I have never played any instrument before and I can't read music. This book teaches you both. Learning to play the piano is a very daunting task but it is much easier with this book. My wife and oldest son are still going to take lessons because they have the time, but I am very satisfied with learning from this book. It does a GREAT job and I would recommend it to everyone trying to learn the piano!!! Would buy again for sure!",
                "review/helpfulness": "77/77",
                "num_reviews": 77
            },
            {
                "review/text": "This book is great for people just learning to play piano. I have a keyboard at home that I practice on. It takes you step-by-step through each phase/step, and one lesson builds on the next. I m learning a lot with this book- highly recommended.",
                "review/helpfulness": "26/27",
                "num_reviews": 27
            },
            {
                "review/text": "A long time ago I used to know how to read music. However, I had forgotten it all. This book takes you along very slowly, and teaches you everything you need from music notations, to musical note values, and, of course, musical notes themselves. It does it one lesson at a time. You simply learn one thing to do for that lesson, and then build on it, one thing at a time. It letters the notes in the beginning, and then slowly, one note at a time, begins to show them without a letter value. In time, you will learn the notes themselves, and will not even be aware of the fact that the letter values are no longer there. This book also plays songs that you know, and thus you want to keep playing more. The DVD that came with this book is very helpful in showing you how to play each piece. The only problem I saw with the DVD was how to skip over the beginning piano piece that plays, and get to the menu. Normally, you would go to a root menu. However, on this DVD, the root menu is that musical piece. Instead, go to the top menu (look for the top menu button on your remote), and it will bypass that three minute long piece. Other than that, it is wonderful. :)",
                "review/helpfulness": "26/26",
                "num_reviews": 26
            },
            {
                "review/text": "This book with the DVD does an excellent job of explaining how to read the music as well as play. The learning pace is high tempo so you're not wasteing weeks on playing the same song. The music has helpful reminders at the begining of the pieces to remind you which fingers go where. The music is written in large print so you do not have to squint to read the music. The only thing I wish they would have done differently is to offer up some longer pieces to help build the muscle memory. The tunes are fairly short so it is easy to memorize the order of the keys to be played before you memorize the musical notes. Otherwise an excellent purchase. I would recommend this over paying large sums of money for piano lessons.",
                "review/helpfulness": "24/24",
                "num_reviews": 24
            },
            {
                "review/text": "Got this product for my daughters who like the piano/keyboard but are inexperienced. Product arrived as stated without hassle or delay,which is 2 1/2 stars already. We opened the product and established some ground rules like; Following the recommended instructions, committing to at least 1 hour a day and 5 days a week for the first 3 weeks. In 1 1/2 weeks they were playing the one handed songs perfectly and progressed from there. Now they both can play a few songs (2 handed) and have even began to experiment with creating their own songs, they are still on the schedule but needless to say they play a lot longer than the agreed time and love it. The instructions are clear and easy to understand, and if you follow along with the DVD and do not skip lessons you will have no problem learning to play",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "My son received a electronic piano for christmas so I thought I would buy this to try to relearn keyboard music. I hope to help him if he needs some down the road. I haven't played for over 30 years and with the help of this dvd I have made great progress after my first 2 hour session. I was able to already play a couple simple songs and look foward to continuing through the rest of book and dvd. I highly recommend this if you are a person who can learn through reading and practicing on your own. I put the dvd on and follow through the lessons in the book. The dvd is a great compliment to the book and would find it hard to do without it.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "This book really works!! I have no background of reading music or playing any instrument, but within a couple of hours and the 1st few pages of this book i was playing my 1st song. I purchased the book because I have always wanted to play the piano just as a hobby. This book is perfect for that!!",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is a good book/DVD package! The last time I played piano was about 25 years ago & I only took lessons for less than 6 months, so my knowledge is pretty minimal. The book is easy enough to follow & has a nice progression through the process of learning the piano.I initially started through the book, just to see how it was & I made it through the first ten or so lessons & I thought I understood what was written. Then I put in the DVD & realized I was missing a lot, by my ignorance of music. The DVD puts the polishing touch on the book & really explains (the why) of what is written!The only negative is the menu of the DVD is not the most user friendly of quickly finding & referencing to a location in the book. Other than that one quirk, I am really enjoying this package.",
                "review/helpfulness": "16/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "hendrix setting the record straight",
        "description": "Here's the first complete, definitive account of the career, music, and legacy of Jimi Hendrix, based entirely on first-person recollections and new, exclusive interviews with musicians and key figures in the Hendrix inner circle. Authors John McDermott and Eddie Kramer (Jimi's longtime producer) take readers inside the studio and on tour to reveal the creative process of a true rock pioneer. Two 8-page inserts.",
        "authors": "['Edward E Kramer', 'John McDermott']",
        "infoLink": "http://books.google.com/books?id=Zd-9QAAACAAJ&dq=Hendrix:+Setting+the+Record+Straight&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Disclaimer: Huge Hendrix worshipper! When this book appeared in 1992 it was (and still is) the most even-handed biography on Jimi. Previous bios were from either muckrakers who were trying to damage his legacy, or by people who never met him and were trying to make grand statements about his talent. In this book McDermott has taken the time to get first-hand accounts from those who knew Hendrix best, including bandmates and business associates. The most valuable asset here is engineer Eddie Kramer, who was Hendrix's close friend and trusted creative confidant. (However, it seems that Noel Redding was consulted less than other bandmates, possibly because he had a more unflattering story to tell).Getting these valuable first-hand accounts gives us a very balanced view of Jimi's personality, and both sides of the coin are shown. You get the expected admiration for his talent, and the good sides of his personality. You also get the not-so-good parts, such as Jimi's paranoia, insecurities, and appallingly poor business sense. This book is not afraid to give bad reviews of Hendrix's poor live performances with the Experience when they were on the verge of splintering, or with the undeveloped Band of Gypsys. Also, his pathetic death (choking on his own vomit) is not dwelled upon and is treated as the senseless mistake it really was, rather than the noble, romanticized exit from this world (or even suicide) that you'll hear about in other accounts.The excessive details about Hendrix's sloppy business arrangements provide valuable information, even though these passages get very long-winded and detract from the focus of the book - which is the man and his music. Also, be suspicious of character descriptions of people who are not around to give their side of the story. This doesn't apply to Hendrix himself, as described above, but to late manager Michael Jeffery. This man surely left plenty of evidence that he was paranoid and power-hungry, but the descriptions of his personality by the people in the book, most of whom didn't like him, should be treated with suspicion, as he's not around to have his say. To a lesser extent, the same applies to Jimi's sexy but dangerous girlfriend Devon Wilson.The coverage of the posthumous Hendrix musical catalog is getting outdated (fortunately). Certainly after his death, the managers and record companies flooded the market with inferior material, most of which was either impromptu jam sessions or sub-par live performances which were never meant for release. Until the mid-90's this avalanche of so-called &quot;lost&quot; material blurred the brilliance of the smaller amount of official records that Jimi really tailored for the public. This situation has been mostly resolved since 1994 when the Hendrix family finally gained control of the musical copyrights. They've given us great reissues of the official albums, as well as the incredible &quot;First Rays of the New Rising Sun&quot; which consolidates the album Hendrix was creating at the time of his death. But with things like &quot;South Saturn Delta&quot; and &quot;Live at the Fillmore East&quot; the Hendrix family is almost as guilty of barrel-scraping as the bad guys were in the 70's.",
                "review/helpfulness": "40/47",
                "num_reviews": 47
            },
            {
                "review/text": "The first time I read this book was back in 1997. I was already a huge Hendrix fan and this book opened up many things about him and his music that I was unaware of, for the most part. At that time I would have given this book 5 stars. But after recently picking up Electric Gypsy by Harry Shapiro and Caesar Glebbeek, which blew me away, I reread this book and I give it 3 1/2 stars.My main gripe is that it focuses too much on the business side of Hendrix. Sure that stuff is interesting and informative, but it makes for a slow read, in my opinion. And it takes away from the flow and the excitement of his music and touring. I think that they could have made a couple of chapters exclusively for the business side of things and kept the other chapters more musically focused and it would be a much better read. My next biggest beef, is that they continually refer to Voodoo Child (Slight Return) as Voodoo Chile. Those songs are very different, any knowledgeable Hendrix fan knows that and would be bugged by the 15 mentions of it, instead of the correct Voodoo Child (Slight Return.) Minor yes, but if Eddie Kramer, Hendrix's long time famed producer and friend, helped write this book, then why didn't they catch that glaring error?Still it is a good book, but if you know a lot about Hendrix, it will not fill your needs and I would suggest the afore-mentioned Electric Gypsy. For one thing Electric Gypsy has FAR more interviews from Hendrix, which are always entertaining and revealing. And it has far more about the music and what went into it as far as inspiration and song meanings. For those two reasons alone that book blows away Setting the Record Straight. Also Electric Gypsy has many of Hendrix's song lyrics in the book, which is truly great. Also Electric Gypsy has a part in the back where it shows a list of every guitar Hendrix ever played and all the effects he ever used, all the bands he was in, a discography and much, much more.Don't get me wrong Setting the Record Straight is a good book, but I would suggest to all Hendrix fans new and old, get Electric Gypsy first, then if you still want more, get Setting the Record Straight.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This biography was written to, as the title states , set the record straight. After Jimi Hendrix's 6-year career wasw cut short by a drug overdose he was viewed as an anti-establishment, sex and drug addict. However, no one ever focused on his serious vision and path of his music. He started his career as a backup musician for such artists as Curtis Knight and the Squires, the Iskey Brothers, and Little Richard. After that he was signed by Chas Chandler ( formally of the Animals0 signed him and moved to England. There the Experience began. The book shows that Jimi spent hours and hours in the studio to get a song right and kept to himself alot. Totally unlike his stage personallity. I would recommend this book to any music lover. The other musicians' insight into Hendrix's talent and personality makes the book especially interesting. It provides an interestingperspective into the most unique period in music History",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "This is the first and only hendrix book that is the most factual, it describes the actual life and times and troubles of jimi. The research give a reader a closer look inside the music and the complex side of his life. Paul Mc Cartney was right ,this book is Hendrix",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book shed a lot of light onto one of the greatest and most tragic figures in modern music. Much of what I knew about Jimi was based on rumors and vague interpretations about what he and his music stood for. However, this book presented a detailed look into his life. Through personal accounts from those around him, the author paints a detailed portrait of who Jimi really was. Although I have always been drawn to Jimi by his music, the book showed his personal side, which is equally as compelling. The weakness in my opinion was the lack of detailed information on his early childhood years. Although his father Al would play an important role in the Jimi Hendrix legacy (and still does to this day), their relationship (or lack thereof) is rarely mentioned. Also, there could have been more written about how much influence he had on music. The discography is very inclusive, but it lacks detailed commentary. Overall, I enjoyed the book a great deal and would highly recommend it to anyone interested in learning more about Jimi Hendrix.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a pretty interesting book about a very interesting virtuso musician. There a lot of good information provided in a somewhat dry and detached delivery that somehow remains engaging somewhat like a Wall Street journal article.My only issue with the book, the absolutely horrid photo on the cover aside, is the business orientation of the book which leaves questions about other issues, all of which interelate to each other.As one example, the issue of drug use is treated in a very shallow fashion. While I am not looking for sensationalism, it seems clear that but for his drug use Hendrix would never have gotten behind the contractual eight ball so far - which the book implies the monetary impact of which had some effect on his eventual death.On the other hand, I have learned quite a bit about Hendrix, his business deals, and perhaps most importantly, about his music. I was never aware of some his side projects including the Gypsys Suns & Rainbows or his all too brief session work with John McLauglin. There are also some interesting photos included in the book.Cover photo aside, this book is probably the best $ I've spent in a long time.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book takes an inside look at the life and legend of the man that was James Marshall(Jimi) Hendrix. His troubled youth and how he had to suffer tremendous hardships just to be noticed. His love affair with blues music and his affinity for the guitar are also well intact. What puzzles me is why so many people would want to drag Jimi's name through the mud and desecrate his legacy and good fortune with lies and deceit. Why couldn't people have respect enough for Jimi and his music to take it seriosuly and treat it like gold, instead of commercializing for their own personal gain and profit? Jimi was a serious artist and this book certainly attests to that. He wasn't in it for the money or fame or recognition. He was simply in it for the music.He deserved to be treated better by people who called themselves \"His Friends.\" Jimi was a incredible man and amazing guitar player as well, but he was also very human. He had a very vulnerable side to him as well. He had enough problems without people wanting him to be everything to them. He couldn't do that.He needed someone to love him and someone to respect him and take him at face value instead of having him always be Mr. Rock guitar god. he wanted people to listen to his music and be taken seriously. He was sick and tired of doing the same theatrical tricks that he had done with the guitar night after night, and now he just wanted people to listen to him, and not look at what he was doing with his guitar. he didn't need to prove anything anymore. he'd already done it. it was time for him to move into a new direction. Unfortunately, that new direction was never fully realized during hendrix's lifetime. Only now, after his death do we fully know just exactly what he was trying to achieve. Some things we'll never know. That was the genius of Hendrix. To keep people guessing. He'll never know how much of an impact he has had and continues to have on people's lives even to this day. God Bless You, Jimi. We Love You, Man!!!",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "Many half-truths and inaccuracies exist about the life and music of Jimi Hendrix. In trying to \"set the record straight\", the authors attempted to offset decades of lies and manipulation of the Hendrix estate. To some degree, they succeeded.The authors do not devote nearly enough space to the life and music of Hendrix. Instead, the book seems to focus on the cast of characters that surrounded his life. It seems that any of the managers or promoters that worked with Hendrix sought to take credit for his success. It was as though the presentation were more important than the talent of Hendrix. Perhaps this is a fitting way to remember his life since his lack of friendship and the constant manipulation of those around him factored into his drug use and eventual death. The circumstances surrounding Hendrix's fatal oversdose suggest that a friend rather than a business associate would have phoned for the help that he needed to save Hendrix's life.The book does not devote nearly enough time to Hendrix's pre-fame days (approximately 20 pages), and focuses more on the business aspects of the music industry rather than Hendrix music itself. There is no doubt that Hendrix made some bad business deals. Yet this should never overshadow all of the great music made by Hendrix. Pages could be spent discussing the making and meaning of songs. Once the author mentions a song, the reader may not see it mentioned until dozens of pages later.Hendrix's premature death left his estate in debt. For this reason, unfinished recordings of his music were released that Hendrix would have never wanted released. We never got to see the full potential of Hendrix's genius. Those that exploited him in life, exploited him in death.The real Jimi Hendrix was not the same person as the flamboyant guitar player people saw on stage. Much of his stage act, including setting his guitar on fire, was coaxed. This book gives real insight into the real Jimi Hendrix. Yet, I can not help but think we are far away from knowing the real legend.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I've read three different Hendrix biographies and each came at the subject of Jimi Hendrix from a different direction. Setting the Record Straight is good because there is a lot of input from people who were close to Hendrix, especially people who were part of his organization, but who were not particularly well known. Like all of the Hendrix biographies, this book does have its faults, I mean, how many times should an author state that Jimi was growing wary of Michael Jeffries, Jimi was trying to keep his distance from Michael Jeffries, Jimi was avoiding Michael Jeffries. I found one spot where there were at least 4 references in a 2 page span about how Jimi as getting tired of Michael Jeffries. Ok. We get it. Yawn.The book is very good in explaining how the Hendrix \"image\" was deliberately created to be controversial (most of us grown-ups had already figured that one out). It tells us how the \"real\" Jimi started to emerge after the release of Electric Ladyland. It tells us the story of the Electric Lady studio and how it came about from the initial idea of creating a club much like Steve Paul's Scene club. It also tells us about when and why Chas Chandler excused himself from the organization. Actually Chas turns out to be one of the few really classy people in the Hendrix organization.You also learn about a host of disasterous gigs and shows where Jimi just didn't want to play. In some ways you feel sorry for him and in other ways you begin to understand that the guy's work ethic really sucked. If you lived through the era I guarantee you will end up feeling pretty embarrassed about your generation's behavior.Unfortunately, this book doesn't tell some of the stories that I am interested in. I wanted to read about the jam session in the studio that produced Voodoo Chile for example. There really isn't much emphasis about how the music was made. In my opinion, when it comes to Hendrix, that's a no-brainer; that's what people want to read about.From a musical perspective, I would have to say that Crosstown Traffic is a much better biography as it does much to show Jimi's importance within the context of American art and culture. Really, I don't care about Jimi's business and I don't care about his depraved social life either. I just love his music. Setting the Record Straight is really more about the business side of Jimi Hendrix and the Hendrix \"product\". Excuse Me While I Kiss the Sky is probably the least interesting of the three I've read, it's more about Jimi's social life than anything. That particular book tries to be sensational by asserting that Jimi was murdered and then downplaying that idea in the same paragraph. That was rather like when a lawyer coaches a client witness to blurt something out on the stand that they know the judge is going to strike down, but the jury is going to hear it anyway. Shabby.I would pick up both Setting the Record Straight and Crosstown Traffic if you really want to get to know Jimi and his signficance with respect to American art and culture.Oh yeah, one little factual nugget I finally learned after years and years and years (decades really) of wondering... It was Jimi who played the freaked out recorder solo at the end of If Six Was Nine. Hooray! Mystery solved! That was driving me nuts!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "I've read all of the Jimi bios over the years and to me, this one is the best. Maybe the act of helping Jimi get the sounds he envisioned helped Eddie to get into his head just a little bit. Reading the book, I found myself sucked into the making of the music and my appreciation of the music has grown as a result.Let's give this one 6 stars.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "adult allinone course lessontheorytechnic level 1",
        "description": "Alfred's basic adult all-in-one course, Level 1, is designed for the beginner looking for a truly complete piano course which includes lesson, theory, technicand popular repertoire in one convenient, all-in-one book.",
        "authors": "['Willard A. Palmer', 'Morton Manus', 'Amanda Vick Lethco']",
        "infoLink": "http://books.google.com/books?id=xZnEkQEACAAJ&dq=Adult+All-In-One+Course:+Lesson-Theory-Technic:+Level+1&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I used to play the clarinet in middle school. Now I'm 18 and it's been quite some time since I've read sheet music. Playing guitar for six years literally ruined my ability to read the stuff, because I would always use tabs instead. But eventually I grew jaded with the guitar, and I decided to choose a new and fresh direction -- the piano!This book is very well-written, and leaves no gaps. Within just a few days I found myself relearning all that I had forgotten from band class years before, and I've now reached the point where I know more than I did! And I haven't even finished the book yet!Plus, it tests you on theory and technique. You get to fill in parts of the book, which really helps you get involved with what your learning.One reviewer downrated this book because of the song choices, and its accompanying CD. I feel that this is in err. I believe the song choices are just as good as any. If the tunes were familiar, then they wouldn't be as challenging to learn. And as for the CD...I did notice that the piano parts are rather quiet, but I always thought this was because it was a play-along CD (which is what I use it as). It's as good as it needs to be.Besides, the pieces get more interesting as you progress, some of the final pieces being \"Greensleeves\", \"Scarborough Fair\", \"The Entertainer\" and \"Amazing Grace\" (and written in a way so that each hand will be dually occupied). And by the end of the third book in the series, you'll be playing some of Beethoven's most popular pieces, like \"Fur Elise\" and \"Moonlight Sonata\"!Also -- something that concerned me when I bought this book: do you need a full-fledged piano? The answer is...no!! A sizable keyboard will do you just fine. But, you just might find yourself looking to buy a real piano once you delve deeper into these lessons...because this series really does inspire and nurture a great love for this amazing instrument.If you're looking to learn the piano and can't afford a teacher, don't have time for one, or you just learn better on your own -- this is a must-have aid to your learning.Good luck, and I wish you well in your learning!! :)",
                "review/helpfulness": "173/179",
                "num_reviews": 179
            },
            {
                "review/text": "I am using this book for piano lessons I started taking in early January. I've wanted to learn how to play the piano my whole life and now at 40 I decided to do it. This book makes it very easy, so far anyway! The pace is steady, I look back now at the songs in the beginning that I struggled with and they are so easy! The combination of warm-ups and songs are just right. I highly recommend this book!",
                "review/helpfulness": "156/164",
                "num_reviews": 164
            },
            {
                "review/text": "Okay, I am a &quot;middle-aged&quot; adult, and for years wanted to learn to play an instrument and be able to read music. I first started out with the violin because I really liked the instrument, but didn't continue because it was too much at once (violin + reading music).Anyhow, I recently picked up the Alfred's Piano course, in conjunction with a keyboard purchase, mainly to teach me how to read music. The piano was a learning tool more than anything. But this book has sparked my interest in the piano! I'm actually having a lot of fun &quot;playing&quot; the lessons (the keyboard helps too).Overall, this is a great book that combines lessons, theory, and technique.. It's exactly what I was looking for. If you order the book, I'd recommend getting the book/CD combo.",
                "review/helpfulness": "112/121",
                "num_reviews": 121
            },
            {
                "review/text": "This book is good for adult beginners in that it starts them playing songs right away. It uses a Middle C approach, however, which I do not care for as I think it makes it more difficult to play later on. I teach piano for all ages and I've found that when I use the Music Tree series (for adults and children) my students have an easy time reading music. When they use a Middle C approach, they associate the fingering with note names and have a hard time telling me that the 2nd space in treble clef is an A (and so on). Re-learning to read music is always frustrating. That being said, I do think adults have an easier time breaking this habit, so I would not say not to purchase this book. There is also theory in it, which is a plus. I would say it is good, not great.",
                "review/helpfulness": "68/72",
                "num_reviews": 72
            },
            {
                "review/text": "I have not taken any piano lessens before. Now I can play two tunes,\" The Entertainer&quot; and &quot; Que Sera Sera&quot; in one month by just following the instruction in the book. I am really happy with this book. When my friend listened to my play through the telephone, she said she wanted to buy the book.",
                "review/helpfulness": "28/34",
                "num_reviews": 34
            },
            {
                "review/text": "I purchased 10 copies of the \"Adult All-In-One Course: Lesson-Theory-Technic: Level 1\" piano book to teach in a junior high after school program. I love it. The students are learning to read and write music. Playing even the simplest pieces with the CD accompaniment has kept themmotivated, practicing, and improving, weekly.Great book! Great service, Amazon!Thanks,DianeGrateful teacher in California",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "About a month ago, I decided I wanted to learn to play the piano. I have been playing guitar for almost 5 years but had no experience with reading music or any professional training, and since I want to start recording some songs soon, I thought it would be nice to have some piano skills.I chose this book based on other reviews, and they had me convinced. Well I've been using this book for about two weeks now and I cannot be happier! It's ultra-comprehensive, and starts simply but moves quickly. I love the exercises included in the book; they have helped very much with reading notes (which I am finally learning!) I'm almost on page 40 (out of more than 150, I believe.) The songs to practice are fun, and I can't even believe how much I've learned in the small span of time I've been practicing.If you want to learn how to play the piano, buy this book! I can't say whether it's a substitute for a good teacher, since I've never had one, but if you are self-motivated and prefer to work at your own pace (and thus enjoy learning even more!) I would recommend this book 100%!Hope this helped!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "Based on a few recommendations, I decided to give this book a whirl as my first introduction to piano playing. I can read music thanks to the high school music course several years ago, but I'm pretty rusty. Trying to fit this in between university studying and homework, I decided to go the self-taught route, though I absolutely recognized this as generally being a poor decision. But hey, I'm pretty self-motivated, so why not?I made it through level 1, and part-way through level 2 before deciding to switch books. There are several major problem with the series that I've noticed and that eventually drove me away from it, as well as various minor issues.The first problem is the music. It sucks. No better encompassing word for it. The music is simplistic and boring. A lot of the music consists of simple Christian hymn-style tunes. I might have expected \"When The Saints Come Marching In\" and its friends in a children's piano course, but this is being aimed at adults. The music has no atmosphere, no texture, and overuses simple refrains (again, a lot of this is what one would expect to hear in a church). I'm not religious, but I'm not opposed to good classical religion-inspired pieces; these are not that. Level 1 ends with a simple arrangement of \"Amazing Grace\" as its anticlimactic grand finale. It's hard to remain motivated when, no matter what you do, you don't like the sounds that are coming out of the instrument.Another problem is the hand positioning it teaches you. The book picks a few very rigid positions and sticks with them. Your hands will be in C, G, or middle C positions (with both thumbs on middle C). That's it. The first level doesn't encourage moving your hands around, except as optional supplementary bits on a couple exercises where it encourages you to move up an octave or two (still staying in C, G, or middle C). The second isn't much better. By the time you need to move your hands, you're too firmly set in the way you've been taught which inevitably results in a frustrating stall.A similar problem exists for the left hand. The book will teach you a chord. You then play that chord in the next several exercises, even when it sounds ugly (these are ugly arrangements of boring songs). Then it adds another chord, and then you play the two chords in the next several exercises. You're not given much more to work with on the left hand until much later on, and then, again, it's too late. Stall, crash, burn.One issue that only really became apparent after I switched away from it is that this series doesn't teach you much about music. It teaches you how to play a keyboard. It doesn't teach you why you're playing what you're playing. It doesn't give you any background information on the style of music, the piece, the composer. All how, no why. Again, this hurts motivation, and it does nothing to encourage improvisation or composition.Generally speaking, the book is slow. Exercises progress sluggishly, with considerable repetition (and with the musical selection, little to no reward for that repetition). There are few pieces that are even a little long, and it often felt like I was just memorizing a song rather than learning any useful techniques.Finally, the very worst thing about the entire series are the CDs that come with it. I can't say enough bad things about these. You get a terrible sounding \"recording\" that sounds as though it was recorded using the built-in Windows MIDI synthesizer, with a piano on one channel and an awful \"band\" accompaniment on the other. It's about the same quality as you get from an $80 keyboard's auto-accompaniment feature, and it's utterly wretched.After this experience, I decided to try my luck with something else. Based on other Amazon reviews, I picked upThe Piano Handbook (A Complete Guide for Mastering Piano, Book With CD)(also, with more reviews and a Kindle version but a higher hardcover price, atThe Piano Handbook: A Complete Guide for Mastering Piano (wth CD); as far as I can tell, same product), as well asPiano Workbook: A Complete Course in Technique and Performanceboth by Carl Humphries. They're terrific, but considerably more difficult than the Alfred series; they can't be worked through at anywhere near the same pace as the Alfred books, and they can occasionally get frustrating. The payoff is much greater though. The two books complement one another, each progressing the same way but providing different exercises. These books do everything the Alfred series didn't. They have terrific music, even right off the bat, starting with great classical pieces that don't get grating after only the second time through. The books provide background on the piano itself, on the musical styles you're looking at, the songs and composers. They have basic advice on improvisation. They *focus* on one area of music at once, gradually progressing in a very natural way. In opposition to the Alfred series, Humphries' books have you moving your hands early on, and doing all sorts of things with the left hand. The sustain pedal, rather than being thrown at you before you even have the loosest of grasps on the keyboard, is added when it makes sense. And the CD is terrific, with actual piano recordings from an actual human playing with actual emotion.The Humphries books just highlighted for me exactly what was wrong with the Alfred series. Piano books don't need to be boring and demotivating!",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "I am a new piano player and have found this to be an excellent book for teaching the basics of music theory and getting me to the point where I could play pieces such as Greensleeves and Scarborough Fair that actually sound quite good. The down side is the CD - as others have said the CD is a big disappointment and a waste of money. I expected to hear a single piano instrument but the piano is accompanied by other instruments and, having an untrained ear, I can not pick out the piano form the rest and therefore found the CD useless.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Some reviews here say the CD is flawed because the recordings are not solo piano demonstrations and can be confusing for the learner. I do not agree with those reviews. Here is why;On each piece, the background accompaniment instruments are heard on the left channel of the recording. The piano part is demonstrated on the right channel. On many sound systems, balance between the left and right channels may be changed, either by adjusting a single \"left/right balance control\", or by adjusting the volume of the left and right speakers individually. These adjustments allow isolation of either the accompaniment instruments or the demonstration piano part, or modification of the blend between the two.Alternatively you can convert the each recording to MP3 (or other) formats and get a good media player where you can have a control over left/right volume channels.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            }
        ]
    }
]