[
    {
        "Title": "my shining star raising a child who is ready to learn",
        "description": "Provides helpful tips and practical guidance for preparing a preschooler for his/her first classroom experience through straight-forward text and colorful illustrations from the author of Read to Your Bunny.",
        "authors": "['Rosemary Wells']",
        "infoLink": "http://books.google.com/books?id=KZT0AgAACAAJ&dq=My+Shining+Star:+Raising+A+Child+Who+Is+Ready+To+Learn&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Rosemary Wells is known for her commitment to children's literacy. Her \"Read to your Bunny\" campaign rolled out across the country a few years ago. Wells addressed a group of librarians recently and passionately discussed the education challenges facing our schools and our nation. Young children are struggling more than ever in school. The reasons are numerous and familiar to most of us. Rather than continue to bewail the whys and wherefores of the issue, she used a brilliant analogy to explain what we need to do.She pointed out that if a building was on fire and hundreds of people needed to be saved it would take the clear voice of a fireman, issuing simple commands to evacuate everyone to safety. (Instead of dithering about discussing why the fire started and how fires really are a problem for certain kinds of structures, the important thing is to get safely away.)Her book \"My Shining Star: Raising a Child who is Ready to Learn\" was written with input from teachers and librarians all around the country. Wells lists ten virtues which parents should promote to prepare their child for the most wonderful adventure of all, education.She addresses parents in the preface:\"All children bring to school what they learn at home.This book is about creating a home full of harmonyand the preparation of a successful child.You are your child's first teacher.\"Her virtues include Respect, Listening, Patience, Trust, Work, Honesty, Time (\"Children spell love T - I - M - E,\") Reading, Writing, and Habits.This little book is only 13 pages long and only has about 25 words (at most) per page. Wells's lovely rabbit drawings warmly illustrate each virtue. She lays out a path for raising a child who is ready for school. It seems so simple and so obvious but so many children arrive in Kindergarten ill-equipped to learn.If you know a family with young children, present them with a copy of this tiny treasure.This little book is going to be my gift to new parents along with Goodnight Moon and a Mother Goose book.During her speech she also related a story about a principal she knows who works tirelessly to awaken parents to the needs of their children. He tells them to \"Grow up! Pay attention! Be Responsible for your child!\" I did not know that, nationally, only 26% of all parents attend their kids' Open House or Back to School nights.The alarm has sounded and Rosemary Wells has given us ten simple steps to help children get ready to learn.",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "In \"My Shining Star: Raising a Child Who is Ready to Learn,\" it's parents who learn what's important when it comes to raising their kids and getting them ready for school. This book features ten simple, but very important lessons that can be a cornerstone for raising kindly, well-mannered children.The book starts right off with Rule #1 --- Respect. It says basically that when children are treated with respect, they will have self-respect and will learn to have respect for others. Another great rule is #6 --- Honesty, which says that children need to be taught to respect the truth and see justice used at home.Never heavy-handed, but plainly put, these lessons are golden. The book of the book contains endorsements from Robert Coles (a child psychologist at Harvard University) and Jason Kamras (2005 Teacher of the Year.) But I think after you read it, one if its biggest endorsers will be you. The book is illustrated in the familiar Rosemary Wells style, using her classic rabbit characters seen in book such as \"Read to Your Bunny.\"",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "the night before kindergarten",
        "description": "In the narrative tradition of \"The Night Before Christmas,\" shows children from all over town preparing for their first day of kindergarten, imagining what wonders they will see.",
        "authors": "['Natasha Wing']",
        "infoLink": "http://books.google.com/books?id=K4coEAAAQBAJ&dq=The+Night+Before+Kindergarten&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I like the way the book begins, with children thinking and wondering about kindergarten, the night before school begins. But the book then turns to the mommies and daddies, who stand crying at the door on the first day of kindergarten. I didn't really want to give my daughter any ideas, as she was already a nervous wreck. The teacher assures the parents that everything will be fine, but I really didn't like this part of the book at all.",
                "review/helpfulness": "74/78",
                "num_reviews": 78
            },
            {
                "review/text": "I have seen many stories about children going off to school for the first time but this one has a surprising difference that really sets it apart from the others.The poem begins on the night before kindergarten with children and parents getting ready for the big day. Then the day arrives and we see children and parents as they prepare, go to, and arrive at school. There is much said about a lack of napping places that does not match my children's experiences. But then we see how the parents are saddened by leaving their kids behind. The resourceful teacher manages to find a quick solution and all ends happily.The first day of school can be hard for children and adults alike. This is the first book I have come across that deals with the excitement and hesitancies on this special day. A very fun book for parent and child.",
                "review/helpfulness": "30/31",
                "num_reviews": 31
            },
            {
                "review/text": "I bought this book for my granddaughter and for a friend's child who is entering kindergarten. Loved the idea of making children aware that this is a big step for them but somewhat bitter-sweet for their parents. Mentioned leaving their baby things behind as they go into the big school world. Pictures were very up to date--clothes, backpacks, school supplies. Very well done. I would extend the age range for appropriate readership through kindergarten age and not limit it to preschool.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "I do not recommend because it essentially presupposes that kindergarten is a scary place and that you only need to overcome your fears when entering this frightening place. That's how it seemed to me, at least.Instead of describing kindergarten as a fun, happy, loving place, it talks about how children are at first afraid, but then learn to like it. Why even suggest that your child should be afraid?Worse, in the book, all the parents stay in the classroom, outside the door watching. That's not how school works. The parents are not there, so why suggest that they are going to be at the door looking in during the day?Not recommended. The other \"night before\" books I like, just not this one.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I bought this for my 2 year old who was starting Preschool and she LOVES it! It has darling illustrations, a cute story and a happy ending.....I recommend this one!",
                "review/helpfulness": "11/13",
                "num_reviews": 13
            },
            {
                "review/text": "We've read several other books that are modeled after \"'Twas The Night Before Christmas\" and have enjoyed them. The rhyming of this book is enjoyable, but there are several things that I did not like. 1) There is a reference to \"day care\", stating that \"Some kids brought blankets or their favorite stuffed bear, in hopes they could nap like they did in day care.\" My daughter asked what day care was. 2) Too much was made about parents crying, and it is not appropriate. If parents are crying, a 5-year-old does not need to be burdened with this. In the book, the parents stayed at school, crying and watching, while the kids did about a dozen activities! That is totally not realistic. In fact, the crying parents (and the children setting THEM at ease with a final goodbye and hug and wave) seemed to occupy the bulk of the book, instead of focusing on how the child is getting bigger, and going to like school, etc., etc.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "I purchased this book for my daughter and read it to her a few weeks before her first day in kindergarten. It does have a neat ending, which I think helps children forget about their fears of the first day of school. Even though kindergarten has started, my daughter still likes me to read this to her.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "I teach preschool children and I am giving copies of this book to the parents of my graduates. It has a nice surprise ending that is appropriate for that first hard day!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "We received this book in the mail coming from our new kindergarten teacher.My daughter (5) loved the story - she found the part where the parents cry amusing!This book accurately described our actual experience the first day so for us there were no surprises and my daughter loves the fact that there is a beautiful rhymed story about our experience.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I thought this was an excellent read for children about to enter Kindergarten...not every book has to be realistic, because, let's face it, Kindergarten can be scary to a 5 year old. I also purchased a number of other books for pre-K and read those, along with The Night Before Kindergarten, to my 5 year old. He particularly enjoyed this book, because it's easy to understand, the rhyming makes it fun and it ends with the grown-ups crying, which he thinks is very silly.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "what about me twelve ways to get your parents attention without hitting your sister",
        "description": "Presents positive methods that young readers can use to get their parents' attention and deal with sibling rivalry.",
        "authors": "['Eileen Kennedy-Moore', 'Mits Katayama']",
        "infoLink": "http://books.google.com/books?id=JyfyAAAACAAJ&dq=What+About+Me%3F:+Twelve+Ways+to+Get+Your+Parents%27+Attention+(Without+Hitting+Your+Sister)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a favorite with my children. It has proven a great conversation starter with them on what is good behavior and it offers \"twelve ways\" to children on how they can get their parents' attention through positive means. When we read it together they will often say \"I do that! I do that!\" -- taking pride in their positive behavior.The pictures and words are simple so that even the younger ones will page through it on their own and try out one of the \"twelve ways\" with their parents.I highly recommend this book.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I loved this book! It has concrete examples of how to deal with your children and to teach them how to deal with each other. I would recommend it to anyone with more than one child.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "If you have more than one child, you need this book! It is a wonderful book to read with your kids. Beautiful illustrations, a good conversation starter, and a fun (and constructive!) way to address sibling rivalry.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "This wonderful book is a great choice for reading to young children! It is educational, of course, offering kids positive ideas for getting attention from Mom and Dad. Most importantly, though, it's also a joy to read - captivating kids with its fun rhymes and cheerful illustrations. A winning combination and a must-have for the bookshelf of every family with young children.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "\"What About Me?\" is an excellent book for children. It teaches them important life skills that are so crucial and the illustrations are simply beautiful. This book is a wonderful way to address sibling rivalry - Great for the entire family.Mom Writer's Talk Radio www.momwriterstalkradio.com",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I loved this book for both the content and the beautiful graphics. I bought it as a gift for a friend and now that my daughter is getting older, I will be buying one for her playgroup interactions, as well as gifts for all my friends who are having their second and third children!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Kennedy-Moore has written a really useful and entertaining book for children of all ages. My 2-year-old is captured by the rhymes and rhythm on each page and enjoys the illustrations as well. She \"reads\" the book to herself, using the illustrations to remind her of the \"right\" ways to get my attention. \"What About Me\" is among her favorite books, and will be in a place of honor on our bookshelf for years to come!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "An altogether winning book: the verse captures precisely the thought and language of children and parents, and the illustrations delight with their portrayals of kids' moods in different situations. Every family should read--and reread--'What About Me' together.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "\"What About Me?\" is a fun book for kids. The simple, vibrant pictures and text appeal to young children. The main character is cute but mischevious, like a real kid! My boys love this book. But what's really impressive about \"What About Me?\" is that it teaches children an important life skill without everlecturing or preaching. At the end of the book there's a \"Note to Parents.\" I love the author's comments about 1) dealing with misbehavior by teaching kids positive ways to ask for what they need and 2) helping kids to feel capable by offering them choices rather than rules. \"What About Me? is destined to be aclassic!| | | | | Inbox",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "Enhanced with delightful illustrations by Mits Katayama, What About Me?: Twelve Ways To Get Your Parent's Attention (Without Hitting Your Sister) by clinical psychologist Eileen Kennedy-More is an encouraging collection of creative, fun, and nice ways to approach parents for attention, requests, or complaints. Giving such ideas as helping out, sharing, singing, and so much more, What About Me? provides its young readers with a fun and rhythmic presentation of good and rewardable behavior for a more intimate and loving relationship with parents. An ideal addition to child counselor, family, school, and community library collections, What About Me? is very highly recommended for all little readers -- and their parents hoping to instill responsibility in their children character and conduct.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "children just like me",
        "description": "Share the lives, hopes, and dreams of 20 children from around the globe as they talk about their family and friends, pets, school, and hobbies in their own words. Published in association with UNICEF. Full color. 16 pp plus 4 pages of stickers.",
        "authors": "['Barnabas Kindersley']",
        "infoLink": "http://books.google.com/books?id=AZWCPQAACAAJ&dq=Children+Just+Like+Me&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a collection of children around the world and is a wonderfull way to introduce your children to how people live around the world. Children of many different religious, finantial(very poor to quite wealthy), and ethnic backgrounds are given introduction within.You and your kids will meet children like Carlitos, a boy who lives on an Argintine ranch in a three bedroom house and rides horses and drinks Mate tea. -- Or Suchart, from Thiland, a 12 year old budhist monk in training who lives in a small hut on stilts, has no toys, and starts his day begging for alms in his small village. He likes the cats who live in the temple, and is always losing his sandals because he has to take them off before he goes into the temple and forgets where he left them. -- And Thi Lien, in Vietnam who wears beautiful batik died traditional clothes made by her mother, helps feed the families chickens and harvest rice, and collects firewood. -- And Celina, who lives in the Amazon Rain Forrest of Brazil in a mud brick two room hut. She likes to paint herself with die made from a local root every day, and has never worn shoes. She likes to take the canoe out on the river her family lives near.There is information about each child's favorite activities, what they eat, what they wear, pictures of thier home, family members, religious practices, and special things about thier cultures. This book has many children from Australia, Africa, The Americas, The Philipenes, Europe, Asia, India, and more. I have enjoyed looking at all the childred in this book and reading about how they live. Even though it's for children, anyone can enjoy this book. I only wish it had more children to meet. This book shows how children and people everywhere have the same thoughts, and fun, even though they may live in vastly different conditions.",
                "review/helpfulness": "41/41",
                "num_reviews": 41
            },
            {
                "review/text": "I bought this book recently to supplement my primary schooler's global cultures education. Something I did not note before purchase was the publishing date of 1995. Many of the pictures are in fact outdated now. But my chief complaint is that the buyer understand as I did not- this is not an atlas-accurate depiction of children by percent population in each country; it is actually more a compilation of minority cultures. The example children from the United States reveals this. For example, p. 6-7 show sample kids from several countries, some with typical appearances and names for their country like Yannis from Greece, Guo Shuang from China etc, but the US shows five children: two which appear hispanic (Nicole and Carlos), one eskimo, one unusual-looking chunky caucasian girl and one African American male with a seriously outdated hairdo and parachute pants. On the Americas page there is an entire line up of children, 24 in all, and only two caucasian kids in the whole line-up, which is a little odd. There are two eskimo children given two whole pages from the US and Canada (no other children from Canada- apparently they are all Inuit), where other countries with proportionately way more children like China do not get that much coverage. I unfortunately cannot tell if the children from the other countries are represented correctly, but the US is over-represented in general, as all the other countries have only 1 or 2 children. Tbe publishers should have left out so many extraneous US children, two children of ANY race would've been sufficient. I guess Australia's in the same boat as Canada as the only child represented is Aborigine, which is great to learn about, but not entirely a fair depiction of the continent. Oh well. The idea for the book is really cute, and the book is published with UNICEF, and when the subtitle says \"a unique celebration of children around the world\" they really mean it. Since this book functions similar to an atlas, it's a bit outdated,as mentioned. Each page includes a picture of the child, their home, food, family, school, favorite toy, friends, signature etc. Countries included: Canada, US (5x), France, Finland, Greece, Hungary, Poland, Russia, Japan, China, Mongolia, Thailand, Vietnam, Philippines, Indonesia, Australia, New Zealand, South Korea, India (2x), Tanzania, Ghana, Ethiopia, Botswana, Morocco, Jordan, Egypt, Israel, Argentina, Mexico, Bolivia, Brazil.",
                "review/helpfulness": "32/37",
                "num_reviews": 37
            },
            {
                "review/text": "In a world where we're all struggling to be a little bit more compassionate towards each other, this book is a must-have. My daughter got it when she was 3 and stared in fascination at the wonderful, clear pictures of children from all over the world. (One bonus is that this is a book that kids can \"read\" themselves.) Now that she's 4 she looks at the pictures and connects them to places on the globe with glee. She seems to delight in feeling a real connection to children from all over the world. Sharing this book with my child is always a wonderful experience - we discover something new each time.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I just got my book in the mail today. I bought the book because I homeschool my 6 yr. old daughter and thought that this book would shed some light on the subject of other countries and the way they live. The book is absolutely beautiful. Each page has information and pictures of where the children live, the climate, friends, family, where they go to school, food they eat, animals, what type of work their family does. This is a book that is suppose to be for children, yet I found myself wanting to creep off into the next room to look at the book alone. I even took the book to my dad's house and he liked it so much that I left it for him to look at. I would highly recommend this book for any age. Once you get it, you wont want to give it up. I believe my daughter will relate better to this book than any other book, because it deals with kids her own age. Make the investment. You wont regret it.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "This is a truly marvelous piece of work featuring so many different children from so many different parts of The Blue Planet! Those young folks all present a very insightful slice of their lives in such an amazing diversity of cultures that will really open the eyes of a typical kid here in America and everywhere else. Then he and she will learn that not all kids come in a similar package and that &quot;the small world&quot; is not really at all small in its great variety of human beings and their ways of life. So let all those wonderful kids take you on an eye-feasting tour 'round the whole globe!",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "I bought this book for my daughter who is adopted from China, and I subsequently bought it for five or six other children and am buying it again. It's great for kids of all ages. My daughter is four and loves paging through it, asking questions about the children. It is especially good for adopted children from China because the page about the girl in China tells about how in China they may only have one child. I highly recommend this book!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "My son got this book when he was barely 3. He loved it from the first day, even though it is written for a much older child. Now almost 5, he still loves this book---he will spend a full hour with it, examining every page, peering at the details, noting each child's way of life. In a small way, it has exposed him to ways of life he'd never otherwise know at his age.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "voici l'exemple du sujet parfaitement trait&eacute;. Son iconographie est ce qui se fait de mieux. C'est &agrave; l'instar du livre de Peter Menzel un livre r&eacute;f&eacute;rence qui parle du temps r&eacute;el et se projette dans le futur. C'est un des meilleurs livres jamais publi&eacute;. Il existe en France un autre titre consacr&eacute; aux jeunes Franais. Mme pr&eacute;sentation remarquable.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is the very best non-fiction children's book weve seen, and we have a library of almost 1000 children's books for our daughter. Also check out its companion titles, &quot;Celebrations&quot;, etc. Our daughter began enjoying this book at age 3. She already has a great grasp of geography just from this book.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I used this book in my third grade classroom. My student population was very diverse and it was a great way to help discuss not only the many ways that we are different but also the many ways we are all the same. My students loved to see how other kids dressed and were especially interested in what other kids ate!! A great book to have in any classroom and I even bought it for my two year old son's library.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "not everyone is nice helping children learn caution with strangers lets talk",
        "description": "In an effort to teach caution with strangers, the authors provide a list of guidelines to show children how to protect themselves and seek help in frightening situations.",
        "authors": "['Frederick Alimonti', 'Ann Tedesco']",
        "infoLink": "http://books.google.com/books?id=FgcKAAAACAAJ&dq=Not+Everyone+Is+Nice:+Helping+Children+Learn+Caution+with+Strangers+(Let%27s+Talk)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a great children's book, teaching children about the potential danger represented by strangers in a way that is very entertaining and not at all scary.The prior reviewer neatly summarized the story line, so I won't retype the same things. What I will add is that I got this book for my nephew and it turned out to be the perfect gift-- he enjoys the story and the colorful pictures, yet at the same time he is learning a very important lesson. Every time we get to the part in the book where the little girl approaches the stranger in the car, my nephew tells me \"that's a no-no.\" He doesn't seem scared or anxious, yet he's learned the important central lesson of the book.One of the co-authors is a psychologist and she's obviously taken great pains to make sure the tone of the book is exactly right for young readers. Included also, for parents, is a list of safety tips, which my sister, as a first-time parent, found extremely useful.Before I read the book, I worried that it might be too serious and intimating for children, but having seen it, I'm a big fan. I'll probably buy several more copies as gifts for other children we know.",
                "review/helpfulness": "26/28",
                "num_reviews": 28
            },
            {
                "review/text": "Teaching children to be cautious around strangers cannot be stressed enough. This book does an invaluable service in helping parents address issues of what to do if approached by a stranger and safety steps the children can take. It is NEVER too early to teach children about safety. Sadly, in some worst case scenarios, the point becomes moot. This book is a good preventive tool.The story focusses on a little girl who is nearly kidnapped by a stranger. She is easily misled into thinking he is a nice man. The book provides parents, educators and others with a forum to discuss why not everybody is nice and preventive steps one can take to stack the safety odds in their favor.Making safety talks a regular part of one's lives and routines will ultimately save a lot of lives and also provide tools to build a safer world.",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "In today's world, it is very important to speak to children about safety and strangers. How do you begin such discussions with young children? Much information exists to help parents teach children what to do in dangerous situations. Parents should begin teaching children about safety at a very young age.The book, \"Not Everyone Is Nice,\" gives parents an opportunity to discuss stranger safety with young children. The story is about a little girl who is almost kidnapped by a stranger. The story explains that there are many people in this world who are nice, but there are also some who are not. The book includes some safety tips for children and parents.MyParenTime.com recommends this book -- it gives parents a great opportunity to discuss stranger safety with their children. If parents make safety discussions a part of their child's everyday lives, they will be become informed and empowered...and not afraid to discuss their own safety as they grow.",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "My daughter (just turned 4) was not scared by reading this book and could relate to the little girl. She had a lot of questions which is a very good thing as it got us talking about strangers. The book also has helpful suggestions for kids and parents in the back. Whether you buy a book or discuss this issue on your own the following fact from the back cover made me realize how VERY IMPORTANT this topic is: \"Of more than 800,000 children reported missing each year (2,000 a day), 52,800 are abducted by strangers (National Center for Missing and Exploited Children)\".",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I just received this and I'm confused by the positive reviews. I think the book was a good idea, but the authors needed a merciless editor. The book is WAY too long: 20 pages with 80 words on some pages, practically a term paper, a painful one. The book is recommended for ages 4-8, but the drawings and language are more suited for 3-5 year olds; in fact I found the language down right condescending (babyish). There's a weird lack of cohesion about the whole book, like the authors hadn't quite figured out what they wanted to say or who they wanted to say it to. This book isn't appropriate for anyone.",
                "review/helpfulness": "8/10",
                "num_reviews": 10
            },
            {
                "review/text": "I don't know...I have an almost-4 year old. Maybe I am struggling with the transition from children's books where kids wander off and handle themselves alone (Goldilocks), or they save the day (Lazytown), or they identify nice men by the colors they wear (Dr. Seuss's Mr. Brown and Mr. Black). My child didn't understand -- even after two readings of this book -- that Mr. Green was not a nice man and was trying to deceive the child in the book. The analogy to beautiful but harmful sea creatures was a good one. I have tried to reinforce that message. The situation on the street corner wasn't scary enough to make any impact. After reading the book twice, my child still saw no problem with accepting the candy from Mr. Green. Instead of this book, we are watching (repeatedly) our newly purchased Safe Side DVD. Because of that fabulous DVD, I think the concepts are finally sinking in.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My main problem with this book is that it is based on the incorrect assumption that strangers are primarily responsible for sexual abuse and abduction of children. Most offenders are people a child knows, most often family members. When an individual is looking for children to abuse, they often become friends with the family and child before beginning to abuse. Including information about strangers is useful, but focusing on that possibility leaves a child vulnerable to sexual preditors that s/he knows.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "all about me",
        "description": "The young reader may fill in the appropriate personal data to complete his \"very own\" autobiography.",
        "authors": "['Dr. Seuss']",
        "infoLink": "http://books.google.com/books?id=6Bt1JonSpzwC&dq=All+About+Me&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "We were so disappointed upon receiving this book. What we especially didn't like about this book was the page that says, referring to the adopted child, ... there are lots of special things about me but the most special thing about me is that I am adopted... We do think that being adopted is a very special thing and one to be celebrated but there are many things about a child that are much more special. (I.E. Their unique and special personalities)",
                "review/helpfulness": "7/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a nice book for introducing a young child to the concept of adoption. There is a place for the child to draw pictures of him/herself, his/her family and their house. With just a few pages in very simple language, the book talks about the birthmother, the adoptive parents, and uses the analogy of &quot;adopting&quot; a pet.",
                "review/helpfulness": "7/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is a wonderful tool for parents and adopted children. The interactive, large-format pages allow children and parents explain their emotions in a safe and friendly environment. It is a must for adoptive parents.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "We love giving this beautiful, interactive book to our friends who are adopting children. As an adoptee, I appreciate the simple and friendly way the subject matter is addressed and especially the unique way of involving the children. We have been told more than once that this book has been the favorite gift received.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "My husband and I read this book and thought it marvelous. You see, my husband was adopted and he thought it was very nice that someone would take the time and initiative to write a book like this. He said he wished it had been around when he was a kid. He also said that he thought this would be a very appropriate book to give to a child that had been adopted.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I was delighted to discover this book. It is a terrific interactive tool that makes talking to young children about being adopted easy. I found the comparison between adopting a pet and adopting a child an analogy that helps very young children understand the concept of adoption. I highly recommend this book to any parent who has adopted young children.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "your childs growing mind a guide to learning and brain development from birth to adolescence",
        "description": "A thoroughly revised and updated edition of the classic guide to childhood development describes a child's mental and emotional development and examines the ways in which children develop language, memory, and other skills, explaining how parents can help their children learn and emphasizing the importance of play, imagination, and creativity in the process. Reprint.",
        "authors": "['Jane M. Healy']",
        "infoLink": "http://books.google.nl/books?id=fAMZmJfc0pEC&dq=Your+Child%27s+Growing+Mind:+A+Guide+to+Learning+and+Brain+Development+from+Birth+to+Adolescence&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This excellent and easily read book is a &quot;must read&quot; for parents. As a support group leader for 37 home schooling families, I recommend this book as a priority buy for the home library. It gives parents a realistic view of what children are and are not capable of at different stages in their developement. It helps us realize just what our children's capabilities are and how to maxamize our teaching.Dr. Healy's writing style is very easy to read, informative and lively. The chapters are laid out in such a way as to make it easy to find any area of interest. For most of us, motivation is a subject we discuss often. Under &quot;Tools for Learning,&quot; she lists &quot;Motivation (pg.190),&quot; and &quot;Ingredients for Motivation (pg. 214). In each chapter, she outlines key information about the subject, for example &quot;Raising Motivated Learners,&quot; and &quot;Dealing with Motivation Problems.&quot; She gives anecdotal stories to underscore the information she presents, which makes it much easier for a layman to understand.This book definitely impacted not only my teaching style, but bettered my relationship with my teenager. This is an important book to have in your home.",
                "review/helpfulness": "49/50",
                "num_reviews": 50
            },
            {
                "review/text": "If you buy this book to learn about your baby, plan to hang on to it for many, many years. I have a newborn AND a 14-year-old. Although there was a lot of interesting information concerning my newborn, I learned even MORE about my older child! I really wish I had had this book a few years ago when she was struggling through sixth and seventh grades. I finally understand why she struggled! There were tips in this book that would have helped. This is a book I will try to reread at least once a year because the information is relevant to so many stages in your child's life. It is easy to read, enjoyable and useful. I especially like the bullet points of things to do at the end of each section.",
                "review/helpfulness": "42/45",
                "num_reviews": 45
            },
            {
                "review/text": "It details in a clear, parent-friendly way the various developmental phases growing children go through and explains why it is so important that they be allowed to go through those phases. I wish this book had been available when my children were young! It makes an excellent gift to give to new parents.",
                "review/helpfulness": "35/38",
                "num_reviews": 38
            },
            {
                "review/text": "This book is a must given the intense pressure on kids placed by parents and educators on the young nowadays. I have enthusiactically recommend this books to all my friends with young children. The topics on the development of the brains is definitely a good read for parents who are pushing their kids beyond their development stage. Beware that your kids may miss out on developments/experience that will be necessary in the later part of his/her life",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "Just ordered another 3 copies of Healy's book (1994 edition). This book was recommended in my doctorate program in education as a MUST HAVE for anyone who is expecting. The suggestions of how to build brain capacity and learning begin while a woman is pregnant, so I've purchased it for all female family members who are now expecting as well as those who have recently had babies. I've also purchased a copy for my elementary school's parent resource center. The information presented in Healy's book presents the transitions of the brain through the school years in a practical, easy to understand manner.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "why doesnt anybody like me a guide to raising socially confident kids",
        "description": "A parent's love is absolutely essential, but there comes a point when it alone is not sufficient -- when the epiccenter of acceptance shifts from home to school, from family to peer. This practical, persuasive guide shows parents how to raise their children so that they will be popular -- well liked by their peers. Social competence in children of all ages, Marano says, is not a luxury. Rather, it has an essential impact on a child's later life -- on his or her health, happiness, intellectual capacity, and above all, success. But how can parents foster the qualities and skills shared by every popular child? And what can mothers and fathers do when their youngsters stumble, struggle, or suffer? This friendly, impressively researched, and enormously informative guide explores a wide range of issues and concerns including: The perils of overprotective -- how to safeguard children without smothering them, and how to turn a shy boy or girl into a confident kid Good kids, bad kids, and outsiders -- who gets picked on, why schoolyard cruelty hurts everyone, and what a parent can do when a child is having trouble Peer pressure and interpersonal solutions -- how children learn to interact, from the playpen to the playground and beyond, and how parents can foster crucial social skills at every age Temperamanent and tantrums -- why youngster act up, from the Terrible Twos to teenage rebellion, what such behavior means in different situations, and how parents can turn conflict into cooperation Prescriptive and practical, \"Why Doesn't Anybody Like Me?\" offers parents down-to-earth advice on everything from helping their children make new friends to managing schoolyard bullies. Marano's perceptive insights are powerful psychological strategies parents can use help their children build the interpersonal skills that will carry them through life that form the core of every strong friendship, every satifying marriage, and every successful business partnership.",
        "authors": "['Hara E. Marano']",
        "infoLink": "http://books.google.nl/books?id=CrEDHAAACAAJ&dq=Why+Doesn%27t+Anybody+Like+Me%3F:+A+Guide+To+Raising+Socially+Confident+Kids&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is one of the best parenting books I have ever read. Although there seems to be lots of research as to how children act in a social context, little or nothing has been written for parents. Ms. Marano makes a very convincing case that social competence is very important for children, citing lots of research in a very clear manner (too bad the publisher decided to leave the references out). She explains in detail what makes a child well liked by other children and what not. She also points out that, although social competence is in part a genetic matter, parents have a lot of influence on their children's social behaviour. She offers lots of (fun) suggestions for improving children's social skills. I thought this book was a real page turner and highly recommend it.",
                "review/helpfulness": "67/68",
                "num_reviews": 68
            },
            {
                "review/text": "I agree with previous comments about the amount of research that went into writing this book, however after reading through all of the research, I had a feeling of doom. I have two sons aged 7 and 4, and my oldest is having difficulty making friends at his new school after our family relocated from the midwest to the east coast. I was looking for fun, practical solutions to helping him make new friends. What I found was a book that explained extensive research on the subject of popularity,but many of the comments made by the author left me feeling that my son had little hope in improving his social situation. I especially felt disheartend to find that according to the author, a child's social standing is pretty much determined by the first grade! My son's in first grade now. I was a psychology major in college, and could appreciate much of the research, but the book read more like a textbook to me than a book for parents looking for practical solutions to helping their kids form friendships.",
                "review/helpfulness": "57/57",
                "num_reviews": 57
            },
            {
                "review/text": "This book is more of a research summary than a guide to helping your child. It is interesting and enlightening on the subject of research that has been done on kids social interaction, but its limited material on how to help your child is vague and not very convincing. It left me feeling that: yes, I recognized my daughter as a socially unsuccessful child, but I didn't know what to do about it. If you want an excellent how-to guide, try \"Good Friends are Hard to Find\" by Fred Frankel.",
                "review/helpfulness": "43/43",
                "num_reviews": 43
            },
            {
                "review/text": "I grew up as a tormented outcast, and my biggest fear about having children is the dread that they might be like me. This book, which collects a lot of solid and well-researched information in one place, has helped to ease my fears. Now I understand many of the things that went wrong for me, and that helps me to believe that it doesn't have to be that way.Don't just ignore your child's unhappiness. Take this crucial problem seriously, and buy this book to learn about the underlying factors and some of the practical steps you can take to help.",
                "review/helpfulness": "25/27",
                "num_reviews": 27
            },
            {
                "review/text": "This is a good base for parents whose kids are having a hard time in school. I found it to be very Cause & Effect which was just what my son (and I) needed. I read it three or four years ago when my son was having a dreadfully hard time. I put the concepts from the book to practice in my own way (i.e., \"movie dates\" with him where we watched movies and discussed emotions and 'reading' people's body language). No my son is 12 and in 7th grade and he has friends, not tons, but a few, but he is happy and content. Kids like him, he doesn't feel desperate to fit in.This book is very practical and well worth the time to read and money spent to have it be part of your library... along with Brazelton and Sears.",
                "review/helpfulness": "22/25",
                "num_reviews": 25
            },
            {
                "review/text": "Citing considerable scientific research, the author paints a vivid picture of the social dynamics of a child's world. She describes in detail the different social \"categories\" children are automatically placed in by their peers (bullies, victims, etc.) as early as kindergarten and first grade. For these categories, the author describes how differences in parenting styles and methods can contribute to a child receiving a particular label.As a parent of a toddler and a preschooler, this book helped me to understand how I can contribute to my children's social development in a meaningful way. Topics such as the importance of free play vs. organize classes, and how to help the developing brain learn to manage emotions were particularly helpful. I feel lucky to have read the book early in my children's lives, since I now have some specific tools for helping my child become socially confident.The author makes it clear that social issues arise early, and can stick with a child for life. Unfortunately, the book provides little guidance for parents of older children who are struggling, and how to change. In that regard, the title seems to be somewhat misleading -- unless you consider your children to be \"raised\" when they hit kindergarten! Also, the book is far from a \"guide\". Though the content is excellent, the sections that provided specific tips for parents were overly simplistic and seemed to be something of an afterthought.For parents of very young children, I would consider this book a must-read. If you have an older child who is struggling, I think the book might miss the mark.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "Only buy this book if you want to feel your child is a loser, it's ALL your fault and there's nothing you can do about it, EVER! I'm not even going to pass this book on, it's going in the trash! That being said, there are some great kids social skills books out there: 1.) The unwritten rules of friendship 2.) Nobody likes me, everybody s me 3.) Good friends are hard to find",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the upsidedown kids helping dyslexic children understand themselves and their disorder",
        "description": "The stories of eight dyslexic children depict its symptoms and explain how they can be helped",
        "authors": "['Harold N. Levinson', 'Addie Sanders']",
        "infoLink": "http://books.google.com/books?id=2rhW3iXD0yQC&dq=The+Upside-down+Kids:+Helping+Dyslexic+Children+Understand+Themselves+and+Their+Disorder&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book made a tremendous break through in my son's ability to see his dyslexia as a medical problem. He always thought of himself dumb and stupid. His eyes filled with tears as he read about himself through the football players words. He identfied so well with the dyslexic character that since we read the book, he has never once referred to himself as dumb or stupid again. This book has given my son so much more than I could ever tell him. Every dyslexic child should read this book and hopefully they to will gain what a parent can't tell a child.",
                "review/helpfulness": "33/33",
                "num_reviews": 33
            },
            {
                "review/text": "THIS BOOK IS A MUST READ FOR KIDS,KIDS AT AT HEART,PARENTS TEACHERS,EDUCATORS(ETC) IT'S ESPECIALLY A GIFT TO THOSE LD/ADD/ADHD/DYSLEXIC INDIVIDUALS WHO ENJOY 12STEP (IE ACOA) BOOKS!! THE DRAWINGS ARE TERRIFIC,THE STORIES TOUCHING,TEAR PROVOKING AND ARE FUNNY &amp; EMOTION FILLED!! I WOULD BE DELIGHTED TO SPEAK TO ANYONE WITH QUESTIONS AND/OR COMMENTS AS I HAVE BEEN DR L'S VERY SUCCESSFUL ADULT PATIENT SINCE 9/84-PRESENT(AND AM VERY SIMILAR TO THE &quot;ANNA&quot; CHARACTER IN THE BOOK!)THE BOOK ALSO IS WONDERFUL AS IS ITS SEQUEL,TURNING AROUND THE UPSIDE DOWN KIDS, IN THAT IT ALSO INCLUDES PRAISE FOR THE IRLEN COLORED TINTED FILTER EYEGLASSES IN ADDITION TO THE INNER EAR MEDICATIONS. MARSHA LAMPERT MBA ,WANTAGH NY",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "I have three children with dyslexia and finding a book that helps them understand their problem without the scientific jargon is hard. This is an enjoyable read and helped me understand what the kids are going through. It also shows that an understanding teacher with a heart of gold can truly make a difference to their lives. More teachers should be taking the time to read books like these and they should be more understanding of the \"New\" children entering their classrooms.Congratulations Dr Levinson for a wonderful book it helped me and my children and I recommend this book to all parents that have dyslexic children.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I purchased this book to help my 7 year old son understand his dyslexia. Although the book was written in a way that children would readily understand the text, I disagree that it is for children between the ages of 4 - 8. I believe children between the ages of 9 - 13 would benefit most from it. Finally, if the child relates to one of the kids described in the book, I believe that it would be frustrating to not find any helpful strategies at the end. Maybe they are in the next book?",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "my precious child affirmations for the child within",
        "description": "My Precious Child is a book for children and adults that will bring joy into your heart. Each page features a photograph of a child capturing the poignant innocence and vulnerability of childhood accompanied by loving, nurturing messages.",
        "authors": "['Mary L. Williams']",
        "infoLink": "http://books.google.com/books?id=RfrKwmciXnYC&dq=My+Precious+Child:+Affirmations+for+the+Child+Within&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is delightful for adults working on inner child issues!",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Wonderful for children of all ages. Both my kids have enjoyed this books and still do...one is 9 and the other is 17 mos. Makes you wish someone had read it to you.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "This book is an afirmation of self worth for adults, but more, it is a wonderful vehicle to express to your children how much you value them. It contains a multitude of ways to expand on the over-used phrase, &quot;I love you.&quot;",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is such a beautiful book. It feels really healing just to look at it slowly and take in the photos of children and the affirmations. It is especially helpful in hard times when you can picture yourself as a child hearing these important words that everyone needs to hear. It is also helpful as a parent- these are the words your children need to hear from you.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "russ and the apple tree surprise day with russ",
        "description": "After Russ, a five-year-old with Down syndrome, picks a basket of apples and helps his mother and grandmother make a pie, his grandfather invites him into the backyard for a surprise.",
        "authors": "['Janet Elizabeth Rickert']",
        "infoLink": "http://books.google.nl/books?id=Rk6vPAAACAAJ&dq=Russ+and+the+Apple+Tree+Surprise+(Day+with+Russ)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Russ is a charming little boy who happens to have Down Syndrome. This tale, told in photos and text, tells about his day with Mom, Dad, Grandma and Grandpa. The story works beautifully and Down Syndrome is never mentioned. Russ is just a little boy who happens to have Down Syndrome! Jane Rickert has written a simple, darling book about her own son and has let us know that he is just an ordinary boy who likes apple trees and surprises. Ms. Rickert read her story to children at an Inclusive Childcare Canter near her home. The children loved it and they still make it one of their favorites. It is read over and over again - the sure sign of a hit with the kids. This book points out the sameness between children, not the differences and that is incredibly important. I highly recommend this book for any child regardless of ability/disability.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I love the Day with Russ series. This is the first one of the series and it has a sweet, simple story. Russ is a little boy with Down Syndrome who wishes he had a swing in his back yard instead of an apple tree. When his grandparents come to visit they and his parents share a special time with Russ picking apples and making a pie and help him to appreciate the nice things about his apple tree. This is a lovely book with colorful photographs. Russ obviously has DS but it is never mentioned in the story. I can't begin to say how much that means to me as the mother of a DS child. These stories truly show the way children with DS are LIKE other children rather than dwelling on how they are different. What a great message! I highly recommend it for all children, especially those with DS or who may have a child with DS in their class at school. The books are hard cover with glossy photos and are very well constructed in addition to being terrific stories. I plan to donate all three Russ books to my son's classroom, they are exceptional books.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is superb. I happened to see it on the library shelf and I checked it out for my two year old daughter. She does not have Down Syndrome. She absolutely loves it, as do we. It is interesting, well-written, educational, and fun. It teaches some great lessons-- things are often not as bad as they seem; when you feel as though you have lemons, make lemonade; there are lots of ways to have fun; you don't need fancy toys to have a great time; nature is full of surprises. The length of the book and the pace of the book are just perfect for her. The photographs are terrific and give us a lot to talk about. I would recommend this book to all young children. It is simply charming! A great find!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "children at war",
        "description": "De soldaten van het Rode Land en het Blauwe Land zijn al jaren met elkaar in oorlog. De zoon van de Blauwe koning bedenkt een plan om hieraan een einde te maken. Prentenboek met grote schilderingen in bijzondere kleuren. Vanaf ca. 5 jaar.",
        "authors": "['Anaïs Vaugelade', 'Noortje Dwars']",
        "infoLink": "http://books.google.nl/books?id=IsGDpwAACAAJ&dq=Children+at+War&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book talks about the active recruitment of children in many areas of the world today. He covers how they are recruited, abducted or conscripted, trained and finally set off to fight in whatever hot spot is active at the moment.The one surprising thing about this book is that it treats this as a new problem. War has always been a young persons game. To read the biographies of woldiers of World War II, a surprising number lied about their age to join the army at fifteen or sixteen years of age. In the American Civil War around 100,000 soldiers were fifteen or younger. A surprising, but unknown number were under ten. The pictures of the end of the Third Reich show young boys greeting Hitler. The first American killed in Afghanistan was shot by a 14 year old sniper.On the other hand, by bringing attention to the fact that our Army will have to face children in the battlefield Dr. Singer may help prepare our forces and our public for the real world.",
                "review/helpfulness": "13/15",
                "num_reviews": 15
            },
            {
                "review/text": "Reading through the other reviews here it struck me that they seemed to share a lack of prior knowledge about the subject. Had anyone read more widely they would have discovered that 'Children at War' is a piece of pseudo-scholarship. This book is based upon a completely misguided assumption - that the involvement of children in warfare is a new phenomenon. In making such an assertion the author reveals either lack of any proper engagement with the literature or simply bad faith. The sad fact is that children have been involved as solidiers in many, if not most, of the wars recorded in history. In spite of Singer's erroneous claims to the contrary, the US Civil War involved large numbers of boy soldiers. Similarly the First World War. Children fought and died with the partisans in Nazi-occupied Europe, and so on. Towards the end of the book, Singer reveals a disturbing political agenda. It seems that his real concern is less with child soldiers and more with the challenges for US troops faced with children in places like Afghanistan and Iraq where killing them is bad for morale and also looks so bad to the folks back home watching CNN.In terms of sources, Singer relies overwhelmingly on journalistic accounts that are simply intended to offer shock value to their readers and, like his own book, lack any deeper engagement with the history and context within which child recruitment takes place. Aside from one quote, none of the copious quotes from child soldiers seems to have come from Singer's one fieldwork. Indeed, the reader is left wondering if Singer has ever actually visited a setting where child recruitment takes place.This is a work of truly poor scholarship. It is a mystery how it ever got published and why so many people have been apparently taken in by it. Perhaps it is a case of telling people what they want to hear?If anyone is looking for a proper discussion of this subject they would do far better to read David Rosen's 'Armies of the Young'.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "The face of warfare has changed dramatically in the late 20th and early 21st centuries. In the first years of the new millennium, we rarely find state-led armies clashing across the boarders of sovereign nations. Rather, most wars occur within the boarders of an autonomous state. Civil and guerrilla conflicts have replaced the international and colonial wars of the recent past. All too often, the armies fueling these new internal struggles for power are composed of children.Dr. Singer has created an excellent and through study of the new phenomenon of children at war. Singer looks at the variety of ways that child soldiers are recruited across cultural and political arenas, the perceived benefits of child soldiers to their political patrons, and the long-term repercussions of inundating the world's children in to an existence based upon violence and death.Singer's work is based upon personal interviews with child soldiers, adults involved in the raging conflicts, as well as international aid agencies, the UN and others closely involved in the \"new warfare.\" Such a work is an invaluable contribution to the emerging cannon on the changing face of warfare. Only with such studies will the world begin to see the problems of children at war, but also begin to create solutions.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "War is so terrible that sociopathic leaders in some parts of the world use child soldiers, ages 12 - 18, to fight their wars. This book tells the terrible story. This is not a new problem. Even in the American Civil War about 100,000 soldiers were age 15 or youngr. Many parts of this book are shocking as it explains the recruitment, training, and discipline of these young children as they are developed into brutal soldiers at the same time that they are robbed of their childhood.",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "As far as I know, Singer is the first to point out that child warriors are making possible a new kind of war, a war without ideology or purpose other than taking something someone else has. Adults fight better with a cause and a purpose--children are more easily drugged, brainwashed, and cut off from other support. They can also be far crueler in battle and harder to rehabilitate. Singer points to responses to lessen the problem, but she is far from optimistic.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Back in the mid-1990s I spent many months reporting on child soldiers in places including Sierra Leone, Liberia and the Democratic Republic of Congo. I wrote from the immediacy of a journalist's perspective, but was unable to examine the cause-and-effect realities of this disturbing phenomenon. In \"Children at War\" P. W. Singer has produced a truly important study of the socio-cultural, economic and historic causes behind the militarization of children in Africa, Asia and Latin America. Singer's work is an incredibly valuable contribution to further the study and understanding of armed conflict in the post Cold War-era. This book is a must read for anyone interested in the welfare of children and the state of our world in often-neglected locations such as sub-Saharan Africa. It is also an insightful look at how \"warlordism\" and the greed driving so-called commodity wars is changing the face of modern armed conflict.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "This is a welcome follow-up to the author's previous work \"Corporate Warriors.\" While each book highlights an emerging and disturbing trend in modern warfare, the practices described in \"Children at War\" are particularly horrific. Training children as young as 12 to kill without mercy and to be used as cannon fodder to shield adult soldiers sounds like some crazy vision of a dark future. Singer, however, builds a strong case that this dark future is here. It would be easy to blame this on one or two sadistic tyrants, but Singer shows how a confluence of global factors have led to this situation. What to do with these children when the fighting ends, or when they are rescued from a war zone is a challenge that the global community is just beginning to recognize. While the author does what he can to recommend a solution to this problem, there are no obvious solutions. This may not win an award for \"Feel Good Book of the Year,\" but it should be a contender for \"Most Important Book of the Year.\"",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Leadership in war by children (i.e. God's Army/Tailand/led by twelve year old twins) overturns basic concepts in warfare \"Over time, children gain combat skills and become shockingly efficient fighters--\" (p. 87) Children bind to their groups. They disconnect from their old lives. War is exciting. The process is psychological. Children persist for friends. Fear is a major bond in war Ritual accompanies it. The book is in thorough and scholarly detail. What can be done? Governments could make more effort. They could disarm, demobilize and reintegrate. They could rehabilitate. However, child soldiers are on the rise. Guns are cheap. Lives are cheap for them. The future, unfortunately, means more child warriors not less. Eric J. Lindblom PhD Harvard",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "The Author writes about a chilling new chapter in post-modern warfare. It is a very objective and scholarly work that covers in comprehensive detail the underlying causes, recruitment, implications and response to \"Child Soldiers\". The author calls this a \"new Doctrine\" and not only covers the problems, techniques, tactics and procedures; but, also offers lessons learned and suggestions for countering this new dimension of warfare.As a doctrine developer and trainer to the new Afghan National Army, I found this book extremely valuable. Despite the fact that you may get either emotional or angry at the author for how he conveys his message in select chapters, I strongly recommend that you purchase this book. If you are preparing to deploy to OIF or OEF, Buy this book and struggle through the entire book. In some cases you may feel like skipping chapters or even throwing it away, Dont do either. Read for UnderstandingTerry Tucker,Adjunct Prof Military Studies/HistoryTrainer and Doctrine Developer to the Afghan National ArmyCombined Security Transition Command-Afghanistan",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            },
            {
                "review/text": "It's a great that another book has been written on this deeply troubling yet narrowly recognized problem in today's world affairs.The author presents the problem, traces its roots, lists a wealth of examples and statistics, discusses the causes and effects, and proposes solutions while recognizing the difficulties.I hope policy-makers would read this book and recognize the grave consequences that this salient problem would entail if it is not dealt with quickly and effectively.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "never talk to strangers",
        "description": "Discusses different situations to help make important distinctions between people who are \"safe\" and people to avoid.",
        "authors": "['Irma Joyce']",
        "infoLink": "http://books.google.com/books?id=siZpHjMbeZ0C&dq=Never+Talk+to+Strangers&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I purchased this book at the same time I purchased Protecting the Gift: Keeping Children and Teenagers Safe by Gavin De Becker. I read Never Talk to Strangers first, and was very disappointed. What do camels with bony knees, grouchy grizzly bears, parachuting hawks, a rhinoceros waiting for a bus, coyotes asking the time, and cars with whales at the wheel have to do with teaching my child about strangers - other than their ability to rhyme with the phrase &quot;Never talk to strangers, please.&quot;?After reading Protecting the Gift, I decided to return this book rather than share it with my 3 1/2 year old daughter, especially after the author specifically mentioned the book Never Talk to Strangers in a chapter about why merely teaching children not to talk to strangers doesn't work. I would rather teach my children that it is *strangeness* (inappropriate behavior that's relevant), not strangers, that can be dangerous.",
                "review/helpfulness": "24/35",
                "num_reviews": 35
            },
            {
                "review/text": "I was so excited to find this book, it had been a favorite of mine as a child. Unfortunately when it arrived I was horrified to find that it was published with a new illustrator. The old book had the most beautiful, colorful, magical illustrations. This new addition is drab, and lacks any of the charm of the previous edition. Im sending this book back. Although the theme of the story is an important one, its a shame that they had to change the illustrations.",
                "review/helpfulness": "29/32",
                "num_reviews": 32
            },
            {
                "review/text": "This was one of my favorite books as a child. It was very clear to explain how children should be aware of strangers. This book gave a good description of some of the &quot;animals&quot; children should be aware of by using animal pictures. Considering some of the problems going on with children missing today this book should not be out of print!!!!! I would love for every child in my family to have access to this book.",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "So who WAS the stranger, was it the bear, or was it the Camel, or was it the bee playing a bassoon? My kids couldn't tell you.Unfortunately I read this story with my kids the first time. I was horrified as I read through it with them. They enjoyed the silly humor, but I bought this book to teach them about strangers and strange behaviors.This book completely missed the mark! How often does a Camel or a rhinoceros barge in to their lives? I had to explain to them, after the story, the whole stranger theory. And the first thing out of my child's mouth was \"Ya, and you got to watch out for camels too.\"To make matters worse it suggests that because your friend or family knows someone, they are \"OK\". Most sexual offenders are by people your friends or family know.I don't think this is really a book for young children. I think it is too confusing to distinguish WHO the stranger is and how to handle a real life situation. Such as getting away quick and telling a trusted grown up.All and all, I might be over reacting a little bit but when it comes to such a difficult subject, I want to make sure they CLEARLY get the message I am trying to teach them.",
                "review/helpfulness": "11/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is an old-time favorite book of mine, published the year I was born. I've waited a long time to find a copy for me to share with my child. The illustrations are fabulous and the rhymes keep kids giggling. It's a sweet message, but not one that's meant to teach all aspects of personal safety. I'll always love this book!",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "A reality based approach to teaching children to avoid strangers is best. Kids NEED to know that a grandmotherly lady may in fact be a threat and the nice man given out candy is to be avoided. NOT 'don't talk to the pushing rhino or the grumpy bear' What young kid will get the point of this book? And NO, the Easter Bunny is not to be trusted 'because everybody knows him'! This book gives kids the wrong idea completely. Be honest with your kids. A little fear of strangers is a good thing. Look into John Walsh's \"Stranger Safety\".",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book was a part of my childhood collection and I loved it. Can't wait to see the updated illustrations. Strangers were always a tremendous and constant concern to my parents and I can say that this book was a great help in starting conversations and showing us the difference between a stranger and other people we encountered. As a teacher, mom and former child, I highly recommend this story. It is both effective and enjoyable.",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Finally I found someone else who has heard of this book! This is a fun little rhyming book for children. It teaches lessons about not talking to strangers, but the book seems a bit naive by todays standards. Read it to a child for the just for the joy of it. You may find it a great opportunity to start up an important conversation with him about strangers. You may just like the rhymes.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            },
            {
                "review/text": "I agree with some of the points that previous reviewers have made about the world that we live in today and that not everyone can be trusted ... HOWEVER ... there is something to be said for misleading statements. Pages such as \"everybody knows the Easter Bunny\" can open the lines of communication between parent and child at an early and CRITICAL stage in a toddler/preschool childs life.TALK TO YOUR KIDS ABOUT SAFETY -- don't wait or wish that a book will do it for you!!! If you expect a book to teach your child right from wrong or about not talking to strangers, you are sadly mistaken.Reading to your children is a fundamental and entertaining way to continue to build the bonds of trust between you and your child. You SHOULD read this book to your kids and then explain to them that not all can be trusted but that it is worth the time to know and understand the difference and proper manners.The excellent illustrations and clever rhymes will build a continuity for your child. I remember reading this book when I was in kindergarten and now years later, I still believe that it is a good read. Times haven't changed much when it comes to who you can and can't trust.Be smart, take the time to talk to your kids about who can and can't be trusted, but don't blame the message and disregard it completely. That is one thing that won't change ... \"NEVER TALK TO STRANGERS\".",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "My parents bought me this book when I was a kid, and I read it so many times I almost had it completely memorized. It taught me to be careful about strangers -- it actually scared me a bit, because I was afraid that if I talked to a stranger, he might kill me and chop me up in little pieces. But, it is a good lesson for kids to learn (especially nowadays), the pictures are fun, and the story is fun to read (and be read to).Edit:Thanks for the alert from other posters, I purchased from one of Amazon's resellers and got the old edition with the charming illustrations that I loved. My son is still too young to understand the lessons of this book (and now I'm having some reservations about that, he's such an outgoing, charming child and I don't want that to change ... maybe I'll temper that lesson with \"don't talk to strangers if mommy or daddy isn't with you\") and we enjoy sitting and looking at all the funny creatures in the pictures. If you can find an old edition, buy it instead.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "parents guide to raising a gifted child recognizing and developing your childs potential",
        "description": "LEARN TO MEET THE NEEDS OF YOUR GIFTED CHILD Though academic abilities have always been important in determining whether your child is gifted, talent in the visual or performing arts, leadership qualities, and intellectual curiosity are just as vital. But unless we as parents help nurture those talents, our gifted children can become bored, socially aggressive, or, ironically, underachievers in the classroom. Here is a practical, informative, and authoritative primer for raising and educating our gifted children from pre-school to adolescence. Beginning with sensible strategies to determine whether--and in which areas--your child is gifted, this book takes parents through selecting an appropriate day-care center, a school, and a home reference library. It helps us figure out where our role stops and the school's role begins, as well as detailing ways to keep our children's creativity alive and how to cope with sibling rivalry and our own doubts and fears. Also included are a recommended reading list, a special section on the roles of the computer and television in your gifted child's life, and much more.",
        "authors": "['James Alvino']",
        "infoLink": "http://books.google.com/books?id=4IVoEAAAQBAJ&dq=Parents%27+Guide+to+Raising+a+Gifted+Child:+Recognizing+and+Developing+Your+Child%27s+Potential&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a wonderful resource for parents and teachers alike. The explanations of gifted children and their strenghths and weaknesses have never been explained in such simple terms. Parents can rejoice in knowing their child is not alone and teachers and finally understand that gifted doesn't mean perfect. I would recommend this book to any parent/teacher/administrator that feels they need help in understanding some of the actions of their &quot;brighter&quot; students. Thank you Amazon for recommending it!",
                "review/helpfulness": "29/31",
                "num_reviews": 31
            },
            {
                "review/text": "My son has shown a gifted ability early on. He was reading by the age of 2 and was absorbing knowledge like a sponge. When he reached age 4, he was reading at a first grade to almost second grade level and starting to do math. I was not sure how the keep him challenged and he was getting super bored with school. This book had many great pointers for both gifted and average kids. I am of the belief that all children have the advanced capacity to learn and that all children have learning \"growth spurts\" and stagnation in learning. This book points out getting passed the lull in learning. This book really lays out what the child might be feeling because is written from a person who is gifted and understands that from the child perspective. It also really is a good source for dealing with gifted children when they reach their teens. I definitely keep the book handy for when my son reachs that age. It is a very good read for children's education!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "scary news 12 ways to raise joyful children when the headlines are full of fear",
        "description": "A comforting, practical guide for parents and educators filled with realistic suggestions forprotecting and nurturing a childs inner spirit during challenging times. The author uses scientificresearch to explain why it is important to protect children from the frightening realities of todaysheadlines, while encouraging parents to realize that their intuition is their greatest asset.",
        "authors": "['Lorna Ann Knox']",
        "infoLink": "http://books.google.com/books?id=yIiAzgEACAAJ&dq=Scary+News:+12+Ways+to+Raise+Joyful+Children+When+the+Headlines+are+Full+of+Fear&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Scary News: 12 Ways To Raise Joyful Children When The Headlines Are Full Of Fear by Lorna Ann Knox (a former nurse and health educator, and currently a teacher in Portland, Oregon) is a resource for raising children in a modern age full of terrors. Offering guidelines for teaching children of various ages and stages of development, from early childhood to teens, how to lead balanced lives without being overwhelmed by news of horrible events such as war, natural disasters, terrorist attacks and economic busts. Scary News is not an escapist guide; it stresses the importance of learning information, but balances that with the key of learning to make life choices out of love, not fear. A reassuring and knowledgeable supplement for answering some of the most difficult questions a child can ask.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "As a Child Development Specialist, parents and teachers often ask me how much their children and students should be told about certain tragedies headling the news. It's a complicated question, but Lorna's book is full of fresh, practical ideas to help guide us. During the Tsunami event, a Kindergarten teacher at my school struggled with how much information to discuss with her class of 5-years olds. I gave her my copy of Scary News, and after reading it she declared it to be \"wonderful\", and asked that our school purchase more copies for our staff and parents. Scary News is a resource book that should be in every parent's library.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "disability is natural revolutionary common sense for raising successful children with disabilities",
        "description": "In this user-friendly book, parents learn revolutionary common sense techniques for raising successful children with disabilities. When we recognize that disability is a natural part of the human experience, new attitudes lead to new actions for successful lives at home, in school and in communities. When parents replace today's conventional wisdom with the common sense values and creative thinking detailed in this book, all children with disabilities (regardless of age or type of disability) can live the life of their dreams. Readers will learn how to define a child by his or her assets - instead of a disability-related \"problem,\" and how to create new and improved partnerships with educators, health care professionals, family and friends.",
        "authors": "['Kathie Snow']",
        "infoLink": "http://books.google.com/books?id=UppIAAAAYAAJ&dq=Disability+Is+Natural:+Revolutionary+Common+Sense+for+Raising+Successful+Children+With+Disabilities&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "There are just two forms of human beings--male and female. All other differences--size, race, nationality, disability, are just part of the human experience, according to Kathie Snow in this wonderful book. What a refreshing viewpoint! Challenging parents to see their children as regular human beings who have much to offer, and are not defined just by their disability, Kathie then guides parents through the process of changing how others view their child. A good explanation of 'people first' language will inspire readers to change the way they speak about their child, which will change the way others view him. This is not a book about a specific disability; Kathie speaks from her personal experiences as well as from the experiences of other parents whose children have a variety of disabilities, as she developes a blueprint of how to create positive change for all children. After all, since disability is a part of the human experience, (fifteen to twenty percent of us have one), living with, growing up with, going to school with children who have a disability prepares children without disabilities for real life! And the reality is that 15 to 20 percent of the children of today, will be parents of children with disabilities tomorrow...... what better way to perpare for this than to really get to know children with disabilities in your own childhood? Kathie also suggests that parents and professionals have to work together to meet the needs of children. Pointing out that professionals are people too, she advises parents to get to know the professionals in their child's life, and to build relationships with them, in order to get them to understand the parents' point of view. Parents who believe in inclusion will be affirmed by reading this book. Parents who like the idea of inclusion, but think it wouldn't work for their child, will be inspired by this book. And parents who are afraid of inclusion will be enlightened when they read this work. Anyone who reads 'Disability Is Natural' , will come away with a new perspective on what disability really means.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "For as big a help as Dr. Spock was for raising babies to those of us who knew nothing, &quot;Disability is Natural&quot; is as big a help I think at raising a child with a disability. My child has a disability and I have read a number of more &quot;clinical&quot; types of disability-related books, but this one is a genuine shift in thinking. I really liked how the author (who also has a child with a disability) describes so many common sense approaches to raising kids to be independent and live the lives of their dreams. This book is very helpful in providing guidance for how parents work positively with educators, medical professionals and others who might approach disability as a situation &quot;to be fixed&quot; with therapy, segregated settings and &quot;no, that's not for you&quot; attitudes. Instead, Ms. Snow talks about natural, inclusive settings and teaching your child to follow their dreams (just like all children). I have never read anything like this, and I learned so much about what to expect as my child goes through elementary school, middle school, high school, and into independent adulthood. It has been very helpful, too, for my parents to read and better understand that our family is as natural as anybody else's.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "Finally ONE book that has it all! Thisis a MUST READ for all parents of children with disabilities!I have ordered so many books that didn't deliver the content that I was looking for. The reviews, the synopsis were grossly exaggerated or just plain wrong.BUT Disability is Natural is different! I am going to require (or try to) my son's future teachers to read `Disability is Natural' over the summer break. I am going to encourage every one of you to order and read this book as soon as possible. Not only will it inspire you, it will give you the tools you have been seeking!Not only does Kathie Snow accurately chronicle the history of disability, the current situations with our special education system and a variety of professional and parental attitudes that affect our children for a lifetime, she then provides the means for preventing history from repeating itself, changing the system, and changing our attitudes as well as other's attitudes.One paragraph that intimately touched me discusses what happens to our children when we have `had enough' of the Special Education System and decided `I quit.' Her estimation is this happens around middle school and high school...I see the burnout occurring much much sooner in many cases, and potentially my case also (until now!)I will excerpt this paragraph here:\"When we've given up advocating, the dangers to our children are great. The middle and high school years are crucially important: they're the springboard for our children entering the adult world of work or post-secondary education. We desperately want out of they system, but since we quit advocating, we must go to the experts for vocational help. At some point, we may no longer have to deal with the system anymore, but our children will. Sadly, if we haven't prepared them for SELF-ADVOCACY, they'll be at the mercy of the experts.\"Now, she doesn't just lecture us on `how we should be thinking' she gives us to tools on `HOW TO DO IT!\"The book turns full circle from the history, where we are today, then HOWto successfully take our children into adult-hood and independence.Kathie helps us explore the natural resources in our community, what are they, how do we get them to work? (another excerpt) \"When we use the system, we have to follow the rules of the system. We must take the single path (eligibility and red tape)...&lt;snip>...In community there is not just one path to take, there are many. There are no rules, no passwords, no gatekeepers. In community, we get what we want and need using the same methods as others: using the existing resources in our cities and towns, depending on friends, networking, calling on old connections and making new ones, offering to give, being creative, thinking out of the box, and being both flexible and persistent.\"You will find practical things that you can actually DO. If your teachers read this book, hopefully their attitudes will change because they will be able to see where we have been, in a different perspective than \"I don't need any more work.\" Perhaps they will feel empowered to `change the system' and we can actually form a team!There are three sections of the book:The Way Things WereThe Way Things AreThe Way Things Can BeUnder the heading of `The Way Things Can Be' there are 11 chapters, I will list their titles here: `A New Paradigm' `People First Language' `Transformation' `Self-Determination' `Tools for Success: Meeting Needs and More' `Natural Lives in Community' `The Early Years' `Inclusive Education: Blueprint for Success' `Homeschooling, Unschooling, Alternative Education' `Bright Future for Teens and Young Adults' `Promoting Positive Images' Leadership and Influence'.These chapters provide the `How To' tools to raise successful children with disabilities. She frequently mentions stories of children with Down syndrome in the book as well as other different abilities.There is a thorough Appendix at the end of the book that lists Disability Organizations from all over the country.So, finally a book that has it all under one cover...yes it is over 600 pages long, and I haven't been able to put it down since it arrived last week! Covering therapy, assistive technology, education, life in the community, and finally leadership (every Disability-Related Organization's employees and Board Members should read this chapter)I will end with a quote from the back cover of the book, \"Bright futures are possible for babies, children, and young adults with disabilities. Let's dream big dreams for our kids and turn those dreams into realities, STARTING NOW!\"",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "Read the other reviews and you will hear raves for Kathie's book. I ditto all of them, with this addition: buy two copies. Once you have read this book and have begun implementing your new thinking, you are going to need a second copy to lend to all of those folks who need this wake up from Disability World.Thanks to my friends who chased me down and forced me to take a look at the damage I was inflicting upon my children, we have rediscovered the joy of one another. Life is wonderful. Children are awesome. Disability is natural.Take the time to read Kathie's fantastic book and leave chronic land ... you know the place ... thinking 10 years ahead ... worrying about every moment ... trying to \"fix\" that disability ... IEP battles ... say, \"Goodbye\" to Therapist Mom, Legal Pro Dad, and Peer Mentor Friends. Rediscover your child and reclaim your lives. Really!",
                "review/helpfulness": "4/5",
                "num_reviews": 5
            },
            {
                "review/text": "Kathie Snow is one of those rare writers whose every word I hang on to. By redefining my child she recreated my family. Her book has permanently and positively influenced the way I view people with disabilities. I check her website, ...on a regular basis. Visitors on this website can sign up to recieve her free email newsletter. Periodically hearing from Kathie is always a joyous event. I have a child with a significant disability and my journey has not always been easy. Thank you, Kathie Snow, for helping me along the way.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the safe child book a commonsense approach to protecting children and teaching children to protect themselves",
        "description": "It's the most urgent and highly publicized issue facing America's family: how to teach our children to protect themselves in any situation. Based on the author's successful education workshop, which has been in operation since 1969 and has educated more than 50,000 parents and children nationwide, The Safe Child Book gives parents effective and nonthreatening techniques for teaching children how to protect themselves without making them afraid. Written by one of the few nationally recognized authorities on the subject, The Safe Child Book provides a comprehensive educational program covering a wide range of topics that concern parents today, including sexual abuse, abduction, leaving children alone, surfing the Internet, school safety, and choosing a daycare center or babysitter.",
        "authors": "['Sherryll Kraizer']",
        "infoLink": "https://play.google.com/store/books/details?id=TVKpKolZ58EC&source=gbs_api",
        "review": [
            {
                "review/text": "This is a great book with very practical advice for educating your child on how to keep safe. It provides clear ways to educate and empower without instilling fear!",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is a great book to read. It is helpful to understand the problem that parents cause by sending conflicting signals to children. It also gives practical advice in how to teach your children to speak to stranges and others to avoid sexual abuse or abduction. It teaches you the ideas and concepts you need to better equip your children with the skills they need. Very helpful.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am a social worker and am always looking for ways to help kids learn how to keep themselves safe when safe adults are not available. This book gives great tips on how to teach kids how to do just that. Parents aren't always able to be there and this book gives kids tools they need to be able to rely on themselves if/when needed. I have read this book several times since receiving it and have used the methods with my own 4 year old child as well as the foster kids I work with. The book is able to be used with kids as young as 2 on up....great book with very practical and life saving advice.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the hurried child growing up too fast too soon",
        "description": "With the first edition of The Hurried Child, David Elkind emerged as the voice of parenting reason, calling our attention to the crippling effects of hurrying our children through life. He showed that by blurring the boundaries of what is age appropriate, by expecting--or imposing--too much too soon, we force our kids to grow up too fast, to mimic adult sophistication while secretly yearning for innocence. In the more than two decades since this book first appeared, new generations of parents have inadvertently stepped up the assault on childhood, in the media, in schools, and at home. In the third edition of this classic (2001), Dr. Elkind provided a detailed, up-to-the-minute look at the Internet, classroom culture, school violence, movies, television, and a growing societal incivility to show parents and teachers where hurrying occurs and why. And as before, he offered parents and teachers insight, advice, and hope for encouraging healthy development while protecting the joy and freedom of childhood. In this twenty-fifth anniversary edition of the book, Dr. Elkind delivers important new commentary to put a quarter century of trends and change into perspective for parents today.",
        "authors": "['David Elkind']",
        "infoLink": "http://books.google.com/books?id=6s607DFWiBgC&dq=The+hurried+child:+Growing+up+too+fast+too+soon&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "&quot;The Hurried Child&quot;by David Elkind gives concrete examples of some of the emotional,intellectual and social consequences of hurrying a child's development by both parent and teachers. Children today are under an enormous amount of pressure to act, dress and assume adult roles and responsibilities. This hurrying causes stress in very young children as well as adolescents. I think the book addresses a lot of issues that have negative impact on all children. I learned a great deal about what constitutes hurrying in young children. The author brings forth the fact that hurrying takes place in both the home and school settings. Children are pushed to read earlier than they are developmentally ready; do math and behave in ways that most theorists like Erikson and Piaget have shown to be in direct conflict with children's cognitive and emotional development. The book was excellent in demonstrating the impact of outside influences such as T.V, movies,records and the media on children's development. The achievements and limitations of the major stages of development were long recognised by Piaget on cognitive development and by Erikson on emotional development. The book emphasized that when children's needs become subordinate to parental needs their emotional as well as cognitive growth is affected. I recommend that anyone who gets a chance to read this book does so, especially parents and educators of young children.Agnes.",
                "review/helpfulness": "152/155",
                "num_reviews": 155
            },
            {
                "review/text": "Enough denialDr. Elkind is a veteran of decades in child psychology. As such, he&#8217;s surely seen the harsh realities modern adults perpetrate on their kids: the explosions in divorce, drug abuse, criminal behavior, imprisonment, and instability among older grownups once thought immune to these problems. Consider these shocking changes: in 1970, a 40 year-old parent was only one-sixth as likely to be arrested for a felony as his/her 14 year-old teen; today, the teen is more likely to be visiting dad or mom in jail. No generation of teens has ever suffered the kind of hard-drug addiction, family chaos, and adult disarray that modern youth routinely face.Yet, Dr. Elkind has remained steadfastly oblivious. Adults are fine, he insists; just a bit overworked and too trusting. The big problem, he soothes, is that we tragically misjudged how &#8220;incompetent&#8221; children and teenagers are and &#8220;hurried&#8221; them into premature adulthood while neglecting the evil influences of pop culture, the media, and peers.Well, someone should call an end to this charade, which is not Dr. Elkind&#8217;s alone, but a general American delusion. I only wish the kids I worked with in their families for 15 years, and the statistics I studied upon returning to graduate school, confirmed that the problem is as simple as Dr. Elkind depicts. But it isn&#8217;t.First, the kids are fine; it&#8217;s the adults who have gotten worse. Teens (despite their bad publicity) have proven admirably competent in assuming responsibilities at younger ages, which modern family instability (not pop culture) forced on them. Dr. Elkind (quoting secondhand sources he apparently never checked) claims in his 1998 and 2001 books that teenage suicide and murder have tripled in 20 years, that &#8220;more than 5,000 teens adolescents take their own lives every year,&#8221; that &#8220;substance abuse has become epidemic,&#8221; rising numbers of children commit &#8220;adult crimes (theft, robbery, murder),&#8221; that U.S. teens suffer the highest pregnancy rates of any industrial nation, and that &#8220;children in contemporary America, including advantaged children, are less well off than they were a couple of decades ago.&#8221;All of these statements are demonstrably false except the teen pregnancy claim, and that was more true in the 1950s than today. In fact:- The latest FBI statistics have shown for several years that teenage felony, violence, murder, and other crime have fallen to their lowest levels in 25 to 30 years. In states that keep detailed records, it is clear that the temporary surge in teenage murder in the early 1990s affected only poorer youth, nearly all connected to gang conflict over supplying hard drugs to aging Baby-Boom addicts. Meanwhile, suburban and other &#8220;advantaged&#8221; youth are safer from violence and murder than at any time in decades.- Teenage murder is a factor of poverty, not culture (and not race). Black youth suffer murder rates 20 times higher than white youth, and poorer white youth (ie, in Oklahoma) have murder rates seven times higher than more affluent white youth (ie, in Minnesota).- Teenage property crime (burglary, theft, motor vehicle theft, arson) levels are at their lowest level in 30 years, as are felony rates in general. - Particularly among younger kids (12 and younger), FBI statistics show murder arrests are at their lowest level in 1999 than at any time since data were first collected nearly 40 years ago.- Never, in nearly 100 years of U.S. mortality reports, have younger teenagers been safer from violent death than they are today.- The latest National Center for Health Statistics show 1,900 adolescents (under age 20) committed suicide in the most recent year, far below the &#8220;more than 5,000&#8221; Dr. Elkind quotes. Why on earth would he exaggerate teen suicide 250% and make it appear more normative?- Teen pregnancy rates are at their lowest level in 30 years (and birth rates at their lowest level since the 1940s). The U.S. rate is not due to teenage incompetence or pop culture, but poverty. U.S. teens who enjoy poverty rates as low as Western Europe&#8217;s (i.e., suburban teens) have birth and abortion rates as low as Europe&#8217;s; U.S. teens who suffer high rates of poverty have birth and abortion rates five to 20 times higher. How much longer are American authorities going to deny this?But false claims that today&#8217;s kids are uniquely messed up apparently are what modern adults want to hear. The unpalatable facts are that among adults ages 30-60 (the ones parenting teenagers) in the past 30 years, divorce rates doubled, drug abuse rose 400%, felony arrests doubled, imprisonments rose 300%, and an unquantifiable selfishness relegated childraising and children&#8217;s welfare far below adult needs. Anyone who doubts these trends is encouraged to consult your state crime, drug abuse, and prison agency reports.Instead of facing these troubling adult trends, a massive denial prevails, one insisting our kids and their &#8220;acting out&#8221; is what plagues the nation. In reality, we don&#8217;t know why kids got better as adults got worse, but surely that&#8217;s an intriguing question for psychologists and other experts to put aside their popular cliches and ponder. Dr. Elkind could do a tremendous favor by abandoning his specious claims that teenagers are incompetent and rushed into precocity by cultural influences. Youthsthemselves don&#8217;t have the luxury to evade adult-imposed poverty, domestic violence, and parental addiction and disarray, so why should we let Ph.D.s get away with denial?...",
                "review/helpfulness": "54/82",
                "num_reviews": 82
            },
            {
                "review/text": "In The Hurried Child, Dr. Elkind does a competent job of describing a seriously problematic trend- the increasing inability and even unwillingness to appropriately \"cushion\" children from the modern world. The message is simple and eloquent: millions of children are simply not experiencing a proper childhood for a multitude of reasons. For some, it may be overcompetitive sports; for others, early sexuality or economic exploitation (children wielding more money and being strongly pursued as a consumer group). But regardless of form, hurrying leaves children trying to deal with adult concerns. While such kids may seem sophisticated, the deeper reality is that they are still children. This false maturation interferes with real maturation, and leads to problems in adolescence and adulthood.Dr. Elkind gives this book more popular appeal by making his case gently- there are no \"Dr. Laura\" type challenges here. But if the reader will think through the implications of this book, it is clear that children are being \"hurried\" because parents aren't making the kinds of choices necessary for a fulfilling and protective family life. Instead, they pursue personal, material and status-oriented goods, very often to the detriment of the family. This is not because they don't care for their kids, but because our culture is so steeped in radical individualism and materialism that the very idea of what a family is supposed to be is lost. It is no surprise that the children suffer as a result, in terms of both emotional and character development.I would propose a more profound solution than the \"moderation\" one to be found in this book. The cult of the individual needs to be overthrown. Parents should never make family-altering choices based solely on personal desires; the good of the children and the family unit as a whole should strongly influence what each member does. In addition, the excessive emphasis on \"achieving independence\" in childhood should be balanced with a recognition that all children need to be nurtured according to their stage of development. Children are not ready to be \"individuals\" in the adult sense of the term, which is why they are so easily influenced by peers, advertisers and celebrities. A strong, loving and non-hurrying family is a far more healthy source of influence than such factors. The more parents recognize and act upon these realities, the less kids will be \"hurried\", and the more they will be \"trained up in the way they should go.\"",
                "review/helpfulness": "41/44",
                "num_reviews": 44
            },
            {
                "review/text": "This book is a great resource for parents and teachers. As an aunt, godmother, teacher and friend to many children of all ages, I turn to this book often. If you believe that children deserve a childhood, then this book is for you.",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "Dr Elkind has done significant research in the field of child psychology. While some of his research has been the subject of criticism, \"The Hurried Child\" makes some vary valid points. With his insite, it is difficult to pin-point when childhood is carefree.In a society the is influenced by the whims of the business world, the working class is easily influenced. Business wants better works that produce at a higher, more profitable rate. Their solution is to put pressure of the educational system. This brings issues of accountability into school. Rather than teacher kids how to think, schools have to focus their curriculum around pass a standardized test to continue to receive funding. In some cases, the standardized tests start before first grade. This is just a sample of te pressure children have to perform. It is no wonder so many kids are seeing terapists who perscribe medicine to keep them from going crazy.Elkind presents various other forms of stressors on children and discusses why the stress is unnecessary. If something is not done to reverse the trend toward increased stress in our children, it will only get worse. One must realize that generations have turned out ok before the trends toward accountability. Without this movement, we are likely to continue to be ok.",
                "review/helpfulness": "13/20",
                "num_reviews": 20
            },
            {
                "review/text": "I confess that I read this book because I already agreed with its conclusions and was looking for more rigorous support of what I have seen so extensively in an anecdotal manner. Case and point: this weekend, I overheard someone talk about how the school they attended as a child had the motto `College starts at two'. (This person and most of their friends got into elite universities. . . and then dropped out and spent several years figuring out what they wanted to do with their lives before returning to school.)So when Elkind writes, \"Hurrying children into adulthood violates the sanctity of life by giving one period priority over another. But if we really value human life, we will value each period equally give unto each stage of life what is appropriate to that stage.\" --- I can only agree with that.By the end of this book, however, I was reminded of the quote by Daniel Dennett: \"There's nothing I like less than bad arguments for a view that I hold dear.\" There are two major problems with this book.First, it's been inconsistently updated. Reagan's surgeon general is quoted in present tense and then there are references to Harry Potter. This really undermines the book, which is a broad category of nonfiction that could be called `alarming trends'. Like many of these books, this one grabs at anything recent that seems to support its main argument. But when time has passed since some spike in a statistic, it loses its ability to incite alarm. It does nothing for the book that it sees as evidence in its favor the spike in violence toward teachers in the late 1970s. I'm sure that the rate of violence toward teachers has gone up and down since then --- crime rates on the whole have dropped dramatically since then --- so tying the main argument to such things only diminishes the credibility. And it's not even clear where all this information is coming from, so a reference to a trend over `the last decade' leaves you wondering what decade Elkind had in mind.Actually, Elkind is just plain dated. His theoretical basis --- Freud, Piaget, Hans Selye --- were big in academia in the 1950s and 1960s. Only Piaget has really retained his standing. Selye seems more forgotten than rejected, though I think that most people, if they were informed of his views, would recognize that his conception of stress was very one-sided because it seems to imply that not moving at all is the key to a long happy life. And Freud has largely been reduced to a novelty over the last quarter century as it becomes increasingly clear that therapy based on his ideas has poor success rates and his cultural impact is seen in a more negative light (the way we now think of all touch as sexual, the moral panic over child abuse in the 1980s based on suddenly remembered memories, etc.).Second, Elkind is talking about sociological topics but thinks like a therapist. The logical way to structure this book is to talk about what children are capable of doing at particular ages and then compare that to what is expected of them and then explain the forces that push us toward demanding so much of children so early. Instead, this book feels like someone with a romanticized view of childhood clutching at their hair and moaning, \"Too soon! Too soon!\" The book is very anecdote based and seems driven more by a generalized anxiety about what's happening to children than levelheaded analysis. It also leads to some rather arbitrary conclusions, like disagreeing with a girl who thinks she's being hurried because she has four hours of homework each night and claiming that Brittney Spears is more developmentally appropriate for girls than Madonna.So when it comes time to explain why children are hurried, Elkind explains it in terms of Freudian family dynamics with only a vague awareness of how much of this has to do with economics --- the economics of corporations creating new markets and new desire on one hand and people's anxieties about falling behind economically on the other. Likewise, his `what to do' section starts off by saying that you can't change culture and suggesting semi-therapeutic responses.So honestly, I don't see much reason for reading this. It would have been great to read in the 1980s, but today it's not going to persuade the skeptical and it doesn't offer much advice to those trying to figure out what is the appropriate age for children to be doing things and how to combat unreasonable pressures. If someone can suggest a recent book that does do things like that, please drop me a line in the comment section.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "The author cautions against rushing life for young peopleand placing too many artificial pressures on them. Thesepressures come in the form of standardized tests, overschedulingand excessive concentration on child competence issues insteadof allowing young people to mature. Children are in essenceminiature adults. In addition, the author cautions againstassembly-line learning. Type A competitive children grow intoadults with more cholesterol in the blood than normal.On international comparison tests, American students tend toachieve lower scores despite all the pressure to do well.Only 1/5 of 17 year olds can write a persuasive essay.Clearly, the author has some important points to make.The readers should heed this advice and apply it accordingly.There is a need for balance in life. In this respect, the authorhas some important points to teach college administrators andparents. A wide constituency of educators needs to read thisbook dispassionately and apply it for the benefit of students.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "I read this book a few months back and I'm still not decided on whether I 'loved' this book or not. I did like the book. It provided a lot of information I wasn't aware of, but I'm not sure I really liked the set-up of the book or some of the content. The main focus of this book is basically what hidden aspects of growing up stress a child out, and how that stress affects a childs development. He touches on some of the basic aspects like divorce, and death, but most of the book focus's on things that force a child to grow up too quickly. The main conclusion of every single argument in the book is anything that forces a child to grow up too quickly or puts pressure on a child beyond their natural capabilites is stressful for a child.The first half of the book is kind of a summary of the second half of the book, which almost makes the first half pointless. The whole time I was reading it I was getting a lot of interesting information/opinions with very little proof of the points he was making. But the authors points and the information he was providing was interesting. The best chapter of the first half of the book is the chapter on Lapware (computerized learning devices). He provided great arguments, and very valid proof to back up his claims. His information would be great to base future lapware studies on. I don't want to blow this chapter for you, but his basic point is that lapware doesn't teach a child anything that he/she doesn't already know.The second half of this book is extremely well organized, and perfect for parents, or anyone with basic knowledge of child-development. I study child development and I don't know that I've read a better book or text-book that puts Piagets development periods or Erikksons theories into better context than this book does. The way he was able to use those theories in connection with his own research, and other research was excellent. It almost makes me wish this book had a broader range of topic. I could apply the information in this book to pretty much every child I know. If you have a child that shows any self-confidence problems this book will be very helpful to you. There's nothing mentioned in the title or the description about self-confidence, but after reading the book it's easy to see how the demands put on your child affect their confidence.There is a lot of basic information on various topics from the basic biological reactions of stress, to how schools operate. He makes very compelling arguments against the idea of \"early is better\" in education. He also provides good evidence in favor of keeping the arts in schools by showing that activities like gym, music, and art help children relieve stress which helps them focus more on academics (in addition to their artistic values).At times I found some of the information in the book repetitive. He touches on certain subjects like divorce, drugs, and education numerous times. It's all good information, but I would have liked to have read more on media effects and social aspects with other peers than was offered.Perhaps the best thing about this book is that it provides a good balance between statistical data based research without being so dense it's not readable by an average parent. The writing style is very basic, and his research is based on stats just as much as his own experiences as a therapist. So he backs up any technical data with a personal example to explain it and back it up. It's somewhat of a perfect book for parents looking to understand more about their children, and people looking for an easy book to read with solid research.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a really good book. I think that all parents should read it and learn to slow down in all aspects of their own life and that of their children. Some of what the author says is commonsense but much is sobering and needs to be said.It is a book I will continually refer to, to help me ensure that I'm on track and not rushing my children to grow up. Childhood is so short.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Elkind shows a keen insite into the brain of youth. A must read for parents concerned about the progress of their child.",
                "review/helpfulness": "3/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "inventing the child culture ideology and the story of childhood childrens literature and culture 17",
        "description": "Tracing the historical roots of Western culture's stories of childhood, this book looks at those texts in which the child is subjugated to the adult. Going back 400 years, it looks at Hamlet, the Brothers Grimm and Walt Disney cartoons.",
        "authors": "['Joseph L. Zornado']",
        "infoLink": "http://books.google.com/books?id=JX1DnwEACAAJ&dq=Inventing+the+Child:+Culture,+Ideology,+and+the+Story+of+Childhood+(Children%27s+Literature+and+Culture,+17)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book will change your views on how to raise your kid and, in a deeper level, help understand the deadlock our society is in and how to try to break free of our habits of violence and destruction.It analyzes the myths and books we feed our children and the subconscious message we hand to them everytime they go to a Disney movie or consume merchandising. It also explain the amount of violence they are directly subjeted too by unknowing and loving parents. Truly an eye opener.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Come and see a new intellectual baby! With this book, a new field is born: interpretation of literature from the perspective of a child's primal needs. Inventing the Child asserts two radical ideas: (1) that each work of literature reveals specific culturally sanctioned childhood violations of its author, and (2) that adultist ideology is necessarily propagated through literature, no matter how &quot;great&quot; that literature may be. J. Zornado has written an angry, impassioned, intellectually courageous book about childhood, literature, and adult blindness. His radical childhood studies perspective gives entirely new readings to Hamlet, Grimm's fairy tales, and Where the Wild Things Are, among other works. You don't have to agree with all his ideas--I don't agree with his second assertion above, if I understand it correctly--to be deeply impressed with what this book attempts and glad to embrace the new field it represents. Welcome to the world, Baby-as-yet-unnamed! (Radical childhood studies is not too catchy, but it will do for now.)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "This book has a keen approach and an insightful take on children's culture. As a student of J. Zornado and having read his book, I have gained a new perspective on children's literature and it's influences on children. While some of this information is quite difficult to swallow, I'm sure Dr. Zornado would reassure the reader by telling him or her, that this material is hard because it shatters the ideas that we have implanted in our minds....",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Inventing the Child is a book for every person. It is a masterpiece of insightful and passionate views on why our world has become the way it is(children killing one another etc.)...the ways that parents, culture and society tries to make children into what they think children should be. It helps to explain what is truly behind Walt Disney and his productions and why adults feel that they must dominate their children. It is a must read for anyone who has children of their own and for anyone who teaches children, it is also a must read for anyone who was invented as a child and is working through who they really are. J. Zornado has found and is helping the world to answer the question of why so much happens in our society that isn't &quot;normal&quot;. Let us be so thankful he is teaching this to college students and to the world! I highly recommend this book to all!",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            },
            {
                "review/text": "J. Zornado's clever and often humorous account on what it means to be a child is highly entertaining and thought provoking, touching on the works of Calvin, Freud, and Rousseau. The book delves deeply into the influence on the children of our culture through all mediums. A must read for all who are interested in the survival of our planet.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "growing up with diabetes what children want their parents to know",
        "description": "Explains the feelings of a child with diabetes and how the disease affects family relationships, the importance of diabetes education, and dealing with school, day care, and other relatives",
        "authors": "['Alicia McAuliffe']",
        "infoLink": "http://books.google.com/books?id=n-xFAAAAYAAJ&dq=Growing+Up+With+Diabetes:+What+Children+Want+Their+Parents+to+Know&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a well-intended but ultimately limited book that aims to embrace the large issue of shaping parental understanding of and response to their children's diabetes. This ambition is not well served by the book's brevity; given the author's own premise that diabetes is different for every child and every family, greater depth and breadth of discussion of the many issues at hand peppered with presentation and analysis of specific anecdotes would be useful here. As the mother of a newly diagnosed 12 year-old son, I think that this book probably best serves as a primer for affected families with younger children. I should think that the book's topic might be specifically addressed to families of adolescents (vs. younger children)in a separate work.",
                "review/helpfulness": "10/16",
                "num_reviews": 16
            },
            {
                "review/text": "This book was very informative and very encouraging for me as a parent with a newly diagnosed 18 month old child with diabetes. Not only did the author address the concerns of children with diabetes, she also zeroed in on some of my own fears, concerns and misunderstandings involving diabetes and how it affects the day-to-day activites in my family. I would recommend this book to anyone feeling overwhelmed and frightened with a newly diagnosed child with diabetes.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "A wonderful combination of accurate info, humor, and sharp insight into what it's like to be a child with diabetes. Parents will see themselves somewhere in this book (if not everywhere!). Parents get so caught up in the medical end of things - numbers, dosages, shots, carbs - this book really helps you see things from your child's point of view. There are helpful suggestions, often delivered with a description of a real-life situation the author has experienced, to get you thru rough spots. A great book!",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "This book is what every parent should get for their child with diabetes. It is a guide for children, written by someone diagnosed at age 11, it describes the emotions children go through after their diagnosis, why it is so important to go on living a normal life, and dealing with the pressures of doctors, relatives and friends. It even includes a chapter on how parents can give children independence as they grow up through adolescence. Written by someone who has been there, it is a unique book that offers much. Five stars!",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I could not put this book down! I was sad when I was finished reading it. It's so easy as a parent of a child with diabetes to lose focus on the emotional aspect of diabetes. We put so much time and effort into controlling it and trying to help our children deal with it. Reading this really helped me see diabetes through a childs eyes. Alicia clearly states some of the things we do as parents that really annoy our children, things that our children probably do feel but would never tell us. I really enjoyed this book and I hope a lot more parents read it.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "The title is misleading, this is more of an autobiography. Most of the book seems like a really long brochure for the author's camp! Her experiences don't fit with everyone who has type 1. She was diagnosed at 11, rather uneventfully. She doesn't present any other cases but her own. This book focuses alot on kids old enough to test and give shots themselves. It may be interesting for parents of older kids, but you won't find much of stuff that most kids want parents to know. In fact you won't find much material about any other kids at all! You'll learn alot about the author and her camp though.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "where the wild things are by maurice sendak novel units",
        "description": "Suggests activities for classroom use in connection with the reading of Where the wild things are by Maurice Sendak.",
        "authors": "['Anne Troy', 'Phyllis Green']",
        "infoLink": "http://books.google.com/books?id=o5bytwAACAAJ&dq=Where+the+wild+things+are+%5Bby%5D+Maurice+Sendak+(Novel+units)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "My two sons absolutely loved this book. They liked the idea of going 'where the wild things are' and the book inspired a lot of play in our house. The book nicely balances the child's need for imaginative thinking with a sense of limits, and the pleasures of home. The illustrations clearly make this book great, because they provide a launch pad for this imaginary place. This is one of a handful of books that will bond you with your child for the rest of your lives. Don't miss that opportunity!Unlike some children's books which are a little boring for the adults to read after the 350th time, I always enjoyed this one because I could think new thoughts each time I read it.I think this is one of the best five books for children.",
                "review/helpfulness": "101/107",
                "num_reviews": 107
            },
            {
                "review/text": "This is a story of a very bad boy's day of imaginative roll playing and final acceptance of his place in the real world. I love reading it to my little siblings and watching as their little faces lit up in recognition of adventures they had endured during their own periods of bad behavior... Check it out and get it for your brother or your listtle sister. Another MUST HAVE for older kids is the seriesWhy Some Cats are Rascals, Book 2by Nowiki. Very captivating and touching stories showing the world with cats eyes",
                "review/helpfulness": "48/55",
                "num_reviews": 55
            },
            {
                "review/text": "When Max is sent to bed without any supper because he is acting like a monster, his imagination really takes off. This book shows how an angry child can channel his emotions into imagination. Max magically transforms his room into a jungle, an ocean and an island where he becomes the king of the wild things, and has quite an adventure. Max does realize that at the end of the day, there is no place like home.This is a classic written in 1963 by Maurice Sendak. The New York Times claimed that Maurice Sendak was &quot;one of the most powerful men in the US&quot; because he was able to help shape the fantasies of millions of children. The illustrations in this book are startling and amazing. This would be a great book even if it didn't have any words, the pictures alone are great. This book was the winner of the Caladecott Medal for the Most Distinguished Picture Book of the year.This is a great story that both adults and children will enjoy alike. But I would recommend it for kids ages 6 and under. My son is always asking to read this book at bed time.",
                "review/helpfulness": "30/39",
                "num_reviews": 39
            },
            {
                "review/text": "My mother first bought this book for my oldest son. It has endured as a beloved favorite to all three of my boys. I think that children can really identify with Max and his thoughts. When he is sent to his room for misbehavior, his imagination helps him to run away to where the wild things are and collect his thoughts. I believe that the author must remember what its like to be a child and feel like no one understands, and not quite understanding yourself. Ruling the wild things helps Max understand that he just wants to feel loved, and helps parents to keep in mind that such outbursts from children are generally cries for attention--for someone to love them best of all. Mr. Sendak understands children! When you read this book it will transport you back to your own childhood and you will remember that lost feeling of being a child. Bravo, Maurice! You are my hero!",
                "review/helpfulness": "35/36",
                "num_reviews": 36
            },
            {
                "review/text": "I personally never liked Sendak's WTWTA. Or In the Night Kitchen. Or Chicken Soup with Rice. Or anything ever illustrated or written by him. So, I'm not a fan. Got it?But WOW, was I ever wrong. I just didn't get it before, but listening to Tammy Grimes narrate and with the addition of Herr Mozart, it's like being transported into what must have been a fascinating mind who could write so well for children.Buy this CD for your 4 year old + child with imagination to spare and he'll be begging for it. It's become a TREAT 'round these parts.",
                "review/helpfulness": "27/31",
                "num_reviews": 31
            },
            {
                "review/text": "Maurice Sendak's Where the Wild Things Are is a wonderfully presented story for children. The tale focuses on an apparently rowdy youth, Max, who is sent to bed without supper for his rambunctious escapades in the house. Later that night Max dreams of a magical rowdy world where he is king of all things wild and terrible, but eventually Max comes to realize that having everything always go your way lacks any real fulfillment. The incorporation of some values into a beautifully illustrated adventure is sure to entertain any small child while still effectively presenting a subtle message. Thus, a child is not confused, nor presented with a meaningless tale. The pictures have been recognized worldwide and have been presented with the prestigious Caldicott Award for illustrations in children's books. This book is printed in hardcover, a bonus for when handling is to be done by children, and the font is large and separated from pictures to avoid confusion. The author's connection of the textual story to the pictoral story is helpful for children learning to read as well, as it helps to form associations between pictures and words. Widely recognized as a classic, Where the Wild Things Are is a necessity for any small child's library.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "It is a great book! I am 19 and still enjoy the great illustrations. It reminds me of my days as a youth when I fantasized about being in total control in a whole different world when my parents sent me off to my room and I was mad because I was being punished and felt I didn't deserve to be sent to my room. I like how Max becomes king and all the monsters are nice to him, I think that the way the monsters react to Max tells kids that they don't have to be frightened. If you're a beginning reader, read it! If you're a parent of a young child, read it to them! The vocabulary is understanding, and Max's wild imagination is very heartwarming to anyone who reads it. If you're my age, just beginning your years as a young adult, perhaps you could consider writing a book like this. It's not very hard, everyone has a little creativity of their own. Nobody should miss out on this title, Maurice Sendak has always had great illustrations. My father read it to me as a little boy, and I wondered why the last page saying &quot;and it was still hot.&quot; had no pictures.",
                "review/helpfulness": "16/21",
                "num_reviews": 21
            },
            {
                "review/text": "The Sendak stories read by Tammy Grimes capture the spirit and fun of the text and pictures without &quot;talking down&quot; to children. My kids have loved it from age 18 months to 7 (and counting). A wonderful interpretation of wonderful stories.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "I grew up with this book but hadn't read it for many years.When I read it to my 3 year-old there were a few issues. First, you can tell it is dated because the boy is punished and sent to his room without dinner. This is not a current trend that the parenting experts advise. In our house we don't punish by withholding food, so my son was a little confused. My son also didn't understand what the boy did that was so bad that he had to stay in his room alone. In today's time of the time-out or the \"let's discuss your behavior\" method, this punishment seems outdated.Thanks to watching an episode of Scooby-Doo, my son is afraid of monsters and I've been telling him there is no such thing. So here comes this book and here are the monsters. Even though they are funny and good monsters, I was faced with telling my son these monsters were good but then trying to say that there is no such thing. I made up the storyline that he had fallen asleep and he dreamed of the monsters. The illustrations are fun for me to see and we talked about what the silly monsters were doing. I recommend that the parent read it alone first and think about how you want to present these issues to your children before siting down with them to read it to them. I wish I had done that!Update: The son I referenced above is now ten years old. He did go on to love this book when he was a bit older. My younger son also loves the story and always has. I guess this is a case of how each book affects different kids differently. As well it is an example of a book not clicking with a child at one age but the book is sometimes better for that child when they are a bit older.I have since seen this book referenced in book discussions, with adults analyzing the content to the minutae. I don't know if they are right or wrong or if it even matters.What I can report at this point in time in the year 2007 is that both of my kids love this book now and when they see the cover they say, \"Oh! That book!\" and they want to read it again. So perhaps this story also appeals to children in a way that we adults may not ever fully understand. And other adults may like the book for reasons that are different than the children's.Sendak is a favorite author and illustrator in our family. Chicken Soup with Rice is one that my kids are wild about.",
                "review/helpfulness": "14/18",
                "num_reviews": 18
            },
            {
                "review/text": "I read \"Where the Wild Things Are\" to my first child, a calm, obedient, and quiet child because it was supposed to be a classic. While we both enjoyed the brilliant illustrations and the storyline, I must admit that I -- also having been a calm, obedient child -- just didn't get it. Then I had my second child, a little girl who is a \"wild thing.\"Over-active children will probably relate to this story more. My little girl is intelligent, imaginative, rarely obedient and brings melodrama to the entire family, just like Max in the book. I began to see the book in a different light. It's the story of a boy who is lonely and angry, and the only way he can appropriately channel his anger is through imagination. The Wild Things are symbols of his wild emotions, which Max tames \"with the magic trick of staring into their yellow eyes without blinking once,\" and he's made king of all wild things. After rollicking wildly in the forest, Max conquers his anger and becomes lonely, only wanting to go back where \"someone loved him best of all.\"Children who experience these strong - albeit brief - emotions often have difficulty understanding them at first and learn to conquer them to \"re-enter\" the adult world where they must behave. If you have a child like this, you'll appreciate Sendak's ability to illustrate the imagination and feelings of a child who does not yet have the maturity to express emotions verbally.I can't wait for the movie release!",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            }
        ]
    },
    {
        "Title": "children at promise 9 principles to help kids thrive in an at risk world",
        "description": "Children At Promise offers a breakthrough paradigm for raising healthy and responsible children who contribute positively to their world. School principal Dr. Tim Stuart and former teacher-of-the-year Cheryl Bostrom offer a practical book filled with illustrations that show how at-risk and advantaged children can realize their At Promise identity. Solidly grounded in tested educational and psychological theory as well as timeless biblical wisdom, Children At Promise provides parents and educators with the insights, motivation, and tools for raising successful children of P. R. O. M. I. S. E. character. AT PROMISE stands for A Adversity and pain can lead to growth T Trust between a caring adult and a child P Perseverance R Responsibility for our actions O Optimism M Motivated by identity I Integrity S Service E Engaged Play",
        "authors": "['Tim Stuart', 'Cheryl Bostrom']",
        "infoLink": "http://books.google.com/books?id=j_7wzcQ4JBoC&dq=Children+At+Promise:+9+Principles+to+Help+Kids+Thrive+in+an+At+Risk+World&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was instrumental in changing my parenting paradigm, but it's message is not limited to parents. It can speak to anyone who relates to children and teens. The book advocates the value and promise of every child, regardless of that child's exposure to aspects of the environment that we, as a society, have labelled \"risky\". But don't expect a lot of feel-good psycho-babble. This view of child-relating is clear and challenging. The \"at promise perspective\" has given me a renewed hope, not only for my own kids, but for myself, and for those I previously would have viewed as \"hopeless\". This changed outlook has prompted me to react so much more positively to adverse circumstances. It is a concept that just makes sense!",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "I recently heard Mr. Stuart speak at a teacher convention - giving a brief overview of this book. Not very often do you get new insights into the theories of education and the art of mentoring. Usually teaching seminars are just tune-ups on the basics. There was a lot of truth that seemed intuitive in Mr. Stuart's findings, but his approach is definitely unique, and I greatly appreciated hearing his thoughts. I think his ideas are useful for teachers who struggle with at-risk students (both the privileged and non-privileged types), and as far as I can tell that's pretty much all of us. I highly recommend this book as a great resource for teachers who are interested in growing in their ability to mentor students effectively.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "What an enlightening message these two authors have to share! Parents, grandparents, aunts and uncles will want to get this book into the hands of all adults who impact the lives of the children they love. Truly this book offers a fresh perspective and a hope for all with a concern for kids and their impact on our society in the future. As a parent, I have been motivated to continually examine my parenting tactics in light of these concepts. This is a \"must read\" for parents and educators alike.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "your nine year old",
        "description": "What happened to that sunny outgoing child of eight? As parents of nine-year-olds often discover, nine is a tricky age. Children are more distant from Mother and Father; they're more independant and rely on friends for companionship, or they have a tendency to spend time alone. Some nines are boisterous and wild, others thoughtful and withdrawn. Helping parents learn how to cope with the unpredictable nine-year-old is the aim of this practical guide from the Gesell Institute. Nine-year-olds are hovering on the brink of adolescence, and this in part contributes to their up-and-down nature. Dr. Louis Bates Ames and Carol Chase Haber paint a vivid picture of the child at this age and offer useful advice to make life easier for parents and children alike.",
        "authors": "['Louise Bates Ames', 'Carol Chase Haber']",
        "infoLink": "https://play.google.com/store/books/details?id=iu6khybgWQEC&source=gbs_api",
        "review": [
            {
                "review/text": "When you know what behaviors are &quot;normal&quot; for your child's age you can relax, stop the worry, and focus on appropriate solutions. This whole series of books accurately defines the ages and stages of children. These books keep your expectations realistic and allow you to avoid anger caused by a lack of understanding of your child's developmental stages.",
                "review/helpfulness": "20/20",
                "num_reviews": 20
            },
            {
                "review/text": "Reading this book has helped make nine very enjoyable. This series of books is great. Understanding the different stages takes out the frustration and makes watching and helping your childern grow and develop a JOY.",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "This book serves as a great tool for me in raising my nine year old twins! It provides a great assessment as to what I can expect from my children, and explains the reasoning for some of the issues that go on with their behavior. I wish more adults in the education profession and politics would use the information provided in this book in an effort to get a better perspective on what it's like to be nine. Particularly as we continue to hold our children more and more accountable for reaching such rigorous education standards.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "while you are away",
        "description": "Three children describe how they feel when one of their parents is away.",
        "authors": "['Eileen Spinelli']",
        "infoLink": "http://books.google.com/books?id=d-CyPAAACAAJ&dq=While+you+are+away&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Our world is facing uncertain times to say the least. In many cases, those who are paying a great price during these times are the young children of the soldiers stationed overseas. Eileen Spinelli, wife of author Jerry Spinelli addresses these young people and the issues they face in her book WHILE YOU ARE AWAY. The book tells of a variety of young children who will do various things to remember their parents serving in the military until Mom or Dad returns home again. The soldiers are both fathers and mothers and the children are various races and nationalities which gives the book a broad appeal. Renee Graef's beautiful illustrations add to the charm of this timely book.This book is a must for the children of our service men and women as they cope with an overwhelming situation in their young lives, but will also help other young people understand the challenges facing many of their neighbors, classmates, and friends. We should be thankful such a book has been written, but let us also hope that the situation our world finds itself in may be resolved quickly so that this book can be outdated very soon.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This book is amazing. The illustrations are so beautiful, and the emotions very real. The author captures the feelings without being overly wordy or sappy. Very well written.Since this book was so special to my children (and me) during my husband's last deployment, I've shared it with other friends' families during their deployments, and also with my children's teachers to read in their classrooms. They've all given it rave reviews. The teachers especially wanted their own copies to be able to read to the military children in their classes each year, since deployments are routine in our neighborhood.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "I just read this book to my daughter, and we loved it. It gives the perspective of three children whose parents are a sailor, an airwoman, and a soldier. It was touching, with the children missing their parents who are far, far away. It's not the best of Spinelli's work, but my daughter was able to see that other military children miss their parents while they are separated, as well. I definitely recommend it to all military families with young children. Perfect for toddlers to early school-age!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "I'm not sure if I'll be able to read this book to my baby without crying. Great choice for children with deployed parents.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "the einstein syndrome bright children who talk late",
        "description": "The Einstein Syndrome is a follow-up to Late-Talking Children, which established Thomas Sowell as a leading spokesman on the subject. While many children who talk late suffer from developmental disorders or autism, there is a certain well-defined group who are developmentally normal or even quite bright, yet who may go past their fourth birthday before beginning to talk. These children are often misdiagnosed as autistic or retarded, a mistake that is doubly hard on parents who must first worry about their apparently handicapped children and then must see them lumped into special classes and therapy groups where all the other children are clearly very different.Since he first became involved in this issue in the mid-1990s, Sowell has joined with Stephen Camarata of Vanderbilt University, who has conducted a much broader, more rigorous study of this phenomenon than the anecdotes reported in Late-Talking Children. Sowell can now identify a particular syndrome, a cluster of common symptoms and family characteristics, that differentiates these late-talking children from others; relate this syndrome to other syndromes; speculate about its causes; and describe how children with this syndrome are likely to develop.",
        "authors": "['Thomas Sowell']",
        "infoLink": "http://books.google.nl/books?id=zAykswEACAAJ&dq=The+Einstein+Syndrome:+Bright+Children+Who+Talk+Late&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "The Einstein Syndrome is an informative follow-up of Thomas Sowell's Late Talking Children. Since my daughter and I share all the characteristics that Thomas Sowell writes about, it is quite refreshing and supporting to read about his and Professor Stephen M. Camarata's research. Sowell is a much needed pioneer on the research of bright late-talking children that share various characteristics such as: outstanding analytical abilities, and/or musical abilities, outstanding memories, strong wills, delayed toilet training, close relatives in analytical occupations (ex. engineers) and/or musical abilities, and other interesting characteristics that he describes in his book. Sowell writes about the frustrations a parent can go through with professionals misdiagnosing, to friends and family unthoughtful comments, to schools mislabeling for their own funding purposes. Sowell gives insightful examples of late-talking children and adults who talked late. He goes on to discuss the controversy on early intervention for this particular group of children. He does suggest that a child be evaluated by two separate independent professionals, to skip the &quot;free&quot; school district evaluation, and at the same time be an advocate for your child. Thomas Sowell encourages research and studies on the Einstein syndrome as well as more inovative and challenging educational approaches for these children. My gratitude goes to Thomas Sowell for writing such a wonderful book and if everyone must have a label, my daughter and I will take the Einstein syndrome.",
                "review/helpfulness": "172/180",
                "num_reviews": 180
            },
            {
                "review/text": "This is the Follow-up book to Sowell's &quot;Late Talking Children&quot;. The first book was mostly anecdotal evidence, but this book includes far more data, from more scientific research. He worked with Dr Camarata, a speech and language pathologist from Vanderbilt university for the research of this book.Yes, as before, many people will criticize this book, as they did the first. The people who will criticize this book are either the para-professionals that stand to lose money from unnecessary therapies, or the parents of children with serious issues who read no further than the dust jacket, and don't read the book with a critical enough eye to realize whether or not their child actually fits this special sub-set of late speakers. We have a strong family history of speech delays, and math intensive careers. Both my husband and father in law fit the profile, as engineers, both late speakers. I am such a strong advocate of this book, as I am a mother of 3 late speakers who fit the profile so closely it is almost scary to see it in print. It is as if they have been watching my household. All 3 of my late speakers are now speaking, and all share the extremely advanced mechanical and spatial perception skills addressed in the profile.If your child is not speaking, and you see a spark of intelligence in his eyes READ the book, and really analyze your child. Don't just say, &quot;Well some kids grow out of it, mine will too&quot;, take a serious look to see if your child does indeed fit the profile. If your child doesn't fit the profile, don't criticize this line of research, as this is a REAL sub-set of late speakers, even if it is not where your child is. If the child DOES fit the profile, there are a great many support groups out there for parents of these odd little guys.",
                "review/helpfulness": "88/91",
                "num_reviews": 91
            },
            {
                "review/text": "As the parent of a late talking child. I was concerned that he exhibited all of the symptoms quoted by the \"experts\" for a child with PDD-NOS. Little did I realize that taking him in for a free evaluation by the state would lead to School Psychologists and counselors demanding that I enroll him in their \"enhanced\" programs. After one psychologist accused me of being \"in denial\" I sought more information and found \"The Einstein Syndrome\".This book helped me understand the political and bureaucratic and academic machinations which are creating this bogus \"Autism Epidemic\" expecially in California. This book offered my wife and I real hope at a very dark time in our lives.I've waited almost 2 years to post this review. My son is now a playful, intelligent, affectionate, TALKATIVE 4 year old getting ready for kindergarten. All of the Autism/PDD \"symptoms\" completely disappeared on their own. And I have the luxury of returning that diagnosis to the psychologist with a big \"F\" written on it. Just to show there's no hard feelings, though. I plan on giving her a present, a copy of \"The Einstein Syndrome\".=====================================================8 Years later, in honor of my sons 12th birthday, I would like to update my review. My son is currently getting straight A's and is enrolled in the school gifted program and is doing great in an accelerated math class.I'm very proud of him, he's the best son any father could hope for.The bureaucrats and educators in the school still occasionally harass him. They try to discipline him because they feel he looks or acts odd, not for any genuine reason. I have let the principal know that that I stand behind my son. I have come to feel that there's a real problem with misguided young (feminist) educators in our schools (especially in California). They don't seem to understand boyish behavior, especially behavior of the type that is characterized as autistic, and so they are try to label these children as diseased. There's money and careers to be made by these diagnoses, so it is sometimes difficult for parents to withstand the pressure of these \"experts\".Without this book I wonder I would have had the courage to stand up to those educators who pushed so strongly to have my son put ina class for mentally disabled students. Instead I stood my ground and insisted he stay in the normal classes, and he has thrived.Thanks again, Einstein Syndrome.",
                "review/helpfulness": "85/85",
                "num_reviews": 85
            },
            {
                "review/text": "Thomas Sowell is an economist. He writes excellently about politics. But he needs to butt out of a field in which he has no expertise, especially when his conclusions are so profoundly irresponsible.Thomas Sowell's own child had language delays. It's as if he is protesting too much -- he wrote a whole book so the whole world would know his child was perfect, after all. Then there are a whole bunch of incomplete andecdotal reports of other bright children who talked late, and why. The reader has no additional information about these children's level of functioning in other domains. How do they socially? How do they function in school? How is their executive functioning? Are we sure they really talked late? Are their pediatrician's reports? He does not even define what he means by \"talking\"?For the purposes of his book, he should define talking in order to be able to demonstrate what it means when these children \"talk late.\" After all, \"mutism\" is an actual disorder. Is he saying they never uttered a sentence? Never gestured? Never pointed? Or did these children really go years and years without uttering a syllable? When did anyone notice that this was an issue, contemporaenously or in retrospect? It would be useful to view the comments and concerns of their pediatricians.Throughout the book, Sowell talks about Labelling, as if Labelling were an evil to be avoided. But what is so mystifying is that speech therapy is painless. Its effectiveness is well-established. Labelling will not keep the kid out of the CIA in 25 years. What is Sowell advocating? A child who can't tell you what he wants gets infuriated and frustrated, demoralized and unhappy. That's why the child should get speech therapy. And Sowell is selfish for gambling on his child's neurological future to -- let's face it -- save his pride.For babies, it matters less. They're tired, lonely, scared, hungry, wet, cold, hot or something hurts. Almost all of it can be remedied by feeding, changing, cuddling and soothing, unless it's a medical problem. In contrast, toddlers, they have more complicated needs. They don't want grape juice, they want milk. They don't want their noodles touching the sauce. They want the purple truck. It's his turn to play on the slide. The TV is too loud. He wants to watch Teletubbies, not Mr. Rogers. It is only fair that a toddler be able to engage in age-approriate verbal communication for that reason. There is no defensible reason to prevent a toddler with a communication problem from getting help in being able to communicate.I would also note that with very specifically-delimited exceptions, none of which seem to be encompassed by this book, there are very few happy loners. Some kids give up because their social skills are bad, but most people are social animals -- whether they enjoy the company of one or two trusted people or they are total social butterflies. A child should be taught social skills at an early age so that he can make the choice on his own terms, not because his social skills are so poor that society makes those choices for him. That renders a child miserable and powerless and, by the time he is in middle school, a target for bullying.And anyone who has witnessed children of any intellectual level who are frustrated because they can't get their basic needs met -- due to a lack of ability to communicate them -- would understand that this is a matter of compassion, not dogma.Meanwhile, the authors offer no justification of any kind for their position that these children should be denied help.",
                "review/helpfulness": "49/62",
                "num_reviews": 62
            },
            {
                "review/text": "This book explained my son to me. He is 3 years and 9 months old and just beginning to speak conversationally. Our family fits the profile so well it's almost scary._The Einstein Syndrome_ also gives practical advice and needed warnings to parents about dealing with the institutions and therapists who evaluate their children. Thomas Sowell reminds us parents that we are our children's best advocates and that our knowledge, feelings, and opinions about our children do count. Even if your child doesn't fit the profile, the book is worth the information on handling the professionals.",
                "review/helpfulness": "48/54",
                "num_reviews": 54
            },
            {
                "review/text": "As the father of a bright, but late talking three year old boy, I read this book with interest. There is of course much here to give hope to the worried parent of such a child.My fear is that for some people this will be all they need to adopt a 'wait and see' policy. The boundries of high functioning autism and eccentric personality are not well defined, particularly in the young child. I have come to believe it is much wiser to address speech delay and it's commonly associated behaviours aggressively. If all turns out well by the age of five, so much the better. If however your child does in fact lie somewhere on the autistic spectrum then you will have let him or her down by doing nothing at this early stage.Lastly, my personal experience of speech therapists and other professionals working with late talking children is quite contrary to what Mr Sowell writes. Most are seemingly inundated with work and often it is left to the parents to push for the services their kids are entitled to.",
                "review/helpfulness": "31/51",
                "num_reviews": 51
            },
            {
                "review/text": "When you have a kid on the autism spectrum that isn't talking/developing appropriately, sometimes things work out OK on their own. That's pretty much a summary of this book's contents.However, all too often, they do not work out on their own, and any parent that buys this book because their child isn't talking/developing appropriately, and decides to do nothing or delay testing and treatment, is making a regrettable mistake.True, some kids talk late and turn out fine. But all too many don't, and even children that are \"on the borderline\" can fall far, far behind unless Parents make an effort to address the situation.Early intervention is key in helping kids on the Autism spectrum. If you're worried about your child, go ahead and purchase this book, but look at OTHER books on the matter, and think carefully about what you need to do to ensure your child's needs are fully met.",
                "review/helpfulness": "30/48",
                "num_reviews": 48
            },
            {
                "review/text": "As one of the \"semi-professionals\" Sowell references (a Floor Time therapist working in a not-for-profit Los Angeles clinic), I found Sowell's book compelling and interesting (I read it in one sitting) but incomplete. Along with Sowell, I agree that a baffiling amount of bias and incomptence can be found in a variety of schools/programs/clinics designed to treat children with special needs. I myself felt inadequately trained/prepared by my clinic before being assigned to cases. However, unlike many of the other \"semi-professionals\", I have a desire to learn as much as possible about the study of speech delays (particularly Austism and PDD).Specifically, I picked up this book because of a 2-year-old client I am currently seeing who seems particularly bright but who has been identified as 'at-risk' for Autism on the FEAS scale. He currently recieves almost 20 hours a week of 'early intervention' services and both his parents and I worry that this much therapy may be innapropriate for a child of his age and functioning abilities. At the very least, Sowell's book reminded me of my own limitations as a diagnostician, the importance of positive, open, sympathetic interaction with parents, and the importance of embracing a client's individual differences while developing their intervention program.However, although Sowell presents a compelling case for the existence of a subset of 'late-talkers' whose development is possibly further compromised by intervention services, his book offers little practical advice for parents of such children other than telling them to seek evaluations from a variety of clinical and medical experts. He makes little if no reference to the importance of factoring a child's receptive language ability and a child's ability to signal a want/desire using complex gestures in determining the likelihood of future 'spontaneous' language abilities.Additionaly, Sowell makes several one-sentance disclaimers about not offering parents \"false-hope\". However, it seems likely that there are more parents of special needs children like the one on p. 145 who might interpret Sowell's theories as an endorsement of a 'wait-and-see' attitude.",
                "review/helpfulness": "41/44",
                "num_reviews": 44
            },
            {
                "review/text": "I am a proud father of a late talking child and I am grateful for this book as I know many other parents who read this book are who also have late talking children. After I read this book I told my parents about it and much to my surprise my mother told me I did not speak myself in full sentences until I was about 3 years old. Conventional wisdom is not what this book is about which is why some readers do not come to terms with the reality of this subject. This book clearly states that majority of late talking children do NOT have the Einstein Syndrome and goes on to say that the child should be evaluated to determine the cause.The point of this book is to enlighten people about the fact that many of these late talking children are exceptionally bright who go on to become successful adults which is contrary to conventional wisdom that may indicate something is wrong with these children. The pattern explained in this book is key to understanding this phenomenon which is not explored enough or correctly by medical experts who sometimes are quick to label a child as having ADD or being autistic. The children examined in this book all have very unique characteristics and their parents and close relatives are in very particular fields. All the data that was collected in this book is identical to my family's situation. My father is a high level musical instructor and I am a senior analyst in computer technology field. My son is almost 2 and a half years old has only a handful of words and is yet to put a sentence together but he is extremely bright. He has some social anxiety with strangers. He is extremely strong willed and on occasions throws big tantrums. He also has some allergies. He is really good with puzzles and in fact puzzles are his favorite thing. He constantly figures out how to take apart the safety gates I install in the doorways which also something the author mentioned about his own son. He knows how to work the TV/DVD player and my laptop and many other things that point to the fact that his brain is developing differently and he is analytically advanced but is behind in speech. I point all these characteristics out which are the same with other unique children mentioned in this book. We do have a great speech therapist but went through two other ones who did not click with our son so finding the right speech therapist is extremely important. He is currently making good progress with his speech as he seems to pick up a new word in every session the speech therapist works with him. He also goes to pre-school 3 days a week and even though he is not able to communicate with his peers or teachers he is able to get his feeling and actions understood with his gestures/eye contacts and a few words that he says. It is clear to me that he will start talking when his brain is developed to handle speech as mentioned in this book regardless of all therapies. Of course Einstein was the extreme case of a late talking child who became one of the greatest minds this world has ever known but there are many other great minds who were late talkers as it will be the case with many future late talking children.I have no doubt in my mind that my son will grow up to be a successful and happy person as I am who also was a late talking child. I did have some social difficulties as a young man but now I have a very loving wife with two wonderful children and a great career. I did not receive any speech therapy when I was a child. Today's society and so called experts have created an unfair pressure on today's children to start talking at a certain age. Early intervention is not always the answer and not all children are the same.I also ended up in the engineering/analytical field as did many of the adults mentioned in this book who were late talking children. I am also another living proof of this syndrome and a testimony to this research and this great book. I highly recommend this book to anyone who is open-minded and is willing to understand what this book is really talking about. One should also apply their common sense and intuitions when dealing with a late talking child as all children are different and so is their physical and mental development.",
                "review/helpfulness": "30/31",
                "num_reviews": 31
            },
            {
                "review/text": "If you have a child that is late with speech development, seems frustrated with communications, strong willed & defiant, prone to tantrums, good at solving puzzles, loving but sometimes aloof, concentrates on some tasks, ignores requests to perform other tasks, not the least interested in potty training, exhibiting some autistic or PDD tendancies but having exceptional memory and suprising intelligence, then you need to get this book. Don't be put off by reviews of the professionals, the book has some information that will help concerned parents bypass those professional egos and cut to the main issue, how to best understand and help your child.",
                "review/helpfulness": "28/29",
                "num_reviews": 29
            }
        ]
    },
    {
        "Title": "i saw esau the schoolchilds pocket book",
        "description": "A collection of rhymes that have been chanted by children for generations including rhymes of insult and retaliation, of teasing and repartee, rhymes for skipping and for counting out, riddles, tongue-twisters, narratives and nonsense.",
        "authors": "['Iona Opie', 'Peter Opie', 'Maurice Sendak']",
        "infoLink": "http://books.google.com/books?id=aHNLPwAACAAJ&dq=I+Saw+Esau:+The+Schoolchild%27s+Pocket+Book&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I received this book for my fourth Christmas from a beloved uncle, and it has stayed with me in a cherished position ever since (though granted, that's only been about a decade and a half). Although I doubt Opie's comment that all children need to know some rhymes by which to gain popularity is entirely accurate for the playground of today, a well-placed rhyme did mark a few points of my childhood, and helped me to realize that such fools as could not appreciate the absurdity of Moses Supposes, or Eaper Weeper, chimney sweeper, weren't worth my time.Even now I regale acquiantances and friends with the likes of that cruel husband, and even if the lines I've memorized weren't worthwhile in themselves, the endnotes of the book including such tidbits as the meaning of antiquated references and the origins of certain rhymes (many hail back from the 17th century) would be. For the more pragmatic, I could also make an argument that the older poems helped generate a familiarity with less modern texts which aided my lexical understanding and appreciation for dark humor and love for words, but that could be going to far. I get awfully sentimental about this book though, and I want you to buy a copy.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Peter and Iona Opie (eds.), I Saw Esau: The Schoolchild's Pocket Book (Revised Edition) (Candlewick Press, 1992)It will come as no surprise to anyone who's read I Saw Esau: The Schoolchild's Pocket Book that it has been challenged as \"obscene\" in Murfreesboro, TN (viz. The Murfreesboro Daily News Journal, Feb. 7, 2007). I Saw Esau is exactly the kind of book that begs a challenge. First it's illustrated by the wonderful Maurice Sendak, who seems to trail controversy wherever he goes. Second, the Opies actually collected the rhymes, sayings, and other nonesuch here from actual children, and of course, children must be protected from anything else said by their real-world contemporaries. After all, morons who challenge kids' books in schools either never were kids, have forgotten what being a kid was like, or are such humorless sticks-in-the-mud that they don't feel their own children deserve to have as fun a childhood as they did. (Any other interpretations of such boorish behavior-- and they are legion-- would verge on libel, and thus will not be speculated upon here.)If, on the other hand, you're a reasonable, thinking human being who has a shred of a sense of humor and are old enough to remember where you were when JFK was shot, and perhaps if you're a bit younger and hung around with people older than you were as a kid, you're going to recognize a lot of what's in here, probably with great fondness. You chanted this stuff, or variations on it, as a kid in the schoolyard. Maurice Sendak's illustrations complement the text wonderfully, often in frighteningly literal manner, and are never less than a pleasure. (But, oh, horrors, one must protect one's children from naked gluteus maximi that appear on a few pages! And oh, how terrible, one drawing features full frontal nudity! Well, tell me-- do YOU take a bath with your clothes on?) If you're younger than that, you'll probably be able to see the germs of your own schoolyard babblings in here, and be equally charmed. If you read it and are offended by it, then you may well be one of that subset of people who simply needs to be offended until you get it. In any case, I can't recommend this book highly enough, both for yourself and to share with your kids. ****",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "A delightful book for kids of all ages! Each page of this book has delightful, light, charming prose. The illustrations by Maurice Sendak put the final touches on a lovely, well-bound volume of reading for a family to share or a child to escape to a cozy window-seat and read. I recommend this book for someone who wants to give a nice, lasting gift to a special child or friend.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            },
            {
                "review/text": "My daughter loves this books. Its collection of old, silly nursery rhymes and poetry are funny and enjoyable for both children and parents to read. Great for any kid who's too sophisticated for the average poetry book.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "how to protect your children from the national assault on innocence",
        "description": "Saving Childhood offers parents and grandparents practical strategies to cope with a society that seems perversely determined to frighten and corrupt its young. Cultural critic and popular radio host Michael Medved and his wife, psychologist Diane Medved, argue that in a mistaken effort to curb problems plaguing its youth, our culture has changed from protecting childhood as a precious time of growth to hammering even the smallest youngsters with a grim, harsh, and menacing view of the world. The Medveds systematically present unassailable scientific evidence, moving anecdotes, and personal experiences of raising their three young children to explain the attack from four primary directions--media, schools, peers, and even well-intentioned parents themselves. In a unique analysis the Medveds define innocence not as ignorance but as the result of three components--security, a sense of wonder and optimism. They empower parents and all who care about childhood with concrete, easily accomplished means to fend off the assault, as well as advice for handling hurdles such as the Internet, television, peer pressure, and the plague of pessimism. Saving Childhood enables us to restore and maintain for our children imagination, confidence, and hope for the future.",
        "authors": "['Michael Medved', 'Diane Medved']",
        "infoLink": "https://play.google.com/store/books/details?id=l5TZDDGfG8QC&source=gbs_api",
        "review": [
            {
                "review/text": "Controversy is deliciously entertaining, violence is shocking and sensual content is titillating.....for most adults. But what is this doing to our children? The Media has so permeated our lives that it seems there is no way to protect \"childhood innocence.\"\"Saving Childhood\" offers parents hope and practical tips on how to encourage security, a sense of wonder and optimism in the life of a child. This book will empower parents and give them hope for the future.The first part of the book has been written to make parents aware of the realities of the situation and explains the \"Assault\" on innocence. The second part is the \"Defense.\" Michael and Diane explain that the Assault is coming from Media, Schools, Peers and Parents. They show how statistics have proved that the problems in our society are getting worse at a rapid pace and back this up with scientific evidence. They also explain many points with examples from the raising of their own three children.The Medveds explain how we live in a land where sex education has failed to reduce teenage pregnancy, children feel guilty for existing, parents push their children to grow up too fast, children have a lack of moral values, and parents have taken a passive role.So who is educating our children? It seems an inadequate school system and the TV!Television is well known for programs which contain high levels of violence. I have long been a believer that TV violence causes aggression. Michael and Diane prove this point and I found it interesting to read about how the crime rates increased soon after the introduction of TV into various towns.I grew up in South Africa for most of my childhood and remember very few people having TV's in the early years. TV was apparently banned until 1975. In fact, my father never purchased a TV and so I grew up basically TV-free! Perhaps that is why I can still enjoy a movie like \"Runaway Bride.\" Most of my friends are so jaded, they can't appreciate movies which I find to be very enjoyable. In fact, most movies are new to me.The Medveds also show how TV promotes impatience, self-pity, superficiality and gives us all a harsh view of the world. With all this negativity, how are we balancing our lives and promoting a positive view of the world?There are now three books I consider \"essential reading\" for every American: \"America's Real War,\" \"The American Paradox,\" and \"Saving Childhood.\" These three books are brilliantly conceived works which explain America's present predicament and give excellent solutions. After reading all three books, I am now convinced of our nations need for:1. Responsibility to a Higher Power. (90 percent of Americans believe in God) 2. Renewed respect for life and authority. 3. The teaching of personal responsibility, patriotism and honesty. 4. Parents that stay together and live what they teach. 5. The teaching of moral values. 6. The reading of inspiring books instead of a diet of negative TV reinforcement. 7. A revamp of our Education System. 8. Holding our Media responsible for programming. 9. Teaching a sense of gratitude for life. 10. An all-out effort to protect the remaining innocence of our children.In order to promote the efforts of parents, Michael and Diane devote chapter seven, eight and nine to explain how parents can promote \"security,\" \"a sense of wonder,\" and \"optimism\" in the lives of their children.\"Childhood is perhaps the only phase of life when innocence can flourish. But to allow this, parents and others responsible for children's minds need to construct a protective shelter against the painful and frightening facets of life. They need to stand guard at its door, to let the harsher truths of reality gradually unfold for the child, in a way and at a pace that allows the child to maintain a positive outlook. Honoring innocence is incompatible with assuming that the earlier children grasp all the worst aspects of the world, the better prepared they'll be to handle them.\" -- \"Saving Childhood\" page 195To this I add one of my favorite poems for children:May tree and plant and shrub be soundless through the night and stars and moon be dimmed to shut out all the light. So when you sleep in peace, no bird will move in flight, and angles guard your sleep. Goodnight, my love goodnight. ~James Neill Northe~The Rebecca Review",
                "review/helpfulness": "57/61",
                "num_reviews": 61
            },
            {
                "review/text": "What a novel concept! Michael and Diane Medved have decided that parenting is not only important, but actually worth the time and effort required to rear happy, well-mannered progeny. While this book is rife with suggestions about issues such as schooling, vacationing, and the evening meal, perhaps no social convention is confronted so adamantly as the television. Supplying solid statistics and reasonable examples, the authors make a convincing argument in the idea of eliminating one's TV altogether.But this book is not an attack on America's social system. It's a call to regain control of one's family by exercising wisdom, temperance, discipline, common sense, and optimism in an age when examples of such qualities seem to be difficult to find.",
                "review/helpfulness": "26/29",
                "num_reviews": 29
            },
            {
                "review/text": "I was quite receptive to the premise of the book, as I have been decrying the growing move to make &quot;little adults&quot; out of children, and I am struggling to insure some sense of childhood for my own two children. The Medveds are well intentioned, but they try so hard that it undermines some good points included in their analysis. To use a baseball analogy: they came up with the bases loaded; rather than simply trying to put runs on the board with a solid single, they loaded up for the grand slam, resulting in a pop to third base.The book is quite &quot;over the top&quot; in its included examples of our culture and the manner in which to counteract the at-times negative influence of the media, peers, school, and parents. As other reviewers have noted, some of the Medveds' examples of their reaction to certain situations are downright chilling. One example: their local librarian had (innocently) recommended a particular Judy Blume story to the Medveds' 7 year old daughter (a gifted reader); the Medveds were shocked to find that it included a discussion of menstruation. The parents' reaction was to take the book from the child, tell the child the topic was off-limits until they were older, and then to forbid the child from checking any book out of the library that was written since 1960. Geez! Why not pull the librarian aside and say that you would appreciate more age-appropriate recommendations, rather than a &quot;young adult&quot; level Judy Blume book? Why not have a simple talk with the daughter about menstruation? Would it really corrupt her &quot;innocent&quot; childhood that much?Although the tone can seem &quot;holier than thou&quot;, I believe the Medveds are well-intentioned. The problem is that the evidence cited tends to be the absolute &quot;worst case&quot; situations, and the proposed solutions are a bit extreme. (E.g., the Medveds don't own a TV; somewhat ironic given that the only reason anyone has heard of Mr. Medved is his TV work.) I think the book would be more useful if it were &quot;toned down&quot; and the essential message were allowed to come through - that in today's culture, with the sheer volume of messages rebounding that are not appropriate for children, it requires CONSTANT vigilance by parents, who must be willing to step up and exercise guidance and, yes, discipline to insure that their children are able to have a true &quot;childhood&quot;.",
                "review/helpfulness": "21/25",
                "num_reviews": 25
            },
            {
                "review/text": "Cracking the cover of Saving Childhood is like spreading a napkin across one's lap prior to a Thanksgiving feast. Michael and Diane Medved set the reader's table with a bountiful array of fascinating - sometimes disturbing statistics and quotations surrounding the many influences on childhood. Like a fly buzzing around the stuffed turkey however, is the Medved's consistent opinionated and judgmental interjection.The book systematically addresses \"the assault on innocence\" by media, schools, peers, and parents with a barrage of statistics and quotes by specialists in related fields. Few are spared by the accusing Medved finger. Refreshingly, the targets of attack are not limited to one aspect of society, but rather proposes that the most ignorant entertainer is perhaps no more guilty of this assault than the permissive parent.Educators, parents, caregivers, and just about anyone interested in social analysis and criticism will find Saving Childhood an entertaining, worthwhile read. However, these very same readers may also find themselves eventually rolling their eyes over the repeated, cutesy tales of the authors' own family. For those of us with children that walk in dirty sneakers rather than fly on angelic wings, the Medved's personal life may evoke mild nausea. Similarly, those that indulge in occasional tasteless humor may become defensive when they find the Medved finger pointing directly at them.Nonetheless, the book's social and personal value far exceeds its minor quirks. The average adult reader will find the writing light and approachable, and will undoubtedly walk away with at the very least a new perspective on the subject; perhaps, the reader will even walk away a better person.",
                "review/helpfulness": "18/23",
                "num_reviews": 23
            },
            {
                "review/text": "For all parents and those concerned about the effects of popular culture on the minds and hearts of their children, this is an essential book. The Medveds point out the perils of the &quot;preparation&quot; paradigm currently in vogue. According to this way of thinking, children must be prepared for the worst, in order to protect them. In realilty by telling children that the world is an evil place full of danger the &quot;preparation&quot; advocates are frightening them needlessly, destroying their innocence, and making them prematurely cynical. Sex education in kindergarten, distribution of condoms in junior high, debunking of religion in public schools, bad examples set by politicians including the president, are just a few of the topics which are explored in this timely and important book. SAVING CHILDHOOD succintly demonstrates that children's happiness depends upon optimism, innocence, and a sense of wonder The Medveds give practical tips and pointers on how to provide these three qualities for your children. I highly recommend this book..",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is an important book with some desperately needed themes in this society that is antagonistic toward childhood: In an effort to preserve the innocence of children, otherwise good information is not appropriate for children. Example: It's good to talk with your pre-adolescent about the changes her body will soon undergo, but that information is not appropriate, nor necessary, for younger children. Dovetailing this is the theme that popular culture is at odds with protecting the innocence of children. Example: Children should be encouraged to dream about becoming pilots when they grow up; they should not be encouraged to make actual cross-country flights at an age when they should still be believing in the Tooth Fairy.But I do have reservations: This book would be much more effective if it were more subtle. It is not necessary to throw in anecdotes about how their daughter was frightened to the point of hysterics by a news report of the Lorena Bobbitt case; or, at the other extreme, how their other daughter reported that a certain book was not appropriate for her to read. Showing that their own children are not isolated from the invasive childhood-destructive agenda of popular culture is important; it is admirable that their daughter is obedient, knows right from wrong, and feels secure enough to let them know when something she reads is upsetting. But, the dramatics with which the stories were told was unnecessary and could have been related through more discreet means.I also took exception to the Medveds' presumption to offer suggestions on how Christians should celebrate two of the most important and holy feasts of the Christian liturgical year. Their point about preserving the wonder of childhood fantasy is well-taken, but to suggest that Christians should preserve belief in Santa and the Easter Bunny (especially when the Medveds themselves are not likely to do so with their own children) and incorporate fantasy into two solemn (albeit also joyous) religious feasts borders on arrogance. Would not the Medveds bristle at Christian suggestions as to how they ought to observe Jewish holy days?All in all, SAVING CHILDHOOD is important and timely, but could have been improved with discretion and subtlety.",
                "review/helpfulness": "13/17",
                "num_reviews": 17
            },
            {
                "review/text": "While there is no way to 100% protect the children, this book points out areas to think about, to monitor, to avoid, so that parents can make the best choices possible for their children.",
                "review/helpfulness": "10/14",
                "num_reviews": 14
            },
            {
                "review/text": "Written with the meticulous research and keen insight for which Michael and Diane Medved are rightfully noted, this is an excellent book. Citing the many negative influences of our modern culture, the Medveds stress the importance of saving childhood innocence, something which we of the older generation possessed, but sadly, children of the present generation often do not. Loving and caring parents themselves, Michael and Diane give parents hope and practical information to enable the rearing of happy, independent, and emotionally healthy children.",
                "review/helpfulness": "9/11",
                "num_reviews": 11
            },
            {
                "review/text": "I bought this book after hearing a radio interview with the authors in which he cited a number of the problems and concerns facing children today. His concerns are valid, but the logic in which he makes his arguements is flawed. Examples cited often use &quot;worst case&quot; anecedotes or studies and sometimes the detail behind his assertions makes no sense. In one instance, he complains about obsense lyrics in an album that I don't recall ever hearing about, then he states that children will be harmed by a discussion of the controversy. On the same page, he laments the youth of certain musicians such as the Hansons and a 16 year old blues artist. No complaints here about the content, just a concern that the artists are too young. (Doesn't he remember the Jackson 5 or Partridge Family?) Another section I found almost laughable was the story about his 8-year old saying &quot;This is a bad book&quot; about the Girl Scout Junior Handbook, because the child had come across a discussion of menstruation. Couldn't she have just skipped over it? How are they going to explain to this child when she is 12 that this is now a &quot;good&quot; topic? I would like to read a book by the daughters in about ten years as they describe their upbringing in retrospect. Especially the one that says she is picky about her friends and would never have a friend her parents didn't approve of. Talk about children who have been programmed to say the right thing! In summary, I did not disagree with many of the points mentioned. I would have liked to see more emphasis on the influence of media of females' body image and a more balanced look at sex education.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "Michael and Diane Medved's new book &quot;Saving Childhood&quot; operates on the premise that the key elements of childhood innocence: security; a sense of wonder; and optimism are birthrights that elude many of today's children. Protecting these basic rights is the prescription the Medveds offer to counter the everyday assault by the media, schools, peers, and even parents themselves, that interfere with healthy development. This book offers solid, if somewhat idealistic advice for parents who feel they are parenting upstream. In this &quot;age of enllightenment&quot; today's children view wars on television, read about children killing other children, and develop dangerous eating disorders as young as the age of nine. It is difficult to argue with the Medved's assertion that children receive more information than they can process and still feel good about the world at large. I would recommend this book to any parent trying to shelter their children from the barrage of adult information aimed specifically at children. In our family, no day is ended without each of us thanking God for his blessings; an American flag flies in front of our house. Security, a sense of wonder, and optimism are worth fighting for for our children.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            }
        ]
    },
    {
        "Title": "our last best shot",
        "description": "Our Last Best Shot presents the personal stories of twelve girls and boys from across America. Their stories, and Laura Sessions Stepp's extensive research, provide real insight for parents trying to raise well-adjusted children in this difficult age. Filled with wisdom and common sense, based on cutting-edge research, and featuring an invaluable resource list, this is a book that parents and educators cannot afford to be without.",
        "authors": "['Laura Sessions Stepp']",
        "infoLink": "http://books.google.nl/books?id=BP5wxZTmx0MC&dq=Our+Last+Best+Shot&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a must-read for parents of children approaching adolescence and for those in the throws of it, as well as teachers, grandparents, clergy, and others who come in contact with kids ages 10 to 15. By sharing her thoughtful, well-researched insights, Laura Sessions Stepp is able to help demystify what is often a difficult passage for both parents and teens.As the mother of three boys, 12, 15, and 17, I found this book enormously reassuring. By talking intimately with young teens and their families and friends, Ms. Stepp found that despite the pressures and challenges to succeed, fit in, and experiment with independence, teens still want what they've always wanted: to be loved and accepted while they discover who they are. As a corollary to this, Ms. Stepp assures parents that the role they play is still crucial even as it changes, that their relationship with their teens is all-important even as it transforms.We all know &quot;it takes a village,&quot; but often we're not sure exactly what that means. At the end of each part of her book, Ms. Stepp lists several things &quot;As Parents We Can...&quot; do to encourage our teens in their growth and development, and involve other positive role models in their lives. These tips are distilled from the chapters that precede them, chapters that illustrate WHY it's important to act on this guidance.&quot;Our Last Best Shot&quot; gracefully blends true-life stories with documented scientific research to give us a better understanding of all the influences at work in a teen's mind, from hormones to peer pressure. We get a detailed picture of the young teen that rivals all we know about infancy.The writing is clear, frank, and best of all, positive. We hear so much about the effects of divorce, teenage pregnancy, learning disabilities, overcrowded schools, alcohol and drugs, guns and violence, AIDS, and all the rest. It's refreshing to hear a sensible, rational voice that says, &quot;Stop. Wait. Most teens are great kids, and we can help them become even better.&quot;",
                "review/helpfulness": "49/49",
                "num_reviews": 49
            },
            {
                "review/text": "When my children were babies and toddlers, I found overwhelming amounts of information about their needs and care-- magazines, books, TV shows. Now that they are 15 and 9, I can't find much worth reading to help me with their needs. I found that this book was very helpful. The author interviewed many teenagers and profiled 12 of them in this book. The book is an interesting glimpse into their lives, and the lives of their families, and the unique problems they each face. Although this is not a &quot;self-help&quot; book, with prescriptions for how to solve the problems parents face, the final chapter summarizes the author's findings from the interviews and gives advice to parents. This summary should be copied and posted where every parent of a teenager will see it frequently because it's a very complete summary of things that teenagers need from their parents.I am also starting to work my way through the books listed in the bibliography. It appears to be a great resource for further reading about adolescents.Finally, I wanted to explain the reason I awarded only 4 stars. I felt that the book focussed too much on teenagers who have some kind of &quot;problem&quot;: poverty, drugs, neglect, etc. Although the book was useful for all parents of older children and teens, I think it would have been better for me if there had been a few more middle-class kids who are doing well in school in the book. That's the kind of kids that I am dealing with, and they still have problems. I suspect that's the kind of kid a lot of... customers are raising too.",
                "review/helpfulness": "31/31",
                "num_reviews": 31
            },
            {
                "review/text": "As the crisis counselor in a public high school and middle school I found this book to share great insights as to what works and what doesn't with this age group. It is presented in laymans terms and easily captures the readers interest. There is so little written information on pre-adolescents and the battles they face. I'd love to see a follow up on the kids the author profiled in about 10 years. Anyone that works with or has middle school age children must read this book.",
                "review/helpfulness": "20/21",
                "num_reviews": 21
            },
            {
                "review/text": "For Christmas 2000, I only requested a few gifts. Besides paper white bulbs and a red matte lipstick, I wanted this book. As a parent of younger children and a youth development consultant and writer, I had committed to reading it in the New Year!I read Last Best Shot in less than 2 days and enjoyed it immensely. In 12 profiles of young adolescents, the author touches on the turbulence but wonderful promise of young teens. She cuts through all the theoretical jargon with an amazingly graceful writing style. This is its finest strength---to communicate what experts in the field know about youth development in engaging storytelling profiles. This makes it a wonderful read for anyone, with children or without.Beautifully insightful, and at times poignant, the private look into the lives of these children gives you the freedom to draw many of your own conclusions. It is also extremely refreshing to see children from many backgrounds portrayed--Children of married families, divorced ones, white, city, rural, Hispanic and African American. My only wish is that we will see a followup. What will happen to all these children in three or four years?",
                "review/helpfulness": "12/14",
                "num_reviews": 14
            },
            {
                "review/text": "I am neither a parent nor a teacher, but I found this well-written, insightful book eye-opening.I bought it as a &quot;suggested reading&quot; gift for the parents of a young girl I have been mentoring, but could not put it down after reading the introduction! Ms. Stepp's intermingling of real life examples with research from the experts revealed so many things that a non-parent can do to change the world by helping children navigate early adolescence. Her inclusion of African American children among her subjects, and her sensitive treatment of the special problems their lives present brought her book home for me.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "I felt like I was reading \"MY Last Best Shot\" as I read through this book. I have three sons, ages 10, 12, & 13, and this book was lent to me by my middle son's teacher. I liked it so much I bought my own copy. Every chapter opened my eyes to something else I didn't know about or have not been doing with my sons. I strongly recommend this book to anyone with children near or at the pre-teen age level, particularly parents who find most parenting books boring, patronizing or unrealistic.",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "Laura Stepp has given us a gift, a superb book on adolescents, what can go wrong and, more importantly, what can go right. This is a wonderful book.",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            },
            {
                "review/text": "The author extensively interviewed and spent massive amounts of time with each of 12 middle schoolers and early high schoolers in LA. Durham, NC, and a small town in Kansas. We get deeply into the lives of these youngsters and their families. We share everything from their triumphs to their getting into very serious trouble (one was suspended from school for a year for bringing an unloaded gun to school). What we learn is that this age group is one in which kids start to assert some independence and both teachers and parents have to give up some control. Stepp puts it well .. we must let kids climb the mountain but still retain enough control to keep them away from the edge of the cliff. Kids this age must believe that we are listening to them and care about what they have to say. Kids need good role models including adults other than their parents. This age group is so crucial to a child's development. The need for more independence is so important yet the dangers of serious mistakes is ever present. What I like about this book is that Stepp makes her observations and offers insights and comments without inserting an excessive amount of ideology. Msny books of this genre have political agendas, both feminist and conservative, This book steers clear of such agendi. This book is important reading for both parents and teachers. I recommend it.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "As a mother of a 14 year old child, I was so grateful to read that my vision was comparable to the author's. This book is all about provisioning up your child. It is easy to love a baby, unconditionally, but much harder when your child is in the teenage years and ready to challenge you. I liked the subtle messages that the author sent - give your child chores to do, give them a sense of self, love them unconditionally, and most of all, be a part of their lives. My heart went out to the children in this book who, in my estimation, are not going to make it.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "While waiting for clients to show up to see a house, I picked up this book and started reading. Having a new middle schooler, I found that I could not put this down because I could see him in so many of the situations. As soon as I got home, I went on-line and ordered it right away. I will be reading every page of this book. Very engrossing. You feel that you know each individual as you read about them. Also easy reading. As the mother of a three year old, I have many interuptions and it is nice to have a book that can be read in short spurts. This is a must read for anyone with children entering into those adolescent years!",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "understanding your childs temperament",
        "description": "Family advocate Beverly LaHaye shows parents how an understanding of their child's personality type can help them teach, discipline, relate to, and encourage their children. The basic temperaments and their blends are addressed.",
        "authors": "['Beverly LaHaye']",
        "infoLink": "http://books.google.com/books?id=8T8IAAAACAAJ&dq=Understanding+Your+Child%27s+Temperament&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book is an extremely helpful resource for all parents, especially those who consider their children difficult. An explanation is given of what temperament is, along with a discussion of the wide range of normal behaviors, some of which have traditionally been labeled as abnormal in the past but are actually just variations of normal. The book's most useful aspect as I see it is its guidelines for reducing the amount of stress and conflict between parent(s) and child(ren). A suggested plan is given for identifying the temperament profile of your child and how to spot the trouble areas, which depend not only on the child's innate temperament but how well that temperament &quot;fits&quot; with the parent's expectations for the child. To alleviate stress in problem areas (such as a naturally slow and careful child with active, fast-paced parents who are aggravated by the child's pace) Dr. Carey gives many specific suggestions and strategies for adapting to the child's style. This is one thing I really like about the book: there are many, many specific, concrete examples and suggestions of things to say and do, that a parent can use right away. Besides the notion that many behaviors considered &quot;problems&quot; by some parents and health care professionals are actually variations of normal behavior, another important point is that extremes of behavior that are problematic in a small child (such as dogged persistence leading to inflexibility) can be assets later in life (persistence is a good thing for most adults). This book can change lives for parents who are fed up with their children, or who find themselves at their wits' end dealing with them. It can immediately make life easier for all members of a family. Even for parents who don't feel quite so frazzled by their children, there is much important insight to be gained from Understanding Your Child's Temperament. I recommend it to all parents.",
                "review/helpfulness": "41/41",
                "num_reviews": 41
            },
            {
                "review/text": "Even though I am only an aunt to two children - and not a parent - I found that this book provides valuable information for anyone dealing with children. Dr. Carey dispells the myth that babies and children are 'blank slates' that can be regulated, scheduled and expected to behave in certain ways. One of the most heartening aspects of the book is that Dr. Carey shows both the &quot;positive&quot; and &quot;negative&quot; aspects of each type of termperament he identifies, avoiding completely the categorizing of any sort of personality as 'problematic.'His argument against the use of Ritalin is very persuasive, as so many of the children prescribed the drug are actually exhibiting behaviors that are within the range of &quot;normal.&quot; Parents having &quot;trouble&quot; dealing with their child's behavior would learn a great deal from this book, particularly how modifying their own actions can influence an individual child's &quot;fit&quot; with his or her environment.The writing is quite accessible, with concrete examples to illustrate the key points and strategies that can be applied when dealing with children. I've recommended this book to several of my friends and colleagues with children, and they have all found it thoroughly useful and informative. And I, merely as a party interested in behavior and children, found it an accessible and fascinating book that taught me a great deal about how to deal with my own niece and nephew!",
                "review/helpfulness": "25/25",
                "num_reviews": 25
            },
            {
                "review/text": "I found the descriptions of the personality types good, but the practical advice in how to deal with those types and specifically the combinations of types lacking.I went back and read some of my other child development books and found they not only had a lot of the same information, but much more practical advice in how to deal with them. Mary Sheedy Kurcinka's Kids, Parents, and Power Struggles is a terrific one. The information on the temperament types is more brief, but again, you can get the gyst pretty easily, and the practical side is much richer... and that, for me, was more important. In addition, the Power Struggles book also covers the parent's personality type and how to work your temperament WITH your child's and know where the danger zones are.",
                "review/helpfulness": "18/24",
                "num_reviews": 24
            },
            {
                "review/text": "This book is for Christian parents who believe that children's personalities are God-given. When Mrs. LaHaye describes children with the Sanguine personality, they sound like hyperactive children. It's comforting to keep reading to find ways to channel the God-given temperament. There is hope in being Spirt-led!",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "this temperment approach makes sense of a lot of my two children's behavior over the last few (9 &amp;5) years. I've seen way too many children on ridelin and agree with the author that temperment has to be considered before we start doping up our kids with speed to make them temporarily easier to deal with. The case studies are carefully selected and get across the author's theories effectively while making the book understandable to any parent interested in children's behavier.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Beverly LaHaye has a great understanding of temperaments in children. She goes to great effort to give a detailed description of each temperament and possible combinations.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I first read this book 24 years ago when my oldest daughter was a baby. It proved an invaluable resource in raising her and her younger sister. I loaned out my copy to many other parents as well. I am purchasing it again for my two daughters, one who is becoming an elementary school teacher and the other who will be a parent soon. This is a great book for understanding how God uniquely designs our children.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            }
        ]
    },
    {
        "Title": "the victory garden",
        "description": "In Memory Of Alvin A. Meek given by Mike & Vicki Herber.",
        "authors": "['Bob Thomson', 'James Wilson']",
        "infoLink": "http://books.google.com/books?id=lfAJAQAAMAAJ&dq=The+Victory+Garden&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am a retired teacher. I retired early (age 25) to stay home with my first baby when she was born in 1989. We now have three children who love to read. I love children's literature and this book interested me. It interested me because entangled in the pages are history, family, friendship, devotion, loyalty and patriotism. The author had me glued to the pages and I, literally, did not put the book down until I finished it! She made the main character so real and I was cheering her on, feeling her pain, and could remember being a little sister to a big brother whom I loved and adored. My daughter is reading the book now - it is beside her bed. These are the kinds of books that I loved as a child and love passing down to my children. It's a wonderful book. I hope the author is inspired to continue to write more children's books. She has a gift and we are fortunate that she shared her gift with us, the gift of writing.",
                "review/helpfulness": "7/7",
                "num_reviews": 7
            },
            {
                "review/text": "I purchased this book for my 10 year old grandchild and decided I should read it before presenting it to her. I am so glad I did. It is a splendid combination of the spirit of World War II and the details of that period of history that should not be forgotten or changed. It was written for the kids we hope will never experience that kind of time, but who must learn about it.It is not just a story of a victory garden but a child's view of the spirit of the people then and to some extent now. It is so timely because once again our children are called to the details of another world wide battle in which we (and they are involved).Bravo to the author for bringing this charming, enlightening chronicle of a child uniting people by leading in a way that unified them while helping them. Isn't that what won that war?",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "I am a 5th grade girl. I did not think books about war could be this interesting. When I started the book I thought it was moving slowly, but it really picked up and gave a bang at the end. In some ways I could really relate to Teresa. I have older brothers and they give me nicknames too. I would miss them if they went to war. I went back to the map many times while I was reading. I thought the map was a cool idea. I would recomend this book to anyone who likes suspense and emotional stories.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    }
]