[
    {
        "Title": "getting the gospel right",
        "description": "A revised and abridged edition of Beyond Calvinism and Arminianism: An Inductive Mediate Theologyof Salvation, in Which theologian/missiologist Olson gives the fruit of a 25-year theological pilgrimage. His inductive focus on Scripture results in a middle view of salvation truth, thus resolving polarized extremes. This edition is much more readable and accessible for most Christians. The exegetical methodology emphasizes context, word studies, and grammar of all relevant passages, with extensive support for eternal security and refutation of deterministic concepts of salvation. In the foreword, Dr. Tim LaHaye refers to the incredible distribution of the academic edition, which sold out in 3 years. A revised academic edition is forthcoming in 2006.",
        "authors": "['Carl Gordon Olson']",
        "infoLink": "http://books.google.nl/books?id=RUaajy5k_WYC&dq=Getting+the+Gospel+Right&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Contrary to what many of this book's reviewers seem to believe, this book is not intended to be a comprehensive argument for the Protestant soteriologial position. Rather, this is Sproul's rejection of the soteriological portions of recent documents signed by prominent representatives of the Roman and Protestant churches in an attempt to bring unity between the two. He argues that despite claims on both sides that an accord on the subjects of justification, sanctification, faith, grace, etc. has been reached, no true unity has been attained - the two sides are still in disagreement over the nature of Christ's saving work.Further, Sproul argues that this attempt at harmony is damaging to the knowledge and spreading of the true Gospel as communicated in the Bible. He chastises Protestants for not knowing how to precisely and accurately put the Gospel into words and calls them to correct that problem before more damage is done.Don't let the other reviews fool you - this book is an excellent exposition of the Biblical position of the nature of mankind's salvation through the work of Christ. The series of Affirmations and Denials that constitute a majority of this book are one of the clearest defenses of this position you can find. But for those who are still not convinced or for those who seek to read even further regarding the Biblical and historical errors of the modern Roman position, see Robert L. Reymond's \"The Reformation's Conflict with Rome: Why it Must Continue,\" ISBN 1857926269.",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "This is a *MUST READ* for any Christian who claims to be an EVANGELICAL. Baptists &amp; Presbyterians, Reformed &amp; non reformed brethren can find the truths in this book to be non negotiable. Boice was right when he said &quot;This is a must read for all who care about the ospel truth in an agae of theological compromise and confusion.&quot;This also helps to see the differences between Protestants and Catholics on what the Gospel really is.",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "This is a book that every evangelical who thinks Roman Catholics might actually be real Christians seriously needs to read! It is a sequel to Sproul's earlier book FAITH ALONE. While FAITH ALONE dealt with the controversial document EVANGELICALS AND CATHOLICS TOGETHER (ECT), this book analyzes, point by point, the more recent (Oct. 97) and similar document called THE GIFT OF SALVATION.Sproul does an excellent job of showing how two groups can agree on the wording of a statement yet at the same time have almost opposite views of what is actually meant. Although many &quot;politically correct&quot; people today wish to believe that Roman Catholics and evangelicals are both real Christians and saved, while only differing on minor points, the fact of the matter as Sproul shows, is that they are two divergent religions with two different gospels. Despite the good intentions of those who call Roman Catholics their brothers and sisters in Christ, they are actually doing them far, far more harm than good--just like a doctor who tells his patient he is fine when in fact he has terminal cancer.In the last section of the book, Sproul analyzes the document, THE GOSPEL OF JESUS CHRIST: AN EVANGELICAL CELEBRATION which he, helped draft. It uses more precise language both to affirm and deny what the real gospel is, including statements on sola fide (faith alone) and imputed righteousness. This document has been endorsed by over 100 evangelical leaders, including Charles Stanley, Charles Swindoll, John MacArthur, Jerry Falwell, James Kennedy and others including Methodist, Presbyterian, Baptist, Lutheran, Anglican and Pentecostal leaders.My primary criticism of this book is that it tends to read more like a report rather than an expostion of the gospel; nevertheless it's content is substantive. Sproul's other book FAITH ALONE goes into the history of sola fide (faith alone) and is more interesting to read in my opinion, but both are worth reading.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I can sum this up pretty quickly. This book explains the importance of getting the Gospel right, the unity found in the Gospel, and the particulars of the Gospel. It was written in reaction to the Gift of Salvation document between some Catholics and Evangelicals. Sproul is a master of easily explaining rich theological issues. Very compact and straighforward. I used this as a primary source when I gave a lecture on &quot;what is the Gospel.&quot; If you like this, I would suggest getting Sproul's &quot;Faith Alone.&quot; Also take a look at John MacArthur's &quot;the Gospel According to Jesus.&quot;",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "\"Getting The Gospel Right\" is R.C. Sproul's sequel to the popular book \"Faith Alone: The Evangelical Doctrine of Justification\" and is a thorough treatment of the subject of Christian unity. It is essentially a response to a document that tested the boundaries of unity between Roman Catholics and Evangelical Protestants: \"The Gift of Salvation\" (also known as ECT II) which was released subsequently to the original \"Evangelicals and Catholics Together.\" These documents were both written and signed by leading members of Evangelical and Catholic churches as a means to promote unity between the churches. They chose to find common ground and unite on that basis rather than focus on the differences that separated them. Sproul and several other prominent Reformed Christians stood against this document, insisting that it did not form an adequate basis for unity with the Roman Catholic Church.The book is divided into three sections. The first is entitled Controversy Concerning The Gospel and provides background to the importance of Christian unity in traditional Evangelicalism. The section functions almost as an introductory course to Christian doctrine regarding unity. Among other topics it discusses the distinction between the visible and invisible church, the marks of a true church and Christ's desire for unity.In the second section Sproul provides the complete text to \"The Gift of Salvation\" and then provides a thorough examination of each paragraph. His amazing depth of knowledge allows him to delve deeply into the document and point out many problems with it. He shows where the language is ambiguous and goes into lengthy explanation about the differences between the Catholic and Protestant views on soteriology. His conclusion is that the two systems of theology are so far removed that they cannot be brought into harmony. \"The Gift of Salvation\" does nothing to remove the doctrinal chasm created by the simple word \"alone.\" Until Rome concedes on the \"solas\" of the Reformation, there can be no unity. Further, unity on such terms as outlined in this document is damaging to the Evangelical churches as it undermines critical theology. There can be no unity without unity in the gospel, which means there certainly cannot be unity at the expense of the gospel. The unity expressed by the signatories of \"The Gift of Salvation\" is empty since it denies the importance of obvious and insurmountable differences in doctrine.The final section is an examination of a document drafted by Sproul and other leading theologians entitled \"The Gospel of Jesus Christ.\" They feel this document should provide the basis for unity among Evangelicals. \"The Gospel of Jesus Christ\" carefully and consistently lays out the foundations of Protestant theology, leaving absolutely no room for ambiguity. As with the previous document, Sproul examines it paragraph by paragraph, explaining the meaning and importance of each of the affirmations and denials. Sproul says that \"[the affirmations and denials they list] are the foundation that expresses the mission of the church. For the church to be faithful to the Great Commission, we must get the gospel right. When we do, we will both energize the church's activity and encourage deep and abiding unity among Evangelicals.\"This book is as good a treatment of the subject of unity as I have read. While deeply theological, it is also very readable. Sproul has a gift for presenting deep truths in a way that is easy to understand. I recommend this book to anyone interested in learning what the Bible says about unity, and further to people interested in an overview of the doctrinal differences between Protestants and Catholics.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "Sproul demonstrates that Roman Catholicism and Evangelical Protestantism are simply not in agreement when it comes to the essential issue of how a person is justified before God--and both ways cannot be correct. At one time in church history, both sides recognized this and felt passionately about it. Now, fuzzy theology and \"spiritual\" experience has tended to blunt the sharp edge of biblical and theological truth.Readers in either camp should be happy that the issue has been clarified. The quest for unity at the expense of truth--or even truthfulness about the positions in question--is not helpful. Let each side figure out what they believe and try to convince the other--but let us be done with saying that we all believe the same thing when there are clear and critical differences!If you want help in understanding those differences and in understanding how you can be sure of your eternal destiny through faith in Jesus Christ alone--and not having to wait for some final judgment you have no hope of surviving--read this book and anything else Sproul has written along with the New Testament.Grace alone, faith alone, Christ alone!",
                "review/helpfulness": "9/12",
                "num_reviews": 12
            },
            {
                "review/text": "It should be noted from Art Sippo's review that he is strongly Roman Catholic, so why should we be suprised that he does not come to the same conclusions about the Gospel as evangelicals do? What we should be suprised by is the fact Mr. Sippo could be so blind that he could see right past the cover where it says &quot;The Tie that Binds EVANGELICALS Together&quot;. He is right about the fact that this isn't a defense of sola fide. But then again Dr. Sproul makes it quite clear that it isn't intended to be. This is a call for evangelicals to get their acts together. Mr. Sippo's anti-evangelical bias was the sole basis for his reveiw. I suppose my frustration towards Mr. Sippo was mine. Dr. Sproul couldn't make it clearer in the opening pages that this book is for the evangelical community. Mr. Sippo's review is essentially irrelevant for that reason.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "a critical introduction to the new testament interpreting the message and meaning of jesus christ",
        "description": "This book introduces the New Testament in two senses: it not only provides basic literary and historical information on each of the twenty-seven writings but also orients readers to the religious, theological, and ethical issues related to the message and meaning of Jesus Christ. The overall goal is to help interested readers of the New Testament become informed, responsible interpreters of these writings and thereby enrich their personal faith and understanding. By giving special emphasis to how the New Testament has helped shape the church's identity and theological outlook throughout the centuries, as well as the role it has played within the broader cultures of both East and West, this introduction also seeks to assist readers in exercising creative, informed leadership within their own communities of faith and in bringing a deeper understanding of early Christianity to their conversations with the wider public. Along with separate chapters devoted to each New Testament writing, there are chapters explaining how this collection of texts emerged as uniquely authoritative witnesses to the church's faith; why they were recognized as canonical whereas other early Christian writings were not; how the four canonical Gospels are related to one another, including a discussion of the Synoptic Problem; how the Jesus tradition--his teachings, stories from his ministry, and the accounts of his suffering, death and resurrection--originated and developed into Gospels written in narrative form; and how the Gospels relate to Jesus Christ as he was and is. Also included is a chapter on the writings of Paul and how they emerged as a collection of authoritative texts for the church. This chapter includes a discussion of ancient letter-writing, special considerations for interpreting the Pauline writings, and Paul's decisive influence within the history of the church and western culture.",
        "authors": "['Carl R. Holladay']",
        "infoLink": "http://books.google.com/books?id=CUXim2wXtwsC&dq=A+Critical+Introduction+to+the+New+Testament:+Interpreting+the+Message+and+Meaning+of+Jesus+Christ&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Dr. Holladay was my N.T. professor at seminary and was absolutely outstanding. This book is a must for serious students of the N.T.. The included CD has a tremendous amount of material not included in the book which is equally outstanding. As a pastor, I keep this book on my desk at all times. Fantastic !!!",
                "review/helpfulness": "15/18",
                "num_reviews": 18
            },
            {
                "review/text": "From the book:This introduction provides basic literary and historical information on each of the twenty-seven writings of the New Testament, but it also orients readers to the religious, theological, and ethical issues related to the message and meaning of Jesus Christ. By giving special emphasis to how the New Testament has helped shape the church's identity and theological outlook throughout the centuries and the role it has played within the broader cultures of both East and West, this book assists readers in exercising creative, informed leadership within their own communities of faith. A distinctive feature of the book is its simultaneous publication in two formats: a standard printed edition with comprehensive yet detailed coverage; and the Expanded CD-ROM Version, which includes supporting endnotes, extensive annotated bibliographies on each New Testament book, additional maps, diagrams, and charts, and other resources for classroom use and personal study.",
                "review/helpfulness": "14/17",
                "num_reviews": 17
            },
            {
                "review/text": "While a student and one of Dr Holladay's student assistants in the mid-eighties, I wondered when he would write his 'big book'. This is it. This critical introduction will no doubt become the standard introduction to the New Testament in most seminaries and, hopefully, college courses. Dr. Holladay is an absolutely first rate scholar who maintains a keen interest in the Church's life and ministry. The book is the ideal combination in that it is both thorough and accessible. I recommend it enthusiastically and without reservation.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the apostolic fathers modern translations of these early christian writings barnabas i ii clement the didache hermas ignatius polycarp",
        "description": "The writings in this volume cast a glimmer of light upon the emerging traditions and organization of the infant church, during an otherwise little-known period of its development. A selection of letters and small-scale theological treatises from a group known as the Apostolic Fathers, several of whom were probably disciples of the Apostles, they provide a first-hand account of the early Church and outline a form of early Christianity still drawing on the theology and traditions of its parent religion, Judaism. Included here are the first Epistle of Bishop Clement of Rome, an impassioned plea for harmony; The Epistle of Polycarp; The Epistle of Barnabas; The Didache; and the Seven Epistles written by Ignatius of Antioch-among them his moving appeal to the Romans that they grant him a martyr's death. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "authors": "['Various']",
        "infoLink": "http://books.google.com/books?id=hh5U4Bfl3owC&dq=The+Apostolic+Fathers:+Modern+Translations+of+These+Early+Christian+Writings:+Barnabas+/+I&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Fr. John Sparks's book is easy to understand, well organized, and a must for all Christians, whether Orthodox, Catholic, or Protestant. Before each letter of some of the Church's first century fathers is a little introoduction about the writer and the reason for the letter. Next there is an outline so the reader can familarize themselves with the letter, its content, and the direction the author is taking. Then the letter itself appears.It is amazing that we often think that our generation are the first to discuss important issues such as church order, morality, repentance, and etc. It is imparitive we listen to the wisdom of the ancients. This is a great book and Fr. Sparks has done a great job organizing the book for ease of learning and reading. For another similar book, please also see &quot;Early Christian Writers&quot; by Cyril Richardson.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "RATING: 4.25 / 5.00 starsINTRO:A wonderful way to start reading about the Church and Christians from the New Testamental church. The books and letters included in this volume date from the late 90s to the end of the 2nd century, a time when the disciples of the Apostles spread the Good News of God's Kingdom and of Jesus Christ.CONTENT:Jack N. Sparks does an extraordinary job translating and laying out the writings with excellent footnotes and for bonus - cross reference Bible verses (OT and NT). For anyone familiar with the New Testament writings of Paul, John, James, Peter, and other important followers of Christ, this volume is a great continuation of the times and lives of these brave and courageous Christians facing deadly persecutions, prejudice from more dominant religions of the day, and false and vile accusations.AUTHOR:Jack N. Sparks is one of the former Campus-Crusade-for-Christ disciple makes in the 60s USA, who is part of a larger group of neo-Protestants (over 4000) who formed the Evangelical Orthodox Church in the late 70s and officially joined Orthodoxy in the 80s. This may explain why the format of the text and abundant cross-reference Bible-verses made it very easy for a Protestant like myself to read the text with pleasure. The cross-referenced verses are a good evidence that the writing of the early Church Fathers were in line with the authors of the New Testament. By the end of the 5th century the conciliar minds of the Church have made the spirit-led decisions of which books were inspired and which were merely spiritual.CONCLUSION:I wish I could give this edition a 5-stars, but the binding (paperback) plus less than standard printing and font-set, makes this collection something that could look more academic and tight. I hope they will have a 2nd edition, but regardless, the wisdom contained between its covers are pearls of wisdom and insight into the life of the Christians and Church in the 2nd century.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "Fr. Sparks provides an excellent easy to read translation of these important early Christian texts. He also has a very brief introduction to each of the books that places the work in context for both the author and the period.The Apostolic fathers is an important collection of work in the earliest stratum of Christianity. Many of these works were seriously considered for inclusion in the collection of the New Testament. They provide keen insight and context to the spiritual life of the early Christian community.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "the plot against the church",
        "description": "This book, The Plot Against the Church, was published prior to the beginning of the Second Vatican Council as a warning of what the dark powers had in store for the Church. The high ranking clerics, writing as Maurice Pinay, stated that the ultimate purpose of the Council was to remove the crime of Deicide from the Jews and assign it instead to the Romans. It is a scholarly work, worthy of consideration of all who would understand Christian history and Christian defense against forces seeking to destroy the Church and Faith. While written in 1962, Rabbi Louis Israel Newman wrote much the same from the Jewish side in his 1925 work Jewish Influence in Christian Reform Movements, which is quoted extensively in The Plot.",
        "authors": "['Maurice Pinay']",
        "infoLink": "http://books.google.com/books?id=Be10DwAAQBAJ&dq=The+Plot+Against+the+Church&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book was compiled by a small group of members of the Roman Curia shortly before the Second Vatican Council. They were concerned that the the Vatican Council called by Pope John XXIII would be used to push forward a modernist anti-Catholic agenda within the church by certain cardinals and bishops--their aim being to \"water down\" Catholic teaching and to weaken the church by placing it in a state of flux and confusion. The book goes on to say how this is a concerted effort orchestrated by the traditional enemies of the church--Protestants, Jews, & Freemasons--and that many of them have infiltrated the church on a high level!This book would be considered anti-semitic by almost all readers of this day and age, however the authors are rather upfront and claim to be such. While this book goes to a rather un-Christian the extreme in denouncing the Jews, the really startling thing about the book is that the predictions of the authors have come true!Not taking into account the rabid anti-semitism, this book is a must for anyone interested in traditional Catholicism and the ramifications of the Second Vatican Council on the Roman Catholic Church.",
                "review/helpfulness": "20/26",
                "num_reviews": 26
            },
            {
                "review/text": "This outstanding, and terribly important, book depicts the greatest conflict in the history of mankind, the battle of the Mystical Body of Christ, His Holy Church, against the Synagogue of Satan. In over six hundred pages of beautifully written text, the book describes in exquisite detail this monumental struggle, identifying the leading characters on each side of the strife, their tactics, strategies, motivations, successes, and failures. This is truly the history of human civilization writ large for all to see.Maurice Pinay is evidently a pseudonym for a group of holy priests who felt it their Christian duty to represent this awe inspiring struggle to as wide as audience as possible at the time of the betrayal of Vatican II. Their intent was to derail the attempt by traitors within Holy Church to alter two thousand years of consistent Church teaching and tradition. Sadly, the attempt did not meet with total success as we can discern by reviewing the results of Vatican II and the Pontificates of John XXIII, Paul VI, and John Paul II. It seems that John Paul I attempted to reverse some of the trends of Vatican II and to drive out some of the traitors who then still infested the Vatican hierarchy. For this, he went to a mysterious and early death. Yet, we will sin not against hope, ever embracing the teaching of Holy Scripture that the gates of Hell shall not prevail against Holy Church.The language of this terribly important book is beautiful, and its message is as important as anything that could possibly happen on this Earth. Read this important and wonderful book. And be both richly blessed and well informed in the process.",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "This is it! I embarked on this book, from reading a review on another book, i found it online to read, which i later bought. This book will drop your mouth to the floor, I own over 300 books to my personnel library, this books is scholarly written and well researched and documented, this book is a extremely, extremely, educating piece of work. if you want to known the real PLAYERS,,,of Communism and Socialism, Illuminati etc,,,, look no further. this is a must read. I also recommend : Under The Sign Of Scorpion, (Juri Lina) The Controversy Of Zion ( Douglas Reed)",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "after jesus the triumph of christianity",
        "description": "The \"marvelous\" (Reza Aslan, bestselling author of Zealot), New York Times bestselling story of how Christianity became the dominant religion in the West. How did a religion whose first believers were twenty or so illiterate day laborers in a remote part of the empire became the official religion of Rome, converting some thirty million people in just four centuries? In The Triumph of Christianity, early Christian historian Bart D. Ehrman weaves the rigorously-researched answer to this question \"into a vivid, nuanced, and enormously readable narrative\" (Elaine Pagels, National Book Award-winning author of The Gnostic Gospels), showing how a handful of charismatic characters used a brilliant social strategy and an irresistible message to win over hearts and minds one at a time. This \"humane, thoughtful and intelligent\" book (The New York Times Book Review) upends the way we think about the single most important cultural transformation our world has ever seen-one that revolutionized art, music, literature, philosophy, ethics, economics, and law.",
        "authors": "['Bart D. Ehrman']",
        "infoLink": "https://play.google.com/store/books/details?id=4H2uDgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "I think this book presents the earliest periods of Church history, from Jesus Christ to 600 AD, in a very readable and entertaining manner. The book will suit everybody, but particularly the average reader, who might lack formal theological training. By the average person, I mean someone whose knowledge of Church history might only extend back to when his or her pastor was born, but who has a sense of history and wants to know about the origins of his or her faith.The book has many charts, pictures, and anecdotal stories, thus making it suited for those who do not have the time, or the will, to read volumes on Church History (since many Church History books are densely written for the scholar). The charts are particularly useful, such as the ones detailing the four views of Christ during the 4th century Trinitarian controversies, and the canon chart, showing which early writers accepted which books as holy. There is a nice index, and a glossary of important terms for easy access. If there was ever a Church History coffee table book, this is it!I am saddened that this is now out of print. Whenever a friend asks me why I study church history in graduate school, and what exactly it is, I usually let them borrow this book. It is scholarly (Jaroslav Pelikan, noted Church Historian, contributed to it), as well as readable. I hope someday it is back in print, so that non-scholars and scholars alike can benefit from it! When I teach a Church History class in the future I would like to use this book as kind of a primer, to get the students interested and prepared to dig deeper.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "This is a no nonsense historical account of the five centuries after the cruxificion of Jesus Christ. If you are Catholic, it will unravel many of the symbolism the Church incorporates into the liturgy or mass. For example, the book has an excellent depiction of the evolution of the wording that went into the Apostle's Creed and how it changed several times into what we hear Catholics profess today. The book offers a perfect chronology of the Christian movement from its beginnings as a Jewish sect to the structuring of one of the most powerful religious institutions of our time. The illustrations and photographs, as well as the easy reading level, make this book enjoyable from beginning to end. It is the perfect primer on the history of Christianity before the Protestant Reformation and the beginnings of Islam. I recommend it to anyone with an interest in historical theology.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "early christian writings the apostolic fathers penguin classics",
        "description": "The writings in this volume cast a glimmer of light upon the emerging traditions and organization of the infant church, during an otherwise little-known period of its development. A selection of letters and small-scale theological treatises from a group known as the Apostolic Fathers, several of whom were probably disciples of the Apostles, they provide a first-hand account of the early Church and outline a form of early Christianity still drawing on the theology and traditions of its parent religion, Judaism. Included here are the first Epistle of Bishop Clement of Rome, an impassioned plea for harmony; The Epistle of Polycarp; The Epistle of Barnabas; The Didache; and the Seven Epistles written by Ignatius of Antioch-among them his moving appeal to the Romans that they grant him a martyr's death. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "authors": "['Various']",
        "infoLink": "http://books.google.com/books?id=hh5U4Bfl3owC&dq=Early+Christian+Writings:+The+Apostolic+Fathers+(Penguin+Classics)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Staniforth's is a superb translation of the Apostolic Fathers, the best I have ever come across. It is very readable. Each writing comes with an introdution by the editor detailing its history --- when and where it was written, etc. --- and discussing its main themes. This would make a excellent addition to the library of anyone interested in early Christianity.The texts included in this volume are 1 Clement; the 7 epistles of Ignatius to the Ephesians, Magnesians, Trallians, Romans, Philadelphians, Smyrnaeans, and Polycarp; the epistle of Polycarp to the Philippians; the Martyrdom of Polycarp; the Epistle to Diognetus; the Epistle of Barnabas (despite what one of the previous reviewers says, it's included in this volume); and the Didache.Conspicuously absent are the Shepherd of Hermas and the fragments of Papias. Both have usually been considered Apostolic Fathers, and I am a little baffled at their omission.Other recommended Penguin Classics: &quot;The Jewish War&quot; by Josephus, &quot;The History of the Church&quot; by Eusebius.",
                "review/helpfulness": "86/86",
                "num_reviews": 86
            },
            {
                "review/text": "Early Christian Writings is an excellent collection of the works of the Post-Apostolic Church Fathers. It is for anyone looking for literature that opens a window into the Post-Apostolic Early Church. The epistles included are The First Epistle of Clement to the Corinthians; The Epistle of Ignatius to the Ephesians, Magnesians, Trallians, Romans, Philadelphians, Smyrnaeans, and to Polycarp; The Epistles of Polycarp to the Philippians; along with the Epistles to Diognetus and Barnabas. The book also includes the Didache and the martyrdom of Polycarp. For some reason Louth did not include the Shepherd of Hermas and the fragments of Papias, though he does mention them as being part of Cotelier's collection of writings by the Church Fathers.If you are interested in the writings of the Church Fathers, and have never read such a collection, you can have some enjoyable and moving reading ahead of you. In reference to his pending martyrdom Ignatius writes, \"I am His (God's) wheat, ground fine by the lions' teeth to be made purest bread for Christ\" (Romans 4). He also says, \"To die in Jesus Christ is better than to be monarch of earth's widest bounds. He who dies for us is all I seek; He who rose again for us is my whole desire\" (Romans 6). The Epistle to Diognetus contains a vivid and compelling description of the early Christians. The second half of the Didache is full of interesting guidelines and instructions to the early believers on such things as baptism and fasting. Louth includes some good commentary about the fascinating account of the martyrdom of Polycarp.The translation by Staniforth is very readable. The introductions by Louth are interesting, helpful, and well written. The notes following each book provide the author's commentary of the passage, assistance on difficult passages, insight into the mindset of the writer, important historical information, and other resources for further study. These early church writings are available on the Internet but I have not found any Internet sources that provide as good a presentation of the writings as Early Christian Writings. The inclusion of The Shepherd of Hermas and the fragments of Papias would have made it a more comprehensive collection. Despite this exclusion, for those looking for such a collection, I recommend Early Christian Writings.",
                "review/helpfulness": "33/34",
                "num_reviews": 34
            },
            {
                "review/text": "This collection is a decent collection and translation of the Apostolic Fathers for the general reader. I have two gripes though.One is that the Shepherd of Hermas is not included. I would imagine this was because of its length, but the collection seems woefully inadequate without it.The second is that the verse and chapter numbers are not given in a form that makes them the least bit usable when looking up passages that are referenced in other books.For research purposes, I would recommend the Loeb Classical Library editions or the excellent one volume reworking of the Lightfoot edition available from Baker Books edited by Michael Holmes.But if you're not out to be the next Jarislav Pelikan or J.N.D. Kelley, then this should do just fine for some interesting and inspiring reading.",
                "review/helpfulness": "32/34",
                "num_reviews": 34
            },
            {
                "review/text": "This book contains many post-apostolic writings of the early church. Most were written very soon after the apostolic age however. The translation and footnotes are for the most part rendered in modern English and flow well. The footnotes and introductions to each book are helpful. This would be a good book to buy if you wish to begin studying the early church.",
                "review/helpfulness": "16/19",
                "num_reviews": 19
            },
            {
                "review/text": "This is one of those paradigm-changing books. At least, its the one that has brought me closest to converting from Baptistic evangelicalism to Orthodoxy (or, to a lesser extent, Catholicism).The letters of St. Ignatius were particularly troubling - in a good way. I was taken aback by his hardcore bishop-and-eucharistic centered theology, as well as his clearly defined tripartite form of church government of bishop, priest and deacon. His letters, which also powerfully attest to the martyr spirituality of the early church, really caused me to re-think whether congregationalism is right interpretation of Scripture. I mean, exegeting the Scriptures alone doesn't seem to yield a single conclusion, but to have a record of an episcopal form of church government from a bishop who was purportedly acquainted with the Apostle John... well that's got to count for something, right?All of the works in this volume are elegantly translated, and would do any Christian a world of good to read, especially evangelicals who are wanting to be introduced to the writings of the Church Fathers and who don't know where to start. Without question, this is the book to begin with, for the best, and earliest source materials, in an easy to read, yet intelligent, translation.",
                "review/helpfulness": "17/18",
                "num_reviews": 18
            },
            {
                "review/text": "I would go for a larger collection, even though this translation is more contemporary than most, there are larger collections available which is important so as to be able to compare and contrast the texts of different times. I wasn't a huge fan of it but I've read all of the texts in various different translations previous to this so I was able to compare in addition to having done quite a lot of study on the history, authors, and documents presented in this translation.far more historical background is needed in this book so as not to allow these excellent works to be simply documents or writttings, but rather writtings expressing extremely important theology and facts or history. An antique vase is only a piece of glass in a funny shape until one knows how difficult it is to make one and get that &quot;funny&quot; shape and the history of the vase and the culture, ideology, and person(s) responsible for expressing the artistic nature which the vase expresses, then it becomes priceless. Such it is with these writtings, more historical background needed to be given for those less informed about it.",
                "review/helpfulness": "13/16",
                "num_reviews": 16
            },
            {
                "review/text": "Since I'm only beginning to study the history of the early church, I can't comment on the omissions other reviewers here cite as this book's major flaw. But I can say that the documents included in the book offer the average reader a fascinating insight into the beliefs, pracices and history of the earliest post-Apostolic church. And for religious polemicists, these documents show that it was not a congregationalist, Sola Scriptura, Sola Fide church that enshrined the right of the individual believer to interpret and practice the Faith according to his conscience. This was a hierarchical, sacramental, united church which believed in the necessity of works in addition to faith and believed that its gold standard of truth and teaching authority resided in the Apostolic succession of its bishops. Since some of the Church Fathers included in this book had actually known the Apostles or men who had been taught by the Apostles, this view of Christianity has to be given the greatest weight as that intended by Christ. Roman Catholic apologists specifically will also find support in the First Epistle of Clement to the Corinthians (circa 96 AD) in which the bishop of Rome involves himself in the affairs of the Corinthian church and adjudicates their dispute. Whatever your religious perspective though, this book is a wonderfully informative glimpse into a age most people only know about through the filter of technicolor Hollywood epics (Quo Vadis) or the bare-bones hagiographies of martyrs.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "A couple of reviewers mentioned the omission of Hermas and Papias in this edition. The editor also has omitted the so-called Second Epistle of Clement - not by Clement but still recognized as the oldest Chirstian sermon we have - apart from the Homily to the Hebrews, of course (Heb. 13:22).Omissions like these are sad because the books omiited were key documents that influenced the Fathers (esp. Hermas and Papias). 2Clement also preserves some interesting \"agrapha\" - sayings of Jesus not written in the canonical Gospels.Why were these omitted? It is a short book that would not have been greatly enlarged (less than 100 pages) by the addition of these three works that are always included in other editions of the Apostolic Fathers.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "Why isn't this book on every evangelical seminary's guidebook to help us avoid many of the false teachings of the modern cults and churches? After studying in seminary and being mostly influenced by Dallas Seminary's Lewis Sperry Chafer and majority of trusted pastors of the last 150-200 years (Charles Spurgeon, Charles Swindoll, Graham, Kenneth Wuest, D.L. Moody, Matthew Henry, G.Campbell Morgan, J. Vernon Mcgee, and host of other popular writers), this is the first time I have known that we have actual writings of the early church pastors in such an easy to read guide format.How the faithful looked at their impending martyrdom is beautifully seen in \"the letter of Ignatius to the Church in Rome\" and in Pastor Polycarp's martyrdom written down by the faithful for our edification. It is amazing how their view of faith included trust in Christ all the way to the end, just like John Wesley taught.It is awesome to know that the early Church always baptized in the name of the Holy Trinity as I read in the last pages of this book, in \"teachings (didache/gk) of the apostles\".It is awesome to read that worshipping Christ as God was a normal practice of faith among early Christians from the beginning and how much these trusted pastors exalted our LORD's words and life, death and resurection as the foundation for all Christians.Surprisingly, our early church also saw great significance in the life of Christ as they saw our imitation of Christ's Perfect life to be a holy goal of every Christian every day of our lives. They did not interpret \"be ye perfect as your Father in Heaven is\" allegorically or as pre-Grace-dispensational in any way. To them, good works of Love motivated by Faith in Christ's Perfect Life and passionate suffering at the Cross, with His victory over satan through death and Resurrection, was a much stronger emphasis of the basis for our Salvation than simply saying a \"magical\" 4 laws or sinner's prayer to welcome Jesus in our hearts. The early Church's view of God's Grace is clear: \"By Grace you are saved, not by your own doing, but by the will of God in Christ Jesus\" spoken by Polycarp, the trusted disciple of John called and appointed to lead the Church in Smyrna. However, it is also true that they took Paul's words in Galations 5 as Holy Scripture and took all of Christ's words inline with James' letter, rather than show an adverserial relationship between Christian good works and our faith in Christ. To them, Christ's calling to holiness, His perfect obedience through the pains of the cross, revealed faithful calling of the Christian to live holy lives as part of our salvation, rather than as a separate past/present/future salvation message that I have heard by majority of our teachers in the past 200 years.I was surprised to read that John Calvin, Martin Luther, and John Wesley, honored many of these early Christian writings and always taught reading them for edification and Biblical understanding as PART of our sola scriptura belief, and they never intended that anyone should read the scriptures and privately interpret it against the writings of all these early church pastor's teachings. No wonder all Christians everywhere agreed for majority of the first 1800 years of our faith on the significance of Baptism, Holy communion and hosts of other early church practices and beliefs and none of them tried to use \"saved by Grace unto good works\" as beyond what the early church taught, that there are jewish cereminial laws we were freed from unto Christian good works in Love.The view of humility in Ignatius truly is humbling against majority of our teaching in the western culture, since he would never want any believer to independent of the Apostolic Christian Church to exalt oneself above the honest teachings of the Apostles and trusted pastors of the early church.I would highly recommend this translation. Easy to read and follow without liberal antiChristian slants from some other early church books. The print material is also easy to read unlike the glaring papers used by Meier's Eusebius edition and there is not much antiChristian antihistorical Christian bias one finds in some of the early church translations.",
                "review/helpfulness": "8/9",
                "num_reviews": 9
            },
            {
                "review/text": "As everyone knows, not every book written in the early church made it into the final \"canon\" as we have it. There is a huge number of books that didn't and certainly are still notable for their contribution to the early church and its development.The Penguin Classics \"Early Christian Writings\" gives you a relatively good introduction to some of these books, including Clement's Epistle to the Corinthians, (it seems they didn't stop being naughty after Paul bashed them), letters from Ignatius of Antioch on his way to becoming pet food for lions, the Didache and a couple of others.Like other Penguin books, it is not the best translation available, but it is a good, cost-effective introduction to the books involved. It also affords you a nice insight into the early life of the church and what some branchs of it thought about various issues.I particularly found the Didache and Ignatius' letters interesting for various reasons. The Didache especially so for the brief glimpse it gives of early church life and teaching.Additionally, I found the translation to be more readable than other Penguin books, and this made getting through it that much easier. The translation is pretty good, and it is accessible and reasonably well styled for the modern reader.For a little reading that is different and interesting on early church matters, this little book is very good. I recommend it, and you won't regret spending just a few bucks on it.",
                "review/helpfulness": "6/7",
                "num_reviews": 7
            }
        ]
    },
    {
        "Title": "early christian creeds",
        "description": "A comprehensive study of the well known and not so well known creeds",
        "authors": "['J.N.D. Kelly']",
        "infoLink": "http://books.google.com/books?id=Titk-TEYqD4C&dq=Early+Christian+creeds&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I am a graduate student in theology and have been doing research for a few years now in early medieval church history, concentrating on corruption and controversy. While recently studying the filioque controversy, I had come across many many bits and pieces about this, but had never found an outline in one place until I came across this book. Kelly writes in a clear and easily understood manner. This text should be on the shelf of any pastor, historian, or theologian.",
                "review/helpfulness": "21/24",
                "num_reviews": 24
            },
            {
                "review/text": "When we lost JND Kelly a couple of years ago (he was in his 90's), the theological world, both Catholic and Protestant, lost a giant. &quot;Ancient Christian Creeds&quot; demonstrates a part of Kelly's genius. It is an invaluable resource for the graduate level or seminary student in theology (and was, in fact, one of the texts used in my Historical Theology class when I was a seminarian). Kelly describes the evolution of creedal thoughts and ideas, as well as the development of the various formulae themselves, beginning with the Old Roman Baptismal statement through the Creed of Nicea/Constantinople.I can't recommend this book highly enough.",
                "review/helpfulness": "19/19",
                "num_reviews": 19
            },
            {
                "review/text": "INTRO:A CREED in short is a basic formulation of ones faith.J.N.D. Kelly is the premier writer in the area of early Christianity (few Church historians reach his depth and width ... worthy mentioning here is Jaroslav Pelikan). Any Christian (lay or clergy) will be blown away by this book, as their faith in Christ and the Apostles will be strengthened.CONTENT:This is not a fast read (many chapters and much detail) but J.N.D. Kelly starts our slow enough where anyone can see that he is approaching this topic with an open mind (did the early Christians of the first century have a CREED)? In the end we learn that history does not give us enough evidence for an answer, BUT we can see even from the New Testament extant manuscripts and texts that there are remenants and hints about CREEDAL statements.CONCLUSION:This invaluable resource is also used for seminary students and graduate work in theology (such as Historical Theology courses). In this book one learns the evolution of creedal thoughts and ideas, as well as the development of the various formulae themselves, and both Eastern Church and Western Church statements and creeds are well represented (especially the oecumenical one - Nicaea-Constantinople).I concur with the previous two reviewers that this is a book that I cannot recommend enough, and one that should be on the shelf of any pastor, historian, or theologian.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "sacrament of salvation an introduction to eucharistic ecclesiology",
        "description": "For all who wish to develop a eucharistic understanding of the Church and its application to issues of current debate.",
        "authors": "['Paul McPartlan']",
        "infoLink": "http://books.google.nl/books?id=tSiha9BMxEQC&dq=Sacrament+of+Salvation:+An+Introduction+to+Eucharistic+Ecclesiology&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Dr McPartlan's work not only explains the ecclesiological aspects of the Eucharist (a critical and often neglected topic) but provides very original, fascinating treatment of New Testament texts in the eucharistic context.For example, McPartlan's explanation of Hebrews 18, and the relation to the parousia and Eucharist, and his treatment of the Lamb and multitude in Revelation, make for superb reflections, meditation, or topics for group discussion. The only reservation that I would have about that last is that, since later chapters defend the Vatican position and admit only Roman Catholic and Orthodox Orders as valid, the book may not be suited for group discussions in other sister churches. It nonetheless would be a valuable contribution to the library of anyone interested in sacramental theology and ecclesiology.McPartlan quotes extensively from documents of Vatican II, which makes it an excellent reference for a correct understanding of these (this often sadly lacking elsewhere - my stress was on 'correct.') It is notable that there are many references to the books of the New Testament and earliest Christian texts, and the setting of these in the context of worship and Church fills a most important need.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            },
            {
                "review/text": "So much good liturgical theology brings in ecclesiology (I think immediately of Schmemann's Introduction to Liturgical Theology), and so much good ecclesiology hinges on the liturgy (I think of Ratzinger's Called to Communion). In Sacrament of Salvation, Paul McPartlan explains why. The liturgy and the Church are almost one and the same. If my conception of one excludes the other, I have an incomplete conception of both.The first millenium Church saw that the Eucharist makes the Church. In the second millenium, we forgot that, but knew that the Church makes the Eucharist. Both are true. Both make us.This is the wisdom of the Catholic faith. It is distilled and presented in a clear and stimulating manner in McPartlan's short book. I'm sure I'll refer to McPartlan's work for a long time.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the apology of the church of england",
        "description": "Reprint of John Jewel's classic defense of the Protestant Church of England",
        "authors": "['John Jewel']",
        "infoLink": "http://books.google.com/books?id=w_8NzgEACAAJ&dq=The+apology+of+the+Church+of+England&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "John Jewel wrote his Apology in the mid 16th Century in support of the nascent Church of England. In it, he deftly expresses that the foundation for the Church of England as a separate entity from the Roman Catholic Religion is not a novelty but is found in the Scriptures, in the writings of the church Fathers and in the early Church and even Jewish tradition.For Jewel, he and the Church of England were remaining faithful to the faith handed down from Jesus, the apostles and church Fathers. It was the Roman Catholics and not the Reformational Christians that had rebelled and turned from the true faith. Jewel and others saw themselves as returning to the ancient faith based on Scripture.He makes this solid case in his Apology by rarely making a point without referencing Scripture or a Christian Father or both. In that sense, this book serves as a Biblical Study and church history lesson. He also is adamant in attacking the practices of the Roman Catholic leaders and doctrines of religion that he saw as anathema to the gospel. These include the exaltation of the Pope, private masses, masses said in Latin, purgatory, indulgences and attacks on Protestants. His criticisms are targeted and are not necessarily anti-Roman Catholic; in fact, Jewel pleads for a blessed Christian relationship between the Roman Catholics and Protestants rather than animosity.The case is made for the Protestant church then and Christians at anytime to separate themselves from the established religion when it represents doctrines of man in conflict with the ancient faith received from Christ and the apostles.Jewel pulls no punches and is at times antagonistic. The writing is stimulating and enjoyable, while it is always enlightening. I think that Anglicans today would especially appreciate this book.The copy I read was edited by John Booty and included helpful references. I do not know if all versions will include them or not; either way, the original text is excellent.Shakespeare On Spirituality: Life-Changing Wisdom from Shakespeare's Plays",
                "review/helpfulness": "9/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is one of the first apologies for the raison d'etre of the Church of England and why it is neither Roman Catholic nor Reformed in the way the Protestant churches on the continent were. Jewel came after Cranmer, but before Hooker and should be considered one of the architects of Anglicanism even as he envisioned a Reformed Catholic Church of England. This is also where Jewel threw down the gauntlet and claimed he would convert to Roman Catholicism if it could proven that any number of medieval Catholic \"novelties\" such as private masses for the dead could be shown from the first six hundred years of the ancient Christian church.Jewel was a learned man and published much. He is very comfortable with his use of the early church fathers in defense of the Church of England, but very often the fathers are used as weapons to highlight how much \"innovation\" had crept into the Church of Rome during the middle ages. Jewel himself was something of a disciple of the Zurich Reformer Heinrich Bullinger. Nevertheless Jewel's \"Apology\" became an instant classic and was placed alongside the Bible in every English church.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            }
        ]
    },
    {
        "Title": "foxes book of martyrs",
        "description": "Acts and Monuments by John Foxe, popularly abridged as Foxe's Book of Martyrs, is a celebrated work of church history and martyrology, first published in English in 1563 by John Day. Published early in the reign of Queen Elizabeth I and only five years after the death of the Roman Catholic Queen Mary I, Foxe's Acts and Monuments was an affirmation of the Protestant Reformation in England during a period of religious conflict between Catholics and Protestants. Foxe's account of church history asserted a historical justification that was intended to establish the Church of England as a continuation of the true Christian church rather than as a modern innovation, and it contributed significantly to a nationalistic repudiation of the Roman Catholic Church. The sequence of the work, initially in five books, covered first early Christian martyrs, a brief history of the medieval church, including the Inquisitions, and a history of the Wycliffite or Lollard movement. It then dealt with the reigns of Henry VIII and Edward VI, during which the dispute with Rome had led to the separation of the English Church from papal authority and the issuance of the Book of Common Prayer. The final book treated the reign of Queen Mary and the Marian Persecutions. (courtesy of wikipedia.com)",
        "authors": "['John Foxe']",
        "infoLink": "https://play.google.com/store/books/details?id=122pvtE_TlMC&source=gbs_api",
        "review": [
            {
                "review/text": "Readers of John Foxe's book of martyres should realize that the most complete edition of this work was published in the 1800s and comprised 8 volumes. A bound photocopy of that edition is available from Still Waters Revival Books in Edmonton, Alberta, Canada. They have a web site. The present edition is a small sampling of the real Foxe.",
                "review/helpfulness": "52/63",
                "num_reviews": 63
            },
            {
                "review/text": "This book is to Foxe's original work as a pocket dictionary is to a full size, complete Webster's (the kind that requires a stand).Foxe's original work is nearly 7.000 pages in eight volumes! But the really sad thing is that this particular edition has been so carelessly edited, rewritten, and corrupted. There is even a chapter about John Calvin, whom FOXE NEVER WROTE ABOUT!All the Catholic/Protestant quibbling about Foxe's book is pathetically stupid, especially between people who've never even laid eyes upon the complete work. Besides, the REAL church was started over two hundred fifty years before Rome laid claim to Christianity -- and the first Christian church building was erected in England within three years of the crucifixion. So true Christianity is neither Catholic (never was) NOR Protestant (having never been Catholic, there was nothing for REAL Christians to protest except the way they were treated by both groups).The truth is that Foxe accurately chronicled Roman Catholic atrocities of his time, but he also wrote in support of the Reformed (Protestant) church which used very similar tactics. He also reached some incorrect conclusions, for which he can easily be forgiven, since they are not central to his work and he did not have the research tools we have available today.But the real point is that THIS BOOK IS NOT FOXE'S WORK and bears almost no resemblance to it. If you are interested in obtaining a a reprint of the REAL Foxe work, contact swrb(dot)com on the world wide web -- select \"Rare Bound Photocopies\" then look under \"F\" for Foxe's work. I am not necessarily endorsing any of the other works they sell, but they are the only current source I know for the complete Foxe work.Any Christian foolish enough to think they've read \"Foxe's Book of Martyrs\" after reading the Thomas Nelson edition (or most other \"modern\" versions) is probably unlearned enough to call himself Catholic or Protestant.",
                "review/helpfulness": "36/53",
                "num_reviews": 53
            },
            {
                "review/text": "Some historians have pointed out that Foxe was biased against Catholics. Although his personal conflict against Catholicism likely drove his effort to put this book together, one has to recognize that the very abuses described in this book are a large part of WHY he was set against Catholicism in his own day in the first place. So far as I know, most or all of the stories of burning heretics, which Foxe describes, are true. All of which is a part of what Pope John Paul II has begun apologizing for at the change of the millennium.But Foxe also spends an equal amount of time retelling the stories of Christians who were killed for their faith during the days of ancient Rome. As a result, I don't think the book builds Roman Catholic resentment in most readers. Instead, it reveals the real fabric of Christian faith. Those who like only a rosey picture of the Church are no different than those who like only a rosey picture of the real world we live in. This book describes the dark times in Christian history, but the light is never lost in that darkness. And that is what this book is really about--the inability of the darkness to snuff out the light of true faith--whether it is an internal darkness within the Church or an external darkness that tries to engulf the Church.",
                "review/helpfulness": "41/51",
                "num_reviews": 51
            },
            {
                "review/text": "John Foxe's Book of Martyrs is indeed a classic of Christian literature. John Foxe was born in 1517 and died in 1587. John Foxe documented the persecutions of Christians from the foundation of the church through his time. Outside of the Bible itself, this is one of the few books every Christian should read. From time to time the book has been updated to cover generations John would not live to see. While this book is a worthy read - be aware that this is not a faithful word for word reprint of the original works but as the cover says a rewrite. If you are interested in a rendition which remains more faithful to the the original author's words, look for a reprinted edition edited by (co-author) William Forbush.",
                "review/helpfulness": "35/40",
                "num_reviews": 40
            },
            {
                "review/text": "If you want to get the full and true book by John Foxe then try elsewhere. There seems to be somewhat of a campaign to slur the works of John Foxe here. Any true Christian / Protestant should read this book alongside other books and the truth will be revealed. William Tyndale the English reformer strangled and burned at the stake for translating the bible into Enlglish. Protestant Archbishop of Canterbury, Thomas Cranmer was burned at the stake also. In Lewes in England they still have annual bonfires to celebrate the Protestant Martyrs who were burned in the town centre by the Catholic bishops and priests. If you care to watch the film Elizabeth with Cate Blanchet it shows Protestants being burned as \"heretics\" and shows the Vatican signing a declaration that anyone who assasinated the illegitimate heretical whore Queen Elizabeth would be guaranteed a place in Heaven by power of the Pope. Catholic doctrine still states to this day that the RC Church has the right to kill \"heretics\" and recently (2000) Rome has declared that Protestant Churches are not true Churches.These are best put by Cardinal Manning in the Pope's name: \"In Christ's right I am Sovereign. I acknowledge no civil superior: I am the subject of no Prince, and I claim to be the supreme judge on earth, the director of the consciences of men; of the peasant that tills the field and the Prince that sits on the Throne: of the household that sits in the shade of privacy and the legislator that makes laws for the kingdom. I am the last sole supreme judge on earth of what is right and wrong.\"Cardinal Heenan, former Archbishop of Westminster, declared: \"Ecumenism does not mean pretending that all denominations are equally true; it does not mean that the [Roman] Catholic Church has nothing more than other churches. The ultimate object of ecumenism is to unite all Christians under the Vicar of Christ--the Pope.\"The cardinal widely regarded as Catholicism's second most powerful figure has upset Irish ecumenists by claiming that the Pope is developing \"papal primacy\" in his relations with other Churches.Quite clearly as all the reformers summised (Calvin, Luther, Knox, Wesley, Cranmer etc) - The Pope is anti-Christ and this work is a must read for all true Christians.It is perhaps gruesome and violent as one other reviewers has stated but that is no reaaon to hide it away and ignore the facts of what happened. People died for our civil and religious liberties during the Reformation and Glorious Revolution times and that should be remembered and taught to all our children. Christ clearly is paramount but we should not forget history and the lessons to be learned. Power, money and greed can corrupt and this is evidenced throughout the history of the Catholic Church.",
                "review/helpfulness": "20/33",
                "num_reviews": 33
            },
            {
                "review/text": "Prepare to be angry, very angry. This book is the ultimate collection of the truth behind intolerance towards Christians and protestants in particular. Throughly updated and revised it bring the persecution of Christianity through 2002, so that you will see for yourself the more then 500 years of persecution and murder that has been done against Christians. In normal books one reads that Christians were the ones hurting and suppressing others but this book makes plaint he truth, the truth that honest peaceful Christians are the victims of intolerance all over the world from Pakistan to the Sudan to Nigeria to India and beyond. Everywhere lone Christians are under assault and this book catalogs but a small portion of the incidents. From the beating and burning to death of a Christian woman in the Sudan to the raids by armed mobs on Christian youth camps in Indonesia this book is a wonderful collection.The original Foxes book of martyrs was to catalog the assaults in England by the Queen `Bloody' Mary. This text keeps the tradition alive as it details the persecutions from that time to the present. This book may enrage you but it will also wake you up and encourage you to support peaceful protestant movements the world over.",
                "review/helpfulness": "18/27",
                "num_reviews": 27
            },
            {
                "review/text": "This book is the ultimate collection of the truth behind intolerance towards Christians and protestants in particular. Throughly updated and revised it bring the persecution of Christianity through 2002, so that you will see for yourself the more then 500 years of persecution and murder that has been done against Christians. In normal books one reads that Christians were the ones hurting and suppressing others but this book makes plain the truth, the truth that honest peaceful Christians are the victims of intolerance all over the world from Pakistan to the Sudan to Nigeria to India and beyond. Everywhere lone Christians are under assault and this book catalogs but a small portion of the incidents. From the beating and burning to death of a Christian woman in the Sudan to the raids by armed mobs on Christian youth camps in Indonesia this book is a wonderful collection. A must read for anyone interested in the present state of christianity in the world.",
                "review/helpfulness": "17/27",
                "num_reviews": 27
            },
            {
                "review/text": "This book should be read by everyone who calls themselves &quot;Christian.&quot;Anytime I get to feeling life is too tough,and I start feeling like God isn't close,this book and the book of Job are the books to get me back to reality.When you read the book of martyrs and you read the horrible ways these Christians were tortured and killed you realize you have no reason to complain and every reason to be thankful.Thankful not only to Jesus Christ and the apostles, but to the Christians all over the world who are being killed every day for the Gospel.If you have ever wondered how the apostles died, this book tells you.Incidentally, John was the only apostle who died of old age.Humbling and educational",
                "review/helpfulness": "20/24",
                "num_reviews": 24
            },
            {
                "review/text": "I could not agree more with the negative reviews of this product in general, or with Papa_gresh in particular.As a student of this period in history, I was appalled to discover that a significant portion of book is mostly a catalogue of \"modern\" martyrs, accompanied by NOT a full (or even close to scholarly) version of Foxe's original text. Even more shockingly, the editorial comments in the beginning include notes like \"Foxe wrote his book in Middle-English, the language of his day\" (xvi). This is a ridiculous statement at best, considering the fact that Middle English (the language, most familiarly, of Chaucer) fell out of use around 1470, when it was replaced by Early Modern English; in fact, Foxe's language in Acts and Monuments (the Book of Martyrs) is the language of Shakespeare's plays, which are CLEARLY not the same as Chaucer's works--even to someone unfamiliar with either period.The editor compounds this glaring error with the somewhat patronizing note that he has replaced much of the \"difficult to understand\" \"Middle-English\" words \"we no longer use\"....the first example of which is \"abscond.\" Though this is perhaps not a \"Joe Six-Pack\" word, it is certainly one with which most reasonably educated people are, indeed, still familiar. Calling this \"Modern American English\" is yet another upsetting pander to the lowest common denominator--a purpose to which one of the more significant Early Modern texts should under no circumstances be subjected.Even with these errors in scholastic presentation aside, I was again quite irritated to discover how significant a portion of this book entitled \"Foxe's Book of Martyrs\" did not, in fact, consist of said book, but rather the editor's additional catologue of \"modern day\" martyrs of his choosing.N.B.: If the book were RETITLED effectively, it would perhaps satisfy those who still chose to purchase it; however, the prominent use of Foxe's name and original title made the book I received a disappointment at best, and at worst, a poorly written vehicle of Christian propaganda, outrageously and misleadingly disguised as an historical text. I would vehemently discourage anyone the least bit interested in Foxe's historical text Acts and Monuments (The Book of Martyrs) from purchasing this \"version.\"Represented as it is, I would prefer not even to give it the single star Amazon requires.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "I was disappointed in the &quot;New&quot; Foxe's Book of Martrys. I read an older version in my teens. This one has been heavily edited, especially the early church martrydom's. If you're looking for more recent historical information this may be a good book but for early church information go to another edition.",
                "review/helpfulness": "15/17",
                "num_reviews": 17
            }
        ]
    },
    {
        "Title": "becoming orthodox a journey to the ancient christian faith",
        "description": "This is the story of a handful of courageous men and their congregations who risked stable occupations, security and the approval of life-long friends to be obedient to God's call. It is also the story of every believer who is searching for the Church. Where Christ is Lord. Where holiness, human responsibility, and the sovereignty of God are preached. Where fellowship is more than a covered-dish supper in the church basement. And where fads and fashions take a backseat to apostolic worship and doctrine.",
        "authors": "['Peter E. Gillquist']",
        "infoLink": "http://books.google.com/books?id=5EEQAQAAIAAJ&dq=Becoming+Orthodox:+A+Journey+to+the+Ancient+Christian+Faith&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "While the enthusiasm expressed in this work is encouraging, as is the energy witnessed in its expression, it is nonetheless wanting in the extent of its content.Written while the author and his colleagues were new to Orthodoxy, it expresses much more of the 'coming home' sentiment and excitement than it does a detailed description of Orthodox theology or the Church. It is the author's 'conversion experience,' and not so much a discussion of what he was converting to, that is the focus of the work.Yet this book will still find a strong readership in those who are from a Protestant/Evangelical background and are considering Orthodoxy, or are simply intrigued and interested in it. From that perspective, 'Becoming Orthodox' offers insights that will strike close to home, and address many of the issues that are encountered when viewing Orthodoxy from such a background.",
                "review/helpfulness": "64/77",
                "num_reviews": 77
            },
            {
                "review/text": "_Becoming Orthodox_ by Peter Gillquist is a first-person account of the spiritual journey of a group of evangelical Christians over a period of fifteen years to their reception into the Antiochian Orthodox Church. Many of them had been involved in Campus Crusade for Christ during the sixties and had remained in contact with each other during the seventies as they founded churches around the US. They agreed to study Church history to find out what the original New Testament Churches practiced. They noted from early Christian documents such as the writings of the Church Fathers that the Church had Bishops (ordained by the Apostles themselves), a hierarchial structure, Tradition, liturgical worship, communion as the literal Body and Blood of Christ, inscense, icons, the use of &quot;Father&quot; in addressing Priests, the veneration of the Virgin Mary as Theotokos (&quot;God-bearer&quot;) and the Sign of the Cross. In examining the Schism of the Church in 1054 between Rome and the East, Gillquist and his fellow pastors acknowledged that Rome had erred in its Papal claims of universal authority over the Church, and the Western alteration of the Creed which originally stated that the Holy Spirit only proceeded from the Father, when now the Roman Catholic Church teaches that the Spirit proceeds from the Father and the Son (known as the &quot;Filioque&quot;). Gillquist and his affiliated group of churches, which they had labeled the Evangelical Orthodox Church, sought to join one of the Orthodox Churches in America. They were unsuccessful in meeting with the Patriarch of Constantinople, but they were reviewed and accepted by the Patriarch of Antioch and the Antiochian Archdiocese in North America. The style of this book is remarkably easy and engaging, especially when it comes to the discussion of the &quot;Filioque&quot; in the Creed, and appears to be quite popular among both Orthodox and non-Orthodox readers, which is one of this book's strengths.",
                "review/helpfulness": "66/71",
                "num_reviews": 71
            },
            {
                "review/text": "BECOMING ORTHODOX is a personal testimonial by Fr Peter Guilquist written to track the conversion of nearly a thousand Evangelical Protestants to Orthodox Christianity in 1987. This mass conversion was one of the biggest events in modern American Orthodoxy, and Fr Guilquist's book paints a vivid picture of the theological wrestling and jurisdictional complications which ended in the reception of the converts in the Antiochian Orthodox Church.Fr Guilquist and many other leaders of this movement started their Christian occupations in the 1950s and 1960s as activists for Campus Crusade for Christ. They travelled widely, trying to organise rallies at such universities as the uber-liberal Berkeley and Roman Catholic Notre Dame. Their focus was entirely on bringing young people to a personal relationship with Jesus Christ, not on building community, which they saw as denominationalism. Over time, however, they became jaded by their work, because many converts fell away after the initial dedication. They understand the need for a Church which would provide lasting support. Yet, they had no idea what such a church should look like.In the early 1970s these former CCC leaders came together to begin a study of what the Church looked like in the decades after Pentacost, using only the Bible and early Fathers, so that they might form a community mirroring it entirely. They found that the early Church was liturgical, retaining a Judaic structure of worship after the expulsion from the synagogues, and that it was built around the Eucharist, which was seen as no mere commemoration but as a true mystery of faith. They discovered that the Church had a three-tiered division of authority, with bishops defending the faith, and priests and deacons serving the flocks of faithful. In the end, they felt that the only place today that this ancient Church was continued and contained fully was the Orthodox Church. Over time, they discovered that many of the exotic qualities of Orthodox Christianity, such as veneration of Mary and icons, and the liturgical use of incense, were entirely in keeping with the Gospel that gave them strength.However, they had no personal experience with the Orthodox Church, which in the North America of the time was still seen as an ethnic conclave, in spite of a steady stream on individual conversions. They attended various offerings at Orthodox churches, met with Orthodox apologists such as the famed Fr Alexander Schmemann, and tried themselves to follow Orthodox traditions in their own worship. For a long time they were unsure of how to enter the Church which seemed to fulfill the discoveries of their investigations, and the division of Orthodoxy in North America along numerous ethnic lines was a sad complication. The Greek Orthodox Church was disapproving of their entering the Church, afraid that so many Americans would \"dilute Greek traditions\", a shameful blot of nationalism on the Church. Their attempt to meet the Patriarch of Constantinople for guidance was shrugged off. In the end, many of them were losing hope that Orthodoxy could provide a lasting home for them. Then, the Metropolitan of the Antiochian Orthodox Church in America invited them to enter under his guidance, and wished that they would all come in within only a few months. The book ends with a recounting of the mass charismations and ordinations which brought these travellers home after a journey of over a decade. A new afterword written in 1992 talks about the victories made by these converts and their fellow Orthodox in the years since.Fr Guilquist's writing is entertaining and smooth-flowing. Theological arguments are not very deep, but friendly to Evangelical Protestants without much formal training. I am reluctant to criticise a work of such admirable zeal and which is so spiritually uplifting. I wish, however, that the book could have enjoyed some tighter editing and academic typesetting. There is a profusion of exclamation points and italics, and the formatting of the text is not up to professional standards. As it is, the work looks unfortunately amateurish.If you are curious about the Orthodox Church, an academic work like Kallistos Ware's THE ORTHODOX CHURCH (a modern classic) is a must. However, personal testimonials like BECOMING ORTHODOX are also worth reading, and many readers will Fr Peter Guilquist's story quite inspiring.",
                "review/helpfulness": "28/31",
                "num_reviews": 31
            },
            {
                "review/text": "Perhaps it is because when this book was written the author was still in his infancy in his journey to Orthodoxy, and so he can be excused his breathless enthusiasm for everything and everybody he encountered on the way. However, style is no substitute for substance. His constant busyness, traveling from one side of the country to another, taking endless meetings with simply wonderful people, left my head spinning and wondering when he had time for his Church. I found his self-congratulatory tone offputting, and totally at odds with what a life in Christ requires of us: humility, sincerity, sacrifice. How many people he has brought to Christ or healings he has accomplished through prayer is information that does not belong in a book of this type, and would have been better left unmentioned.It does have value in that it carefully lays out the means that Gillquist and his fellow seekers took to come to Orthodoxy: through Biblical research and study of the Church Fathers, references invaluable for all of us.To sum up, this book would be ideal for the (evangelical) Protestant who is considering other faiths and is looking for an apologetic in his or her own lingo; for the rest of us, the book, for what it gives to the reader, requires too much struggle to get beyond the vernacular of Fr. Gillquist's past affiliations.",
                "review/helpfulness": "18/22",
                "num_reviews": 22
            },
            {
                "review/text": "Fr. Peter Gillquist's &quot;Becoming Orthodox&quot; has many flaws if viewed as an introduction to Orthodoxy, but it works well to describe the journey of a former group of Campus Crusade for Christ regional directors to the Eastern Orthodox faith. Evangelical Protestantism is very differnt animal from Orthodoxy, and although Gillquist touches on a few of the issues that seperate the two, he does not go into enough depth to satisfy inquirers. For a similar book that delves deeper into the theological issues present between Evangelicals and Orthodox, I would reccomend &quot;The Way: What Every Protestant Should Know about the Orthodox Church,&quot; by Fr. Clark Carlton. With the flaws in Gillquist's book, it still is valuable to read for the story of the two decade journey that transformed a group of 6-10 Campus Crusade leaders into over 2,000 Orthodox Christians.",
                "review/helpfulness": "13/18",
                "num_reviews": 18
            },
            {
                "review/text": "Do you think that you are the only one who is dis-satisfied with Western Christianity? Is the constant blaring of praise music from a band and Power Point presentations on the church wall losing its appeal? Have you moved from church to church looking for something that is not quite there, not filling that spiritual hole that eats at your soul. Is all of your Bible study not answering the questions that keeps eating at you? Then reading the story of Peter Gillquist and his friends' search for a true relationship with God may be the first step on setting your mind at ease.Fr. Gillquist was part of the Christian movement on college campuses during the 1960s and 70s. He and his friends were trying to offer to those of that generation a Christian alternative to free love, drugs, and sex. In their outreach to the youth they met on college campuses came very tough questions that despite all of their religious zeal were not being answered by Evangelical Protestanism.As Fr. Gillquist and his friends searched for the truth, they found the truth lay not in the Western Church, the Church of Rome, Calvin, Luther, or Crammer. Their search for truth took them back to the Early Church, when there was no difference from East & West. As Fr. Gillquist and company found answers to very tough questions that tore at their souls, they realized that their core beliefs were those of Eastern Orthodoxy, the Church that has remained unchanged for a thousand years.The story of Fr. Gillquist goes from the discovery of true Christian faith to the founding of a church based on Orthodoxy to final acceptance in the Eastern Church.If you are searching for something that is lacking in your current Christian life and have wondered what Orthodoxy is all about, then read the journey of Fr. Gillquist, it may well start you on your own journey where you re-connect with God.While it may be a well worn saying, this is a must read for those who wish to have an understanding of Orthodoxy",
                "review/helpfulness": "16/18",
                "num_reviews": 18
            },
            {
                "review/text": "As I am young and exploring my Christian faith, I am always looking for the truth about God and Christianity...Up until the past three months, I never even knew that the Orthodox Church existed. But upon my discovery of this different type of Christianity, I began to wonder if their way was the correct way.Now to the book. One of my friend's parents recommended it to me because they said it would answer many of my questions about the Orthodox Church. The title was very appealing to me, as it was about Evangelicals becoming Orthodox (perfect for my situation). And I began to read...I was dissapointed with what I found. The main division between Orthodox and Evangelicals, that of the Orthodox accepting the tradition, was only addressed for one and a half pages (ch.5). Otherwise, if you already believe in Orthodox Christianity, it's a great book because it explains a lot about what the tradition is (I just wish it did more of why I should listen to what it says!).",
                "review/helpfulness": "12/17",
                "num_reviews": 17
            },
            {
                "review/text": "The quotes are the last words in the book. This 'manifesto' (imho) is not another 'conversion' story but rather the true story of a spiritual journey; a journey embarked by a group of fervent evangelical Protestants (Campus Crusade for Christ leaders) and which lasted over a decade. Peter E. Gillquist (the author) is a brilliant marketeer and presenter of his group's spiritual journey, of their search for the ancient faith and original New Testament Church.The book is devided into three sections:Part I describes the group's pilgrimage through the history of Christendom. This was done by assigning each members an area of research, such as church history pre-reformation and post-reformation, Biblical doctrine, and Christian worship. As Gillquist sumarizes this new journey in the last chapter, \"the change came for us when we stopped trying to judge and reevaulate Church history, and for once invited Church history to judge and evaluate us.\"Part II entitled \"Orthodoxy and the Bible\" is the meat of the book (imho). Here Gillquist does an excellent job of explaining (and not overpowering or over-analyzing) the most mis-understood and puzzling components of the Orthodox faith and praxis. These topics include:a) explaining the use of all 5 senses in Orthodox worship,b) the reasons for having a Christian historical tradition (\"Traditon is there not just to preserve the Bible, but also to interpret it.\"),c) using the title \"Father\" (Fr.),d) why should we honor Mary (aka Theotokos - God-bearer),e) and why does a Christian cross oneself?Part III is a narative highlighting the lows and highs of a decade of pilgrimage before the Evangelical Orthodox Church (EOC - the name of over 2000 Protestants, 17 dioces who were becoming Orthodox) had been accepted and included into the Antiochian Orthodox Church.As my title suggestions, this books is a great marketing tool for anyone interested in the Orthodox Church and Faith. One should not expect doctoral answers to difficult questions from this 191 page book (although a lot of Biblical verses are quoted and used for explanation). Personally I found the writing style very easy to read (the larger font and spacing definitely helped), coherent and logical, and even entertainining in some spots. I wish Gillquist would have written more about the ones who dropped out early on from the church history research, or the priests/bishops in EOC who did not join the Antiochian Orthodox Church. As a liturgical Protestant I certainly do not agree with the statement that \"to forsake the Church, you must also forsake the faith\" (pg.143) and I wish Gillquist would have spent more time talking about ecclesiology and its view and development throughout the history of Christendom.Nevertheless, I found the tone, style, and content of this book to be non-polemical, Christian, and informative. I would recommend it for any Christian (Protestant, Catholic, Orthodox) interested in why a large group (over 2000) of hard-core evangelical Campus-Crusade-for-Christ Christian activists became and joined the Eastern Orthodox Church. This book is also beneficial to any non-Christian intersted in the One, Holy, Catholic, and Apostolic Church.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            },
            {
                "review/text": "This is the story of how a group of 2,000 Evangelicals end up converting to the Eastern Orthodox church, and it's written through the eyes of one of their leaders, former Campus Crusade for Christ leader Peter Gilquist.STRENGTHS:1. It's a narrative, and it's an easy read. For folks who don't want a lot of in-depth arguments, history, etc., this book will be a fair introduction to Eastern Orthodoxy.2. It's enthusiastic, personal, and engaging. Gilquist has the convert's zeal as he writes, and it's quite infectious. He's obviously been deeply affected by his journey, and his enthusiasm makes this book a page-turner.3. He shows how he and his peers handled typical Protestant stumbling blocks to Orthodox faith & worship (Mary, Saints, Icons, Liturgy, Tradition, etc.).4. He writes about Eastern Orthodoxy using religious language the way Protestants do. (In otherwords, he's comfortable talking about \"being born again,\" etc.) So, for a Protestant inquiring into the Orthodox faith, this book will be fairly easy to understand and pose no cultural or language barriers.5. When he and his peers reach a point where they must decide between Roman Catholicism and Eastern Orthodoxy, the reasoning they use isn't just knee-jerk, anti-Catholic polemics.WEAKNESSES:1. While he does show how he and his colleagues reasoned their way into Orthodoxy, he hasn't set out to write air-tight cases for Orthodox beliefs and practices. He's simply trying to show Protestants that Orthodox beliefs are reasonable. So, those looking for more serious and complete argumentation will need to turn elsewhere.2. He began his journey as a disillusioned Protestant. If you're a Protestant who's perfectly content with where you're at on your spiritual journey, you may not identify with him or the critiques of Protestantism which led he and his colleagues to begin their journey/search.3. He writes about Eastern Orthodoxy using religious language the way Protestants do. I know I said this was a strength, but it's also (IMO) the book's greatest weakness. For someone who is Eastern Orthodox, the spirit of this book may seem quite Western in its approach to Orthodoxy. Rather than embracing the Church experientially, mystically, historically, liturgically, and from within the context of saint's lives, etc., Gilquist came to the Church as a judge, letting his own intellectual prowess and reasoning skills cement his convictions that Orthodoxy represents the \"true Church.\"OVERALL:This book is good for what it is meant to do. Enjoy it. Learn a bit more about Orthodoxy because of it. If you're Protestant, don't think he's trying to convert you and feel all defensive. If you're Catholic, don't be upset at how easily he seemed to dismiss Catholic arguments without showing the reader how he came to his conclusions. If you're Orthodox, don't get hung up on how he came to Orthodoxy with a very so-called \"Protestant approach.\" Afterall, he was Protestant at the time, and this is how Protestants do things.",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "Gillquist opens for the reader the often neglected &quot;third door&quot; and introduces us to the Orthodox Church. A fascinating look at how so many evangelicals found the ancient Church of the first christians. This book will be a breath of fresh air for evangelicals who have taken &quot;sola scriptura&quot; to the limit and wondered what's next, and will encourage those who have researched Church history and cannot, in good conscience, accept Papal ecclesiology. At a time when the searching christian is seemingly confronted with the usual Roman/Protestant choices, Gillquist presents us with another option.",
                "review/helpfulness": "12/15",
                "num_reviews": 15
            }
        ]
    },
    {
        "Title": "the apocryphal jesus legends of the early church",
        "description": "This accessible selection of the most important and significant of the remarkable and often bizarre apocryphal stories surrounding the life of Jesus and the Early Church has established a reputation as an invaluable introduction to the genre of Christian apocryphal literature. J. K. Elliott clearly explains the scholarly importance of the genre and introduces each section of texts with reference to biblical texts and later church history. Stories found in this selection include Jesus' birth in a cave, his childhood escapades, his secret sayings, and his descent to the underworld; the torments in Hell; Saint Paul baptizing a lion; the death of Pontius Pilate and Saint Peter being crucified upside down. These all come from early Christian legends which did not get into the Bible, yet have had a profound influence on art, literature, and theology from the second century through the Middle Ages and even modern times. Some of the stories included here, especially those involving the Virgin Mary, have affected matters of doctrine; others have influenced the church's teaching on the after life, whilst from the apocryphal Acts there are some of the best examples of accounts of the lives of Christianity's earliest saints.",
        "authors": "['J. K. Elliott']",
        "infoLink": "https://play.google.com/store/books/details?id=yC_8ciERUz0C&source=gbs_api",
        "review": [
            {
                "review/text": "The Apocryphal Jesus is a wonderful and colourful collection of stories gleaned around the early Church. I found much that I hadn't come across before. If it were only for this it would be worth buying, but it is more. Elliott has done a masterful job in clearly presenting the stories against their contemporary settings. However, after reading the wonderful and revelatory account of &quot;The Autobiography of Jesus of Nazareth and the Missing Years&quot; by Richard G. Patton I now view most 'authenticated' offerings around the man we know as Jesus with a degree of skepticism. Elliott's &quot;Apocryphal Jesus&quot; is a colorful delight but is up against the wonderful and profound offering by Richard G. Patton.",
                "review/helpfulness": "7/10",
                "num_reviews": 10
            },
            {
                "review/text": "While some of the stories do tend to be moderately entertaining, this book consists mainly of nice safe stories that are often simply speculation on (and expansion of) stories found in the canonized New Testament. Even the Gospel of Thomas is reduced down to sayings that can pretty much be found in the Gospels of Matthew, Mark, Luke, and John. The author/editor goes to lengths to avoid anything Gnostic or otherwise &quot;heretical&quot; and always warns the reader if something that comes close to that category will be mentioned. Basically it is just clean and friendly reading for the cautiously rebellious Christian. No worries of burning in hell for reading this one. In fact, you might as well just read the New Testament again.The one slightly redeeming quality, which was likely not intended, is that it allows the reader to see where the roots of much anti-Semitism and persecution of all non-Christian thought has it's origin. More than a few of the stories harp on how evil Jews are or how stupid Pagans are.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the early church the pelican history of the church 1",
        "description": "Examines the beginning of the Christian movement during the first centureis AD, and the explosive force of its expansion throughout the Roman world.",
        "authors": "['Henry Chadwick']",
        "infoLink": "http://books.google.com/books?id=RJi1B_eYi7UC&dq=The+early+Church+(The+Pelican+history+of+the+Church,+1)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "With the recent resurgence of interest in the historic churches, histories of the early Church have attracted a greater audience. While this development is surely welcome, there is a growing tendency to quote (or misquote) the Church Fathers to support one's own theological position. There have also been works of Church history where the sole purpose appears to be &quot;spinning&quot; historical facts in order to validate theological presuppositions. Such polemical volumes are generally aimed at a large audience and so are often written in a popular style. More impartial works are often comprehensive tomes poorly suited to those seeking an introduction to the patristic era.Henry Chadwick's The Early Church goes a long way in solving this problem. Written as part of Penguin's History of the Church series, this excellent work is a great place for those with an interest in early Church history to begin their investigations. Chadwick arranges the sections thematically rather than chronologically - allowing a clearer focus for the reader - and masterfully covers all the major currents in the patristic era without leaving his audience adrift in a sea of minutiae. Beginners to the subject of Church history may find it useful to read the book, digest the information, and then reread it, as they will be better prepared to see how the various theological and political currents interacted in the development of Christian orthodoxy.Those who approach the topic with a theological axe to grind will not find solace in this book. Chadwick is nothing if not an honest historian and both sides in the Protestant/Roman Catholic apologetics wars may feel a bit uncomfortable at times. The centrality of the Eucharistic liturgy as the defining act of Christian worship from the Church's inception, the implementation of the episcopacy as the main defense against heresy, and the long and arduous process of arriving at a canon attack much of the contemporary Protestant ethos. On the other hand, Roman Catholic believers will feel a little uneasy at the scant evidence for anything resembling the modern papacy. Indeed, after reading Chadwick's work, the reader may come to the realization that many battle lines drawn between the two sides would have seemed alien territory to early Christians with an entirely different set of cultural presuppositions.Although there are certainly more comprehensive works, one would be hard pressed to find a better introductory volume on the early Church than this one. For its clarity, thoroughness, and impartiality, The Early Church is the best place to start any study of this period.",
                "review/helpfulness": "267/272",
                "num_reviews": 272
            },
            {
                "review/text": "Chadwick has written an engaging, readable introduction to an era that is difficult to distill. There are many cross-cutting trends (from a chronological point of view) and Chadwick does a nice job of maintaining narrative coherence. If you are interested enough to be looking at this page, you will probably find the book captivating. And the coverage is very good, focusing both on theological developments and socio-political developments surrounding the milieu of the early Christian church. So this stands as a very profitable introduction.One specific drawback is that the &quot;filioque&quot; controversy, whether the Spirit proceeds from the Father alone or from the Father and the Son, is glossed over without the attention it deserves. This is one of the major doctrinal disputes to this day between the Eastern Orthodox and Roman Catholic churches, and was critically important at the time covered in this book (especially since the subtitle claims the book will take you down to the parting of ways between East and West). One general drawback is that the internecine theological squabbles aren't really placed in their proper context with respect to everday church life. They wind up seeming much more important to the laity than they probably really were.Two caveats, not necessarily drawbacks: it's best to know a little something about the Roman empire, like the broad outlines of its history. Chadwick doesn't assume that you are an expert, but this book comes in at just under 300 pages -- an achievement -- and the sacrifice is that the whole historical environment can't be treated in depth. Also, it's important to have some working knowledge, like one gets from living in the West, of the culture of the church. This book may be hard to read (though still not unprofitable) for a Muslim or Buddhist who has never been to a Catholic mass -- some of the context will be missing. But again, Chadwick can't treat everything in 300 pages so it's not so much a fault as something to keep in mind.",
                "review/helpfulness": "89/90",
                "num_reviews": 90
            },
            {
                "review/text": "The Early Church, Editorial Digest:Henry Chadwick's Story of Emergent Christianity is an early contribution to the Oxford History of the Church. This first fairly slim book is one of the best concise introductions to the early church available in a single volume. It is delightful to read and engaging to study. He has produced a masterpiece, covering every aspect of the life of the early church. Professor Chadwick's conclusions are novel, but not tendentious, trying to be unbiased as possible to the historical evidence. The book is perfect for getting an overall view of the early church without going into too much detail, and in this respect his footnotes do not disappoint us.The Early Church, Content:Drawing on recent historical research, Professor Henry Chadwick shows how Christianity had its roots in a synthesis of contemporary ideas and beliefs, and analyses the causes of its persecution under Diocletian, the fanaticism of its martyrs and its bitter internal controversies. The conversion of Constantine and the edict of Theodosius meant that the church had to reconcile its spiritual duties with a new, worldly role as an establishment for better government throughout the empire, and Professor Chadwick completes his history by demonstrating how this conflict of responsibilities led to the emergence of the two pillars of Christianity the monastic movement, and bishoprics.Description in Consensus:Marked by an originality both of scope and narrative, this book is a brilliant introduction, that provides a full and enjoyable narrative history of the first centuries of the Christian Church, an account of the history of the early Church, particularly in the East. Henry Chadwick's examines how Christianity changed the Roman empire Mediterranean society. His brisk exposition of early debates in their historical context is masterful and entertaining. It is a tour de force by a great scholar.Author's Style:Chadwick's easy style conceals the author's great learning and enthusiasm for his subject. This book will remain a standard among the works on the history of early Christianity for the foreseeable future. Professor Chadwick has the gift for being able to pinpoint significant, as well as sometimes unfamiliar aspects of the life of the church.Those readers familiar with Professor Chadwick's works will recognize that each sentence of his writings is based on his scholarship of intensive study of original documents, exhaustive reading of secondary sources in different languages, and long experience in teaching and lecturing. If you begin your study of the ancient church with Professor Chadwick's book you will set off on the right foot that will have laid a good foundation for later detailed study.About the Author:Henry Chadwick, Emeritus Regius Professor of Divinity, Cambridge University. His other books include Early Christian Thought and the Classical Tradition: Studies in Justin, Clement, and Origen, Origen: Contra Celsum, Augustine: A Very Short Introduction, and his last great work The Church in Ancient Society.",
                "review/helpfulness": "43/44",
                "num_reviews": 44
            },
            {
                "review/text": "I found this book incredibly frustrating to read, and found myself wanting to hurl it against the wall many times. There are so many characters, places, and controversies discussed with so brief a mention that I was never able to form any kind of understanding of what the author was trying to convey. There is no introduction or preface to describe what the author is intending to do; he just launches into it without a description of what is to come.The author starts using theological terms and never really defines what they mean. For example, he starts discussing the \"Arian controversy\" but never actually defines Arianism. In the index, Arianism is not mentioned. There is no glossary of terms either. I had to resort to a dictionary to look up many of the terms.Dozens and dozens of characters are introduced without any discussion of who they were, when they lived, or what they believed in, only that they were \"opposed\" by some other individual or group for some unstated reason. Individuals get a brief mention, and then a hundred pages later they are mentioned again, and you the reader are supposed to remember and connect these two disparate passages. An irritating habit of the author is to make some insignificant side-comment about an individual which provides no useful contribution to the reader's understanding of that individual's beliefs or their relation to others.Another problem is that are almost no quotes from the patristic fathers. There is brief discussion of the views of Origen, Tertuillian, and others, but the author's brief description of them left me wondering what they believed in.The author often takes the view that the early church fathers were defending \"orthodoxy\" against the onslaught of heretics. Other authors have taken the opposing view that there was no orthodox belief at the time. Instead there were many competing beliefs, one of which was the \"proto-orthodox\" view which eventually won out and became the orthodox view. When reading the text, one never gains a sense of this latter viewpoint.Like another reviewer mentioned, it is helpful to have some knowledge of ancient Mediterranean history, particularly Roman and Greek. There are no maps in the book, which would have been a significant aid.Overall the book seems to assume that you already familiar with the early church doctrines and church history. I am currently reading J. Kelly's \"Early Christian Doctrines\" which seems to be a bit better organized and goes into more detail than Chadwick's book. I am not really hopeful that one can condense the early history of the church into a book that a mere mortal can hope to read and understand.",
                "review/helpfulness": "27/33",
                "num_reviews": 33
            },
            {
                "review/text": "I found Chadwick's work to be a masterpiece and highly enjoybale. Every area of his scholarship (both from what I know and what others have written concerning his works) is as near perfect as can be. This is a standard work in most seminaries and is a must read for any Christian serious about their Faith.What he explains is neither Roman Catholic or Protestant, he explains the Church like it was and still is in the Orthodox Church which is really shocking for RCs and Protestants that it wasn't either way but rather just how it is, if they know about it, in the Orthodox Church. That there was no Sola Scriptora and that the sacraments and lituragy were an integral part of Christian worship from the time of Christ on is odd for most Protestants of a non-traditional background.For the Roman Catholics it is shocking to find out there was no Filioque or the theology which goes with it and that it was actually condemned by the Church at the city of Rome from the beginning of its introduction. Nor was there anything like the modern day papacy. That in fact, the Pope was just a bishop among bishops, all he could do was rule over the city of Rome just as any other bishop and could give a judgement to two bishops if they both decided to appeal to him to solve a minor problem of jurisdiction (a primus interpares), there was no Papal infallibility, cardinals, madatory celibacy for the priesthood, purgatory, etc. and how the &quot;Rock&quot; Christ says he will build His Church on, when read in Greek, is not refering to Peter, but is refering to his proclamation which all Church Fathers, even Augustine agreed on.As a convert to Orthodox Christianity I was not at all surprised to read what I read, even though it's from an Anglican who still manages to surport Orthodoxy simply through telling it how it is.I highly recommend it, short read, full of important and integral history to Christianity, a must read.",
                "review/helpfulness": "19/29",
                "num_reviews": 29
            },
            {
                "review/text": "Chadwick provides his readers with a thorough historical account of the early Christian church. He begins with the Jewish context into which the church was born, tells how the church grew and developed in the ensuing centuries, and takes the reader all the way to the Germanic invasions and their aftermath. The book is written in Chadwick's usual scholarly style, and has gained a wide reputation as an excellent source for the student or the layman who wishes to find out more about the early church.His unromantic approach is one of Chadwick's strongest points, and is quite clear from the way he deals with, for instance, the conversion of Constantine and the Council of Nicaea in chapter 8. Constantine's conversion is not portrayed as spectacular and immediate as we find in certain history books. Rather, we see a military strategist who initially did not quite know the difference between Christianity and the 'Unconquered Sun', the deity to whom the Roman senate attributed Constantine's legendary victory over the troops of Maxentius at the Milvian bridge in 312, but one who nevertheless gravitated from solar monotheism to Christianity.In my view Chadwick has done the church an immense favour by writing this book. The book has been reprinted many times, and it is widely used and referred to as a reliable source on the early church. The book does not read quite as easy as some modern works on church history, and this might be due to the fact that it was written in 1967, before the concept of 'user-friendliness' were popularised. The paragraphs are sometimes long (a single paragraph would often be longer than an entire page), and one wonders if the time has not perhaps arrived for a newer and easier to read version, edited to compensate for the collective attention deficiency disorder of the culture we live in. By doing so the book might be accessible to a much wider audience.",
                "review/helpfulness": "27/28",
                "num_reviews": 28
            },
            {
                "review/text": "\"Eusebius of Caesarea was tempted to see evidence of the power of Christianity in its social or worldly triumphs, expressed in ... or in the adherence of distinguished intellectuals like Origen. Towards such triumphalist assumptions a 20th-century Christian is likely to be cool and reserved.\" H. ChadwickTopical Approach:The book contents reflect the eminent patristic scholar and early Church historian approach to history implied in his book does evoke ecumenical impartiality and underlines that the early Church was most active in its eastern informed centers in Alexandria and Antioch. He advances his case, in first book quarter, from its Jewish background emerging from the Apostolic age to the foundation of the Roman Papacy. On his engaging account, the genuine historian advances from the earliest Church to the Gentile assembly (Ecclesia), and its encounter with the Roman Empire. He then explores the bonds of unity, and Gnostic diversity, elaborating on the Bible and forms of Ministry subjecting faith to order. The geographical expansion of the church is linked to early defense of faith as a cause of growth and success.Church Fathers:In the next three chapters the reader enjoys Chadwick's masterful expertise in patrology, encountering through Justin Martyr, Irenaeus, Tertullian, Clement of Alexandria, and Origen, early controversies. He then ably interprets Third Century society, Pagan revival, persecutions and their consequences. Constantine and the first Council of Nicaea, are discussed within the serious Arian controversy and the conflict of Paganisam with Christianity, covering the Fourth Century and Church State and society in the first half of his essay.Monasticism to Papacy:In 'The ascetic movement' the author attempts to find reasons for the attitude of detachment by monastics after the virtual capture of society by the Church, and the rise to eminence of the Bishops in the Fourth century. He follows that with Chrysostom's tragedy, a consequence to the controversy about Origenism, and his advocates against aging Epiphanius fundamentalism. Meet with Diodore, Theodore, and Appolinaris to the Christological controversy between Alexandria and Antioch represented by Cyril and Nestorius, and its aftermath. The author then develops Latin Christianity, started by Augustine. He ends his study with theological issues, The Trinity, the Donatist schism, and Pelagian controversy. At the end he gives a fascinating condensed review of Worship in liturgy, daily office, and Church music. He gives a glimpse of Christian Art, with a brief account on icons and their veneration in the Byzantine Church.Historic Conclusion:Chadwick concise conclusion summarizes his findings on the apostolic church continuity with Israel, authority in second-century church, evolution of Christian doctrine in opposition to heretical thought, Christian penetration among the educated and elite, Christianity as religion of the empire, and ascetics withdrawal. He concludes with the rise of papacy by Gregory the great, and separation from Greek speaking churches.Chadwick's Integrity:This is what makes Chadwick's approach analytically reflective and more sound in his deductive interpretation than the famous first early Church Historian. Most of the reviews evaluated this comprehensive 'History of the Early Church' in general terms, or compared it with other available works, based on reconstruction of ecclesiastic events, and controversies. Without a concise 'Search Inside this Book,' prospective readers could not relate most reviewers evaluation with the book thematic treatment, author's methodology, or style.",
                "review/helpfulness": "22/24",
                "num_reviews": 24
            },
            {
                "review/text": "Mr. Chadwick has produced an excellant book that contains information all Christians should know well. I did find the text some what difficult to follow. Complex sentences, many subordinate clauses, a pelthora of names, these and similar traits, will probably disuade the casual reader. A great reference for Teachers, bible students, and those with a serious interest in Church history.",
                "review/helpfulness": "14/23",
                "num_reviews": 23
            },
            {
                "review/text": "In very few pages, the author manages to give an excellent recap of the key events and forces which shaped church history in the first 6 centuries. He goes into enough detail, howwever, that I'll bet even avid readers of church history will still find here material previously unknown to them. His organizing the material according to topics rather than by a strict chronological order makes it particularily easy to understand how the church grappled with its' earliest issues and crises. He does not seem to hold any partisan view: he even seems to regret that Arianism did not take hold in the mainstream church!This book can be recommended for readers at any level who wish to learn about church history.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "The Early Church, by Henry Chadwick is a good place to start if you are interested in early church history. He does an excellant job describing the issues that were affecting the development of the church from the apostolic age to around 500 a.d.I do have mixed feelings about this book. You will find information that you probably have not seen elsewhere if you haven't read a book about church history. You will be introduced to Augustine, Cyril of Jerusalem, Hippolytus, and others that you may not even have heard about. The issues concerning the Council of Nicaea are discussed at length. You will see that the acceptance of the four gospels as canonical, no more, no less, was made very early in the history of the church.On the other hand, I did find myself really wanting a glossary or something similar many times when I was reading the book. I'm still not sure, for example, exactly what a Monophysite is. I also have to admit that there were a few stretches in the book where I was just finishing a section just to finish it. Maybe it's the fault of the author, maybe church history is by nature not that interesting. Another way to say it is that some of the issues that arose in the church were detailed and legalistic, which is probably hard to write about in an engaging way.All in all, this is a solid book. As a source of information, it is 4 star book. Based on style and readability, it's more of a 3 star book. Once you've read it, you will at least know what areas of church history you want to know more about, and you can read further on those subjects. Though I doubt this will ever be a best seller, it is a good place to start your study of church history.",
                "review/helpfulness": "19/20",
                "num_reviews": 20
            }
        ]
    },
    {
        "Title": "facing east a pilgrims journey into the mysteries of orthodoxy",
        "description": "The Classic Story of a Family's Pilgrimage into the Orthodox Church Veiled in the smoke of incense, the Eastern Orthodox Church has long been an enigma to the Western world. Yet, as Frederica Mathewes-Green discovered, it is a vital, living faith, rich in ritual beauty and steadfast in integrity. Utilizing the framework of the Orthodox calendar, Mathewes-Green chronicles a year in the life of her small Orthodox mission church, eloquently illustrating the joys and blessings an ancient faith can bring to the worshipers of today.",
        "authors": "['Frederica Mathewes-Green']",
        "infoLink": "https://play.google.com/store/books/details?id=ytGLCgAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book was a big disappointment to me, perhaps most of all because these new converts were simply cast adrift by their bishop with no training or experience. As a result, they were hunting their way into Orthodoxy, with an awful lot of false steps. For that reason, the picture it paints is not very true to the life of most Orthodox parishes, and some events are even very inappropriate. In some ways it was more a running commentary on what the author was thinking, rather than what Orthodox people were doing. I kept wanting to know more about this ancient Faith and less about the often irrelevant thoughts going through the mind of the author in the midst of what should have been holy moments. Orthodoxy is sober and relaxed at the same time, but this book failed completely to convey the sobriety. Don't read this if you want to find out about Orthodoxy.",
                "review/helpfulness": "14/20",
                "num_reviews": 20
            },
            {
                "review/text": "It all began when my roommate started dating an Orthodox guy. I was intrigued. I had never heard much about the Orthodox church, never thought much about the Orthodox Church. However, since that time I have visited their church a few times, including once during Pascha (Orthodox Easter). I was still intrigued, but I had a lot of questions, and nobody to answer them. &quot;Facing East&quot; helped. It didn't answer all of my questions, but it gave me a place to start. I'm not going to tell you that I'm going to convert to Orthodoxy because of this book. I don't know yet what I'm supposed to do about the Orthodox church. However, for those who are looking for something that will give you more of an idea of what being Orthodox is all about without having to struggle through heavy theological texts, this book may be just what you're looking for. It's light enough to keep one's interest, yet serious enough to answer some major questions. I highly recommend this book.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "I am a 'Cradle Orthodox' (as opposed to a convert) and I had a hard time reading this book. When you are born and raised Orthodox you have a kind of second nature relationship with the Church and how one is to behave (for lack of a better word). I found that I had a hard time with the levity that was throughout this book. Now, in saying that, I have to admit that I will be the first one to take part in a good prank or joke, but there are some things that are just not in good taste.While her style of writing is amusing and easy to read, it was disturbing because I felt that so much of the humor was at the expense of my Church and those of us whose anscesors were also Orthodox. I didn't \"get\" a lot of the book because I am Cradle Orthodox. I don't think of my faith as a \"man's religion\" because, quite honestly, most of the parishioners in the churches I've been too (both in the US and in Russia/Ukraine) were women. And \"wear comfortable shoes\"? yeah, we hear that a lot...I guess that even though it was easy to read and humorous, I still felt offended in the end.",
                "review/helpfulness": "8/13",
                "num_reviews": 13
            },
            {
                "review/text": "In 1992 the husband of Frederica Mathewes-Green decided to leave the Episcopal Church for the fullness of Orthodoxy, a move which she approached with nervousness but ultimately embraced. Mrs Mathewes-Green has since become one of the foremost writers on Orthodoxy in America. FACING EAST introduces Orthodoxy by following the activities of her small parish Holy Cross Orthodox Mission in Maryland.I enjoy the small pieces that often appear from Mrs Mathewes-Green, but I find that her style becomes rather exhausting at greater length. In writing a work of this size she often can't resist the temptation to go off on tangents. While some are quite fascinating, such as her thoughts on the artist Rev. Howard Finster, most are dramatic expositions of the lives of her parishioners and children. The book certainly doesn't stand up to academic presentations of Orthodoxy, such as Kallistos Ware's classic THE ORTHODOX CHURCH or even Fr Peter Guilquist's BECOMING ORTHODOX, as rigorous theological arguments are missing. People wishing to know more about Orthodoxy as a system of belief are advised to look elsewhere.Rather than being a presentation of theology, this work is useful for learning more about the cultural expressions of the Orthodox faith. The various rituals and fasts of the liturgical year are show in greater detail than in most works. As a parishioner in the OCA I found the descriptions of customs of other juridictions to be interesting. And as a member of a relatively established parish with its own church building and parish house, the book helped me understand the challenges which missionary parishes face.If you are curious about the Orthodox Church and have not read any materials about it previously, I would recommend Ware's THE ORTHODOX CHURCH. The work of Mrs Mathewes-Green, though I wouldn't describe it as essential reading, may make a nice light piece to read as you discover ever more about the Church.",
                "review/helpfulness": "8/12",
                "num_reviews": 12
            },
            {
                "review/text": "At last a mass market read for what was a hidden faith. This book truly captures the mysticism, beauty and depth of the oldest of Christian Faiths. It only strenghthened my already devout calling, and shows how the burgeoning conversion of disenchanted Catholics and Protesdants will slowly and quietly reshape American Christianity, while at the same time remaining steadfast to it's unchanged, timeless doctrines.In an Era of TV preachers selling a packaged Jesus like toohepaste or any other product, dying churches due to compromising principles in the name staying &quot;current&quot;, and the loss of depth, aestheticism, mystery and soul in an increasing selfish, commercial, &quot;I want it now&quot; world, this book is a must read.It will take you back to how Christianity was once practiced, and at the same time show you it is still alive and well.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "I found this book to be an great joy to read. As I have just begun my search into the Orthodox faith I found Frederica M-G's account of her parish's year wonderfully lyrical. I did not find her attitude synicial or disrespectful. On the contrary - I found it to be an honest account of someone who was not a &quot;cradle&quot; orthodox trying to understand this ancient faith.",
                "review/helpfulness": "8/11",
                "num_reviews": 11
            },
            {
                "review/text": "Beautifully done! Mathewes-Green writes with great love for the Orthodox religion as well as with humor and grace. The reader comes to care deeply about the author and the parishioners of whom she tells.Anyone who is dissatisfied with contemporary Christianity in America should be required to read this book. In its pages they can discover where REAL Christianity has been hiding, and they can find out why Protestantism and Catholicism are not the fullest expressions of the faith.",
                "review/helpfulness": "5/8",
                "num_reviews": 8
            },
            {
                "review/text": "I thought this was a great and easy to read book. I am a catholic but have family in the orthodox church and have always been interested in becoming orthodox. I am now wanting to convert into the orthodox church. This book has given me great insight into the religion. The book is easy to read and humorous. I found myself not being able to put the book down. I really recomend this book for anyone who is looking for a more traditional and fulfilling form of christianity",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "This was one of the first books I read on Orthodoxy, that was &quot;free reading&quot; (not historical or recommended for religious education purposes) I related to her accounts of entering the church. While the author spends more time at the church than the average convert does, her journey to Orthodoxy was warm and enlightening. I find her to be an inspirational mother and member of the church. I found myself learning more about Orthodox society and culture rather than theology. This was a nice change. I recommend this book to everyone who wants a peak into the Orthodox world.",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            },
            {
                "review/text": "This book is beautifully written and gives you a front row seat in the early life of an Orthodox mission parish! Mrs. Matthewes-Green takes time to explain all the nuances of Orthodox worship that mystify former Protestants and Roman Catholics alike. It is like getting letters from a friend!",
                "review/helpfulness": "5/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the tare in the wheat",
        "description": "Although most Catholic priests are devout men who have sincerely committed their lives to Christ and His Church, they are also human beings with faults and failings. Some are cranky and stern, and others can be weak or indifferent. Some grapple with alcohol or sensuality, and others are controlled by money. In our day, thousands of priests have been exposed for committing the gravest of sins: abusing those who have been entrusted to their care. In these searingly honest and insightful pages, EWTN host and author Fr. Mitch Pacwa, S.J., brings consolation to all those who have been abused, wounded, or scandalized by the wickedness of priests and bishops. He takes you on a reassuring exploration of the Gospels to show how Christ anticipated the sins of the clergy and the hierarchy-and gives us examples of how to deal with them spiritually emotionally, rationally, and practically. Fr. Mitch reinforces what Christ's parables teach us: that good and evil will co-exist in the Church, and that spiritual blindness will affect the moral life of the clergy and the lay faithful alike. The solution, he says, lies in the power of Jesus' Death and Resurrection and the Apostles' response to the Risen Lord: authentic conversion to faith in Jesus, which reorients our lives toward selfless service of others.",
        "authors": "['Fr. Mitch Pacwa, SJ']",
        "infoLink": "https://play.google.com/store/books/details?id=AQf2DwAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "This book is a great book for family reading. The characters quickly come to life and have you caring about their life struggles. From beginning to end, the book captures your imagination. Its simple presentation of faith through life's up and downs is both inspiring and challenging.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "Thoroughly enjoyed every chapter in this book. I was so interested in the way each individual just became a friend and not with fussy details, but interesting down-to-earth character traits that I could relate to. I felt like these folks were people I knew. I was disappointed when the book ended. I wanted to read more. Definitely needs a sequel to especially get Greta's husband with a new and improved attitude!! I still feel like I should send a Thinking of You card to Greta and perhaps even take a meal over. Excellent reading!",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "An excellently written book. I couldn't put it down and was disappointed when it had to end. It is difficult to find entertaining/uplifting Christian fiction which is neither &quot;preachy&quot; or &quot;saccharin&quot;. As the story of the life of a church and it's administration unfolds, the stories of several families in the church are also told, and we are reminded that we must be mindful of the &quot;tares among the wheat,&quot; not only corporately, but also in our individual lives. I hope that we will see more books written by Mrs. Wentworth.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "I became totally engrossed in just the first few pages. The characters seemed so true-to-life that I felt I knew them all.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            },
            {
                "review/text": "Wonderfully refreshing,well written fiction without the typical mushy and shallow romance. The many examples of Godly character in the midst of severe trials was encouraging for my own daily walk. This was a great book for my young teenage children reinforcing positive values of faithfullness, friendship, generosity, perseverance among others. We look forward to a sequel",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "you are peter an orthodox reflection on the exercise of papal primacy",
        "description": "This is Clement's response to John Paul II desire for common reflection.",
        "authors": "['Olivier Clément']",
        "infoLink": "https://play.google.com/store/books/details?id=iLz7otL3bnUC&source=gbs_api",
        "review": [
            {
                "review/text": "Oliver Clement, the author of \"The Roots of Christian Mysticism\" has produced a small, yet fine work on the place of the papacy in reconciling the Christian division between Catholics, Orthodox, and to a lesser extent, Protestants.The first half of the book is more of a foundation with a quick lesson in history, mostly from an Orthodox perspective; however, the facts in these instances are undeniable by even unbiased historians. He writes about the different Popes, councils, and the relationship between the Western and Eastern states. He does not deny a papal primacy, but shows what that primacy meant in the early church.He then proceeds to inform the reader of the Gregorian era and its devastating effects on Christian untiy. The reformation is also mentioned and so is the first and second Vatican Councils. He shows that since the second council, there are encouraging signs toward reconciliation and that the papacy does play a role in this process.He ends with advice both to the Catholic Church and to the Orthodox Church. He shows the potential pitfalls and upsides in the issue at hand. This is a nice small book, written for the laymen, clergy, and scholar alike.",
                "review/helpfulness": "21/23",
                "num_reviews": 23
            },
            {
                "review/text": "One of France's leading Eastern Orthodox theologians, Cl&eacute;ment is no stranger to ecumenical dialogue. Like Bishop Kallistos Ware, his charitable style, combined with a personal humility, makes him one of the more likeable characters on the ecumenical scene in Western Europe.This work, aimed at bringing mutual understanding between the Orthodox and Romans, is something of a brief refresher on the subject, aiming to help all parties involved to move forward from confessional foxholes to a more realistic, historical and viable doctrine pf papal authority. Affirming the validity of papal authority in the ancient tradition, he avoids the common pitfall of turning Rome into just another bishopric that happened to be a capitol city. In his view, the Papacy did and should continue to play a role of authority on doctrinal matters as the locus of authority and union. At the same time, how that authority should be exercised must change to recognize the autonomy of local jurisdictions. It cannot be an authority of force. He calls for the papacy to reexamine its relatively recent teaching on universal and immediate jurisdiction, something that he believes neither theology nor history supports. At the same time, he argues that Orthodox need to chill out a bit on their own Romaphobia and accept the legitimate, properly exercised, role of the papacy.Other books of interest may include:The Primacy of Peter: Essays in Ecclesiology and the Early Church,Power and the Papacy: The People and Politics Behind the Doctrine of Infallibility,Being As Communion: Studies in Personhood and the Church (Contemporary Greek Theologians Series , No 4),Eucharist, Bishop, Church: The Unity of the Church in the Divine Eucharist and the Bishop During the First Three CenturiesandAfter Nine Hundred Years: The Background of the Schism Between the Eastern and Western Churches",
                "review/helpfulness": "14/15",
                "num_reviews": 15
            },
            {
                "review/text": "In this book, Oliver Clement shows how Catholic and Orthodox views regarding the papacy can be reconciled so that communion may be restored. Quotations from various Church Fathers of the first millenium regarding the papacy are often used by polemicists on both sides to argue that their opponents have deviated from the Apostolic faith. He shows how this seemingly conflicting patristic evidence can be reconciled by showing how the _behavior_ of the united first millenium church contextualizes and explains what the various Church Fathers were trying to say.As a Roman Catholic, I greatly appreciated how Clement shows a possible way in which the concept of infallible papal definitions can be understood and expressed so that it could also be acceptable to the Orthodox. Overall, the outline of a reunion proposal in Chapter 12 seems both reasonable and realistic (at least theologically).The historical content of the book is concise and informative. He shows the divergence between the Catholic and Orthodox positions on papal primacy to be a gradual process, even during the contentious second millenium. His description (in Chapter 9) of how \"a certain amnesia in the Orthodox tradition\" about the primacy of the Bishop of Rome developed was especially interesting. His line of argument that Popes Paul VI and John Paul II have done much of what Orthodox Christians of the early second millenium demanded of the papacy commands much reflection.It will be interesting to see if the corresponding hierarchies of the Catholic and Orthodox churches will ever be able to follow through on Clement's proposals. In any event, I highly recommend this book to all Catholic and Orthodox Christians who are interested in this topic. If more and more well-informed believers in both communions come to see reunion as desirable and possible, pray for reunion, and make this known to their priests and bishops, then the Holy Spirit may well work a miracle for us.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "living the good life what every catholic needs to know about moral issues",
        "description": "This introduction to the Church's moral teaching for the everyday Catholic explains the overall landscape of theology, and then, using a Q&A and dialog format, it tackles many specific problems that Catholics face today.",
        "authors": "['Mark D. Lowery']",
        "infoLink": "http://books.google.com/books?id=Bx4OAAAACAAJ&dq=Living+the+Good+Life:+What+Every+Catholic+Needs+to+Know+about+Moral+Issues&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Dr. Lowery has done what few Catholic authors in his field have done. He has provided his readers with an accessible, understandable and readable introduction to the Church's moral life. It is apparent that he has a great grasp on the Church's moral theology, but what makes his book excellent is that he is able to take reasonably difficult moral principles and teach them in a way that every Catholic can understand and digest them.Peppered with many examples and diagrams the book is short, but full of nuggets of information that help the reader understand difficult concepts. He widely uses the Church's authoritative documents, none more than the Pope's encyclical, Veritatis Splendor.Lowery also takes on erroneous theories in moral theology, but without falling into the trap of ad hominem. His criticisms are kind and yet firm, which is a reflection of the quality seen throughout the bookThis is a valuable book that can clear up many misunderstandings of what the Church teaches and why in regards to morality.",
                "review/helpfulness": "10/10",
                "num_reviews": 10
            },
            {
                "review/text": "Dr. Lowery was my professor for three courses during my studies at the U. Dallas. The courses were Christian Anthropology, Moral Theology, and Cahtolic Social Thought. We learned an immense amount of information because Dr. Lowery was brilliant in his ability to articulate the information. He is very orthodox and all of his teaching was right in line with the Magesterium. This book is an excellent compilation of those courses. He breaks down the material from Veritatis Splendo (The Splendor of the Truth) and other sources and explains them at a high school/undergraduate college level. I highly recommend this book to anyone wanting to understand the Church's teaching on morality or for teachers looking for a text book that has substance and an appropriate reading level without being dummed down the way most high school religion texts are.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "This book is recommended by Janet Smith, but only costs about $10 from Servant Publications at the time of this review for some reason it's listed at over 200.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "the complete guide to christian denominations understanding the history beliefs and differences",
        "description": "In this concise but comprehensive guide to most of the church families in America, you'll find a brief explanation of how each denomination began; a short summary of its teaching on God, the Bible, the church, and other important topics; and a quick overview of some of its distinctive characteristics.",
        "authors": "['Ron Rhodes']",
        "infoLink": "http://books.google.nl/books?id=ovOUBQAAQBAJ&dq=The+Complete+Guide+to+Christian+Denominations:+Understanding+the+History,+Beliefs,+and+Differences&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "I was really looking forward to this book. A book that discusses the aspects of each of the congregations in the US or world is a great reference tool in understanding what others believe. Is this book the one to choose for that purpose? First, I will discuss its contents, pros and cons before giving my final opinion.Rhodes' book begins with a very short history of the church (4 pages). He then defines 'denomination,' 'protestant' and gives a description of how to use the book.The books covers the following churches:AdventistsBaptistsBrethrenCatholicChristianCongregationalEpiscopalian and AnglicanFriends (Quaker)Fundamentalist and BibleHolinessLutheranMennoniteMethodistOrthodoxPentecostalPresbyterianReformedWith each congregation, Rhodes begins with a date of origin for the church, census of members and number of congregations. He then describes their beliefs and gives a chart of fast facts for the church. There are several added \"fast fact\" charts that detail theologies such as Calvinist and Arminian. Each congregation gets 1 1/2 to 2 1/2 pages (except the Roman Catholic Church where 10 pages are written.) Some congregations have a robust history leading into discussion of the divisions within, such as the Orthodox church.Pros:--A large swath of churches is covered.--A good index aids in finding churches. For instance, I wanted to find out what the Nazarene church was like, and the index pointed me to the Holiness section, which I was not aware they were part of.--There is an index of persons that helps in determining which authors are from which church.--Rhodes speaks from an unbiased viewpoint. One could not tell he is conservative dispensational Protestant from this writing.Cons:--Rhodes left out a couple of churches I have wanted to learn about in my town, namely Unitarian. Granted, many do not consider the Unitarian church to be strictly Christian, but it is a prominent congregation that would be helpful to have in the book.--The book is VERY vague about church beliefs. Many of the churches described deny the inerrancy of Scripture, but that can not be determined by the wording used, as the writing makes little distinction between those that call the Scriptures inerrant and those that do not. One must read between the lines or have some knowledge of the church to discern Rhodes' writing. Views of Scripture is only one of the vagueries, but is the most prominent.--The book does NOT discuss the issues that set the churches apart. Worship is spoken about, again, in vague terms. Is Christ present in the Eucharist of the Lutheran churches? One cannot tell from this book. (Some Lutheran churches do teach this and some don't.) Which churches put high focus on speaking in tongues? One cannot tell from this book.My greatest critique is vagueness. Granted, Rhodes could not have been very specific without relying on some theological bias. But, more specifics could be told. From this book, it is very hard to tell why there are divisions. What divides the American Baptists from the Southern Baptists? Episcopalian from Anglican? Greek Orthodox from Orthodox Church in America? Volumes could be written, but little of it could be found out in this writing.Is this book the one to choose for the purpose of understanding other congregations? I have to give a resounding no. The breadth of this book is a blessing and a curse. He doesn't leave many out, but the book would have to be much longer to give any insight into the differences between the congregations discussed.",
                "review/helpfulness": "107/112",
                "num_reviews": 112
            },
            {
                "review/text": "This was a great book on denominations in the Christian world.It gives you a short history on the church. The book also gives you the break down on the things each church does. The polity of the churches are mention, baptism modes, if the church practices foot washing etc. There views on doctrines like church goverment, Trinity, eschatology, etc. There are also \"Fast Facts\" on secondary issues like Freewill, rapture, infant salvation, etc. This book was perfect in what Dr. Rhodes set out to do. Also he mentions were the myth of Bloody Mary comes from.Great book.Dr. Rhodes only mention Christian Churches, no cults like mormons or Jehovah Witness.",
                "review/helpfulness": "48/60",
                "num_reviews": 60
            },
            {
                "review/text": "Being a retired Congregational (UCC) minister the first thing I took a look at, in a Christian bookstore, was Rhodes' account of the people later to be known as the Pilgrims who traveled to these shore on the Mayflower. I was very surprised to read that they were led here by their pastor, John Robinson. In fact, John Robinson stayed behind in Leiden, Holland and died there in 1625. His wife who succeeded him once made plans to travel to America but for reasons unknown canceled them. As the assembly which had met at the \"green gate\" dwindled, she later joined the Dutch Church.John Robinson is rememberd for having said, \"God hath yet more truth to bring forth from His holy word.\"Unfortunately, Rhodes doesn't seem as scholarly as others who have written about denominations, such as Mead, Hill and Atwood in the Handbook of Denominations, which is what I reccommend.",
                "review/helpfulness": "45/52",
                "num_reviews": 52
            },
            {
                "review/text": "Ron Rhodes does not seem to possess the scholarship and background knowledge needed to produce an accurate guide to the Christian denominations in North America. His accounts of Roman Catholicism and Eastern Orthodoxy are especially poor. A frankly embarrassing level of ignorance leads Rhodes to make numerous historical, theological, and terminological errors of fact. One despairs of an author of a \"complete guide\" who can write concerning the First Vatican Council (1869/70):\"More than 800 Roman Catholic priests (sic) from around the world attended.\" Forty years ago a Jesuit priest, the late Father John Hardon, S.J., published \"The Protestant Churches of America\", a work of such impartial, objective, and deep scholarship that it was set as a textbook in many Protestant seminaries. So the task is not impossible!",
                "review/helpfulness": "26/31",
                "num_reviews": 31
            },
            {
                "review/text": "As a student of Church History and Denominations, and as an author and teacher on the same subject, I honestly have to say the \"Complete Guide to Christian Denominatins...\" is NOT anywhere near being a complete \"guide\". In review of this book, and three others on the same topic (which includes my own yet to be published book) - Rhodes book has the least amount of information (only 105 denominations, compared to 179 in the National Council of Churches book, 193 in The Handbook of Denominations (Frank Mead/Samuel Hill) and 227 on my book (Guide to Denominations - Robert Stearns).Further - many of the denominations are mis-identified as to the family they belong to, and the Churches of God (Reformation Theology group of churches) totally omitted. Very limited in statistics. The interesting feature, however, was the lay out and the quick reference \"bullets\".Robert H Stearns, Reviewer",
                "review/helpfulness": "23/29",
                "num_reviews": 29
            },
            {
                "review/text": "Good information but maybe too much splitting in the denominations - must have been 40 splits under Baptist....j/k.If he was going to be this detailed, maybe he could have summarized the similarities within, say the Baptists, and given just the differences within.Still, lots of good unbiased details.",
                "review/helpfulness": "11/15",
                "num_reviews": 15
            },
            {
                "review/text": "i skipped many parts of this because every single subdivision of each denomination seemed winded. the main outline's very good and worthwhile.",
                "review/helpfulness": "10/15",
                "num_reviews": 15
            },
            {
                "review/text": "I found this book to be interesting in many parts, but fairly redundant and often too vague to be as helpful as it could be.The church history is interesting, and it is valuable to realize where all of the Christian denominations fit in the family tree. I also felt it is structured as a nice reference, so one could easily find a specific denomination.However, after a while, all of the theology started to seem to be the same--rather than highlighting the differences, he regurgitates the statements of each denomination in slightly different words for each one. Rather than reiterating the slightly different verbiage for each denomination regarding each major point, it woudl have been helpful to have a basic template with such things as inerrancy of scripture, belief in the Trinity, belief in the human and divine natures of Christ etc--and then have Yes/No or comments on how a specific denomination differs in one particular area. A chart comparing denominations would have been helpfu.I also found it frustrating that not much was said about worship style or structure of church services. While the cover of the book talks about it being handy for someone looking for a new church (or something like that), some things like liturgical worship style (yes/no, or shades of grey) or style of prayer (formal, thees and thous--or informal, \"we just\"...), or type of music (traditional hymns, organ music vs contemporary worship). Only a few churches who were considered very unique--ie, all singing a capella--were described in detail.I did find the \"fast facts\" interesting, although not always handily placed--definitions of 'millenial' beliefs were way after the first mention. And the comparision between Armenian and Calvinistic beliefs was interesting, but left out other perspectives which are neither of the 2.All in all, this is a decent book, a decent place to start learning about different denominations. I do wish it had more meat to it, and less redundency; more structure and focus on comparison/contrast and less regurgitation of what ever is on the church website.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "As Christ told His apostles in Matthew 16:18 the gates of hell would never prevail against His church and of course it hasn't! Ron Rhodes does an excellent job in giving the history of the church and how it grew from a universal catholic church (catholic with a small c), to the Reformation, to today's denominations.The one thing that strikes me in reading Dr. Rhode's book is that all branches of Christianity agree on the essentials of the faith. Yes, they are disagreements on the non-essentials (the reason for all the denominations), but in essentials we have unity.One distinctive characteristic of the book is that Mr. Rhodes only includes true Christian denominations. You will notice that he excludes the likes of Oneness Pentecostals, Mormons, and Jehovah's Witnesses. In other books on Christian denominations you will see these cultic groups included.One critique I have of the book is that Mr. Rhodes seems to present the pre-mill dispensational rapture view as if it were the one true view. You will notice how he lists this view several times and lets it stand alone, as compared to placing it alongside other views in a chart (e.g. partial preterism, or progressive dispensationalism, which are never even mentioned in his book).Overall though this is a must book for those who love the history of the church!Patrick Foss",
                "review/helpfulness": "6/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "upon this rock st peter and the primacy of rome in scripture and the early church modern apologetics library",
        "description": "Ray, a former Evangelical Protestant and Bible teacher, goes through the Scriptures and the first five centuries of the Church to demonstrate that the early Christians had a clear understanding of the primacy of Peter in the see of Rome. He tackles the tough issues in an attempt to expose how the opposition is misunderstanding the Scriptures and history. He uses many Protestant scholars and historians to support the Catholic position. This book contains the most complete compilation of Scriptural and Patristic quotations on the primacy of Peter and the Papal office of any book available. It has over 500 footnotes with supporting evidence from Catholic, Orthodox, Evangelical, and non-Christian authorities.",
        "authors": "['Stephen K. Ray']",
        "infoLink": "http://books.google.com/books?id=RnQiVgUn728C&dq=Upon+This+Rock:+St.+Peter+and+the+Primacy+of+Rome+in+Scripture+and+the+Early+Church+(Modern+Apologetics+Library)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Stephen K. Ray does an excellent job of presenting the scriptural and historical case for the papacy. He writes clearly and well. I would like to make a point about a book mentioned in the review by the Eastern Orthodox gentleman, namely Brian Tierney's &quot;The Origins of Papal Infallibility&quot;. Moved by that review I read Tierney's book. Brian Tierney, though a good scholar, has an axe to grind, specifically a liberal Catholic axe. I am surprised that an Eastern Orthodox person would commend the arguments of Tierney, since Tierney obviously is against not just PAPAL infallibility, but ALL infallibility, including the infallibility of Ecumenical Councils and the infallibility of the Church herself, both of which doctrines are believed in by the Eastern Orthodox. Tierney, as a liberal, does not believe that the Church can definitively commit herself to truths. In other words, he rejects the possibility of dogma. Essentially his position is that of Hans Kung.The mistake that this Eastern Orthodox reviewer makes illustrates a basic problem with attempts to interpret the historical evidence in an Eastern Orthodox or Anglican way: these via media are self-destructive, as Newman realized. The Orthodox accept the hierarchical authority of bishops and the infallibility of Ecumenical Councils. But the scriptural evidence and the evidence from the ante-Nicene Fathers is stronger for the papacy than for the authority of Ecumenical Councils. One can pick holes in the evidence for the papacy, but only by using arguments that ultimately can be used even more effectively against other doctrines that the Orthodox would wish to uphold. Protestants have the same problem: the same arguments that are used against the papacy can be turned even more effectively against the New Testament. To return to Ray's book, I recommend it very highly.",
                "review/helpfulness": "63/78",
                "num_reviews": 78
            },
            {
                "review/text": "Upon This Rock was a well written and thought out book. It gave all the sources that he used and helped me to understand the depth of the Catholic position. I do not agree with Mr. Ray's conclusion but now I realize I may well be wrong. I think one goal of this book was to defend the Catholic Church and show why the church claims the authority it does. I have to admit many of my presuppositions have been changed and his work has helped me understand and even respect the faith of Catholics that much more.",
                "review/helpfulness": "53/54",
                "num_reviews": 54
            },
            {
                "review/text": "After reading opinions by James White and William Webster on the same subject, I thought I'd been given the full truth. But Mr. Ray's further, deeper development on White's/Webster's study showed me that I had only been given an incomplete story. What else about the Protestant faith is only \"partially\" developed ? Mr. Ray's presentation is overwhelming. One particular nugget in the goldmine of truth was not detailed in the New Testament, Old Testament, or the Church Fathers. It was a geography lesson on Caesarea Philllipi. It had never dawned on me what a long journey this was for Jesus and his disciples. The significance of the journey and the rock have come into focus!I am now dedicating myself to learning what other partial truths have been developed fully by the catholic church.",
                "review/helpfulness": "41/42",
                "num_reviews": 42
            },
            {
                "review/text": "The discussion was excellent in that it chronicled the Office of the Papacy both in Scripture and in history. It is an excellent source book and demonstrated excellent research techniques especially in the Early Church Fathers documentation and reference. There are a great deal of footnotes, but unlike some books, these footnotes are very readable and useable either in a discussion as a Catholic Christian Apologist or as a bibliography in a paper. I highly recommend this book.",
                "review/helpfulness": "37/39",
                "num_reviews": 39
            },
            {
                "review/text": "As a Catholic convert of just two years I had much to learn about the history of the universal church of Jesus Christ. Many doctrines were still hard to accept after my conversion, however, with books like that of Mr. Ray's, Mr. Hahn's, Mr. Jurgen's and Mr. Lewis' I am shedding off my Protestant 'tendancies' faster than jaguars can sprint. WARNING: This book is for serious Bible and history-lovin' Christians only! This work is another 'must-have' for Catholic apologists. The only criticism that I had for this book is that it provided too much evidence for the Catholic position of the papacy. I was literally overcome by the mountain of truth which displayed itself in full technicolor within this book's covers! After reading this book, I will never 'see' the Holy Father the same way again. A positive look to be sure! Pax",
                "review/helpfulness": "30/36",
                "num_reviews": 36
            },
            {
                "review/text": "Stephen Ray, a former Baptist and now convert to Catholicism, tackles the heavily debated issue of the papacy. As far as Roman Catholic apologetics goes, this book is one of the best and is without a doubt the best Catholic book available defending the papacy. Ray begins his book by discussing the issue of whether Peter ever resided in Rome. Ray begins by analyzing the Bible verse I Peter 5:13 and illustrates how this enigmatic reference to Babylon can only be speaking about Rome. Ray argues for this primarily on two reasons: 1.) Babylon was a code word used for Rome and 2.) there were no recognized and documented Christian settlements in the actual city of Babylon. With this proof established Ray then begins to document references from the Early Church Fathers validating Peter's presence in Rome. His list is impressive and he devotes the first 100 pages of his book to prove that Peter was in fact in Rome. Finally, he deals with some of the comments made by other Christians who doubted Peter's presence in Rome. This includes wrestling with remarks made by John Calvin and other present day fundamentalists who deny this historic truth. I think Mr. Ray did an excellent job of making his case, my only complaint is that the belief that Peter resided in Rome has been established and believed by a majority of Christians, even non-Catholic ones. The only ones who still argue for such an erroneous position are virulent fundamentalists who dislike everything Catholic.In the second half of his book, Mr. Ray attempts to prove that the Papacy was in fact granted a historical and successive power of jurisdictional rule. I think Ray does a good job of arguing for such a concept, but that his argument isn't airtight and is not a slam dunk case. First, his quotations from the Early Church Fathers are selective, and he doesn't do a good job of clarifying the context from which those quotes are taken. Second, Mr. Ray does not truly take William Webster's argument to heart because Ray never attempts to prove that the modern understanding of the papacy is the same as it was in the Early Church. Relying on an argument from silence will not work because the argument from silence could just as easily support the opposing position. What is needed is positive proof that the Fathers believed that the Bishop of Rome was the ruling Bishop supreme over the rest of the Church. In fact, I think a vast majority of Ray's proof-texts could just as easily fit in with an Orthodox understanding of the Bishop of Rome as the the bishop with the primacy of honor, and a limited role in singly defining Church issues. Finally, Ray weakens his case by not dealing adequately with all of the evidence that disproves his case. In the beginning of the book he says that no Church Father ever questioned the Pope's authority to intervene in local Church affairs, but Cyprian and Augustine did do just this. Cyprian would not abide by Pope Stephen's demands and showed that some Bishops did question the Pope's rights thus disproving Mr. Ray's assertion. Lastly, Ray does not even mention documents like the letter of Gregory the Great to the Bishop of Constantinople that completely disprove his argument. In this letter Gregory of Rome says that no bishop should be made a bishop above bishops because to elevate oneself to this rank would make all other bishops no longer bishops. Yet, this is exactly what the Gregorian Reformes did when they made themselves Universal pontiff over the entire Church, thus strictly contradicting what Gregory the Great, a previous Pope, had said.All in all, this work is a great work for any Catholic who wants to understand the historical roots and reasoning for the papacy. The case is well argued for, well developed, and well documented. Nevertheless, this book still contains some serious weak spots and is not as air tight and concrete as some would like to maintain. To understand both sides of the argument read this book in conjunction with William Webster's, The Matthew 16 Controversey. By reading both books I think the reader will be able to understand both sides of the argument and make an informed decision on their own.",
                "review/helpfulness": "28/35",
                "num_reviews": 35
            },
            {
                "review/text": "Matthew 16:18 has long been one of the most disputed verses in Scripture between Catholics and Protestants. From the Catholic perspective, this verse points to the office of the Pope where Jesus grants divine authority to Peter and his successors. Obviously, this interpretation does not sit well for Protestants who deny this authority. But do Protestants correctly interpret this verse as well as other verses regarding the Papacy? The answer is no and this book will explain why. The office of the Pope will come alive for you as the author takes you through the Old and New Testaments as well as the writings of the earliest Christians outside of biblical times. The author left no STONE unturned (pardon the pun) as he methodically destroys any attempt to disprove the Papacy in Scripture. An insightful book and a must read for both Protestants and Catholics. Reviewed by Gospel Truth.",
                "review/helpfulness": "29/34",
                "num_reviews": 34
            },
            {
                "review/text": "Stephen Ray's book, Upon This Rock, is the most comprehensive book I have read on the subject of the position the Bishop of Rome holds in the Christian community, even if some do not recognize that position. It is the most thoroughly documented discussion available on the primacy of Peter in the early Church, and the primacy his successors in office have in the Church today. This book belongs in the library of every thinking Christian, Catholic or not.James H. Dobbins, Ph.D.Author of Take My Hand",
                "review/helpfulness": "27/31",
                "num_reviews": 31
            },
            {
                "review/text": "I commend Stephen Ray for his efforts in assembling such a complete book on the Papacy. The use of Patristic sources is impressive. Mr. Ray has done a professional job in presenting and demonstrating the Papacy as an undeniable Truth of Christ's Church. He has done a masterful job in pointing out the errors of opponents. This is a great resource for anyone wanting a fuller understanding of the Papacy. In addition, the efforts taken to obtain an Imprimatur gives proof for the reader that substance and truth have the highest priority.Well done Mr. Ray!",
                "review/helpfulness": "23/26",
                "num_reviews": 26
            },
            {
                "review/text": "Regarding the &quot;review&quot; FOLLOWING this comment:It is interesting that often people either read a book and completely fail to follow the discussion or miss the point all together . . .. . . or, they really didn't read the book in the first place.In any case, the following reviewer from Steubenville would do himself and others a service and a favor by reading the book first, or if he or she actually did read it, at least try to understand and follow the argument and not leave a misleading &quot;review&quot;. The comments made by the Steubenville reader proves he is either misleading, failed to read the book, or completely failed to comprehend the content.",
                "review/helpfulness": "19/24",
                "num_reviews": 24
            }
        ]
    },
    {
        "Title": "the orthodox church",
        "description": "The readable, deeply authoritative and bestselling book on the Orthodox Church, in a fully updated and revised Third Edition. 'Orthodoxy claims to be universal . . .' Since its first publication fifty years ago, Timothy Ware's book has become established throughout the English-speaking world as the standard introduction to the Orthodox Church. Orthodoxy continues to be a subject of enormous interest among western Christians, and the author believes that an understanding of its standpoint is necessary before the Roman Catholic and Protestant Churches can be reunited. In this revised and updated edition he explains the Orthodox views on such widely ranging matters as Ecumenical Councils, Sacraments, Free Will, Purgatory, the Papacy and the relation between the different Orthodox Churches.",
        "authors": "['Timothy Ware']",
        "infoLink": "http://books.google.nl/books?id=9otPEAAAQBAJ&dq=The+Orthodox+Church&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is the best single-volume introduction to Eastern Christianity currently available. Bishop Ware's approach covers virtually all aspects of the Eastern Church -- history, theology, sacramentality, church organization, and the Orthodox diaspora with a special emphasis on rendering Orthodoxy comprehensible to Western Christian readers. Ware's approach is very ecumenical, and he frankly and even-handedly addresses the issues that unite and divide the Christian East and West. Because of his own dual background as a Westerner (he teaches at Oxford) who chose to become Orthodox, Ware is particularly well-situated to explain the wondrous and beautiful mysteries of Eastern Christianity to Westerners. While the book is in the nature of a broad overview, it actually covers the issues addressed in an impressive level of depth. The bibliography is also a great starting point for further reading and research, broken down helpfully by topic. This book is a must-read for anyone wishing to acqaint themselves with the riches of the Eastern Christian tradition.",
                "review/helpfulness": "159/164",
                "num_reviews": 164
            },
            {
                "review/text": "As a Non-Orthodox Christian, I found Timothy Ware's edition of the &quot;Orthodox Church&quot; very helpful in coming to glimpse with the historical and doctrinal aspects of the church.Part One of this book displays a well-defined and compact discourse concerning the Early Church, the Church of the Seven Councils, and the struggling Church in a state of siege and persecution.Part Two makes evident the faith and worship of the Orthodox Church. In this section, Timothy Ware discusses the principles behind Orthodox Liturgy, the Sacraments, and God's relations with the individuals that constitute the invisible body of the Church. As a reader I discovered the the little things that engendered big friction between the East and the West. Also I found valuable information about the rise of communist Russia, the internal and external dissent between Orthodox Churches during this period, and the prevalence of a faith that has remained nearly unchanged throughout the ups and downs of its long history.So I highly recommend this book for anyone interested in Church History, or for someone who simply wishes to look at the Orthodox Church from the pen of an Orthodox writter.",
                "review/helpfulness": "83/89",
                "num_reviews": 89
            },
            {
                "review/text": "After its latest revision, Bishop Kallistos (Timothy Ware)'s book no longer provides a good starting point for those generally unfamiliar with the original Christian Church, its history, and its doctrines. This revised edition shows signs of compromise with the general melt-down of bygone Christianity going on in Great Britain. For example, His Grace says that the question of female priests is seen by the Orthodox as an open question; one wonders what in the world he can be talking about, since there isn't a hint of this development in any of the sources of authority the Church understands as binding. (Can you say &quot;when Gehenna freezes over&quot;?) Here, he must be trying to appeal to the culture around him. Additionally, his approach to the lamentable ecumenical efforts in which the Ecumenical Patriarchate is engaged is deplorable: it is simply inconsistent with the Church's history for its hierarchs to participate in WCC events that include pagan prayers, etc., even if only as observers. A non-Orthodox who read this edition at my suggestion came back to me with the notion that Bishop Kallistos' teaching regarding the relationship among the various &quot;Christian&quot; bodies differed from what I had previously explained. That was true, since I had repeated the Church's nearly 2,000-year-old insistence that it is the one, true Way. In this regard, Bishop Kallistos' attempts to be &quot;understanding&quot; are simply going to mislead the heterodox regarding what they are missing (i.e., the New Testament fellowship of Christ). The unbroken witness of the Church disagrees strongly with his &quot;friendly&quot; opinions. (If it didn't, the decision of the New Romans in the fifteenth century that they would rather remain Orthodox and suffer conquest by the Muslims than apostatize to Papism in exchange for military assistance would make no sense.) In sum, this is not a good place to start someone who might be interested in joining &quot;the One, Holy, Catholic, and Apostolic&quot; (that is, the Orthodox) Church; as to anyone else, well, why do they need to know about the Church, anyway? This revision is a great disappointment. Get an earlier edition.",
                "review/helpfulness": "52/86",
                "num_reviews": 86
            },
            {
                "review/text": "&quot;The Orthodox Church,&quot; by Timothy (Bishop Kallistos) Ware, is (and has been for decades) the number one book in the English language on the Eastern Orthodox Christian faith. It appears on virtually all recommended reading lists and bibliographies. (Not surprisingly, the number two book is &quot;The Orthodox Way,&quot; by the same author.)The cover states that this title is &quot;a clear, detailed introduction to the Orthodox Church written for the non-Orthodox as well as for Orthodox Christians who wish to know more about their own tradition.&quot; I couldn't have said it better myself.This volume is divided into two sections. Part one covers the history of the Church from the beginnings at Pentecost through Byzantium (the Seven Councils and the Great Schism), then the conversion of the Slavs, the Church under Islam, the Russian Church, and on into the twentieth century. Especially sobering is the author's summary of events surrounding the eastern European Orthodox Churches under communism. Coverage of the growth of the Orthodox Church in North America helps explain the current state of things.Part two discusses faith and worship and covers such important topics as: Holy Tradition, God and humankind, the theology and structure of the Church, and detailed explanations of various components of Orthodox worship (including sacraments, feasts, fasts and private prayer). The final chapter, entitled &quot;The Orthodox Church and the Reunion of Christians,&quot; explains various views within the Church concerning the ecumenical movement and the World Council of Churches, and highlights dialogues with various church bodies including Roman Catholics, Old Catholics, Anglicans, and other Eastern Christian bodies such as the Coptic Church and the Armenian Orthodox Church.An extensive, annotated list of further reading, organized by topics, such as &quot;The Early Church and Byzantium,&quot; &quot;Orthodox Theology,&quot; and &quot;Liturgical Worship,&quot; will be extremely helpful for those who wish to dig more deeply into specific areas of interest.While this may indeed be the definitive introductory book on Eastern Orthodoxy, it would certainly be more accessible to readers with some background in the Bible, Church history, or with some experience in liturgical churches. As the author suggests at one point, there is no better introduction to Orthodoxy than to actually attend an Orthodox Divine Liturgy. Those who have attended Orthodox services (or who have been members of the Church for a while) are likely to be those who are most drawn to this excellent book.",
                "review/helpfulness": "66/71",
                "num_reviews": 71
            },
            {
                "review/text": "When Bishop Ware first wrote this book, which was around 1970, it was truly a useful introduction to the Orthodox Church for those who know nothing about the subject. Since then, it suffers the sad fate of familiarity. Most educated Orthodox that I have met have read it, including probably almost all Orthodox clergy that are literate in English, and it has been criticized considerably in some quarters since then, particularly the sections on Orthodox eschatology, the sacraments and ecumenism. Sometimes these complaints are unfortunately and unfairly leveled based on the fact that Bishop Ware is an Anglican convert.Given that Orthodoxy, by its nature, has no infallible living authority on what it teaches, there is going to be dispute over what is &quot;correct.&quot; I believe that Bishop Ware wrote this book mainly to explain his faith to other Christians, and it should be appreciated on that basis; it was meant to be a starting point, not a definitive explanation of Orthodoxy. It is a good place to start on the subject, rather than with the spate of books on Orthodox spirituality that have been in vogue in the last ten years or so. If that's what you want, I highly recommend it.",
                "review/helpfulness": "20/24",
                "num_reviews": 24
            },
            {
                "review/text": "The book opens with a forword by Fr. Thomas Hopko and it is best ignored when one starts to read this book. Fr. Hopko's forword praises Bulgakov and belittles Bulgakov, reflecting the ambivalent attitude towards Fr. Bulgakov in certain Orthodox circles.Ch. 1 &quot;The Church&quot;Ch. 2 &quot;The Church as Tradition&quot;Ch. 3 &quot;The Hierarchy&quot;Ch. 4 &quot;The Unity of the Church&quot;Ch. 5 &quot;The Sanctity of the Church&quot;Ch. 6 &quot;Orthodox Dogma&quot;Ch. 7 &quot;The Sacraments&quot;Ch. 8 &quot;The Virgin and the Saints in Orthodoxy&quot;Ch. 9 &quot;The Orthodox Church Service&quot;Ch. 10 &quot;Icons and their Cult&quot;Ch. 11 &quot;Orthodox Mysticism&quot;Ch. 12 &quot;Orthodox Ethic&quot;Ch. 13 &quot;Orthodoxy and the State&quot;Ch. 14 &quot;Orthodoxy and the Economic Life&quot;Ch. 15 &quot;Orthodoxy and Apocalyptic Thought&quot;Ch. 16 &quot;Orthodox Eschatology&quot;Ch. 17 &quot;Orthodoxy and the Other Confessions&quot;Ch. 18 &quot;Conclusion&quot;From this index it is clear that the book is a comprehensive study of Orthodoxy, covering a very broad range of the areas of life, in particular Orthodox life. Bulgakov takes the reader by the hand and takes the reader on a journey thru Orthodoxy. It is a book that one does not finish and lays aside, rather one reads it again and again and again,..It does not contain explicit reference to Sophiology, a doctrine with which Bulgakov's name will forever be associated. It is a book about Orthodox dogmatic theology with little reference to history, which has been treated by H.H. Kalistos Ware Bishop of Diokleia elsewhere (&quot;The Orthodox Church&quot;). For Fr. Bulgakov's sophiology one should turn to the trilogy &quot;The Bride of the Lamb&quot;, &quot;The Comforter&quot; and &quot;The Lamb of God&quot; of which only the first has yet appeared in English; and of course the small introduction to &quot;sophiology&quot; called &quot;Sophia: The Wisdom of God.&quot;The book is a powerfull and convincing testimony to the energy and life that is contained in Orthodox theology. The book allows one to grow deeper, and much more firmly in Orthodox theology; especially in the light of Western challenges to Orthodoxy.The book is best read as a companion, as a dogmatic travel-guide. Reading it is a journey into Orthodoxy in its dogmatic aspect (which must NEVER be separated from Orthodox praxis) re-reading it frequently is like &quot;tuning ones inner Orthodox instrument&quot; to make sure ones &quot;tone remains Orthodox.&quot; It is a book that will be of enormous help to become Orthodox and to continue to become Orthodox; for becoming Orthodox does not end in Baptism and Chrismation, it merely begins from there on and this book will nurture ones contineous Journey into Orthodoxy.&quot;All Christians who now discover the need of facing a new future, are beginning to understand the world importance of Orthodoxy.Does that future exist for the Church? Yes, for Orthodoxy is not yet achieved, either in fact or even in principle. Above Orthodoxy there is no other dome than the vault of Heaven. (..) It is Orthodoxy, and Orthodoxy only, which is the manifest and the hidden truth of all Christian confessions, divided now, but called to reunite in one flock under One Pastor, May God grant it!&quot;Get it, you won't regret it! ;-)",
                "review/helpfulness": "22/23",
                "num_reviews": 23
            },
            {
                "review/text": "There has been a great surge of interest in Eastern Orthodoxy in recent years. Partly owing to the turn towards liturgical worship and historic Christianity by disenchanted Evangelicals, many have explored this great Christian tradition with a sizable number swelling its ranks. Almost without exception, one of the starting points on any such journey is The Orthodox Church by Timothy Ware (now Bishop Kallistos Ware). Books listed as entry points for conversion are often polemical works but this is not the case here. Instead, Ware calmly states the position of Orthodoxy on issues facing the Church without any hint of rancor towards other Christian traditions. It is a mature understanding of the Faith of the Church that is Ware's greatest strength.The irenic approach should not lead one to believe Ware is indifferent towards ecclesial affiliations. It is quite apparent he holds Orthodoxy as the one true Christian Faith. However, this does not lead him to wholesale condemnations of Christians in other traditions, but rather a clear contrast of the Orthodox position to those of the Western Churches.Originally written when Orthodoxy had few converts in the West, Ware (who became Orthodox in 1958) gives an overview of Orthodox Christianity for those in the West who might find its beliefs and practices alien.Intertwining theological and historical developments in the Church, Ware gives a highly readable analysis of the development of Orthodox doctrine and spirituality. The book is divided into two parts. The first of these presents an Orthodox view of Church history. Beginning with the early Church and working his way through the Ecumenical Councils, the spread of Christianity throughout Europe, the Islamic conquests, the Great Schism, the witness of the Russian Church, and the tumultuous events of the twentieth century, he presents an enlightening view of the development of doctrine and worship that is free from the vindictiveness that plagues many treatments.The second part of the book is an overview of faith and worship in the Orthodox Church. Covering all the important aspects of the Orthodox faith, Ware gives clear expositions of Orthodox doctrine and points out the contrasts with Western Christianity - both Protestant and Roman Catholic. Included are such controversial topics as the role of tradition, salvation, and ecumenism. Ware never displays any animosity towards other Christians but insists that any union must be based upon truth and he believes this is held in its fullness by Orthodoxy.One criticism leveled at this book is Ware's supposedly superficial treatment of Orthodoxy. However, this charge is quite unfair considering the intended audience. The Orthodox Church was written for a Western audience with no prior historical connection to the Orthodox faith. Yes, there are works with more depth (including some by Ware himself), but these are likely to confuse Western Christians. This book may thus be considered as a prologomena for future studies in Orthodoxy. Coming from a Western Christian upbringing and now an Orthodox bishop, Ware has a firm grasp of how to communicate the Orthodox faith to a Western audience. The fact that so many prominent converts cite The Orthodox Church as a turning point in their spiritual journey is evidence to its effectiveness. As an introduction to the riches of Orthodoxy, Ware's The Orthodox Church is unsurpassed.",
                "review/helpfulness": "18/20",
                "num_reviews": 20
            },
            {
                "review/text": "If you are interested in a foundational understanding of the Orthodox Christian faith, start here. Father Ware does an excellent job in tracing the history of the Orthodox religion from the beginning days to the post-Berlin wall times. While some of the history is difficult to follow, it establishes an underpinning of why the Orthodox religion has endured virtually unchanged from the days of Acts.While the first half of the book deals with history, the second the the real meal here: Father Ware discusses the major tenants of what it means to be Orthodox. While his book didn't touch me as personally as Frederica Matthewes-Green's, it convinced me that there's much more to the Orthodox faith than I ever imagined.",
                "review/helpfulness": "18/19",
                "num_reviews": 19
            },
            {
                "review/text": "Bishop Ware has written an excellent text on the Orthodox Church. It is a solid primer as he deals with the history and the faith and worship of the church.The historical setting is solid and for the most part entertaining and interesting. He touches on the major highlights without overburdening the laity or reader who many are probably reading about this subject for the first time. After all, that seems to be the audience he is targeting.The second part, on faith and worship, is concise and simple. He throws in the major doctines of Orthodox beliefs in which they have in common with the rest of Christianity as well as some of the beliefs particular for this Eastern expression of the religion:i.e. essence and energies, apopthatic (negative theology), image and likeness. Further, he shows that this is not a monolithic movement in areas such as what makes up the Church.All the churches are mentioned and briefly discussed. Many saints are also mentioned and one comes away with a great appreciation of this historic Body of Christ.",
                "review/helpfulness": "17/19",
                "num_reviews": 19
            },
            {
                "review/text": "Timothy (now Bishop Kallistos) Ware's book, The Orthodox Church, is a comprehensive, detailed, yet easy-to-read analysis of the history of Christianity, and in particular of the Eastern Orthodox Church. Having read the book more than 5 years ago for the first time, it was instrumental in my understanding of Christianity from its roots and in my eventual entrance into the Orthodox Church. But more than that, I find it an invaluable resource for use in Christian education (Sunday school and adult catechetical classes). Of particular interest is the thematic approach which anlayzes the periods of persecution faced by the Church throughout history, from ancient Rome to the Ottoman Empire to Soviet Russia. The book is balanced in its treatment of many of the historical issues between the churches of East and West, and in general presents the reader with a robust fact base and insightful historical analysis from which to draw his/her own conclusions about the relationship between the various churches in modern Christendom. A highly recommendable book for anyone looking for a serious yet not too heavy journey through the history of the Church, whether Orthodox or heterodox.",
                "review/helpfulness": "14/16",
                "num_reviews": 16
            }
        ]
    },
    {
        "Title": "one holy catholic and apostolic the early church was the catholic church",
        "description": "\"Kenneth Whitehead shows in this book how, according to these same sources, the early Church was already in all essential respects the same Church as the Catholic Church of today. The Church consists of believers in Christ who profess her creed and are subject to the authority of her hierarchy, just as the first Christians accepted the preaching of the apostles chosen by Jesus and were subject to their authority (as can abundantly be seen in the Acts of the Apostles). The Church of Christ purveys both word and sacrament for the sake of the sanctification and salvation of her members through the ministry of ordained priests and bishops, all of whom are ultimately under the authority of the bishop of Rome, the Pope. All these things were also strictly true of \"the early Church\" - as demonstrated in this book.\"--BOOK JACKET.",
        "authors": "['K. D. Whitehead']",
        "infoLink": "http://books.google.com/books?id=5V1xelf69XAC&dq=One,+Holy,+Catholic+and+Apostolic:+The+Early+Church+Was+the+Catholic+Church&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book's focus is on the Early Catholic Church and covers five primary areas in five huge chapters (the book itself is a soft covered book of over 300 pages). The topics covered are 1. The Church of the Apostles, 2. The Church of the Early Church Fathers, 3. The Church of the First Four Great Councils, 4. The Primacy of Rome in the Early Church and 5. The Early Church Was the Catholic Church.This book is an excellent read, some of it being in story form which makes it an easier and more interesting read than some other apologetic material. It is strongly rooted in history, presenting historical facts to prove that the Catholic Church of today is a direct descendent of the Early Church of the time of the Apostles.I would recommend this book for anyone who is involved in Catholic Apologetics, or who would like to learn more about the Early Church. It draws upon a huge source of early Church literature, it develops a very interesting picture of the Early Church and ties them all together to give us the Catholic Church we have today.",
                "review/helpfulness": "86/90",
                "num_reviews": 90
            },
            {
                "review/text": "Keneth Whitehead historically based apologetic work on the early church, uses history to show the early church was in fact the Catholic church in all essential respects. I am writing this review to show how previous reviewers that maligned this book, on the basis of lacking footnoting is total bogus and has more to do with their own biases. I'm a former Graduate student in Political Science at the University of Central Oklahoma. Political Science scholarship often used Parethical text citation instead of footnoting. While it is true Mr. Whitehead's book does not use footnoting, his sources are well documented.The structure of the book is composed of four chapters and a conclusion.Chapter One is \"Church of the Apostles\". I hardly think footnoting is necessary when quoting the Apostle Paul the author merely documents this as (1 COR 10:17). Anyone even remotely familar with the Bible can recognize this.Chapter two is the \"Church of the early Fathers\" in which sources are identified in the text such as the classic historians like Eusebius Ecclesiastical History and early church fathers such as Ignatius. Ignatius only wrote seven letters around 107 A.D which are well known even among Protestants, and the book identifies which letter he is quoting from in each case. Anyone with even most limited knowledge of early church fathers can look up the author's references. Similarly when Emperor Constantine Edict of Milan is quoted from, the parethical reference is sufficient.Chapter three is on the \"Church of the Four Great Councils\"It includes lengthly quotes from Great Church council offical documents. Consider on Pg. 84 of this book being reveiwed, the author quotes a statement made by the Arian Emperor Constantius in 355 A.D as saying \"take my will for a canon\". This source is cited in the text as (St. Athanasius, History of the Arians, 33). There are many similar examples to this one. This argument about footnoting to attack this book is totally bogus and without foundation. It is made by people with their own biases and agendas.The reason is clear. The final chapter of book and much of the meat of the book on the \"Primacy of Rome\" in the early centuries is filled with historically damaging information. In particular, the documentary evidence is overwhelming (w/ Page Numbers!) of Eastern Christianity putting themselves to writing in Ecumenical councils recognizing the formal primacy of the Bishop of Rome despite what they and Protestants assert today.",
                "review/helpfulness": "37/40",
                "num_reviews": 40
            },
            {
                "review/text": "this book strength lies in its broad scope and in the blending of institutional history whith theological development and historical fact. Unlike many books of this kind, this one devotes considerable attention to the development of early Christianity. msujanto10@hotmail.com",
                "review/helpfulness": "22/29",
                "num_reviews": 29
            },
            {
                "review/text": "Despite some breathlessness and awkwardness, Kenneth Whitehead makes a very strong case for his contention that &quot;The Early Church Was The Catholic Church&quot; and that the Church today is distinctly similar to the Church then. While agreeing with Mr. Whitehead, I would argue that the Church since the Second Vatican Council bears far less resemblance to the &quot;Early Church&quot; than it should.",
                "review/helpfulness": "9/14",
                "num_reviews": 14
            },
            {
                "review/text": "I had purchased this book when it first came out, but just now got around to reading it. I thought it was going to be a rehash of Catholic apologetics that I pretty much have a handle on. This book would more appropriately be placed in the history section of your library. I already had a rudimentary knowledge of Church Councils and the various heresies, but after reading this book I am now more knowledgeable of how and why the Councils came about and why the heresies were so dangerous. Whitehead goes into quite a bit of detail on the Arian heresy and just how close Christianity came in denying Christ's divinity.Only if your mind is closed or you have axes to grind with the Catholic Church will you NOT come away reading this with a better understanding of what the early Christian Church was and give you a better appreciation of what the Church is now.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "The central premise of Kenneth Whitehead's 300+ page work is that, despite the protestations of \"reformers,\" the early church was indeed the Catholic Church. The author carefully takes the reader through the early centuries of the Church, exploring the development of the institution and hierarchy from the time of the apostles and the early church fathers through the four great councils, establishing the primacy of Rome from the earliest of times.The author's arguments are carefully laid out and full developed in a flowing narrative3, offering the reader a systematic exploration of doctrinal developments as well as evidence of papal primacy. One weakness, particularly for those of a more critical bent or for those with a greater intellectual curiosity, is the lack of footnotes to accompany the extensive bibliography. However, given the intended audience, this is a minor criticism, detracting only slightly from what is well-crafted prose. The combination of scriptural, doctrinal and traditional exposition provides a good overview of the Catholic Church's apostolic roots.",
                "review/helpfulness": "12/12",
                "num_reviews": 12
            },
            {
                "review/text": "Whitehead aspires to write for the common believer who wishes to have an introduction into the validity of the Church's claim to be \"One, Holy, Catholic, and Apostolic\" according to the Niceno-Constantinopolitan Creed. The text is a good introduction into this material, its development and history in Church thought.The number of names and heresies is nearly head-spinning if one does not have a great grasp on early Church history. Because of this, I think that an extra index should exist with the names of the individuals written about along with a brief explanation of their stance (with textual cross references). Such cross-references would be nicely added to the already existing heresy index. This is mostly a nice addition, as an index does exist for the text.I must also agree with the complaints of other reviewers about the lack of footnotes. However, this is a minor issue, as the text is not meant to be technical but to be an apologetic help.I think the text is good for all who want to have a better view of the early Church and do not have a thorough knowledge thereof. It is an easy read, although a bit factually overwhelming for the non-historians, even if you are somewhat-experienced in theology. The author can be a bit pedantic, reminding the reader that what he is writing supports his thesis and also is a bit heavy on the proof for the primacy of Rome in the early Church, while neglecting other topics related to the creedal formula. Nonetheless, I suggest this book highly, as stated above!",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the emergence of the church context growth leadership and worship",
        "description": "The early church did not descend from heaven on a golden string. Nor did it spring full-grown from the mind of Jesus or the apostles. The church emerged as the result of God's decisive action within a particular people, Israel, their story and their historical context. The focal point of this action was Jesus--his ministry, death and resurrection. But there were challenges, setbacks and conflicts, as well as bursts of understanding, expansion and growth. While the main lines of this story display a remarkable unity, a closer examination also reveals a living diversity of cultures, perspectives and practices. InThe Emergence of the Church Arthur G. Patzia explores the story, weighs the issues and traces the contours of the early church's expansion and growth, life and practices, leadership and worship. He offers both a panoramic introduction to the church as it was in the first century and a foundation for considering how it should be in the twenty-first century.",
        "authors": "['Arthur G. Patzia']",
        "infoLink": "http://books.google.com/books?id=EzdPPgAACAAJ&dq=The+Emergence+of+the+Church:+Context,+Growth,+Leadership+and+Worship&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "Arthur G. Patzia's 'Emergence of the Church' combines New Testament background (what was Judaism like in first-century Palestine? What was life like in the Roman empire? and so on) with exposition of what the Bible says about the growth of Christianity. The book's sources are pretty strictly biblical: the Didache is dated at or beyond 100 (p.99), and discussed only at the fringe, and the clearly first-century ROTAS square (buried under the products of the volcanic eruption of 79) does not figure, even when Patzia comes to discuss (p.138) whether there were first-century churches in Italy outside Rome.If description and discussion of what the Bible says about the early Church is what you're looking for, this is a good book to choose. The ambience is distinctly Fuller, and here and there this brings up questions which would otherwise seem curious: Patzia notes (and he is right, as far as it goes) that 'there is no indisputable evidence in the Gospels that [Jesus] personally offered sacrifices in the temple during his public ministry' (p.186). All right, but what is implied here? That Jesus might have thought sacrifical cult wrong, or avoided it? Surely not likely, when Luke (2.24) records his parents making the prescribed offering in the temple for him.Arthur G. Patzia is an intelligent reader of the Bible and a throughgoing expositor. His book deserves a wide audience.",
                "review/helpfulness": "16/17",
                "num_reviews": 17
            },
            {
                "review/text": "The title \"The Emergence of the Church: Context, Growth, Leadership & Worship\" well explains this book. It discusses the church as understood by Jesus, its growth from the death of Christ to the death of the apostles, and how it functioned (leadership, worship and certain doctrinal issues). It is introductory in scope, but hardly superficial. Particularly helpful is the integration of Paul's writings within the framework of Acts and the discussion of the growth of Christianity in the key cities of the Roman Empire.A few points are debatable: Patzia accepts many (or most) critical views on the dating and authorship of NT books, rejects infant baptism, and supports gender egalitarianism in ministry roles. And did Paul really teach a \"law-free Gospel\"?",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            },
            {
                "review/text": "There are aspects of the disarming way Patzia tells the story of the early church which are easy to miss, and they are significant. We used to think that the closer you got to Jesus the purer the Christianity, then it went wrong and the Reformers fixed it, though it is still necessary to restore the primitive faith.It is no accident that the Church in an age that values diversity sees its origins in a way it did not before and recognizes that this model does not fit reality then or now.Whereas once we may have assumed and sought signs of standardisation in the early church, now it is acceptable to recognise pluriformity. Patzia's declaration that \"there was no normative church in the first century\"(13) may challenge romantic views of Christian beginnings, and undermine some strands of Christian teaching, but it also implies that the early church was about change as well as about renewal and that in so doing it connects with global cultural experiences of Christian faith today. All churches are involved in navigating different responses to Jesus and sorting out which are authentic and which lead away from what has been established across time and culture.The way in which Patzia depicts the early Church as defined by its worship as well as by its geographical, cultural and religious context is also important. He explores how leadership roles developed and changed then as they do today. His approach is capable of engaging with churches who know that Christian faithfulness means taking their cultural and social heritage seriously, and who need to connect with the churches of the New Testament era as they seek inspiration for finding their way forward in a manner appropriate to their context.Of course an historical rather than a theological approach stands the risk of affirming fragmentation and ignoring the common themes. The questions in the conclusion \"Who are we?\" \"What are we to believe?\" \"What is our Mission?\" and \"How are we to live?\" indicate the author's underlying concerns. No doubt Christians in other global contexts will ask different questions from those in Northern California, yet this is profoundly permission-giving. If Patzia's hope that his readers might catch \"a glimpse of the church's expansion and what it meant to be a Christian - to be the church - in the first century\"(247) is realized, it could prove a liberating stimulus to church growth in vary varied circumstances.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a commentary on the divine liturgy",
        "description": "\"Nicholas Cabasilas' Commentary on the Divine Liturgy is a remarkable product of Byzantium's last great flowering of theology. The work has long been essential reading for specialists in the fields of comparative liturgy and history of liturgy, since Cabasilas comments in detail on the Byzantine rite of his day and is able to draw comparisons with the Roman liturgy as well. The work is also invaluable for all those who wish to understand more about the theory and practice of worship in the Orthodox Church. In this edition the text of the Commentary, translated by J. M. Hussey and P. A. McNulty, has been supplemented by a brief foreword which places Cabasilas' work in its historical context. A helpful introduction by R. M. French describes the celebration of the liturgy in the Orthodox Church.\"--BOOK JACKET.Title Summary field provided by Blackwell North America, Inc. All Rights Reserved",
        "authors": "['Nicolaus Cabasilas']",
        "infoLink": "http://books.google.com/books?id=TV2maSGvcnkC&dq=A+commentary+on+the+divine+liturgy&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This is a valuable book from the point of view of the theory and practice of worship in the Byzantine Church. For a student of Divine Liturgy this is a must read. The text of the Byzantine liturgy itself is not included in the book and the introduction provided by R M French helps in this direction. The book is outlined in six chapters explaining the meaning of every part of the liturgy. After reading this book the participation in the liturgy will no more be the same.Cabasilas was a layman who lived in the 13th century. He never attained high ecclesiastical office. Though he wrote a number of books including homilies and lives of saints, his fame rests on his 'Commentary on the Divine Liturgy'.",
                "review/helpfulness": "15/15",
                "num_reviews": 15
            },
            {
                "review/text": "St. Nicholas Cabasilas (really Kavasilas) is one of the outstanding Orthodox Theologians, who fortunately has been translated into English. This book takes the reader through the most awsome Mysterion of the Church - the Divine Liturgy, and the Holy Eucharist. The Orthodox Theology cannot be seperated from Liturgical Worship, and if you read this book, you will understand why. \"Life in Christ\" by St. Nicholas is also in English, and a primer on the Orthodox Life in Christ, with its clear, and yet very deep teachings of Purification, Illumination and Theosis. Both vols should be in every home library.",
                "review/helpfulness": "14/14",
                "num_reviews": 14
            },
            {
                "review/text": "I have read this phenomenal work three times and still get something new with each read. What amazes me, as a former Roman Catholic, is the fact that this 14th century commentary is still relevant to the Liturgy to which all Orthodox Christians are familiar. This would not be so for a 14th century commentary of any western liturgy, since they have changed so radically since then. The debth and profundity of this reading are astounding. Any Orthodox Christian who is serious about his faith and wants a fuller appreciation of the the rich liturgical tradition which is the hallmark of the Orthodox Church should read this book.",
                "review/helpfulness": "11/11",
                "num_reviews": 11
            },
            {
                "review/text": "This is probably the best book available on Orthodox worship. It might not match the current liturgy exactly, and it might not be as extensive in it's treatment as some more modern liturgical texts, but whatever is lacking in this book is more than made up for in it's depth and profundity. St. Nicholas goes through the liturgy part by part to give a commentary on the fixed portions, compare and contrast western and east liturgical practices, and generally give a sense of what an Orthodox worship service *should* be like. This is required reading for just about all Orthodox Christians, but especially for those who struggle to pay attention during services and even find them boring. I am not saying that this book is going to make the liturgy seem like heaven on earth if you don't already get that feeling; but at the very least, this book shows you the rhyme and reason for all the various things going on during a liturgy.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            }
        ]
    },
    {
        "Title": "being the body",
        "description": "The body that Robyn Henderson-Espinoza inhabits is a nonbinary body, a trans body, a body in two races--and a body continually in discovery. Theirs is also a body on sojourn invested in experience, body understanding, and engagement in and for human thriving. Henderson-Espinoza relates coming into a new body story, beginning with the deep emotional work of connecting the abstract intelligence of their mind with their body's intelligence, to explore the relationship between living and becoming, doing and listening. Combining that deep listening and living with their work in activism, Body, Becoming offers us a way of understanding the body beyond constructions--political or medical-industrial-complex defined--toward cultivating the body as important in our endeavors to build a more inclusive vision for democracy. Mixing memoir and faith, somatics theory and body practice, Henderson-Espinoza steers us through territory both familiar and difficult--as we discover embodiment as the primary place of deep wisdom, where culture shifts originate and materialize--and a better world becomes, as we too become.",
        "authors": "['Robyn Henderson-Espinoza']",
        "infoLink": "https://play.google.com/store/books/details?id=-Qw3EAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "Like his other book, How Now Shall We Live?, Colson argues brilliantly and convicingly for a Christian worldview. This book is not perfect and I have my disagreements with him on several issues, which I will voice later, but this was extremely edifying to the saints.He has divided the book into three parts: What is the Church? The Church against the World. The Church in the world. Interspersed between each theological/practical chapter is a chapter on how the church triumphed over Communism. In part one Colson gives a convicting definition of the Church, that is, the Church is the believers, not the pretty building down the street. Here he argues for unity between denominations and points how such unity enabled the Church to rise above her oppressors in the past and empowered them to proclaim a dynamic Christian witness. In part two he lays bare the nature of Truth. Truth is propositional. As Francis Schaeffer put it, &quot;we must argue for 'True truth'&quot;, that is the truth that is found only in Jesus Christ. And in communicating this truth we must show the postmodern world that their worldview cannot match up to reality, only Christianity can. And when the Church proclaims this truth against the tide of the world, society is transformed (expressed brilliantly in chs. 19-20). In part three Colson gives an outline on when the church has properly equipped the saints in modern day times the surrounding community is transformed. Also of interest to the reader would be the new stduy guide and recommended reading list at the end of the book.Final Analysis:This is one of the top five books I have ever read. Here are my faults with it. I am a thoroughly reformed protestant and I am very uncomfortable on the Evangelicals and Catholics Together Doctrine. What are we, Reformers who desire to change culture, to do with union with Catholics? Is there any reconciliation? Here is what I propose to my Protestant and Catholic bretheren: We cannot reconcile our views on justification; let us leave it at that and unite in the public square, not the spiritual square. I say this with utmost respect to my Catholic brethren. May God uses this book for His Glory!Soli Deo Gloria",
                "review/helpfulness": "23/25",
                "num_reviews": 25
            },
            {
                "review/text": "With this book, Chuck Colson and Ellen Vaughn update their previous classic work about the Christian church (The Body). This version is even more powerful than the original, and it covers some new ground that is worth exploring. For instance, the event of 9/11 and how the Church reacted to them is described at length. Colson and Vaughn are right on when they argue that the Church was truly fulfilling its mission after this tragic event by showing God's love in our modern world. As many Christians are well aware, somehow we have once again lost the momentum (and possibly our direction) of that season. This book looks at possible reasons why we have returned to a normal state despite the fact this country experienced events which &quot;forever changed the face of our nation&quot;.Of course, the scope of the book goes well beyond the Christian church in the USA, and the events of 9/11. It looks at the Church around the globe, and covers how the church has succeeded or failed throughout history. In fact, some of the more interesting stories and examples come from outside the US, and deal with events from other eras (the reformation, and WWII). I also like the fact that the authors use many examples from the Catholic church to demonstrate that they too are members of the body, and have made an enormous impact throughout history, despite their challenges (to include the current crisis).Just like the original version, this book challenged me to take a hard look at my own faith, and my role within the local church. For those who feel that Christianity is only a personal experience, I challenge you to read this book, and discover why our participation at our local church is so vital to the Body of Christ. Hopefully, this book will help change your mind, and get you involved with Gods people as they try to bring light into today's dark world.I highly recommend this book to any Christian who has not read it. More specifically if you are looking for a detailed analysis of today's church - this book is it. Also, if you have read The Body, it is worth the time and effort required to read this version. More than half of the material is new. The updates are of the same high quality as the original and result in an even stronger and more comprehensive look at The Body.",
                "review/helpfulness": "21/21",
                "num_reviews": 21
            },
            {
                "review/text": "I received the hardback edition of this for a Christmas present. Because it is over 500 pages long, I put off reading it for almost 18 months. When I got to it, it actually went very fast. In reality it was not a technical book, just a detailed one.The authors present practical and theological concepts of the Church as One Body in the world. Extremely articulate and comprehensive in scope, this book is still an easy read. Though writing in a novelesque narrative style, Colson and Vaughn present an excellent correlation of readable and engaging information from various disciplines: politics, theology, history, sociology, art and culture.A long chapter 17 details the persecution of Christians in Communist Europe, and their part in the fall of Communism in 1989-90, in making that happen. The authors provide a good ideological summary of the streams of thought and activity in the Protestant Reformation, including the foundations of modern science, critical scholarship and technological development laid by early Protestant leaders.I was glad to see the strong pleas for practical unity, but the authors retain the more doctrinaire neo-gnosticism that has become common in some biblicist circles, as they still maintain this must be built on a foundation of strong evangelical intellectual concern for \"correct doctrine.\" This sounds like Colson's contribution, as it is similar to language I have heard him use before about \"propositional truth.\"The book also draws strongly on Catholic sources, and gives a good coverage to Eastern Orthodoxy, particularly in regard to the faithful suffering of Christians under Communist regimes.The work surveys current areas of Christian persecution in the world. The book is more prophetic than I expected in speaking to the \"evangelical\" church and its common foibles and failures.",
                "review/helpfulness": "7/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "sketches from church history",
        "description": "This popularly-written introduction to church history takes the reader from the early Church Fathers to the days of the modern missionary movement.",
        "authors": "['Sidney Maurice Houghton']",
        "infoLink": "http://books.google.com/books?id=lAV9QgAACAAJ&dq=Sketches+From+Church+History&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "S.M. Houghton's book on church history was a book that was first given to me while I was in college. I skeemed through it but found it to be boring. My reading was very limited back then. But after picking up this book again and reading it afresh these many years later, I found Dr. Houghton's work to be a great understanding of church history.Dr. Houghton takes his reader from the foundation of the Church by the Lord Jesus Christ at Pentecost (Acts 2) to the early 20th century. He shows the ups and downs of Church history from the corruption of the Church by the Roman Catholic Church to the Reformation under Martin Luther. He has particular focus on the Puritans and their influences on the Church in America. The book has a negative view of Arminians (with the exception of John and Charles Wesley) but the reader must make their own opinions about these matters.For those desiring a Reformed, Evangelical view of Church History you will find this book a wonderful resource. A must read for true disciples.",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "I've found this book to be the best summary of church history I've ever used, not only because it is concise, but because it is written as story, and is therefore interesting. Excellent scholarship combined with a gift of the use of language, and church history becomes a living thing. The copious illustrations add immensely to the value of the book as well.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "Have read this book a few times and always get something out of it that I missed the first time.A good book for the average person to read to get a glimpse of church history...very interesting comments made about Islam especially with the present climate regarding that faith....and eye opener to read that Islam was used to bring discipline on the church. I would recommend to anyone that would like to know how the church has been, from the beginning, on through the Crusades, the Reformation, the split in the church between the East and West up to the time of Spurgeon. Interesting also to know a little of the history of the Baptists, the reformers, the Methodists and also the persecution of the church down through the ages. All in all, a very informative and easy to read book on our faith.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "anglicanorthodox pilgrimage",
        "description": "Explains why so many Episcopalians/Anglicans are taking a harder look at the Orthodox Faith.",
        "authors": "['Franklin Billerbeck']",
        "infoLink": "http://books.google.com/books?id=2kLLAAAACAAJ&dq=Anglican-Orthodox+Pilgrimage&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "This book(let) has been a big disappointment for me. I finished the 71-page compilation in one evening. It contains 7 testimonies of former Evangelicals and Anglicans who 'converted' to Orthodoxy and the emotional, theological, and social difficulties of their becoming Eastern Orthodox.While Conciliar Press puts out some very good titles, I felt that this print was just a random collection of people's stories. Some of the stories are really out of date (about their struggles in the mid 70s) and related to the changes in the Episcopal Church USA in the 60s and 70s. Some of the stories were merely based on emotional warm-fuzzes. Reading many of the stories I felt that the authors' 'conversion' was not substantiated by concrete theological, liturgical, or historical arguments.The exceptions to the overall tone of this compilation are the last two 'conversion' stories: \"Excess Baggage\" and \"A Reluctant Journey.\" I learned just as much about the Episcopal Church as I did about the Eastern Orthodox Church and had quite a few things to underline. As a Christian and an Evangelical Protestant I have a great admiration for the Eastern-rite liturgy, the Orthodox faith, and the Orthodox believers. This book helped very little in justifying a 'conversion' within Christianity from one church to another.I wish I could have given it more stars.",
                "review/helpfulness": "4/6",
                "num_reviews": 6
            },
            {
                "review/text": "ANGLICAN-ORTHODOX PILGRIMAGE is a collection of seven personal testimonials by ten people, some clergy and some lay, who left the Episcopal Church of the United States of America (ECUSA) and its Anglican tradition for the Orthodox Church. The book is quite short, a mere 67 pages. However, it is still interesting and, though published in 1993, quite pertinent to the current situation in ECUSA.The first essay by Father William Olnhausen talks of the pain of leaving a comfortable position as an Episcopalian priest and the great joy of entering a more satisfying spiritual tradition. Olnhausen's essay is more on the virtues of Orthodoxy and what it has to offer than criticizing Anglicanism, which he is hestitant to do. Olnhausen ends with a note to those who decide to remain Anglicans, explaining that they still have his friendship and love. The following essay by Mary M. Stolzenbach \"Taste and See\" is the most insubstantial of the writings here, offering little theological argument, but charting her disappointment with modern Anglicanism.The third essay is a letter from three lay Episcoplians explaining their decision. It is by far the most interesting essay for those considering abandoning ECUSA in these current times. The three laymen, Henry and Leaella Shirley, and William Draper, show specific examples of what they consider apostasy and how it has made Anglicanism cease to be a viable option. These include the unilateral decision to ordain women without the consent of other catholic \"branches\", the sanctioning of abortion, the condoning of sexual relations outside of marriage, the revision of liturgy and hymnody for the sake of \"inclusiveness\", and the failure to censure clergy when have denied points of the Nicene Creed. While this letter was written in 1988, it is still quite striking to contemporary conservative Anglicans. The letter reminds us that these current problems are nothing new, that they were already present with Bishop Pike in the 1960s and Bishop Spong in the 1980s. \"The more things change...\"Dr. Kent and Dena Berquist's \"From Kansas to Constantinople\" is another brief essay. Like Stolzenbach before, the couple came to Anglicanism only after exploring other Protestant options, and were similarly disappointed that the dream of Anglicanism does not match the reality. \"Finding a Home in the Eastern Rite\" by Father David Mustian begins with an apology for his transition from Anglicanism--as experienced in the great changes of the 1970s--to Orthodoxy and then discusses why the author thinks the Eastern Rite the better option for converts.Father John M. Reeves' \"Excess Baggage\" is the essay most critical of ECUSA here, and he sees the problems of Anglicanism as deriving from a flawed Western and modernist mindset. The author writes in a rather crotchety style, but does make some good points. Finally, Franklin Billerbeck's \"Reluctant Journey\" shows how one former Episcoplian swam the Bosphorus and yet maintained good relations with the members and priest of his former parish; it will certainly instill hope in those hestitant about the change.While the book is very brief and offers little in the way of sophisticated theological argument, I think that ANGLICAN-ORTHODOX PILGRIMAGE is still worth reading for those considering a move from Anglicanism to Orthodoxy. It's a pity an expanded version has not appeared, for this movement has in recent years grown ever larger and many new cases could be examined.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            },
            {
                "review/text": "This thin book was a quick little read. It chronicles the pilgrimage of ten people to the Eastern Orthodox Church. Its similar to other books I've read and reviewed. However, this one I found kind of dissapointing. Each of the writers seems to rant more about their extreme dislike for their former Churches rather than a Love for their newly adopted Church. Eliminate the negative and emphasize the positive.",
                "review/helpfulness": "3/3",
                "num_reviews": 3
            }
        ]
    },
    {
        "Title": "coming soon unlocking the book of revelation and applying its lessons today",
        "description": "Is there a book of the Bible more often discussed and yet less understood than the Book of Revelation? The \"seven seals.\" The \"dragon.\" The \"beast.\" The \"sea of glass.\" The fantastic imagery found in the Book of Revelation has long captivated Christians but remains mysterious to many. In the midst of so much discussion about the end times, what does Revelation teach us about living in the present moment, with our eyes focused on the heavenly Jerusalem? Michael Barber's Coming Soon explores these questions by taking a detailed look at Revelation and its rich tapestry of prophecy, history, and biblical allusion. Barber explores the profound link between the Mass celebrated here on earth and the eternal reality of heaven, demonstrating that the Apocalypse reveals truth that has practical implications for today and points to a firm hope in tomorrow. Coming Soon is a verse-by-verse commentary on the Book of Revelation using the Revised Standard Version: Catholic Edition of the Bible. Barber provides a Catholic interpretation, which sees the liturgical background of this book of Scripture-a perspective missing in many Protestant commentaries.",
        "authors": "['Michael Barber']",
        "infoLink": "https://play.google.com/store/books/details?id=U6sTFBheOKwC&source=gbs_api",
        "review": [
            {
                "review/text": "As a Catholic Christian you only hear the Christian prospective on the \"end times, rapture, mark of the beast, the whore of Babylon, the four horsemen (not the wrestlers)...etc\". Catholic theologian Michael Barber has done an excellent job explaining what each on of these (and more) mean along with there implications in our life time. I highly recommend this book along with Dr. Scott Hahn's Lamb Supper. CATHOLICS: \"ALWAYS BE READY TO GIVE AN EXPLANATION TO ANYONE WHO ASKS YOU FOR A REASON FOR YOUR HOPE ...1 Peter 3:15-17",
                "review/helpfulness": "24/27",
                "num_reviews": 27
            },
            {
                "review/text": "The author gives a consistent commentary on the literal meaning of Revelation and a good explanation of the spirtual senses (i.e the loving moral view, a faithful analogical/typological view and a hopeful anagogical view.) Particular care for the liturgical elements in the book and their relation with the Divine Liturgy (the Roman Rite Mass) is developed and applied, showing the biblical basis for the New Testament Church's Liturgy.My only criticism of this book is that Mr. Barber sometimes doesn't develope the relationship between some things as strongly as I think the text indicates. For exmaple the releationship between Jerusalem and Rome in Revelation 17 is connected much stronger in my view than in Michael's.",
                "review/helpfulness": "20/24",
                "num_reviews": 24
            },
            {
                "review/text": "This is an engaging book, and one aimed at the general reader. Even if you do not have an extensive background in biblical studies, you will find this book easy to understand.In order to grasp what is going on in Revelation, it is necessary to know a little historical background. In the gospels, Jesus says very clearly that an apocalypse would occur and that those listening to him, \"this generation will not pass away till all these things take place\" (Mt 24). Yet the end time of the world did not occur within, say, the lifetime of John. So was Jesus mistaken? Other biblical scholars, such as Renan and Schweitzer, have indeed argued this.However, Barber offers an alternative view--a modified preterist view, in fact, and one which points to an end of one covenant and the beginning of a new one. He explains that Jesus was correct. The generation who was warned that the temple would fall within their lifetimes, did, indeed, see the temple fall. First in the body of Jesus Christ, who was crucified, and then, in the temple, when it was burned to the ground by the Romans in 70 AD.The destruction of the temple ended so much of what had been the old covenant forever with Israel. Gone forever was the Levitical priesthood, for in the temple were the documents proving the lineage of every priest. Gone forever were the sacrificial rites that the priests performed. Gone was the very center, the heart of Jewish worship.These would be replaced by a new chief priest, the pope, a new priesthood, now open to the gentiles, and a new system for the forgiveness of sin. As Barber explains, \"This brings us to the image of the Church as the Bride of Christ. Christ truly reproduces His life in the Church, so that the Church is the Mystical Body of Christ...as...in Ephesians 5 the Apostle Paul...writes, \"Even so husbands should love their wives as their own bodies. He who loves his wife loves himself. For no man ever hates his own flesh, but nourishes and cherishes it, as Christ does the church, because we are members of hiss body'\" (p 229).",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "I am a cradle Catholic that drifted away and later got involved in several Protestant denominations before feeling led to investigate Caholicism afresh and coming back. This book is very insightful and refreshing compared to all the protestant books I've read on the subject. Nice to get the perspective of the first 1500 years of Christianity instead of just the last 500. Makes it much more balanced and in my opinion much more logical sense than what protestants are putting out there.",
                "review/helpfulness": "13/14",
                "num_reviews": 14
            },
            {
                "review/text": "The book is an excellent study of the book of revelations. It is direct and to the point. It is easy to read and understand. My only concern would be that the study questions are not as thought provoking as I like in a bible study.",
                "review/helpfulness": "12/13",
                "num_reviews": 13
            },
            {
                "review/text": "The explanation of Revelation based on the authoritative interpretation of Catholic Biblical theology, using the whole Bible in unity and in light of Sacred Tradition without sensationalism inherent in \"dispensational\" Biblical exegesis. Interpreted in light of Jesus, not the latest news headline.",
                "review/helpfulness": "10/12",
                "num_reviews": 12
            },
            {
                "review/text": "As a Protestant evangelical, I have tried to make sense of Revelation using a number of approaches, without much success. Barber's Catholic-oriented commentary makes more sense than anything else I have encountered. Revelation is still problematic in my estimation, as far as its legitimacy as Scripture, but Barber offers coherent and persuasive interpretations of the book's message.",
                "review/helpfulness": "11/12",
                "num_reviews": 12
            },
            {
                "review/text": "My small group is currently about half-way through this book, and we are all enjoying it very much! Michael Barber does a great job going through what can be a confusing,frightening and often misunderstood book. A great study for either small groups or individuals wanting to learn more about St. John's Revelation.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "Finally a concise explanation of an often feared book of the Bible. It is great to have an interpretation of this book that reflects the teachings of the Catholic Church. After all of the misinterpretations from Proteatants, here is the explanation from the Church who wrote, canonized,and preserved this last book of the Bible.",
                "review/helpfulness": "10/11",
                "num_reviews": 11
            },
            {
                "review/text": "In depth, but easy to read and understand. I am presently studying the Book of Revelation for the 1st time - this breaks it all down and makes it easy to understand. The instructor of the study group saw the book I was referencing and quickly got herself a copy - she loves it too even though she has co-ordinated studies on this Book for years.",
                "review/helpfulness": "6/6",
                "num_reviews": 6
            }
        ]
    },
    {
        "Title": "the liturgical year",
        "description": "A journey of the soul through the map of Christian time. The liturgical year, beginning on the first Sunday of Advent and carrying through the following November, is the year that sets out to attune the life of the Christian to the life of Jesus, the Christ. What may at first seem to be simply an arbitrary arrangement of ancient holy days, or liturgical seasons, this book explains their essential relationship to one another and their ongoing meaning to us today. It is an excursion into life from the Christian perspective, from the viewpoint of those who set out not only to follow Jesus but to live and think as Jesus did. And it proposes to help us to year after year immerse ourselves into the sense and substance of the Christian life until, eventually, we become what we say we are-followers of Jesus all the way to the heart of God. It is an adventure in human growth; it is an exercise in spiritual ripening. A volume in the eight book classic series, The Ancient Practices, with a foreword by Phyllis Tickle, General Editor.",
        "authors": "['Joan Chittister']",
        "infoLink": "https://play.google.com/store/books/details?id=9cUpuAGhxyIC&source=gbs_api",
        "review": [
            {
                "review/text": "Dom Gueranger has written well of the \"Liturgical Year.\" He pulled all stops to study, document, pray and present to us the richness and fullness of our Catholic Faith and Tradition including many of our Saints and devoted people. These volumes are \"worth their weight in gold.\" If all knew what Abbot Gueranger is saying about the Church, ALL would be well! Enjoy",
                "review/helpfulness": "18/18",
                "num_reviews": 18
            },
            {
                "review/text": "These volumes written by Dom Gueranger are well written and a must read by every Catholic. Dom Gueranger was abbot of the great Benedictine monastery of Solesmes. He restored, almost single-handedly, the tradition of Gregorian Chant to its original purity and it can still be heard today at Solesmes and Fontgombault.Dom Gueranger's purpose in compiling these fifteen volumes was to arouse the faithful from their spiritual torpor by familiarizing them with the official prayer of the Church as developed in the liturgical periods of the year. The first part is devoted to Advent; the second contains the explanation of the divine service from Christmas to the Purification; the third takes us from the Purification as far as Lent and is called Septuagesima; the fourth comprises the first four weeks of Lent; the fifth consists of Passion Week and Holy Week; the sixth includes the Office of the Church from Trinity to the end of July; the eighth gives August and September, and the ninth finishes the year by giving the Liturgy of October and November.The year thus planned for us by the Church herself produces a drama, the sublimest that has ever been offered to the admiration of men. Cardinal Manning, referring to Dom Gueranger's commentary, called it \"a prelude to a better world and an avenue to the Vision of Peace\". I agree with the previous reviewer, these volumes are worth their weight in gold.",
                "review/helpfulness": "17/17",
                "num_reviews": 17
            },
            {
                "review/text": "No more fitting trumpet could greet Benedict XVI's motu proprio 'Summorum Pontificum' liberating the ancient Roman liturgy than this Saint Austin Press publication of Dom Gueranger's monumental Liturgical Year. The majesty of the great Benedictine's masterwork, its breadth, indeed its holy breath, are the components of a miracle in religious literature. It occurs to me that even as Gueranger rescued the great Abbey of Solesmes from disappearance, and Roman chant from degredation, he gifts the Church yet more magnificently by this work. If you want to understand from the heart what has happened in the Church over the last forty years, you only need read The Liturgical Year. On the forward side, the riches of this masterpiece will prove true food for many people newly shaken by their first encounter with the ineffable Roman liturgy, now burgeoning everywhere around the world. To read Dom Gueranger is to see the future. I've loved this work for years, most especially those supreme Sequences of Adam of Saint-Victor. Gueranger's scholarship is pierced with pungent content and spoken with monastic length-of-days assurance. It's a joy to read for learning, and for devotion, and the traditional Missal is its well-considered companion. The Liturgical Year is a singular work of art, learning and spirituality. Viva Saint Austin Press! Viva Gueranger!",
                "review/helpfulness": "13/13",
                "num_reviews": 13
            },
            {
                "review/text": "I can't believe I've lived this long without having had used these books. When you buy The Liturgical Year you are purchasing a family heirloom.",
                "review/helpfulness": "5/5",
                "num_reviews": 5
            },
            {
                "review/text": "I received this intimidating set of books for a Christmas gift at my own request about two years ago. And I was not disappointed - there are about 30 volumes, each filled with beautiful spiritual reflections and fascinating historical information about the development of the liturgy and the life of the Church.But there are two other reasons to purchase this book. The first is that this set illustrates the life of the Church in all of its breadth and depth - the Church is not your favorite priest, or the cause that you are most interested in, however important, or even your life and contacts. The Church is an ontological and historical force that brings forgiveness and grace to all men and women of all times. Immersion in the life of the Church is to be able to partake of its wisdom and charity at will and is a great treasure.Conversely, of course, there is no better way to sideline the distractions of the world, the flesh and the devil than immersion in the life of the Church. There is a saint for each day, far more holy people than our modern \"celebrities\" and much better role models. The contests between the reformers and the politicians of their era is far more fascinating than any modern-day glorified athletic contest with little value during or afterwards. And above all this book by its sheer depth and breadth opens up new worlds of saints and liturgical and pious traditions that the vast bulk of priests I am pretty sure are not aware of.As an added bonus, the book really helps with learning Latin, and this helps people of all ages, but will especially be helpful with kids preparing for SATs. After all, St. Therese of Lisieux immersed herself in this book growing up, so giving this book to kids will likely result in somewhere between a very good SAT score and eventual Doctor of the Church, much less all of the derivative benefits. This makes the book quite a bargain for its price.",
                "review/helpfulness": "2/2",
                "num_reviews": 2
            }
        ]
    },
    {
        "Title": "a people called episcopalians a brief introduction to our peculiar way of life",
        "description": "What are we as Episcopalians? This concise booklet explores five main areas of Episcopal life: identity, authority, spirituality, temperament, and polity. A great introduction to the Episcopal way of thinking in readable prose for any newcomer or seeker in the Episcopal Church who may wonder what makes Episcopalians different than Roman Catholics or other protestants.",
        "authors": "['Tobias Stanislas Haller', 'John H. Westerhoff III', 'Sharon Ely Pearson']",
        "infoLink": "https://play.google.com/store/books/details?id=CKlUBAAAQBAJ&source=gbs_api",
        "review": [
            {
                "review/text": "John Westerhoff does a splendid job of explaining the Anglican tradition and the Episcopal Church's connection to it in a small, reader-friendly book. It is especially useful for people who are coming into the Episcopal Church from other faith traditions, and the book's price makes it possible to order quantities for giving to newcomers. At a time when the Anglican Communion and The Episcopal Church are at ever-increasing odds, his work is a valuable reminder of TEC's roots and the faith that has grounded her for a very long time.",
                "review/helpfulness": "9/10",
                "num_reviews": 10
            },
            {
                "review/text": "This short book is a great introduction to the Episcopal way of thinking. Rev. Westerhoff does a great service to the reader by showing through his very readable prose what makes the Episcopal Church both Catholic and Protestant. For the Cathoic reader, one will immediately feel and understand the kinship of the Episcopal Church with the Roman one, and also appreciate the very fundamental differences in theological and speculative freedom offered by the Anglican approach. The Anglican Way is predicated on the three legged stool of scripture, tradition and reason - and Rev. Westerhoff used all three expertly in this little book to explain a People Called Episcopalians.",
                "review/helpfulness": "8/8",
                "num_reviews": 8
            }
        ]
    },
    {
        "Title": "the blessed hope a biblical study of the second advent and the rapture",
        "description": "Jesus Christ is coming again! That is the Blessed Hope which has since the earliest days of the Church energized Biblical Christians looking for the full revelation of God's redemption. The author sketches the history of interpretations of Christ's second coming and then carefully and lucidly examines the Biblical passages on which this doctrine is based. His conclusion is that the Blessed Hope is the second coming of Jesus Christ, not a pretribulation rapture that believers in a secret coming of Jesus. Yet he concludes that there should be liberty and charity within the Christian community for all who hold to the expectation of \"the blessed hope and appearing in glory of our great God and Saviour Jesus Christ.\"",
        "authors": "['George Eldon Ladd']",
        "infoLink": "http://books.google.com/books?id=dxqAd0ECsBgC&dq=The+Blessed+Hope+(A+Biblical+Study+of+The+Second+Advent+and+The+Rapture)&hl=&source=gbs_api",
        "review": [
            {
                "review/text": "In this higly readable study Ladd discusses the relationship between the rapture and the second advent of Christ. He studies the history of interpretation, starting with the second century church fathers, continues with the prophetic movements of the nineteenth and early twentieth century. Then he continues with some exegetical chapters. Without polarising, Ladd manages to set forth his thesis that the rapture of the church and the second coming of Christ are the same, indispensable event. Ladd takes by this a stand against dispensationalism but also against preteristic schools of interpretation. Highly recommendable, espescially for its tone-setting!",
                "review/helpfulness": "35/37",
                "num_reviews": 37
            },
            {
                "review/text": "As a Christian raised in the Pre-Trib Rapture tradition, I thought I was losing my mind when I found myself becoming more and more convinced that the rapture of the church COULDN'T take place before the tribulation. I found a copy of The Blessed Hope and was so thoroughly convinced and put at ease that I have never questioned the subject again. Ladd's scholarship is awesome, especially his revelation of the seamy early history of pre-trib teachings. After reading where this teaching came from, its a wonder that anyone can believe it!",
                "review/helpfulness": "20/22",
                "num_reviews": 22
            },
            {
                "review/text": "This book is a keeper for any pastor or teacher wanting to understand an eschatology different than the popular dispensational premillennialism. Ladd draws upon his extensive knowledge of Scripture and church history to define what he sees as the church's &quot;Blessed Hope.&quot; Obviously, he does not see that hope as a secret rapture of the church before seven years of tribulation. Ladd possesses a high view of the inspiration and authority of Scripture in this work. I recommend his book highly.",
                "review/helpfulness": "19/21",
                "num_reviews": 21
            },
            {
                "review/text": "The author is well-rounded in his theology - warning the church of the easy believism of a pre-trib rapture. This is my kind of book because he uses 'solid' scriptural reasoning to prove his points. If you're determined to believe in a pre or mid-trib rapture then this book is not for you, but if you want to read something that makes sense this is a good place to begin.",
                "review/helpfulness": "11/14",
                "num_reviews": 14
            },
            {
                "review/text": "The best thing about this book is that Ladd attempts to take Scripture, IN CONTEXT, and support what he believes Scripture teaches in regard to a post-trib rapture.Honestly, my main problem with the book is that I think it is too short. He is already very convincing, but with more detail, critique, and examination, it would have been even more stalwart. Probably a 4.3 stars.",
                "review/helpfulness": "6/9",
                "num_reviews": 9
            },
            {
                "review/text": "This is an excellent, scholarly presentation of the historic Pre-Mill view of the second coming. Well worth the reading.Rev. Eugene Potoka",
                "review/helpfulness": "5/7",
                "num_reviews": 7
            },
            {
                "review/text": "Ladd maintains that \"blessed hope\" (Titus 2:3) is not salvation from tribulation, but instead the promise of union with Christ when Christ returns in glory. Hope, so conceived, unites the believer with the Lord, who was acquainted with tribulation Himself. Still supportive of his own views that favor premillennialism, Ladd distinguishes pretribulationism as an unnecessary interpretation of Second Advent biblical and extra-canonical referents.Unnecessary as it might be in Ladd's opinion, yet pretribulationism garners controversy among Rapture-oriented Christians who debate what amounts to a 19th-century doctrine advanced by exegetes such as a Scot named John Darby. The author's stated intent is to dispose of the \"pre-trib\" element by authority of the canonical Scriptures without recourse to Tradition or the Fathers of the Church. However, the first chapter of this text remands so-called pre-trib proponents to texts of the primitive Church for her sense of the second Advent of Christ. Hope has a history of exegesis in ancient records such as the Didache, Shepherd of Hermas, and Dialogue with Trypho (St. Justin Martyr). Rightly so, Ladd identifies the absence of pre-trib interpretation in this history.With little more than the obvious that the pre-trib doctrine has no patristic roots, the book reaches a solid historical foundation in its second chapter. In chapter two, Ladd traces the 19th-century exegetical interest in futurism or what he also calls the prophetic revival. He captures what was a prevailing disgust in papism as symbol/sign of Christian unity among Western Christian futurists, and extends his review to contemporary 19th-century dissenters of the pre-trib doctrine. Noted dissent came from Dr. Erdman of the Moody Church, Chicago, among others.Ladd lost an opportunity to link the unity of the Church to eschatology, but in all fairness to the author that was not his project regardless the implications of 19th and 20th-century debates in chapter two to unifying Protestant Christians. The remainder of the text seals the fate of not only pre-trib dispensationalism, but also any doctrine of millenniealism as far as unifying the Church. The doctrines concerning the final events of the second Advent fail to unite Protestant Christians.There is another gem inside this book. Chapter six, \"Watch,\" refutes pre-trib arguments concerning the Day of the Lord. Central to the theme of the chapter is the meaning of watchfulness concerning the soul as opposed to vigilant anticipation of the day for Christ to return. Whereas Ladd's use of referents to watchfulness is congruent with primitive interpretations of the Day of the Lord, which are untarnished by pre-trib spins, he accomplishes little more than state the fact.Readers from across hermeneutic traditions will agree on one point. This text deserves a permanent place in the debates concerning the second Advent of Christ. For this reason, I recommend the text for careful study.",
                "review/helpfulness": "4/4",
                "num_reviews": 4
            },
            {
                "review/text": "I enjoyed this book, I have read many books on the origin of the pre-trib rapture teaching (personally I don't believe in any rapture, just the second coming of the Lord Jesus Christ) and unfortunately a lot of people become bitter and less than Christian in their enthusiasm.Mr. Ladd manages to give an accurate, historical overview of how the pre-trib teachings began without attacking anyone.I had never read any books by him before but will definitely read more of his material in the future. The man showed grace and class by sticking to the subject and not getting into petty name calling and finger pointing.To me he proves that when we obey the Lord and speak the truth in love, we can still speak the truth, we just don't have to lower ourselves to our enemies level.",
                "review/helpfulness": "2/3",
                "num_reviews": 3
            }
        ]
    }
]